{"id": 418497, "author": "piuslchua", "title": "Visio: Cardano NFT Analytics Tools", "url": "https://cardano.ideascale.com/a/dtd/418497-48088", "category": 26595, "amount": 47392, "description": "NFT adoption is a huge driver for blockchain growth. Unfortunately, Cardano does not have proper high-speed analytics platforms like in Ethereum to support it's NFT user base.", "f6_no_assessments": 8, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 386, "q0": "Visio: Cardano NFT Analytics Tools proposal looks to create an analytics platform to help NFT traders in the Cardano ecosystem. In the description of the solution the proposers provide images and reference to existing Ethereum services that provide the feature set that this proposal are looking to replicate for Cardano. The overall purpose is to give traders quick access to important data such as the floor price, transaction volume and history and then also graphs to make this easy to interpret. The proposal provides some statistics on the adoption of Ethereum focussed alternatives which helps to provide evidence there is a demand for applications like this. The risks provided are reasonable and mention the current market conditions, rate of NFT adoption, funding from catalyst and performance issues. It would have been great to have more specific risks on the implementation of the app based on the experience of the team and statements that provide more clarity on any key differences between Ethereum and Cardano that may be an issue. As an example, is data from oracles needed that are not present or is the data already all fully accessible? The proposal focuses on giving examples of what could be developed but it would have bene beneficial to state with more certainty of the exact feature sets that will be delivered in the first version so the impact can be more easily assessed. The feasibility section does help to shed more light on some of the exact features the proposers intend to deliver such as rarity processing, sales volume graph, mint volume graph, floor resistance graph and latest listing graph as some example modules. Overall there is evidence that an application such as this could create impact for the ecosystem due to the adoption in similar ecosystems, in future proposals the team could be more specific on exactly what they intend to build and the potential impact of these features to make it clearer to assessors and voters.", "q0r": 4, "q1": "For the execution plan five phases are presented. The first phase the team have already completed by deciding on the infrastructure to use for the application. The second phase of development & hiring with a list of some modules to be developed. Phase 2.5 concerns the marketing and further development. The team mentions the use of a life time NFT to help to raise funds for continued development. For phase 3 further development modules are mentioned such as a rarity sniper, floor sweep and whale tracking tools. Phase 4 introduces a subscription model. The progress plan seems reasonable and in a fair order. A budget breakdown is provided that outlines the manual labour involved and also the different costs associated with the project including marketing tools and infrastructure costs. Two core members are listed in the team. One professional link is provided but this link returns a 404. No other links are provided as evidence towards any progress nor any evidence that the proposers can execute this proposal. The plan and breakdown are reasonable however overall there is a lack of evidence on the background of the proposers or any existing evidence that are able to feasibly execute this proposal. The proposers are invited to submit future proposals with existing solutions executed, github links and professional profiles where possible to provide more assurances to assessors that they can feasibly execute the proposal. ", "q1r": 3, "q2": "In terms of tracking progress of the proposal the team mention the usage of Github for the community to audit what happens. The proposers did not provide a github link for the community to inspect and also have not mentioned which parts exactly will be public and open source if any. In terms of success the proposal outlines the a growing user base will be important and that NFT traders will only use the platform if they make them money. To improve this section the proposers could have provided more evidence they know which features are important for traders to make money and what type of metrics they will exactly track to prove whether they are meeting this objective. This would have helped the community more effectively know the proposers know what is important for this proposal to truly succeed by showing a comprehensive understanding of the most important features to track in their application based off their knowledge of alternative applications.", "q2r": 3, "assessor": "z_assessor_2073", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 9714, "q0": "The proposal presented identifies a clear problem with a solution that is closely aligned with the challenge. The team aims to build a high-speed CNFT analytics platform that will add value to the Cardano ecosystem through increasing adoption. Being involved in the CNFT space, I do agree that with the multitudes of projects being constantly released, there is a need for a CNFT analytics platform with the right user interface and analytics tools to assist investors and traders in their decision-making. As we are still in our infancy stages in Cardano NFTs, new platforms that can improve the user experience within CNFTs will not only drive growth but also attract more users. Investors and traders alike will have greater confidence in allocating their funds to CNFT projects because of the better-informed decisions this proposed project aims to provide. The proposer has provided information on the future challenges of the project, although ineffectually describes how they will solve them. This section is important for showing the team's effectiveness in overcoming hurdles in their project. It would have been more beneficial for the proposer to leave out the risks of ‘crypto winter’ and ‘no funding from Catalyst’ as these mentioned risks are relatively general and are most likely the risks of most proposals in this Catalyst challenge. The project’s risk of ‘performance issues on app’ was a suitable inclusion in the proposal as it was specifically significant to their project characteristics. The proposals other mentioned risk of ‘NFT adoption’ would have been improved if the proposer pivoted this risk to be more particular – an example could be ‘low user adoption’ and then explore how they would address this with aspects of their marketing strategy that would attract users onto their platform.", "q0r": 5, "q1": "The proposer offers a descriptive background of the team. Through the information provided, it is apparent that the team is competent in successfully implementing the project. Their skills and experience in NFTs are adequate and the diversity of each member's specializations demonstrates that they can accomplish the tasks outlined. The proposer has also provided a reference link to one member’s Linkedin profile to help support their professional background. The proposer addresses that they will be hiring engineers, indicating that the proposer knows, in an identifiable manner, the type and number of team members required to implement the proposal. Information provided on the budget is outlined clearly and broken down into identifiable items. The proposer has also provided information on how their pay rates apply by mentioning that the core team will be based in the Philippines. The detailed information that is shown on each item of the budget provides transparency on the requested amount and gives reassurance on the project's financial stability (if granted Catalyst funds). Overall, their budget seems reasonable to achieve the set goals. The proposer provides a clear and very informative plan that offers a realistic timetable to complete the work. A well-designed roadmap is included with well-thought-out phases providing a sensible and conductible plan for implementation. The first phase in their roadmap has already been completed - this indicates that the team is productive and reliable. There is clarity on what is being done and also by whom. The milestones and deliverables presented offer a structured vision and clarity to see the essential steps required for successfully implementing the proposal. Information on resources essential for implementation is described with the relevant explanation on ‘why’ it is needed. It is apparent through the information provided in the proposal that the team understands the technical aspects that are vital for successful execution. In regards to the future challenges and risks of the proposal, most haven’t been sufficiently addressed on how the team plans to mitigate them. Also, the challenges and risks provided weren’t very specific to the project and were more general to proposals on Catalyst overall. It would have been better to see the proposal provide information on challenges and risks that would directly and specifically impact their project with a solution that shows their ability to handle risk, commitment to the project and/or their ability to problem solve.", "q1r": 5, "q2": "The proposal shows good auditability, the team explains clear and thorough information on what success would look like. In addition, the proposal has a clear understandable description of the targeted problem that can be measured against the proposed outcome. The roadmap presented is detailed and very well designed. The milestones and deliverables were informative with each phase having a clear time horizon for achievement, making it easy to track progress. The proposer does not provide clear metrics or KPIs for evaluating the success of their project. Defining this is important for driving performance, providing focus and measuring their implementation. Information was provided on the team using Github – I’m aware that this enables access to metrics on task completion, progress and project statistics. Though, it would have been valuable if the proposer included some of the measures that are available on their GitHub to effectively help define and measures the progress of their proposal. For example, a metric on GitHub that could have been included could be the ‘number of unique visitors’, this metric can help the team measure how many people viewed their project – therefore giving them a way to track their community engagement. The team will be using GitHub, Discord and Twitter as accessible public channels for delivering updates to the community for auditing progress. ", "q2r": 4, "assessor": "z_assessor_3086", "no_vca": 6, "ne": 6, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 3469, "q0": "The motivation of this project started from the problem statement does make a lot of sense, as having the right tools to analyze NFT trades are essential to drive up its adoption in Cardano. Traders do use a lot of dashboards , graphical and data analyticis and not having one that encompasses CNFT may be hindering its growth. Having said that, proposal addresses the solution by creating this tool for Cardano, inspired by others from other blockchain that work well. It also fits well in the challenge as it created a product that will be built to increase Cardano (NFTs) adoption. It is directly connected to the 1st challenge kpi.\n\nAs for the proposal itself, it is very nicely articulated, brining data to prove his point on problem statement and explaining well the solution, with examples (screenshots from existing tool for other blockchain) that illustrate what he's talking about. The tool will be buit with aid/feedback from community and users which will have to improve its quality and UX. In this sense, I'd recomend proposer to adopt an agile framework (if that was not considered yet) because of its quick response to feedback and convenience to change features, specially considering it a sofrware development. \nThe risks identified are also sensible and their consequences are properly exposed. In addition, There's already a business model detailed, explaining how this product will be financially sustainable.\n\nAll in all, it is a project with great potential to develop a powerfull tool to increase cNFT adoption, aligned with challenge and well written proposal. My rate is 5.", "q0r": 5, "q1": "There's a very solid plan in place, with the phases well divided and their correspent duration. All the acitvities are properly explained on what and how will be done. It's excellent that a phase for marketing and community building is already included and its continous. It's also imporant to highlight that the 1st part of the project was already one and the next one is already the MVP, which may accelerate the delivery of value to the community.\n\nBudget breakdown is very detailed and transparent. It also matches project scope and timeline. I liked the expenses are divided by month before summing up to the whole duration.\n\nProject team is composed of 2 already committed people and possibly the hiring of 2 exta engineers. The team memebrs committed have experience in sales and marketing, NFT-related projects and software engineering. They provide a good level of details on their background, linkedin links just as well as the competences desired for the 2 extra people they want to hire, which might make it easier for them to find them asap.\n\nConsidering it all, I see this is a very fesible project. My only point of attention would be the need to hire 2 extra people but they seem well strucutred to accomplish that quickly. My rate is therefore 5.\n", "q1r": 5, "q2": "Its possible to pull good milestones from the plan and proposer says everything will be communicated in the github. it will also have weekly updates.\nHowever, part of the auditability and definition of success still seems a bit subjective, such as \"community sentiment can easily be tracked through these platforms\" and \"stable and growing user-base\". This could be turned into SMART kpis such as number of users in general, number of visits, time spent on the platform, numbers of users who pays for premium, feedback properly measured (maybe using a NPS), etc.\nIn case proposer adopts an agile framkework, it would also be good to have some sprint reports and product backlog available in the github.\n", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4190, "q0": "\"Visio: Cardano NFT Analytics\" proposal addresses this Dapps, Products & Integration challenge by building an NFT analytics platform as currently there is a lack of NFT interface platform in the CNFT space. The analytics tools (dashboard) will equip traders to trade NFTs intelligently and boost NFT trading volume. This is in comparison to Ethereum which has Icy.tools as one of the most popular NFT analytics platform. The Visio platform provides the real-time listing data with rarity and instant buy, Floor resistance and listing data. It's undeniable that NFTs are the gateway to crypto adoption. Hence, this proposal fits the challenge very well as the NFT analytics platform will expand the NFT trading activity and drive Cardano adoption. However, I would like to suggest the team to reconsider branding of the tools as 'Visio' is a diagram software by Microsofts. When I first read the title of the proposal, I got the impression that this proposal is related of using visio software (as a Visio user myself, it's a flowchart & diagram tool and it might give the wrong impression to others). It would be better for the team to consider alternative name for the project to prevent later problems (trademark) of using this name.", "q0r": 5, "q1": "They have outlined a very clear path how they plan to execute the tasks in Phase 1- phase 4 with the lead time of 9-12 months in total. The budget breakdown is also very informative. However, there is no staff pay rate but only their monthly cost. Both founders of this project are very much hands on in the NFT space adding to the credibility of this project. Given the reasonable budget, ample time and strong team, it's likely that the project will be completed successfully. Also the team has considered the challenges/risks of completing this project with the way to mitigate those risks. It is unlikely that they will return to catalyst funding as they expect the project to be financially sustainable with the revenue generated from using analytics tool in the platform (based on website visit and conversion rate of Icy.tools)", "q1r": 4, "q2": "The community can track their weekly updates on GitHub along with checking user sentiments on twitter and discord. They would like to attract NFT traders from other chains to check out NFT projects in Cardano and trade. The team has spot a good potential area to boost growth for Cardano. They have elaborated in great detail for the KPIs they will use as they go along with the project (in their milestones section) and already finished phase 1. Also interestingly in Phase 2, they will release the lifetime NFT pass which could give them more funding to the project. It will be interesting for the community to keep track actively on their project via twitter announcement.", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6116, "q0": "The proposal is good and in line with the challenge's goals. Here the aim of the project is the application of NFT for the development of Blockchain. However, Cardano does not have a proper high-speed analytics platform like in Ethereum. Proposal are detailed and richly described. NFTs are an important part of crypto adoption but are nascent. Hence to improve the NFT ecosystem, NFT traders outside and inside the CNFT space need the necessary tools to trade NFT intelligently. In addition, charts of the trending NFT collection by sales and data charts with platform features are detailed. NFT is the gateway to accepting cryptocurrencies. If the proposed solution works, this application will drive more people to adopt as NFT traders are usually chainists. In addition, the proposed team has recognized the challenges and has positive solutions, proving that the team has enough experience to recognize the disadvantages in the field they want to develop.", "q0r": 5, "q1": "According to the information the team has provided, Phase 1 - Architecture and design studies for the application has ended. The current project is to finance the development of Phase 2 - MVP development and recruitment (If funding is not guaranteed, we will continue to build). The project roadmap is set from 3 to 6 months with important milestones analyzed in detail of the work to be done. Detailed roadmap, we know what work will be done in the project to get the project success. Next is the budget. The proposal requires a budget of $47,392. The author has provided a very specific and densely explained budget table. the budgets are broken down and allocated to each job in the project. Specifically: Costs for personnel, web services, project management, marketing, etc.. Transparent budget increases the reliability and sustainability of the project. Finally, the members involved in the project. There are 2 members participating in the project implementation. We know about the identity, role and skills and experience of each member suitable to perform the work in the project. At the same time, provide an introductory text about each member and have attached links, enabling us to know more about each member presented in the project. The proposal has a clear plan and a transparent budget. members are qualified to carry out the project on schedule and complete it in a feasible manner.", "q1r": 5, "q2": "The author provides information so that we can evaluate this section. Activities, and community sentiment can be easily tracked through Github. The lead developer's Github profile is checkable through weekly updates related to the project's software in progress. Also follow through through the Discord and Twitter platforms. We have much needed information provided. Important and satisfactory information is established, which can be easily audited for accuracy and continuity. We know what goals are expected. If successful, there will be stable and growing users. Enabling NFT traders to make money. Increase NFT selling volume and liquidity in Cardano.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6427, "q0": "With smart contracts being on Cardano for almost a year, there are a lot of NFT projects that have been building. Each day there are more collections that are created. However, there is a current challenge in the community that is addressed by this proposal. It suggests that Cardano does not have proper high-speed analytics platforms for the NFT userbase. A tool like this will help Cardano NFT holders to look into the analytics of different NFT projects and make better investment decisions. The proposed solution to this idea is to create an NFT analytics platform. This will include different tools within the platform to help different types of NFT holders in the Cardano community and to hopefully provide analytic tools that can help each individual. The proposed plan is something that could bring a lot more utility to the ecosystem. It will provide more secure information and will likely promote the Cardano NFT ecosystem given that there is sufficient demand behind the project. Ultimately, this has the potential to have a global impact on all users interested in Cardano and NFTs. For these reasons, I give this section 5 out of 5 stars. ", "q0r": 5, "q1": "There is a lot of information included in this proposal. I was excited to see that there was a sufficient amount of information provided on the team. The proposal includes a LinkedIn profile and there is a section that provides details on all of their experience and skills. It even shows all of the specific products that the engineers are familiar with. This is important to note because it helps determine the likelihood of the proposal to be implemented successfully. When looking into their roadmap, there is also a lot of great information. The project will be split into 4 different phases and will take place for over a year. Each phase has very specific details on what the team plans to accomplish before moving onto the next date. There is also a tentative timeframe given that allows for the team to be held accountable to these details and dates. There is also a detailed budget breakdown that provides specific information about the requested funds and where they will be allocated. The information in this section is extremely specific and allows the reader to understand exactly where the funds will go and how they will be utilized. The plan for creating Visio is extremely precise. It shows that the team has the skills and have planned out the proposal very carefully. This helps suggest that the team will likely be capable of implementing this proposal successfully. Not to mention that the idea of bringing NFT analytic tools to Cardano is a feature that lots of users will appreciate. For these reasons, I give this section 5 stars.", "q1r": 5, "q2": "As stated above, there is a lot of information included in this proposal. This information provided is very specific and allows for the team to be held accountable. The team behind this proposal have included their specific information that gives details on all of their combined skills and achievements. This is important because it suggests that the team will be capable of creating this product of analytic tools for NFTs on Cardano. This also shows that the team is confident enough that they are willing to be held accountable to this proposal. When auditing the potential success of a proposal. The team should consider how much demand the project will likely have. Given that NFTs are one of the biggest communities in blockchain technology, there will be many users that would love to use NFT analytic tools to help them make decisions and find great projects. This helps lead me to believe that this proposal will likely be successful if worked on properly. Given the specific details provided in the roadmap and budget breakdown. I am led to believe that this proposal will be successful and bring a lot of utility and tools to the Community and ecosystem. For these reasons, I give this section 5 stars.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7607, "q0": "The quote at the beginning of your proposal solution is an excellent introduction. The Hoskinson quote shows that there is a definite need for a proper NFT ecosystem on Cardano. The NFT space in general is still very young. Being able to establish proper tools and applications that can aid in a user's NFT experience is important for a crypto ecosystem. Other chains (like Ethereum) are far and away more advanced when it comes to the amount of tools and features that exist for their NFT ecosystem. Cardano must begin development of these types of applications if they want to grab a piece of that $25B market share. \n\nWith that being said, I believe your proposal here needs some help. I like the idea and the reason to push for this ide but in the solution section I would like to see more specific details on what Visio will look like. Where will the data be pulled from? What APIs will be used to aggregate said data? There are statements about developing a platform that is akin to Icytools.io, but there is no explanation of you will accomplish this within the Cardano blockchain. I understand that in your timeline you make mention to the front-end and back-end code that will be used for the application which is great! I would just like to know the plan to aggregate the NFT market data. \n\nSome of the risks that are stated in this proposal are no necessarily relevant. Risk 2 and 3 are not related to the actual execution of the proposal itself. The risks you want to lay out are ones that could occur if you are funded. If you are funded you will be able to execute application development regardless of the NFT adoption sentiment.", "q0r": 4, "q1": "Per this proposal it appears that the research and design of the application is already complete. If this is true I would like to see a GitHub repository along with potential screenshots of the design. Having the hard evidence to support a claim of completion is important when it comes to requesting for funds. The remaining portion of the proposal timeline is well though out. I like how there are multiple phases of this timeline. It is important to properly organize your project's goals in realistic and accomplishable ways. This also goes for the budget. It appears every detail has been accounted for. This proposal accounts for both the building of the application and the marketing of it. Appointing funds towards a well built discord server is important too, especially in the NFT space. You may want to consider budgeting to pay for moderators if you believe that your discord server can become popular. Overall, the budget and plan for this proposal are well detailed and give the reader a clear understanding of what is going to be done to execute building this application.\n\nAs far as the two core members of this project, I believe they have the experience to handle executing this proposal as this is the only project they are working on. Having experience in both marketing and computer engineering tells me that you are able to handle the task appropriately. I also appreciate that Neil also has experience in Web3 NFT projects, and a past Cardano project. The one thing I think would be appropriate to add is your strategy for recruiting engineers to your project. It would be helpful to understand how you will go about this since it is a fairly critical aspect to the proposal execution. ", "q1r": 4, "q2": "The tracking of this project appears to be straightforward. Utilizing a GitHub repository is key and you make mention of this in your proposal. I think a weekly update is good frequency for project updates. To add to this I would consider sharing more detail about community sentiment. How many beta testers are volunteering? What is your website traffic once live? What is your twitter and discord traffic? Some of these measures for \"community sentiment\" should be explicitly stated for clarity.", "q2r": 4, "assessor": "z_assessor_2907", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13604, "q0": "As an investor and user on the Cardano ecosystem, I see this idea as helping investors like me to avoid buying NFTs from scam projects.\nThe author has completed a complete dApp on ETH and simply built bots to collect data on Cardano to aggregate and AI filter out quality projects.\nI looked at the author's dApp at https://checknft.io/. In my opinion, the UI UX design of the application is not sophisticated and friendly. I found it to display too much information. Authors should consider displaying less information, and only when users need to see more, only display that data.\nRegarding the risk assessment, I would like to add one more risk that the author needs to think about. That is the risk of ADA slippage. Since the funding from Catalyst is ADA, if ADA reduces the price, it will cause the proposal to lack funds to complete the proposal. My suggestion: The author should ask for an additional 5-10% of the total amount requested to limit the risk of the ADA price falling.\nSince this is a working dApp and I looked at the checknft.io website. I find this proposal essential for the development of NFT projects on Cardano and it addresses the requirements of the challenge.", "q0r": 5, "q1": "Regarding the proposed implementation plan, I find it adequate. In my opinion, the author should add the name of the member who will perform the work in each stage in the plan table. This helps me and the voters assess whether the author and team have the skills and expertise to complete this proposal.\nIn the cost description, I find the information to be complete and reasonable.\nRegarding team information, the author presented lack of details and sketchy. Maybe this is an anonymous team. This is a big minus, making it impossible for me and the voters to assess the skills, expertise, and experience of the team members sufficiently to complete the proposal.\nHowever, the team has a huge advantage of having a real-life application built on ETH and the current work is to bring it to Cardano.\nIf with another anonymous team, I would only give 3 stars in this category. But since your team has created a good app on ETH side, I will give this category 4 stars.", "q1r": 4, "q2": "The proposed solution is quite clear and easy to understand. I can easily assess that this proposal addresses the requirements of the Challenge and I see the importance of this dApp in the development of NFT projects on Cardano.\nIn terms of time and implementation plan, I find it quite clear.\nAbout delivering the results of the work done. The author should set up a telegram channel or announce the completed work on checknft.io's communication channel so that I and the community can follow. This helps me and the community see how the results from this proposal have impacted the growth of the Cardano ecosystem.\nFinally, if possible, the author should do a survey asking for the evaluation of NFT project owners or NFT traders. The goal is to help the author understand the problems that dApps are facing and make the dApp easier to use and more user-friendly.\nWith all the information the author provided, it was enough for me to see the author and the team would do a great job with this proposal if funded.", "q2r": 5, "assessor": "z_assessor_3702", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We will build an NFT analytics platform as there is a lack of it in the CNFT space. Icy Tools (ETH) , has 2.5million daily site visits which speaks for the demand such a product has.", "experience": "\n5 years of work experience in sales & marketing working in Philippines, Indonesia, and Australia\nHave started 2 NFT projects both in Cardano and Ethereum.\n6 yrs exp as a full-stack software engineer at F500 with exp in web3 ADA & ETH\nBachelors in Computer engineering\nweb3 natives\n"}