{"id": 418450, "author": "kiran.unvest", "title": "Bonding native assets to NFTs", "url": "https://cardano.ideascale.com/a/dtd/418450-48088", "category": 26595, "amount": 76800, "description": "Projects like Yuga Lab's ApeCoin have demonstrated the value of bonding native assets (coins) to existing NFTs. This should be an on-demand service, available to any Cardano project.", "f6_no_assessments": 8, "f6_rating": 4.208333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 4189, "q0": "The \"Bonding native assets to NFTs\" proposal addresses the Dapps, Products & Integration Challenge by building a tool that allows a user to vest any asset in 'linear fashion' to any existing NFT collection. The user will be able to bond coins, mint NFT and NFT vesting. the team has built a working implementation of this tool and deploy it to several EVM networks and they plan to rewrite their contracts and UI for Cardano. The platform will open up the plethora of token vesting and decentralized LP token ownership. The team has drawn the distinction between  linear vesting VS. liquid Vesting token protocol. The proposal could improve if the team would elaborate more on these to portray how it will be beneficial to Cardano. The team aims to create utility NFTs on demand.   \nThe ecosystem can gain free access for vesting utitlity and the Dapp will attract existing NFT projects to migrate to Cardano and drive Cardano adoption.", "q0r": 5, "q1": "The project will take a year (4 quarters from Q4 2022-Q3 2023). The majority of budget will go towards smart contracts implementation and back-end, UI/UX and front-end. The team should have included the number of working hours and the pay rate. The team has a great mix of protocol design and smart contract developer. The team should provide the linkedin profille of each team members. The team has cited the lack of experience in building on Cardano as the risk/challenge of this project and plan to reach out to experienced Cardano developer. It is great that the team has already deployed their vesting tool on several EVM testnet making it highly possible that the project can be completed successfully.", "q1r": 4, "q2": "The team should have specified clearer their KPIs. The KPIs could be included along with the milestones and provide the target also how much they aim for TVL (total value locked) and if possible the metrics for user growth on NFT vesting (their main feature). They define initial success as being to deliver a stable and secure Cardano compatible port of NFT vesting but misses out on telling where to observe this achievement. For the TVL, the community can check on DeFiLlama with no issue. I would recommend the team to consider the channels either GitHub or Bi-weekly meetings for the community to tune into their exciting developments. The team has understood the value of bonding native assets to NFTs and found ways to increase NFT utility very well. If they would have addressed a few points mentioned in the feasibility and auditability, they would get the full rank in these 2 sections.  ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 4382, "q0": "The proposal that solves the goal posed in Challenge: Dapps, Productions & Integrations and identifies the problem to be solved is that there is currently no tool that allows users to assign any asset linearly to any set of sets. existing NFT collection. The team is working on a solution to that, and beyond that users can also mint new NFTs using the team tool and allocate tokens to those NFTs. This is great if it is implemented on the Cardano blockchain. It has been partially successful: ApeCoin has proven the value of linking native assets (coins) to existing NFTs. Thus, the team identified the problem to be solved and came up with a plan to solve the problem. In my opinion, this is an interesting proposal because so far there has been almost no similar proposal that has come up with ideas and successfully applied them to practice. The team can be one of the pioneers. Especially when it is related to finance, advanced technology has the function of supporting the linear test feature. I rate this as really creative - an interesting idea. This proposal adds value to the Cardano ecosystem by it deploying and generating NFTs on the Cardano blockchain. The Cardano ecosystem will be free to use the vesting utility and become a more investor-friendly environment, especially for existing NFT projects that may be looking to migrate to Cardano. That is the powerful nature of this proposal. In addition, the proposal can scale and explain the future challenge in different fields as NFT will be a tool that will gradually become indispensable. I think there is real potential and there is still a lot of room when proposing to expand the scale and solve challenges in the future. I strongly agree with the impact of the proposal, I vote 5 stars.", "q0r": 5, "q1": "I found that the team has many years of experience in programming, blockchain development for reputable organizations, project management, smart contracts, etc. The team also provided a full explanation of the problem and documents related to the proposal (website, whitepaper,...). However, I don't find it convenient to reveal all the members' identities directly on the proposal via a social network link (Linkedin, Facebook...), it's a hindrance to the community. in looking up the members' identities and clearly verifying the feasibility of the proposal and further affirming the credibility of the team. The community will have to spend more effort and some time visiting the website unvest.io to learn about the members of the team. I've come across several other proposals that do the same. The number of core members on the team as I understand it is 6 people (list only names and areas of expertise in the proposal), these are the key members, can team other members/collaborators yet be identified in the proposal? My advice to the team is to try to add a social media link (Linked, Facebook, etc...) directly to the proposal to make all the members of the team public. Because thanks to the full complement, the community has a lot of advantages in looking up the members' identities and verifying the feasibility of the proposal.\nThe budget is presented briefly, somewhat sketchy. Still, it's fit for purpose. I think the community needs to detail the important work that needs to be done rather than such a sketchy presentation. Because when listing the details of the work associated with the budget, it will clearly show the professionalism and meticulous attention to the team's budget balance sheet, through which the community can strengthen more confidence in the ability of the team. examination of the proposal. It's perfectly understandable for the team to present the budget as it is, for people who already know the team well (know what the team needs to do), but I think letting everyone from the community (some people are very new - they don't know anything about the team and this proposal) can understand it easier than we need a more detailed, more understandable presentation. That's my advice on the budget. If it has not been funded by Catalyst at Fund 9, does the team intend to implement the proposal? Does the team have other funding sources to implement this proposal? (can be mobilized from other organizations)\nThe plan and implementation method have been stated by the team step by step in a certain order. It is divided into 4 stages, each stage is counted by the work to be done at that stage. Note that this is a list of what needs to be done, not a level of detail. Through this, the feasibility of the proposal can be assessed to some extent. It can speak to the enthusiasm of the team's presentation of the proposal. Through this, I have advice for the team that the team should present more specifically the plan and how to implement it. I expect meticulousness and detail because it is a way for the community to increase confidence in the feasibility of the proposal.\nHere, I consider the necessary resources for implementation, I divide them into two main resources, which are financial resources (mentioned in the above budget) and human resources. Regarding human resources, key members have professionalism and experience. The proposal presented is that some members are also working on another proposal in parallel with this proposal at Fund 9. I would like to ask if this will reduce the quality of work at this proposal? Because human resources are scattered when implementing different proposals. I understand maybe the team has other members/collaborators to work together. However, I think the team should demonstrate to the community that even though there are currently members implementing another proposal, the human resources are still sufficient for the successful implementation of this proposal. It is the best way to create more trust in the community, thereby increasing the feasibility of the proposal. If doing so, the team has made sure that there is an abundant human resource to implement this proposal and affirms the team's belief and most importantly, the feasibility of the proposal to the community. For this proposal to be implemented successfully, I think it needs the participation of many members, not just a few key members. So can the team share more about who (collaborators or others) could work with the team to develop and implement this proposal? My advice is that the more the team shares publicly, the more trust the community will gain. That is favorable to the feasibility of the proposal.\nIn terms of technique, technology and language used when implementing the proposal. This is a collection of high-tech technologies: Blockchain Cardano, smart contracts, Haskell programming, NFT generation, etc… I think it was mainly built by the core members of the team - who already have many of the skills I just mentioned. The fact that the team intends to release NFT makes me very supportive. NFT is not only representing the professional meaning of the proposal, but also a way to promote the event and the team's brand to the community. It represents the application of the world's advanced technology to the work of the team. In addition, the team can completely mobilize external support to propose to be implemented in the best way (possibly with the team's ability - it is not necessary). Support here is understood not only in terms of money but also in terms of human resources, and technology… from experts… I believe that the team will do a great job when implementing the technical aspect of technology into the project. implementation of the proposal.\nIn terms of the risks when implementing the proposal, the team is also quite clear about the risks that can be encountered when implementing this proposal: The team does not have much experience building natively for Cardano - accompanied by a solution adequate to prevent risks. Here, I add one more risk that is: Ada slippage - will affect the budget of the proposal. We know that the cryptocurrency market is in hibernation (devaluation of digital currencies), so Ada may depreciate when the team receives from the Catalyst fund, then the team will face the problem of a lack of budget to implement the proposal. So my advice would be for the team to take a close look at Ada's slip-in budget to fit the budget requirements in the proposal.\nThose are my positive comments, the team can review and adjust this proposal. I both agree and disagree about the feasibility of the proposal - the team noted that the parts I suggested were missing - I vote 3 stars.", "q1r": 3, "q2": "In my opinion, the roadmap of the proposal presented by the group is not detailed with a total time of more than 11 months. This is a reasonable roadmap and milestone for a proposal that takes time to implement. The work steps to be performed in each stage have not been specifically listed, however, it contains all the necessary information. What I'm satisfied with this roadmap is that the team has attached the milestone roadmap to specific quarters of the year (if it's tied to specific months of the year, the better, for example, January, February... - this is just an example). Thus, the proposal has created favorable conditions for the community to evaluate the transparency and auditability of the proposal. As a PA, I have evaluated several proposals and have found that not many teams do this.\nI don't feel satisfied without the presence of job performance indicators (KPIs) and key metrics. The team needs to look more carefully and specifically to come up with KPIs and key metrics. We all know the role of KPIs and key metrics in auditing. I consider KPIs to play a specific role in demonstrating the transparency and auditability of the proposal. So my advice is to quickly add KPIs and key metrics to the proposal. By doing that, this proposal will have higher transparency and auditability.\nI think the team should define \"what the success of this project looks like\" in a clearer, more specific way to demonstrate auditability, rather than the team just thinking that success is the TVL's growth is steadily growing, providing a secure, audited tool for Cardano native startups. I expected more of this from the team.\nThe tissue group clearly articulated problems and solutions throughout the proposal. We hope that the team will consult with me, pay attention to the addition of KPIs and key metrics, and detailed roadmap,... I disagree with the auditability of the proposal. I vote 2 stars.", "q2r": 2, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 5951, "q0": "Bonding native assets to NFTs allows any project to allow vesting of token ownership, which enables a lot of currently difficult or impossible use cases with Cardano native tokens like community/DAO membership rewards, staff/member equity token - style \"stock options\" and bounties or embedded coins that can later be \"melted\" again. The proposed implementation would make it possible to determine the balances to bond per NFT or wallet address, and make possible linear vesting with flexible parameters.\nThe proposers name as the \"key innovation\" that the ownership of bonded tokens transfers with the NFT, so the uniqueness of NFTs will be preserved while making the bonded \"package\" fungible. It may require a bit of \"out the box\" thinking to see the countless possibilities, but this is exactly what I like to see in this Dapps, Products & Integrations challenge going forward: ready-to-use out-of-the-box dApps or tools that are not only targeted at developers (there's a separate challenge for that) but go way beyond a Cardano-equivalent of a web app, game, or other product that may not really need the blockchain at all. Combining NFTs and fungible tokens in a novel way and allowing others to do awesome stuff with it, be it for DAOs or crypto market places or art collectors or empowerment communities, is really inspiring and a great directions for this Challenge Setting.", "q0r": 5, "q1": "There is a website for the project already with a 24 pages pitch deck. Although this looks very professional, it would be nice to learn where this is used outside of Catalyst, as I find it unlikely that it is produced for Catalyst (which does not require pitch decks and has a rather long form to fill anyway). It is also always better to add LinkedIn profiles or Github links for the devs, so we know that they exist and are indeed connected to the project. That aside, there is a six-person team who have blockchain dev experience (Uniswap, Ethereum), one team member has Plutus/Haskell covered, with others having full stack and frontend/UX experience to carry out this ambitious project. The beta release is planned for the second quarter of next year. The budget and milestone detail are convincing and the skills required are covered in this proposal. It seems feasible that we will see a successful product that does what is promised. The example of ApeCoin given in the problem/solution statement communicate a clear \"base use case\" that this project can be used to \"replicate\" and it would be great if the team could create a Discord or Twitter channel to involve others who may want to contribute ideas. More hyperlinks or external profiles could have been used for the team. Otherwise, the feasibility and high quality of the product description suggest that a high quality delivery is likely. ", "q1r": 4, "q2": "The Auditability of this proposal needs some more love and care in my humble opinion, as \"delivering a stable and secure Cardano compatible port of NFT Vesting\" is only possible to audit after the entire almost 1 year timeline of the project until the beta is released, and no project management, repositories or social media to communicate with the proposers are provided. It would be difficult for community or auditors to get in touch or research the progress during the product development period. The proposers mention that they partner with CardStarter, Spores and GeroWallet, so some links to the partnership page or logo would have been nice. Otherwise, the project management, budget and timeline are already providing a lot of detail for the audit, so I hope that if this project gets funded more information will be provided to the community and challenge teams.", "q2r": 4, "assessor": "z_assessor_2761", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6754, "q0": "This proposal explains that there should be a service that allows for any NFT project on Cardano to reward their holders via a token similar to how Yuga Labs rewarded BAYC and MAYC holders with ApeCoin.  The team has already built this service for other chains like Polygon, Ethereum and BNB.  Now they want to integrate Cardano into their dApp, which I think clearly aligns with the goals of the challenge.  \n\nThe proposal does a good job of explaining how this could provide value to the Cardano ecosystem. One way they do this is by giving NFT projects a tool for rewarding their holders with a way to claim tokens.  It’s also great that there is no technical knowledge needed to use the dApp and it will be free to use.\n\nThe proposal provides some metrics like TVL and user growth as indicators of success after the app has successfully integrated Cardano.  This aligns with KPIs of the challenge where one of the goals is to look for an increase in users as a result of newly integrated products.", "q0r": 5, "q1": "The proposal does well in explaining the experience of the team and how they have already implemented this dApp successfully for multiple EVM chains.  It’s also good that the team acknowledges that because they don’t have experience developing on Cardano, they plan to consult with experienced Cardano developers to help in the development process. In the comments the proposer states that one of their team members has experience in Haskell which is definitely worth bringing up, even though they don’t have experience in Plutus.  It still is better than no experience with Haskell, which is what I assumed based on the info in the proposal.\n\nIt’s unclear if the team has already found some Cardano developers willing to help or if they still are looking.  I think providing more clarity around that would help in assessing the likelihood of success, because if you already have some Cardano developers willing to help then it becomes much more likely this proposal is implemented successfully than if you are currently looking for help still.  I believe this because experienced Cardano developers are in high demand and most of them are likely pretty busy already.\n\nThe timeline provided gives a surface level look into what the team plans to accomplish.  I think it would be better if a bit more detail was provided about what they plan to do in each quarter.  This would help show us that there has been a good amount of thought put into what steps are needed to be taken to be successful. For example, the items listed under the “Project Planning” stage of the timeline are “Deep research, testing, setting internal milestones and assigning responsibilities.” I find myself wondering a few things like: “What topics are you planning on researching?” and, “What systems are you testing?” I believe elaborating on all of these points would help instill confidence in voters that the team has a well thought out plan for development.\n\nThe budget is laid out pretty well, but similarly to the timeline I think more details could be useful.  The main thing that would be helpful is any information about how these totals were decided upon.  An easy one to add is how many hours are estimated to be spent towards smart contract implementation and how much per hour the team wants to earn for that work.  This would show us the calculations behind some of the requested funds and help us decide if they are reasonable.  Regardless of all that, the total amount requested does seem reasonable given the size of the team and length of the timeline.\n\nLast thing I’ll mention is this team has submitted another very similar proposal that I assessed before this one. In the other proposal, instead of using NFTs to track ownership of vesting tokens, they use “liquid vesting tokens” to accomplish basically the same thing.  That’s what it seems like to me at least.  If I am correct in that assessment I don’t see why these two proposals couldn’t be combined into one.  Because of the similarity between the two proposals, It’s unclear to me if they need both of these proposals to pass in order to have the funds needed for development or if it’s possible for each one to exist on their own.", "q1r": 3, "q2": "My notes for the auditability of this proposal are very similar to the notes given for the other proposal by this team.  Basically, the provided KPIs like number of users are good indicators of success after development has finished.  What I find missing are ways to track the progress of this proposal during the development stages before the app is released.  What I think would be good to include is a public channel, like twitter or discord, where the community can follow along with any progress made.  I also think some more detailed milestones should be included in the roadmap to know what to look for when determining if progress is being made in the development stage. ", "q2r": 3, "assessor": "z_assessor_2826", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7551, "q0": "This is in line with the setting of the challenge projects like Yuga Lab's ApeCoin have demonstrated the value of linking native assets to existing NFTs. This problem is clearly defined and it is directly related to the current challenge. Well-Defined Solution the team built a tool that allows users to assign any asset linearly to any existing NFT collection. This makes it possible for users to also mint new NFTs with our engine and allocate tokens to those NFTs. This solution solves the current problem and the challenge. The author also pointed out that the main risk of the problem is that the author of the proposal does not have much experience building the original for Cardano. Still, they also have a solution to solve the above problem to find out experienced Cardano developers to participate in the development of the project with them. The author will support the transition and upskill our current team to build more on Cardano in the future.", "q0r": 5, "q1": "The proposal has identified important fads, they offer 4 working timelines:\n1. Project planning - Q4 2022: in-depth research, testing, setting internal milestones, assigning responsibilities.\n2. Development - Q1-Q2 2023: rewrite solid contracts in Haskell/Plutus and port the web app to support Cardano wallets.\n3. Auditing, Private & Public Beta - Q2 2023: robust testing with real content and testnet. Fixed some bugs and improved user experience.\n4. Release - 3rd quarter of 2023: release and widely market, reach users.\nWith the timelines given by the author, I think it is completely possible to complete the set work. The project progress is also clearly outlined by the author. This will be a potential project if the project is funded. The success of the project is well-defined and the team appears to be highly competent and well-connected in the community they leverage their connections at CardStarter, Spores and GeroWallet partners to find projects that will benefit from robust infrastructure or tools to enhance their NFT. The success of this project looks like the growth of TVL and users on NFT Vesting is increasingly stable, providing a secure, audited tool for native startups in Cardano. The solution to this problem is that the Cardano ecosystem will be free to use the vesting utility. The author expects this to make the Cardano ecosystem a more investor-friendly environment, especially for existing NFT projects that may be looking to migrate to Cardano. They hope this contributes to better overall network health.", "q1r": 5, "q2": "Indicators measure project progress and development that is specifically quantified over time. providing a stable and secure Cardano-compatible port of NFT Vesting was the initial measure of the project's success. TVL and user growth will be ongoing indicators of success. Clear, specific KPIs make it easier for the community to track project performance and better-funded projects.The project team consists of 7 members. Their identities are detailed through social networking sites. They are elite members and have related experience in many different fields but put together will create a complete team for this project. The group includes:\nKiran Matthews is a protocol designer, Project Manager, UX he has more than 10 years of experience in the software industry.\nAlan Soares is a Full Stack developer with over 14 years of programming experience. and 2 years of experience in the blockchain field.\nKlaus Vidal is a highly experienced smart contract developer and blockchain security expert who has created and audited billions of USD/TVL contracts...\nJuan Ubinatus is a smart contract developer.\nSergey Stepanets is a smart contract developer.\nEli Douglas is a Front End developer\nThe funding request on this proposal is $76,800 less than 20% of the full challenge budget. The necessary budget is explained in-depth and logically in each expenditure, and the reasonable expenditures I find suitable for this challenge.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8079, "q0": "NFT is an area with very few applications of Cardano. CNFT has always been welcomed by everyone, but so far, there are still very few successful projects for many reasons, in which the DApp does not match user requirements is very high.\nThere are a lot of locked assets but the market still agrees to trade. However, making these transactions secure is still the difficulty of the decentralized market.\nJust as Proposer mentioned, having Bonding native assets to NFTs is necessary as it will make CNFT an friendly ecosystem that will attract NFTs available on other blockchains to migrate to Cardano.", "q0r": 5, "q1": "The project members have built this tool and testnet on many other EVM test networks makes the project's viability very obvious. Members of the project team are experienced people.\nThe project has also given project milestones as well as its timeline.\nThe budget allocation is clear by category although there is no verification for each item amount.\nHowever, the members of the project also participate in other proposals, which is what I confuses, will they have enough resources to ensure the progress of this project if they are funded for more than 1 proposal?", "q1r": 5, "q2": "It is possible to check the progress of the project by each milestone as the timeline has been stated.\nHowever, the project team did not provide methods for the community to track progress, which reduced auditability. They should include more community engagement methods such as Discord channel feeds, weekly reports and Github updates that will increase auditability.", "q2r": 4, "assessor": "z_assessor_2945", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9618, "q0": "Pre-sale and linear vesting is one of the ways for GameFi and DeFi projects to raise capital from the community and investors. However, it also presents a risk for projects as the price of the token will dump if holders sell the token at the same time right after the token is unlocked. To overcome this problem, the project has come up with a solution which is bond tokens to existing or newly minted NFT collections. Investors can vest NFTs corresponding to the number of tokens they are holding, then sell those NFTs to recover capital. Transactions using NFT will not affect the price of the token, helping to prevent the price of the token from swinging sharply when it comes to vesting. In addition, being able to exchange NFTs before the vesting schedule helps token owners to take profits early and buyers are able to access tokens below market price. On maturity, the buyer holding the NFTs can redeem them for the original unlocked tokens via the smart contract. The use of NFTs as a transferable claim key to a locked asset is an innovation for fundraising of projects on the blockchain, helping to improve the quality of projects as well as bring new use cases for Cardano. I therefore rate 5 stars for the impact of this proposal.", "q0r": 5, "q1": "The project is implemented by 6 people, of which Kiran Matthews is a project manager with more than 10 years of experience in the software industry and Klaus Vidal is a lead smart contract developer with more than 17 years of programming experience. In addition, Klaus Vidal is a blockchain security expert who has participated in audited contracts with billions in volume/TVL. However, the project has not provided any evidence like LinkedIn so that voters can learn more about the capabilities of each member of the group. Especially, the proposer needs to provide more experience and skills of 3 members Juan Ubinatus, Sergey Stepanets, and Eli Douglas because the proposal does not have this information at the moment.\n\nRegarding the project's budget, the proposer needs a more detailed breakdown. For example, for the amount of $ 31,000 for engineers to build smart contracts and back-ends, it is necessary to specify how many engineers needed, how many hours each engineer works and what is the pay rate of each engineer. With the $9,000 for infrastructure, hosting, network, software & services also need to add what software and services are used, is infrastructure on cloud or on-premise, how long will this money maintain the infrastructure, etc.\n\nRegarding the implementation plan, the project has provided a plan that includes a timeline and key milestones. In my view, this timetable is practical to complete the project.\n\nThe proposer has considered the main risk related to the success of the project. That is it was difficult to rewrite Solidity contracts to Haskell/Plutus.\n\nOverall, according to what is presented in the proposal, I believe that the team is capable enough to carry out the project. However, it is necessary to add some information related to team members and the budget to make the proposal more complete. Therefore, I rate 4 stars for the feasibility of this proposal.", "q1r": 4, "q2": "The project provided a roadmap with clear key milestones and timelines. The KPIs that the proposer uses to evaluate the success of the project such as the number of users used, and the total value locked are appropriate. However, it is necessary to add a way that the community can self-audit the progress of the project. For example, the project can create an accessible public channel for delivering a regular report about progress so the community can audit on their own.", "q2r": 4, "assessor": "z_assessor_3068", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11243, "q0": "The proposal sets to create a dApp that allows any project developers to bond coins to any NFT collection. In addition, NFTs can be minted using said dApp for a new or existing collection. There will also be NFT vesting included. The ecosystem will get a free-to-use vesting utility. The product of the team will give a free, composable, and interoperable tool that allows all developers on the Cardano network to create utility NFT based on demands. This would help move up the NFT space on Cardano. Thus, this proposal does effectively address the challenge. ", "q0r": 4, "q1": "There are a total of 7 people that are working on this project. Kiran has more than 10 years of experience in the software industry. Klaus is a well-experienced with Smart Contract Developer and Blockchain security expert. He also has authored and studied some contracts with billions in volume. Alan is a programming experience for almost 15 years and has 2 years of experience in Blockchain. These people will be in charge of Protocol Design (Kiran), Project Management (Kiran), UX (Kiran), Lead Smart Contract Developer (Kalus) and a Full Stack Developer (Alan) and their previous experiences have been mentioned whereas the following individuals only have their post has given but not their experiences. Juan and Sergeyas Full Stack and Smart Contract Developer. Eli is the Front End Developer. There are people with a lot of experience in the team hence it is believed they can guide the ones with less. As for the plan, it is set out into four phases. The first phase is project planning which consists of the regular planning stages. Then there is the development phase where the team starts writing contracts in Haskell or Plutus. The third phase would focus on audit, private, and public beta. And the final phase is the release of the dApp. With all the aforementioned information it is likely that the team will implement the project successfully. ", "q1r": 4, "q2": "As for the auditing of the progress, the team leaves a little to be desired. They do have several means to audit but only one actually audits the progress which is the \"following of the milestones\". They should also have social media accounts to post about their milestones, achievements, hiccups, and more. The team can also give out information regarding the private and public beta. As for the auditing of the success, the team plans to use TVL and user growth on NFT Vesting. These are sufficient means to assess success as these metrics can be easily assessed and measured. ", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We have built a tool that allows a user to vest any asset in linear fashion to any existing NFT collection. Users can also mint new NFTs with our tool and vest allocations of tokens to those NFTs. ", "experience": "Klaus has 17+ Years programming experience, developing for blockchains since 2017, and has contributed code to Uniswap, Balancer Labs, OpenZeppelin, The Sandbox and others. Kiran has 10+ Years software development experience including a YC company endorsed by Steve Wozniak."}