{"id": 418686, "author": "mcculloughi", "title": "FML : P2P sync licensing protocol", "url": "https://cardano.ideascale.com/a/dtd/418686-48088", "category": 26595, "amount": 128700, "description": "Musicians have to navigate an expensive, slow, and antiquated music industry in order to license and synchronize their music to adverts, film, social media, video games, and the metaverse.", "f6_no_assessments": 6, "f6_rating": 4.722222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 543, "q0": "The problem statement is clearly written and the problem solution is directly linked to the challenge question. By issuing synchronization licenses via NFTS on Cardano, this proposal could directly drive new use cases, and new users and an increase in onchain transactions. The KPI's of this proposal are linked directly to the challenge, as they are about bringing new users and recording transactions onchain. There is potential for this to capture a large % of the market for music sync licences touching on film, video games, metaverse, marketing, and various other multimedia content. I think this proposal could also have a significant impact towards automating, simplifying, and codifying legal contracts on the blockchain. Having legal experts work on these problems could also provide numerous benefits in the future, as they can set new legal precedents with unique blockchain use cases. ", "q0r": 5, "q1": "The proposing team has included their experience and qualifications, and they appear to be well qualified to complete this proposal with a deep understanding of the music industry, experience with music licensing, and blockchain development. They have mentioned they are looking to hire two additional team members, so it appears they may not yet have the full team required, and therefore there is some additional risk to this proposal. They proposal also includes and explains the perceived legal risks, budget risk and technical risks and mitigation strategies for each. I am not familiar with the legal considerations here, but I find the following statement confusing. \"FML is not a marketplace for music rights, but rather a marketplace for licenses of use for those rights.\" I think other voters may also find this confusing, and this could be improved with further explanation from the proposing team. This sounds like an important point to consider the feasibility of this project, as it will be dependent on these legal considerations, and the technical challenges are secondary. The team has included a reasonable budget with quarterly milestones that are broken down into deliverable tasks. ", "q1r": 4, "q2": "The proposal includes a budget and timeline. The KPI's are provided with both quantifiable metrics that can be audited easily, and qualitative based metrics like activity, engagement and retention. The team has also provided a way to measure these qualitative metrics. The project will be available for audit on Github, and the team will also complete customer satisfaction surveys. The only recommendation I would make to the team is to include monthly reporting to the catalyst community of a summary of all the audit metrics provided in the proposal, and make it clear how these reports will be shared. ", "q2r": 4, "assessor": "z_assessor_2108", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6030, "q0": "This proposal is an idea to build a Dapp protocol that allows for peer-to-peer music licensing and synchronization through NFT. Synchronization will help the owner authenticate the audio product is theirs. Also synchronize the output with different picture outputs, audio media, movies, TV shows, commercials, games. This will help content creators , or collaborators can create music products for business in a decentralized way. Help the number of participants using the product to be popular, and promote mass adoption. The output matches the objectives presented by this challenge, so I agree with the impact of the project.", "q0r": 5, "q1": "I assess the feasibility of the project as acceptable. Talking about the implementation roadmap, we know clearly how long the project will be implemented (here, about 1 year). However. , I think the proposer should be more specific about the specific work that will be done in each phase. For example, in Q2/2023 - protocol migration and specification, we'll have quite a bit of work to do. For example: front-end back-end, build security system, check for bugs, run testnet etc. How long does all these work take?\nBudget breakdown: still quite general, making it difficult for me to assess whether this project will cost enough to implement. We only have information that the cost is $25/hour worked. However, because the nature of work is different for each person, the cost will be different. I take for example, for the work to do technical construction for the project requires a higher cost for the programmers, for the marketing and advertising costs there will be a lower salary for the implementer. The other costs related to marketing such as advertising costs, cost of inviting brand ambassadors or costs of organizing discussions with creators need to be added here. Therefore, it will be more complete if we have more detailed information about these contents.", "q1r": 4, "q2": "We have complete information about each member of the project through links to their personal profile page. We have standards to measure progress, measure both quality and the number of proposals. Know how the proposal will implement these reports, and how to analyze the reports. We also rely on customer feedback through information surveys, thereby improving products to deliver a seamless user experience.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6891, "q0": "-\tAwesome proposal submission the arts and entertainment space focussing on music and challenging business models in the music industry for rights licensing as we know them\n-\tThis proposal brings together Digital Rights Management, social networking and marketplace features all in one platform aiming to decentralize and disrupt the music industy by bringing licensor, licensee and the fan community together\n-\tIn doing so, it challenges the Cardano Ecosystem to provide tools needed for such innovations to materialize and also positions Cardano to compete with some recent products like Audius (https://audius.co/)  & the UtopiaMusic ecosystem (https://utopiamusic.com/) , Musicoin (https://musicoin.org/) \n-\tThe team is qualified, diverse and experienced. The big challenge is more about implementing features, scaling up rapidly as a marketplace. This can benefit from Cardano’s roadmap for scaling up from the Basho era features (https://roadmap.cardano.org/en/basho/)\n", "q0r": 5, "q1": "-\tThe cost breakdown appears to be adequate and brings together competencies much needed at this early startup stage ( technical ,  product design, project management, legal, community management )\n-\tThe roadmap Q1 2023-Q1 2024 and immediate objectives for this proposal with are clear. The team is however  starting from scratch, which may be a challenge. So scoping out a Proof of Concept, then a Minimum Viable Product, could be helpful before investing further into a final product.\n-\tSome further details on the go to market strategy could help better understand if there may be some gaps in this respect, i.e marketing and communications campaign and gearing up with an operations team, business developers & partnership managers  to develop the partnerships needed. \n-\tSetting up a business model canvas to explore an operating business model could highlight some other gaps or hypotheses that the team is making and allow the team to test them ( https://www.strategyzer.com/canvas/business-model-canvas) \n-\tThe tokenomics for a blockchain based application would also need to be designed to clarify the incentivization model, licensing and royalty payments through utility or payment tokens or fiat money.\nIn order to accelerate time to value, the team could consider looking at some of the references below: \nSome developments in the Ethereum space with regards to royalty standards : \n-\thttps://eips.ethereum.org/EIPS/eip-2981 - standard for royalties in Ethereum\n-\thttps://cips.cardano.org/cips/cip27/#simplesummary standard for royalties in Cardano\n-\thttps://www.openlaw.io/ - platform for legal smart contrats for implementing contractual relationships\n-\thttps://accordproject.org/ , open source software for smart legal contracts\n-\t\nDigital rights management : \n-\thttps://www.zdnet.com/finance/blockchain/new-platform-uses-nfts-as-a-gateway-for-digital-rights-management/ \no\thttps://rair.tech/ - Blockchain based digital rights management platform\n-\tOpenMusic Initiative, https://open-music.org/ that has created some open standards for creating and sharing music\nCardano ecosystem integrations that may be of interest : \n-\tProfila for CRM from Cardano ecosystem for communications and marketing purposes\n-\thttps://www.clanity.com/#Platform  for social marketplace from Cardano ecosystem including business to business and business to customer features.\n-\tIntegration with lending protocols to faciliate liquidity for those artists needing funding for creating content\no\thttps://www.meld.com/ from Cardano ecosystem\nThere are also some similar proposals in Fund9, so probably setting up a Cardano community focussing on the music industry, eg a Guild or even a consortium going forward could benefit everyone : \n-\tLicensing Remixed Music On-Chain, https://cardano.ideascale.com/c/idea/421968\n-\tProject Catalyst... for Musicians , https://cardano.ideascale.com/c/idea/414440\n-\tDecentralizeMusic.com, https://cardano.ideascale.com/c/idea/414289\n-\tPerma-music rmNFT Marketplace, https://cardano.ideascale.com/c/idea/415152\n-\tCardano For Musicians , https://cardano.ideascale.com/c/idea/419013\n-\tCardano Music Marketplace, https://cardano.ideascale.com/c/idea/416274\n", "q1r": 4, "q2": "-\tThe team is clear on customer acquisition and adoption being the key outcomes they are after through the launch FreeMusicLand. As there is a go to market phase, the team has also planned for some indicators for feedback collection eg : number of users using it, number of interviews, ( groups, individuals) , feature requests using a user-voice mechanism. It will be useful to gauge how well the product is being received by customers and the potential for growing it into a mature product.\n-\tAs this is an arts & entertainment space with active players the product needs to be solid in terms of customer experience and stable in order to develop the acquisition level it clearly deserves. Poor user experience could probably adversely affect growth, so some caution may be needed there. The team is rather experienced, so I would assume this is taken care of.\n-\tNonetheless, some operational KPIs may be handy as the user-base scales, eg, some performance related metrics like number of crashes of application, outages, support requests and resolution rates. This could inform the sizing of the operations team needed as the application scales. The team has planned for this and it will surely help them to plan their business model to meet customer satisfaction.\n", "q2r": 5, "assessor": "z_assessor_2845", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7782, "q0": "Yes, this proposal effectively addresses the challenge, that being an overly centralized synchronization process. For independent artists and musicians, the ability to effectively transact peer-2-peer with those soliciting synchronization licenses is essential for the growth of the independent artist, and the music industry at large. With the quality of the music being the focal point within the world of sync, this platform/tool opens the door for an entire niche of artists who otherwise would not have access to such a tool. ", "q0r": 5, "q1": "Given the expertise of the team, an already live MVP and a niche market that demands such a tool, it is highly likely that this proposal will successfully be implemented.\n\nWith as many successful sync placements as Ian McCulluogh has had, he knows exactly the problem and with an already operating beta, the success is determined by the development and marketing efforts of the current team and individual hired for community management and marketing. \n\nWith tooling so specific to a given niche within an industry, I have no doubt that this proposal will be implemented successfully. ", "q1r": 5, "q2": "Given both the quality and quantity KPI indicators, the progress and success of the implementation of this proposal can be audited very effectively. The six metrics for quantity and quality can successfully illustrate a narrative that will dictate the outcome of how well the proposal has been implemented.", "q2r": 5, "assessor": "z_assessor_2921", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 15135, "q0": "This proposal wants to build a peer-to-peer and marketplace music licensing protocol called Free Music Land for licensing synchronization via NFT on the Cardano blockchain. The team made this recommendation because they realized that today's artists have to spend a lot of money to license and synchronize their music with ads, movies, social networks, video games, and more metaverse. The solution is to use Cardano's underlying infrastructure to build a peer-to-peer protocol to decentralize music playlisting, discovery, negotiation, and licensing for Sync. The result is a protocol that will allow artists, builders, and licensors (filmmakers, indie game developers, etc.) to issue and approve sync licenses. This will allow fees to stay low and middlemen to remain minimal. The problem has been identified and a solution is also clearly explained, I think this suggestion is very helpful and definitely achieves the goal of the challenge", "q0r": 5, "q1": "Talking about the implementation roadmap, know how long the project will last (here, about 1 year). However, I think the proponent should be more specific about the work breaking down the work of the quarters into specific months will give us a better understanding of the workflow of this project.\nNext is about the project team, it is proposed to provide 3 main members who will carry out this project, we also know their role in the project and their experience and their LinkedIn link and page number to get The above information can be verified. Besides, the group also said that it will hire 2 positions: General Council and Marketing / Community Manager.\nFinally, funding, the proposal needs 128,700 USD, of which 117,000 USD is paid to 5 experts to implement the project, with a salary of 25 USD / hour (I think this salary is quite low compared to the common ground). Besides, they also require 10% hedging, however, I think this part needs explaining because the budget is mainly used to pay the professionals, this 10%, in my opinion, is quite a lot of money to be reviewed.", "q1r": 4, "q2": "And finally about auditability, if this proposal is funded I think it is quite easily audited by the indicators provided by the author. The proposal takes care of setting goals and KPIs that will serve as a document for us to analyze the progress of the proposal. It's entirely possible to track results based on the different goals they set. And about project monitoring: this part is easy to follow, as the project will update the report on the Github page.\nThe success of the proposal is also very well defined as sync licensing is a viable revenue stream for casual musicians. When there is a fast and frictionless transaction between musicians and visual artists (in metaverses tags, video games, and visual media)", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15221, "q0": "This platform/marketplace proposal seeks to create a dApp that connects users via licenses for the synchronization of underlying media assets (here, the focus is music but this could be scaled to an audio/visual format).\n\nThe funds would be for the creation of the marketplace, the design and implementation of the protocol around the licenses, the development of a dApp to connect them and integration with existing opensource creator content licenses (think CreativeCommons).  This initial iteration of the project is somewhere between an MVP and PoC:  it is meant to show how a marketplace for any kind of sync licenses would be a valuable hub for peer to peer interaction on Cardano, generating transactions on both sides of the license, and downstream as the license was adopted by further syncing the asset.  But it will also be a valid marketplace for anyone who only wishes to use the existing opensource sync licenses, and in theory this part of the buildout would be fully functional in this first iteration, so that is more along the lines of an MVP.\n\nIn both cases, I think the proposer has presented a solid case for adoption of this protocol to help solve real issues facing creators, and in connecting creators and users in a decentralized way.  A full 5 stars for Impact.", "q0r": 5, "q1": "The team has experience in most of the right places, with both creator experience for the licensor/licensee side of the protocol, as well as the technical/design requirements needed to build the dApp and web infrastructure.  They also know what they don't know, and have dedicated budget space to bringing in dedicated legal counsel, which is critical, as anything built will naturally start at the level of copyright law, and then add the sync licensing characteristics.  Because the team is focusing on already available and robust licenses, these two factors mitigate the biggest risk which is the legal risk.\n\nThe budget is extremely small for a team of 5 over the course of 12 months, and I concluded that it was reasonable after looking through their Notions roadmap (kudos on that, btw).  A LOT of work has already been done, and the timeline and milestones show efficient usage of the time available (call it 18 hours per week, and now the budget looks a lot more suitable).  The addition of a 10% risk contingency should both straddle the multiple economic zones they operate in, as well as the long timeline as it relates to ADA price fluctuation.\n\nBecause the team has relevant experience, and has included clear requirements and budget outlays for the positions still to be filled, and because the timeline, budget and milestones all \"sync\" up, I believe this proposal merits a full 5 stars for Feasibility.", "q1r": 5, "q2": "They do a good job here of describing their overall approach to the auditing process, starting with the software development in the background.  This has the dual effect of grounding the project (often blockchain/artist integrations start to float off into the fuzzy future when it comes to measuring progress and impact, but not here).  As a software project, the hit the usual highnotes of Opensource Gits, agile project management, etc.  I expect the monthly auditing beats will be well populated by updates from their Notions board.\n\nFor their success metrics, they divide them up between quality and quantity, which is interesting.  Qualitative auditing is something the Catalyst community is only just getting used to, so I will be keeping an eye on the results here.  \n\nLastly, the team has created a website, that is primarily the PoC for the protocol, however you can reach them though it, and as well the development side and Project Lead both maintain professional profiles which provide another means of connecting up with them.\n\nAll in all I believe the team has been transparent in this proposal, and will be accessible over the course of the work.  Combined with adequate (and interesting) KPIs and metrics, I think this is a proposal that has earned 5 stars for Auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Build a peer-to-peer music licensing protocol and marketplace called Free Music Land to issue synchronization licenses via NFTs on the Cardano blockchain.", "experience": "Our team has 15+ of experience in software development and 10+ years in the and music business.\nOur MVP has already onboarded 12 musicians, 33 albums, and 222 songs. We have issued ~20 licenses for usage in sync, including a sync in a YouTube channel with 1.5M subscribers."}