{"id": 418778, "author": "marcus.puchalla", "title": "Enable Eternl", "url": "https://cardano.ideascale.com/a/dtd/418778-48088", "category": 26595, "amount": 90000, "description": "Without reliable funding, the ongoing operation of the Eternl wallet is at risk. Running costs of $15000/month are draining Eternl's reserves because we do not yet have reliable funding.", "f6_no_assessments": 10, "f6_rating": 4.233333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 100, "q0": "Eternl (formally ccvault) wallet is one of those shining starts of the Cardano ecosystem that has been decentralizing technology, community, access and on-ramps and off-ramps to the blockchain layer since early days. They rebranded to Eternl but the core philosophy of moving fast and providing a light Chrome-based wallet experience that keeps up with the technological progress of Cardano – has not changed. It provides many additional features for both novice and power users of the Cardano blockchain – and through that mission helps decentralize access to ADA. The proposers are essentially asking for support to fund Eternl's operating costs for 6 months – which amounts to $15000/month to pay for all current servers for six months, allowing everyone access to the multi-platform wallet. As Etrnl is one of the key DApp enabled wallets that is used extensively (me included) by the Cardano community, clearly this proposal belongs smack-bang in the heart of the challenge. Etrnl is not only a wallet, but also serves as a wallet that can be used (with its DApp connector) for linking to decentralized exchanges (Dexes), with NFT minting platforms and other emerging platforms. There is clearly need for facilitating the survival and expansion of this great wallet, especially as the bear market is on us. Etrnl (formerly known as ccvault) has shown it is capable of continuing the follow and push the envelope when it comes to Increased quality of existing products & integrations – this wallet even surpassed the achievements of the Emurgo-financed and backed Yoroi. ", "q0r": 5, "q1": "As stated in the proposal, the idea is to fund Eternl's operating costs for 6 months of $90000 for a six-month period in order to pay for the cost of running all current servers. This is clearly a feasible proposition as the team behind Eternl has provided a stellar service for a long period now. The team behind Etrnl includes developers of community stake pools [TITAN] TITANstaking and [AHL] AHLNET and they have the required competencies to continue with the project. I would have wished that the budget included more details on the spending as the lump sum of $15,000/month can certainly be quantified in more detail and the community can get a better idea of what Catalyst is paying for exactly. Why? Well, financial transparency always helps to build further trust and disclosing more info about the structure of financial costs would help promote the culture of transparency with treasury funds. Apart from that, full support. The team does not specify there plan for implementation as this is a project that has proven its chops with the successful operation of ccvault/Etrnl… Every voter can download the Etrnl browser extension and immediately utilize the wallet and see how well it performs. It is effectively a wallet with very advanced options and high level of customization – very different from the (full-node) Daedalus, which has its own forte. The resources for this proposal are clear in terms of implementation.", "q1r": 4, "q2": "In this kind of proposal, where the idea is to fund the continued operation of a service, DApp, platform or wallet that already has the necessary functionalities and is a proven and trusted component of Cardano’s ecosystem – the auditability is relatively straightforward. The team specifies that the continued operation and provision of services is “easy to determine”, which is true. The project’s goal of this project is to ensure the reliable operation of Eternl for its users – which is a considerable number. The team claims that one quarter of all mainnet transactions are posted via the Etrnl infrastructure. The team could have committed to provide some specific metrics to the Catalyst community to improve visibility of Etrnl’s use over the six-month period that requires funding – which would help the community assess whether the funding is being effective – in terms of Etrnl’s continued use and utility for the Cardano community. ", "q2r": 5, "assessor": "z_assessor_2047", "no_vca": 20, "ne": 7, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 835, "q0": "The company’s impact on our ecosystem is already huge: “around 25% of all Cardano mainnet transactions through its backend”, meaning the Eternl wallet is essential!\nWe can definitely affirm that the negative impact of them disappearing would be massive.\nDuring bear markets, market manipulations, or whatever cause the price of $ADA to dump, good companies can be financially endangered, that is why this proposal has been made.\nEternl is one of the most amazing products running on and with Cardano, in my humble opinion, it would be a shame not to help them, this proposal is in line with the challenge and was very impactful from the beginning.\n", "q0r": 5, "q1": "The Eternl Wallet is a must, the first wallet that makes you able to use Defi with smartphones, it tells us a lot about their ability to keep delivering amazing products to the community.\nThey are asking the community to help them cover the costs of the infrastructure for 6 month (15k $ per month), mostly to pay for servers.\nEverything looks realistic and the level of trust from the community is high.\n", "q1r": 5, "q2": "Auditability will be very easy, because the goal here is just to keep running & building during the next 6 months. The team has always been transparent and dedicated, so I guess we can be confident about them, and we can keep track of their work simply using their wallet and following their social media.", "q2r": 5, "assessor": "z_assessor_2138", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1513, "q0": "From the impact perspective, Eternl wallet has been widely used by the Cardano community. They propose an operational cost for their infrastructure and maintenance for this wallet. Eternl offer a wide variety of light wallet function, especially with dApps. This proposal sufficiently explained the sustainability of their project, but it only talks about covering their operational cost for 6 months without any further plan for their income. Briefly explain about their “Mesmerizing NFT project” would certainly help (because I assume TITAN stake pool income can’t cover the operating cost of Eternl). Overall, I would give it a 5 if they explained their future sustainability plan, and not just rely on Catalyst fund or their stake pool. For now, I give it a score of 4 since their wallet have been widely used in Cardano community, and it surely increase user adoption, especially in dApps.", "q0r": 4, "q1": "This project have been proved to be able to deliver to the market, since Eternl has been widely used by the Cardano community. Their team profile seems to be mostly anonymous, since some of it are freelancers. Although they’re able to deliver, I’d suggest to also create a core team. By having a consistent and core-team within the project, it will ensure the sustainability for the project for the long term. Speaking of sustainability, this project haven’t explore about it much other than just asking for fund to cover their operational cost for the next 6 months. Since maintaining server and infrastructure is a monthly cost, having a plan for subscription plan while also enable the free tier will certainly help. Speaking of cost, the breakdown isn’t clear enough. In Catalyst, it is a norm to break down your budget with clear and concise manner, e.g AWS server with capacity of 100,000 request per day with 100Gbit bandwidth ($US 7,500 / month). The proposal also lack of roadmap, timeline, and how they will implement the proposal. The roadmap should include their monthly target, and for implementation they have to explain how they will upgrade their infrastructure (a simple cost of things will surely help). With all that consideration, unfortunately I have to give this proposal a 2 out of 5 in term of feasability. This is my favorite wallet, so in for their next proposal I will reach them out to help for making these proposal to be better. ", "q1r": 3, "q2": "Eternl have been active on their Twitter profile, as well as their browser extension frequent update. However, the lack of roadmap and monthly target with KPIs will make it difficult for the auditor (who send the fund based on their progress each month, the Challenge Team) to audit the progress. A roadmap to explain what needs to get done in 1, 3, and 6 month will make it easy for the community to check the progress. ", "q2r": 3, "assessor": "z_assessor_2255", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4258, "q0": "While the proposal does not directly target the development of new Dapps or products, Eternl's wallet is a key piece of the Cardano ecosystem as it allows users to interact with Dapps.\n\nAdditionally, their integrated Dapp browser indirectly helps increase traffic to the listed Dapps and provides a better user experience for newcomers.", "q0r": 4, "q1": "The team's experience is not clearly presented in the proposal.\nAnd the detailed plan is short in details. A more specific list of tasks that will be carried out during the six month period would help justify the need for funds that are requested.\n\nHowever, Eternl's track record speaks for itself, being one of the first light-wallets to be supported on most Dapps currently running on Cardano.\n\nGiven the fact that the team is looking to fully fund their server's operating costs for the next 6 months, while still earning income from their stake pool and Dapp Browser, I believe there is good chance the proposal will be successful in keeping Eternl up and running.", "q1r": 4, "q2": "The success of the proposal can be determined by the community if they remain able to use Eternl in the next six months. This allows a continuous audit of their objective of keeping Eternl running.\n\nAdditionally, given that no new developments are covered by the proposal, two major tasks of the Eternl team will be to update their nodes following the July and October hardforks. This provides two major milestones to judge the ability of the team to keep Eternl running through the hardforks.", "q2r": 5, "assessor": "z_assessor_2534", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 4920, "q0": "Eternl, previously known as CCVault, is one of the more advanced value proposition wallets available in the Cardano space and, as such, facilitates the onboarding of new members to the ecosystem who find the UX/UI interface much more friendly and encompassing than that available at Yoroi or Daedalus for instance. As the proposers themselves state, Eternl's infrastructure is used by many power users, and 25% of all transactions on the Cardano Mainnet are processed through their servers. Therefore, ther is no understating the fact that helping sustain this pillar of the community during this time of drought would be to the benefit not only of Catalyst, but of the entire ecosystem. ", "q0r": 5, "q1": "Seeing as the wallet exists and is used by numerous Cardano community members, and that the proposers appeal to the Catalyst community is so as to ensure their continued operations for the next 6 months due to the fact that Eternl generates ADA revenue through its TITAN stake pool as well as through the DApp Browser feature, and at an ADA price of 1 EURO/ADA, the ongoing revenue would fully cover the server costs, but the current bear market is impeding full sustainability of their business model. Some bridge financing from Catalyst would ensure a timefram wide enough for the proposers to weather out the bear market, while finding alternative funding sources. There are no doubts that the team and their experience will continue to provide for the high-quality wallet services that Eternl has accustomed us to.", "q1r": 5, "q2": "Seeing as the goal of this proposal is to ensure the continued operation of Eternl for the following six months, its success will be publicly discernible by means of verifying the continuous and reliable operation of Eternl for its users (25% of all transactions on Cardano Mainnet), i.e. synchronizing accounts and submitting transactions, thus serving all users without any downtime within the six-month timeframe.", "q2r": 5, "assessor": "z_assessor_2636", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5586, "q0": "Eternl has managed to be one of the most used wallets because it provides an excellent user experience with an intuitive, easy to use and secure environment. It has facilitated and been one of the first wallets to connect with dapps. Its dapps connector provides greater security against phishing, which is why I consider that Eternl contributes to the Cardano ecosystem, attracting users due to its simplicity and being a secure gateway to the different Dapps in the ecosystem, promoting its use.\nIn my opinion, keeping it working properly and without risk of interruptions is in line with the objectives set.", "q0r": 5, "q1": "Eternl is a tool already developed and growing. As they well explain in the proposal, the financing will be used only to cover the maintenance cost of the servers for 6 months. Therefore I do not see any risk of viability of this proposal.\nIn the proposal they also explain that financing is necessary, due to the drop in the price of ADA below $ 1. It would be good to have ideas that allow mitigating these financial problems in the future, so that the project (especially if it continues expanding) does not depend on the price of ADA.", "q1r": 5, "q2": "The purpose of the proposal is to ensure the performance of Eternl in the next six months.\nThe operation of the wallet on the mainnet  without interruptions, with transactions and appropriate speed in the next six months, it will be verifiable that the proposal was carried out successfully.", "q2r": 5, "assessor": "z_assessor_2718", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7188, "q0": "The proposer presents the problem in which the operating cost of the Eternl wallet is much too high to sustain through bearish markets, which we are currently in (July 2022).The plan to solve this would be with the help of Project Catalyst to float the company for 6 months time to remain reliable and working for the Cardano community at large. The Eternl team has delivered a wallet that's been able to bring more users into the Cardano ecosystem by way of mobile infrastructure and multi-connective wallet capability, since many native wallets are becoming more desktop based, this creates limitations for users who have multiple wallets through different platforms. The impact of this proposal would be geared towards the safety of the Cardano community who use Eternl's services and help the company remain a constant source of accessibility for those wallet users. As markets adjust and the global economy is ever changing, it's important to understand these fluctuations are temporary. Therefore, the impact rationale for this proposal is given a 3 based only on the amount of Cardano community members who would suffer in the event of the Eternl wallet being shut down which would have a negative impact on many users in the ecosystem.", "q0r": 3, "q1": "The matter of Feasibility is not so much with regards to the proposer's ability to successfully implement the solution, rather the question of sustainability after funding is acquired if the company can survive until the markets grow by 50% (Cardano ADA price). The proposer and the team of Tastenkunst GmbH employees seems more than capable of completing the tasks which include operating and maintaining the server infrastructure of their existing Eternl Dapp and wallet service, as well as adding more hardware in preparation for Cardano hard forks that are inbound this year. No where in this proposal have the credentials been linked or stated by the proposer, which leaves more questions unanswered for the voters. There lacks any real sensible plan in the event of further market declination from the proposer, who states the only revenue for Eternl as it stands comes from the TITAN stake pool and through the DApp Browser feature (not specified). It would help this proposal's merit for success, if there was any plans to acquire more funding from outside sources other than Catalyst funding, which could increase the possibility of a more sustainable services for Eternl. The budget requested is estimated to cover 6 months operating cost ($15,000usd per month). This is not beyond the scope of possibility, but it would help if the proposer broke down these costs rather than lumping them into one for the sake of saving time. With the information provided within the proposal, the feasibility rationale is given a 3 based on the teams existing platform's success.", "q1r": 3, "q2": "The auditability of the proposal lies in the goal to ensure the reliable operation of Eternl for its users. If the wallet service does not receive funding this round, there is a high probability the Eternl wallet will encounter downtime which would affect it's users and the Cardano network (25% of all transactions stated by the proposer has yet to be verified by this PA and there is no link of reference to back those claims in this proposal). The roadmap and milestones remain the same; that if funded the Eternl wallet services will remain operational for the following 6 months. Beyond those 6 months, the proposer hopes to acquire additional funding from elsewhere to sustain the company and it's costs (not specified). There is no information provided by the proposer in regards to the team's tasks completion associated with Eternl, or any form of transparency viewable and verifiable for Project Catalyst and it's members if funded. A link to all available services by Eternl and community contact via discord and telegram platforms is shared here: https://linktr.ee/eternlwallet. With all of the information within the proposal, the Auditability rationale is a 2.", "q2r": 2, "assessor": "z_assessor_2883", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10384, "q0": "Eternl wallet is a new wallet on Cardano wallet. Although it is a new wallet, Eternl wallet has more functions than many other Cardano wallets. Eternl wallet is also well received from the community. As an Eternal Wallet user, I really like its options. The proposer wants to apply for Fund 9 to have enough funds to maintain and develop Eternl wallet. And now Eternl wallet also plays an important part of Cardano. The funding for Eternl wallet also helps maintain the sustainability of the Cardano ecosystem and encourages many other applications to develop on Cardano ecosystem.", "q0r": 5, "q1": "Eternl wallet team consists of Tastenkunst GmbH employees and freelancers. Tastenkunst GmbH employees are an experienced team, and they are running eternl wallet project very well. Because the price of Ada is falling in the bear market, they need funds to maintain the project. They suggest $90000 to maintain it for 6 months. They have recommended 2 key milestones. They will conduct a hard fork in July and a hard fork in October/November. In the future, their goal is to find a sustainable solution that will make the project profitable and continue to grow. Their project is very potential and has the ability to develop in the future.", "q1r": 4, "q2": "They have key metrics to measure project progress. For example, their target is 25% of all transactions on Cardano Mainnet submitted through their platform. Eternl wallet is also aiming to become a decentralized project. I also follow their twitter and discord. I see that they update their progress regularly as well. The community can track the project by visiting their website and Twitter.", "q2r": 4, "assessor": "z_assessor_3183", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11850, "q0": "From impact standpoint, Eternl is one of the widely-used light wallet in the Cardano community with the support to connect with Cardano dApps, and providing operational cost for 6 months will certainly help the team to focus on upcoming features and also supports the Cardano ecosystem since Eternl serving around 25% of Cardano Mainnet transactions. The proposers mentions about the monthly cost to run the project’s infrastructure and their preparation for Cardano network upgrades, but the proposal lacks of plan for their sustainability plan regarding the further operational cost funding, not to mention the hardware upgrade that might increase the operational cost. Providing next steps to help cover the operational cost outside of relying on stake pool would give a clear sustainability plan, considering the potential increasing costs from infrastructure upgrades. Overall, Eternl will no doubt support the growing Cardano ecosystem especially with their support with Cardano dApps, but providing future sustainability plan to reduce further monthly cost would also be great.", "q0r": 4, "q1": "Eternl is a well-known Cardano light wallet in the community, proving that the proposer team managed to deliver a reliable product, and competent enough to keep the project running and planning further improvements to the product. Although, providing more details about the members (providing LinkedIn or GitHub page might help) and their position in the team would give a better evidence about the team’s ability in maintaining the project.\n\nThe proposal provides the approximate cost for maintaining the server that includes necessary infrastructure upgrades for upcoming Cardano network upgrades, however, there’s no clear roadmaps and timeline about how the team will maintain the product’s infrastructure, and budget breakdown and further details about the current infrastructure and planned upgrade specifications. Splitting and specifying budget breakdown for current infrastructure operational cost and planned infrastructure upgrade costs would provide a better detail on the planned budget.", "q1r": 3, "q2": "Eternl has an active Twitter account and a Discord group to communicate their product updates. However, the proposal lacks of roadmap and metrics for the duration of 6 months to provide the project’s improvement plans. Providing roadmap / monthly targets regarding project’s preparation for Cardano network upgrades mentioned in the proposal would help voters and auditors to understand where the proportions of the funding will go to in each month.", "q2r": 3, "assessor": "z_assessor_3296", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12887, "q0": "Because of its portability, ability to connect with the majority of DEXs, and convenience, the Eternal Wallet is currently one of the wallets that has the most options available. It is also trusted and used by the majority of users in the Cardano ecosystem. Creating tokens on the network is a relatively simple and quick process. Because there are numerous benefits associated with Eternl Wallet, the development team for the team is currently short on funds to continue the activities associated with the project. As a result, the team has considered Catalyst and requested funding from the fund. This is a very common thing to do in order to maintain activity, and it will encourage the development team working on the project to work harder on the wallet.\n\nAdditionally, the proposal includes an offer to submit an application for operating funding for a period of six months, the funds from which would be used to pay for Eternl's infrastructure. I believe that the user experience has the potential to become significantly more satisfying as the underlying infrastructure undergoes development. Your team has brought up the possibility that the company that is responsible for Eternl, Tastenkunst, could go out of business, and you have also brought up the fact that this is only half of the company's operations, so it will have an impact. The advantage is not all that substantial. The proposal is an excellent response to the challenge, and it will pave the way for a future in which more people are familiar with and make use of the Eternl wallet. Cardano aims to develop a wide variety of decentralized applications (Dapps) for the Cardano ecosystem, as well as encourage the growth of businesses and projects that want to create wallets for use within the Cardano ecosystem. I will award five points for the impact of this.", "q0r": 5, "q1": "Since all activities pertaining to the wallet are still operating normally and very smoothly, I do not anticipate any issues with the project's roadmap. You have mentioned the hard fork twice, once in July and again in October (estimated), which means that updating and upgrading the wallet is a necessary and very normal thing to do. I am looking forward to the new interface when it is released at the end of this month. This 7.\n\nRegarding the cost of the proposal, you mentioned that the monthly operating cost for approximately fifty servers is fifteen thousand dollars; therefore, if you apply for funding in the amount of ninety thousand dollars, it will be used for sixty weeks (just the cost of the operating costs), which I believe to be reasonable. Your team from Tastenkunst GmbH has been validated and recognized by the community as a result of the project's popularity and widespread adoption because of its success. If it's not funded by Catalyst, you are still operating fine, and if you want to have many sustainable revenue streams, there is no problem. It's a company. The team has also been honest in stating that you have many other sources of income from the wallet, and if it is not funded by Catalyst, you are still operating fine. This feasibility earns a score of 5 points from me.", "q1r": 5, "q2": "You have stated that once you get funding, the possibility that more users will know and use the wallet (25% of the users in the Cardano network), I think that number is positive given the time period is 6 months. Since the project only applies for funding to pay for the infrastructure of the wallet, so it is also possible that you give 25% of users after 6 months of being funded. But there is one problem that I would like to contribute to the group: in my opinion, you should provide the most accurate number of visitors, the number of new wallets created each month, so that you can see the difference. step-by-step development of the wallet. (for example, after 1 month how many new wallets are created, after 2,3,4,5, how much is the month, the number of connections with DEX exchanges when using the wallet will increase from how much % to how much? %...). So I give this auditability 4 points.", "q2r": 4, "assessor": "z_assessor_3497", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We are asking the Cardano community for their vote to fund Eternl's operating costs for 6 months. This will support our current setup plus additional capacity for a growing Cardano user base.", "experience": "A large number of Cardano users utilizes the network thanks to our infrastructure. Eternl is currently serving about 45000 accounts on a daily basis, broadcasting around 25% of all Cardano Mainnet transactions through its backend."}