{"id": 418751, "author": "koandak", "title": "Plutus Lottery ADA Game", "url": "https://cardano.ideascale.com/a/dtd/418751-48088", "category": 26595, "amount": 45000, "description": "There are not enough developers in Africa working on projects related to the Cardano Ecosystem.", "f6_no_assessments": 7, "f6_rating": 2.904761904761905, "videos": [], "media": [], "f6_assessments": [{"id": 1689, "q0": "The idea is good, but it is not adequately explained, so our understanding of the impact is greatly impaired. First, the problem statement doesn't make much sense with the proposed solution. The problem is, not many developers in Africa work on projects in the Cardano ecosystem. How could this be solved on the basis of creating a lottery, in which anyone could participate by playing with the investment of only 1 ada? According to the proponent, this relates to the challenge as the project will bring and educate many users in the Cardano ecosystem, directly addressing the topic of the campaign brief: “Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases”. However, we do not have a good view of what the Ada Game Lottery would be like, we know that it is done through a smart contract developed in our programming language (Plutus), but what would the interface look like? How would players send 1 Ada? If it's through your digital wallets, would you be charged transaction fees? When the cycles are over, players would be notified, in addition to the winner, that they would see the prize fall into their wallet, as is explicit in the excerpt “Each cycle will last 2.5 days or 2 winners in 1 season, but this is something that can be defined in any range. After each cycle, a winner will be selected and the funds will be sent directly to users' wallets and the cycle will start again the next day”? Anyway, as much as it is a good idea, more explanations would still be necessary for us to really understand in a solid way the impact and how the project would build a really beneficial dApp for Cardano.", "q0r": 3, "q1": "The proposal script is ok, we know which activities would make up the first phase of the project development and also how long they would last, for example: “Determine the Project Structure/Continuous Integration (CI) (Duration: 2 days) + Concept of Design/Tools Development (Duration 4 weeks) + Project Development/CI and Continuous Deployment (CD) (Duration: 8 weeks)”. In phase 2 it is not very clear what work will be, all that is said is that “we will make ongoing requests for phase 2 and the implementation of ideas from others”. Like this? I think the activities could be explained in more detail so that we have more information about how each part would be done. I also think that we could know in which months of the year the phases are planned to start and start, because the way this information is passed on, we don't have such an adequate understanding of what would happen when. The costs are explained in a basic way, for example, of the 45 thousand dollars, 31 thousand are destined for the team, but we do not know the individual salary of each professional involved, the value of their working hours, etc. What would the attorneys' fees be, what kind of things are related to the law on this project, how can that cost us 15% of the budget? Why is it necessary to set aside such a large amount for unexpected expenses, and if this amount is not used, how will it be spent? The team presentation part is also ok, but could improve. That said as the descriptions of the members involved are quite short, for example in “Jose Ignacio Vazquez: Senior software engineer, front-end architect, tech writer, meetup speaker, scuba lover. Passionate about software architecture and knowledge sharing”. We know in a basic way who we are dealing with, however qualified they are, I would like to understand in more detail their CVs and previous projects, it would be good to have their linkedin profiles provided as well. For these reasons, I think the topic in general is ok but still needs a lot of improvement.", "q1r": 3, "q2": "Unfortunately this topic leaves a lot to be desired, we have very little information on how this project could be monitored. For progress all it says is “We will implement DevOps tools to track and measure our progress”. What do you mean, what would these tools be, how would they audit the project's development process? It would be necessary to have safe ways to monitor not only the development of activities, the work routines of the professionals who were presented to us on the part of the team, but also the partial results, advances and successes, even if sensitive. It would be necessary for the team to make all this information available to the members of our community, so that we could really understand what would be done, how it would be done, what results we should expect at the end of each month and so on. About success, it is also superficially defined, success would be the launch of the project on the testnet - but how can we be sure that the objectives of the challenge would have in fact been met? We need to have qualitative and quantitative data to prove that this application was of high value to Cardano, which achieved the objectives of the challenge, which are basically to foster the activities of our ecosystem through the production of dApps, products and integrations - as we can check if it was noticed an increase in the number of active members in our community, from Ada in circulation, more CNFTs in our network and etc? So I think the topic should be rephrased, that final research should be done not only on the launch of this lottery but also on the impact of this on the Cardano ecosystem, and such research should be passed on to community members, or through a video on youtube, presentation in townhall, some more extensive final report and so on.", "q2r": 1, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1470, "q0": "Under consideration is the creation of a Plutus scripted lottery game at the cost of 1 Ada per game. The intention is to engage and involve a global community by participation in a game that most people can afford to play. Also envisioned is onboarding of new people to Cardano and increasing of adoption by structuring a low cost lottery game. The idea that gaming and lotteries bring people together is proposed and the developing team represents a culturally diverse group so hopefully this idea is realized. Multiple elements of the strategic goals and the challenge criteria are met by this proposal.", "q0r": 4, "q1": "In terms of feasibility, the team certainly has the educational and technical background to develop this project. Abdoul is an SPO and graduate of the Plutus Pioneers as is Qin Li, who also reports working as a cybersecurity professional in a top 10 fortune 500 company. The team is rounded out by Jose who reports his relevant background to be as a senior software engineer and front end architect. Full disclosure, this proposal is was previously unfunded in round 6. A detailed budget breakdown and funds distribution lends further credence to the ability to deliver this project. One question I would ask of the team is with all the experience you folks have in Plutus, why would it be necessary to contract a company to build the smart conract?", "q1r": 4, "q2": "The main metric provided to assess progress towards project completion is the Github repository associated with this game. It is also claimed that tools will be created to track progress but no specific tools or associated timeline is provided. In general, it is always preferable to have more KPI’s to enable the incremental rate of progress which can lead to the disbursement of funds. It would also be helpful to specify what DevOps tools will be created, what metrics they will measure and when those tools will be available.", "q2r": 4, "assessor": "z_assessor_2252", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 1787, "q0": "The problem identified by this proposal (not enough Cardano developers in Africa) does not articulates well with the proposed solution to create a team that will work on a lottery game. \nClaiming that lotteries bring people together does not sound like a strong point for impact, and bringing people together is not an objective aligned with the challenge.\nAlso, using this project in an education purpose does not align well with the Dapps, Products and Integration Challenge. \nThe short description of the smart-contract based lottery system reminds a lot what has been developped in the open-source project \"The Open Source Cardano Lottery\". It makes me think that most of the work is already done, and that only parameter change would be needed.\nI recommend to refine the description of the problem and solution and to apply in a more appropriate challenge in a further Catalyst Fund. I still give 2 stars, as a lottery is \"product\", which is one of the challenge objectives.\n", "q0r": 2, "q1": "The description of the team members gives clear indications that it gathers the relevant skills to make this development successful (Software development skills, plutus pioneer, experience in smartcontracts). The development  is expected to be 14 weeks long, and 5 main milestones are identifed.\nThe risk analysis and mitigation plan would need to be refined \"delay\" or \"complexity\" are not enough detailed. You could for example list : security, plutus script size limit, legal risks. \nI recommend the proposer to add more details about the lottery mechanism (little is said, apart from a generic fund distribution description). As it is the heart of the project, its principles should be further elaborated.", "q1r": 3, "q2": "The definition of the goal lacks precision \"test and launch on testnet\". For example, at the begining of the proposal it is mentionned that the goal is to educate developers to Cardano smart-contract and Dapps : how many of them do you expect to train ? If the lottery is launched, how many users to consider it is a success ? \nThe proposal also lacks details about how the community will receive information to monitor its development. \"Implementing DeVops tools\" is a good intention, that needs to be elaborated in the proposal. I recommend to include weekly progress reports, and to mention a public channel (Twitter, Discord etc.) where these reports will be made available for the community.", "q2r": 1, "assessor": "z_assessor_2264", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 1939, "q0": "The problem statement in this proposal makes it unclear what the purpose of this project really is. It is stated: “There are not enough developers in Africa working on projects related to the Cardano Ecosystem.”, does this imply that the proposal aims to employ more Africans to Cardano? In that case, the proposal should be submitted in the “Grow Africa, Grow Cardano” challenge setting.\nBut the more confusing part is that the rest of the proposal does not emphasize African projects, rather the lottery project. This makes it a bit contradictory when the purpose could be either one of the alternatives, and it will be subjective to each voter what they think. A suggestion is to choose a direction for the proposal and streamline its purpose against that criteria. As it stands now, it is hard to know if we should assess this proposal against the “DApp” challenge or the “Africa” challenge. Instead of guessing, a neutral score will be set and the proposers are encouraged to clarify this in future funds if they fail to get funded this round. 3 points, neutral.", "q0r": 3, "q1": "The proposing team has the experience required to bring this project to life, given the merits listed in the proposal. A favorable addition would be to attach LinkedIn profiles or something to further back up these claims in order to increase the credibility. \nThe detailed plan outlines Phase 1 in a somewhat detailed manner, but it is unclear what the purpose of Phase 2 is. It is stated that it will further develop the project, but it is not clear if the funds requested are sufficient enough to cover Phase 2. A suggestion is to make this more clear by providing what the plan for Phase 2 is. Also, the budget is outlined but it is not estimated how many hours and what amount of work goes into each sub-phase. Will all team members dedicate 8 hours a day during all the sub-phases? What is each team member's hourly rate?\nA simple solution to these questions is to add what is being done, how it's being done, and by who, at each sub-phase.\nOverall, the proposal has an experienced team but there are some question marks raised above that makes it hard to determine the feasibility of the project. As a result, the score given is neutral, 3 points.", "q1r": 3, "q2": "This proposal is unfortunately quite sparse in terms of auditability, it will be hard for the community to properly audit the development and success of the project. The following points could make this proposal great in terms of auditing:\nAddition of relevant KPIs i.e. measurable metrics that can determine the and define the success of the project. Some examples could be 1000 users by the end of the year, 100k Ada inserted in the lottery pool by time x, etc. \nThe success is defined as “Success for this project will be able to test and launch this project on the testnet.”, does this goal refer to a POC or the finished product? This could be clarified so that success could be evaluated with a [Yes/No] question at the end of the deadline. \nA public channel should be provided where you deliver regular updates about the progress in order for the community to audit the project during development as well.\nTo sum it all up, the proposal is not optimal in terms of auditability in its current state but with the above mentioned points you could turn that around. For now the score is 2 points. ", "q2r": 2, "assessor": "z_assessor_2290", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5592, "q0": "I really like the concept of this proposal, it's simple, uncomplicated and would allow many people to unite within the ecosystem with a small dissemination effort.\nGamification is a novel and effective component to increase engagement with the audience, which is why I consider that this initiative, although it may seem small in scope, I believe that in the long run it can become a snowball effect that generates rapprochement and visibility to the entire Cardano ecosystem.", "q0r": 4, "q1": "The concept is simple and the plan is well detailed as well as the budget breakdown, however I think the team falls short as they only go as far as the construction stage and for this project to be viable it needs a lot of users.\nIt would be ideal for the team to propose some of the ideas it proposes to disseminate and publicize this initiative, so that it does not become a functional mechanism without users.\nI kindly appreciate the team considering including this stage within their scope.", "q1r": 3, "q2": "The team mentions that they will launch DevOps tools to measure progress, however this term is somewhat confusing for users who do not have a technical background.\nI would appreciate it if the team clearly listed the KPIs through which not only the construction stage of the project will be measured, but also once a viable product is available, it can be put into circulation and its usability is correctly measure to understand the impact that a gamification project of these characteristics can bring as a benefit to the community.", "q2r": 3, "assessor": "z_assessor_2719", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12957, "q0": "The proposal addresses the challenge that their is not enough  developers in Africa working on the projects related to the cardano eco system . The proposer aims to setting up of decentralized team to work on a project that will increase adoption by creating lottery games in which everyone can take part for just 1ADA .By this many of the new people will be attracted into cardano ecosystem and join and learn about the cardano .The proposal clearly adds value to the cardano eco system. Upon reviewing the proposal The key metrices and goals of the proposal align with the outlined challenge settings.\n", "q0r": 4, "q1": "The proposal's two phases are broken down into a thorough plan that includes a timeframe and important milestones.\nThe proposal offers a full explanation of phase 1, which includes determining the project's framework, designing concepts and development tools, developing projects using continuous integration, and analysing the project's quality.\nThe timescale offered by the proposal appears to be quite reasonable, and the proposal's budget breakdown is described in great detail. The proposer has also supplied information about the team who will be implementing the proposal as well as the expertise required to do so. The proposal has taken into account both the risks and obstacles to the project's successful implementation. ", "q1r": 4, "q2": "DevOps technologies will be used to track and evaluate our development.\nThe Metrices/mentioned Kpi's in the proposal determine its feasibility. The challenge has been presented by the proposer in a way that is both obvious and understandable, and the strategy for its effective implementation is also described.\n", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 13432, "q0": "Probably statement is lacking. I suggest the proposer to explore more on why a possibly decentralized lottery system is a lot better than the conventional lottery games. Also, how this would bring people to the Cardano System?\n\nI understand that casino and chance base games do have massive popularity but to have them move to the proposed game rather stick to what they currently have needs details. These would allow us that the team understands the IMPACT it does bring to the ecosystem and the suggested solutions are aligned. \n\nThere’s definitely a potential here given that gambling has a billion-dollar market (source: Global Gambling Markets Report 2022-2026 & 2030 @ prnewswire.com), but not on its current form. This is a very competitive space. \n", "q0r": 3, "q1": "With a 45.000.00 USD cost with only two functions (register and winner selection) doesn’t give me confidence just yet that it would do well. Almost 4 months’ timeline is quite long for a lottery game that picks a random winner from a list of wallets you transferred an ADA. \n\nI recommend to include a detailed breakdown of the expense. Simple saying that 31.000.00 will be allotted for smart contract and UIX doesn’t give us the assurance we need that money will be well-spent.\n\nSaw on the repository that there are drafts for governance tokens and dividend tokens, I hope that this can be clearly explained as well. Especially when it was noted that more than 51% of the governance tokens will always be held by the CORE TEAM. Quite counter-intuitive for “decentralization”, I sure hope that was intended to be temporary. \n\nFund distribution which I assume was meant for the ADA receive for game participants needs working and justification. Pretty sure the team have their reasoning for the numbers presented, hoping these can be explained to us as well. 9% fund will be used to support a small pool – this is indeed a noble idea but given that staking is fluid , might be a good idea to explain as well what these funds will be used for other than piling up and staked. \n", "q1r": 2, "q2": "Good for the team to use DevOps tools to track progress, but the community is interested in transparency. Please mention links on where we can access your PM tools. \n\nThere’re numerous ways to measure success. Launching a working product is just the start. Measuring performance through reception, TVL, feedback, social engagement etc. should be expected as well. Please work on the performance indicators as there’s no other mention in the proposal. \n\nI honestly hope that you consider my feedback to have the proposal in better position and execution in the coming fund cycles. \n", "q2r": 1, "assessor": "z_assessor_3644", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We propose to create a decentralized team that will work on a project that will further bring adoption by creating lottery games that which anyone can participate just with 1 ADA.", "experience": "Abdoul Koanda: Stake Pool Operator of Faso Pool, graduated from Plutus Pioneer Program first cohort\nJose Ignacio Vazquez: Senior Software Engineer, Front-end architect\nQin Li: Work as a cyber security professional/Plutus Pioneer Program First Cohort.\nCanonical Company"}