{"id": 418735, "author": "davidtuan", "title": "Helps you keep ADA longer", "url": "https://cardano.ideascale.com/a/dtd/418735-48088", "category": 26595, "amount": 10500, "description": "Investors are dominated by emotions too much in investment and easily psychologically fluctuate by negative and positive news every day.Helps you keep ADA longer.", "f6_no_assessments": 7, "f6_rating": 3.9523809523809526, "videos": [], "media": [], "f6_assessments": [{"id": 12626, "q0": "The proposal fits the challenge setting, creating a smart contract that helps users lock their ADA amount is quite similar to Staking but Staking has a limit on locking time, this project will meet the need to lock coins investors' numbers are longer.You mentioned the huge profits that holding ADA brings to investors, but I think this is still very risky. But anyway, users who have trusted ADA and really want to lock this digital currency will have to understand the ADA price risk and be responsible for their own capital. I very much welcome this project, if it attracts the community and many users, it will stabilize the price of ADA making this digital currency strong and potential.", "q0r": 5, "q1": "The proposed route is quite detailed when it comes to specific time periods along with who will be involved in each process. I have no opinion on this part of the proposal, the budget is pretty well explained as well. The member information shows that the team has a lot of experience in related fields, and the total workload is appropriate for the number of team members. All of the above makes me very satisfied with the feasibility of the project.", "q1r": 5, "q2": "The proposer clearly states that the work done and completed is updated on the project's notification channel for the community to easily track progress. With such a clear and easy-to-understand project, the success of the project is completely justified and I do not ask for anything more, the work allocation and risk management are very good for the project can be completed on time.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12886, "q0": "When a speculator is required to constantly monitor an electronic chart, his state of mind will be significantly influenced by the unending fluctuations in the value of the market. It is therefore a good idea to create a smart contract in order to lock the ADA of people who truly want to invest and see the future of Cardano. This approach is suitable for the challenge. As a result, users will be able to confidently do other things without having to worry too much about the price of ADA, which will promote development but may result in a higher price explosion in the future.\n\nIn regard to the risk that you have presented, there are two primary risks, and the way to overcome those risks is quite reasonable; however, I would also like to contribute another part of the risk, which is when the price of ADA explodes too soon, prior to the deadline. Even though the smart contract you are writing has not yet been unlocked, the user really wants to take profits because it has reached the threshold, and the investor believes that this price is also reasonable. Because of this, you should design a different kind of smart contract that locks the user's account until the user enters a certain price, after which the user's account is unlocked automatically so that both users and investors can make a profit. to protect against the possibility of the market continuing its current downward trend. Therefore, I give this impact a score of 5 points.", "q0r": 5, "q1": "Since the beginning of the project nearly four months ago, a development plan has been in place, which includes specific tasks and completion times calculated by you in a very reasonable and detailed manner. Ensure that the amount of work is distributed fairly among the members of your team, taking into account the capabilities and knowledge of each individual member. A reasonable distribution of the work\n\nIn regard to the cost of the project, which is also quite reasonable when compared to the average salary of Vietnamese people both per hour and per month, I have no doubts about your fees and routes. Your team consists of two people: Tuan Anh, who has many years of experience in Blockchain technology, and Mr., who has successfully completed the Plutus Pioneer Program. Tuan Anh has the ability to develop a community that will attract users. Demonstrate that your odds of succeeding are extremely high. This feasibility receives a score of 5 points from me.", "q1r": 5, "q2": "It is true that this project is one that can be completed quickly and on schedule if the upcoming work that the team can do once the funding is funded is taken into consideration. You have also provided yourself with a link to Telegram, where you will provide a summary of the project's progress and updates as they become available. You have also set a specific goal for yourself of 30 users per month and 30000 ADA locks per month. I believe that this goal is attainable and that you will have no trouble accomplishing it. Finally, once the project has been successfully implemented, I believe that a significant number of people will use your services. This is not only due to the numerous benefits that your company provides, but also because it allows investors to carry on with their work without experiencing any anxiety. ADA, without being overly influenced by the market and the price of ADA, contributes to the community's development of a greater awareness of the Cardano ecosystem. Therefore, I will award this auditability with five points.", "q2r": 5, "assessor": "z_assessor_3497", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13661, "q0": "This proposal creates a solution for those who have bought Ada and want to keep ADA for a long time, instead of rushing to sell ADA when the price increases by 30%, 100%, now thanks to this application investors can rest in peace. that they can hold ADA longer than they think. Wait until the ADA ecosystem is complete, then the price of ADA will increase very high and bring persistent investors a lot of money.\nHelp the ADA ecosystem become more stable without being affected by investors' sell-offs. Giving application developers more peace of mind when building applications on Cardano, thus this proposal effectively addresses the mentioned challenge", "q0r": 5, "q1": "The plan has a very high chance of success, as the proposal does not require any help from external, 3rd party partners, where they already have\na complete team with sufficient experience and skills to complete the proposal.\nAt the same time, they have experience in Fund8 and are trusted by voters to support the proposal. So there won't be many problems. The implementation cost plan is easy to understand and reasonable.", "q1r": 5, "q2": "\"The author has clearly mentioned his experience and team members very clearly. The roadmap and timing and implementation members are very clear. This is an extremely detailed proposal that I have. enjoyed in Fund9 this time.\nThis proposal has provided a clear and great target, even the author has an advertising plan to attract more investors to use this application.\nThe proposed efficiency indicators are given very specifically with specific numbers. Helping to confirm the success of the proposal will have the effect of increasing the number of transactions and users.", "q2r": 5, "assessor": "z_assessor_3725", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 15154, "q0": "This proposal aims to deliver an application that will help ADA holders to lock their funds for a predefined period of time, something like \"lock and forget\" for years, and it seems that is aligned with the Campaign settings. Regarding the impact to the Cardano ecosystem, I do have some concerns that this Dapp will have a significant one.\n\nThe proposer presents an analysis of the potential revenue (in FIAT) if someone would hold ADA and ETH since the ATL until the ATH. This is the ideal situation that could work for the early adopters but with the current prices and price evolution it is difficult to anticipate if the price will go down or up and by how many orders. Another drawback could be the no-revenue part of locking funds for so many years. There are CEXs and even DEXs that offer interest for keeping funds on their platform, with the associated risks. Also, today we have the possibility to stake ADA in a pool and to gain some rewards. The question is: why would anybody lock, for a long period of time, the funds, just for an hypothetical rise in value, translated to FIAT, and not making use of them in a more efficient way (staking, voting, providing LPs on DEXs etc)?\n\nAnother unclear aspect is the statement of the proposer about \"helping many users will get used to using NFT or blockchain in life\" by using this Dapp, but is not clear what NFTs have to do with it.\n\nThe proposer has considered some challenges that are to be taken into consideration, long term, and offers solutions to mitigate them, but there is no plan articulated for project's future sustainability.\n\nBased on the info provided (or missing) in this section I give a rating of 3 starts.", "q0r": 3, "q1": "The budget is broken down into identifiable items and it seems reasonable for what is to be done. On the other hand the timetable is not presented in a clear way. It seems that the project will last for the 4 months, but the working load is presented in estimated days and is unclear how these days are distributed monthly. For a clear view it is recommended to break the working days by month and also to set deliverables for each completed month or period of months.\n\nThe team consists of 2 members and each has the info about their skills and experience sustained by links, and also is clear what roles they do have for this proposal. Mr. Hoi seems to have the necessary programming experience to develop the smart contract as it seems that Solidity is well known for him, but I think more evidence is required to emphasize his interest in Haskell/Plutus as well. There is just a brief note about completing a Plutus pioneer program (which cohort? it will be completed until the start of SC development?)\nThe proposal lacks in providing relevant info regarding the architecture of the developed smart contract (the interface, the business logic, the state at a given time etc.) or the tools that are to be used (Marlowe?, any SDK for the REST API?, how about the wallet integration?). With just brief statements about SC there is no clear image for the community regarding this aspect.\n\nBase on the info provided in this section I give a neutral rating of 3 stars.", "q1r": 3, "q2": "The proposer makes a reference about some Telegram channels that can be used to provide updates about the project of this proposal. It is recommended to have a mean of communication for the technical aspects of this project (GitHuB, Jira etc.) for better transparency.\n\nThere are KPIs/metrics defined in the Auditability section which will measure the number of locked ADA and by number of monthly users. The proposer should state more clear if \"user\" is somehow related with \"wallet\" or what it means precisely. Also other metrics that are to be taken into consideration are the number of transaction through the SC and the volume of generated fees from these transactions.\n\nThe definition for success is presented somehow vague as is unclear the meaning of the following statement: \"More investors will be loyal to Cardano\" as there is no clear understanding for what loyal means.\n\nI rate this section with 3 stars.", "q2r": 3, "assessor": "z_assessor_2336", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15344, "q0": "I believe there's just a few people who thinking to create a smart contract that lock their ADA in a smart contract, and Proposer is one of we know, nice! The idea of this proposal is quite simple, but Proposer can explained it in a fabulous way. The smart contract will help ADA believers to lock their ADA in their wallet. There will be a question by community who want to try this ADA locking smart contract: \"Will our locked-ADA still receive staking rewards?\" Proposer also could explain that later if get funded and have to develop the smart contract. There is already a community wallet implementing the ADA locking feature on its platform and the maximum locking period is only for half-year. For the reference, proposer can read this topic in Cardano Forum written in Misc-Dev Talk: https://forum.cardano.org/t/how-eternls-staking-vault-works/100023 and modified some of their smart contracts to provide much longer locking period for the community.\nOh, one thing to note: where will ADA believers could find and interact the smart contract? Are Proposer will create a \"Locking Your ADA\" website and put the smart contract in there? Or Proposer will contact every community wallet who still don't have the ADA locking feature and offers them to provide Proposer's feature? I think that's one of the things that should be provided in this proposal as well.", "q0r": 4, "q1": "Proposal's Feasibility is a well-written section. Proposer provide sufficient detail information for community to understand what will they do after get funded. Team experiences are enough to believe that this project will smoothly run and will help the ADA believers lock their ADA for shine-bright future as Crypto Millionaire.\nI hope the availability of similar smart contract (which I attached the link in the Impact section) can cut down the programming smart contract and Proposer could use the remaining time to be more guerrilla in marketing the ADA-locking feature to the community.\nBudgets breakdown are make sense. Proposer already wrote the detail in such a good way. The smart contract developer hourly rate seems not in standard rate (I search in Google: the standard solidity developer is $110/hour). It is make sense, since Mr. Hoi is in the process to completing the Plutus Pioneer Program.\nOverall like I said, the Feasibility section of this proposal is great!", "q1r": 5, "q2": "The auditability section is simple-written and it is easy to understand for community. And I also believe with Proposer's statement that the project will be completed on time because their experiences. I think Proposer should hire a third party to audit the smart contract before launch them for the community.\nBeside of that, I agree that there is just two number can be measure in this project: Number of members who lock their ADA & Number of ADA locked. Those two things are enough to be a successful metrics for this proposal.", "q2r": 5, "assessor": "z_assessor_2553", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15351, "q0": "The purpose of this challenge is to promote initiatives that can have a high impact on the Cardano ecosystem, creating a larger adoption radius among users, unfortunately I consider that this product does not meet this objective.\nThe financial principle on which it is based is a HODL strategy under any circumstances, which may be appropriate depending on the profile of each investor. However, what the product documented here offers is only to relieve the user of control of his assets by creating a smart contract that will prevent access to them during the period initially selected. I believe that although the proposed use is very limited, there are possibilities that could have complemented this idea to make a less rudimentary product that offers greater financial benefits, however the vision seems to me to be very limited.", "q0r": 1, "q1": "I believe that what the team proposes can be successfully executed, even the budget and work schedule are clear and concise, so that a construction and implementation of the product is very possible due to the simplicity of their idea, and the simplicity of its design. However, I consider that this is precisely one of the weaknesses of the project, since the only thing that this product can offer is to take away from the user the ability to manage his money. Some possibilities that I consider could complement this proposal are:\n-Offering an emergency exit so that the user can regain control of his assets before the specified period is over, (although this would invalidate the original purpose).\n-Propose that the retained funds be staked, as well as mention the use that would be given to the rewards generated.\n-Generate alliances with influencers with experience in DeFi so that the user has access to educational content that allows them to manage their resources.\nI consider that the principle that the team uses as main thesis is flawed, since not all crypto projects have growth, even projects with good foundations and properly built; an example of this is Algorand, since people who invested in $ALGO when it just came out in 2019, were not able to recover their initial investment and even today are still in losses, therefore, holding for an arbitrary number of years does not guarantee returns, and will only cause the loss of liquidity of users.\n", "q1r": 1, "q2": "The auditability section is weak since the parameters used to measure the success of the project are very subjective and in some cases confusing. 2 numerical metrics are offered however they do not have any justification to understand why 30 users per month would be a good goal or what benefits managing 30,000 ADA would bring to the community, seeming rather an arbitrary goal.\nTo achieve the objectives, only the capacity of the project manager and his extensive experience are cited, however the methods offered to monitor the progress of the project are rather good intentions than proven methodologies or measurable deliverables.\nUnfortunately I cannot support this proposal.", "q2r": 1, "assessor": "z_assessor_2719", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15390, "q0": "The proposal is very simple to help the Cardano holders to discipline with their long-term investment. The problem is very much related to trading behaviors. In a hugely volitle market, the proposer suggested an idea to HODL by smart contract and remove the human emotion factors. The risk is counterintuitive as to the ADA slippage price we never know how much the price is after the locking period. Weirdly, the Smart Contract can be deactivated by a 3rd party or a mistake of UI. All in all, it is a very interesting idea such as the auto-investing with lock-up by year duration.", "q0r": 4, "q1": "The solution is simple and therefore the team is also very lean with 2 key members who are full-stack web and Smart contract developers. The timing is 4 months of project management with the release of the smart contract at the end of month 4. The budget is phased by the listed tasks. This is very much feasible to be deployed as the team showcase experience and already has a community to be promoted at the end of the project.", "q1r": 4, "q2": "The OKR and KPIs are very clearly identified as 30 users and 30,000 ADA per month which is very ambitious for this project. The team also showcase the telegram group and the experience of the Make Learn Cardano Easier. All in all, the idea is simple yet would help the staking of Cardano for long term holders. ", "q2r": 4, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a smart contract. Helps you to lock the ADA in your wallet for the period you choose", "experience": "\n12 years of experience in developing websites, applications for small and medium enterprises\n5 years of full stack programming experience and 2 years of solidity programming experience\n"}