{"id": 418840, "author": "julio.f.medeiros", "title": "Disrupting Fake News", "url": "https://cardano.ideascale.com/a/dtd/418840-48088", "category": 26595, "amount": 118000, "description": "Fake news and misinformation plague all societies. There is no accountability. There are no solutions and the problem is only growing. At JulianX, we want to help solve this problem", "f6_no_assessments": 8, "f6_rating": 4.500000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 2079, "q0": "According to the proponent, now that fake news and misinformation pervade every society, there is no accountability and no measures to improve these problems. It divides people's beliefs about the economic and social interests of a person or organization. While we must protect freedom of expression, ordinary people find it difficult to identify information given by knowledgeable, trustworthy people, especially when everyone claims to be themselves. This proposal wants to provide a platform called JulianX, through which it will help weed out fake news content through identity/credential verification and \"trust\" score. JulianX will use a blockchain-based identity verification platform to accomplish this goal. A person's identity will be linked to a \"Trust Score Mechanism\", where users will be able to gain trust from the community based on past performance. Over time, users will be able to gauge the accuracy of the content they're viewing by the ability to look at both the user's and the content's trust scores. The content can then be monetized/licensed using smart contacts. There is clarity in the description of the problem and solution presented, and the proposal perfectly matches the challenge.", "q0r": 5, "q1": "The feasibility of the proposal is relative. The author explains the roadmap and budget usage with the attached images. We know how long the whole project will take and what to expect each month. The related activities are listed and we know well what to expect in each subsequent month, and it is also very well marked with important milestones. Following the requested budget of $118,800, we were able to clearly understand what the requested funds would be used for. In my opinion, most of the budget is used for salary purposes. We also know what jobs will be performed, how many hours, and the corresponding hourly rate. It would be better if the proposal provided more information about which experts would do the work, or how many specialists would be behind each task. Finally, regarding the project team, the team provided the five members behind the project: Phil Grech, Julio Medeiros, Clearence Wissar, Joel Denning, and Nicholas Stanley. We also know their field of activity and experience, so it would be better to suggest specifying the role of each member or provide their link so that we can verify their qualifications An easier way. One point for us to appreciate the feasibility of this project is that the website https://julianx.io/#timeline is presented quite professionally. Here, we have some more information to be able to believe in the feasibility of the project. Therefore, I agree with the feasibility of this project with a score of 4.", "q1r": 4, "q2": "This proposal does not provide KPIs, but the success of the project is very clearly described, which are:\n-CX / Design\n-A proof of concept app built\n-Defined smart contract licensing model\n-Defined enterprise-grade solution architecture\n-Partner with distributed file sharing solution\nBesides, the community can easily track the progress of the project based on the author's reports in a sprint cycle every 2 weeks. That means every 2 weeks, the project's results will be featured on Youtube channels or social media like Reddit, Discord, and Twitter. Therefore, I think the suitability of the proposal is good but it would be great if it could provide some KPIs to the community.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5484, "q0": "The consequences of the plan are extensive. In the current era of digital media, this may have a huge influence on how people read stories on any NEWS. It's intriguing to even fathom the potential of a platform that provides constant information, news, and updates covering all social and economic events and is completely reliable. Because of the growing need for current and quick information, a platform with access to that information is now more essential than ever. The criteria of the challenge, such as growing Cardano usage, and outreach, are excellently captured by this solution. The author also has plans in place to lessen any risks that were identified during the first background study. It is important to recognize the enormous amount of prior research that has been completed. The writers appear to have taken care of the content-generating aspect by including the incentive system, and without government action, users would be allowed to exercise their right to free speech without restriction. As a result, the authors must carefully assess the legitimacy of the data.", "q0r": 4, "q1": "A clear strategy with attainable objectives is given to the readers at regular intervals. The proposer has provided a fairly concise proposal that, while taking into account every condition of the challenge, appears promising to any reader. The infographics used to demonstrate the chronology of their product also indicate that a significant amount of work has already been completed. The pre-funding work is already underway, which helps to increase the feasibility metrics by a few points. The required monies are also extremely fair and appear to be essential for launching the MVP. The introduction of the team was masterful, and it provides a range of skills to the ecosystem. Additionally, it appears that the team is aware of the outside assistance that is currently available in the form of content creators to support them in their endeavor, demonstrating their enthusiasm and resolve to make this an exciting experience. The effective portion of the proposal contains the majority of the proposal's plans, and the author spares the readers from tedious repetition.", "q1r": 5, "q2": "Even if the project is fantastic, the quantifiable KPIs make it more interesting. The measurable indicators are precise, to the point, and closely align with the main demands of the campaign. Monthly live demos on YouTube allow the community to follow along with the project, and proposers may gradually acquire accustomed to the tool if they intend to utilize it in their own proposals. For the auditors' auditing requirements, Jira updates per two-week sprints would be adequate. The team promises to regularly update the community on development via their Twitter, Reddit, and discord channels, which will undoubtedly offer the openness needed to track the team's progress. The proposal's overall conclusion is summarised by the combination of the proof-of-concept app and the smart contract licensing mechanism. However, I believe the author might have done a better job of describing how the idea would succeed, likely the type of impact the project would have, the number of content projected to be released, and the likely volume of customers. Therefore, with the exception of the flimsy success definition, the offered KPIs are sufficient and suitable for simple monitoring of the installation and overall performance.", "q2r": 4, "assessor": "z_assessor_2704", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5895, "q0": "This suggestion is very helpful. Although it seems simple, the impact it brings is not small. It will create a platform that allows fake news content to be dropped through identity/credential verification and a \"trust\" score. The content can then be monetized/licensed using smart contacts. In other words, this is a case in combining digital rights and monetization. From there, it will create a level playing field where content producers will be financially rewarded for honest and accurate content. Although this solution does not completely solve the problem of fake news, I believe it is the best idea to start working on it. With the above reasons, I believe this project will effectively solve the challenge.", "q0r": 5, "q1": "Information about the team has been provided, your team consists of 5 members, they are knowledgeable in many fields such as: blockchain, graphic design, software engineering,.... Based on the information provided, I see that they are talented people. They have all the knowledge, experience and skills to carry out this project. Each of them has their own forte, they take on their own jobs, thereby combining to form a strong team. As you know, having a strong team will increase people's confidence in this project, making the project can be done easily. Also, I can only find the link to the team linkedin profile when I visit your website (https://julianx.io). I think you should provide those links in the FEASIBILITY section, that will make it easier for people to follow and make the above information more transparent. \nThe solution is described very specifically and in detail. It helps people have an overview of the project. Besides, you have identified the risks, challenges and ways to mitigate it. This will be the basis for the project to develop sustainably in the long run. Detailed roadmaps and budget allocations are also provided. You've identified the tasks that need to be done and allotted them to specific timelines. That will help the project to develop in accordance with the original goals and orientation. Thanks to a detailed roadmap, budget allocation is easier than ever. The budget is calculated by you clearly and transparently by defining the work, the number of hours worked, the amount per hour. However, the roadmap and budget are provided in the form of images, which can be an obstacle for PAs using phones and devices with poor resolution. It would be better if the information was provided in text form. Overall, in this \"planning\" section, you did a great job, the information is complete!", "q1r": 4, "q2": "Criteria for assessing project progress and success have been provided. However, I think it needs to be further clarified. It would be great if there were more specific metrics on criteria such as: total reach, total number of content creators, total amount paid to trusted content producers,. ... Besides, you mentioned that you \"will create showcases at the end of every sprint cycle and present them on youtube\", I think you should add a youtube link so people can easily follow.\nSince this was the team's first proposal, it was inevitable that there would be a few omissions. However, those things are completely acceptable and sympathetic. This is a very useful project, although it sounds simple, the positive impact it brings is not small. If implemented successfully, it will certainly benefit many stakeholders, more broadly it will push the Cardano ecosystem to grow in both depth and breadth. I will definitely vote for you, I believe this project will be funded! Thank you for this great proposal!", "q2r": 4, "assessor": "z_assessor_2757", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6221, "q0": "This proposal has a clearly defined problem: no accountability for fake news and misinformation, the problem is growing.\nThe solution is to create a blockchain anchored platform. That will incentivize truthful creators and disincentives fakers. This will be accomplished trough identity/credential verification and “trust scores”.\nWhen the quality issue is solved, the content will be easily monetized/licensed using smart contracts. \nThe solution could have significant impact given sufficient adoption is reached and will bring more use cases for the Cardano blockchain.\nThis proposal is clearly in line with the challenge goals and metrics.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer has a website developed with a detailed roadmap. Point 3 of the road map is to launch a proposal on Catalyst on July 2022. https://julianx.io/\nPoint 2 is creating a stake pool, and the pool has been created. Link is provided in the prpoposal.\nThe proposal includes a lengthy explanation with details and examples of how the system is going to work, without going into technical details on the development side. The explanation is focused on the logic on which the project is built. Even more detail could be found in the white paper of the project here https://julianx.io/wp-content/uploads/2022/06/White-Paper.pdf\nThe proposer sees some medium level risks and provides mitigation plans for reducing them.\nThe plan of the project is uploaded as an excel sheet and looks sufficiently detailed and with timeline attached to it. It helps to see which tasks will move in parallel to each other.\nThe budget is well broken down. Again presented in an excel sheet format with profesion/hours/hourly wage/ total cost columns. This is completely satisfactory presentation of the budget.\nThe team is presented by names and with some experience marked, however the presentation of the team lacks CVs and/or linkedin accounts. This makes the information presented to be questioned. For this I have to take a point from the evaluation.\nThe proposer intends to source further funding from an ISPO but might use Catalyst again if needed.\nI agree the proposed plans and budget seem feasible to deliver the implementation of the project.\n", "q1r": 4, "q2": "Auditability will be facilitated by bi-weekly report/showcase after the first 60 days. The showcases will be promoted on social media such as Reddit, discord, Twitter and others.\nThe proposer clearly outlines accessible channels for the community to have access to the progress reports.\nThe proposer will measure deliverables against the road map of the project.\nSuccess metrics are clearly defined.\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2795", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10116, "q0": "At the beginning, they clearly raised an issue that was fake news and misinformation plague all societies. Disrupting Fake News helps to increase the credibility of the platforms thus giving trust to users, so I consider this issue to be a perfect fit for the challenge of Dapps, Products & Integrations which is to bring about effective use for the Cardano ecosystem to help drive more users.\nThe product of this proposal is to create a platform named \"JulianX\", which helps eliminate fake news content through identity/credential verification and \"trust\" scores. Users are all users on the social network including content producers, given a \"trust score\", it is considered as their personal Brand.\nThis project contributes to reducing fake news on platforms affiliated with JulianX, but getting a large community of hundreds of millions of social network users to use it is a long process. If successful, the scope of this project in my opinion will be global, as all governments and people want to access the flow of real news and do not want to become a victim of fake news. .\nI think this proposal can have external revenue, from users and from advertising if the platform attracts many users and issues tokens.", "q0r": 5, "q1": "the solutions to address the issue is quite convincing. The user must be a verified individual to make sure it's not a Bot. \"Trust score\" is performed based on community feedback when information content is posted. Regarding technology, I think this is not a difficult process and completely doable, but they have not yet said specifically how to conduct user verification, because some common verification methods can still be used today. Fake bot to verify, the team needs to provide more specific how to do this verification.\nThe proposed team consists of 5 members of which Phil Grech is a leader with a strong focus on CX and solution architecture. This team is capable of performing the proposed task\nIn terms of implementation time, the team has given a very clear and specific timeline and work contents that can be implemented in practice.\nIn terms of a suggested budget of $118,800 for 2720 working hours ($40/hour) and some other marketing-related expenses, I find this budget to be reasonable.\nThe risk of this project is given as medium, and can be overcome. However, I still worry about risky related to verify user technology, because the number of fake users on social networking sites is very large and cannot be eliminated, if I can clarify this issue, it will be more perfect.", "q1r": 4, "q2": "It's great, this proposal has a very professional website and social network, fully updated information, updating the project progress publicly, so that I can know the project progress.\nThe team also gives detailed and specific KPIs and implementation time. Good job", "q2r": 5, "assessor": "z_assessor_3158", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 11315, "q0": "This proposer has put forth a concept to create a platform (web 3.0 media platform) for accountability of news, a verification system to maintain that humans and no bots are using the platform, monetization of content in various forms and trust scores to help determine the trustworthiness of content. \n\nThis proposal effectively addresses the challenge of Dapps, Products & integration. A platform called JulianX would enable integration throughout the world of the Cardano blockchain, perhaps not even knowing you are using Cardano if done well enough. The product here is basically people themselves in that the trust score is really a brand of how trustworthy an individual is. \n\nFurthermore this decentralized App would allow for content creation/storage with the ability of every day people to score the content that has been brought forth by someone. The challenge is clearly addressed by this proposal.", "q0r": 5, "q1": "The teams experience and roadmap (see this proposal or the website fore a detailed roadmap) make it clear that this proposal is highly likely to be implemented successfully. \n\nThe teams experience as a whole include:\n- successfully led software development projects for some of Australia's most iconic brands for over 24 yrs\n\n- over 5 years experience in emerging network technologies\n\n- over 20 years of experience in the field of project planning, business development (partnerships) and business administration\n\nand  many other things along with those listed. The project is completing  phase one of their roadmap with this catalyst proposal and upon funding will be moving into phase two and part of that phase will be a proof of concept and the release of the alpha front end. \n\nToward the end of this phase they do plan to do an ISPO which will help to continue the financing of this project. \n\nBased on the information available on their website as well as here in this proposal including the links they provided, I would say it is very likely this proposal will be implemented successfully. ", "q1r": 5, "q2": "The proposer has laid out a descent plan for the auditability of the proposal. First the team will be presenting us with youtube videos showcasing the achievements along the way and also promoting the achievements on twitter, reddit, discord and other platforms.\n\nThe proposer has also laid out what the success of the project will look like giving us 5 key points to look for as the project moves along.\n\nI agree that the information provided is sufficient to audit the progress and success of the proposal, but I would have preferred for the proposer to have given us a 'list' of various \"markers\", or milestones that they will be hitting along the way to help us see more clearly just how well the proposal is advancing.  However, with the idea of using youtube to showcase what they have accomplished after each sprint cycle ( 2 week cycles) a list is things to track are not necessarily needed, but would be beneficial to have in their future proposals. \n\n", "q2r": 4, "assessor": "z_assessor_3237", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11834, "q0": "The team has put out a clear problem they are trying to address. The detail provided within the proposed solution is remarkable and among the most detailed i have seen so far as a proposal assessor. They include a clear description of their endeavor with example use cases which not only describe the application they are trying to deliver but also the monetarization they are aiming for to build a sustainable platform. Even further detail is provided on their website within a comprehensive whitepaper. I think the proposal fits the challenge very well and considering the scope the funding request is reasonable.", "q0r": 5, "q1": "In terms of feasibility the team provides a lot of useful information. A comprehensive website has been put together, with in depth detail on all team members, their experience and professional background as well as what roles they occupy within the project. The team maintains a clear roadmap on their website with deliverables until early 2023 and also put thoughts into potential risks and even categorized them, which attests to professionalism. The cost breakdown is calculated in hours and roughly mapped to the required building blocks of the application which is transparent. No specific funding has been requested for operational cost, but i assume they want to cover that already as part of their ISPO (though some initial cost might occur before that). Overall i think the team has put a lot of care into their proposal which leads me to fully agree they will be able to deliver.", "q1r": 5, "q2": "Working on two week sprints and then doing public sprint reviews on YouTube sounds like a reasonable approach in terms of accountability. In that way aligning with the established roadmap as well as getting immediate community feedback becomes possible, which sounds like a win-win to me. Success criteria are stated a bit generic, would have liked to see some hard numbers they are going for. Especially in terms of targeted user adaption, sustainability, overall usage numbers and the upcoming ISPO. E.g. what kind of money they would need to raise to keep going without additional catalyst funding. With the information provided I agree the community can expect to be informed on project progress in a transparent way.", "q2r": 4, "assessor": "z_assessor_3289", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12628, "q0": "Proposal fit the challenge. The problem of fake news has always caused serious damage to companies, businesses or projects. There are many projects in development that are attacked by Fud without reason and without validation, leading to the collapse of the project. This problem has not only not decreased, but increased because the attraction of this fake news brings a large amount of profitable traffic to advertising contracts. Communities need a place they can trust. I welcome this project.\nI am extremely impressed with how you describe the features of the platform in great detail along with real life examples. It gives me a very safe understanding of how it works, the project solves the fake news problem with confidence scores, and it looks like you've pre-calculated all of my questions and you listed a Its range of mechanisms of action comes with examples, I can't ask for more , the solutions you offer are appropriate. I am not surprised that the project is very low risk given the rich management experience of the proposer", "q0r": 5, "q1": "Thank you for providing the information so we know who the project owner is, the team members and their experience, but I hope you will attach a link of proof to back up what you say is the authentication, can be the profile in Linkedin or Twitter, ... of the members of the group. That's the only thing I'm not satisfied with about the proposal. Regarding the roadmap, the proposer clearly presented the stages of the proposal and other tasks to be assigned. And I think that's the amount of work the team can handle. As far as the budget required is in line with the project scope, it's quite understandable how it will be used.", "q1r": 4, "q2": "The proposer clearly demonstrated how the community can track project progress and project reports. This is the transparency we want to see in the proposals. But I hope you will give more clear KPIs, such as the number of KYC people, the number of posts or votes,...that the project will achieve after the release of the application, here we want see what data the proposer will collect, what goals they plan to achieve so that they can communicate those successes to the Cardano community.", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Our platform will help eliminate fake news content through identity/credential verification and \"trust\" scores. Content can then be monetized/licensed using smart contacts.", "experience": "We have significant cross-industry experience building systems for global retailers, banks, and media companies. We also have significant experience in CX design, UI, and workflows which will be key to our success. Most importantly, we have a proven track record for delivery."}