{"id": 418845, "author": "natdwamena", "title": "Ubuntu Informal Biz Reg& Accounting", "url": "https://cardano.ideascale.com/a/dtd/418845-48088", "category": 26595, "amount": 89850, "description": "Informal Businesses (Biz) dominate Africa's economy, yet are financially excluded, how do we provide identity & financial inclusiveness for informal biz (SMEs) in Africa?", "f6_no_assessments": 6, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 544, "q0": "This proposal includes a problem statement that is directly related to the challenge. Many informal businesses are financially excluded, and this proposal will create a \"registry and accounting solutions for the informal sector businesses which would be the basis for financial inclusiveness.\" This project can scale and be made available too many businesses across Africa, and onboarding new businesses in Africa is at the core of Cardano's strategy for mass adoption and ecosystem growth. By creating a triple entry accounting system on Cardano, with the integration of Atala Prism identity, this will help drive significant transaction volume onto the Cardano blockchain. The KPI's included in the proposal to measure success are all related to onboarding new businesses, users, and use-cases to Cardano, which is directly inline with the funding Challenge to bring impactful use cases to Cardano ecosystem that help drive more adoption.\n", "q0r": 5, "q1": "The proposer has provided references for the team on their website, which includes linkedIn profiles and their professional background and experience. They have included a detailed plan and a reasonable budget that is broken down into specific tasks. There are major milestones with 4 phases, and sub-tasks for each milestone. The order of execution and expected delivery times are also included.  The proposer has included a detailed risk mitigation strategy for the risks identified as education and internet connectivity of the users. I have rated the feasibility 4 stars and not 5, because the proposing team has not discussed the technical challenges of implementing Atala Prism, or provided reference to their experience with Prism, or how they will mitigate this technical risk. While the team is experienced and highly capable of problem solving this technical challenge, I would recommend they include an Atala Prism consultant on the team to insure there are no knowledge gaps around this important part of their plan. \n", "q1r": 4, "q2": "The team will be publishing monthly progress reports on their website for the Catalyst community that will track the KPI's provided in the proposal. Additionally the project will be visable on Github, and the team will be publishing information on their discord as well as being available for questions from Catalyst auditors. ", "q2r": 5, "assessor": "z_assessor_2108", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 4533, "q0": "The problem statement is succinct, with strong data to back up their argument, and the solutions space is very well articulated by the proposer. Triple accounting is a great idea to bring real-world solutions onto the Cardano blockchain. Coming from a traditional finance background, I could see the potential to expand and scale this particular solution to many other parts of the real world business. The proposer articulates clearly why the Cardano blockchain is suitable for their solution (as it possesses unique governance and an evidence-based platform for change-makers) and how this proposal would add value to Cardano (as this dApp aims to provide a core solution to enhance the development of the sizable informal sector businesses in Africa, which accounts for 70% of the employment in the region, thus contributing to the thriving). This proposal meets multiple goals of this challenging setting (e.g., bring new users, drive more adoption, drive more types of on-chain activities, drive more innovation) and of Fund9's strategic goals (e.g., build a real-world solution on Cardano,  prepare a group of people willing and able to make contributions to the ecosystem). The proposer also discusses the risks that may prevent the project from developing sustainably and provides mitigations accordingly. Overall, I am convinced that this proposal will bring impact on multiple fronts to the challenge and the Cardano ecosystem.\n", "q0r": 5, "q1": "I agree that it is  likely that this proposal will be implemented successfully. The proposer identifies the experience required to implement the proposal (e.g., software development in Plutus & Haskell, Accountants, marketing, research, agriculture and identifies the core team members with relevant experience, together with credentials on LinkedIn to work on this project. The proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how with supporting docs attached. They also have the website available for this project and the roadmap on this website states that the team has been working on the concept development and research for this project since January 2021, which explains the proposer's clear understanding of the solution, and its key features, and the technical requirements. The proposer has thoroughly considered challenges and risks relevant to a successful implementation and the corresponding mitigation. They also offer a realistic timetable and key milestones for delivering the project. The only reason I did not give them a 5 rating on Feasibility is that they did not provide a detailed budget breakdown. The budget is proposed in a lump sum for each function e.g, R&D, front-end development, smart contract development, etc. However, in order for the community members to assess the feasibility of their budget, I would suggest they to further break it down into the estimated man-hours and the daily rates for different roles. The total budget amount does not sound unreasonable, though.\n", "q1r": 4, "q2": "I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. First, the solution space and success are clearly articulated to address a well-defined problem. Second, the team proposes four quantifiable KPIs (# of business registered, # of users using accounting tools, # of credit ratings issued, # of downloads) and four key milestones to track each phase of success for the project (completion of the dApp, reaching at least 200 businesses, having at least 100 registered businesses, and having at least 30 users using the accounting tool for a month). The proposer also offers channels for the community to track their progress, including GitHub repositories, and Discord server. project's website. Last but not least, their roadmap by phase (4 phases in total) with the corresponding key activities could also be used to track the progress.\n", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 5270, "q0": "The ubuntu informal biz reg & accounting proposal is to develop a registry and accounting solution for the informal sector businesses. The team regard the informal businesses as the basis of financial inclusivenesss. The registry would function using Atala PRISM to provie a unique identity for individual businesses. The identification would help to provide credibility, reduce risk and increase productivities by these informal businesses. The triple entry accounting would be identified and classified in the dapp registry that would be secured, open and transparent. The team would pilot their project in Ghana as there is no stringent blockchain regulations and the informal sector plays a major role in employment. Their solution will level the playing field between informal businesses and the big firms or Bank the unbanked. It is a unique dApp combining registry and accounting solution that will bring impactful use case (identity and financial inclusion of informal sectors) to Cardano and hence it effectively address the Dapps, Products and integration challenge very well. The challenge mentioned by the proposal would be education level and internet connectivity. However, this risk is mitigated by the fact that informal sector is dominated by youth aged between 15-24 and the project focus on the urban informal sector in Ghana.  ", "q0r": 5, "q1": "The team has provided the action plan in 3 months with the request for funding for the first part of project which is to develop the dApp. The 4 phases look feasible and the time period in each phase is sensible for completing the required task. They should have more budget breakdown for each item cost to increase the feasibility of this project although the frontend development and smart contract development are reasonable market rate. For example, they could clarify the hour pay rate for each development cost they have like frontend development, backend development, Atala PRISM development etc. The team is very experienced and equipped with local knowledge to complete this project successfully. ", "q1r": 4, "q2": "The progress report for this team would be published monthly on the website and the dApp development would be in GitHub. The KPIs they list allow for full check by the community ie. number of informal businesses using their solution, credit ratings issued and the download of app itself. The target figures are also provided in this proposal ie. dApp completion, 200 businesses reached, 100 business registered and 30 businesses using their accounting tool for a month. These KPIs are already good indicators of active users in their platform. The team is very clear in the problem, solution and the proposal is very well aligned with the challenge and there is a clarity on how the community can audit the project.", "q2r": 5, "assessor": "z_assessor_2684", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7307, "q0": "Proposal to effectively tackle the challenge. The purpose of the proposal is to build a DApp with three-entry accounting on the Cardano Blockchain to provide identity and grow informal businesses in Africa by providing DApp solutions for accounting, marketing and , manage and track the business progress of the small and medium enterprises that currently dominate the African economy, with less documentation, creating the basis for credit worthiness, including financing and marketing. Access to financial instruments tailored to the needs of informal businesses (rural and urban) for growth and expansion, so there is a reason to grow and interact with the Cardano blockchain. Blockchain technology provides a platform that requires less documentation and bypasses traditional banking services, thus leveling the economic playing field between informal enterprises, micro, small businesses, medium-sized enterprises (MSMEs) and large enterprise companies. Thus, expanding financial services to unbanked and underserved markets and customers. Another positive point Blockchain stacks as a third component should ensure more transparency in accounting. Triple entry accounting will simultaneously add a third entry and post the third entry in a shared ledger that is visible to all participants. The entry and verification of transactions can be done by informal businesses without a central authority. Thus, contributing to increasing user trust with DApp and Cardano, increasing the number of users, helping Dapp and Cardano ecosystem grow more.", "q0r": 5, "q1": "The implementation plan of the proposal describes in detail the content of the work to be performed with specific timelines, so it is easy to track the successful progress of the project. Comparative data and evidence are presented clearly, objectively and transparently, provided through websites and blogs, thus reinforcing trust with the review community. A strong team, consisting of members with the right experience and skills to successfully implement the project, the information provided by the team through Linkedin should be easily known. The budget outlines each item corresponding to the expenses, so it is easy to determine. With the scale of the project development, with a lot of work to be done, I think the given budget is reasonable. The group's risks and challenges were clearly presented and a plan to reduce the risks to the lowest level was also proposed, so that the proposal could be successfully implemented.", "q1r": 5, "q2": "The information provided is I think sufficient to assess the progress and success of the proposal. The progress of the project is described and listed, clearly each goal and solution is met with clear timelines, so it is easy to follow. The solutions offered to solve the challenge are thoroughly analyzed, complete, easy to understand and grasp, Even choosing the project start location, the team has thoroughly researched, analyzed, and found the solutions. outstanding advantages, then consider choosing Ghana as the starting place. KPIs are described relatively fully, clearly attached with specific numbers so the community can easily evaluate and track through integrated progress reports that will be proposed by the team to be published. monthly on the site. In addition, DApp development will be recorded in Github so it will be very transparent. The project team has also committed to providing funding updates, impact, and progress reports on Discord. The project described its success in a concise, clear and easy to understand manner.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8979, "q0": "This is a proposal to develop informal businesses in Africa using DApps on Cardano block chain. Small to medium sized companies form a major component of the businesses in Africa, also the major contributors to the economy.\nThe majority of employment provided in Africa is buy these SME's and the informal sector. Hence any development in this regard contributes greatly to the economy, by reaching majority of the employed section of people.\nThe project in the current proposal focuses on Ghana and plans to extend further.\n\nThe project  proposes to create a Registry and Accounting. With governments increasing the taxes the on SME it would be good development if the decentralized blockchain to deliver he solutions which govt promises but doesnt.\n\nThe registry records Business owner, type of business and employees in business. This helps other SME' to asses the business scope and scale, and hence decide on future business propositions based on this information. This would also be used as a marker by the financial sector for funding/loaning these entities. In the end it would provide a platform for SME's to interact with each other more efficiently. This  would employ ATALA PRISM to provide the solution.\n\nThe proposal also plans to Cardano blockchain as a accounting component. All the transactions between companies would also be made available on the block chain thus all the parties in the transaction can always be aware of the entries made by the other parties involved in their ledgers, thus avoiding fraud/wrong entries.\n\nThe relevance of the project is evident considering the SME's and manpower involved in the African economy.", "q0r": 5, "q1": "The details of the project contributors have been elaborated wel. The linked in profiles have also been attached.\n\nKingsley Mensah - CTO - MSc in CS. Can be seen as the lad in the technology front given the experience and awards received.\n\nCharles Fiifi Hagan - Accountant- Can be seen as the lead on the Finalcial analysis front with 7 years of experience.\n\nNathaniel Dwamena & Joshua Larweh Tetteh - Can  be seen as lead on the operational front with their experience mentioned.\n\nThe detailed budget breakdown is good enough, although hourly breakup would have been more beneficial. The timeline is also seems feasible.", "q1r": 5, "q2": "The KPIs for the auditability have been mentioned appropriately. The educational outreach component figures could be increased so that the companies are aware of the product and hence increses more companies registering. There would be initial resistance which could be reduced by increasing the awareness.\nAlso the target figures are well judged. It could have been increased given the funding required. Also this would require a marketing component to make the project effective and reachable to more users, which has to included.", "q2r": 5, "assessor": "z_assessor_3009", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12218, "q0": "The idea aligns well with the objectives of the challenge, because it intends to use Cardano blockchain to develop Ubuntu Informal Biz Reg & Accounting for micro, small, medium enterprise (MSME) or informal sector. It serves MSME business to record financial transactions and minimize fraud and error. The proposer wants to create triple entry accounting in Ubuntu Informal Biz Reg & Accounting that can be monitored transaction recording for the parties that conduct the businesses. Thus, it provides financial data transparency. The reasons the proposer use Cardano blockchain to develop Ubuntu Informal Biz Reg & Accounting is because, the Cardano blockchain possesses unique governance and an evidence-based platform for change-makers. In addition, the Cardano Blockchain can be used to create a unique cryptographically sealed receipt with a unique digital signature for each entry and this is one of important part in accounting to prevent fraud, abuse and minimize error. By having Ubuntu Informal Biz Reg & Accounting, informal sector can be competitive with other big industry in Africa especially in Ghana and obviously it contributes to the Cardano eco system since many businessmen use that accounting platform. Furthermore, the proposal dialogues very well with the goal of the challenge and given detail information such as link to accesses more information in regards to this project. In addition to this, the proposal effectively addresses the challenge", "q0r": 5, "q1": "The project team proves to be very well prepared to carry it out, because they provide a small individual description of who they are, which is summed up by their contacts on social networks, making real the possibility of making direct contact and getting to know them better. About the script, they present which phases would need to be completed to reach their goals and it is sufficient information that project can be implemented well thus, it makes the community easy to understand. In relation to the budget, I see that the level of detail is alright. the information is there, we know what each part of the project will cost and understand how cost is spent, Given the information provided, the proposal will be implemented successfully", "q1r": 4, "q2": "Speaking about auditability aspect, the proposal stated key deliverable and the KPI’s. they provide the information and drew up an auditability plan in which they would monitor the project's growth and it would help the community to monitor the progress of the project. The community would be given progress reports on the discord channel and The DApp developers would use github to enable openness and transparency in development to the community. That way I believe, we would have the information. In addition, they promise to published progress report monthly. Thus, given information provided, it sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3367", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Build DApp with triple-entry accounting on Cardano Blockchain to provide identity & financial inclusiveness for informal businesses in Africa.", "experience": "We have combined over 15 years of experience in Software Development (Plutus & Haskell inclusive), Accountants, marketing, research, and non-profit managers. Active in Catalyst since Fund 7."}