{"id": 418958, "author": "ngoluuduythai37", "title": "Cardano loyalty systems for Dapps", "url": "https://cardano.ideascale.com/a/dtd/418958-48088", "category": 26595, "amount": 63000, "description": "\nmulti-currency, fragmented point collections, and some points never being redeemed.\nMissing loyalty programs used for cross Dapps and Ecosystems\n", "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"id": 2585, "q0": "this proposal says that they will create an ADAloyal platform to apply the advantages of blockchain to real life, which is a good idea and necessary for the development of our blockchain. The proponent provided the impact the project will have on the blockchain, its users, and project owners. With the information already available I agree this proposal is suitable for the challenge.", "q0r": 5, "q1": "The proposal identified the type and number of members needed to implement the project. Through the information they provide as well as the reference links they are experienced people corresponding to the positions in the proposal, which is fine but if they can provide more information about the credentials received, or the products they have actually made will help readers evaluate more visually. on the budget they asked for $63000 detailed listed corresponding to obvious specific jobs, at a cost of $30 an hour for API development and database design is quite suitable, but if it's possible to clarify more specifically what it is, why get the figure of 370 hours for API development similar to database work time from where? 260 hours. similar to other jobs. The proponent should provide more completeness so that I can judge these numbers as factual and not random numbers for cost calculation. Final blueprint including progress and milestones. The proponent has provided a plan from Q3 2022 to Q1 2023 and has further plans for the future. corresponding to the amount of time each proponent has listed clear work items. but if there are more timelines for announcing achievements, it will be more complete, for example on 15/07/2022 announcing the assignment of tasks to the community; dated 30/7/2022 announced project plan and POC,... In short, the feasibility of this proposal is yes but it can be further improved fully.", "q1r": 4, "q2": "Auditability of this proposal is possible, I know how to check the development progress of the project through Trello and the team's GitHub. Qualitative and quantitative indicators to measure project success have also been defined. they also say they will provide a weekly report so everyone can know about the whole process which is a positive thing. if they add more information on where this report will be displayed, on what date it will be published for example every Friday the work report will be updated in the comments section of this proposal as well as on the project communication groups with links to the groups, or they will participate in reporting on the Eastern town hall groups ... In short I would give them 4 points on auditability because I think it could be better improved.", "q2r": 4, "assessor": "z_assessor_2323", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9511, "q0": "For a detailed articulation of the platform mechanics for customers, projects and general platform architecture, I rank this section a 4. The reason I don’t rank this section a 5 is because there isn’t enough tangibly quantified impacts to weigh against the cost to determine if this is a worthwhile investment (which is much more important for proposals that are a bit more expensive such as this one). I would’ve liked to see some kind of research on how effective loyalty programs can be, how different companies do with/without loyalty programs, and any other type of status quo data/research. This information can help voters see the need for this type of development and/or what greater benefit this might serve that would be worth the requested funding. The rest of this section has plenty of substance for voters to react positively to but I think this little bit of extra detail will secure that confidence. ", "q0r": 4, "q1": "For an extremely detailed roadmap, a budget that demonstrates impressive efficiency, and a demonstrably capable team (with junior developer participation to increase experience) I rank this section a 5. I think voters will respond well to this core team because the junior developers having a chance to learn from more experienced developers could be an impact on its own. The experience of all core team members is well cited with LinkedIn profiles and capability is clear. The roadmap is painfully detailed with every bit of information and description about every task that will be worked on and how long it will take to deliver a completed product. Furthermore, the budget breaksdown every hour of labor needed to complete the project AND makes a more expensive proposal sound like a cheap one with the impressive level of efficiency applied here. It might be worth noting that the hours allocated for each task seems a bit more than other proposals I have seen but I doubt that any Cardano community members are likely to vote against the slow and steady approach. I think they do everything right here. ", "q1r": 5, "q2": "For providing an unprecedented depth of observation in their definition for succes, I rank this section a 5. This proposal lists KPIs that I wouldn’t have even thought of to point out, which I think points to an intended extraordinary standard of quality for this product. The number of measured categories is beyond anything that I typically see in Catalyst proposals and I expect voters will recognize the tremendous degree of advanced forethought put into the expectations for the future of this project. I do wish that I would’ve seen more projected milestone based metrics that sets goals for different timeframes post-proposal, but that’s honestly just personal preference at this point. I think voters will be paying attention to this one to make sure this portion of the proposal isn’t just “all talk” but it seems clear to me that this is a higher-level proposal. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10026, "q0": "The author identifies the problem: The lack of loyalty programs used for Dapps and Cross Ecosystems. The solution is to create a platform that anyone can create for their loyalty programs. More benefits and customers are happier using NFT and blockchain technology. The solution is suitable for the installation challenge, solving the stated problem. ADALoyal is a loyalty platform on the Cardano network that applies to real-life applications, and on Dapps, ADALoyal has a real impact on users, they receive rewards from programs, customers will also be consulted and use the best services. Data about loyal customers is needed for businesses to attract and grow the market. The solution enhances the user experience with the way of \"building a collection anyone can use. For example, Play to Earn, Buy to Make Money, Go Shopping and Earn NFT, etc.\" The right solution helps users get creative and participate in Cardano's projects, which develop the Cardano ecosystem. NFT contains information for identity loyalty created that helps clients manage and increase the communication of project owners and customers, which is consistent with the implementation solution. The author has identified the risks that could affect the proposal, the shortage of Cardano smart contract resources will be addressed with appropriate research and development strategies. A lack of budget affects resources and the ability of testing stability to be anticipated risks, the author has specific methods for risks and minimizes to the smallest extent.\nI rated: 5\n", "q0r": 5, "q1": "The project plan was launched starting with poc and defining the development environment: GitHub, the staging server. Detailed plans, specified stages, and specific completion times. The implementation stages clearly define the tasks performed such as: POC, staging server, execution assignment, smart contract creation, NFT identity based on the number of Dapp transactions, UI/UX construction, Flint, Nami, Eternl wallet connections, and communication marketing to users, etc. All the work of the project is clearly shown through 4 stages of implementation. The plan is fully planned for over-implementation and in line with the solution offered. All the members implementing the proposal have clear information, we can see them on wedsite: https://3exp8.network. Members (3exp8) are fully capable and capable of having been demonstrated on LinkedIn, They are assigned specific jobs that ensure the ability to complete the given plan. The recommended amount of $63,000 is less than 10% of the funding for the challenge is appropriate. We can see the full budget analysis of the content spent on items. The work is done by the hour, paid properly, the amount spent is in line with the work carried out according to the plan. The money is being spent on purpose.\nI rated: 5\n \n", "q1r": 5, "q2": "The development roadmap is clear and can be tracked with important milestones, time to achieve results. Quantitative indicators for the appropriate development process: Number of task/function unit test codes, Number of benchmark tests, Number of GitHub commitments and consolidations, Number of tasks completed in Trello. All the work is specifically monitored by the author team, identifying the project is being done in accordance with the roadmap. To evaluate the success of the project the author gives appropriate indicators / KPIs. The success of the project from a product development point of view: the main software is developed and tested: 100%, additional aspects & additional software components are developed and tested: 70%-100%, KPI system operations: 70%-100%, etc. The success of the project from a business and user point of view is to reach 5-10 Dapps using successfully, per 1000 users create NFT identities. The project identifies the successful KPIs of software components and aspects. We can identify the project that has been successfully implemented.\nI rated: 5\n", "q2r": 5, "assessor": "z_assessor_3144", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 15125, "q0": "According to the proponent, there is currently a lack of loyalty programs used for Dapps and Cross Ecosystems. The solution was to provide a platform called ADALoyal that anyone could create for their loyalty programs. ADALoyal is a loyalty platform on the Cardano network that uses the power of smart contracts. Take advantage of blockchain to apply to real-life applications and on Dapps. The solution is matching the challenge, and solving the stated problem. If this proposal is successfully implemented, it will benefit 2 objects:\n- On the Client Side: ADALoyal will help to manage all loyalty points and NFT rewards, news, and government in one place.\n-On the Business side: ADALoyal will help manage their customer list, membership, and revenue, create news, connect with customers and easily create programs with smart contract templates.\nThis proposal aims to be a loyalty goal to solve the above problems in the current loyalty market, loyalty will bring more benefits and customers are happier using NFT and the company. blockchain technology.\nThis proposal also reflects 3 main risks that can be encountered during project development, the proponent has established several options to deal with them.", "q0r": 5, "q1": "The project calculation is very good, we know all the information about the project team, budget, and plan in a very detailed way. The first is the roadmap, which proposes to provide a route with several columns that can be examined and timed. This time works that is going to the length of the 9-month start from Q3/2022 to Q1/2023. In each quarter, the tasks were listed and one thing I liked about this was that the proponent carefully provided the outputs of the tasks. So we have a very clear vision of the project's plan.\nNext is the project team, we know who the team members are in their way and detail, like their names, a brief description of their area of ​​expertise and experience, as well as a profile link that we can take a look at. The proposal also outlines the roles of all members of this project, with the profile provided, I am very confident that this team will successfully implement the proposal.\nFinally, the allotted budget can work and get straight to the point. The proposal asks for $63,000 to be broken down into verifiable categories. We know very well that the budget will be used for what belongs to the goal, and also know the time salary of the work to be done. In my opinion, that's a perfectly reasonable amount. With all the information provided, I believe this proposal is highly viable.", "q1r": 5, "q2": "We know what tasks need to be done and by what timeframe; with this thing, can tracker see the things have been done the right way and into the true time or not. In other words, yes, the proposal can be followed, and the authors provide enough information for us to do this satisfactorily. The proposal is also given several quantifiable KPIs, and the team will also use Github auto-deploy to push the latest code onto the servers to make the development product available to everyone. This proposal is fully trackable by the community through weekly reporting.\nThe success of the project is also described in great detail, the team proposal is listed some of the successes from the user point of view, the business point of view, and the product development point of view. If the proposal is financially supported, the team will return for another round to bring their loyalty to real-life applications. Based on all that is offered, I believe this team is invested a lot of effort and mind in building on that, hoping that they will receive funding so that soon the project can be realized judgment.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15244, "q0": "From a general perspective, it can be stated that many brands maintain loyalty programs to seek to maintain a healthy customer retention rate. It can also be stated that this type of program allows the brand to know its customers better, what they like and dislike, so as to \"keep them happy\" so that they not only continue buying, but also, very possibly, that customer can naturally become an ambassador of the brand. According to the team preparing this proposal, the lack of loyalty programs in the ecosystem represents a lost opportunity for different projects. Even though we are aware that the above mentioned works in the \"traditional world\" or web2, it would have been interesting if the team would have provided data or research to support the argument that such solutions are imperative in the web3. Assuming that the same benefits mentioned above can be replicated in crypto users I can agree that this proposal would add value to Cardano. The team does an excellent job of explaining the benefits of the project to the various stakeholders, as well as providing a detailed description of the impact metrics, which I also find aligned with the challenge.\n", "q0r": 5, "q1": "Throughout this section there is a comprehensive and detailed implementation plan, which is divided into three 3 month time periods, each with a detailed description of the actions that compose it and are supplemented by the deliverables in each case. I must say that after reading them in detail, it makes complete sense to me. The plan closes with a description of the actions that are expected to be implemented in the future, once L2 solutions and Babel fees are available. Regarding the budget, once again they do an excellent job of breaking it down into 9 clearly identifiable line items, which briefly describe what is expected to be completed for each item, the total hours estimated for each, as well as the cost per hour of work according to specialty. I find the hourly rate assigned to smart contract development lower than what I have encountered in other projects at Catalyst. However, from a high level, the budget seems appropriate. Additionally, it's crucial to mention that there is an excellent description of the skills and experience of the development team, especially that there is a good mix of experienced developers and junior developers, allowing them to gain valuable experience building a product in Cardano. \n", "q1r": 5, "q2": "Few projects in Project Catalyst have put as much effort into describing the elements to be evaluated in the Auditability section. All the necessary aspects are covered, from the multiple channels of communications and reporting to IOG and the community. As well as an extensive list of success metrics intended to cover all aspects of this ambitious proposal. As well as a roadmap with timelines and milestones perfectly described.\n", "q2r": 5, "assessor": "z_assessor_2142", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Create a platform help anyone can create for their loyalty programs. Loyalty will more transparency, more benefits, and fun with customers when using NFTs and blockchain technology.", "experience": "Practical blockchain engineers, software experts, product design, software engineering management, QA/QC. Project & product, finance & marketing management."}