{"id": 418904, "author": "adamcooke00", "title": "Cardano Ancient Peoples DCCG Game", "url": "https://cardano.ideascale.com/a/dtd/418904-48088", "category": 26595, "amount": 29915, "description": "Cardano adoption is overly reliant on lending, borrowing, and yield farming.\nCardano Gaming Ecosystem is weak.\nCollectible Card Games are a large % of gaming market cap, but Pay-to-win is unfair.", "f6_no_assessments": 6, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"id": 9510, "q0": "While there is a lot of content here, this section of the proposal doesn’t thoroughly demonstrate impact so I rank this section a 2. This section doesn’t quantifiably or tangibly demonstrate what the outcome of this proposal would be that appeals to innovation/advancement of the Cardano ecosystem or improvement on real-world lives. Starting with the problem statement, this proposal doesn’t provide a strong enough sense of urgency to make voters feel like this proposal matters (which is important because this is actually the start of a $162k proposal, not a single $30k proposal). I appreciate that the problem statement adds multiple layers to the problems that they’re attempting to approach but the proposal doesn’t spend any time further justifying those problems. This runs the risk of allowing voters to fill in their own opinions about the problem statements, if they’re not well supported by research and data to justify them as legitimate problems. In this case, voters may prefer the Cardano ecosystem be known for DeFi capabilities. It’s also rather risky to claim the “Cardano Gaming Ecosystem is weak” if there are voters that have a Cardano-based game that they’re a big fan of. I think the third layer of the problem statement was on to a tangible problem of substance but it wasn’t seen all the way through to the end. If additional information had been provided about the percentage of Collectible Card Games in the overall gaming market cap, this could have provided voters with a sense of high-demand for this type of product which translates well to Cardano ecosystem adoption (with the data providing that tangibility of how much adoption). This section of the proposal spends a lot of time talking about generally theoretical problems with the gaming industry and broad solution mechanics to those problems but it doesn’t spend enough time talking about what this game UNIQUELY does to address these problems and remain competitive. This section of the proposal spends a noticeable amount of time generally criticizing other Cardano-based games and not enough time separating itself from other games. In my experience with the world of competitive YuGiOh (and some exposure to other TCGs as well), successful TCG games appear to have a complex gameplay mechanic, imaginative/creative lore, and a strong community. From this proposal (or the whitepaper), I do not get strong enough indications for foundations in these elements. Additionally, this proposal would have to provide something that isn’t found in any of the larger and more established games in the business. ", "q0r": 2, "q1": "I rank this section a 2 because the information provided here is a solid starting point but the core team is not developed enough for me to confidently vote positively on feasibility. If voters are evaluating the possibility of seeing success based on the capabilities of the core team, voters are not provided the assurance to confidently vote positively on capabilty. I think there is a strong starting place with two capable computer engineers with experience in core Cardano-based coding languages. While these are essential key components, there are other essential roles that are not yet occupied with demonstrably capable core team members. So voters would not be able to vote positively without information about the capabilities of the people that end up filling those roles. There isn’t any provable experience to show that this project could reliably build a strong community, create a game with complex game mechanics and an interesting lore/story background (which I’m not thoroughly optimistic about given the compensation allocated to the Lore Creator & Social Media role). The roadmap and budget outlines are fantastic. I don’t think there’s much to change in either of these sections (though I am rather concerned about the risks of such a high-cost/risk to Catalyst funds). If I’m voting strictly on this sections demonstration of feasibility (even with the higher-level quality in the budget and roadmap), I do not think this proposal is quite ready for approval yet. ", "q1r": 2, "q2": "I think this section almost gets there with a solid starting framework for identified KPIs but with lacking organization and quantification of those goals, so I rank this section a 3. There’s one line that really bothers me about this section of the proposal when it says “if the community deems sufficient progress has been made, then funding is made available every subsequent fund.” As much as I can appreciate value placed on the community (I assume the Catalyst community is what is meant), they are not the experts of the field that the proposers are building out in. The definition of performance needs to be set and defined by the proposers and the community can call out if they feel like this standard is not ambitious enough (or too ambitious). By leaving the standard up to the subjective thoughts of the community, it inappropriately relieves the proposer of having to commit to adhering to an expertly formulated measure of success. The best Catalyst proposals are the ones that set specific target metrics for different timeframes of the future of the project, so that the community knows what the proposer expects to see as a vision for success. This also provides the proposer with a mechanism to course correct if needed, to adjust for greater adherence to the standard of success. I’m neutral here because it’s still a very early stage for this project, so I don’t expect usage metrics to be reasonably projected. But I do think there needs to be some work done here. ", "q2r": 3, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 2080, "q0": "This proposal is very good and fits the goal of the challenge. Part of this challenge's funding portfolio goes towards projects that develop games using our blockchain and the various technologies the Cardano ecosystem has to offer because there's no denying the way the industry The gaming industry is extremely relevant and profitable in today's technology sector. Collectible card games currently make up a large portion of the game market capitalization, according to the proponent, but Pay to Win is unfair. So his solution was to create a Digital Collectible Card Game that prioritizes game quality, has decentralized balance changes, and can pay to win by applying a pattern. Game mode to earn money by making free cards. In other words, this game mechanism is to convert from pay to win (common in traditional DCCG) to pay to earn where users are rewarded with admin tokens for playing. These governance tokens grant voting rights that individuals can use to change game balances. As a result, the right to change the balance is out of the hands of the developers and in the hands of the players, and therefore the developers cannot exploit the game for profit. If in traditional DCCGs there is an imbalance and unfairness for players because the developer controls balance changes to maximize profits, this game project will not be possible in that situation. This proposal is a good fit for the challenge as it drives Cardano adoption via Game Streams that directly match the Challenge description. Besides, the proposed solution is also completely convincing as it prioritizes the quality of the game to ensure the adoption and longevity of the game while taking advantage of the blockchain through the use of the decentralized voting middle and replaceable tokens. The goal of this promotion is to provide a game that can compete with the DCCG giants we see in the modern gaming scene. So, I think that if this proposal is successfully implemented, it will attract a large number of people to the game and of course, this is completely beneficial for the Cardano ecosystem.", "q0r": 5, "q1": "I love the level of detail mentioned in this proposal, it gives me the certainty that the people behind the proposal know what they are doing. The author has identified the long-term development path of the project, showing their vision. The author states that this proposal will seek repeated funding for a period of 4 consecutive funds, starting with Fund 9 and ending Fund 12, and it is commendable here that the author has provided us with all sets of the necessary information from the beginning to the end of this project (see Whitepaper for more information: https://bit.ly/3xHZRHv). The first is about the roadmap, this proposal is very detailed in terms of time frame with all phases, with action to be taken. Milestones were presented, tied to an identifiable period, and we had a very precise view of what tasks needed to be done during that period. The budget is also described in great detail. The amount requested in this 9 fund is $29,915 and is broken down into auditable portions. And finally about the project team, in my objective assessment, this group is capable of implementing the project. We are provided with full member information such as their names, their professional skills as well as their role in this project. Besides, there are some unassigned positions, perhaps they are looking for suitable people for those positions. In general, all necessary information is provided in great detail, so I have a lot of confidence in the possibility of this project's success.", "q1r": 5, "q2": "The proponent asserts that \"with funding divided among four incremental functional funds, project progress will be monitored by the community. If the community considers sufficient progress has been made, the funding will be provided for each subsequent fund. Success can be determined by teams adhering to the roadmap's timetable\" it would be great if in this proposal the proponent could provide a means by which the community can refer. (However, this is entirely possible after being funded.) Having several goals with well-defined KPIs provides the community with clear evidence against which to audit and measure the progress of the proposal. The success of the project is also well defined so that we understand the outcome to be expected, giving us a vision of the project: DCCG players will know about the DCCG of the Cardano Ancient Peoples regardless of the Cardano affiliation first. this. They will enjoy playing the game regularly and actively participating in the balance change vote. They will be seamlessly incorporated into the Cardano Ecosystem. The aspiration is to set a precedent for other major game companies to move towards decentralized balance changes when they are legitimate and desirable.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2320, "q0": "First of all i will want to say the problem statement of this proposal is false and makes claims without a data-backing it, no reference (Wild assumptions).\nThis proposal intends to build a balanced DCCG(Digital Collectible Card Game) game with a play to earn elements(I wonder where this money will come from).\nAs a game developer for over 15 years, i expected that if you are writing a proposal about a game, the proposal should be focused on the game, gameplay mechanics and fun aspect as regards to this proposal that focuses on the integration and how it will create a balanced game.\nA game can be balanced and wouldn't be fun and if the game isn't fun (most blockchain and NFT games ), nobody will play it.Its that simple.\nThis is a missed opportunity to tell the reviewer how different your game is because most of the terms used here are cliche as most game reviews in fund9 stated they will balance the game and bring gamers to Cardano, but that is not how it works.\nNo talk around marketing (which is very important) ,How they intend to make money, target market etc.\nAnother issue with this proposal is the lack of references ,statements are made with no links to back it up.\nThe risk section of the proposal highlights the reason why this proposal was not drafted correctly as the key makeup of the team is not yet decided.\n\nI will be giving 3 stars as i am on the fence on this one.\n\n** here is a game i made  with flutter for showcase :\nIOS :   https://apps.apple.com/us/app/id1488600103\nAndroid :  https://play.google.com/store/apps/details?id=com.sourcecard.whotfire", "q0r": 3, "q1": "The proposal provided a very detailed roadmap(I am wondering if these timelines won't change as the team members might disagree with some of these timelines when they come aboard)\nwith associated timeline of events scheduled if funded.\nThe provided budget breakdown is terrible and very difficult to read as it is an image but got pixelated on my screen when zooming.\nThe budget breakdown is detailed enough but my issue is how did the team arrive at all these amounts since they have not agreed with the developers on how much they will pay them.What happens if the team is unable to get\na developer to work at the provided rate? will that part of the project be abandoned?\nThe information of the team was provided but no verifiable link to the team member bio.\nI will be giving 3 stars as i am on the fence on this one considering all the provided information.", "q1r": 3, "q2": "Now i expected a means to see regular commits whiled development is going on with regular updates to the community via the town-halls.\nProviding numbers of active players or whatever at the end of the proposal is not what is needed in this section but ways to know how the progress of work is going.\nI will encourage the team to have a look at similar previously funded proposals as samples to drafting future proposals here https://docs.google.com/spreadsheets/d/15ELXp81NfvXHgrerTbuIofZOXBsdjocN1YgBK0gPP3E/edit#gid=2111315347\nI disagree that sufficient information was provided to audit the proposal.\nI will be giving 2 stars for audit-ability.", "q2r": 2, "assessor": "z_assessor_2301", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 2457, "q0": "The proposed idea tackles an interesting problem in the blockchain gaming sector. Many devs thing that NFT is a concept but most players won't agree. This is where this proposal stands out. The team wants to focus on developing a fun game which is fair and community focused which aligns with the values of the cardano community. \nGames are a medium factor for adoption but definitely help especially if they are first game and then blockchain game. \nThis is why a successful implementation of this game would support the cardano ecosystem.", "q0r": 4, "q1": "The chosen strategy to split the proposal into further funds is fair for the community since it is not always easy to predict the outcome of a complex project. With several proposals the community can reevaluate their choice. \nOn the other hand is it a bit more risky since phase 1 might get funded but phase 2 not.\n\nBut the plan for this phase seems reasonable and the experience and timeline provided look good. \nThis is why it seems highly likely that phase 1 (this proposal) will be implemented. ", "q1r": 4, "q2": "The information provided by the team is enough to roughly audit the process but more information would be better.\nThe communication about progress will be mainly through discord which is a good tool but a open blog would help the openness. \n\nThe KPIs which were chose by the team are not specific or mensurable enough. \nSince the community is able to audit the process but there is room for improvement the proposal will get 3 stars. ", "q2r": 3, "assessor": "z_assessor_2307", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 4570, "q0": "While the CCG niche is, as the proposer notes, a crowded one, the proposal does outline a vision that could help bring gamers into the Cardano ecosystem. \n\nI appreciate this proposal's bottom-up design approach, which focuses on the efficiencies of the user experience. It stands in contrast to many of the other CCG NFT proposals, which tend to be more heavily focused on production values or artistic theme. Detaching the power of collectibles from monetization and moving it purely to aesthetic assets has proven to be a viable model for traditional freemium games like League of Legends, and may well work here. \n\nI would suggest cutting down the section discussing the virtues of Catalyst for your strategy, as they should be more or less self-evident to those involved in the Catalyst funding process. The business-y/economics side of the project is well-detailed here, but we do need to hear a bit about what the gameplay hook will be for the audience beyond usability. What's the elevator pitch? ", "q0r": 4, "q1": "The proposers are students/newly graduated, which does increase the level of risk inherent in this project, less so in the ability to deliver the proposal than to deliver it in a well-polished and professional form. An additional point of concern is that not all the necessary roles have been filled, nor have game mechanics been created or prototyped.\n\nLong-term commitment to the project and iterative processes can go a long way toward mitigating the inefficiencies of learning \"on the job.\" With that in mind, I'd suggest the proposers pad their timeline a little.\n\nThat said, this project's roadmap is very meticulously documented with a clear vision for scaling across multiple Funds. The proposer has clearly invested a lot of time and thought into laying out a strategy for this project. The proposer's background with Plutus is also a plus here. \n", "q1r": 3, "q2": "This project is broken up into multiple phases, with the proposer suggesting the community hold them accountability for progress made up until that point. As written, however, the proposal and linked document don't go into how KPIs will be presented to auditors, particularly between funding rounds. Where will be able to see the art, lore, and design documents?\n\n", "q2r": 4, "assessor": "z_assessor_2564", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6079, "q0": "This proposal follows the possible direction \"Gaming\" explicitly laid out in this Challenge for Fund-9. This proposal is asking for $29915 (thirty thousand) but will be part of a longer funding requirement through funds 9 to 12 for a total of hundred and sixty thousand dollars. It is impressive that a lot of thought has gone into making games more fun and fairer, more decentralized and the blockchain element more relevant. A 13-pages whitepaper exists which in essence is the business plan for this Catalyst project.\nThe issue I see here from my personal perspective is that too much of the focus has been put on the funding, project management and required team hiring process, without actually coming up with a game narrative or look-and-feel that excites and connects emotionally with the assessor or voter. This could risk a similar response in the target gamer that the project needs to become a success, have a viable play-to-earn ecosystem and thrive. It is therefore not possible to tell from the information provided or linked by this team whether it is likely to drive user growth and adoption for Cardano, or -as is the goal- revolutionize blockchain gaming. The proposers have the project management and technical detail down to a t, which bodes well for the execution, but at this early stage for the first funding, I would have really liked to get a reason to love the game world, art, design, teaser, or demo.", "q0r": 3, "q1": "The proposer team have provided a very detailed roadmap and timeline until the end of next year (!), tables with budget breakdown and roles to be assigned / skills required. There is already a white paper and a lot of thought has gone into the blockchain mechanics and play-to-earn incentives of the game. The main proposer is currently a student and has attended all three IOG Pioneer programs this year, which only require signing up and have no certification as far as I am aware. The team have good front-end development skills and obviously take documentation and project planning very seriously. It is likely that with future funding, this project could be implemented exactly to specification. The required skills should be possible to cover with the budget planned. I see the main risk that the funding might run out in the future if not more work is done to do marketing and win over potential players with some kind of teaser, appealing mock ups or a short video describing the passion and vision the proposers have for their game.", "q1r": 4, "q2": "We get a meticulous breakdown of all project stages, budget items and the proposers demonstrate the deep thought process that went into game mechanics and player ecosystem, so they are apparently good with numbers and like to plan ahead. This would be excellent news for any potential auditors of this project, as I have no doubt that the documentation going forward will built on the impressive amount of detail that already went into the whitepaper and this proposal submission. You have noticed that I have some reservations about the likelihood of this game to gain traction or manage financing without a different structure and more marketing, but as far as information for progress audit is concerned, this is a 5 out of 5.", "q2r": 5, "assessor": "z_assessor_2781", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We will create a Digital Collectible Card Game that prioritizes game quality, has decentralized balance changes, and is resistant to pay-to-win by adopting play-to-earn by making cards free out of box", "experience": "Fourth-year computer engineering students. Experience through the Plutus Pioneers, the Marlowe Pioneers, and soon the Atala Pioneers. Aerospace & Telecom industry experience developing propriety software for satellites and baseband units. Well versed in Python, JS and C/C++."}