{"id": 418985, "author": "openlittermap", "title": "Open Source Citizen Science Apps", "url": "https://cardano.ideascale.com/a/dtd/418985-48088", "category": 26595, "amount": 125000, "description": "About 1 billion people have been equipped with a data collection device, but there is little experimentation being done with platforms and tokenomics.", "f6_no_assessments": 11, "f6_rating": 3.1515151515151514, "videos": [], "media": [], "f6_assessments": [{"id": 3282, "q0": "This is a proposal to scale a previously funded and delivered (Fund4) project, OpenLitterMap.  This project effectively incentivizes data collection within communities by allowing every datapoint to be \"minted\" as a native asset on Cardano, both committing the data to the chain and collecting it to a protocol level database.  While the token protocol itself is still in iterative, active development, the base protocol is ready to be expanded and deployed elsewhere, and to this end, this proposal seeks to opensource the protocol to allow it to be adopted by usecases everywhere.\n\nIn particular, the team behind OpenLitterMap have created several sister protocols revolving around war detritus in Ukraine, poverty and mental health detritus around drug use in cities, and issues around abandonment of assets in communities (things like homes are described, but local municipalities would be very interested in use cases for dereliction of abandoned boats and vehicles and equipment, which are huge budget burdens for the departments tasked with finding and dealing with them).\n\nThis opensource incentivization could lead to very widescale adoption (the token that is minted relies on donations or grants to be brought into existence and a value tokenomics has been envisioned but not yet developed...the basic formula will be that minting datapoints will be funded by whatever sustainability protocol can be designed, typically sourced from the community the datapoint serves, and incentivization will be connected to the token providing access to a marketplace or community where the data from the token has managed to create value) and would empower users to take the base protocol and run with it in many different directions.  Under this protocol, anything that can be photographed could be a datapoint for a database, so the uses are almost endless.\n\nWhile typically described as an environmental or citizen science protocol, this opensource proposal highlights that at root this is a decentralized data collection protocol which can validate (through photo evidence and tags, both areas that need scalable governance protocols) enormous swaths of otherwise hard to collect and verify context.  The ability to leverage this captured data to build robust accountability platforms, effective target objectives and other database dependent downstream effects, all while relying heavily on blockchain security and consensus creates a massive impact potential for this opensource phase of the Littermap journey.  I believe it deserves a full 5 stars for Impact.", "q0r": 5, "q1": "The team has been building out the tooling and community for the tooling for some time, having grown the community to hundreds of active members, with its web dashboard showing 100+ new members a month and 13,000+new datapoints in communities around the globe.\n\nThe issues faced by Littercoin from the beginning have been scalability and sustainability, and by spreading the tools to increase adoption, you really hope they have addressed these issues.  For sustainability, they are still reliant on grant and charitable funding, which can increase with adoption, but really needs something more stable underlying it.  The research paper has always had the idea of having \"polluters pay\", but this is a difficult concept to develop since it targets either high level supply chain decisions (which are too complex to establish reasonable standards, even though there is lots of capital at that level) or low level \"citizen polluters\" (who are too difficult to find, and who at any rate may not have any capital).  When applied to the wider concept of general data collection, it becomes almost impossible to correlate this model, especially in the cases of benign data points.  \n\nAnd the scaling issue looks even worse.  In the background is the idea that a machine learning environment is building out a robust, scalable means of validating each littercoin minted but that this is done primarily manually while the machine is learning (and I saw no indications in the proposal that there were other models under consideration, though it does refer to new tokenization models, which could mean either new ways to mine littercoins or new ways to set up tokens other than littercoin).  It would have been good to have more of that process included here, since details around that will determine whether it is just setting the team up to be even more underfunded in the future (which looks like a very real risk to me).\n\nThe roadmap is very limited in details, basically noting they will hire developers, integrate their existing apps and experiment with new ones.  The granularity of the timeline bunches everything up into \"quarters\" when months may have been more appropriate, especially early on (and for the first months of a long timeline like this it is often a good idea to  include weekly breakdowns for as far out as the project manager is comfortable forecasting, typically 3 months).  \n\nLikewise the budget lacks enough granularity to be parsed effectively.  It is limited to telling us 2 developers get 4/5 of the funding, and the project manager receives a 1/5, but there are no breakdowns of milestones or development sprints or any of the other information that would describe a process that was well understood and in hand.\n\nBecause the team has not provided good details of the scope of the development required to opensource the project and they also have not provided sufficient budget information to assess reasonable outlays over the course of the project, I have a hard time agreeing that project is feasible.  However, because they have delivered the first phase of the project successfully, I find that I can neither agree nor disagree that what is described hear will lead to a successful project. 3 stars for Feasibility.", "q1r": 3, "q2": "They provide plenty of good and actionable processes for the community to be able to track the progress of the proposal, including access to their repo, making themselves available in community channels (which they do really well already) and, of course, monthly progress reports, which they feel they will be of \"landmark\" quality (though no details of why that would be are included).\n\nWhere it is less clear is in describing the success and objectives that the proposal has set for itself.  Under impact they describe an opensource project that opens up a whole exploratory world of data collection, but then they suggest that the measure of this in auditability is users in their apps adopting and using other apps *of theirs*.  While this may be a measure of some potential for opensourcing, it may also indicate that such opensourcing has failed, if it  isn't combined with wider scope for seeing how many projects outside the OpenMap ecosystem have been able to effectively adopt their tools and documentation for applying other versions, which is implied, but not addressed directly.\n\nBecause they have included some metrics, I think there is a very solid auditability base here, but it would be good to see more specific metrics and what parts of the timeline and milestones they relate to (which will require building out the timeline and milestones some more).  As well it would be good to not leave the success metrics as implicit factors and to state them more explicitly.  Because of this I am lowering the score just a bit to 4 stars for Auditability.  ", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 3, "ne": 3, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 13885, "q0": "This project aims to build open source platforms to inspire citizen science and fix environmental problems. It fits within the challenge criteria as the proposal plans to build products that decentralize processes and support further innovation.\nBriefly, building on the success of the OpenLitterMap project, that has been in development for 15 years, the proposer would like funding to develop three or more similar applications to help the community. They have identified three specific needs; drug paraphernalia litter reporting, landmine and war debris mapping and derelict housing listing, as their initial target projects. The three ideas have been clearly explained and they are developed following recognition of identified community needs. The proposal adds that there may be many more in the future, but does not go into specific detail or further examples.\nThe impact would be clearly felt by local communities from the implementation of these programs. By delivering solutions at a regional level, they support the SDGs of good health and wellbeing, no poverty and peace, justice and strong institutions. Having experience myself with a citizen science project while working in Tanzania, Snapshot Serengeti (https://www.zooniverse.org/projects/zooniverse/snapshot-serengeti/about/research) , the value and ease of data collection and processing once many users have joined the platform plays a pivotal role in the overall success and continuation of the program. As long as connections to local authority, governing agencies and the immediate neighbors are considered, with careful marketing and promotion I see these projects able to deliver a clear impact for the relevant communities. It’s not as clear in the proposal how the programs will benefit Cardano specifically, this explanation could be developed further by the proposer.\nAcknowledging the possible successful impact, yet only for specific smaller communities without explicit reference to Cardano, I give this proposal 4 stars for impact.\n", "q0r": 4, "q1": "There is a significant lack of detail provided for the feasibility aspects of this proposal. \nThe only risk listed is “getting people to use the app” which shows a lack of effort to identify other possible pitfalls, delays and obstructions to the process. For example, some of these apps will collect highly sensitive data, how do you ensure this data is used correctly and doesn’t fall into the wrong hands? Solving this only challenge they list, of increasing the users, could easily be done with marketing and a clearly planned development. However, both of these aspects have been briefly listed without itemization.\nThe timeline listed in the proposal is rather simplistic, listing only one sentence per quarter, without even accompanying dates or KPI added. The first quarter in particular lists ‘developers hired, first new major releases’ and does not refer to what, when, where or how anything is being released. This lack of detail is worrying and appears as if the proposal was rushed, or simply added as an afterthought to some of the other more detailed proposals the user has put forward.\nSimilarly, the budget listed requires two new staff members, who are not listed and the explicit skill set not described. In addition, the budget for the CTO/CEO is purely a $25,000 ‘slush’ fund that encompasses management, development, sales, and marketing, among other aspects, with no clear breakdown of these individual items. \nOverall, you can see aspects of feasibility within this proposal, but there are not nearly enough details or explanations to see this as a thoroughly thought through plan. For this reason I am giving this proposal a rating of 3 stars for feasibility.\n", "q1r": 3, "q2": "In regards to auditability, there is information provided and historic references to base this judgment off. \nThe proposal lists, and can be found through their previous Cardano proposal from Fund 4, a decent expenditure tracking sheet through a shared public google spreadsheet. They also acknowledge that more detail needs to be added to this developing document. Additionally, open access to invoicing, spending and monthly reports will add to this existing spreadsheet. They already have a github organized to collate this information. Thus, the financial auditability is fairly strong.\nThe work progress accountability is a little harder to track due to the brief and vague objectives listed in the timeline in the feasibility section. With only one sentence written per quarter and without specific KPIs listed, there is little to track or identify objectives that can be achieved. They do host a weekly community call, and weekly blog post about their progress, however, this would not show the long term detail and plans, rather only the progress to date with the community. \nLastly, the proposers have written a very brief criteria for the proposal’s success: ‘cross-fertilisation between our apps… build a network of communities and achieve mass adoption.’ These criteria definitely need further explanation in order to be assessed, who is to decide what ‘lots of…” equates to and at what point do you consider it “mass adoption.”\nOverall, financially the auditability is solid, however there are some concerns about reporting the auditability of the work completed within the loose timeline, hence, I give this project a 4 star rating for auditability.\n", "q2r": 4, "assessor": "z_assessor_3840", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 4109, "q0": "This appears on the surface to be a clever use of blockchain tech that can activate what the author identifies as a high volume of personal data collection devices (i.e. phones) with very limited real world data collection implementation.\n\nWhile the proposal does aim to build a user base on the activity of identifying and mapping garbage (of multiple varieties like plastic, drug-use waste, mines, etc), I think we also have to ask ourselves the hard questions.  Do we really need tech to map garbage, or is there another way we can motivate people to just pick it up?\n\nAs the author presents, that collection of the data could be used as a useful tool to provide government resource planning around user collected data, I agree so far as I understand the accuracy of those inputs, or the real ability that a user may have to mid-guide those resources.", "q0r": 3, "q1": "The budget breakdown indicates distribution of funds to 3 efforts, 1) mobile development (40%), 2) web development (40%), and 3) CEO/CTO (20%).  It's not clear if the CEO/CTO are the same person, but the author presents himself in a way that would lead us to believe there is only 1 person currently involved who can fill both of those roles - \"Seán Lynch - Founder, CEO, CTO, CFO.\"\n\nThe breakdown of cost for development roles, $25/hour @ $50k USD each, indicates a project timeline of 2000 hours, or almost 1 full working year.  The leadership CEO/CTO role however, accounts for only 20% of the budget at $25k USD, presumably for the same timeline of 1 year at half the cost.\n\nI'm neutral on feasibility, because while the timeline and milestones do present a project with 4 quarters of delivery, the ideas presented there are not well developed, and very short lacking basic details on exactly what kind of work would be needed within that time.\n\nHowever, I'm not opposed to this proposal, because there is progress being made, and the proposer also states that they received first finding in Catalyst 4, approximately 12 months ago, showing that the project leader is operating roughly on 12 month funding cycles.  However my major remaining doubt is that he doesn't appear to have attracted or retained any tech talent during the course of that time, leading me to wonder how progress to-date has been made or what challenges have been faced that have prevented this project to move forward faster on the previous 12 months timeline.", "q1r": 3, "q2": "The proposal author demonstrates an understanding of developing public trust by being transparent about project delivery through reports, videos, and development progress with a github account containing spreadsheets and invoice copies.\n\nI was unable to find any of the documents mentioned in the auditability section from past activity although I did explore the pages provided (website and github).\n\nIn any case, I'm neutral because I do support the mentality and effort of this entrepreneur, but I'm also hesitant to support investment in a 15 year project with no results that jump out as revolutionary during that time so far.", "q2r": 3, "assessor": "z_assessor_2517", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5160, "q0": "The proposal wants to develop several projects, from littermap to mapping litter to the minefree to mapping landmines. Most of the projects are already ongoing, and several have been for years. Which makes the chance the project failed to deliver very low. The impact of the projects is high as the projects are global and scalable. However, as stated in the proposal itself, the main challenge is getting people to participate in the project. But strangely the proposal does not set aside a budget for marketing at all and instead gives too much budget for developing apps. I suggest focusing on promoting the project rather than extending current apps.", "q0r": 4, "q1": "There is concise timeline information, however, the milestones can be elaborated on more. There is budget information but is not broken down enough. The developer's cost is too general and needs to provide details about the tasks that need to be done. The rate of 25$/hour for a senior developer is very cheap, however, 50k$ for 25$/hour means the developers are working 2000 hours, or equivalent to 50 weeks working full-time. As a developer myself, the app complexity doesn't takes that long to develop. Besides his previous projects, the proposers do not provide further information regarding his educational background, working experience, or relevant skills. I suggest adding a LinkedIn profile/other portfolio accounts, so the voters can easily verify if the proposer has the ability to implement the proposal.", "q1r": 3, "q2": "The project is transparent with the public Github repository activity, which is very active lately. They also held weekly community calls and blog posts to report project progress. The defined success is people contributing to one project start participating in others. However, it will be better if written in a more measurable way. Such as more than 5k users participating in all projects, for example. I also suggest adding quantifiable metrics, such as more than 50k combined downloads from both IOS and Android apps, more than 200k photos of litter, more than 5k contributors, etc.", "q2r": 4, "assessor": "z_assessor_2675", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 6698, "q0": "OpenLitterMap is a crowd-sourced database of the world’s litter and plastic pollution. The origins of the project go as far back as 2008, when it was initially launched. The app is currently complemented by the Littercoin token, which originally launched on Ethereum but now has migrated to Cardano. What is remarkable about the project is the fact that the niche is an excellent candidate for real world adoption: users simply need a phone app to interact with the system, the “raw material”, the litter, is ubiquitous and easy to document its presence and therefore the barriers to entry are minimal.  \n\nThe value proposition of the app + token is intriguing, since the combination that can create an immediate connection between the general population (non-crypto adopters) and the crypto space without the need for wallets or opening crypto exchange accounts, through a reward system for tracking and documenting litter across the world simply with the use of a phone app and geo-located photos. If you need a similar example to relate to the use case better - think about the Brave browser, which aims to democratize the advertising sector and rewards users directly for the ads placed on their devices. \n\nThe project initially secured funding in Fund 4. This proposal is now asking for funding in order to collaborate on a number of similar applications that can inspire citizen science. Amongst the use cases, the first three will be (1) a collaboration for mapping landmines in Ukraine, (2) a platform intended for local government and health workers to decide where to better locate services for a most effective allocation of resources and (3) mapping abandoned real estate properties in Ireland. \n\nCatalyst’s role is to provide a sandbox for experimentation, and to break things! Hence even if I have my worries about the core project, I think that experimenting with other applications and use cases is highly beneficial and can potentially increase adoption rates amongst the Cardano ecosystem if all the other right ingredients are there. In conclusion, five stars for the potential impact. ", "q0r": 5, "q1": "Sean Lynch, the founder, is a very well articulated Irishman and a truly passionate person about citizen science, crowd-sourced data gathering and tracking litter across the globe. He is a geographer by formation, a self-taught developer and a Bitcoin / blockchain enthusiast. Unfortunately, unlike other successful projects, there aren’t any other second tier team members that can stand out and bring a solid proof of an already existing team, well-bonded and working hard towards the project’s mission. The rest of the necessary dev positions are actually advertised as available within the proposal. For me this is a slightly worrying situation, and it makes me wonder why hasn’t Sean managed to already attract more seasoned devs close to him. Would it be the lack of ongoing funding, or perhaps is it a culture fit issue, an unconvincing business case for them? We don’t really know but these questions definitely need to be asked. \n\nThe timeline of the entire project is definitely lacking details. We are only informed of four quarters as milestones, with only a few words for each of them - there is not much information available to assess its reasonability or to go into the details of what the project will actually do. All we know is that in Q1 additional devs will be hired, Q2 would see the integration with the local gov’t app, Q3 would replicate another application in a few cities around the world and Q4 would experiment with new tokens within these new integrations, similar to the Littercoin token.  \n\nA bit curious, the budget is split by functions (for each additional person), and not by task, which makes our job a little bit more difficult in terms of making the right connections when assessing the budget’s reasonableness given the proposed timeline. There hasn’t been much effort put into developing this section at all. We don’t know the actual tasks necessary to complete the project, we do not have estimations of hours for these tasks, or anything else for that matter. We are merely being asked to fund a senior web developer and a senior mobile dev for 50k USD each at a rate of 25 USD/hour. \n\nThere are many worrisome points regarding this project’s feasibility: no real team behind the project, brush strokes when describing the budget and a not very convincing timeline. Given all the uncertainties above (unclear roadmap, no real team behind, very basic budget description), I have a lot of mixed feelings about this project and I can only offer three stars for feasibility due to these circumstances. ", "q1r": 3, "q2": "The team behind OpenLitterMap are hosting a weekly community call, they are frequently updating their blog posts with progress updates and they pledge to continue tracking the expenditures in the google document (more on this below), while allowing community access to invoices and proof of funds at any time - which is an excellent initiative. \n\nWithin the proposal we have indeed a very simple google doc that shows us when the initial funding from Fund 4 was spent. We can only see the dates, and perhaps having a small description next to each outflow would have been excellent, but it is definitely a strong point that showcases his desire for transparency towards the Cardano community. \n\nA point of improvement would be perhaps enhancing their communication channels, since neither Telegram nor Discord are available, and I know for a fact that one of these ones is the preferred medium of interaction with the Cardano community for many members. \n\nIn conclusion we have here very good auditability perspectives, also considering that they are a returning proposer, hence five stars in this category. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8750, "q0": "As for the solution, you have described the platforms and applications the project is aiming for. However, there are some difficult terms in the proposal. I think you should explain them so that it can be easier for the readers of this proposal to understand. Also, in the description of how your proposed solution will address the Challenge, it would be better if you clearly express what is going to be solved in the challenge, although I understand you want develop these tools to engage more people in citizen science. The information should be clearer and more detailed. Besides, you have mentioned the risk that the project may face, but have not come up with a solution. Those are the reasons that I haven't been able to appreciate this proposal yet.", "q0r": 3, "q1": "Looking at your roadmap, the project is divided into 4 quarters with specific tasks. However, the time to start the project has not been mentioned. Also, it would be better to list specific jobs for each quarter rather than generalization as in the proposal. Providing specific information not only makes the project feasible, but also makes the later audit process easier. Regarding the budget and team, the information you provide is still sketchy. You need to add more information in this section if you want to be appreciated for the feasibility of the project. Spending tasks must be more carefully updated and team members need to be introduced to their names, biographies, experience, etc.", "q1r": 2, "q2": "Your project ensures that it will continue to provide budget breakdowns, team and progress updates on Google sheets, reports, and other forms. However, we do not yet know by what criteria the project will be measured and how it will be measured. Regarding the success of the project, the information you give is too little. You can rely on the project's roadmap to describe it more clearly. In addition, it is also possible to mention the benefits that it brings to the community. With this presentation, I'm not sure if the project is auditable.", "q2r": 2, "assessor": "z_assessor_2997", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9738, "q0": "Every proposal needs to be assessed on its own individual merits. This proposal is ambitious and doing something good in the world. Every piece of trash is speeding up our eventual demise. Any project that is helping to clean up our planet is a welcomed addition the the community. I think this proposal has a good and passionate team driving it. I do not want to be taken negatively, but i to have some criticism. It seems maybe the proposal is looking for some fast funding rather that truly leveraging the cardano blockchain. If the team were to sit back and rethink how they can utilize Cardano, I believe they would realize more opportunities. As the proposal is written in its current form its hard to see much of an impact the proposal would have directly on the Cardano ecosystem, and its hard to pinpoint if this is the right challenge for them.", "q0r": 3, "q1": "The idea behind the proposal is good and if it were to be presented in a way that showed the specifics of the Cardano blockchain it wants to utilize then i think it could line up well with the goals of the community. As of now the proposal is presented leaving the reader without a good idea of where the use case is. They do have some projects in development shown by the websites that they list in the proposal. I would suggest that in future funding rounds they go into specific depth in the proposal itself about what it wants to accomplish, and give the voter confidence that this funding will go towards benefiting the Cardano ecosystem.", "q1r": 2, "q2": "The proposal talks about an app that will be a measure of success. What app exactly are you referring to, and exactly how will this app utilize Cardano and drive adoption to the space. It is clear the proposer is working on many different projects, and by visiting the websites that are listed you can get an idea of what the team is working on, but as mentioned there is not enough information given to derive a clear path to measure success. I think there is a lot of promise for what they are working on and i also believe there are many ways they could use Cardano blockchain to help them solve their problems. However, these funding rounds are not a place to come to receive funding for just any crypto idea. The proposal needs to directly benefit the Cardano ecosystem and the proposer need to articulate specific benefits and a clear path to successfully implement the proposal. ", "q2r": 2, "assessor": "z_assessor_3088", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11515, "q0": "Proposal focuses on challenge goals by creating multiple projects by forking existing solution (openlitter-map) which enables user with smartphone to collect data a store it with geological information. However, proposal is not aligned with the challenge settings and does not add value to Cardano ecosystem because existing solution, that should be forked and interconnected with, is not connected to Cardano blockchain (I checked project dependencies composer.json/package.json and code), it is basic web application which does not utilize blockchain technology at all. Also, in proposal, it is not mentioned how it will interact with blockchain. With proposal not aligned to challenge and not connected to ecosystem only 1 star impact rating is appropriate.", "q0r": 1, "q1": "Proposal identifies main milestones and task for project, set for 1 year of work. Roles needed to implement proposal are set, but only one (CTO&CEO verified by LinkedIn) role is occupied, but main developers for project are to be hired. Budget is split for appropriate wages for 1 year of full-time work. More detailed and explanatory budget for every role would greatly improve proposal. Also, more thought out and detailed plan, broken down to items, and roles mapped to items so that is clear what is done by who would improve feasibility of proposal. Main risk and its mitigation is provided. With provided incomplete information for this part, it is hard to reason budget suitability (it might be overpriced), and overall feasibility of project, therefore 3 of 5.", "q1r": 3, "q2": "With basic roadmap set and being open-source project, audit of implementation progress is possible and easy, also proposal team is devoted to publishing progress on public channel. Success of project is only generally described as achieving mass adoption, without reasoning for KPIs/metrics that can be used to track success. Also, KPIs would not be consistent with challenge as described in impact. Therefore, targeted problem cannot be measured against proposed outcomes and is not effective and measurable solution. Overall, proposal auditability section is provided, but only progress is auditable, a lot of information for determining success is missing –this translates to 2-stars.", "q2r": 2, "assessor": "z_assessor_3255", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 12756, "q0": "The problem is clear. There are many problems where more data could lead to a faster and better solution. Therefore this proposal has created a way for everyone to upload data to a given problem to create a comprehensive database for citizens, communities and governments to make better decision by clarifying and locating the given problem. \nThe team has provided some examples and described the use for the Cardano ecosystem. \nIn conclusion this provides a new usecase to the Cardano ecosystem and could bring in many new people because the problems are from a variety of fields which appeal to a variety of people. ", "q0r": 5, "q1": "The founder didn´t provide any proof or text over his skills and experience. Please give us more information. The developers are still wanted. That’s no problem because the team isn´t final in this stage but the hourly cost for them seems comparatively low that it could be hard to find competent employees. \nThe budget is for the employees and the founder. Overall it seems fair, but the pay for the developers is comparatively low. \nThe timeplan is short describes the milestones in different quarters of the year. The milestones are shortly described and give an overview over the plan. The team could have gone more into the details and described the direct tasks related with the milestone to give us a better perspective. \nOverall the founder didn´t provide any infos about himself and the developers salary seems low and the timeplan gives only a rough overview. Therefore I give two stars. ", "q1r": 2, "q2": "They will provide a monthly report. The costs will be broken down publicly and there will be a weekly community call. All this higher the transparency significantly. \nThere are no KPIs or metrics provided like number of users, number of data tracked etc. \nThe overall goal is clear from the context and the cross fertilization between the apps is highlighted in the sentence for the success goal. \nIn conclusion the project is transparent and the goal is clear but there are no KPIs or metrics therefore I remove one star. ", "q2r": 4, "assessor": "z_assessor_3472", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 14587, "q0": "The proposal's idea is illustrated clearly and I think the proposal has an impact on the Cardano ecosystem. The idea is to build up a community of interested users, who will be onboarded into the Littercoin protocol and into the Cardano ecosystem. In describing how your proposed solution will address the Challenge, the writer explains that the project helps build a range of new and largely unexplored citizen science and public engagement tools that empower people to easily share and consume information about the world around them. We want to grow and develop these tools to engage more people in citizen science, bring them into the OpenLitterMap & Littercoin ecosystem, and experiment with new tokenisation models. This shows the alignment between the proposal and the challenge setting. The risk is mentioned but it is better for the proposal to include more apparent explanation on the way the team does to mitigate the problem, which raises the ability of votes from the voters. ", "q0r": 4, "q1": "I am not sure about the feasibility of the proposal. The plan has been built in quarters. In each quarter, the activity is mentioned. However, I think the proposal will be better appreciated if it has a more transparent explanation about the activities and the results of each stage. It is important that the proposal shows not only the things the team does but also the way they conduct the project. The budget is broken down based on the hours of work. I think the proposal should have the illustration of the budget for the smaller tasks that the members do so that the alignment between the budget breakdown and the plan built and written before. About details of the people who will work on the project, the proposal has listed some member who are Seán Lynch - Founder, CEO, CTO, CFO; Laravel + Vue developer; React Native developer. However, I think the proposer should write more clearly about the roles of the members, their experience, how suitable they are to do the job, and which of their talents will help make the project successful. The proposal will be marked higher if there are details about the technical aspects that are needed to conduct the plan. ", "q1r": 3, "q2": "The auditability part of the proposal is written reasonably but the information needs adding. About the measurement to track your project's progress, I understand that the team will report monthly about the progress of the proposal completion with a link to each significant github commit or the budget updates on google spreadsheet for every spend. However, there should be clear KPIs like the number of users using the app, … If the indicators like that are listed, the community will be easy to follow and assess the effectiveness of the project. The picture of success seems vague for me to understand fully. There should be more description on how the project will be when it is successful. What we have here is “Lots of cross-fertilisation between our apps, new people starting in 1 project and getting interested in another.” The proposal can give the example about the cross-fertilisation, for example. This will make it easier for the readers to see the success of the proposal more clearly.", "q2r": 3, "assessor": "z_assessor_4073", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14949, "q0": "Personally, I like this idea. Building a similar civic-led platform to help facilitate citizen-generated data to mitigate the impact of war and the housing crisis is a great idea. The proposal will build a strong foundation and connection of the project with the people, authorities, local government, and health workers, providing a simple platform to attract interested users and participate in the Littercoin protocol and the Cardano ecosystem. However, I think the team should add a few points to increase the persuasiveness of the project. For example, beside the \"Getting people to use the app\" risk, if there are any other risks, please specify a specific and detailed plan to minimize them. Moreover, I think the benefits achieved after advertising is also a point that needs to be focused on in the proposal.", "q0r": 3, "q1": "\"The plan that the team came up with was unspecific and sketchy. There needs a time-framed timetable for work progress, which will result in the team achieving the goals listed respectively in the detailed plan section of the proposal. In my way of thinking, the proposal fails to give an introduction not only the information of the team member's skills, experience as well as qualifications, but also the reference, evidence or links to testify them.\nIn addition, the team should consider adding a Cardano expert who is also a key position needed to ensure the growth of the Cardano ecosystem. Besides, I wonder if the 25,000USD payed for CTO and CEO is monthly salary or else. It should be more detailed. I think there should be a contingency cost as well as risk management cost in this project for needed cases. \"", "q1r": 2, "q2": "\"The information in the proposal is mentioned to help the community monitor and evaluate the process of completing the proposed proposal through clear and public tools.\nUnfortunately, the proposal does not mention any specific KPIs to demonstrate how this project will be successful based on how detailed the evidence, numbers, and ratios are. I recommend that the team should present precise KPIs to make the proposal stronger, easier for voters to choose fund the project and keep track of its success after advanced. \n\"", "q2r": 2, "assessor": "z_assessor_4114", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Using OpenLitterMap as a guide, we want to build a number of similar open source platforms + tools that can inspire action in citizen science to fix problems like landmines and dereliction", "experience": "15 years developing openlittermap.com\nAlso have dozens of other projects that need to be developed and tokenised following in the footsteps of Littercoin. These include druglitter.info, minefree.info, engagekilkenny.com (coming soon) and many more."}