{"id": 418992, "author": "revelar", "title": "Fiat Payments for NFTs - Revelar", "url": "https://cardano.ideascale.com/a/dtd/418992-48088", "category": 26595, "amount": 162400, "description": "Buying a Cardano NFT requires several steps to acquire ADA before a potential buyer can buy. This limits accessibility beyond ADA holders.", "f6_no_assessments": 9, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 3120, "q0": "This proposal will definitely change the game of the NFT space. As a software engineer and business consultant, there is always a client asking if they could buy NFT with fiat. The sad reality we are still early stage in the blockchain technology, thus this proposal is a good bridge for existing users (who are familiar with fiat) to join in the NFT space and familiarizing with the blockchain technologies. With this proposal being built on Cardano, this would definitely drive the adoption rate of users to enter the Cardano blockchain.  With this information, yes i strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "This proposal did outline the budget breakdown and roadmap, but would appreciate if more details on the timeline. All in all the budget cost and deliverables on a time range of 6 months seems reasonable and achievable. The team is solid with their existing projects with catalyst and with their experience with their payment partners, I am confident they will be able to deliver this project successfully. By far the biggest challenge/risk of this proposal would be regulations. The team addressed this risk professionally by partnering with Circle & Stripe to iron out those grey area in the regulations. With all this information, it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "Clear milestones and deliverables are provided in this proposal. Though as mentioned, would appreciate if more details are given on the timeline. The team has a dedicated website to visit and audit their progress at anytime, this is a major plus and very professional. The metric to quantify this project success is clearly listed. With all the information given, I have nothing to add but strongly agree this proposal has given sufficient information regarding the audit progress and success of the project.", "q2r": 5, "assessor": "z_assessor_2403", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6223, "q0": " This proposal seeks funding for the creation of a simple checkout page connected to existing fiat payments (Credit/Debit card, Bank account, etc) to purchase NFTs.\nThe outlined problem is that there is a lot of steps and a lot of friction in the process of buying NFTs as is.\nThe solution is to create a place where that could be accomplished with less friction. The voter should keep in mind that the software will NOT be open source.\n“Fiat on ramp payment solutions are critical infrastructure for Games (in our focus case) that are choosing a blockchain to build their DApp on.”\nThe impact is clearly explained and in line with the challenge goals and metrics.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer considers some risks for the project and has prepared a mitigation plans to reduce them.\nThe proposal has a detailed action plan in a bi-weekly sprint manner. The main deliverable as stated is a MVP payment page that has  five main objectives to cover.\nThe funding is required for the expanding of the Revelar’s core team. Positions are outlined, hourly rates provided and number of hours provided. The budget is perfectly broken down.\nThe voter should be informed that Tevelar’s team is receiving funding for 6 proposals in fund7 and 5 proposals in fund 8. Two are delivered, the rest look on track. https://catalyst.revelar.co/catalyst-updates/\nThe team is well presented in the proposal with active linkedin accounts. The team is with sufficient experience for this proposal.\n This proposal will not seek additional funding due to the product being a self-sustaining commercialized product with customers waiting in pipeline.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer has a website https://catalyst.revelar.co where the team posts monthly updates on all of their projects. The site is accessible for the general public.\nThis being a proprietary code, the proposer could not offer intermediate proof of work without revealing the code.\nThe proposer sees the project progress reports given to IOG monthly as the way for the best way of auditing.\nThe success metrics are measurable and clearly defined. \nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2795", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6699, "q0": "Revelar is a gaming company focusing on the NFT capabilities and the Cardano ecosystem. They have been funded in Fund 7 and Fund 8, and in Fund 9 they are back with two fresh proposals. This one focuses on the creation of a checkout page connected to existing fiat payments to purchase NFTs. It’s only fair to say that adoption of the NFT technology is proportional to the level of ease with which customers can interact with NFT products, including the purchasing stage, and therefore there is a good connection between this proposal and the challenge. \n\nThe team states that they will use Circle and Stripe for integrating fiat payments to their infrastructure, so it’s great news that they have decided to partner with large, recognized service providers in this sector. Let’s remember that in this challenge the aim should be to foster the development of dapps, products and integrations that can foster adoption, and this use case is definitely a step in the right direction, if it will enable more users to interact with NFTs through direct fiat purchases. \n\nGiven the technical solution chosen, the strong partnership envisaged and the off-the-shelf solution considered, I am offering five stars for its potential impact.  ", "q0r": 5, "q1": "Revelar has a great team. The proposal contains selected bios and multiple social media profile and contact information for the most relevant members, and so does their website. They have folks with deep mathematical and engineering backgrounds as well as marketing / business development competencies. They went to great lengths to ensure that this proposal is well understood, since they even created a short video explaining the entire concept behind. \n\nThe team also makes budgeting look easy, with the main expense being hiring additional development resources. Main costs will involve employing a senior engineer, a developer and a QA engineer for 12 weeks, at hourly rates of 135, 73 and respectively 65 USD. Another significant cost is project management, for roughly 30k USD. I do have my slight worries regarding the effectiveness of the solution versus the resources consumed for implementation. Since the checkout page should only be applicable to fiat payments, payment processors usually already have off-the-shelf solutions ready, and integrations should be rather easy, or moderately complex at best - since a multitude of merchants are already going down this route. While recognizing the peculiar challenges of the NFT niche, I can’t really see such an extensive development need as we are being proposed here. The project should take six months and the work will be divided in 12 sprints, with a very logical and reasonable split of activities for each. \n\nOverall we have a solid team, a reasonable timeline and a budget slightly worrisome from a reasonableness perspective, and hence only four stars I deem as appropriate for this proposal’s feasibility. ", "q1r": 4, "q2": "There aren’t many Cardano teams that have what Revelar has already established. A dedicated Catalyst website with updates on all of their funded proposals, going back all the way to Fund 7. We have subsections with updates for each, links to the Ideascale pages and extensive dashboards presented where appropriate. So while creating this tool they have definitely positioned themselves as an excellent reference point in terms of how Catalyst reporting should look like. \n\nDiving down into this proposal’s details, we observe that the team offers excellent success targets: six unique teams using the payment gateway, 200 transactions per project and combined revenues of 250k USD between the six teams  - which are highly relevant and comprehensive items that serve very well for the purpose of measuring the success of this proposal. In conclusion, an excellent auditability implementation, superb Catalyst website and five well deserved stars. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 6776, "q0": "The idea of the proposal is to create a simple payment page that is connected to existing Fiat payments (Credit/Debit Card, Bank Account, etc.) to buy NFT on Cardano. This increases accessibility to non-ADA holders.\nThe proposal to have a clear and precise solution to the problem with the main product is an MVP payment page and an account management system to do: account setup, customer KYC processing, payment, and NFT delivery. Key risks are also described and appropriately addressed.\nThe proposal effectively addresses the challenge and can help bring new active members into the community.", "q0r": 5, "q1": "The proposal provides a clear, detailed 6-month plan that includes a schedule and milestones to be achieved every 2 weeks to build an MVP payment page and account management system to execute account setup, customer KYC processing, payment, and NFT delivery.\nThe proposal's entire $162,400 budget is spent on the development team for 12 weeks at an hourly rate commensurate with the roles and responsibilities of each person on the project. So the community can clearly understand how the funding will be distributed. However, the budget seems to be being worked out for half of the time required to complete the proposal (12/24 weeks), it would be better if the proposal provided clear details on other funding methods (if any) to avoid any confusion.\nThe team behind the proposal is a combination of people with rich experience in project implementation and delivery of software-related products. The detailed description and social links provided show that they have technical strengths and experience in the Cardano ecosystem.\nWith the information the proposal provides, I believe this proposal has a good chance of success if funded.", "q1r": 5, "q2": "To measure and track project progress, Revelar provides a website to show real-time progress, history, and revisions until they make reports and finalize the proposal. This is a very interesting approach as project progress is visually presented in real-time through videos and written materials. This ensures that the community can easily monitor and evaluate the project's progress at any time.\nRevelar also provides specific metrics to gauge project success: at least 6 teams using a payment gateway in Launchpad with at least 200 transactions per project or a total of $250,000 in transactions translated on all 6 groups.\nEasy auditability and specific success metrics. In addition, the fact that this project has been approved at Fund 8 but not funded due to lack of funds remaining in the list shows that the project is very well supported by the community, I believe this proposal will be successful if funded.", "q2r": 5, "assessor": "z_assessor_2829", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7189, "q0": "This proposal plans to solve the problem of limited accessibility non ADA holders experience when wanting to invest their fiat into non fungible tokens without the added steps of buying from an exchange, creating a Cardano based wallet and then using said wallet to purchase those assets. The solution to this problem is creating an on site gateway for users to purchase the NFTs directly with a credit or debit card, creating an easier entry point for purchasing without the need of crypto exchanges or other wallets. The proposer hopes to implement a dashboard profile on their site (https://www.revelar.co) which will allow new buyers a friendly and secure process of payment. This could positively impact the Cardano ecosystem by having new Projects on their Launchpad present their collections to investors not bound by exchange rates or deposit delays, while having an available form of payment for instant buying power. If the proposal is successfully implemented and becomes more mainstream on other NFT sites and marketplaces, the impact on root of entry into the Cardano ecosystem could see an influx of new users. The rational for this proposal is a 4, as it's not an entirely new idea in the NFT space for other blockchains, but it would be a beneficial if it were available on Cardano services.", "q0r": 4, "q1": "The experience and capabilities from the Revelar team can be seen throughout previous funding rounds (Fund 7 & 8). The accomplishments thus far from the team of 15 engineers & developers is neatly organized through their domain for all Catalyst projects & ideas found here; (https://catalyst.revelar.co/catalyst-updates). The solution to the problem is said to be assisted by 'partnering with US & FINCEN approved entities (Circle & Stripe)' to handle and manage custodianship of assets and processing fiat to NFT’s. This is the only third party resource being used for implementing the proposal along with a full stack engineer, developer and Project Manager. The proposer states additional funds not acquired from earlier proposals is included within this idea's budget to expand the existing team, adding a Lead Engineer during a 12 week timeline. No further information regarding if this is a contracted position but the founders of Revelar can all be found within the proposal with their respected LinkedIn profiles for further credentials and expertise. The proposal devises a sensible plan to successfully implement the solution to the problem presented, and due to the team involved and previous Catalyst experience, the rationale towards feasibility is a 5.", "q1r": 5, "q2": "The proposer has explained there will be a 6 month timeline with Milestones being divided into 12 \"Sprints\" which will each take around 2 weeks for completion. As mentioned above, the definition of success will be to fully integrate the payment gateway to the existing Dashboard to be used by new NFT Project's releasing collections from the Revelar Launchpad, consisting of at least 6 teams and with a transaction history of $250,000 USD. This evaluation seems a bit optimistic without additional information on what these unique teams or projects in particular are offering to the Cardano ecosystem themselves or what type of NFT utility they may have, which is a major selling point within the NFT community, so it's difficult to assume these numbers are realistic or inconceivable. Though with the Revelar team providing full transparency through their semi-live open sourced Catalyst updates mentioned above (https://catalyst.revelar.co) the Auditability of this proposal must be given a 5, as all aforementioned solutions being worked on and any deviation from the proposed timeline or allocation of funds can be viewable by Project Catalyst members at any time.", "q2r": 5, "assessor": "z_assessor_2883", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8137, "q0": "As the crypto-economy and Web3 grow, there is a greater need to build improved fiat-to-crypto currency ramps to bridge the gap between traditional finance and the economy's electronic money. I found that this team proposal identified most of the issues of the challenge and large-scale impact. The team chose the Blockchain technology of the Cardano ecosystem to build their Dapp. The idea of ​​the proposal is to create a simple payment page connected to existing fiat payments to buy NFT. While the current issue, as the author said, is that buying Cardano NFT requires some steps to get ADA before potential buyers can buy. This limits access beyond those with ADA. As such, the purpose of this idea is to simplify the NFT buying process, shorten the time, and drive new user action.\nThe author described the solution in a clear, logical manner. Besides, the author also mentioned the risks the team may face when implementing this project. Three main risks included are: attracting too many customers to initially participate in the trial, so the infrastructure is often deficient; regulatory changes (Fiat Custody Management and Processing to NFT is a very gray space; unregulated with different jurisdictions around the world) and software delays. By anticipating these risks, the team has devised appropriate solutions to minimize those risks. \nIf possible, the team should expand the payment range to buy NFT and other crypto purchases. That will attract more users as the number of users willing to accept crypto is growing.", "q0r": 5, "q1": "The author has planned an essential roadmap and timeline. The team made a sprint plan, the time being within six months with 12 x 2 weeks of sprints. Each timeline has a specific goal. The team should detail each Sprint's process and particular tasks to a better plan with readers.\nThe budget of this proposal represents only 2.07% of the total budget for Challenge. I find that the amount is reasonable. This funding is intended to expand their engineering team; the rest of the core minting and distribution will be available in Revelar core services. The engineering team includes a chief engineer, Full Stack developer, QA engineer, and project manager. These people are not described in the proposal. The author has detailed their hourly wages and total working hours, but to make it easier to evaluate, the author should add a quote explanation to come up with this salary. If funded in this Fund 9, they will not need additional funding as it will be built to be an autonomous commercial product.\nThe project is carried out by the Revelar team, who is a well-known collaborator and has received funding for several projects in Catalyst Funds in the past. In this Fund 9, the team has one more proposal, \"Private NFT Gates\", which is also a plus point for contributing many projects to Cardano. The author has provided information about three key members: Jason Toevs- CEO/Founder, Benjamin Beer - CTO, and Jacob Christian - CCO/Co-Founder. They are people with long experience related to Plutus & ATALA Pioneers, SaaS & startup experience to manage a startup project. I find that their expertise and competencies are consistent with the proposal's goals. Their identities are public and easily identified through the personal profile link the author has provided (Linkedin, Twitter, disco).", "q1r": 4, "q2": "This is a brand new project for the team. This project was approved in Fund 8 but was not funded due to a lack of capital in the portfolio. All previous proposals of the group are updated with progress through a website (author provided link). This approach of the team both makes it easy for the community to track all the proposals and shows high transparency.\nThis is not an open-source base to start with so the primary way to track and communicate the team's progress is with Catalyst Coordinator reports including a recorded video and a written version of the updates. updated on the dedicated website listed above, along with applicable demos to their projects each month.\nProject success is measured in two ways, at least 6 unique teams using payment gateways in Launchpad with at least 200 transactions per project or total transactions equal to US$250,000 for all 6 teams.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10579, "q0": "“Fiat Payments for NFTs – Revelar” is a good idea and meets the challenge of “Dapps, Products & Integrations”. The proposer presented an important and popular issue these days: \"Buying a Cardano NFT requires several steps to acquire ADA before a potential buyer can buy. This limits accessibility beyond ADA holders.\" I found this to be a recommendation from an experienced team, through my research I learned that Revelar is a known contributor and has received funding for some of the projects in the Catalyst Funds project in the past. They want to build on the idea of ​​creating a simple payment page that is connected to existing fiat payments (Credit/Debit Card, Bank Account,…) to buy NFT. Meaning they want to build a FIAT payment gateway for NFT on Cardano. As usual with Revelar proposals, they always go through the process with a plan, describing how they implemented and how their work has impacted the Cardano community (here with the implementation of the proposal). This initiative will make it easier for everyone, especially newcomers to find and access NFT projects, and encourage developers to continue being creative in ideation and construction build better products, more useful for society, especially for the Cardano community). The solution proposed by the proponent solved most of the problems of challenge and rigorous argument. They give evidence about this current situation to see the impact of the problem, and the impact of the solutions they offer. The proponent has described the solutions very clearly and specifically, and the main problems are presented quite fully and to the point. To successfully implement the project, they also anticipated the risks they needed to face. The risks mentioned are regulatory changes and software delays. In addition to pointing out these difficulties, the proponent also offered accompanying remedies such as for regulatory changes they are working with entities approved by the US and FINCEN to facilitate core banking integration. Either for software delays, which is the biggest risk with any Dapp project due to these decentralized frontier unknowns and the new technology that will be available along the way, here's the subject. Exporters are also taking advantage of more and more different things like (API, KYC,...). I find that the identification and anticipation of risks as well as careful preparation in providing this remedy will help the proponent to stay in the proactive position, increasing the success of the project, while increasing the community's credibility for this project.\n", "q0r": 5, "q1": "This proposal presented full information related to the implementation schedule, budget as well as members of the project. The proposed roadmap has shown that the main product is the production MVP payment page and account management that does specific jobs. The route is broken down into 6 timelines and spans 12x2 weeks of sprints. Breaking down the plan by week like this will make it easier for them to capture and track the process and results. However, if possible I think the proponent should elaborate more on the specific work in each of those milestones, what the results should be, and who is responsible for managing and controlling the process progress and quality of each of those timelines. These jobs must be done in sequence or can be done in parallel, can the resources of the previous stage be used for the next stage to save time and resources? As for the budget, this proposal asks for $162,400 which sounds like a lot but it is only 6.5% of the full challenge budget, the way it is allocated and used is quite detailed and reasonable. However, if possible, I think the group should deduct a part of the budget to set up a reserve fund to use in unexpected situations. And here I have a small question that is why the budget, the cost part only being calculated for 12 weeks (only half the time it takes to finalize the proposal). Regarding the participating team, the proponent also provided complete information about the 3 members related to their names, professional qualifications, and previous work experience. Besides, the proposer also provides LinkedIn so that everyone can easily check the information.\n", "q1r": 4, "q2": "For the community to measure the progress and success of the project, the proponent has made their website https://catalyst.revelar.co available for anyone to easily access and check on progress degrees, history, and revisions in real-time until they make the final reports and closings of each proposal. The proponent explains how to measure through reports, which include things like: recorded videos, written versions of updates on a dedicated website, demos, and more. The export also shows project success measured in 2 ways with metrics like at least 6 unique teams using the payment gateway during the Launchpad with at least 200 transactions per project or a total of USD 250,000 in transactions across all 6 teams. Citing specific data as above contributes to making it easier for the community to monitor and evaluate the effectiveness. I think the auditability of this proposal is relatively good. As far as I know, Revelar has a list of recommendations so far and has been specifically archived. And this proposal is a completely new idea, not a continuation of any previous proposal. Unfortunately, this proposal in Fund8 has been approved but has not been funded for lack of funding, so I think that with the existing advantages as well as this careful preparation, the proposal will be successful in Fund9.\n", "q2r": 5, "assessor": "z_assessor_3190", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 12039, "q0": "This project offers a solution to buy ADA from fiat using credit cards, debit cards, and bank accounts with a user-friendly website. This is completely in line with the requirements of the challenge. Creating a page to buy ADA from a website will make it very easy for users to buy ADA instead of today's payment sites. This is really helpful for expanding the community of users of the Cardano ecosystem. Imagine, having a transaction that only takes a few clicks, users can get ADA, this makes it easy for many users of different levels to buy ADA. Users always need convenience. If in the Cardano ecosystem many attractive games use ADA for the payment of assets and items, the easy purchase of ADA will also make these games more attractive. ", "q0r": 5, "q1": "It can be seen that the team is highly specialized and experienced in the field of the proposal. The plan is divided into weekly phases, the budgeting for each project implementation personnel, but I think that some parts can be more detailed. In the budget section, the personnel for each category is one person, which can affect the progress of the project if the staff has a health problem, and the project management budget takes up almost 20%, which is high for this category. I also feel that the overall cost is a bit high but maybe this is the common ground of the host country. If the technical part or the implementation solution of the project is given more detail, it will help the community to evaluate better the feasibility of the project. However, the members are seasoned experts should this is not ominous. The risks and the risk reduction plans are given by the team clearly. The tasks that need to be done in the project are listed in detail, it is showing how the project is going and the results at each step of the schedule, so everyone can visualize the work as well as the functions of the program", "q1r": 4, "q2": "The proposal has a clear auditability. First of all, there is a website dedicated to the audit, which makes it easier and more transparent for the audit community to monitor the progress and results of the program. Next, the program's functional and work items are listed weekly, which makes it easy for the community to check the project's progress. In addition, the proposed goals of the number of user groups, the number of transactions, or the total amount made through the program are also given. It makes it possible for the community to see if the program is beneficial or achieving its goals. Although I expect the team to be able to write in more detail, I believe the reports on the website will be updated regularly and in detail.", "q2r": 5, "assessor": "z_assessor_3329", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14497, "q0": "The problem description and the proposed solution are consistent. The impact portion of the proposal is very clear, outlining both the solution and some of the expected issues as well as how they plan to address them. The team, which includes Plutus Pioneers, are very experienced in the Cardano ecosystem. They appear to have a solid grasp of the software development life cycle and will be concentrating on the delivery of the app while utilising off-the-shelf technologies that have already been shown to be effective. Although the plan implies that the code will be released at some point in the future, there is a concern that this process will deliver a closed solution without benefit to the community of coded solutions via, for example, GitHub.", "q0r": 5, "q1": "The proposal outlines crucial deliverables and, in addition, provides a clear plan for how the project will execute those goals in the form of phases. The project's stages have been clearly written out, detailing which sections will be carried out by partners and which by the internal core team. The team members chosen have an important to get right of management and technical depth, as well as highly experienced in project execution and the delivery of software-related products. The requested amount of $162400 seems appropriate for the proposal.  The proposal is well-planned, has a strong team behind it, and, if funded, I believe it would accomplish its objectives within the time frame provided.", "q1r": 5, "q2": "They commit to providing progress demos as well, and they have specified clear success measures, such as at least 6 unique teams using the payment gateway during the Launchpad, with at least 200 transactions per project, for a total of 250000 USD in transactions across all 6 teams. The proposer provides a website where they post updates on all Catalyst proposals on a regular basis. This project has been clearly planned and will be easily auditable by the community.", "q2r": 5, "assessor": "z_assessor_4060", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Create a simple checkout page connected to existing fiat payments (Credit/Debit card, Bank account, etc) to purchase NFTs.", "experience": "The Revelar team is a known contributor & has received funding on several projects in previous Catalyst Funds. We have a growing team of engineers (15+ years) from around the world, Plutus & ATALA Pioneers, & startup experience to manage a bootstrapped project."}