{"id": 419028, "author": "webman2041", "title": "Antiques: The Ideal Blockchain Mkt", "url": "https://cardano.ideascale.com/a/dtd/419028-48088", "category": 26595, "amount": 9500, "description": "Widespread blockchain adaptation is waiting for someone to uncover and unlock the “GUI moment” that launched personal computers. Antiques is the puzzle. Cardano has the key. We just need to find it.", "f6_no_assessments": 5, "f6_rating": 2.3999999999999995, "videos": [], "media": [], "f6_assessments": [{"id": 1942, "q0": "The proposal intends to seek funding for 3 phases to create some kind of marketplace for antiques that is powered by the Cardano blockchain. By discovering new and exciting use-cases for blockchain technology we can expand the relevance of the blockchain to the average person's life. The antiques market could very well be perfectly suited for this new kind of technology, and this proposal intends to explore this option to a relatively low risk (low claimed budget). Furthermore, the proposal does align with the “Dapp.” challenge setting which increases its score in terms of impact. The impact on the market could be huge if the project were to be successful, and they will receive a high score in terms of impact as a result. 5 points.", "q0r": 5, "q1": "The goal for phase 1 (this proposal) is to produce a written report within 3 months. This goal is feasible given the experienced author. The bigger issue lies within the project as a whole, all three phases together. It is hard to understand from this proposal alone what the deliverables will be. This is intentionally the chosen strategy since phase 2 and 3 will depend upon findings in phase 1. This brings a portion of uncertainty to the overall feasibility but that is a task for the community to decide if they are willing to “take a risk”. The feasibility of phase 1, this proposal, is determined to be good. The resulting score will be 4 points, as a result. Good, but not great due to the unknown deliverables.", "q1r": 4, "q2": "The proposer has outlined a set of KPI-like metrics that will be used to audit progress of the project. The KPIs are “soft” in a sense that they define the progress well but they are somewhat hard to measure and evaluate the outcome of the project from. A suggestion is to add hard metrics with estimated goals which allows the community to easily audit and assess the progress of the project. The project is in its first phase of three, and this phase is a discovery phase, which makes it a bit more unclear what the findings will be, as a result its harder to set hard KPIs but the authors are encouraged to refine this aspect nevertheless. \nDefinition of success is split up into phase 1 and the project overall, both are ambitious but great goals. Lastly, the community can follow the progress on the website related to the project, which raises the score in terms of auditability. The resulting score will be 4 points.", "q2r": 4, "assessor": "z_assessor_2290", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "well written...good suggestions for improvements...assessor understands the crux of the proposal..."}, {"id": 9512, "q0": "For lack of foreseeably tangible impacts, I rank this section a 2. I’m rather interested in this integration from the description about the antique market and it’s ideological alignment with cryptocurrency/Cardano. This particular proposal (part ⅓) is what I call a “no-impact proposal” because it’s not supposed to have an immediate impact in itself. Rather, this proposal is supposed to lay the groundwork to enable impacts that might not be accessible from the status quo. The trouble is, voters do not get an indication of what those intended impacts are as a result of parts 2 and3 of this proposal series. Therefore, they have no way of evaluating if they think this first step would be worth the requested funds, even though they may be rather low compared to most other Catalyst proposals. As presented, the proposal only indicates some kind of integration between the Cardano ecosystem and the antiques market, which could easily be done with an existing antiques operation and existing Cardano infrastructure (at no cost to the Catalyst treasury). Throughout the proposal, there isn’t really a clear indication of what is intended to be built here but it does seem to intend to build something.", "q0r": 2, "q1": "For minimal information on the core development team, a missing sense of clearly organized roadmapping, and a budget that could use another step of breakdown, I rank this section a 1. The proposer indicates 40+ years as an antique dealer, which is plenty qualification to carryout this first part of the proposal series. However, voters do not get any information on the details of this persons professional experience, as verified through a LinkedIn profile. There are other involved parties as well that we do not get any information on, such as the proposers IT connection and a set of generally stated “many sources.” Without this information, voters do not have the capability to verifiably evaluate the capabilities of the team. The lack of this information can sometimes be offset with a demonstrable plan to show detail in action but this roadmap only indicates that the timeline for part 1 will take 1.5-3 months. There isn’t enough substance here to show a clearly laid out action plan. As far as the budget goes, the breakdown only goes as far as separating costs by broad categories but it does not breakdown hours of labor, specific expense costs, and what is entailed in admin costs (such as why travel would be needed and for who). I think voters could respond more positively if this section were to see some additional organizational signposting and greater detail in the core team.", "q1r": 1, "q2": "Though in a less familiar format than voters will be used to, this section does present some KPIs that earns this section a 3. I would suggest consolidating this section into some more concise bullet points on what is planned to be measured. Additionally, the provided KPIs are missing targets that shows the voters what objective metrics are being aimed at. The best Catalyst proposals commit to a defined level of success for each of the given metrics to display the magnitude of the potential impacts. Some proposals take that extra step to establish targeted milestones at different timeframes in the future of the project, to give themselves a mechanism for determining if adjustments need to be made at different junctures of the project. Overall, I think this proposal is not quite ready for approval just yet. ", "q2r": 3, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "reviewer catches purpose of Part 1:  to set up parts 2 & 3...I am old school: stand on my 40+ years self employment rather than a LinkedIn profile...did provide more bio info in the file attachment...Part 1 is me setting things up (with an eye on parts 2 & 3) and finding those who will contribute...plan to adjust the auditability as the project proceeds...overall this is a well presented assessment..."}, {"id": 11914, "q0": "This proposal is for preliminary research and the writing of a whitepaper by a highly experienced antiques dealer how to integrate the global antiques market(s) with the Cardano blockchain. The proposal seems heartfelt and serious, and part of a three part implementation plan, for which this is obviously the first.\nThe impact and suitability for the Dapps, Products & Integrations challenge setting could be seriously impaired by the premise of the proposer stated under risk assessment: \"The antiques market, at present, does not need Cardano.\" The recommendation and project plan here is to \"integrate into the old\" rather than to leapfrog antiques market practices into the new world of web3. While this approach might work when working with national governments, as it is Cardano's stated objective to help the disadvantaged and improve on existing legacy solutions provided currently as a monopoly by national governments, this is not the case for private business. If the antiques markets, in the eyes of a 40+ year veteran who is also the proposer and project manager, has no need for Cardano, no problem that needs solving, where lightning fast confirmations, or immutable ownership records, or lower costs without middlemen structures, could improve by orders of magnitude on a pain point, this is not the \"GUI moment\" for blockchain that the proposer is hoping for.", "q0r": 2, "q1": "The proposer is clearly highly experienced in the antiques market and has provided a business website. This website gives some background about the proposer, while also demonstrating good skill to move a physical business online - the website looks good and is integrated into social media and an online shop / auction system. The proposer is also a blockchain enthusiast, Cardano investor, and willing to learn. The roadmap for the three step implementation, of which this is the first, is relatively vague, and could have been improved by outlining existing community resources that might help with the blockchain integration, for example reaching out to Gimbalabs, MLabs, the Catalyst Proposers chat, local meetups or any other way of demonstrating the willingness and foresight to implement the technical aspects and improve the quality of the planned whitepaper in its technical detail. As far as the antiques part is concerned, I am sure that the budget and timeline will suffice to produce high-quality research from a blockchain savvy and friendly point of view that anyone interested in integrating the antiques market into Cardano might find useful. \nIt would have been nice to see the itemization of the budget into more meaningful categories, for example currently \"possible travel\" is combined with admin costs. The media campaign to excite other antiques dealers could have been specified further, for example whether the costs are for search engine optimization, youtube video production or paying for a part-time social media manager.\nOtherwise, the structure and timeline are clear and the background of the proposer suitable, with sufficient proof of identity and experience provided.", "q1r": 4, "q2": "The interactive website of this proposal plans to interact with the Cardano community and measure its success by the number of these interactions. While this is a fantastic idea per se, it would be great to get a lot more detail about this - how dApps can integrate into a website pre-launch, whether social media followers are counted as these interactions and so on. The second deliverable is a questionnaire for the the antiques business, so showing the distribution plan and budgeting for the costs would be favorable. The whitepaper described in the roadmap as the main objective of this first of three steps seems to be downgraded as a lightpaper in the auditability section, so this should have been clarified with a bit more explanation. It is very positive that the proposer is trying to bring together all the stakeholders and arrange a meeting of minds between two hitherto unconnected worlds that could have a lot of benefit for each other. I would have loved to see the proposer describe from their own background and experience more about the pain points his industry has, and how blockchain could potentially solve them. Otherwise this project risks morphing into a purely social affair. Strong KPIs and more detail on the outline of the whitepaper/litepaper would in my opinion have made this proposal a lot stronger, as it has a lot of potential.", "q2r": 3, "assessor": "z_assessor_3314", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "The antiques market just doesn't know it needs Cardano but Cardano can prove it is the critical link to a decentralized future by adapting to the old rather than asking the old to adopt the new. All good questions re: budget, auditables, etc...\"Pain Points\" is on point; lots of them from the antiques side, and more from Cardano, I'm  sure. "}, {"id": 13609, "q0": "This proposal does a lot of writing but I don't understand how it will deal with the request from the Challenge.\nFirst, the proposal does not clearly describe the users it will serve.\nSecond, what is the user's interest in this proposal? Why do they need to use the product this proposal generates?\nThird, the proposed implementation process does not have\nFourth, the solution description is very vague and unclear. The author does not specify what problem the challenge poses.\nFifth, the risk part too, I found the predictions to be very general and the predictions about the risks unclear.\nAfter reading the entire impact section in the proposal, I found it very difficult to understand what the author wanted to convey, about the solution he wanted to solve the problem in the challenge.\nAs I understand it, the proposal wants to apply for funding to complete a report to give to the community. The question here, the author needs to clarify.\nWhy does the community need this article?\nWhat does it do for the community?\nWhat impact does it have on the development of Cardano?\nIf the author fails to clarify these questions, I am afraid that voters will dismiss the proposal quickly because they do not understand the proposal.", "q0r": 1, "q1": "The proposed implementation plan lacks detail and is quite confusing.\nAt the same time, the author needs to add more information about the members who will perform the tasks in that plan. This helps me and the voters assess whether the pair members have the experience and skill to complete the tasks to complete the proposal.\nNext, I am not understanding who the author wants to conduct this survey with. How will their information help this survey?\nIn the end, the most important factor for me and the voters to assess the feasibility of the proposal is that the author's information about work experience and skills does not have any information.\nTherefore, I cannot identify the author with sufficient experience and skill to complete this proposal. This is a huge minus.\nWith all the information presented about the implementation plan and information about the members involved in the implementation of the proposal. I think this category can only be rated at 1 star because of the serious lack of important information.", "q1r": 1, "q2": "The description of the proposed implementation roadmap and timeline is not clear. I do not know how many months this proposal will be implemented and what work will be done, by whom.\nProposal success metrics are very general, with no specific metrics. For example, the number of people reading the report, the number of reviews of the report, the number of new applications created from the report or article.\nThose are the metrics that are very important to measure the success of the proposal but are not available.\nFinally, the author does not have a public channel for the completed tasks so that the community can monitor the results of the proposed implementation.\nIn summary, I found all information about the solution very confusing and information about the author is not available, the presentation plan is very general. Looking at this information, I don't see this proposal having much of a chance of being implemented successfully. So I can only rate this recommendation at 1 star.", "q2r": 1, "assessor": "z_assessor_3702", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "...\"can't make all the people happy all the time...\""}, {"id": 13974, "q0": "The proposal details how the problem of widespread adoption (I assume has been incorrectly spelt ‘adaption’ at various times in proposal) centres around the ease of adoption/adaption. This is an example of a non-specific sentence that although sounds good doesn’t have a relation to the challenge or the proposed idea. The proposal does well to reference antiques business members – hinting to bring in new users from outside the ecosystem. The benefit to existing Cardano users is also hinted with key contributors from various sectors said to be engaged. It appears to meet the challenge criteria but after reviewing the proposer fails to specify exactly how the following parties will benefit from the plan they propose. After further reading it appears the proposal looks to create an online whitepaper with funding. Proposers should consider clarifying and focusing on the proposal they wish to present as alignment with the title (antiques: the ideal block chain market) creates confusion. If planning to conduct research the proposal should be written as such, at this moment the excessive use of elaborate vocabulary unfortunately clouds the intent and impact of the proposal. Statements like as ‘Cardano advances, we all advance’ brings little value to the proposal and distract from its objectives. In future a more focused approach on what the proposers look to achieve should be taken. Proposers should start with defining the problem faced and then provide actionable points to address problems. Following this by detailing the direct impact of resolutions on the existing community as well as potential to create new use cases. Assuring that the challenge objectives are considered at all points. The result of the work is said to lead to widespread adoption of blockchain technologies, two issues arise from this statement. This appears to be a filler remark and doesn’t not directly mention any benefit to the Cardano ecosystem. The work that is referred to is not a product or service once again failing to meet the challenges criteria. Proposers would benefit from detailing what the end goal of the research is clearly. If that is a new antiques marketplace, the benefits this brings the Cardano ecosystem in terms of new users and integration with the existing antiques marketplace should then be detailed. When asked how the proposal addresses challenge response is too vague. The proposal mentions integrating Cardano into marketplace, yet no explanation of how this will be done-at this moment the community will receive no tangible product/service. In regard to risk no risks or mitigations are provided, not achieving the whitepaper in the time/ or being able to gather enough relevant data could be risks. Mitigated by a consistent time schedule and a planned list of sources, ideally who have agreed prior to provide help. At this moment I disagree that this proposal will be impactful based on the information provided as it appears they request funding to create a whitepaper on a service they are yet to describe. In future I suggest proposers focus on answering the questions provided directly to provide clarity on their goals.", "q0r": 2, "q1": "The proposal looks to be achieved in a 3-month time scale. This appears more than appropriate to develop/write a research paper. Information on how long the proposed report plans to be and types of data omitted would better allow to assess whether it will be feasible within the time. Going off intuition and my previous experiences as a university student most thesis papers within university are conducted in similar time frames so actual production of the report appears feasible. Mentions of a website do raise concerns, within the budget breakdown it refers to it work to set up web pages & apps. If this is expected to be completed with the current budget in this time frame, I can confidently say the quality of both website and apps will suffer. Website /App development both require 3+ months minimum to develop often closer to 6 months (a quick google search will verify this). The lack of specialist language in regard to website/app creation and lack of a clear software specialist don’t bring confidence in regard to feasibility. In future proposers should detail the process of creating both the app and website to justify the timeframe provided. Within the feasibility section the proposers should mention he credentials of who is working on the team and any prior relevant experience they have. This will enhance the feasibility, with prior experience suggesting a pre-existing ability to complete the new task. The budget does not appear well constructed. Web pages/apps are not mentioned in the impact section suggesting their inclusion has not been well thought out. There is a mention of a social media campaign as well as admin costs, and possible travel. All appear too vague. If referring to a social media campaign proposers should refer to who is responsible for running and the platform the person will run it on and the direct cost of this task. ‘Possible travel’ is another example of this vagueness (proposers should have a definite understanding of what is required to conduct the project) and negatively impacts the feasibility of the proposal. If proposers wish to travel and that is key to the proposal, they should detail the price of transport and location at minimum. When asked to detail team members there is only reference to the organiser/manager, whether the other tasks will be completed by contractors is not clarified and the inputs for the report are yet to be identified. This leaves me as a PA little confidence in the feasibility of this proposal. In future each task should be detailed broken down into each individual component as well as the team member responsible. Within the team breakdown the team credentials and possible past projects mentioned. Within budget breakdown the hourly rate or salary of each member and a estimate of the time each task takes. This layout will help proposers in future proposals.", "q1r": 2, "q2": "The proposal does refer to external tracking of progress through an interactive website. There is an issue with this however as there appears to be no plan to track progress before initial website development. Proposers should consider detailing how they will internally track progress before website conception and possibly how they will share this information with the public-this could be achieved via twitter/medium posts. They identify the amount of Cardano projects that participate or contribute as a metric of success. This although it is a reasonable metric does appear to broad and provision of the specific projects or number of creators would better allow for the community to assess whether the proposal has met its goals. The response from those within the antiques space proposer identify as a second metric. Response to what remains an issue as the service the proposer wishes to create remains unclear. Secondly this response is captured in a basic questionnaire to those visiting the site. Those who visit the site likely already have an interest so the data collected may hold bias. Regarding the third metric, it appears to be a convoluted generalist statement. “On going distillation of information in well-defined action tracks” this doesn’t refer to any indicators in which the public can use to judge whether the proposal has met the challenges aims, proposers should consider simpler ways to measure progress that are quantifiable. Metrics like readers of the report, number of comments and impressions serve better to clearly identifying whether the report has been a success. The lack of clarity in the steps after the initial report do bring difficulty but if the intent is research presentation, the amount of the community exposed to it acts as the large indicator of success. When asked what success looks like for this project the proposers refer to the ‘adoption of blockchain benefits due to Cardano’s presence’. Proposers in future should stray away from these generalist comments, once again they draw away from the proposal’s intentions. In this section they refer to a good response to the media campaign and solid collaboration from members of the Cardano ecosystem. In future for better audibility reference to possible the number of upvotes /likes may be a better indicator of success. Good responses must be quantifiable to be audited and can’t be just claimed. In regard to collaboration, proposers would benefit from discussing possible collabs they wish to have or a number of teams they hope to contact them. This once again will provide more quantitative data for the community to assess. Unfortunately at this moment the information provided does not allow for auditability.", "q2r": 1, "assessor": "z_assessor_3865", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "thorough and well presented assessment...the Catch 22 is that a well-funded team is needed to produce a proposal that covers everything known and unknown...but for a single proposer time and resources are limited until some support is provided... "}], "solution": "Antiques is the world’s greatest DAO, perfectly set up for the Cardano ecosystem to become the catalyst for a digital/blockchain awakening across all demographics. This is part 1 of a 3 part project.", "experience": "40+ years full time antiques dealer…author of books and articles on American architectural history and decorative arts…national speaker...promoter of American history…producer of on-line auctions since 1996…Cardano investor…owner of interesting domains such as NFTiques.nft."}