{"id": 419164, "author": "sebastiengllmt", "title": "WalletConnect for Cardano", "url": "https://cardano.ideascale.com/a/dtd/419164-48088", "category": 26595, "amount": 200000, "description": "WalletConnect is a standard to connect mobile wallets to desktop dApps without having the private key leave the mobile app. It is integrated by many dApps, but does not support Cardano currently", "f6_no_assessments": 9, "f6_rating": 4.037037037037036, "videos": [], "media": [], "f6_assessments": [{"id": 1944, "q0": "The “Dapps, Products & Integrations” challenge setting promotes integrations and product development. Both of which this proposal addresses with their solution of connecting mobile wallets to desktop DApps without private key exposure. This exposes Cardano to the WalletConnect standard and will help the ecosystem reach a broader crowd in the end. This type of adoption is both needed and necessary for Cardano to remain a strong actor among all blockchains. As a result, this proposal is impactful and well aligned with the challenge setting. 5 points are rewarded in terms of impact.", "q0r": 5, "q1": "The dcSpark team is one of the most credible sources in the Cardano ecospace at this point. Their reputation alone makes this proposal very feasible since they have a strong history of delivering on their proposals. Their detailed plan is good but could be interpreted as sparse. It would be preferable if a timeline were attached and if more details were added into each of the listed milestones. Furthermore it is claimed that the total budget will go towards funding the development and integration. To increase the credibility of the proposal it could be refined with time estimates and hourly wages to back up their claim of 200.000 USD. \nHowever, their strong reputation of delivering on their proposals weigh very heavily and it will mitigate the few shortcomings in the proposal. 5 points will be awarded in terms of feasibility but they are encouraged to address the above mentioned points in future proposals. ", "q1r": 5, "q2": "The proposing team is as mentioned seasoned developers for the Cardano community. They have delivered lots of great projects before but in terms of auditability from a proposal perspective there are a few areas that could be improved upon. It would be favorable if KPIs that are measurable were clearly stated, this allows community members to follow up the progress of the project. A publicly accessible channel or blog should be stated explicitly, where progress updates are delivered. The above mentioned arguments deduct 1 point from the to total score, resulting in 4 points in terms of feasibility.", "q2r": 4, "assessor": "z_assessor_2290", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2614, "q0": "WalletConnect is an open-source protocol to connect dApps on your laptop/desktop with your mobile wallet via QR code scanning or deep linking. This way, the private key is always securely stored in your mobile wallet, and you have complete control over which transactions are sent. This proposal is to build a solution to integrate WalletConnect into the Flint mobile wallet. Once thriving, the answer will be made publicly available so that any other mobile wallet of the Cardano ecosystem can also integrate it. When this proposal is successful, the projects in the ecosystem will soon blend WalletConnect to smooth the interaction between dynamic wallets and dApps, increase the user experience, have a substantial impact on the development, and expand the Cardano ecosystem.", "q0r": 5, "q1": "The proponent and team personnel have experience building Yoroi wallets and Flint wallets. These are both popular Cardano wallets trusted by users. Recently, the proposal team released the Flint wallet for Android and iOS platforms. They can use those experiences to develop the necessary utility to add WalletConnect to Cardano's dApps and the Flint mobile wallet. In addition, I also appreciate the empowerment of this utility tool to other developer communities so that this solution will soon be integrated into many wallets and dApps on the Cardano ecosystem. However, this proposal carries a risk as the proponent's company is not officially affiliated with WalletConnect, meaning there are potential difficulties in the integration process. This difficulty can be solved simply by closely linking and creating a partnership with WalletConnet. However, in the capital and resource allocation plan, I did not see any mention of this linkage issue.", "q1r": 4, "q2": "This proposal is a big project, and it creates a common standard for dApps and other mobile wallets to use, so it has a specific KPI to measure success. I appreciate the planning board that has particular stages of development, the cost for each item also defined, and the report sheet for community review. What I appreciate most about this proposal is the possibility of the project being completed at a lower cost than the amount applied. To solve the problem, instead of returning additional funds to the catalyst, I hope the proponent can fund some of the other prominent dApps of the Cardano ecosystem interested in supporting WalletConnect.", "q2r": 5, "assessor": "z_assessor_2324", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2696, "q0": "dcSpark, one of the most active companies in the ecosystem and the creator of Flint Wallet has a proposal here which aims to integrate this wallet with a multichain standard called WalletConnect (https://walletconnect.com/). This will help open Cardano apps to integration with other companies, for example in the NFT space. The proposer cites the fact that Instagram declared they will not add support for Cardano NFT’s, because Cardano wallets are not using the WalletConnect standard.\nIt’s easy to understand what the benefit of implementing this will be: widespread adoption through partnerships with companies which already have large user bases.\nAs risks, aside from the standard ones which apply to all software projects, the developers also mentioned the fact that the team behind WalletConnect might not be as collaborative as we hope. The mitigation to this is the very high amount of funds requested, which should cover any extension\nI fully agree that this proposal effectively addresses the Developer Ecosystem challenge. Score: 5.", "q0r": 5, "q1": "For feasibility, we do not have a timeline, or even a crude estimation, which is worrying. We do have a step by step plan with each action that must be taken, but we should have also had time estimations to go with each of these. The community needs to be informed of the time horizon for completion of the project. The requested amount of funds is also very large, at 200k USD. If you foresee this proposal taking more than half a year to complete, with several engineers, then that should be clearly stated so that everyone knows what the scope of this project is. It must be mentioned however that the proposer stated that if the project proves to be simpler than anticipated and it’s completed faster, the unused sum of money will be declined and reused by the Catalyst treasury.\nThese beings said, if anyone can do this successfully, it’s dcSpark, as they already have engineers who are experienced with wallets and all relevant technologies. Score: 4.", "q1r": 4, "q2": "As measures of progress, the proposer said that they would communicate publicly once every step of the plan is fulfilled (initial investigation into the feasibility of integrating WalletConnect with Cardano wallets, releasing a blog post with the approach, releasing a blog post regarding what other wallets on Cardano that want to do this integration need to do etc). We don’t have key progress indicators in the form of numeric estimates for certain things (like X number of commits per X amount of time), but this being a company with a good track record, I think that the public posts will be sufficient to audit progress.\nThe measure of success is also clear enough in my opinion: at least one DApp that would not have been able to have Cardano support without WalletConnect integration deciding to deploy on Cardano based on the work done here.\nI think the information here is sufficient to audit the progress and success of the proposal. Score: 5.", "q2r": 5, "assessor": "z_assessor_2335", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2887, "q0": "I found the proposal lacking a compelling narrative on why the lack of WalletConnect support is a loss for the Cardano ecosystem. The proposer vaguely suggests that dApps that \"start out\" on other chains integrate with this wallet solution, but there's no reason to believe that these dApps would be compelled to integrate/migrate to Cardano chain if Cardano were to integrate with WalletConnect. Again, the proposer vaguely touches on potential security benefits to the integration but doesn't elaborate in a way that connects to the problem or offers a narrative on why the security enhancements will be a positive impact for Cardano. Going further, the proposer vaguely touches on the issue of Instagram NFTs being integrated with WalletConnect and therefore Cardano would presumably miss out on social media exposure without it. While this may be something that warrants a solution, the proposer does little to explain why showcasing NFTs on Instagram should be a priority for our ecosystem. Lastly, the proposer briefly touches on the fact that the WalletConnect team may not even want to engage on such an endeavor, which leads me to question whether there are enough pieces on Cardano and outside of Cardano to support this integration in an appropriate way. ", "q0r": 2, "q1": "Unfortunately I have no reason to believe that the budget and plan is feasible to deliver on the project. The proposer does not give evidence of the relevant skills for the \"popular dApp\" that is interested, nor the WalletConnect team that would partner on the endeavor, nor even their own engineers assigned to the project. Going on, the proposer admits that it's hard to budget without knowing how much WalletConnect would request in funds, sowing further doubt that the budget and plan is feasible. Furthermore, I'm not sure that I would describe the solution as having an adequate enough impact on our ecosystem if it's only accessible through one wallet provider and one dApp irrespective of how popular they are. And finally, the proposer notes the possibility of including the technical specifications in a Cardano Improvement Proposal, a process all on its own separate to Catalyst. Subjecting the furtherance of a Catalyst funded proposal to the CIP process could derail the project plan and timeline. ", "q1r": 2, "q2": "Unfortunately the proposer does not describe a method that will allow sufficient auditing of the project as it progresses. There are no milestones or timelines given to the community. The proposer explains that they will offer the community two write-ups. One write-up, a blog that will report on the feasibility of the project. In my opinion, this is something that should have been considered and frankly completed prior to submitting the proposal. The second write-up will explain to the ecosystem how best to connect to the new solution. These two approaches are not robust enough for the community to track project milestones, and possibly even help. Finally, the single measure of success does not seem to progress the goals and measures of this challenge in an adequate way. ", "q2r": 2, "assessor": "z_assessor_2358", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 3792, "q0": "WallectConnect is a great and interesting feature to have in Cardano wallets. Many dApps are still desktop-centric right now, but I believe just like Web2 apps transition to mobile-centric is a must and key to relevance and survivability of the dApps. Mobile phone is the most used personal computer in Earth and most of global population spend majority of their time on phones is an undeniable fact. Moreover, mobile phone probably will be the only personal computer one will have in their life especially in developing countries or regions such as Africa and SouthEast Asia, where a major portion of the population cannot afford desktop or laptop or not even familiar with it. The development and advancement of mobile phones performance and features are also much more rapid compared to desktops or laptops.\n\nAt the more core, hardware level, it is forecasted that ARM processors (all popular and general purpose mobile phones are built with this ARM architecture) will eventually replace x86 processors (desktop and laptop CPUs mainly use this architecture) due to its performance sufficiency for every day, general computing and energy efficiency allowing smaller, more compact and lost lasting device for every day, normal user. This is also evident in Apple stop using Intel’s x86 CPUs for their device and deploying their new devices (iPhone, MacBok, iMac, etc.) with the brand-new, M1 proprietary chip which, you guess, based on ARM architecture. I digressed.\n\nBottomline is successful implementation of this proposal will be extremely impactful for wider adoption and more frequent utilization of Cardano blockchain technology due to, surprise surprise, you can use more and more Cardano dApps in your smartphone and probably be interconnected seamlessly with your favorite Web2 apps such as Instagram and Twitter. Not having to open a painfully big-screened and heavy laptops or stay glued to your chair in front of desktops screen might be an interesting premise for majority of outgoing, active people.", "q0r": 5, "q1": "The dcSpark teams just recently and successfully launched Flint Wallet, so I believe they have enough resources and capabilities to address the challenge and deliver this proposal. It can be an advantage and prove that they have good amount of skin in the game because they have in-house product that depending on this proposal outcome and can benefit greatly from it. dcSpark also mentioned, in addition to standard engineering risk such as delay and overbudget, some risks associated with WalletConnect counterparty not really being cooperative and this could be real since WalletConnect is still very much EVM-centric. Maybe Milkomeda as EVM-based sidechain can be good testing ground for this proposal before transitioning to Cardano main net implementation.\n\nThe lack of explanation in budgeting and cost breakdown, as well as the expected delivery time of the proposal is preventing me from rating this proposal higher since I have to be fair with other more detailed proposals putting some efforts in this aspect . Nonetheless, this fund will be shared with popular Cardano dApp who is interested with this functionality. This is mitigated with budgeting in upper bound estimate and willingness to return extra fund to Catalyst.", "q1r": 3, "q2": "There are five steps for the implementation of this proposal that can serve as the key milestones. Proposer mentioned that there will CIP submission or blog post detailing how Cardano wallet and dApps can integrate with WalletConnect and that is where the community can get the update and track some progress. The finding and outcome of this proposal will also be shared with other wallets and dApps in ecosystem which making the result open-source that will always be appreciated in Cardano community.\n\nThe success is also outright and straightforward that at least one dApp that originally cannot have Cardano support without the WalletConnect integration chose to deploy into Cardano thanks to the integration done in this CIP. Inside Cardano ecosystem, maybe they can measure how many native Cardano wallets and dApps that can be integrated and interconnected as the result of successful implementation of this proposal.", "q2r": 4, "assessor": "z_assessor_2482", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5707, "q0": "WalletConnect is a standard for connecting mobile wallets to desktop dApps in which the private key does not leave the mobile app and has been integrated by many dApps, but it currently does not support Cardano. The proposer is attempting to resolve this by making the necessary changes to FlintWallet in order to add WalletConnect support, as well as writing instructions on how any other wallet in the Cardano ecosystem with a mobile app can add WalletConnect support. The proposal does identify the issue that must be addressed. This proposal will make it much easier for other wallets to add WalletConnect support, and integrating WalletConnect support will be crucial for increasing adoption because it will allow multi-chain projects that depend on WalletConnect support to also support Cardano. The proposer's proposed solution is unmistakably in line with the issues at hand and addresses them. WalletConnect will be useful for multi-chain projects, and as more projects from other chains migrate to Cardano, they will be hoping for WalletConnect support. According to the observations made above, the proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer and their team have written many CIPs for Cardano wallets, and developers in the team have previously worked on Yoroi wallet and Flint wallet, both of which have mobile versions. As a result, it is safe to assume that the proposer and their team have the necessary skills and experience to successfully implement this proposal. The proposer and their team already have people on board who are capable of carrying out the proposal successfully. The proposal lacks a clear budget breakdown, which would have been very helpful in understanding how the requested budget would be used. Without a budget breakdown, it is difficult to determine whether the requested funds are justified. According to the proposal, the proposer will not require additional funding because the purpose of this proposal is to make WalletConnect support the Cardano wallet, which will be implemented in this proposal and will not require additional funding. The proposer has provided a list of tasks that must be completed in order for the proposal to be implemented successfully. The proposal has taken into account the resources needed to carry it out. However, the proposer has considered risks such as communication misunderstandings with the WalletConnect team, who may or may not be cooperative in the integration depending on their views on Cardano. With all of these factors, the proposal is very likely to be implemented successfully.", "q1r": 4, "q2": "The proposal includes a list of tasks such as researching the WalletConnect codebase in order to plan the integration, describing the action plan in a CIP or blog post, and integrating WalletConnect into Flint Mobile, accompanied by at least one Cardano dApp. All of this is to implement the proposal, but the proposal lacks a timeline or provides no time horizon for project completion. This would have aided in auditing the proposal's progress. The proposer has also stated that any CIP/blog post that includes an investigation into the feasibility of WalletConnect support for Cardano, as well as a post detailing how wallets/dApps can integrate WalletConnect support, will be made public and can be used to track the proposal's development. The proposal includes a clear understandable explanation of the problem to be addressed as well as a clear understandable solution to the problem. Already, milkomeda, which allows multi-chain projects to migrate to Cardano, has assisted many projects and developers in migrating to the Cardano network, and adding WalletConnect support to also support Cardano will be very beneficial for multi-chain projects. As a result, the information provided is sufficient to audit the proposal's progress and success.", "q2r": 4, "assessor": "z_assessor_2736", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6227, "q0": "This proposal seeks funding for the engineering work to add WalletConnect support to FlintWallet and write information about how any other wallet in the Cardano ecosystem that has a mobile app can add support too.\nThe problem is clearly outlined; WalletConnect does not support Cardano.\nThe solution is clear, Integrate WalletConnect support to FlintWallet.\nThe impact is clearly in line with the challenge goals, i.e. growing adoption and interoperability.\nThis proposal is well aligned with the challenge goals and metrics.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer envisions the risk of lack of cooperation on the side of WalletConnect for facilitating the process of integration. There is no mitigation for that risk presented. However the motto of WalletConnect is “Any Wallet. Any Dapp. Any Chain.” \nThe plan is clearly presented with sufficient detail. However there is no timeline attached to that plan. I have to remove a point.\nThe budget is not clearly outlined due to the uncertainty of the ease of integration on the WalletConnect side. The proposer states that this is the upper bound of the budget envisioned and if things go smoothly and the integration is easier than expected, the rest of the budget will be returned to Catalyst.\nHowever the budget does not present any number of people, working hours or hourly rates. For this ambiguity I’ll have to remove a point. \nThe proposer does not provide any details for the team that will work on this project other than mentioning that Flint Wallet team engineers and engineers from the nameless Cardano dapp. \nI have tried to find who are the Flint Wallet engineers with no success on their website. I have to take a point here.\nDear proposer, please consider writing your future proposals with the voter in mind. This way the voter will understand more of what you are offering and you will receive more support.\nI disagree the project is feasible and see some gaps in the plans or budget supplied.\n", "q1r": 2, "q2": "The proposer will make some CIP/blog posts on the subject of feasibility of WalletConnect support for Cardano and CIP/blog posts on the subject of how wallets/dapps can integrate WalletConnect will be made public for the community. \nHowever the proposer does not place any milestones or a timeline in which this will happen.\nThe success metric is clear – one dapp or more decides to deploy on Cardano due to the WalletConnect integration CIP created. No deadline for this also.\nI neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 3, "assessor": "z_assessor_2795", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6757, "q0": "This proposal does a great job of explaining the importance of having WalletConnect support for Cardano mobile wallets and how it has actually prevented some multi-chain projects from integrating Cardano, because we don’t currently have any wallets that support WalletConnect. I believe this proposal aligns with the challenge, because the team plans to add WalletConnect support to their wallet, Flint, as well as write information about how other wallets on Cardano can integrate WalletConnect.", "q0r": 5, "q1": "I believe this proposal is likely to be implemented successfully. This team is very experienced in developing on Cardano and have already built two different Cardano wallets, each with mobile versions.  This will help when integrating WalletConnect for mobile wallets on Cardano.\n\nThe team provides a clear plan for how they plan to go about integrating WalletConnect.  I think it is easy to follow and wouldn’t change a thing about each step.  The only thing that could be added is time estimates for each step.\n\nThe proposal states that the funding will go towards engineering costs as well towards a popular Cardano dApp that wants to support WalletConnect.  It would be nice to see these costs broken down further, but they state that the costs are hard to predict given that they have no affiliation with WalletConnect.  They state that the amount requested is an upper bound for the cost of the integration and that if the costs end up being significantly less, they will return extra funds to Catalyst.  This is cool of them to do, but we just have to trust their judgment on what amount would be considered significantly less, because no threshold is provided in this proposal.\n", "q1r": 4, "q2": "I believe sufficient information is provided to track the success of this proposal.  They state that many parts of the development process will be made public like the investigation into the feasibility of WalletConnect support on Cardano, or a blog post for how wallets and dApps can integrate WalletConnect on Cardano.  These milestones along with the clear steps laid out in the roadmap, are good indicators of progress being made and will be good to watch for when auditing this proposal.  The only thing I find missing from this proposal is some KPIs or metrics the team plans to track to determine their success.  An example of one that could’ve been included is the number of dApps that integrate WalletConnect support based on their CIP.", "q2r": 4, "assessor": "z_assessor_2826", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7118, "q0": "The proposer is planning to investigate whether or not the WalletConnect support is feasible to integrate with FlintWallet and, if it is, create a CIP, integrate WalletConnect into FlintWallet, and write a blog post regarding the implementation so other wallets can follow suit. If implemented, this would lead to more adoption as Cardano is currently missing out compared to Ethereum, Solana, Polkadot, and more when it comes to NFT integration. When it comes to sustainability, the proposer mentioned the risk of non-cooperative actions from WalletConnect. However, I am inclined to believe the chance is low considering WalletConnect is planning to support more chains and wallets based on their website and I fail to see why an open source protocol would deny more integrations. That being said, I am excited and strongly agree with the proposal’s contribution as it would allow integration between a mobile wallet and desktop dApps without having to deal with private keys.", "q0r": 5, "q1": "I can’t strongly agree with the proposed plan because of the lack of details put into it. However, I can understand the lack of knowledge base when it comes to adding support to the codebase, which results in a vague timeline. As a result, I'll try to evaluate based on the components provided by the proposer and any safe, educated assumptions I can make. First, the proposers are the ones who developed the Flint Wallet, so they are the most capable when it comes to integrating the WalletConnect protocol into the wallet. Because the proposal consists of three major processes: researching the protocol; integrating it into the wallet and, eventually, dApps; and documenting the entire implementation so that other wallets can follow, I am more inclined to believe that the execution is feasible. I assume the first process would be doable because WalletConnect has supported many different chains and wallets previously and their Github is completely open so the proposer could dive into the codebase directly. That being said, we need to understand that since their official documentation isn’t structured and fully completed yet, this process might take a significant portion of the plan. The second process would be very doable since they are the maintainers of the wallet, and the third is simply the cherry on top. I applaud the proposer's belief in the future of multi-wallets and their initiative to make other wallets' onboarding a lot easier. The most unfortunate section in the proposal is the timeline and budget section, because there is simply nothing we can analyze there. Again, I know it’s hard to estimate implementation ideas like this, but we can certainly improve it by using a time buffer within the timeline. I would put the research item around one to four months because if it turns out the protocol doesn’t support Cardano yet or the effort might be too high, the proposer can just return the funding for F10. For the other items, I think the proposer would have a better estimate since they do have more hands-on experience developing and documenting light wallets, but I hope the idea comes across. From those estimates, the proposer could then calculate the budget needed (of course with a minimum and maximum range too) based on their hour rate and the varying hours they have to spend. Overall, I still tend to agree with the proposal's feasibility, but I am coming from an optimistic point of view. I personally worked on adding integrations in my previous software engineer job (adding Slack workflow, Discord webhooks, etc.) and I can say the problem is usually just the uncertainty of the initial research.", "q1r": 4, "q2": "I am content with the provided information for auditing. The milestones are clear; CIPs/blog posts post-investigation, WalletConnect support for Flint Wallet, and a blog post detailing how other wallets could do the same (again, kudos). For development, we could check their Github repository, and for updates, we could check their Twitter. After all, WalletConnect is a protocol that connects wallets and dApps, so the success metrics of supporting one dApp are appropriate. However, all of the aforementioned factors can be significantly supplemented with the addition of a clear timeline.", "q2r": 4, "assessor": "z_assessor_2878", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "We will do the required engineering work to add WalletConnect support to FlintWallet and write information about how any other wallet in the Cardano ecosystem that has a mobile app can add support too", "experience": "Our team has written a lot of the CIPs for Cardano wallets and developers in our team have experience previously working on Yoroi and currently working on Flint Wallet -- both of which have mobile versions"}