{"id": 419213, "author": "adarocket", "title": "Secure Offline Portfolio for crypto", "url": "https://cardano.ideascale.com/a/dtd/419213-48088", "category": 26595, "amount": 23000, "description": "Most portfolio managers for cryptocurrencies store information on servers or in the cloud. This does not ensure confidentiality and data can be shared with third parties.", "f6_no_assessments": 7, "f6_rating": 2.1904761904761902, "videos": [], "media": [], "f6_assessments": [{"id": 3994, "q0": "This proposals goal is about creating an offline portfolio manager, only stored locally without any connection to a third party. In my (relatively short, around 2 years) experience of cryptocurrencies, I’ve noticed that portfolio managers are quite popular and widely used. I have limited knowledge about the market of portfolio managers, but each one that I have encountered or heard of has been facilitated by a third party. Considering that this proposed product is without involving a third party (and being offline)\nI can imagine that many people would be attracted to the idea of it (due to the increased security of it). \nIn the end it is pretty much up to each individual what tools you are using, some people prefer the easiness of automatic updates of the portfolio and backup plans if you lose your password, but with the added risk of a third party managing it. Others are attracted to the safer route. Which one is the ‘best’ is up to the individual, but there is definitely some value in offering both (or more) options, which is why I believe that this product would be relevant as a product. The proposer states the intended problem (secure offline portfolio managers are non-existent on the current market) and the solution (create encrypted offline portfolio without the need of third party management). \u2028\u2028The proposal includes some information (this could be a bit more detailed) on ‘how’ the product is intended to work, which is nice to see. For a person who doesn’t have deep technical expertise, maybe a brief explanation on how the AES-256 cipher algorithm works could benefit the proposal. \u2028\u2028If I understand it correctly, this product will be used on Android and iOS phones, but doesn’t that make the security of the portfolio manager only as strong as the security of the device that it is on? A discussion or paragraph mentioning this about under potential risks (apart from the mentioned economic risk) would be highly appreciated, in order to understand the use cases of the product. Also, if the manager is intended to be offline, how will the updates to the portfolio be provided? Will I have to add .csv-files each time I add an asset, and how will the updates work if the app is offline? These might be newbie-questions, but remember that the people intended to use this aren’t all technological experts, and the more information included in the proposal about the product, the better. As a PA (since Fund 6), communicating your whole idea (and execution of it) is imperative, it will make it easier to comprehend the proposal and the possibility of its desired effect. \u2028\u2028It is assumed that the success of the product will be measured by number of users, but I have trouble finding any listed KPIs within the proposal, which I would recommend. Even if I (as PA) assumes what the proposer intends, it should rather be left for the proposer to explain. \u2028\u2028Overall, I agree that this proposal addresses the challenge effectively.", "q0r": 4, "q1": "Disclaimer: The app seems to have been released on play store and App Store already, I haven’t gotten around to downloading it and knowing the functionality of it yet, so have that in mind when reading my rationale. It is also a bit confusing when paired with the information contained within the proposal. \n\nWhat speaks well for the feasibility of the proposal and the trust of the proposers is that they aim to develop and release the product whether they get funded or not, which implies high commitment. Also that the process seem to be underway already (since 6 months, with a working prototype ), albeit in its infancy (as shown on the official website provided). What I would like to see included in the proposal is a detailed roadmap that would explain the different milestones that need to be reached before successfully releasing the product, when the team plans to reach each milestone and preferably how. There are some milestones given, but in the wrong place of the proposal (under the budget breakdown).\nThe only timeframe we are given currently is a potential delivery date of December 1, 2022. I’m unsure if the proposer has forgotten to update their proposal with this key information or misunderstood the questions in some way, but it is information that is vital. \n\nAs mentioned before, the budget breakdown does not contain information on the budget allocations, so I would suggest to include information on for example: How many people will work on each responsibility are, and for how many hours per week? What areas will be covered by the budget?\nSpeaking of people, we are provided with information on the expertise of the team, but no information on the team members themselves. This could preferably be further expanded upon by including LinkedIn-profiles or links to previous projects worked on, so that we could verify the competency and proof of person of the team members. The proposer also has another proposal submitted for Fund 9, and I would like to have seen a small paragraph explaining on how the proposer plans to manage the potential workload if both proposals should be funded. \u2028\u2028Considering the lack of information provided in the proposal, I disagree that it is highly likely that this proposal will be implemented successfully. If only some verifications on the team, budget, roadmap and product development would be included, all of this would be entirely different since the project seems to be on good way already. ", "q1r": 2, "q2": "After doing some detective work on the official website of the product, I found a discord server created by the proposer. It only contains 14 members (at the time of writing this assessment) and the name doesn’t correlate with the product mentioned in this proposal. \nThe website contains a page with release notes, but this is labeled as ‘planned to be released soon’, which makes everything confusing since the app apparently is available for download on play store. Having active communication channels open to the public is immensely important, the community needs to be able to track the (updated and consistent) development progress. Having different information on each informational space of the same product, with non consistent information on the progress of development or non-verifiable information on the team building the product does not speak well for the transparency of the proposal. \n\u2028After adding those possibilities for the community, I would suggest (as mentioned briefly under ‘feasibility’) that the proposer would add relevant KPIs, or measurements of success. For example, number of downloads per month, or measured after each 3 month period. Will the proposer accept feedback from the alpha and beta testers, and are these participants from the community? Transparency and communication, simply put. \u2028\u2028I might have missed this relevant information (please correct me if I’m wrong), but there is very little information included in the proposal that makes it able for me as a PA to assess the level of audibility fairly. I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. ", "q2r": 1, "assessor": "z_assessor_2504", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 162, "q0": "The problem presented in this proposal is relevant and the intended solution makes sense within the context of this challenge. Although this product serves the blockchain public, there is no indication that it is necessary to use Cardano's blockchain, as the data will be stored on the mobile device itself.\n\nThis proposal is incomplete, there are no metrics/KPIs that allow projecting impact on the challenge.", "q0r": 2, "q1": "There is no information about the team (on the website provided I didn't find any information about the team either). There is no information about repositories or whether the project is open source. There is no budget information in the budget field.\n\nThere is no detailed plan, just the mention that the deliverable would be the launch of the app on the PlayStore/Appstore and two estimated dates for alpha and main version release.\n\nDue to the lack of necessary information, the team may not understand the requirements to develop a good proposal on Catalyst, if that's the case, I would recommend watching the tutorials and workshops on the Catalyst School's YouTube channel.", "q1r": 1, "q2": "There is no detailed plan. Regarding roadmap and milestones, there is only mention that the deliverable would be the launch of the app on the PlayStore/Appstore and two estimates of dates for alpha and main version release, which is insufficient. There are no metrics/KPIs.", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 11, "ne": 2, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 2018, "q0": "The idea of the project is to create an offline crypto portfolio, with the data stored only on that specific device. And this solution aims to increase data security. The problem observed was that the vast majority of existing portfolio apps are connected to the internet in some way, which, on the one hand, is quite comfortable because the user can access their assets anywhere, but, on the other hand, there is a risk of information leakage, which is not interesting, especially these days.\n\nWhile this is a necessary and pertinent application, it does not correlate with the challenge because it does not correlate with the increased use of blockchain. It will not make use of blockchain and it will not encourage people to use blockchain more. Therefore, unfortunately, I believe that sponsorship of this idea is not relevant.\n\nMetrics or objectives for this project were also not presented. Of course, in the end, the goal is to finish the application with various usability, however, there is nothing that correlates with the specific use of the cardano blockchain. In addition, as there are no metrics, it is difficult to assess the impact of the proposal. Therefore, as a suggestion, metrics and objectives should be added that correlate the completion/success of this proposal with the objectives of the ADA.\n\nThe scalability of the project is related to the number of users and people reached, which seems feasible to me. However, no monetization plan was presented and no extra sponsorship was requested.\n", "q0r": 2, "q1": "In order to verify its feasibility, we need to verify the following aspects:\n1 – roadmap: A detailed plan to fulfill the project objective was not presented. The only thing presented was a deadline for the launch of the platform. Therefore, it is not possible to verify the possibility of meeting the objectives since it was not presented what will be done. As a suggestion, it would be interesting to add information about the tasks to be performed to complete the project and, with them, who will be allocated to it and the deadline for completion.\n\n2 – budget: USD 23K was requested, however there was no explanation of any task or tool that this money would be allocated. Therefore, the requirement of this amount of money is not coherent. It would be interesting, as in the plan, to add information on what it will take to complete the project and where that money will be allocated, in as much detail as possible.\n\n3 – team: The number of members and their capabilities were informed. However, no proof of knowledge/experience was provided.\n\n4 – risk management: It was said that the only risk is financial and that it would only delay delivery. However, I imagine there may be implementation, disclosure and acceptance risks. It's not just delivering a product, you have to deliver a product that people want to use. Therefore, it is necessary to evaluate the product together with the customer, receive feedback and improve the tool. In addition, it is important that potential customers know about the existence of the product. Therefore, as a suggestion, it is important to allocate part of the requested resource for marketing.\n\n5 – self-funding/scalability: As already mentioned, no monetization plan was made explicit. In addition, scalability is linked to the usability of the tool, so if there is risk management together with the client and joint assessment, the project will be scalable.\n\nAlthough there are several lacks of information, it is important to mention that there is a beta version running. Therefore, despite all the lack of information, it may be possible for the project to be completed.\n", "q1r": 3, "q2": "In order to audit, we need:\n1 – roadmap w/ milestones: A detailed project plan with the “deliverables” and deadlines was not presented. Therefore, it is not possible to monitor the development of the project closely, which compromises the possibility of being audited.\n\n2 – Metrics and KPI: No metrics or KPI were reported. Therefore, as a suggestion, you can include some metrics such as number of downloads, number of feedbacks and interaction, etc. It is important for a project to be aware of the indicators that must be followed and their objectives.\n\n3 – Channel: The proposal has its own website which could share information.\n", "q2r": 1, "assessor": "z_assessor_2298", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4571, "q0": "This proposal articulates an easily relatable problem/concern to anyone who has built up a diverse mix of crypto assets and is using a cloud-based portfolio tool to track it all: what are those services doing with that information? Given the substantial security risks and frequent hacks within the space, crypto-holders will likely feel a lot better using a tool that they're certain isn't painting a target on their backs.\n\nThe Impact section of this proposal is brief, but it's a straightforward and familiar enough concept to get away with it. I would, however, suggest that the proposer enumerate all the features the app will have when completed within the proposal itself. What, if anything, will the user be giving up by using this solution? \n\nThere could be an argument made that the project doesn't particularly tie into Cardano and therefore doesn't necessarily advance the ecosystem, but I believe Catalyst's reputation would benefit from being attached to a successful implementation of this project, which could in turn draw in cryptoholders invested in other chains.  ", "q0r": 4, "q1": "The proposer already has a working product published on the Apple AppStore and Google Play Store; the proposal is essentially to accelerate the development and rollout of additional features. As such, it looks extremely likely that the proposer will be able to implement the project successfully.\n\nThat said, it's fortunate that the project speaks for itself so well, because the proposal is lean on details about the team and line item expenses. One thing I'd recommend the proposer talk about specifically in more detail is a timetable for the delivery of the open source code since security is the primary value proposition of this project. ", "q1r": 5, "q2": "While I can appreciate minimalism as a value, this section needs a lot of work. Yes, we can look at the published app to see which features have been implemented and how well, but auditors still need a way to verify progress is being made, preferably before a feature hits the market. \n\nAnd as touched on above, there needs to be some transparency regarding when code will be available for auditing so that the security claims of the product can be verified, especially since people may be wary of downloading an unaudited app onto their phones. ", "q2r": 2, "assessor": "z_assessor_2564", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5835, "q0": "Security for cryptocurrency portfolios and personal data is very critical. Countless times people's portfolios have hacked into because of less security. This proposal really solves a realtime challenge of Blockchain security. Investors will generally want to invest at places where their portfolios are secure. If the Cardano Blockchain gives assurance of security as this proposal presents, then there is a possibility of increased adoption of Cardano and increased investment in ADA. \nThe proposers present that this app is going to operate without a server or and will not use cloud date storage. So does it store information on local drive?\nIf that is the case heat happens when a drive crushes. There is also no mention of plans of mitigating possible bug issues. ", "q0r": 4, "q1": "The proposers have detailed relevant experience and skills of team members. They have also provided links and sites as evidence to relevant experience of the team. The proposers do not outline any step by step plan and timelines for delivering the project. Also the proposers do not give any detailed budget of what the requested funds will be used for. So I think think the proposers should relook at these things. \nThe state that the only risks they foresee is lack of funds but I think for app development to the should take into consideration bug fixes, getting people sign up on the app and other things. ", "q1r": 2, "q2": "No KPIs are listed to track the progress of the proposal. What success looks like is also not clearly stated. There is no budget to enable accountability to the community. I think this proposal is not auditable. ", "q2r": 2, "assessor": "z_assessor_2754", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8022, "q0": "The petitioner wants to address the problem that the confidentiality of portfolios on online platforms is not guaranteed and some data is shared with third parties.\nThe submitter wants a secure offline portfolio for your favorite cryptocurrencies and tokens for any Android or iOS device. A few solutions have been offered that address this challenge. The problem is that there are already similar apps where you can keep track of your portfolio. (DELTA) I think this project will have little impact on the Cardano ecosystem because many of these offline apps already exist. The only risk included is financial. The competition with other similar apps could certainly be included as well. It could then be included in this section how this app will work better than other existing apps.", "q0r": 2, "q1": "Only teams are included in the proposal. There are no links included to check the team members have the skills and relevant experience. The proposer does not show in a recognizable way which members are needed to implement the proposal. The budget is unclear. I don't see any amounts. I cannot estimate whether the budget is sufficient or not. ($ 23000) There will be no return for further financing. Further development will be done with our own resources. There is no clear timetable. It only says when the product will be delivered. (1 December 2022) no clear implementation plan is included in the proposal. There is no clear definition of the resources needed to implement the proposal. The proposal does not take into account the technical aspects that are crucial for the implementation. The risks have not been sufficiently considered for a successful implementation. The point of mutual competition should certainly be included.", "q1r": 1, "q2": "The road map is unclear. Only a delivery date is included. The project should certainly have some milestones in the development of this product. No KPIs are included in the proposal. The submitter describes the problem that confidentiality of portfolios on online platforms is not guaranteed. The solution that is offered already exists. Online competition has not been taken into account at all. I feel like this proposal was put together very quickly and without thinking about how this project can outperform the competition.", "q2r": 1, "assessor": "z_assessor_2940", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11835, "q0": "The challange the proposal has been filed in aims to bring impactful usecases to cardano and drive ecosystem adoption. The problem statement and proposed solution are stated very broadly and target crypto portfolios in general. Cardano is not explicitly mentioned to be part of the proposed application, though screenshots provided on the website suggest it will be. A lot of information is missing on how exactly an application like this would drive cardano adoption which leads me to disagree the proposal matches the challenge well.", "q0r": 2, "q1": "The team states to be 4 members strong with background in software engineering, but there have been no references provided to proof they are really capable of developing the proposed solution. More information on all team members would be needed to thoroughly assess their capabilities. No detailed roadmap has been provided, only a few high level deliverables. They remain very vague if these deliverables are targeted for the Dec 2022 release or beyond. Also no budget breakdown has been provided nor any thoughts on further development, scaling, sustainability or risks. Detail information is missing in most areas, the team might be able to implement their proposal but with the information provided a lot of question remain unanswered. I disagree the community can expect a high probability of successful implementation.", "q1r": 2, "q2": "The team has setup a website for their application, where they aim to provide details on future release. KPIs and metrics are missing, as well as success criteria. No other information has been provided in terms of auditability which leads me to strongly doubt the community will be able to track the project progress in a transparent way.\n", "q2r": 1, "assessor": "z_assessor_3289", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "We are developing a Secure Offline Portfolio for your favorite cryptocurrencies and tokens for any Android or iOS device", "experience": "4 people with strong experience in software development for back/mobile (from 6 to 15 years) and infrastructure, we also manage our own node"}