{"id": 419421, "author": "bsandmann", "title": "PRISM analytics platform", "url": "https://cardano.ideascale.com/a/dtd/419421-48088", "category": 26595, "amount": 75300, "description": "There is no insight into the usage statistics of Atala PRISM: How many DIDs and Verifiable Credentials (VC) are currently deployed on testnet / mainnet? How are VC used in Ethiopia, by DISH or others?", "f6_no_assessments": 6, "f6_rating": 4.944444444444445, "videos": [], "media": [], "f6_assessments": [{"id": 2461, "q0": "To know the success of a project we need exact metrics. The proposed idea would produce those metrics for PRISM. Exact metrics enable developers and investors to make decisions. \nFor devs stats are useful since they can decide if they want to develop a new product or need to make changes to a system etc. \nFor investors stats are important to get an idea about the situation. \n\nThis is why an analytic tool for PRISM would have a huge impact on the ecosystem. Every app which uses PRISM would profit from this. ", "q0r": 5, "q1": "The team has provided a detailed roadmap and other projects they are working on. Taking all this in consideration the proposed timeline is realistic. \n\nThe team has extensive experience in the field and with PRISM. The budget seems reasonable for the task at hand since it is a large one. \n\nAll this leads to the conclusion that it is highly likely that the team will succeed in the implementation of the product.", "q1r": 5, "q2": "The information provided by the team is enough for the community to audit the process. In combination with the regular updates which are planed we (the community) are able to audit the whole development process. \nThe KIPs which were chosen by the team are good indicators for success. ", "q2r": 5, "assessor": "z_assessor_2307", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2843, "q0": "After enumerating Questions from the community and the public, along with more in-depth questions about DID by experts about its correlations, the team decided to offer a PRISM analysis tool. . to satisfy the needs of the community.\nthe tool is operated on a website, publicizing the most important statistical information of all PRISM related activities from testnet/mainnet in real time.\nIn general, this proposal will provide tools to be able to analyze the decentralized identity (DID) and validator information (VC), to develop in the ecosystem of single subscriber interface (SSI) ).\n* in the brief presentation of this proposal, the team outlined the problems that needed to be solved, and provided a solution to the stated problem, along with specific examples, along with solutions. Very detailed, easy to understand, and very reasonable to the arguments in the solution section, most especially the team provided a link to the detailed documentation of the workings of the solution here: https:// blocktrust.dev/analytics ,\nThe risks seen by the group mentioned three main risks related to : Technical Risks, Risk Planning, Budget Risks, all of which have been provided solutions by the team to optimize them, I agree. with those solutions because they are reasonable.\nThus, it can be assessed that this proposal will effectively address the challenge posed.", "q0r": 5, "q1": "there are 4 phases established for the proposed implementation plan, phases 1 and 2 will be implemented in 4 weeks each, and phases 3 and 4 will be implemented in 8 weeks each, and The content of work in each stage is published together with each stage. In addition, the team can further annotate the statement, which is expected to begin implementation in September, but the disbursement for funding is expected on September 30, so the team will determine to start work on this proposal first. No need to wait for the budget to be disbursed, right? along with that the group stated that it will focus on the outcome of this election, as the group has other proposals in this funding round, and also has a plan for non-overlapping implementation. together.\n I highly appreciate the footnote to the team's budget table, as it states that there will be no need for a backup budget if it arises that can be done out of pocket. Because the work of this proposal is very technical, it is very easy to generate. Along with that greatness, all expenses are provided by the team in detail and complete, ensuring financial transparency.\n The team information is defined as 2 people, along with that all relevant information is published, and the work assignment for the two people will be different.\nso based on the documents and experience stated, this proposal is easy to succeed.", "q1r": 5, "q2": "The proposed team is committed to delivering phase-based workloads 1 to 4, and will report via a biweekly blog on: https://www.blocktrust.dev/blog ,\nNotes on the success of the proposal is not based solely on the number of uses, but on the progress and success of the entire PRISM ecosystem. In addition, there are three other identifiers for success that are; Clear metrics on how Atala PRISM is evolving, along with which developers can better understand their SSI and dApp applications.\nthrough the statements and commitments and published documentation of this proposal, tracking and determining the success of this proposal will be easy for the community.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 10, "ne": 2, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 5308, "q0": "The proposed PRISM analytics platform is a combination of features: 1. public dashboard of digital identity and verified credentials issued using the Atala suite complete with graphs and charts (think DeFi Llama but for identity), 2. a login area where users can see their own interactions, issued/pending VCs and dependent DIDs. \nTo me it is clear how this benefits the challenge setting: enabling nation governance systems by leapfrogging the user experience and reputation of Atala PRISM, attracting outside investors and business users to Cardano, boosting gaming and dApp integrations that require identity or like to query identity statistics.\nI am truly impressed by the elegance of the proposed platform, existing website and thoughtful ideas about possible implementation, and think this could be a very nifty, impactful tool for Cardano as a whole, showcasing and opening Atala for a much broader adoption.", "q0r": 5, "q1": "The proposers have already prepared a website dedicated to the proposed project, and have a lot of relevant experience, including being among the pioneers of Atala PRISM cohort 1 and combined almost 30 years of development experience in academia and corporations in Germany as well as in a self-employed capacity. The provided LinkedIN profiles do not provide a lot of detail about the exact work experience, but the very detailed business plan, and thoughtful description of the problem they are trying to solve as well as their solution give me confidence that they will be able to implement the analytics platform successfully. They have prepared a dedicated website for this project with visually pleasing and relevant charts and graphs, roadmap and description, and detail their timeline and budget breakdown with a lot of care. It seems like the community funds would be in good hands, and the timing of the project seems to be perfect with the first Atala PRISM pioneers cohort graduating to ASTROS and the first projects from the Fund-8 SSI challenge hopefully launching soon.", "q1r": 5, "q2": "The roadmap of this project is split into phases 1-5, with 1-4 being within the scope of this project. The UI and data analytics section of the project should be easy to audit according to the very detailed implementation timeline. The proposers have put a blog section on the project's website, which is a great way for voters and auditors to follow the progress and receive updates from the proposers. A little bit more time could have been spent on KPIs to fulfil the promise of this kind of data-driven project that will ultimately depend on its completeness and accuracy. At this stage of the development cycle, I am happy with the provided information, but would love to see more metrics related to testnet and mainnet integration and the ultimate challenge of providing real time, accurate consolidation of available DIDs and VCs.", "q2r": 5, "assessor": "z_assessor_2688", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7556, "q0": "Well-defined issue the lack of insight into Atala PRISM usage stats makes it impossible for them to know how many DIDs and verifiable credentials (VCs) are currently being rolled out. Deployed on testnet/mainnet this is the problem to be solved in this challenge and it is directly related to the problem to be solved now. How VCs are used in Ethiopia, by DISH or others is also an issue that needs to be addressed in this challenge. Well defined solution the author will provide a PRISM analysis tool that solves the above problem. It's not only for usage statistics and reports, but also for developers and companies with deep insights using a graph that shows the trust relationship between DID and VC. This solution solves the problem of the challenge this toolkit can scale up the challenge and add more value to Cardano it helps more people know about Caradano. The author also has three main risks affecting the development of the proposal as technical risk and planning risk and budget risk. However, the author also offers specific methods to deal with that risk.", "q0r": 5, "q1": "The author has defined a clear timeline and the project is expected to start in September. The project timeline estimated by the author to launch is divided into 5 phases to implement this project: phase 1 is done within 4 weeks, phase 2 is also done within 4 weeks, stage 3 is done within 8 weeks, stage 4 is done within 8 weeks and stage 5 is done present within 12 months. This timeline is perfectly reasonable to implement the project. The stages are listed by the author in detail what needs to be done. The progress of the project is easily trackable through the website https://blocktrust.dev/ . Success is clearly described by the author, success is not measured by the number of users alone, but by the progress and success of the entire ecosystem. An analytics platform like the one presented here not only provides transparency and thus trust in the entire ecosystem, but it also attracts companies for whom such tools are the necessary building blocks. set. The project's success is linked to most of the campaign's challenges. The proposed solution is an essential building block for everyone involved in SSI. It helps the community to track and verify the development and usage of Atala PRISM. It also gives developers and businesses a tool to better understand trust relationships.", "q1r": 5, "q2": "KPIs are clearly defined, metrics are easily auditable. During development the author will write a biweekly blog entry at www.blocktrust.dev/blog , which will provide information on the progress of the work. This allows the community to track their progress. In the blog entry, we will report on the technical details of the work and also outline the proposed release date of the proposal. About the team Blocktrust is a startup focused on developing technologies around Atala PRISM. Includes the following outstanding achievements:\nBjörn Sandmann with 9 years of related experience will mainly work on technical infrastructure, integration with PRISM and web applications.\nJohn Grabenmeier 20 years of frontend development will mainly work on JS-Snippets. The team includes a fairly comprehensive list of very active team members whose profiles show the right skills and experience to do this job.\nThe funding application budget is $75,300, detailed and clearly listed by the author for each item. I find it easy to measure the success of this proposal by the number of surnames the author has listed.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Excellent"}, {"id": 15164, "q0": "Self-sovereign Identity is a decentralized identity concept that allows people to own their own identity, rather than some centralized entity. Atala PRISM is IOG’s technical implementation of that concept using the Cardano blockchain. The project tackles the problem revolves around data availability within Atala PRISM. The proposer explained well on the emerging usage of PRISM, whether it’s by government in Ethiopia or The US DISH network, and raised the question: How many DIDs are there on the Blockchain? Does it really get used? Etc. The solution it provides are PRISM analytic tool web-based application, which will be useful for developer to gain data on-chain. As such, the project is well aligned within the challenge goals. This project will increase adoption for Cardano because it helps the developers to utilize analytics on-chain data regarding PRISM, alongside giving more valuable information to companies if they wish to use it. Overall, a well-written proposal with clear explanation in detail about their goals and solution.", "q0r": 5, "q1": "The project have experienced team as it provides evidence of past works. The team, Blocktrust, is a startup focusing on Atala PRISM and have experienced people behind it, Björn Sandman and John Grabenmeier. Both of their LinkedIn is provided, along with their respective portfolio that showcase past works. By reading the proposal detailed plan and roadmaps, proposer have proven themself that they know what they’re doing (e.g the goals for the first 4 weeks are Setup of a cardano-node, DB-Sync & PostgreSQL, Cosmos DB, etc). Not only a detailed roadmap that explains goals in each phase 1 - 4, they also broken down the budget detail. For example, the backend engineer have been allocated for 120h/month for 2 months, and with the salary of 60USD/hour. Operational costs also explained in detail, from bug fixing, updating software / node, to their expenses on cloud / server infrastructure. I have no doubt that they will deliver this project in timely manner, based on how well-written this proposal is, the detailed implementation, and transparent budget breakdowns. As an Atala PRISM pioneer myself in this coming batch, and working on my thesis revolving around PRISM implementation, this is really exciting for me and I  can’t wait to see it funded.", "q1r": 5, "q2": "The roadmap is provided and explained in detail, each phase consist of goals and target. The metrics is explained and well thought out. The statement “For us, success is not measured by mere user numbers, but by the progress and success of the entire PRISM ecosystem” means that the progress is their measurement of success, which is every set of goals in each phases. They will update their entire progress on each phase on their website as a blogpost on www.blocktrust.dev/blog . Overall, a highly auditable project with clear roadmap and metrics to measure and monitored by the community.", "q2r": 5, "assessor": "z_assessor_2255", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15193, "q0": "We have seen in the last decade how companies that take full advantage of the potential of a correct use of data, enabling them to have a competitive advantage that often translates into profitability. Similarly, we have the notion that in Cardano we are having great advances in the use and adoption of DID and Verifiable Credentials, but so far there are no hard numbers to support thesTherefore, the team that prepared the proposal sees this as an opportunity, and proposes creating a tool that allows developers and companies who are building or want to build in Cardano not only to learn about the data from a descriptive statistics point of view, but also to identify insights and trends that will help them in building their business model, or even in pivoting in Go to Market strategies, or other uses. It does an excellent job explaining all the dimensions and types of questions that can be answered by this solution, so based on my arguments, I can affirm that what is proposed brings value to the ecosystem, as well as aligns perfectly with this challenge.  \n", "q0r": 5, "q1": "I must say that analyzing this proposal is a pleasure. Aside from the meticulous details of each section, you can see the knowledge that the team has not only from a technical standpoint, but also from a planning standpoint, when attempting to position the possible workloads arising from this proposal with other commitments arising from this fund or past funds. The actions necessary for successful implementation are described perfectly in two phases, the first section of development includes 4 phases, within which it is described in detail what would be happening allowing to understand all the steps necessary to complete this proposal. In the second section, there are primarily focusing on bugs to fix, and updates to monitor. Finally, there is an exceptional approach in the risk section, identifying the most relevant risks and presenting appropriate countermeasures for each of those identified. \n", "q1r": 5, "q2": "Once again, the team does an excellent job of describing the roadmap. It includes the development phase, which is expected to last 24 weeks, as well as the main milestones. Although I agree with the definition of success provided, especially for the level of detail. Also, I agree with how it is expected to impact the ecosystem in different areas. I must say that I would have liked that it was not merely a qualitative description but that the team was encouraged to present in numbers, how they expect to be successful. This makes the return on intention a bit more tangible, however, considering what they intend to build, where they are aiming at, and the current state of the DID industry in Cardano I consider that it is not a critical issue in terms of auditability, even more if we consider that they intend to present biweekly reports which will be posted in the blog section of their website. ", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We’ll be offering a PRISM analytics tool. Not only for usage statistics and reporting, but deep insight for developers and companies using graphs displaying the trust-relationships between DIDs and VC", "experience": "Proposer: Björn Sandmann, 9+ years of full-stack development with the .net. Focused on identity and privacy solutions in the cloud. PRISM & Plutus Pioneer, ASTRO. Developed a.net PRISM SDK & PRISM browser-extension wallet (PoC). John Grabenmeier, 20+ years of frontend development"}