{"id": 419409, "author": "rootsid", "title": "Discord Social Credential", "url": "https://cardano.ideascale.com/a/dtd/419409-48088", "category": 26595, "amount": 8425, "description": "Discord is widely used in the Cardano and Catalyst community. On the other side, ATALA Prism DIDs are taking momentum on many projects. How can those identities be linked together?", "f6_no_assessments": 8, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 66, "q0": "The proposer provided a clear description of the issue they are trying to solve: ATALA Prism and Discord identities are not connected.\n\nAs a solution to the problem, the proposer offers to develop and deploy a free ATALA Prism agent that will issue a Verifiable Credential to users that can prove that they have control of a Discord account.\n\nThe problem statement defines a problem within the challenge which needs to be solved. The proposal is very likely to have a positive impact on the Cardano ecosystem, as well as increase adoption for the RootsID wallet and perhaps lead to less scam or phishing attempts on Discord servers.\nI think this proposal addresses the challenge effectively. 5/5.", "q0r": 5, "q1": "The proposers provided a short description of who will work on the project, Rodolfo Miranda, including his role, experience and past work. The team has successfully completed past Catalyst proposals in FUND 6 to 8 related to the RootsID wallet. There is therefore confidence that the team can bring this proposal to term.\n\nThe budget is outlined clearly and broken down into identifiable items (Discord bot, development, integration, AWS deployment, testing, documentation, server and domain fees) with a list of actionable tasks and time to completion.\nThe budget ($8425) and the timetable (9 weeks) seem both to be reasonable to achieve the set goals. Given the experience and plan presented, it is very likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal provided a clear and detailed roadmap and a time horizon for achievement. The KPI that defines the success of the proposal is pretty straightforward (provide a trusted agent that issues a Social Credential proving that a decentralized digital identity (DID) has control on a particular Discord account.) but it would have been great to see how many users we are targeting with this integration and how many discord servers would adopt this solution. The plan presented is however sufficient for the community to track the progress of the proposal. I rate auditability a 4/5.", "q2r": 4, "assessor": "z_assessor_2040", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1945, "q0": "Self-Sovereign Identity has been a hot topic for a while, in the previous fund (Fund 8) SSI was its own category. In this fund, the RootsId team intends to further increase the SSI use-case with a Verifiable Credential to Discord accounts. \nMultiple solutions for identity are being developed for a variety of blockchains. By investing in SSI and applications that have a use case for it, we can make Cardano one of the market leaders within the blockchain ecospace. \nSince there is no SSI category existing in F9, the “Dapp..” challenge is the most fitting category for this proposal. It aligns with the challenge setting very well and must be considered impactful as a result. The score in terms of impact will be 5 stars.", "q0r": 5, "q1": "The proposing team consists of veterans with experience from a plethora of already completed projects within Catalyst. They have multiple proposals in development from fund 8 and have been a driving factor for projects regarding Self-Sovereign Identity. Overall their credibility is very high since they have the experience needed to implement the proposed solution and they have delivered before. Continuing to fund successful teams within Catalyst should be of the highest priority to the Cardano ecosystem.\nThe detailed plan is outlined in a structured manner with phases of varying length, the budget reflects the work required in each phase. The math checks out for their asked claim and their estimated work.\nIt is hard to find flaws in this proposal in terms of feasibility and they will receive 5 points as a result.", "q1r": 5, "q2": "This proposal has provided 4 key deliverables that can be used to audit the project's progress and its development. These deliverables cover the whole project to a great extent, and they will be regularly updated to the community through multiple public channels. The whole project can easily be audited from progress reports, and for the interested community member they provide a detailed view through github and their Kanban board.\nNo real KPIs with hard metrics are listed in the proposal itself, but it is indicated that these will be provided in the project views discussed above. Given the ambitious proposal, this is not an issue since their credibility is high enough to be trusted in this regard. \nOverall the auditability is considered very high for this proposal and the score will reflect that, 5 points. ", "q2r": 5, "assessor": "z_assessor_2290", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4166, "q0": "The challenge seeks to drive adoption by growing an ecosystem of Dapps, products, [services] and integrations.  Ultimately, adoption – transition from innovator and early adopter to early majority and late majority phases – depends on the provision of utility to end users.  People will be drawn to the blockchain that enables them to DO things safely with the least friction. IMPACT: This proposal fits within the challenge problem.  \n\nOne of the most promising and powerful development domains on Cardano implements the concept of Self-Sovereign Identity, which gives individuals control over which aspects of their identities they share.  The premiere platform for this line of development is IOG/IOHK's Atala PRISM's DID (digital identity).  Discord is a VoIP, messaging and digital distribution platform used widely across the globe to build communities of interest.  This proposal originates by the team building the RootsWallet and the RootsID.  It proposes a feature, Verifiable Credential, implemented by an Atala agent to validate control of Discord accounts.  Use of Discord presents risk for the unsophisticated user. Discord attracts scammers and other malevolent users employing a variety of technical and social exploits, including imposter accounts, to defraud vulnerable, naïve users.   IMPACT: The problem statement concisely describes the issue. The proposal provides a rationale for how it contributes to the Cardano ecosystem. Implicitly, Verifiable Credential presents a means of validating the identity of the person with whom one is interacting on Discord, which would be a great benefit to the community, in part as a means of mitigating fraud.  However, the proposal does not explicitly present this as a benefit.  Nevertheless, this is a POSITIVE step for the ecosystem.\n\nThe challenge presents the following KPIs: 1) increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases, 2) Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products, and 3) increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community. A project would be successful under the challenge if it satisfies at least one of the conditions.  Fundamentally, this project improves the quality of the Atala PRISM DID ecosystem (existing) and RootsID (existing) by providing a feature (new) that integrates with a widely used platform (Discord).  Consequently, the project serves all three KPI.  Presumably, this project could be a model for Verifiable Credential for other platforms.  ", "q0r": 5, "q1": "The proposal team is RootsID, an Open Source development team focused on building Self-Sovereign Identity on Cardano.  The team provides a list of 12 prior projects funded through Catalyst on this line of development across Funds 6 (1), 7 (4), and 8 (7).  Five of these projects (F6 and F7) have been delivered to completion.  This project is being completed primarily by a single team member, who has previously served as a Community Advisor and member of challenge teams for Funds 6 and 7.  The team member is a first cohort graduate of the Atala Prism Pioneer Program.  In addition to this proposal, RootsID has submitted 9 other proposals in Fund 9.  RootsID raised the issue of competing commitments as a risk but claims the will mitigate by carefully allocating time to each project.  FEASILIBILITY: RootsID has demonstrated the capability to complete Catalyst commitments and to manage multiple projects within the same fund.  They are scaling at a measured rate (1:4:7:10).  RootsID is clearly following a strategy of deconstructing long-term strategies into discrete, manageable initiatives. The proposal indicates completion within 9 weeks and a modest budget of $8425. The timeline includes and order of execution in clearly delineated stages.  Both of these are modest and simple, which bodes well for execution. The proposer has not indicated provisions for contingency funding. The proposal provides high level descriptions of technical architectures involved.  ", "q1r": 5, "q2": "The proposal includes a roadmap with milestones and a time horizon.  The KPIs are present, sensible and quantifiable. The team utilizes Github substantially, providing transparency on progress to the community. In the proposal, RootsID provides links to other Catalyst projects, completion videos and a summary video of their participation in SSI and Consensus 2022.  The have demonstrated a commitment to transparency.   ", "q2r": 5, "assessor": "z_assessor_2523", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4926, "q0": "This proposal aims to create Social Credentials in the growing SSI field, of the utmost relevance to all major blockchains, that can be used specifically regarding Discord users and servers, where most crypto communities engage with members and develop new onboarding campaigns. As such, it will bring added value to the product range available in Cardano, perhaps even helping pave the way to future soul-bound tokens by menas of such credentials. The proposers aim to provide a trusted agent that issues a Social Credential proving that a decentralized digital identity (DID) has control of a particular Discord account, and any identity wallet will be able to interact and receive this type of Social Credential, and hence can be adopted by other projects that can benefit from this type of validation of a user's DID. This kind of validation would mostly be used as a Social KYC method to understand more about a user hidden under a Decentralized Identifier.", "q0r": 5, "q1": "The RootsID team have successfully completed previously funded proposals through Catalyst in the SSI/DID field, and are regular attendees of cross-chain SSI collaboration teams. Their members, including Rodolfo with his education, past experience and multiple roles in Catalyst (PA, vPA, funded proposer, challenge team member for SSI and Latam challenges, and LATAM Cardano Community and Latam Townhall cofounder), with their proven track record in SSI and Catalyst, are a surefire guarantee that the proposal will be implemented successfully.", "q1r": 5, "q2": "The progress will be measured by transparent and public accountability measure, such as progress reports, github issues and Agile methodology. Success, according to the proposers, will involve the open source code of the agent being available in a public repository, the open source code of the identity wallet (RootsWallet) as well, and the documentation explaining how other wallets can interoperate to request and receive the Social Credentials, alongside a working cloud instance of the agent being hosted on AWS and available for use for free. As such, their public and transparent nature will ensure the community can adequately track the progress and eventual success of this proposal without obstacles.", "q2r": 5, "assessor": "z_assessor_2636", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7901, "q0": "Most of the Cardano community use discord to interact with NFT or token projects. Having used discord, I like how it is set up with the different channels for each category. This reduces “noise” and having to scroll up for a long time to find an announcement or something else that is important. This proposal aims to issue a verifiable credential so that users can prove they are in control of a particular Discord account. When successfully completed, this project can easily scale to other platforms like Telegram, Twitter, Github etc.  \n\nATALA Prism is Cardano’s solution to decentralized identity and this stand alone project, which can be ”integrated with other components in the ecosystem” is a step toward that solution. Since this product can be integrated with other components it does address the objective for this challenge.", "q0r": 5, "q1": "The budget is clearly itemized and lines up with the roadmap. This shows that careful planning was done on the team's part. Lots for reference links are included ranging from profiles, website, github repositories and current and past Catalyst Proposals. The team has delivered 100%(5/5) for proposals in Fund 6 and Fund 7 and provided a video for each proposal showing the final product.  The proposals that were funded in Fund 8 are still in development and the team has nine proposals in this round. The proposer assigned to this project was part of the first cohort of the Atala Prism Pioneer Program and has successfully completed proposals for Fund 6 and Fund 7. This gives one confidence that this project will be successfully implemented. ", "q1r": 5, "q2": "The milestones clearly are laid out and there is a separate section below describing each part of the milestone in a short and concise way. \n\nThe proposer mentions that progress reports will be provided and the rest of information required can be viewed on their github repository. The proposer laid out how the community can audit the progress of this proposal via kanan boards and sprint burndown charts. It is good to see that the proposer went a long way to ensure full transparency and auditability. ", "q2r": 5, "assessor": "z_assessor_2935", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9514, "q0": "This proposal is an extremely low-budget/risk solution to a missing feature that is widely relevant for the greater Cardano community. This integration between Discord and DIDs on Cardano is a building block that can make a huge impact on the utility of the Cardano ecosystem and the retention of ecosystem participants because of increased real-world use-case. Even better, this first integration is indicated to be a first step to easily extend compaitablity with Telegram, Twitter, email, Github, Instagram, Google, Twitch, and I’d imagine many other platforms byond this. I think this section of the proposal could be more convincingly quantified by providing some kind of data on Discord usage within the Cardano ecosystem or Discord usage in general, to establish a clearer understanding of how many users would be enabled to be able to utilize this feature. In my view, quantification is a useful tool for proposals to be able to weigh benefit-cost ratio, so this is a rather minor suggestion for a low-cost proposal such as this one. It could also be a nice feature here to provide some examples about various use cases from the standpoint of NFT/DeFi projects that have communities on Discord, as opposed to the general identification of “access to additional functionalities.” Without these suggestions, I’m still very well convinced of the worthwhile impacts presented here. ", "q0r": 5, "q1": "The level of transparency, capability, delivery time and overall cost is what I would expect for proposals requesting $100k+, so I rank this section a 5. The individual allocated to this particular project shows major capability to be able to reach completion on this proposal with ease, with the additional backup of the RootsID team if anything goes wrong. The track record of this team participating and delivering on MANY previous Catalyst funds provides overwhelming confidence that this team is capable on delivering innovations that are advancing the Cardano ecosystem. For some additional excitement, the prospect of having this proposal delivered in just a 9 week timeframe is exciting, impressive and enables access to benefits on a much sooner timeframe than most other Catalyst proposals. There may be an argument that the $100/hr labor allocation is more on the inefficient side, but the overall cost, developer experience, and practically immediate timeframe of the project overwhelmingly trumps concerns regarding inefficiency, in my mind. I have no serious criticisms for feasibility. ", "q1r": 5, "q2": "Since this project only defines success as product completion (which does not have a direct link to the potential impacts), I rank this section a 4. While the measurability on the completion of the product links to a greater enforcement of product quality, mere completion of the product does not link to potential impacts of it never actually sees usage. This is why I think it’s important for proposals to include usage KPIs in their standard/definition of success, to demonstrate to voters that impact-linked metrics are being monitored as well as completion-linked metrics. I often find it prudent to see objective target metrics for these KPIs as well, to demonstrate to voters that the team has an acute vision for success that will produce the desired impacts. Some of these metrics could include the number of DIDs connected to Discord, the number of projects integrating this tool, and/or the number of use cases developed with this tool. I think these deeper levels of evaluation will help secure more certain voter reaction. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10544, "q0": "This project is very interesting. Discord is the platform most used by internet users today. Linking cardano dID to discord seems like a very natural and needed step, in order to bring more users to the cardano community. Reusability of this project to integrate dID with other platforms such as twitter, telegram is a huge plus as well. Many discord users are also very technology-literate, and care a lot about the safety of their identity, so it is the perfect audience for such a project. I believe this proposal answers the challenge well. I think it would be really nice to have dID directly linked on discord profiles, like spotify or reddit accounts. It would be worth looking into.", "q0r": 4, "q1": "The team is very experienced in app development, and have shown to have delivered on proposal much more technically advanced than this one. I believe they are fully capable of delivering on this proposal. The budget and hours allocated to coding are reasonable and adequate. The only worry I have is whether  the team will be able to get a lot of discord users to use their product. Perhaps asmall outreach program in security-conscious discord groups will really help boost interest.", "q1r": 5, "q2": "This is a open-source coding project, which is completely trackable through the github page. Success will be seeing it delivered on time, and functional. As it is free and open-source, there will be no problems testing it out. This project is compltely trackable in both progress and success.", "q2r": 5, "assessor": "z_assessor_3189", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 12697, "q0": "RootsID does a wonderful job in addressing its challenges for credential verifying and proof of ownership issues. This type of issue has been sought out since the birth of decentralized entities and the attempt to generalize by introducing a very simple integration to discord, a popular social communication platform, will attract many users (both native and non-native) to this project. The scalability for this project has immense potential. By testing out on a very implementable platform, it is allowing rootsID's team to test out the extent of issuing credentials and how effective it is to prevent spam/bot accounts and reliably share information to verified discord users. The scalability of this operation can also be expanded to many other social platforms. Some of the eye-catching platforms: Twitter, Instagram, Twitch, and Github. All of these platforms are heavily infiltrated with unverified and impersonated accounts leading to many scams. Most of all, it also employs the ATALA Prism framework to implement verified credentials which is directly addressing sustainability and minimizing the overlap of many applications. Overall, this project has a very strong base and for terms of testing the method of verified credentials, it provides for a very good use case and test project.", "q0r": 5, "q1": "The rootsID team has been delivering for the Catalyst community since Fund 6. They also have several projects that have been successfully delivered to the community. This alone shows their trust and dedication for developing their projects to fruition. However, to add even more insight, all the projects they have developed have constantly engaged with ATALA Prism and Self Sovereign Identity (SS). Provided this experience, it is highly likely that this proposal will be implemented successfully. Looking at their budget breakdown, there only seems to be costs related to putting the plan into play rather than even developing the project/idea from scratch. This indicates the ability for the rootsID team to implement this project in a successful manner.", "q1r": 5, "q2": "RootsID is providing a clear line of sight into their software for the agent and the identity wallet to be used. The open source code provided will aid hugely for the aspects of audiitability as it not only can be used to track the progress for the project but also help understand the logic and requirements for creating the credential. While this may seem sufficient, it is also beneficial to see the progress in live. The team indicates that they will be adopting Agile methodology and so it would have been better, in terms of being able to audit, to have exposure to some of the internal meetings aside from any community meetings. The team does intend to participate in town-hall break out rooms which is also a good place to learn further about the progress. Since this is a DApp that cross references a decentralized entity with a centralized entity, it potentially would benefit from a beta phase for the project as it could be delicate in how discord deals with this. Overall, it is mostly sufficient to audit the progress and success of the proposal due to the interacting efforts put out by the team and exposure across the project's implementation.", "q2r": 4, "assessor": "z_assessor_3454", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "RootsId will develop and deploy a free ATALA Prism agent that will issue a Verifiable Credential to users that can prove that they have control of a Discord account.", "experience": "RootsId is a group of expert developers that are contributing with many Open Source building blocks to the Self-Sovereign Identity ecosystem in Cardano, such as RootsWallet, WAL-CLI, and sidetree-cardano. Check our full work on Github, and more details on the Teams section below."}