{"id": 419418, "author": "nmelon", "title": "Support CNFT Jungle", "url": "https://cardano.ideascale.com/a/dtd/419418-48088", "category": 26595, "amount": 30000, "description": "CNFT Jungle is a project ran by two people for the community and operating costs of 5000$/month are paid from our own pocket. With public API offering to apps the server costs are increasing.", "f6_no_assessments": 7, "f6_rating": 2.7142857142857144, "videos": [], "media": [], "f6_assessments": [{"id": 3995, "q0": "In my understanding, this proposal is seeking funding in order to cover the operating cost of cnftjungle.io for six months (Which provide analytics tools for NFTs built on Cardano). \nThe main goal with the platform is according to the proposers ‘to create a cross-chain recognizable brand for our analytics utilities for people to trust and rely on’.\nAs a PA, I’m finding it complicated to assess the impact of this proposal, but I will assess it based on the information contained in within. \n\nIn Catalyst ,there is a reason for why us PAs are assessing the sustainability of the project/proposal that we are assessing. These proposal has to be carefully thought through, with as many potential risks (and how to mitigate them) in mind. The problem statement for this proposal is clear, ‘running a platform is expensive’, the solution being (in accordance with this proposal) to apply for 6 months worth of operating costs. There is potential value for Cardano to uphold this platform because they are using Cardano and appears to have grown substantially, and keeping participants on our ecosystem is in our interests. However, I cannot say that the proposal addresses the challenge in this way because it (1) doesn’t focus on outreach directly and (2) the focus on the project seems to be to mitigate early miscalculations in management from the proposing team. To give some perspective, imagine if numerous projects/companies would launch a very ambitious project, run it for one year and then come to Catalyst saying ‘we cannot afford our growth because we miscalculated, can you pay for it?’. I don’t mean to be overly critical, but I want the proposer to understand how this might be perceived from an outside perspective. This is especially apparent when the proposer is mentioning potential risks: \n‘If we continue to operate out of our own pockets without reliable source of income to maintain increasing server costs it will be quite hard for us to develop it further.’\nIn my view, this might almost be interpreted as a hostage-situation. It is indeed a risk, but it is a risk that should be unrelated to the challenge setting. \u2028\u2028KPIs or success data cannot be integrated because the proposals goal is basically ‘keep the platform running for 6 months, and develop what we can’. In order for this to work, I would have liked to see a lot more information included in the proposal on exactly ‘how’ and what the proposer aims to do, especially with the economic situation that they’re in at the moment. Here it would benefit the proposal even more if the plan on future sustainability were extensive.  \nPlus, the proposal doesn’t focus on development, but upkeep of the platform. Development is mentioned, but it would fit the challenge much better if the focus would lie there instead. \n\nOverall, I disagree that this project effectively addresses the challenge. ", "q0r": 2, "q1": "The proposal includes mentions on a couple of milestones (adding utilities such as bubble maps, portfolio management, etc) but it would strengthen the roadmap if each milestone could be presented on the 6 month timeframe. From my understanding, the funding is unrelated to the development, so this might not be relevant. The budget breakdown is super simple, for that reason. Upkeep of 20 servers for 6 months: 30 000 USD. In my opinion as a recurring PA (since Fund 6) becomes slightly confusing when development aspects are mentioned in the roadmap, when the proposal is about covering for server costs. It is conflicting information that make me confused. \u2028I would also love to see some information on the 5 team members mentioned, in order to be able to learn about their experience and expertise related to the project. There is a case to be made that the teams expertise can be verified by having created a successful platform (cnftjungle.io), but all information that we can access will only benefit both the team and proposer. For your next proposals, include some LinkedIn-links to each member, previous projects they have worked on, social media, etc. \u2028\u2028The proposer also has 4 additional proposals submitted for this Fund, so it would be super nice to see a paragraph explaining how they aim to deal with workload-management, if they are related to each other and if the budgets for different proposals will be connected to each others successes (if they are funded). \u2028\u2028Having said that, the platform is online and working, so there is some proof of the teams competency and credibility. \u2028Due to the reasons listed above, I strongly disagree that it is highly likely that this proposal will be implemented successfully. ", "q1r": 2, "q2": "Concerning the reason for this proposal being unexpected costs for the platform, I would (in my opinion as PA) deem transparency and auditability especially important. As mentioned under ‘feasibility’ there are milestones included, but the roadmap would need more detailed information, and address the proposals intention. Tracking the milestones (which I assume will be posted on the social media channels of the platform) will result in the community tracking the wrong thing. Having said that, I don’t know what milestones could be included apart from ‘we kept the system running for a day more’. The only KPIs that could be measured in accordance with the initial purpose of the proposal would seemingly be similar ones. \n\nIt would also be nice to see a mention on where the proposers will post updates and communicate with their community. I know that this is assumed, but it wouldn’t hurt to have it included in the proposal. Keeping on the good side of the voters by being clear in our descriptions and intentions is imperative for all Catalyst proposals, in my personal (slightly idealistic) opinion. \u2028\u2028There is a lot of information missing, or details that would benefit the proposal immensely. I’m very sad to see that they’re not included, because I have no doubts about the proposing team being responsible to the community and managing their platform forward. I am however somewhat bound to assess this proposal in accordance what is written, therefore I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 1, "assessor": "z_assessor_2504", "no_vca": 5, "ne": 3, "ng": 1, "nfo": 1, "vca_o": 2}, {"id": 2425, "q0": "We were able to see an alignment of the proposal with the challenge in which it finds itself, since a tool is being created, using Cardano technologies, which will assist in the commercialization of CNFT based on analysis. However, given how the project was presented, we feel that perhaps the budget being requested is not being used in the best way, thus jeopardizing the possible impact of this proposal.", "q0r": 2, "q1": "In line with the above, we realize that the budget being requested of $30,000 will primarily be used to maintain operations for 6 months. However, although it is planned that a budget for this purpose will not be requested again, we are not so confident that this will actually happen. Thus, the allocation and expenses of this proposal may not be being used in the best possible way, since it would be interesting to use the capital to build a product that will certainly be finalized.", "q1r": 2, "q2": "Regarding the auditability of the project, we see that it is well understood where the project plans to go, however, the parameters used to monitor this trajectory were not so clear. Likewise, regarding the perception of the project's success, we see that clearer goals could have been defined in order to understand more firmly if the proposal was able to generate what was proposed.", "q2r": 2, "assessor": "z_assessor_2306", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2460, "q0": "CNFT Jungle is one of the most used services in the CNFT sector. The CNFT sector was one of the main onboarding tools for new members in 2021 so supporting established projects in this sector can help the community significantly.\nThe goal should be to build a platform which does not need funding from the outside but creates revenue on its own.", "q0r": 4, "q1": "The team has the working product and they know where the money should go. They are experienced in the sector but one thing they are missing is an explanation for their server cost. \nThey say that they pay 5k per month but there is no data supporting this claim. Data supporting this claim or explaining a bit more would help.\nFurthermore they talk about improvements they want to do on their platform but they don't get specific which would be appreciated. Since the money is not for the development but for the day to day cost this is not too bad. ", "q1r": 4, "q2": "Since the money is used to pay the running cost for the servers an intern cashflow would be nice to see and would be necessary sothat the community can audit the process.\nThe team does not talk about that in any way which is not good. It seems they haven't put much thought in the audit process by the community. ", "q2r": 3, "assessor": "z_assessor_2307", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 4196, "q0": "\"Support CNFT Jungle\" proposal aims to address the Dapps, Products & Integration challenge by maintaining their API offering service to apps. They are in transition period for the next 6 months and would like to develop NFT analytics tools to attract big investors to the space. CNFT Jungle is well known public API platform used by many such as jpg.store, fluid tokens, Tokhun and is being integrated to many more such as Eternl wallet, Trading tent. The cost of operating server is $5000 per month. They are asking to fund the Jungle asset and sales database in order to keep continuing data for platforms to build on. The proposal fits the challenge in the sense that its API will feed many dApps in Cardano and needs retention. The challenge of this proposal is they need the funding and cannot operate out of their own pockets to maintain the server cost as it will be hard for them to develop it further.  ", "q0r": 5, "q1": "The operating costs for 20 servers amount to $5000 per month (6 months is $30,000 as the total budget for this proposal). During the next 6 months they plan to add more advanced utilities for NFT enthusiasts and investors such as Bubble Maps, Portfolio management, tax exporting and many more. I would encourage the team to either name such NEW features and placing the proposals on that OR find revenue models (SaaS model as the team mentioned or else) & start  charging for their service. It is not sustainable to bear the cost of $5000 without any profits. Taken into account that during these 6 months, the team will develop new features but again it might have time lag to implement those features. Alternatively, the CNFT jungle team can also explain the situation for those they provide the service to and ask them if they appreciate service and start charging them. The team member profile should be mentioned in the proposal as the CNFTjungle.io doesn't have this information and the Catalyst community would like to get to know who is behind the CNFT jungle. The team should also laid out the timeline for this proposal although the whole plan is in place. The community would like to know in detail what would happen during these next 6 months and whether their new features are likely to successfully completed. My score reflects their track record but they should have provided more information to support their case.", "q1r": 4, "q2": "The team defines its success as a cross-chain recognizable brand for analytic utilities and their KPIs are whether they can meet all projects required data ie. sales volume, floors, holders or more advanced analytucs as well as maintain the data visualization and asset explorer on cnftjungle.io The team has understood the issue of the necessity to retain their API offering to other dApps and come up with the new features in the next 6 months. Hopefully they will consider update the community either via their twitter or bi-weekly meetings as the community lends their support during this transition period and would like to see that their effort hasn't been in futile and that the team keep them informed along the way.", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5488, "q0": "Supporting new initiatives and apps is undoubtedly crucial, but it's also critical to ensure the survival and continued operation of already-existing initiatives. One such application that a broad range of users uses to track Cardano or any other NFT prices and requests is CNFT Jungle. It is also favored because applications can use its open APIs to integrate a variety of cutting-edge services. However, as the author points out, the upkeep of the same costs roughly $5000 in running expenses, and at the moment, just two developers are ensuring that it remains afloat and are paying for this out of their own pockets. After realizing the kind of value it is bringing to the ecosystem, it would make sense to support these people for the first six months of their strategy to become self-sustaining by utilizing their API and completing their SaaS model. However, if the proposal contained more detailed material outlining the type of impact they are delivering for readers and voters who aren't fully aware of the CNFTJungle's technical capabilities and services, it would have helped them gain credibility and confidence. The challenge's requirements are satisfied in a different method, but they are not entirely off-course because they are still promoting Cardano use and enhancing the chain's capabilities.", "q0r": 3, "q1": "However, given that a large portion of the application has already been deployed and that many users are utilizing it, the viability appears good. Additionally, the money requested in the proposal will only be used to support the application's operations, making it simpler for the development team to continue adding value by enhancing their API library and standardizing their SaaS model, which will enable the application to become self-sufficient and continue offering services without any further financial assistance. Meanwhile, at this time, the author also suggests adding more sophisticated utilities to NFT, such as Bubble Maps, Portfolio management, Tax exporting, and many other essential functions, making the program much more potent and sophisticated. However, if the author had given a brief introduction to the team and some details about the features they want to build while the community funds them to maintain them for those six months, it would have helped the author build much firmer foundations for successful funding.", "q1r": 4, "q2": "Additionally, the proposer loses the opportunity to make an impact on the readers of the auditability section. Readers are not provided with any preliminary stats to report on. There isn't much to track either given the funds are requested just to support operations and the team. However, the team that presented ideas in this round should have taken the appropriate steps to provide such KPIs rather than depending just on the reputation they have established. The community really has no way of knowing whether the proposal's development will be in line with the demands and expectations of the challenge. Once more, it's unclear what exactly should be evaluated—whether it should be the features the team builds over this period of assistance or how the application holds up while utilizing the money they were given. Whatever the case, having clear KPIs and reports to evaluate how money was allocated and effectively used would have been beneficial. I advise the team to give the voters the necessary signs and information so they may have faith in the group and the excellent application they have developed to address the ecosystem's vulnerabilities.", "q2r": 3, "assessor": "z_assessor_2704", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7608, "q0": "As an application that operates on the Cardano blockchain please explain how CNFTJungle works and why this product is important to the Cardano NFT community. I understand that multiple projects utilize the API that you provide in order to display information on their site. Please go into more detail on the information that is utilized. This will better inform readers/voters on the importance of CNFT Jungle. Explain if there are any risks to maintaining the CNFT Jungle servers IF funding is received. I would imagine there is no risk to this specific proposal as it is simply just a maintenance proposal. If growth is faster than you project funding could be exhausted sooner than planned. To close, I believe this proposal is straightforward and appropriate, but I would like to see a more comprehensive overview of the CNFT Jungle application and it's impact on the CNFT ecosystem.", "q0r": 3, "q1": "The few concerns I would have in terms of proposal feasibility is having incorrect projections for your project's growth and proposal funding being exhausted sooner than expected. I would like to see a detailed review of each team member and how they contribute to CNFT Jungle. In general for Catalyst proposals, the more detail the better. Who are these five people of CNFT Jungle? ", "q1r": 3, "q2": "This section isn't asking for the metrics of your application but more for the metrics of your proposal's utilization. Since this proposal is asking for funds that will be spent on a monthly basis I would recommend providing monthly metrics for the usage of CNFT Jungle. This should include, website traffic, amount of entities currently using your API data each month, monthly server costs, etc. It is important to track this data so that you can understand that the funds provided from this proposal are being properly exhausted.", "q2r": 2, "assessor": "z_assessor_2907", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9515, "q0": "As someone who is a big fan of CNFTjungle and has used it on more than one occasion, I still had to give this 1 star because of a lack of any additional post proposal impacts. The biggest issue here is that the requested funds are to enable CNFTjungle to “keep doing what we’re doing.” While this doesn’t exactly fit the mission of Catalyst to pursue community driven innovation, it’s more concerning that this proposal doesn’t go into much detail about what they currently do and how they impact the space (and they do, the substance is certainly there). The problem that voters may encounter when considering this proposal is that the impact section is framed in such a way that suggests the project was not built with long term sustainability in mind if they don’t currently have reliable income from advertising revenue. I think such a proposal would greatly benefit from more substance as to what new innovations that could be produced as a result of funding approval, market research on how analytics platforms improve ecosystem experiences, and an indication of greater enrichment of the Cardano ecosystem. Projects that are already up and running can sometimes have an advantage in Catalyst because they’ve demonstrated that they’re capable and motivated to do what they’re doing but this proposal needs more work to demonstrate that. ", "q0r": 1, "q1": "I felt obligated to score this proposal a 1 because of a lack of substance that demonstrates capability, efficiency, and thorough pre-planning. There are little nuggets of interest in this section such as the team working on their “SaaS model to cover operating costs” that offers a level of efficiency and additional streams of income. However, the average voter will not know what this means and we are not given any details as to what is being developed here. In general, the feasibility section is filtered through the lens of the skills and experience of the development team, from which we do not get any information on other than the fact that there are 5 of them. Ideally, I would like to see the LinkedIn profiles of each individual team member and an identification of the individual roles that they serve in this project. As far as roadmapping goes, the proposal does identify more advanced utilities such as “Bubble Maps, Portfolio Management, Tax exporting, and much more.” In order to reasonably evaluate the feasibility of these features, voters need to know the plan for development of these features in a clear timeframe based roadmap. Lastly, if the funds are to be used for server maintenance, the feasibility needs to be measuring how likely it is that a sustainable “Saas model” could be completed in the given timeframe. Server maintenance can be ok but we need to know how the funds are going to be used to encourage greater advancement that will make things in the Cardano ecosystem better than they are now. ", "q1r": 1, "q2": "Due to the lack of concrete actions and innovations from the previous sections, it reasonably follows that this section would also receive a one star ranking. Based on what the platform has accomplished so far, I could see progress metrics being measured in website traffic and number of wallets connected to the site. Given the indicated shortage of funding, there might also be some beneficial metrics on advertising goals, client onboarding, and income stream targets. I think the previous sections put some restrictions on the capability here, so I would recommend first focusing on the above. ", "q2r": 1, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We are asking the Cardano community for their vote to fund Jungle's operating costs for 6 months. This will allow us to sustain our API offering and will help us grow.", "experience": "A lot of new investors from other chains require state of the art analytics tools to make better NFT purchasing decisions and the Cardano ecosystem at the moment is lacking advanced utilities, we are looking to change that to attract bigger investors to the space."}