{"id": 419464, "author": "quest.zwerg", "title": "AdaQuest Brand Awareness campaign", "url": "https://cardano.ideascale.com/a/dtd/419464-48088", "category": 26595, "amount": 35000, "description": "AdaQuest needs more public awareness!\nWe create teasers, trailers, cooperate with media partners, influencers, DEXes & advertisers to spread the word!\n\nWithout using our development budget for it -\n", "f6_no_assessments": 5, "f6_rating": 4.6000000000000005, "videos": [], "media": [], "f6_assessments": [{"id": 2085, "q0": "This proposal aims to increase AdaQuest brand awareness by creating trailers, and collaborating with media partners, influencers, DEXs, and advertisers to spread the word and spread the information! AdaQuest is a game project that combines three different game stages into one Total Virtual World Game Experience. It has received funding from Fund 5 and Fund 8 totaling $196,000. The proponent also provides some links so that we can better understand AdaQuest, so we can know the progress of this project. And this time, the team continues to come back to find funding with the main purpose of attracting the attention of the community by marketing AdaQuest. This is necessary for a game project, this marketing campaign and the strategy of adding more content is always a good way to generate revenue and awareness in a project, through which it will bring Cardano gets closer to the masses.\nIn addition, the team predicts the challenges/risks that they may face when conducting the project, and they also provide solutions/mitigation, helping us understand more about the project and increasing trust from readers. that the proposal will be successfully implemented.", "q0r": 5, "q1": "The author provides detailed information for us to evaluate the feasibility of the proposal, including team information, a detailed plan, budget allocation, and challenges/risks related to the success of the project. judgment. Regarding the roadmap, the proposal provides a clear, easy-to-understand plan that allows us to see what needs to be done for each month in chronological order over 5 months.\nAbout the group of people who make up the project, the information provided is very detailed, we have their name, professional specialization, several years of experience, their role in the project, skills, and experience Regarding the project, we also see LinkedIn links to get more information about them. And finally, in terms of budget, the project asked for $35,000 and they were broken down into very reasonable categories, we could understand what it would be used for.", "q1r": 5, "q2": "This recommendation is provided in a good level of information, including roadmaps, milestones, time horizons, and KPIs, making it easy for us to understand what will be measured or regulated. The mentioned KPIs can help check the progress of the project\n-New user account after running the campaign\n-Budget spending vs revenue benchmark\n-Site Hits, Impressions & Page Views (as well as YT, Twitter, etc.)\n-NFT Sales tracking\nThe success part of the proposal explains it very well so that we understand the expected results, giving us a vision of the project. The team also explains that the progress of the project will be uploaded on tools like Jira, Confluence, and game-related channels, so it will be easy to follow this project publicly.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4473, "q0": "I have followed ada-quest over the last funds and consider this a very good example of how Project Catalyst can be used successfully to fund different aspects of a large and ambitious project by taking small, measured steps. From the original \"The Quest for ADA\" foundations in Fund-5, a fully fledged role playing experienced has emerged that makes good use of cNFTs by combining in game drops with sales and trading, and even a token and stake pool. Their lightpaper called \"goblinpaper\" is a highly recommended read for anyone interested in the successful combination of gaming and web3 at the current stage we are at. This project has the potential to both contribute to the evolution of blockchain gaming as a whole, in whatever modest way, and boosting Cardano's role in blockchain gaming where we can show off the advantages and unique features of our blockchain, such as low fees, vibrant community and ada staking, and DripDropz' ease of token distribution, to name a few.\nThis proposal now asks for funding for marketing (\"brand awareness\") specifically, to be kept separate from the development budget and other features the team is working on. This includes 3 conferences, 2 teasers and several other social campaigns such as youtube, twitter, reddit etc. \nIt is not enough to build great dApps or games, you also need to make the world aware of it to boost adoption and great the buzz to keep the project going - who knows what it might develop into one day. Therefore, I strongly agree that this funding request is fully in line with the challenge brief to create real world use cases and growth for Cardano. Marketing is surely a big part of that too.", "q0r": 5, "q1": "Unlike some other previously funded proposals or new projects with good websites, Ada Quest goes \"all in\" on the Catalyst proposal form and provides the assessor and voter with a very detailed business plan, milestones, roadmap and strategic plans this project is a part of. In my opinion this goes a long way to showcase the care and dedication of the development team, and does indeed provide some very detailed and nicely formatted answers to the form's questions.\nThe success of the project so far and impressive background in gaming of the team lead are well complemented by careful consideration of challenges and risks.\nThis mentioned strength of the project presentation combined with existing Youtube footage, lightpaper, whitepaper and social media presence suggest that the AdaQuest team would be able to deliver a highly successful marketing campaign.", "q1r": 5, "q2": "The community is able to communicate with AdaQuest on Twitter and Discord, which goes a long way in checking in on their progress of the previously funded proposals and will also serve the audit of this project well. Some more data on the evaluation of the marketing campaign specifically could have been presented in this section, but the details of the data in the business plan (timeline, budget and milestones) serve this purpose sufficiently already. It is worth noting that the team is very transparent about all previously funded proposals and the future development along a long-term roadmap. This is an excellent example of how the Catalyst and funded proposers should work together, and I hope that this is the future of \"venture\" financing by the crowd (i.e. us).", "q2r": 4, "assessor": "z_assessor_2554", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10104, "q0": "AdaQuest is funded from Fund 5 and uses NFTs as a payment method, this game platform is coming to completion but however we need more budgets to spend on Marketing for the game to be accessible to potential users. At the same time, we can attract a large number of people to participate in Cardano.\nConventional marketing methods are very expensive and not necessarily highly effective, some newer marketing methods are suggested and can be even more cost-effective.\nThis proposal fulfills Cardano's goal of Making Cardano an open source project and attracts more developers, and also meets the Fund 9 challenge on Dapps, Products & Integrations\nThe proposal will attract game enthusiasts and this user base will not be limited to any country, showing that the user base will be worldwide.\nThis proposal would create attractive marketing programs to popularize a game in development that uses NFT as the payment method. This will add value to the Cardano ecosystem as it attracts more users with huge ADA trading potential.", "q0r": 5, "q1": "The solution given here is to find more effective, quality and cost-effective marketing channels such as gaming podcast channels, Youtube, Reddit and gaming blogs, small PR campaigns, conferences Devcom, the gaming festival...\nI think this is an effective and highly effective marketing communication channel for the project. Not only bringing the project more and more popular to the gaming community, but also helping the number of users to know about Cardano and participate in Cardano will increase significantly. Although AdaQuest has also been built for a while and will continue to improve, of course we still need to have useful marketing channels to bring Adaquest to the community more, this is an indispensable step when we just released a new product and need the community's support\nProducts here are specifically videos, podcasts and other promotional campaigns. Although I have not mentioned the released advertising content, I believe that with a team of project members who have a lot of experience and especially under the guidance of Mr. Marcin, an experienced expert in sales and marketing with more than 10 years of experience, the project will succeed.\nMarketing products will be accessible to users directly and indirectly, which will help users to fully and popularize AdaQuest as well as attract them to participate in Adaquest and Cardano\nThe proponent also gave the risks that are easy to encounter and the mitigation plan very quickly and effectively. By meeting the team weekly and regularly exchanging, timely monitoring and updating, we will have the timely information and the best solution, along with the team's long experience, I believe that the risks can be minimized\nThe product of the proposal will reach potential users who are passionate about the Game and ready to participate in the Game, use NFT as well as participate in Cardano.", "q1r": 5, "q2": "The project is implemented by a team of 4 key members with extensive experience in areas such as Illustrator design, digital and application, marketing, game design, financial management experts... These are the key areas to be able to operate the proposal to success. All members have complete and methodical information on Linkedin, but I have not seen the clear information of Mr. Thomas. The proponent should provide more information about Mr. Thomas so that the community can verify, contact and make the project more transparent.\nThe budget for this Marketing project is $35,000, divided into 3 major categories corresponding to the development stages of the project. However, I find that the planned budgets are generally not transparent enough, the proponent should give a more detailed table such as the number of working hours and the labor cost, so people can better understand how is budget spent.\nThe proposal also clearly outlines a 3-phase roadmap starting from August 2022 and ending in December 2022, but it is still general in terms of implementation content in these stages, I would like to see more clearly the proposal implementation plan.\nThe proposal revenue source has not been mentioned but we can see the immediate benefit of attracting a potential number of new users to AdaQuest and willing to participate in Cardano.\nIn addition, I still want to have some specific KPIs to define success as how many people the Marketing proposal will expect to reach and how many new users will be in a certain period of time.", "q2r": 4, "assessor": "z_assessor_3153", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 15095, "q0": "- With the idea of raising AdaQuest brand awareness. The title part makes me feel like this is an interesting proposition. where raising brand awareness is said to take a lot of time, resources and money. then the fact that the team will create trailers of how-to videos that are widely advertised in the media I think these are great initiatives. With these solutions, I believe the group will solve the difficulties. In addition, the team also anticipated risks such as choosing the wrong communication channel or a malicious NFT gaming environment. however all of the above risks have been very well managed by the team and I have no further comments.", "q0r": 4, "q1": "- The team has also determined a detailed time frame that will complete the project within a period of 4 months from August 2022 to December 2022, with specific strategies and goals to be achieved. in the proposal and I think the above time is reasonable to complete the proposed work. With a budget of $35,000 and broken down for specific tasks each month, I find such expenditures reasonable. With 4 members who are all famous experts who have assigned specific tasks for each person and the identity is also easily verified, I believe the project will work well.", "q1r": 4, "q2": "- In the description of what you will measure to track project progress. There are many KPIs mentioned including 4 main KPIs such as New User Account after running a campaign, or NFT Tracking Sales. I find the indicators outlined to be very convincing. In terms of project success description there have been some successes mentioned that the success of the project will help the proposed theme generate more awareness and revenue, will help the brand be more known. . I see the successes outlined above as befitting the challenge. This is a proposal that has been funded from FUND before, but the subject wants to expand its scale, so it wants to ask for more capital. I hope the proposal will be successful soon", "q2r": 4, "assessor": "z_assessor_2615", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15394, "q0": "AdaQuest is already a well known project (game) that we have seen develop over recent Funds. In this case proposal is concentrated on marketing part of the project (game) and how to raise brand awareness inside but specially outside of Cardano community. Idea is to create two different teasers and to spread to awareness over social media (YouTube, Instagram, Twitter, podcasts, Reddit and gaming blogs, etc.). By spreading awareness it would also hopefully increase number of players (users) which would benefit the Cardano ecosystem. \nSince this project is in good hands and the development is constant and can be easily tracked I don't see any issue with this proposal. The game has a high ceiling, is developed by a good and organized team, sustainability of the project is clear. All links related to the game are available, so anyone how is first time seeing AdaQuest can easily catch-up on the history and development of the project. ", "q0r": 5, "q1": "As mentioned, team behind the project (Red Potion Studios) is well known to the Cardano community and they have been constant contributors since Fund 5. For this particular project they will allocate 3 team members, for two of them small bio and LinkedIn links are available, for the third member (Thomas) the link to some social media is missing but there is small bio available so I wouldn't take that as an issue. They mention that they hire only people they met in real life and with whom they have good rapport. \nBudget is divided in 3 stages (August, September-October, November-December) and for my opinion misses a little bit more information how this money will be allocated. I know it is just an estimation but maybe breakdown of for example 17.000$ for August in groups and not 3 bullet points could be helpful. But I wouldn't consider this as a big problem. Additionally the plan is to start in August and this Fund will end somewhere close to September so maybe the plan should be shifted for one month?\nPlan is divided in same pattern as budget, in 3 stages that finish in December. Plan is simple and includes participating in Devcom and Gamescon, although the plan is simple it is to the point and I see no issue here. For risks as the proposer mentions it is the possibility to choose the wrong platform to advertise and overspending but I have confidence that team will choose the right approach and that it will gain more followers that will turn into users by the time of the game release", "q1r": 4, "q2": "The team already has weekly team meetings where they discuss next steps in development.  The overall progress of the game can easily be monitored on social media so I would expect nothing different from this proposal. As mentioned you can follow the progress on social media (Twitter, YouTube), and they provided links in the proposal, I recommend to anybody to go check out the progress of the game to get the feel of the AdaQuest project. \nThe progress of this awareness proposal would be monitored by increase of followers, new user accounts, website visits (YouTube, Twitter, etc.) and NFT sales. All this will be monitored in detail once the campaign starts, so it would be easy to see if there is a spike of interest which would correlate to proper awareness campaign. For this they will use tools (not mentioned which tools) to benchmark and track all the awareness actions they will kick-off. I would consider this as clear and easy to monitor KPIs. For the roadmap, as mentioned it is simple, but to the point as this is quite straightforward proposal and I see no issues with it. ", "q2r": 5, "assessor": "z_assessor_2752", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Let´s face it! Brand awareness campaigns cost a lot of time, resources, and money. We will create a feasible plan that will use the entire budget of this proposal to boost AdaQuest's attention level.", "experience": "Founder: Marcin worked in marketing, sales, and biz dev for THQ, Ubisoft, CI Games, Daedalic, and Rockstar. He has helped start-ups in their initial phase, and provides guidance for the Cardano gaming community, as well! >10 years exp.\nLinkedIn: https://tinyurl.com/yc74rm4p"}