{"id": 419676, "author": "projectnewm", "title": "projectNEWM Marketplace Creation", "url": "https://cardano.ideascale.com/a/dtd/419676-48088", "category": 26595, "amount": 150000, "description": "The Cardano Ecosystem is missing out on real world asset tokenized marketplace - especially for music IP rights.", "f6_no_assessments": 5, "f6_rating": 3.7333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 2513, "q0": "The project is addressing a major problem in the music industry. In the traditional system of production and distribution of music, the major part of revenue is controlled by big music Record lebels like Universal Music publishing Group and Sony Music Entertainment to name a few. It is often said that actual creaters of the music like singers, music composers or lyricists hardly make any money from selling their art to these lables and most of their income comes from the shows and different Tours they do along with different endorsement deals. \n\nThe Distributed Ledger Technology or the Blockchain as we call it, has really given the power to these artists to produce and distribute their art to masses without having to rely on these big brands and in return paying big part of revenue to them. \n\nThe project is trying to create a market place for Fungible and Non fungible tokens related to Music IP rights where an artist can sell his music to the people using Blockchain technology and retaining the large part of the revenue. But at the same time they can also sell the underlying Intellectual Property rights belonging to that piece of music to someone to mass produce it. This creates a market where not only artists can get due rewards for their art but it also gives a unique opportunity to the investors to invest in a particular artist by buying the IP rights to their art and get benefitted by the success of that artist.  For investors, it will be similar to investing in a startup in the early stage and then getting benefitted immensely once it becomes successful. This perfectly aligns with the objectives of the Challenge and, if successful, will help in adoption of Cardano Ecosystem. \n\nThe main concern here is the legal backing to these types of trades happening on the Blockchain. Without the absence of any laws legalizing such transfers of IP rights, it will be difficult to popularize such a platform. Another area of concern would be if the person holding the NFT representing such a IP rights gets scammed and it is get stolen,  how would you resolve the legal complication in such a scenario. We have already seen such type of scenarios playing out where a TV shows based on a BAYC Ape got cancled just because NFT got stolen. In absence of any legal backing, it might be used by some people for speculative purposes but these will be the same people who are already using Cardano and might not bring many new people to the ecosystem. \n\nI genuinely feel that this market place idea is quite good but until their are clear laws enacted by legislatures concerning tranfer of IP rights by way of digital asset, we might not be able to see mainstream adoption.", "q0r": 4, "q1": "Implementation of the proposal seems pretty reasonable to accomplish as it involves creating a simple smartcontract which will be used to exchange FTs and NFTs in a trustless manner. My concern though is the timelines provided for completing the project which are somewhat vague as they are devided into 1st month, 2nd month and 3rd month tasks without mentioning clearly if the proposal can be completed in Q3-Q4 of 2022 or they are talking about Q1 of 2023. I would recommend them, in case, they are not able to secure funding in this round, to next time mention the timings of each task with exact time of the year they expect the project to complete.\n\nOn the budget front, the amount requested is reasonable and a precise breakup is provided about the funds needed for each step/task. From the breakup it is also clear that the funds required to complete this stage are around $200K, and other then requesting 150K from the Catalyst, rest of the funds will be invested by the team themselves. From my personal experience and having discussion with them on Discord, I know that they are also running a stakepool and hence arranging funds for completion, other then Catalyst funds, won't be much difficult.", "q1r": 3, "q2": "The Auditability is somewhat concerning for me and there are some factors which has resulted in these concerns.\n\nThe first factor is the team members which are required to work on the project. In the proposal, they have mentioned that the details of the people who will be working on the project are mentioned on their website. By looking at their website, we come to know that there are more than 30 people in the team. So understanding the role of different team members required to complete this particular project along with knowing if they possess the right kind of skills, is difficult. Moreover in order to measure the success of the project, they have mentioned only two vague milestones like implementation of the testnet and then mainnet. I don't think mentioning these two things anyway helps in auditing the milestone completed by the team.\n\nTo address the first concern, I would recommend that specific team members required for this particular project, both number and names, should be mentioned in the proposal itself along with the skills they possess. This will help in matching the skills required by the project with that of the team members and if any additional member will be required to be recruited to fill any gap.\nOn the front of milestones, I would say as it is highly technical task, they should clearly mention when they can have the MVP code ready and how much time will it take to complete the audit.  Also how long they are planning to run the testnet and fixing any bugs reported. \n\nIn the end, I would like to say that this is very good idea but we need some legal clarity before we can think of mass adoption in this regard. Also they need to make the proposal more comprehensive and provide some Essential details. I wish them all the best.", "q2r": 3, "assessor": "z_assessor_2312", "no_vca": 4, "ne": 4, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 4197, "q0": "The \"ProjectNEWM Marketplace creation\" proposal addresses the challenge Dapps, Products & Integrations by building an integrated marketplace (trading & swapping of fungible and non-fungible token) - Music IP rights in this case. NEWM is a decentralized music ecosystem that is not just a music streaming service but with all things music. It allows musicians to earn their livings fairly without being taken the cut significantly. The musicians can retain their music ownership and not sign them away to the big record labels - think Spotify and Apple music but with the blockchain elevation. It will democratize music market and lead to Cardano adoption worldwide if implemented successfully. NEWM is comprised of music streaming, marketplace and wallet components. It is also an open source project and hence align with Cardano's strategic goal. The team knows that they might need more funding and plans to cover that with their reserve. ", "q0r": 5, "q1": "The team is comprised of music industry people and blockchain technologists, who love music and passionate to evolve music industry using the blockchains. They have right skill sets (music & blockchain) to bring this project to a success. The budget breakdown provide info about their pay rate and number of working hours. When taken into account all costs they list in the budget section, the total figure comes to $192,500 but they request $150,000 (the difference of $42,500 will be covered by their reserve). The project will take around 3 months for the system architecture, design and MVP deliverables. The team could elaborate more on their activities in each month. Given sensible budget, sufficient timeline and strong team members, it is likely that this project will be carried out successfully.", "q1r": 5, "q2": "The project progress can be tracked on GitHub commits and bi-weekly KPI updates. They view project success as having successful Testnet implementation and deployment to the mainnet. The proposal will improve if they outline what they plan to achieve in each month and provide target figures in their system architecture, design or MVP deliverables. Also they should track number of users and transactions occurred in the platform. This will help the community to monitor that this project can gain traction and is on track to complete successfully. The information provided is sufficient for the auditability purpose. The team understands what is needed for their platform to be financially sustainable and that is the marketplace (DeFi + music) which could potentially evolve to the music ecosystem in the future. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 7797, "q0": "The idea of this proposal solves the problem of creating a market for digital music products, matching the challenge. The solution to the given problem is to build a good backend and have a user-friendly UI / UX system. However, the presentation of the idea is not specific. The community needs to read the project's Whitepaper to find out more information. By developing a marketplace for music on the Cardano platform, the project actively contributes to promoting the image of the Cardano platform to the world. A successful project can impact the entire music industry market, which is worth trillions of dollars. The scalability of the project is very large for similar content on the blockchain platform in general and Cardano in particular.", "q0r": 4, "q1": "The ProjectNEWM project already has a large, experienced team of experts in finance, legal, design, marketing, community development, and musicians. Information about their expertise and experience is suitable for project implementation. With such a strong human resource, the project implementation is completely feasible. However, the information about who is involved in the specific project in this proposal is not clearly presented. The ProjectNEWM have submitted 6 proposals in Fund 9 but did not specify how to allocate resources to work. The ProjectNEWM has been implemented, creating a certain resonance in the Cardano community. If it is funded, it is likely to develop faster and stronger. Regarding the marketing strategy for the project, although it has a full staff, suitable experience, and adequate communication channels, the project does not mention the marketing strategy. The implementation plan of the project is also sketchy. The project has not mentioned a number of risks and challenges such as competing with competitors on traditional platforms or similar models on other blockchain platforms.", "q1r": 4, "q2": "The detailed plan and the timeline presented are unclear and confusing. It is very difficult for the community to understand what the goals need to be achieved, what products need to be completed at each milestone. We can only check the development progress by going to the github channel and reading their reports weekly, but it is difficult to verify. In addition, the proposal has not yet provided KPIs to measure the development of the project. KPIs such as the number of users, trading volume on the exchange, and the total value of assets on the exchange should be provided by the proposer. The project is expected to cost a relatively large amount of $192,500 and apply for a Catalyst fund of $150,000, but the cost is not explained properly and in detail. They define the success of this project as running the testnet and mainnet successfully. It is not clear for the community. It should be more quantifiable such as the number of transactions and the volume of transactions on the marketplace.", "q2r": 3, "assessor": "z_assessor_2922", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9791, "q0": "This is a marketplace development project that focuses on exchanging music products, thereby stimulating the participation of the majority of the community, which is exactly what this Challenge is aiming for. So in my opinion, this is a fairly potential project and if successful, it will attract a lot of people to Cardano, even celebrities. Because the exchange of digital products not only benefits users but also helps bring digital music products of singers, artists, and content creators to one more platform to get closer to listeners. And the participation of celebrities or the appearance of quality products will surely make this Marketplace much more crowded and attractive. Because this project was written with little information and was sketchy, I had to find out in the Clip as well as the Whitepaper of this project which was quite difficult. But at least it's still a project worth paying attention to. The fact that the team cares and gives a way to solve problems on the backend and UI UX is also a plus because it determines the success of the project. It is clear that in order to attract mass users with an artistic background, the project needs to pay special attention to the aesthetics as well as the user experience of this product. The success of this project will greatly contribute to bringing the position of Cardano as well as blockchain to a new level, receiving strong support from the world's music fans.", "q0r": 5, "q1": "The good thing about this project is that the project has been initially implemented, which has somehow attracted the attention and interest of the Cardano community. Looking back at the implementers, it can be seen that this is a large project with rather massive human resources, they almost all have their own strengths in specific areas, both musical expertise, relationships, and expertise. majoring in finance, technology, marketing UI UX, this helps us somewhat believe that the product they create will be relatively complete. But looking at the proposal is quite sketchy, I am also quite worried about their combination in all arrays. With products that are highly artistic and may have to approach more demanding customers, the neatness and perfection of the product are very important. The presenter seems to be aware of this as well. Actually, now with the popularity of Spotify and other platforms, it is relatively easy to exchange and enjoy music products. The project needs more than just differentiation to attract new users outside of Cardano, not just within the community. For example, the exclusive signing of new authors, songs, and artists for digital music products. Even so, I still believe this is a project with great potential to be possible, but to what extent is still a question.", "q1r": 4, "q2": "The project can be checked for quality as well as KPI by looking at the weekly reports but I personally think the timelines and KPIs as well as the costs should be presented more clearly and the project should be more refined to be correct. with the potential of the project. This is not too difficult, we can set KPIs according to the number of participants, the number of products, the number of transactions, the volume of transactions. This will make it easier for people to monitor and evaluate the success of the project.", "q2r": 4, "assessor": "z_assessor_3096", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 11250, "q0": "This proposal does address the challenge as there is going to be a product \"marketplace\" as the end goal. The team is trying to create an integrated marketplace for both fungible and non-fungible tokens. In addition to that, the team said it would be an open-source marketplace with all relevant documentation for the community. However, that is all to it. There is no other information or insights. This proposal does not cover enough content as it should. What they are trying to achieve is not a simple task yet they have just provided extremely limited information in their proposal, while asking for 150000 funds. ", "q0r": 4, "q1": "The team has given barebone information in said proposal and this has me worried. They are asking for a huge fund but at the same time, the information given is very limited. The team has not mentioned how many people will be involved. All we know is that Andrew Westberg leads that team, their team has over 60 years of experience cumulatively. However, we do not know the number of individuals in said team without clicking on their website. This is an issue as the accumulative number may have been pushed up because of the large number of teams, while they might not be fully equipped to complete the task they have set to. This proposal is unfinished in my opinion as a lot more information is needed to give me the assurance in regards to them successfully implementing what they set out to do. ", "q1r": 1, "q2": "Through GitHub Commits and bi-weekly KPI updates the general public can track the progress of the proposal, however, I believe the team should provide more updates as not everyone checks those stats. I would suggest they utilize social media to give out some announcements or milestones, with this approach their information will reach a wider audience in the Cardano Ecosystem. To assess the success of the proposal the team has said through the successful Testnet implementation followed by successful deployment to mainnet. I personally feel like it is only successful when a) there is a successful launch and b) a prominent product that is completed with simple UI and demand from the people of the Cardano Space to utilize what they have built. \n", "q2r": 3, "assessor": "z_assessor_3233", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "We will build an integrated marketplace that will facilitate the trading and swapping of fungible and non-fungible tokens to enable a realfi solution of tradable IP rights on the blockchain.", "experience": "Andrew Westberg (Creator of Phyrhose, JorManager, PoolPerks, etc) leads our dev team with over 60 cumulative years of professional experience. Our legal team has over 25 years of legal experience."}