{"id": 419660, "author": "jshy", "title": "Anti-Phishing Chrome Extension", "url": "https://cardano.ideascale.com/a/dtd/419660-48088", "category": 26595, "amount": 50000, "description": "Just like every other blockchain community, the Cardano community is plagued with numerous scammers constantly looking to exploit innocent members of the community for their ADA or assets.", "f6_no_assessments": 9, "f6_rating": 4.037037037037037, "videos": [], "media": [], "f6_assessments": [{"id": 1695, "q0": "In terms of impact, the proposal is extremely relevant. The problem pointed out here is simple, but very harmful to the health of our community and the general growth of the Cardano ecosystem: the existence of scammers who seek to exploit honest members of our community by stealing their ADA or CNFTs. The SecurityBot group will “create a free Chrome extension to automatically detect and alert users visiting suspicious websites using Cardano as a decentralized database to store insecure domains for the public good.” This will prevent malicious members from pushing worthy and experienced members away from our community. However, one point that I was in doubt when reading what would be done here: how would the criteria be selected on what would be considered a suspicious site? I think this is a very important part of understanding the core of the proposal. The proponents, at one point in the explanations, state that “in future steps (not contemplated in this proposal), we will decentralize this process, to maintain Cardano values ​​and guarantee the safety and integrity of the process. We plan to create a DAO to allow the community to vote on safe and dangerous links, decentralizing the entire process.” This is an excellent idea as it would make this decision more democratic and better distributed across the members of our ecosystem. But in relation to the now - how would that be defined? It would be beneficial if we had a better understanding of this part of the proposal. Another very positive point is that the group is already well experienced in carrying out this activity to combat hackers, as you can briefly summarize. They claim that the bot has already been used in 85 NFT communities - a suggestion for us to have a better understanding of the impact would be for him to bring some more tangible examples here. What communities would these be? How they benefited and grew better with the help of this project. It's also positive how they specify what steps to take (create a Chrome extension that compares a database of known safe domains with the website currently visited and notify the user if the current domain is too similar to a secure domain + create all phishing links found in a policy ID on the blockchain to ensure that the whole community can benefit from this tool); with that we were able to understand well what would be done and in what order. However, another part of the proposal that caused me some doubt was in relation to the tests and iterations that would be made in the algorithm, to define which sites would be malicious. It was also not very clear to me what “phishing” would be, this is mentioned several times in the detailing of the impact of the proposal, but at no time is it conceptualized - I believe it would be beneficial if the proposers had attached this definition, so that our degree of understanding as a whole was better guaranteed. Finally, the most exact concepts that I believe would be addressed here would be ““Creation or improvement of different Dapps, products, and integrations that provide value to the Cardano community and wider ecosystem + Integrations with other existing services, products, and protocols that improve the end-user experience whether that's giving the user more options or making something easier to use that benefits the wider ecosystem”. I say this because at the same time a new integration would be created, which would be the bot, it would work with things that already exist (sites and users of our ecosystem), so both objectives would somehow be well covered. So I think the proposal fits well with the objectives of the challenge, just a few details could be clearer so that we have a better overall understanding.", "q0r": 4, "q1": "Unfortunately the script is not accurate and is not in the right way, I say this because, first of all, there is no notion of temporality here. We don't know how long each of the phases - research, testing and public access - would take. Probably the project would not take that long to develop, since the proponents have already executed something similar before, several times. Even so, it would be important for our community to have this understanding of not only what would be done, but also how it would be done. Each of the phases could have their actions a little more detailed; in the first phase, how would phishing sites be selected? How would the modification and implementation of the algorithm be carried out, what would the work routine of the professional who would be responsible for this be like? In the second phase, how would some community members be invited to test the tool and how would the experiences be analyzed, so that the product could adapt as the feedback was received? How would the tool be officially launched, how would the marketing campaign be carried out, which is so important for the proposal to achieve its objectives (since our focus here is, directly, to benefit the members of our community). Regarding the costs of the proposal, the asking amount is explained ok, we know how the total amount would be divided, but it is not possible for us to understand these parts so well, even if there is a little explanation, some understandings are still pending. For example, 10 thousand dollars are requested for the development of blockchain, it is a value that depending on the time that the professional will dedicate to it can be fair or not. If it is a working month, for example, the value is very high, but if it is a longer time, such as 3 months, the monthly salary has already been made more compatible with the market. What would the marketing campaign look like, what strategies would be adopted here, and why would it cost $12,500, an even higher amount than what is reserved for blockchain development? Why would the research cost $5,000, how much time would be devoted to this part of the proposal? And finally, speaking about the team, very little is said about the professionals involved, even though they are already qualified due to their experience, it would be necessary for us to know more about their trajectories. In addition to developing the SecurityBot tool, would they have any experience specifically with Cardano? It would be necessary to report more examples about projects that have involved until today, a good option would be to attach your linkedin profiles, in addition to twitter. I'm also in doubt about the other people who would work on this project, for sure we would have to have at least one more member on this team, who would be responsible for the marketing part - who would that person be? Ideally, all team members and people who participate in the project, even if only in some phases, should be introduced. We would need to know their names, resumes, linkedin profiles, connections with Cardano and so on. So some points are positive in feasibility, but overall there is still a lot to improve as well.", "q1r": 3, "q2": "Proponents suggest some ways we can audit progress, but they are all geared towards partial results: number of users using the tool, number of dangerous sites identified; and also incorrectly identified sites and the diversification of the public that uses the tool (which would indicate a success in the marketing campaign). In fact, these metrics are important and necessary, but in addition to them, it would be beneficial if we could follow the development process of the tasks, the work routines of the professionals involved. How can we ascertain whether the phases were being carried out as planned? The first thing that needed to be improved is, in my view, the issue of temporality in the script: understanding when each phase starts and ends, how long is expected for each thing to happen and so on. Afterwards, a greater detail of the respective activities would be quite beneficial so that we would have more accurate material to audit. Finally, it would be necessary for one of the two professionals involved in the creation of the tool to maintain communication with our community in order to explain what would have been advanced in the month, both about work routines and partial successes/results. The proponents do not point out, at any point in the proposal, which would be the channel of communication with the community: telegram, discord, some online platform such as miro/notion/dropbox… Where would this information be passed on? Finally, talking about the success scenario, it is said that “the success of this project would be to protect a large number of community members from dangerous websites. Users will feel safer browsing the web3 in general and specific Cardano websites”. But how can this be more accurately perceived in practice? I would like this information to be more accessible. A survey with users would be appropriate here, to collect feedback on how this proposal would have been useful for them in real life, if fraud cases actually decreased, if malicious agents (websites or people) were properly removed; how this idea contributed to the further growth of Cardano, so that more people could be part of the community in a safe and healthy way, and with that more projects are created, the number of NFTs in our network is increased, as well as the creation of smart contracts, purchase, circulation and delegation of Ada, and etc? How can we realize the real benefits of the bot for Cardano? So, there is the suggestion that this research be carried out - which in my view would be more qualitative than quantitative - and that this information reach Cardano members clearly. So I think that this topic, as well as that of feasibility, still needs further delving and considerable improvement.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 4051, "q0": "The idea of this proposal is to create a free chrome extension to automatically detect and alert users of suspicious websites. To do that the extension will use Cardano as a decentralized database to store unsafe domains for public good. It is a solution to a very real and present problem. Moreover, the proposed solution not only will increase the number of products available for the community but also will attract new users due to the sensation of security spread. The metrics described in the proposal focus on total users and number of dangerous websites caught. These strongly align with the campaign as they measure the attraction of new users and the efficiency and quality of the dApp created. Besides that, the proposers have also discussed next steps of the proposal that will allow it to scale seamlessly. The idea here is to conceive a DAO to decentralize the process.", "q0r": 5, "q1": "The two developers have a lot of experience in the subject focused on this proposal. Evidence of that is the SecurityBot they have built which is a scam prevention Discord bot. Unfortunately, they have not provided LinkedIn links or any equivalents, just twitter accounts and the big projects they have constructed, SecurityBot and CNFTJungle (don't get me wrong, I do believe these projects should have a heavy weight in the feasibility assessment, but it's always good to see a description of the proposers' academic background and past work experiences - this is coming from someone who has been a CA (now PA) for the past four fundings and also prepares performance assessments in the work environment). The budget is a bit overpriced, especially because they have not stated how much time they estimate it will be needed to complete the developments. On the other hand, they have clearly identified where each part of the resources will be allocated. It is worth emphasizing the team has not provided a timeline for the project, which is a serious fault. Furthermore, the proposers have adequately considered the risk of not identifying false positives or false negatives. Unfortunately, this risk can never be eliminated but as they said abundant and rigorous testing can help mitigate it. To sum things up, I wish I could give them a better grade on feasibility but due to the points mentioned previously and to maintain consistency with the other proposals assessed my grade in this topic will be 3.", "q1r": 3, "q2": "The roadmap provided is divided into four phases and the milestones for each of them were implicitly defined by the proposer. Instead, they could have explicitly stated them for greater clarity. For example, for phase three they could define the collection of thirty feedbacks and the enhancement of the product based on the top five feedbacks selected as a milestone.  The time horizons, however, were not provided in any moment, which hinders the auditability of the proposal. The main two KPIs chosen were total users and number of dangerous websites caught. These are powerful metrics and they allow to measure if the plan is a success according to the campaign point of view. Finally, even though they have presented discord and twitter links they have never mentioned in the proposal if they would contribute with regular updates on a public channel so the community stays up-to-date with the project's progress.", "q2r": 3, "assessor": "z_assessor_2513", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4675, "q0": "This is at very least a promising idea, something that fills a crucial niche in developing better security on Cardano with a tool that users can take advantage of. It fits the challenge, and could be further integrated into other tools if successful.\n\nThere is some room for improvement. A stronger case could be made here for the record the team puts forward if we could see a little bit more of the meaty data behind their claim. Their discord bot has \"prevented thousands of scammers from stealing ADA from legitimate community members\"? Great! But how do you know this? Thousands is a pretty big number. A link to some figures, or even just some detail, would help raise confidence in the team, their experience, and how much we can trust that this new endeavor will be effective.", "q0r": 4, "q1": "The feasability portion of this proposal is arguably only partly completed. The proposers present a series of milestone with no timeline. The proposers present a budget with line-items and no breakdown for why each amount is paired with each initiative. ($12500 for Marketing when the final milestone in the roadmap is public access, rather than wide adoptation makes little sense.)\n\nThe two developers involved here are anonymous, which means a greater demonstration of their experience and chops for development would help their case. Githubs!", "q1r": 3, "q2": "This is another section that seems only partly complete. The proposers' metrics are users and malicious sites caught, and that's fine. But do they have goals, in terms of timeline or number? That would help auditors a lot. \n\nThe goals set by this proposal are just too fuzzy. \"Success for this project would be protecting a large number of community members from dangerous websites.\" What's a \"large number\" here? How will this be tallied? Please give us a little more meat on this skeleton.\n\nNice robot mascot though.", "q2r": 3, "assessor": "z_assessor_2585", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5636, "q0": "Phishing sites are on the rise in general in blockchain communities and Cardano. This proposal addresses the rising security difficulties by building a Chrome extension that will prevent users from scams. The added gain is the info is put on the blockchain so the entire Cardano community can benefit.\n\nThe goals of this proposal align with the challenge settings because more and more people interact with the Cardano blockchain. Accompanying that is the fact that safety has become an even more urgent issue recently(ADA was the third most phished crypto project in the last 90 days according to finbold.com)\n\nThe future prospect of this project is clear. The proposal will be finished presumably after 4 months and the scam prevention will continue indefinitely as long as the Cardano users keep giving back accurate feedback and experience. As no more funding is required past that point to keep the project running that shows the quality of an efficient proposal. It is almost self-sufficient in the sense that the general public will keep on improving their own experience through feedback.\n", "q0r": 5, "q1": "The timeline presented in this project is sensible in the big picture and the task sequence is logically presented.  The budget is unambiguous, broken down into fitting categories and the total cost seems fair for this project. To add constructive criticism: since this project is being worked on a two-people team, it would be reassuring for the voter to see an added breakdown of the pay rates for each funding category. As for the planned timeline, it is sensible, but who is working on what task at what point? \n\nThe responsible work team has proven themselves as they are experienced in the area of scam prevention(as seen with the SecurityBot) and have been cooperating with the Cardano community beforehand. \n\nThe possible risks of creating the Chrome extension are outlined. For example, the bulk of the tool maintenance problems is solved by frequent site testing and assessing and implementing based on user feedback. Legitimate and phishing websites will be distinguished by this method.\n", "q1r": 4, "q2": "This proposal addresses the Cardano community's timely problem with phishing. The solution will resolve it by creating an algorithm that is then being improved by community utilization, reaction, and feedback.\nThe development phases have no clear time milestones. That being said the project will be finished in 3-4 months as specified by the proposer.\n\nAuditable metrics consider total usage numbers, and phishing websites detected. If the extension works for the appropriate websites more people will use it. Growing user numbers will make success fairly easy to pinpoint. These statistics will be available when the app is finished. Meanwhile, the proposer has not mentioned how the voters can track the progress of this project. A public channel would provide some reassurance.\n", "q2r": 4, "assessor": "z_assessor_2730", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5897, "q0": "This is a very useful proposal. Currently, along with the development of the community, the number of scams is also increasing rapidly. Scammers take advantage of other people to gain illicit profits for themselves. Something needs to be done to prevent this. Good thing this project creates a Chrome extension as a scam prevention solution. It will check the website the user is visiting and notify the user if it is a suspicious website. This tool will help improve the Cardano ecosystem by increasing safety and reliability. Phishing prevention is an essential focus not only to maintain the existing community, but also to continue to grow and expand. It is for the above reasons that I fully believe that this project will effectively tackle the challenge.", "q0r": 5, "q1": "Based on the information provided. Your team are all experts in anti-phishing. In particular, they achieved success in developing the SecurityBot Discord Bot - used in over 85 NFT communities and stopped thousands of scammers from stealing ADA from legitimate community members. With the above knowledge and experience, I think they are fully qualified to carry out this project. The team consists of 2 members, they are talented developers, their twitter profiles are also provided, which makes the above information more transparent. However, who will do the marketing and communications (I don't think any of them can, because marketing isn't in their description). If you plan to hire more people to do marketing and social media, add their information (skills, experience, profile,...).\nRoute provided. You've done a great job of identifying the things that need to be done and breaking them down into 4 stages. However, how long will this project take? I think it would be great if you clarify it further. By assigning those 4 periods to specific timelines. I have a few suggestions for you: research phase will be done within 1 month, development phase will be done within 2 months,... . Having a detailed roadmap will help the project develop in the right direction and schedule initially.\nThe budget has been provided, you have calculated the budget based on the jobs to be done. However, I think it needs to be more transparent. That will give people more confidence in the project. I also have a few suggestions that might help you: determine the number of people involved in each job, the number of hours worked, the hourly wage, and so on. Risk and how to minimize it have also been provided. This will be a solid basis for the project to develop in the long term. In addition, I also want to commend you because this proposal is aiming to be self-sufficient, without capital in the following funds, which will help optimize Catalyst's capital.", "q1r": 3, "q2": "Criteria for assessing project progress and success have been provided. However, it would be better to have specific numbers. For example: there are 100 downloads per month,... . This will make it easier for people to compare and evaluate. Besides, do you have communication channels to update project progress reports to everyone? (eg Website,...)\nFor the project to go smoothly, I think you need to clarify the issues that I mentioned. This is a very potential project, it brings great benefits to the community. If implemented successfully, it will certainly help people avoid phishing attacks, help give them a sense of security and a better experience. From there, attract them to participate in the ecosystem, helping the Cardano ecosystem to grow more and more. That's why, I will still support this project, thank you!", "q2r": 4, "assessor": "z_assessor_2757", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9625, "q0": "Phishing websites like binance-co.com or binaηce.com are difficult to distinguish for users new to blockchain investing. A lot of people have been tricked by phishing websites that have led to a negative view of the blockchain technology industry as well as Cardano. To limit this problem, the project aims to build an extension for Chrome browser to warn users when they visit websites with signs of fraud. The list of safe and unsafe domains will be stored on Cardano as a decentralized database for public good. The project will prevent scammers from stealing users' ADA, providing a positive experience for the Cardano community. Therefore, I rate 5 stars for the impact of this proposal.", "q0r": 5, "q1": "This project was carried out by a team of 2 people. JSHy is the developer of SecurityBot and Zhaata is the co-founder of CNFTJungle. Both of these people have experience working at jpg.store, a well known NFT market place in the Cardano ecosystem. Their skills and experience are needed to be able to complete this job.\n\nThe budget of the project has been divided according to each specific job. However, the proposer still needs to break it down into identifiable items to make the budget more transparent. For example, with $15,000 for full stack development, the proposer can add how many developers do this work, how many hours they spend completing the work and what is their pay rate per hour.\n\nAs for the project implementation plan, the proposal has proposed four main phases including research, development, testing and launching. Stages have key milestones that need to be achieved. However, the timeline for each stage is not mentioned.\n\nOverall, I think the team is capable enough to carry out this project, but need to add some information about the budget and implementation plan to make the proposal more complete.", "q1r": 4, "q2": "Because the proposal does not provide a specific timeline for each stage of the project, it will be difficult for the community to track the progress of the project by themself. For example, how can the community audit that the project has completed the research phase. Proposer should provide a public channel for delivering regular reports regarding project progress to the community for auditing progress.\n\nKPIs used to measure project success also need to be more detailed. For example, with 2 metrics total users and number of phishing websites caught, it is recommended to set a specific KPI for the project to be considered successful. In addition to the above metrics, the project should add 2 more criteria: the false positive rate (the website is recognized as a scam but it is not) and the true negative rate (the website is assessed as safe but actually is a scam website) to measure the accuracy of the tool.", "q2r": 3, "assessor": "z_assessor_3068", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10029, "q0": "The proposal raises security issues on the GoogleChrome platform that could face fraudulent wedsite information mining, ADA theft and other assets. The solution is to create an extension based on the Cardano platform as a decentralized database. The chrome extension is free and has a detection effect, alerting users to access suspicious wedsites. The solution is in line with the installed challenge, concerns about hackers and garbage wedsites that can steal information, loss of ADA and assets will be addressed. The Chrome extension has a big impact on users, the majority of browser users choose GoogleChrome because of its features and familiarity. We can suddenly mistakenly press or access a fake wedsite (like the address) which can lose important data such as: ADA wallet, acount, password, etc. I believe that chrome utility is a useful solution and many users. The number of users increases, the security features are enhanced, users will be assured of ADA transactions and use daedalus wallet on GoogleChrome. The Chrome utility will help remove scammers from the Cardano community to help the Cardano ecosystem grow better. The scalable solution is to create a DAO to allow the community to vote on secure and dangerous links, decentralizing the entire process very appropriately to address future challenges. The only risk presented is that it is possible that the utility will mistakenly warn with safety wedsite, repeated testing using algorithms is appropriate to minimize the risk.\nI rated: 5\n", "q0r": 5, "q1": "The plan for implementing the proposal is divided into 4 specific stages with the work to be done in accordance with the solution given. Research stage: modification, implementation of algorithms detecting fraudulent weds, development stage: writing Chrome extension codes, testing stage and reaching the stage of public access for users. The stages are carried out in a logical sequence that is feasible. We want the author to have timelines for the implementation of the stages of the plan, it is necessary to determine the time period of completion of the Chrome utility. The implementation team is capable of making suggestions, has the capabilities and experience, information about the two team members is fully demonstrated on Twitter. The recommended amount of $50,000 less than 10% of the F9 challenge fund is appropriate. The budget is broken down, spent appropriately for each phase, $5000 for research, $10,000 for blockchain development, $15,000 in utility development, etc. In particular, the author has favored spending $12,500 on media and marketing to increase the number of users. The proposal has a full range of human resources, plans and budget tables suitable for the successful implementation of the proposal.\nI rated: 4\n", "q1r": 4, "q2": "The implementation roadmap is divided into 4 stages to help the audit work be carried out in each stage. The metric that measures the progress of implementation is the total number of users and the number of dangerous wedsites blocked. The roadmap of the proposal does not have timelines for completing the planned work. We would like the author to have detailed monthly reports on the progress of implementation. Track the route taken with Discord's proposal. Indicators/KPIs are appropriate to determine the success of the proposal, the number of utility users, and the dangerous wedsites that are alerted to users. The success of the proposal provides safety for wed3 and Cardano's specific wed pages.\nI rated: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10390, "q0": "Phishing remains a persistent problem with any project or system. Wherever there is money, bad actors will find ways to profit. The proposal wants to build a free chrome extension that helps users to detect suspicious websites automatically. This chrome extension will use Cardano as a decentralized database to store unsafe domains. In the future, the proposal's team will create a DAO to allow the community to vote on safe and dangerous links. The idea of the proposal is useful to the community and has the potential to expand. I like this project very much because it is really necessary for Cardano.", "q0r": 5, "q1": "There are 2 people in this project: JSHy and Zhaata. They are experts in the field of anti-phishing. JSHy is a software Engineer at Jpg.store and SecurityBot while Zhaata is a developer at Jpg.store, co-founder of CNFTJungle. If you are an investor, you will be very familiar with the Jpg.store marketplace. Jpg.store is currently the largest marketplace on Cardano and is very safe for users. I highly recommend the project team because they are very professional. In the project roadmap, the team will focus on 4 parts. In the first part, they will research phishing sites. In the second part, they will code the chrome extension and set up a node with APIs. In the third part, they will release a closed-beta version for testing. In the fourth part, they will release the tool for public use. They suggest $50000 for these four parts.", "q1r": 5, "q2": "There are two metrics to track the project \"Anti-Phishing Chrome Extension\": total users and number of dangerous websites caught. We can base on the total users to check whether users need the \"Anti-Phishing Chrome Extension\" or not. The number of dangerous websites caught will help to determine if this tool works well or not. Furthermore, we can visit Discord: https://discord.gg/JWy9bSqpYJ and Twitter: https://twitter.com/SecurityBotNFT for more information.", "q2r": 5, "assessor": "z_assessor_3183", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 12631, "q0": "Proposal fit the challenge. The purpose of protecting users from phishing forms through the website with a chrome extension is not a bad idea, chrome extensions are mostly accessible and easy to use, which will help users to make the correct decision when they want to visit an unfamiliar website or not.\nThis utility will aggregate all phishing sites and warn users, which is great. The team is also planning to add a voting feature to unknown sites, I suggest adding comment and rating sections under each of these links, like Google map, everyone has the right to rate and comment the place to let those who have never been there understand what the place really is like.\nIn the end, I found the project quite easy to understand but the method it offered was very effective and I couldn't ask for more.", "q0r": 5, "q1": "I think the roadmap of this project you presented is not professional, I know that there are 4 main stages that will take place. However, how will this task be accomplished? Exactly what tasks will be assigned in each phase?. Which experts will be involved here? I recommend adding timelines that meet the amount of work the team takes on and it also gives me a better understanding of the project process.", "q1r": 4, "q2": "Thank you for helping me understand the vision of this project and its success. The proponent will collect data on 2 main metrics, the number of users and the number of detected phishing sites, I agree with this, but I hope you will give a specific metric to I clearly understand how many users are satisfactory and how many are great, because your target audience includes the ADA holders community, I need a specific number, from which to know the project has is developing effectively or not, find the defects and improve.", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "SecurityBot will create a free chrome extension to automatically detect and alert users visiting suspicious websites using Cardano as a decentralized database to store unsafe domains for public good.", "experience": "The SecurityBot team are experts in scam prevention, having built the premier scam prevention Discord bot for the Cardano community and offering audits of NFT projects’ Discords for scam prevention and security."}