{"id": 419701, "author": "sabrinaliu47", "title": "Stray Dogs Raising Adopt Platform", "url": "https://cardano.ideascale.com/a/dtd/419701-48088", "category": 26595, "amount": 47300, "description": "Due to the economic downturn and space constraints, more and more dogs are being abandoned and few people are adopting or donating to dog shelters.", "f6_no_assessments": 10, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 4052, "q0": "This is a creative and interesting proposal. It increases the number of products available for the community, which enriches the ecosystem and at the same time tackles a real-world problem of vulnerable stray dogs. The idea is to use the Cardano blockchain to create personalized CNFTs for each dog and allow people to donate to a specific dog or a shelter using ADA or Fiat money. This way not only people will be able to assist these dogs in an easy way but also more people will be introduced to the Cardano environment. As the main goal of the proposal is the development of the platform it aligns with the objectives of the challenge settings as these focus on the ecosystem expansion and creation of new use cases. However, there is not much discussion on scalability on the proposal. As a suggestion they could create a treasury for the organization that would collect a small percentage of the donations and use this at first to invest in marketing to attract more donations and in a later moment use the treasury to pay for operational costs to enable a sustainable position.", "q0r": 4, "q1": "The team of four is composed of Sabrina, Tian, James and Emerson, and they have relevant skills in marketing, software development, computer science and language support. Also, they are featured in the group website, but sadly, there is not much information there and there are no links to LinkedIn pages or any equivalents in the proposal. The budget is clear and broken down into pertinent and identifiable items. The total amount, however, is a bit overpriced. For an initiative that will survive based on donations and that has not provided potential to scale I don't believe the cost is in line with the value they will create to Cardano. On the other hand, the plan outlined is conductible and the timetable provided realistic. It is divided in three stages, the first one being the frontend development and lasting two months, the second is the backend development and should last three month and the last one is the audit phase and is estimated to last one month. Finally, they also raised three main risks to the project, which are relevant, and discussed mitigating solutions for them. The main one is not obtaining enough donations and if that happens, they will intensify their marketing.", "q1r": 4, "q2": "The team has provided a roadmap with clear milestones and a time horizon for the execution of each step of the plan, which should last six months in total. They also added milestones for after completing the project but these would be more appropriate as KPIs. The metrics they defined are precise and well-thought. Even though they don't say it explicitly they have defined KPIs as amount of donation received, CNFTs created and dogs donated per month, which are good metrics to define success of the plan. Another KPI they could add and that would lean more towards the goals of the campaign would be number of new users onboarded onto Cardano. Finally, the proposer has not provided a public channel to update the interested parties on the plan's progress which hinder its auditability.", "q2r": 4, "assessor": "z_assessor_2513", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8295, "q0": "The proposers address an interesting issue : the welfare and adoption of stray dogs in dog shelters. They highlight the current world economic condition that puts strain on shelters to keep the dogs in their care alive and healthy. The proposers intend ease help these shelters by creating a dApp that allows people to donate directly. By using this dApp, donators can feed, buy supplies and healthcare for a specific dog at a partner shelter. At a certain level of donation, the donator will receive a CNFT as a reward.  Payment can be done via ADA or FIAT. However, the assessor suggests that the dApp should focus on ADA payments as allowing FIAT based payments would limit the fulfilment of the challenge.  \nThe proposers have mentioned several risks : lack of donors, donation imbalance to a certain dog, and capability of a given shelter to provide to the dog as the donator wishes. The proposers seem well aware of these issues and have established suitable measures to mitigate them. \nWhat attracts the assessor to this project is the direct interaction that donators will have with the dogs via the dApp and see how the dog develops and grows. Whatis even more interesting is that the framework for the dApp has a large potential to be adopted for other uses such as preservation of historical landmarks, support of orphans or disadvantaged groups, etc. This will definitely raise awareness and adoption of the Cardano ecosystem and help make the world a better place.  \n", "q0r": 4, "q1": "The proposers have set a timeline of six months which seems realistic enough to setup an application and establish collaborations with several dog shelters.  While the milestones for the development of the dApp are defined, the milestones in interacting and supporting the shelters are not mentioned. \nThe proposers should have established milestones in regards to shelters. However, from the link mentioned it would seem that the proposers already some degree of collaboration. Six months should be sufficient to establish new collaborations with shelters, therefore the assessor does not find the lack of description regarding shelter collaboration milestones to be a significant deficiency in the proposal. Even so, this should be addressed by the proposers with urgency. \nA budget breakdown along with a list of team members has been submitted.  While, the tasks are defined, linkage between the personnel involved with the tasks in the budget breakdown are not clarified. It would be much better if the tasks in the budget breakdown mentioned the team member in charge for the given task. \nIt should be noted that the proposers did not provide a detailed profile (e.g. Linkedin profile) for the staff involved thus the data available to the assessor to judge competence and experience of the personnel was limited. \n", "q1r": 3, "q2": "The proposers have defined completion of the project based on the completion of the dApp according to the milestone objections and by measurement of defined quantities, specifically the number of feeds and personalized CNFTs within a given timeframe. Meanwhile, measurement of the completion of the dApp was done qualitatively based on the features and framework/structure of the platform completed. In regards to the function and purpose of the dApp, this is sufficient. \nHowever, in regards to the interaction with shelters, progress metrics are somewhat lacking. The proposers mention the contacting of shelters, collection of dog photos and CNFT design. However, these specific activities were not mentioned in the feasibility section of the proposal. While these activities can be done in the time specified, the proposers should have made a detailed plan along with metrics to measure progress (number of shelters on board, number of dogs on the roster, types of snacks/toys, number and types of healthcare items available, etc).  \n", "q2r": 3, "assessor": "z_assessor_2973", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 8701, "q0": "Exploiting the emotional factor to attract potential users will be the main focus of the development of this project, I believe that if the project has the right marketing strategy about the meanings that the project brings, influence the emotions of the audience, it will be able to attract a large number of users to actively participate. The main aim of this solution is to develop a platform that allows participating donors to donate food, supplies, and medical care or adopt stray dogs with ADA or Fiat or buy CNFT Personalization for stray dogs. I believe that everyone who loves animals will be excited and welcome this project. The author has given clear descriptions of how the platform works including how to donate and tracking how donations will be disbursed by using the platform's interactive mode. The positive impact of the platform, if successful, will be to boost ADA liquidity through donations, driving the adoption of Cardano to solve problems in society. I think this solution is suitable to solve the problems that Challenge poses.", "q0r": 5, "q1": "The project development plan included the necessary information: the project development stages, the deadline for each phase, the work to be completed in each phase. In addition, the author also provides us with an audit roadmap after the foundation is completed including different timelines and goals to be achieved. I see the effort and credibility of the proponents through this blueprint. The budget is estimated based on the number of months worked by the experts x the corresponding salary, it would be better to include estimates of the hours worked by the experts. However, I see a disparity in the number of members participating in the project between the description of The estimated salary of professionals (5 people) and the presentation of information about the members who will work in the team (4 people). If there is a mistake here, you can check and adjust it accordingly to increase the auditability of the project. Although through the personnel descriptions, we can know what is the relevant work experience and role of each member in this project, the lack of verifiable records such as Linkedin, CV, Github, etc will reduce the reference value of this information.", "q1r": 4, "q2": "The project audit trail has been clearly designed and presented, the auditability of this project is easy, the indicators and objectives set out are ideal and suitable for evaluating success. However, in order for the community of people interested in the project to track information about the project as well as its implementation progress, the author can provide different tools/methods/spaces for the project. tracking such as blog posts, social media pages, community reports, etc.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9347, "q0": "I love animals, but personally, I can't raise all abandoned dogs. And this project of yours is really humane and nice. I fully support this project. However, I just saw that this is your solution, but I have not seen the details of the platform you intend to build. Platform creation and design involves the collaboration of many experts and requires the expertise of many people to combine. Platform design is important and I would love to see your design as well.", "q0r": 5, "q1": "Regarding your detailed plan, I don't find it too convincing although I really like the idea of this project. I see the work has not been planned in detail, besides, you estimate the time that the work will be completed without a clear specific timeline. twelfth. I see the budget listed for the main work but $47,300 is quite high. Members of my team do not see you indicate the number of years of experience but only everyone's specialized work. In general, you should be more detailed in the project.", "q1r": 3, "q2": "In the proposal, I see no mention of how to report your progress. You're just generally saying that you'll measure your project's progress against a timeline. I suggest that for example You can update in Catalyst progress report. I also agree with the criteria for measuring the success of your project. You have specific numbers to achieve. When there are clear goals, the project will be easier to measure success. I find it quite reasonable and fine.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 11221, "q0": "Dogs are not for nothing considered man's best friend and this proposal will attract many dog lovers to Cardano, while they can help take care of these wonderful animals. It is not for nothing that there are so many known cryptocurrencies based on dogs. Such as Shiba Inu, Doge Coin, Kishu Inu, Floki Inu, Corgi Inu, Yuki Inu, etc. \nAlso the idea of being able to feed a particular dog will make it much more direct contact and will involve the donors to have a follow up of their favorite dog. \nAt the same time, a small donation from a person in a developed country can be of great help to a dog in an underdeveloped country. This will make it possible to help many dogs through many small donations from different people.\nIt will also show the community that in Cardano we also care about social projects.", "q0r": 5, "q1": "The budget breakdown is clear, and coincides with the dates established for the realization of the project. Where 2 months will be used for the frontend development and 3 months for the backend development, coinciding with the established roadmap. In addition to the necessary budget for the final audit. In addition to the funding will be enough to get from the beginning to the end of the project, as they do not need extra rounds of funding to complete the project.\nRegarding the team, it is a cause they are involved with as they have a cardano pool named Dog. They use part of the income to make donations to dog shelters. \nFurthermore, the team has an IT specialist and a Computer Science Computer Science engineer. So it is perceived that they are more than prepared for the project in question.", "q1r": 5, "q2": "The project has very clear objectives, such as the design and content of the platform in 2 months, in addition to contacting shelters to invite them to join the platform. \nBetween month 3 and 5 to complete the internal design of the platform and the link to the wallet, in order to carry out the donations. And the sixth month to finalize the last details.\nIt is very good that they have added clear objectives to achieve within the first month of operation of the platform, as well as within 3 months and for the 6 months of operation. In such a way that you can have a clear follow-up of the progress of the project and if the objectives are achieved. Although I believe that the objectives are not very ambitious, they will surely exceed the objectives by far.", "q2r": 5, "assessor": "z_assessor_3231", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12632, "q0": "The idea of ​​the project is great and meaningful. In the context of the food crisis caused by the wars in Ukraine and Russia, in some places people are also experiencing food shortages, starving dogs are increasing. The project builds a platform that applies technology to save dogs' lives, which meets the challenge, and humanitarian projects like this also give people a positive view of Cardano.\nI think the difficulty in the number of sponsors will not be a big barrier, because if it is normal non-profit projects, they will have a doubt about transparency, that the project owner is taking advantage of the trust, their good to profit, the funding won't go where it should be. But if they really understand Blockchain and the absolute transparency it brings, it will give peace of mind about the money helping the dogs. They can completely check whether the NFTs of the molded food have reached the dogs, the treatment money has been spent, etc. And I hope that this project will live up to the expectations of the donors. From there I think the number of investors will increase significantly.", "q0r": 5, "q1": "Thank you for clearly explaining the required human resources of the project as well as the 6-month timeframe for the roadmap. The workload given is in line with the budget scope as well as the human resources of the team. You have also detailed the key milestones of this project, which will help me understand the impacts and goals of the roadmap. The information about the experience of the members of the project is also presented clearly, I have a small suggestion that you should attach the link (Linkedin, twitter, ...) of the members right below the information. of them, it should make it easy for me to confirm what you're saying is true. The required budget is in line with the project scope. I have no comments on this part.", "q1r": 5, "q2": "Thank you for clearly providing your vision for the success of this project. And the indicators that you plan to achieve in the future, this makes it easy for me to compare with the project's survey reports in the future, helping me measure the project's effectiveness. I hope you will try to continuously collect data on these indicators and project progress and make it available to the community to be easily tracked. I couldn't ask for anything more. I rate this part highly.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 14588, "q0": "I think the idea of creating a platform where stray dogs can be fed or adopted online is great. The information the proposal gives shows the impact of it on the Cardano ecosystem. The team wants to design a platform that aims to support stray dogs by creating dogs personalized CNFT to help every stray dog, also allowing people to donate to a specific dog or SHELTER with ADA or FIAT through the Platform that will contain foods, snacks, toys, tools, medical treatment, vaccinations or cleaning, so people could feel interactive and interesting while feeding dogs, buying snacks, toys, paying medical treatment, vaccinations or cleaning or even adopt the dog. It is easy to understand the idea, but I have a recommendation that the proposal should include the technical information or the proposal has an example with a case study, which helps the proposal be clearer. The explanation on how the solution will address the challenge is apparent that the platform allows donors to buy food, medicine, and sponsor medical expenses, and the total number of users and transactions made will be used to determine the success metric of the platform. This aligns to the challenge of increasing the number of users adoption in Cardano ecosystem. The risks of the proposal are listed transparently and the ways to mitigate each risk are suitable and convincing. ", "q0r": 5, "q1": "The feasilility part of the proposal starts with the description of the project that people can donate to a specific dog or shelter with ADA or FIAT with food, snacks, toys, tools, medical care, vaccinations or cleaning through the platform. The timeline and the milestones are displayed separately with the plan. I highly recommend the proposal should combine that information in a data system, so that the readers can easily understand and get the idea of the proposal. By the way, that is an additional opinion, the proposal is feasible for me, generally. The timeline is in months with the activities and the results of the team in that time. In addition, three key milestones are listed and explained well. The milestones are aligned closely to the plan and the timeline before. The budget is broken down and calculated based on the salary for the professionals and the number of dogs and the amount of time. The budget is logical to the plan the team builds. About details of the people who will work on the project, the members are listed with the experience which I think is suitable with the proposal. I believe that they will bring success to the project.", "q1r": 5, "q2": "In terms of auditability, I think the proposal is written quite well but there should be additional KPIs to measure the project’s progress. In each stage, the results are mentioned, which are logical to the plan built. However, it is easier for the community to follow and assess if the key metrics are listed. The picture of the proposal's success is clear for me to understand. The proposal set goals to achieve.", "q2r": 5, "assessor": "z_assessor_4073", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14740, "q0": "\"It is meaningful that the proposers try to connect the cryptocurrency world with physical world, in this case, the stray dogs. After the pandemic, the economic situation made some dog shelters cut off their costs. Therefore, the dogs are facing risks of being abandoned. This platform will support dog shelters by creating the personalized CNFT for each dog. Then, people from the community can donate to that dog, or the shelter in general by ADA or fiat. Depending on the donors, this money will be used to buy foods, toys, tools for dogs, or even adopt the dogs.\nIn terms of the risks, the proposers addressed well and had the strategic plans to mitigate each risk. I just have several small questions: i) what if in terms of the dogs’ health, just by accident, the dogs were dead? In this case who will be in charge? ii) Moreover, do we need guidance for the donors in case they do not know how to raise the dogs? iii) do the proposers have any plans to educate the dog shelters to use the platform since blockchain/NFT concept is not easy to be grasped?\nIf this project is successful, a great number of dog lovers/adopters will join the Cardano ecosystem to support these dogs/dog shelters. It is good to show to the community what blockchain and NFT can do to the society by tangible actions. This solution is aligned with the challenge. \n\"", "q0r": 5, "q1": "The roadmap timeline and task process were sufficiently provided. Several in-line key milestones are specific and clear. The budget breakdown was calculated in-detail. Just small feedback that the proposers should allocate the funding in accordance with the roadmap task processes to make the proposal clearer. A clear proposal helps assessors audit the project, and higher feasibility may be achieved. The core team members have experiences in project management, marketing and engineering thus I believe this is a strong team. These experiences are essential for this project feasibility.", "q1r": 4, "q2": "The exact number of KPIs/metrics in a given timescale were provided. In my opinion, these KPIs/metrics are realistic and attainable in a given timescale. To increase the auditability, it could be more fulfilling if the proposers provided some forms of announcements to the community in terms of the project progress. For example, I recommend posting on some social media platforms e.g., Discord, Twitter, Facebook, etc.", "q2r": 4, "assessor": "z_assessor_4098", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14768, "q0": "The proposers found that more and more dogs were being abandoned and very few people adopted or donated dogs due to the impact of the economic downturn. The solution to this problem is to create a platform for stray dogs to have shelter, care and find owners for them. This is a humane idea with great potential for growth. Personally, I support the idea of ​​the team and hope that the project will bring many benefits to the community.\nIn this section, the proposers have clearly presented the function and operation of the project. The target audience of the project has also been determined from the beginning. Those are stray dogs that need to be cared for and found owners. This project provides a solution to help these animals by soliciting donations for their necessities such as food, snacks, toys, tools, medical treatment, vaccinations, or clean-up. It also excites people and gives them the feeling of wanting to adopt these animals. It can be seen that this project has a positive impact on the community. But for even greater appreciation, the proposal should include a more in-depth technical explanation.\nThe team confirmed the suitability of the project with Challenge's key metrics. The Proposal also clearly states the purpose the project is aiming for and explains how this aligns with the Challenge. This project when completed will have the potential to expand the Cardano community.\nThe team identified three risks when implementing the project including lack of sponsors, unequal help for the dogs, and the quality of shelter and food for the dogs. They have also found ways to reduce these risks.", "q0r": 5, "q1": "An extremely detailed plan is drawn up to implement the project. Roadmaps are broken down by the proposers into milestones. Each milestone specifies each work item to be completed and sets out requirements for each item. The proposal gives the community a very detailed view of the platform. Viewers can visualize the progress of the project through the proposal. Furthermore, the proposers highlight the project's major milestones along with a realistic timeline for completing the tasks. The details of technical aspects such as architecture, language, and technology required to implement the plan are also mentioned in the proposal. The proposal also mentions the required number of personnel and identifies key positions to carry out the project. Through the project implementation plan, the community can assess the potential to achieve the goals proposed in the proposal.\nThe budget that the team plans to implement the project is generally completely reasonable. The budget is broken down and clearly bulleted to be used for each activity. All expenses include staff salaries and expendable assets.\nThe project was carried out by a team of 4 people. They are people with deep experience in the field. With the profile of this project team, the community can trust that they will successfully lead the project and bring benefits to the community as expected.", "q1r": 5, "q2": "Information, milestones in the roadmap, and the time to achieve the goal are stated very specifically in the proposal. The project will be evaluated in 3 phases including finishing the Front end development, Finishing the Back end development, and Finishing the audit and remaining details. Quantitative indicators are also provided very specifically. Based on these numbers, the community can track each step of the project's progress and evaluate the success when the project is completed.\nThe image when the project is successful can also be clearly seen through the proposal. Those are the achievements that the project has achieved along with the products that the project has produced during the implementation process.", "q2r": 5, "assessor": "z_assessor_4099", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14842, "q0": "As an animal lover, I am always looking for innovative ways to fund organizations, and I am completely satisfied with the quality of this project. Cardano users will donate ADA or FIAT to shelters or stray dogs by creating dogs personalized CNFT, and they will be converted into foods, snacks, toys, tools, medical treatment, vaccinations, or cleaning to serve their lives. This will help many shelters that are having a hard time maintaining and not having to make heartbreaking decisions like putting them to sleep to make room for other dogs. I also like how the proposer handles anticipated risks. For example, in order to ensure that all dogs are supported rather than just one adorable one, the platform will notify users and suggest they feed or help another dog. This not only gives more dogs a better chance at life but also creates a loving Cardano community. Or I like the idea of suspending assistance to a shelter that has not followed the donor's instructions for a month in order to ensure that the donor's money is not misused by any individual or organization, as well as to encourage other shelters to do what is necessary to avoid losing support.", "q0r": 5, "q1": "Aside from the platform's content and quality, I also liked the project's plan, budget, and lineup. First, let's discuss the project's strategy. We have a section called detail plan, in which the author describes how the product works and its features. The project's use of Chinese and English, in particular, will be expanded to Spanish in the near future, which is a step toward the international market. Here, Cardano users can not only help shelters in the country, but they can also adopt dogs from all over the world.  Next is the timeline - the most important detail of this section, with time-related numbers all given. It is clear that the project will be completed within 6 months, with a total of three steps including the main goal and the work that will be completed within the time frame. Furthermore, the project's key milestones are divided into two sections: during and after the project's completion. All of the above elements come together to form a detailed and flawless plan, something that not many authors can prepare, and I greatly appreciate this. \nFurthermore, the project has a high-quality team, with all members belonging to the ADA DOG POOL team. They are all those who play a critical role in the project's success, and I believe that with a team of many years of experience in the profession, with such a strong work ethic and love for animals, no problems will arise. Finally, the author is open about how they intend to use the voters' investment capital. 5 clearly explained spending items are included in the budget, and $ 47000 for such a good and meaningful project, in my opinion, can completely get a nod from investors.", "q1r": 5, "q2": "There are very few projects in the previous articles that can be prepared as well until the final step of this proposal. We have accurate timelines in the development progress section to help voters track the project progress in the most objective and standard way possible; those milestones are also completely aligned with the previously mentioned plan. Furthermore, for the project's success, the proposer provides specific numbers such as the number of feeds provided by ADA or FIAT or stray dogs personalized CNFT within 6 months of project implementation. In general, I have nothing to add and am confident that, as long as the plan is followed, the project will be a success with numerous benefits.", "q2r": 5, "assessor": "z_assessor_4104", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create a platform where stray dogs can be fed or adopted online, so that shelter dogs can obtain online feeding and increase their chances of being adopted.", "experience": "Community manager, SPO and members of DOG POOL.\nDonation to different shelters (St. Ray´s rescue, Juntos Por los Ceferinos , Pingtung Huang dog charity, Rescate 4 patitas, Pariah Dog Koh Samui)\nVolunteer at a guide dog training event\nHosts Cardano Hubs in Taiwan and Australia"}