{"id": 419731, "author": "benjaminhartin", "title": "Interview Cardano=Know Our Builders", "url": "https://cardano.ideascale.com/a/dtd/419731-48088", "category": 26595, "amount": 11000, "description": "There is no catalogue of in-depth interviewed articles giving voice to the builders in Cardano that offer readers a unique view into the ecosystem and a place where collaborators can be found.", "f6_no_assessments": 8, "f6_rating": 4.541666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1696, "q0": "Yes, I really believe that this proposal will have a positive impact for Cardano, even though it is not focused on the development of any dApp, product or integration. As the authors themselves comment on the construction of the proposal, the summary of the challenge includes the excerpt “The more interesting and useful the products and integrations that can be built in the ecosystem, the more reasons people have to interact with the Cardano blockchain…”; in other words, one of the goals is to create projects that can engage our community, which would be clearly done here. The problem raised is the lack of article catalogs in relation to Cardano builders, that is, people who have executed projects and are successful, being able to serve as an inspiration for the members of our community. It is said that we in the community are always busy with our own projects and developing our own technologies. And in fact, this is really true, because as we have Catalyst, we are often so full, and with such a heavy workload, depending on the period we are in (for example, the APs are very busy in the two weeks of evaluations, bidders get too busy the last few days to edit bids in ideascale and etc). Often, then, we don't even have the initiative to look for inspiring examples and networking; in certain situations, some projects are discussed in the weekly Townhall, or even posted on youtube channels such as Catalyst Swarm, where some videos about breakout rooms (spaces where community members debate about a specific subject or project - for example recently there have been projects that have posted videos there, such as Cardano4Senior and Homeless Hub). Even though we have these possibilities, in my view the in-depth interviews and articles that the proponents suggest creating are more efficient ways to understand, in a precise and certain way, about the history of important entrepreneurs and developers for Cardano. The solution can be summarized as “We will search for current builders, conduct in-depth interviews and publish the results in long articles, providing a new place for readers to find inspiration and connections. We seek to understand and provide the community with articles that provide insights into the origins, contexts and visions that are fueling builders in Cardano.” The proposal has several positive points, but I will also make some comments and suggestions about the specific details of the idea and its respective impact. Talking about the experience of one of the members involved, it is very positive that Benjamin already has experience as a writer, even though it is the ghostwriting modality, it already indicates a certain preparation in relation to the technical quality of producing quality written content. Now, I would like to make a few comments. In the excerpt “Publish 9 long articles (1,750 - 3,500 words) of in-depth interviews of individuals and teams helping to build Cardano once a month over a 10-month period. Our vision, if we have the opportunity, is to put these extensive interviews and lessons learned from them in writing and publish them in a never-before-seen catalog on the Cardano space to add as an asset to the community for education, inspiration, connection and cooperation”: how would the 9 interviewees be selected? What would the interview questions be, more or less? In which places in the Cardano community would the unpublished catalog be published, in addition to the pages that the authors themselves already manage? “Readers will not only find this type of writing captivating and entertaining – both secondary to our objective – but more importantly, they will find themselves exploring in these longer-form pieces a richer view of the valuable elements (…)”; what would that language look like? How do the proponents intend to attract and keep the attention of people who are part of a community that is less and less reader, more immediate? I believe it was important that these strategies were publicized. I think we already have a preview of what this language would look like, however, in the articles made available on the lidonation website, such as the article “What is Cardano”, which speaks in an excerpt “Both innovations created vast amounts of new wealth, for new people. This forced society to change how we live and govern. Yet, the happiness or misery of a child born today is still tied to what government and social class she is born into. Cardano is a new technology that wants to use the blockchain to change that”. There we can have a visualization of how these aritogs would be written (with a lot of quality). Finally, it is very positive that the authors have already raised some risks and possible solutions, I think the impact is very good, a final suggestion I would like to make is: these interviews could be translated into some widely spoken languages, even if through google translator, to increase audience reach.", "q0r": 5, "q1": "The proposal is really viable, the development process here is not that complex, but some parts of the script could be better detailed. For example in pre-writing, what would be done: “Using the Lido team’s well-founded research skills and relationships, Benjamin will connect, schedule, interview involved people/teams according to the script below”. How will Benjamin select the interviewees, how will this scheduling be done? It would be interesting if he included entrepreneurs from different areas among the interviewees, so that the catalog would be as rich as possible. Even if we didn't have the names of the interviewees themselves, I think it would be beneficial to know at least what criteria they would be selected on. About the excerpt “The Lido team will make final edits, post the article, alert readers on all of our social media accounts, and begin connecting with commenters after the posts are published.” What would be the group's media, in addition to the lidonation website? I think it would be important for us to know how they would reach other audiences as well, besides their readers/followers. I think it would be ideal for this catalog to be presented in a Townhall, to be posted on the telegram group “The Project Catalyst”, in short, to circulate in the media with more active members of our community (besides that suggestion about translations for other languages ​​- because I believe that here the aim is to reach many, many people, and I don't think we should limit ourselves only to English speakers - we know how the language barrier is a strong problem to be overcome. In general, we have closures that let It was very clear what would happen in each time interval: in the first month, contact would be made with the interviewees; two months to write and from month 3 onwards, revisions by the entire lidonation team would begin. month 3 and 10: “3 months: Achieve selection of the next 2 story subjects (4 total at this point), 3 interviews completed, 2 stories written, and 1 article published, pro moved on social channels, 10 Months: The publication will have occurred between the end of month 2, until the end of month 10. Thus, 9 new long articles published before June 30, 2023”. It was confusing to me what would happen in such an extended period of time, maybe the development of each interview lasts around 2 months, but anyway I wish it had been clearer. The asking price for the proposal is quite reasonable compared to most other Catalyst proposals, and it makes sense because it's not such a complex project. The total amount is divided into two parts: $8700 for the writing assignment, which includes “Research (travel, pre-interview preparation and relevant field study) + 25+ hours of interview + 35+ hours of transcription (for quotes and story arrangement) + Write 9 original long-form articles with builders in Cardano” and etc. It would be interesting, as I have already mentioned, if we knew a little more about the structure of the interviews that the author intends to develop. I would also like to know more about what constitutes a field study. These trips he commented on are a little abstract, where would he go, how can you set a value for it if we still don't know where the interviewees live? Perhaps these interviews could be done online? The second part of the expenses could be better explained: “$2300 - Administrative costs covering editing, publishing, tagging and SEO optimization process”. How much would go for each thing? Finally, about the team, I think this part looks great and gives total confidence in the team. We know some information about the main stakeholders of the project (“Benjamin is a creative, a musician and a writer who sees human progress as a result of individual transformation and social change (...) Darlington is an engineer by day and always a dancer, humanitarian, idealistic and enterprising”). I think it could have been explained a little more about each, but we've already managed to get a good idea of ​​who they are through what is described to us. What conveys more confidence is the fact that they participate in the Lido Nation group, it is a group that I already know and that develops very interesting work within the Cardano ecosystem. One of these jobs is the maintenance of several articles with different subjects related to Cardano on their main site, they also have a job of bringing accessibility of these contents to a different audience (I remember a proposal that they would translate various contents of the site to a African language, if I'm not mistaken it was the Swahili language). They also attach their linkedin profiles, where we can have a more direct and comprehensible knowledge of what is being said. So, on this, the information is satisfactory. As well as the impact, the topic is very good, although some small suggestions and improvements can still be made.", "q1r": 5, "q2": "Finally, talking about auditability, I think it could have been clearer in what way Benjamin is going to keep us informed about the progress of progress. It is said that this would be realized based on 3 main parts “Subject Selection: Selection of 9 individuals or teams, each at least 2 months before publication + Publication: First story published and promoted on all social networks within 2 months from the start of the project. + Pace: Let's account for 1 article to be written per month, and also keep attention on interview, draft and editing times simultaneously.”. How will updates be passed on to us, how can we be sure that everything is being done properly and on time? Generally I suggest that the process be followed in two ways: 1) the activities that would be working 2) the partial results achieved; this could be done here, some partial results could be: interviews carried out, drafts started, dissemination campaign in progress, how many people would have read and interacted (commented on and shared, for example) about the first available interview, etc. All this data could be provided to our community directly, for example on some lido nation social media. And about success, again 3 metrics are given: “Selection: 9 Individuals or teams are selected/interviewed for the stories +\nPublication: We publish 9 new stories from builders in Cardano in 2022/23 + Pace: We publish articles at a rate of 1 per month (9 in total)”; but I believe that this information is not enough to fully understand the impacts of this project on Cardano. It would be necessary to understand how reading the articles would have inspired community members, what they would have started to do from there… Perhaps it would be interesting to collect feedback from some people to understand how these articles were beneficial and transforming agents in their lives. trajectories within our ecosystem, whether networking was really done; finally, if the objectives of the challenge would have been achieved, it is necessary that this information be collected, through quantitative and qualitative data, and that it be properly presented to our community. With that, I conclude my analysis that the proposal is indeed auditable, but some improvements could be made here, especially in the part of success, a more in-depth and specific study on how the article catalog would have achieved its objective of engaging and inspiring our community, so that more projects are created over time, with great vigor and dedication. Auditability is not perfect, it needs occasional improvements, but still the topic is good.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2021, "q0": "The idea of this proposal is to carry out interviews with creators of content, tools, businesses, etc., associated with Cardano and, from these interviews, create detailed articles about the project, difficulties encountered and how they overcame them, important aspects to pay attention to, etc. These articles will be published in a repository for anyone to have access to and learn how a particular application was built and/or have insights to build their own solution.\n\nThe problem observed by the proponent is precisely the lack of a single location where it is possible to find, in detail, the paths traced by the entrepreneurs to achieve that result. However, there are already several places where you can find interviews detailing the projects, how they will be done, expectations, etc. However, they are not unified and divided by subject, nor do I believe that this level of detail exists after the project has been implemented and is running.\n\nTherefore, this solution aligns with the challenge in question as it increases/facilitates the possibilities within the blockchain, since it has an educational nature. Creating a unique place with interviews/articles that have details of the creator's journey is interesting and is explored in many ways in traditional companies in the form of lectures, interviews etc. Therefore, creating this platform would attract people and make solutions and integrations with the real world more tangible.\n\nAs métricas e objetivos da proposta estão correlacionadas com sua finalização. Portanto, sinto falta da menção de métricas e objetivos em relação ao publico atingido, uma vez que não faz sentido fazer esse repositório e não haver audiência para isso. Portanto, para que seja possível este acompanhamento e verificação de seu impacto, é importante a adição deste tipo de métrica e objetivo.\n\nBecause the cardando blockchain is always evolving, its ecosystem is always being used to implement new projects and solutions. Therefore, it is feasible to think that the project is scalable, as there is an increasing number of projects. The only point to pay attention to is the need for a monetization strategy, since this is a 'mechanical' job, which requires the presence of people doing the work, it needs to be monetized. However, this strategy does not yet exist, or at least has not been included.\n", "q0r": 4, "q1": "In order to verify its feasibility, we need to verify the following aspects:\n1 – roadmap: It is detailed as far as possible. Due to the fact that the project runs first in the form of an interview, deadlines are fluid, with no possibility of allocating certain dates for the beginning and end of each task at first. However, the team seems to know how long it takes to perform each of the tasks and, thus, the deadline for completion of this project seems to be consistent.\n\n2 – budget: The budget is practically all allocated to pay operating costs, that is, payment for the team's working hours. One part that I would like to be more detailed is precisely the administrative costs, as they represent 20% of the requested budget, I think there could be more detail and cost division. I also miss some allocation to marketing, since this content must reach people even outside the Cardano environment. Therefore, adding a marketing strategy is important in order to this project grow.\n\n3 – team: The team has the necessary skills to carry out this task, especially someone who has experience in conducting an interview, and someone capable of taking the content passed by the interviewee to paper in a way that the simplest people understand. This is the biggest challenge. LinkedIn links were given to verify experiences.\n\n4 – risk management: Some risks were discussed, such as the scheduling of interviews and actions that can mitigate this process were mentioned. There is still the unmentioned risk of platform reach. Since its existence only makes sense for its mass use, even by people outside Cardano's universe, it is extremely important that it reaches them. Therefore, as a suggestion to mitigate the risk of running out of audience, it is necessary to include a budget for marketing and dissemination.\n\n5 – self-funding/scalability: Unfortunately, no plan was informed, apart from the catalyst, for the project to continue. There was no added way of monetizing the platform for the project to amplify. Therefore, as a monetization suggestion, since social networks will be used to interact with readers and ask for suggestions from future interviewees, a request for funding can be added to that for the project to continue.\n", "q1r": 4, "q2": "In order to audit, we need:\n1 – roadmap w/ milestones: As already mentioned, deadlines or specific dates were not included, even because the project may have several changes since the main asset is people. However, highlights from interviews, publicizing the making of the article, etc., can be added to improve follow-up. Provide greater interactions so that the public knows that something is being done.\n\n2 – Metrics and KPI: Metrics and KPI are related to project fulfillment. However, it would also be interesting to add metrics related to the success of the project, such as the number of readers, number of hits, clicks, which articles were most accessed, which the longest page time, etc. Such metrics are important so that you can make articles that increasingly meet the needs of readers.\n\n3 – Channel: The proposal has a channel which they will publish all the content and interviews. \n", "q2r": 3, "assessor": "z_assessor_2298", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2090, "q0": "This proposal wants to give a voice to the builders in Cardano providing readers with a unique view of the ecosystem and a place where collaborators can be found by searching for current builders, conducting in-depth interviews, and publishing results in feature-length articles, providing a new place for readers to find inspiration and connections. The proponent's idea was to conduct in-depth interviews with the individuals and teams that helped build Cardano over a 10-month period and then publish it as nine long articles (1,750 - 3,500 words) once a month. At first glance, the proposal may seem unrelated to the challenge, but the proponent explains that these nine stories are the first of an ever-expanding product: namely a catalog of lengthy sections around the world showcasing the ideas, concepts, and lives of a growing list of people involved in creating dApps, products, and integrations on Cardano. So in a way, this proposal also contributes to increasing inspiration to exploit knowledge and ideas, as well as learn about potential collaborators. Therefore, it also fits the goal of the challenge", "q0r": 4, "q1": "It can be seen that the proponents know how to logically establish an actionable plan. So it will be easy to audit progress as they have clear and concise steps in their plan. The budget was also clearly and concisely defined, with a reasonable amount of $11,000 being asked, we knew exactly what the expenses were going to be used for. And finally, about the project team, the proposal team includes authors Lido, Benjamin, and Darlington. The details of the group are presented very well, we have all the information about them such as field of activity, experience, and connection to Cardano as well as a LinkedIn link so we can confirm the information above. Therefore, I believe that with what is provided they are competent enough to carry out this project.", "q1r": 5, "q2": "I think this project will easily measure its progress based on what the proponent provides. Measurement progress will be based on the following criteria:\n-Select topics: Select 9 individuals or groups, each group at least 2 months before publication.\n-Published: The first story was published and promoted on all social networks within 2 months of the project's start.\n-Pace: write 1 article per month, while paying attention to the interview schedule, draft, and simultaneous editing.\nThe success of the project is also determined very simply by achieving the above indicators. However, I think the success of the project is not very convincing, of course, the above goals must be achieved, but it needs to have a longer-term vision, what problems will it solve through this proposal? of the challenge and how does it impact Cardano?", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6067, "q0": "Many individuals and groups are mainly developing community pages to introduce and discuss the Cardano ecosystem or are busy developing application tools on the Cardano platform. The proposal team found the community lacked insight into the bigger stories. Therefore, they will search for current builders, conduct in-depth interviews, draft nine long stories, and post them on social sites. These stories will be released, giving readers a unique look at the Cardano ecosystem. With eight years of experience writing memoirs, the author understands that stories built from interviews will bring a more comprehensive picture and attract readers to discover themselves for long period and understand the intrinsic value factors. The content made into nine stories includes introducing the ideas, concepts, and lives of an ever-growing list of those involved in creating Dapps, products, and integrations on Cardano. I find these nine stories to be invaluable assets to the community. The team proposes to build inspiration to tap into knowledge and ideas and learn about potential collaborators for the Cardano platform.", "q0r": 5, "q1": "Information about the two proposal team members is briefly described and covers their experiences (Linkedin profiles attached). The workflow to publish nine stories is built in 10 months, and the expected completion time is before June 30, 2023. The steps include:\n- Selecting and validating the topic;\n- Searching for builders and performing in-depth interviews;\n- Drafting, publishing stories, and advertising on social channels.\nThe team suggested an $8.700 budget for the writer's work and $2.300 for administrative costs, including editing, publishing, tags, and SEO optimization. Therefore, I believe in the feasibility of this proposal.", "q1r": 5, "q2": "The proposers selected three metrics to control this proposal: subject selection, publication, and pacing. The first story will be posted and promoted on social networks within two months of receiving funds. The final story will be released by June 30, 2023. These timelines are all performance metrics, and we can easily track them. However, these timelines are also a limitation of the implementation of this project. Because there may be objective reasons, the author team may need more time to complete the nine stories and release them by June 30, 2023. Therefore, they selected interviewees and scheduled interviews for two months to try to accomplish the set goals. The transparency of this proposal was well presented and clear.", "q2r": 5, "assessor": "z_assessor_2775", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7123, "q0": "The background behind the idea is certainly exciting. As a part of the community that has not developed any dApps, products, or integrations, we all welcome every contribution to the Cardano ecosystem without having any insights into the team or individuals behind it. The proposer tries to conduct interviews with these builders and publish their stories in the form of digestible articles. These articles would then be published once every month for the next nine months. I am personally interested in seeing why the builders contribute to the Cardano ecosystem specifically, but based on the proposal, it seems the proposer plans to ask about both the person and the project for a full 360-degree insight. Overall, I strongly agree with the proposer’s idea, as it would be a valuable asset for inspiring and facilitating cooperation within the community. That being said, it is still a bit hard to truly determine the impact of the articles since we don’t know who is going to be interviewed. We know the quality of interviewees and the stories they bring are the most important aspects. However, it seems the proposer has not chosen them yet. They plan on using the LidoNation networks to find the builders, and, based on the feedback they received on the previous articles, would cater to the readers. This plan is already fantastic, but I would encourage the proposer to keep the products and the builder's background as diverse as they could. So the nine articles would not be about NFT tokens or DAOs (for example).", "q0r": 5, "q1": "I am confident there would be no hindrance when it comes to implementation. The proposer has relevant experience in interviewing and writing stories while also having the technical knowledge about blockchain and, through LidoNation, relationships to find the builders. The 11,000 USD budget sounds reasonable for a ten-month proposal, but the details can be broken down further for clarity. For example, what does the proposer mean by \"edit process, publishing, tags?\" Why do those items need 2300USD? Also, I think it would be beneficial to allocate some portion of the budget for a wider-reach marketing campaign instead, since the articles are targeted to be digestible, so it could reach a huge audience. The timeline is reasonable and we could see that the proposer does have confidence in the flow of producing the articles, from researching to publishing. Lastly, I was concerned about the risk of delivery delays (perhaps the builders have urgent things to attend to or there might be problems with finding interesting questions), but the proposer has mitigated this by adding buffer time to each interviewee. Therefore, I concur with the proposed plan.", "q1r": 5, "q2": "The proposer provides a clear 10-month roadmap with milestones in the first, third, and tenth month. The metrics used to define the proposal's success are publishing nine articles at the end of the timeline. Since the idea is aimed at the community to gain insights around the projects and the builders, it might be necessary to add reader-related metrics too, such as the number of reads, the number of comments and shares, and any other metrics that reflect the community's gaining knowledge about the builders. Other than that suggestion, I strongly agree that it would be effortless to audit the implementation. In addition to the monthly updates with the coordinator, we could track their progress based on the one article per month expectation.", "q2r": 5, "assessor": "z_assessor_2878", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 7903, "q0": "There are a lot of video interviews on YouTube or podcast platforms on people that are building on Cardano. Many of the interviews are more or less one to two hours. Almost all of the conducted video or audio interviews have no written article or blog about that interview.  The proposer offers long-form articles(1750-3500 words) from interviews with “individuals and teams building on Cardano are busy maintaining the tools we love” that provides “insights into the backgrounds, contexts, and visions that are fueling the builders in Cardano”. Long form articles have their place in any subject. The most benefit I get from them is when I print them out and read them like that instead off on the computer screen. This allows me to dive deeper, make notes and research certain things highlighted in the article. \n\nA resource like this can allow the community to have a back and forth with the interviewer or with the developer, thus encouraging interaction and feedback. Articles like these have the potential to lead curious minds on the path of exploration which could lead to novices starting to interact with the Cardano blockchain. ", "q0r": 5, "q1": "The budget is outlined and includes subtotals which makes for easy reading. Most of the budget items outlined are lumped together and this is understandable, since this proposal is such that one cannot determine the exact hours and travel locations in advance. The budget also contains a “$FREE” section outlining efforts that the team will do on their own expense conveying the message that they don't need to be compensated for every little thing. This is good to see. \n\nAlmost everyone who is part of the Catalyst process has somehow heard of LIDO Nation. The team has produced analytics,tools and articles for the Cardano ecosystem. Given what the team has produced thus far, it increases the likelihood that this proposal will be successfully implemented. The risk was identified and mitigation was indicated in the form of scheduling interviews in advance to meet the target of nine long-form articles.", "q1r": 5, "q2": "The key performance indicators were clearly defined with expected times and the success of this proposal can very easily be measured. \n\nThe roadmap provides a clear timeframe in months and the exact date of completion. This is an easy roadmap to follow and the community can audit this proposal. If funded, the first article will be posted two months after funding via their various social media handles. And then an article every month after that. ", "q2r": 5, "assessor": "z_assessor_2935", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9626, "q0": "The proposal is aimed at creating articles that talk about the backgrounds, contexts, and visions of people developing dApps and products on Cardano. These articles will be conducted through interviews with people who are building on the Cardano ecosystem. The project solves the challenge by becoming a fountain of inspiration for readers to tap into knowledge and ideas, thereby participating in Cardano and building their own dApps and products. It can be seen that this is an interesting and valuable proposal for the community of builders and investors in the ecosystem", "q0r": 5, "q1": "The team consists of 2 members, one is a software engineer who also the founder of Lidonation and the other is a memoir ghostwriter with 8 years of experience. I believe that the team has the capacity to bring this project to success. The budget has been broken down into identifiable items and is quite reasonable. The given roadmap is realistic for interviewing and publishing 9 articles within 10 months. The risk of not being able to do interviews with the project builder according to the publication schedule has been considered and the way they minimize this risk is by scheduling all interviews two months before.", "q1r": 5, "q2": "The three metrics the project provides to audit the progress and success of the proposal (including subject selection, number of published articles, and pacing) can be measured by the community. Because the articles will be posted on the Lidonation website and made available to the public, the metrics can be easily accessed and checked by anyone. I would suggest the proposer to clearly state how they choose candidate projects, will the projects be voted on by the community or will be selected by the team? What criteria will be used to select and prioritize one project over another? The addition of such information will make the project more detailed and transparent.", "q2r": 4, "assessor": "z_assessor_3068", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11251, "q0": "The project proposes to provide a catalog of in-depth interviewed articles. These interviews will be with current builders in the Cardano space. The plan is to publish a total of 9 in-depth articles about the interviews of individuals and teams that are helping to build the Cardano Ecosystem on a monthly basis for a duration of 10 months. All the published material can be used for education, connection, inspiration, and cooperation purposes.  This would provide more insights and information that is lacking as of now. Their main target audience is the population of people that are learning about the blockchain space and Cardank community members that are building and investing in the space. As they can glimpse things from the viewpoint of the architects of the apps, products, and integration. This challenge does address the challenge as their product that could drive more adoption of the Cardano ecosystem. ", "q0r": 4, "q1": "The team consists of 3 individuals, Lido, Benjamin, and Darlington. Lido is a Cardano enthusiast who believes in providing insightful education regarding the Cardano blockchain in English, Swahili, and Spanish. Benjamin is a musician and a writer and has 8 years of experience in ghostwriting. Unfortunately, the site regarding this experience was not working as of writing this assessment thus more cannot be said regarding him. Finally, we have Darlington, who is an Engineer that has knowledge about blockchain technology and decent experience in the Cardano ecosystem. He also has more than 14 years of experience in Software and Cloud Engineering. The experience they have is sufficient to accomplish the task and thankfully the team at Lido would also help the team in contacting the right individuals for the interviews. As for the plan, it is a rinse and repeat process that covers the selection and confirmation of 2 stories subjects and interviews. Followed by drafting, published, and cross-promoted on social channels. Until all 9 new long-form articles are published which will be before July next year. Overall the plan and the experience put together are sufficient to assure this proposal would be implemented successfully. ", "q1r": 4, "q2": "The auditing of the progress would be done by measuring the subject selection, publication, and pacing. There will be a total of 9 subject selections, the first publication should be within 2 months of the start of the project and the pacing will be for the articles that should be published once per month. As for the success of the proposal, the team would audit it by selecting all 9 subjects, publication of all 9 new long-form stories, and ability to achieve the pacing of 1 article posted per month. The means provided to assess the progress and success of the proposal are sufficienet. ", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We will seek out current builders, perform in-depth interviews, and publish the results in long-form articles providing a new place for readers to find inspiration and connections.", "experience": "Benjamin: 8 yrs exp. in ghostwriting memoir (including 1000s of hrs interviews & story architecture), journal articles, blockchain research, and 1.5 years exp. in the Cardano/Catalyst communities.\nDarlington: 14+ yrs exp. in Software & Cloud Engineering, Blockchain development."}