{"id": 419779, "author": "heal2earn", "title": "MentalHealth = Wealth: heal2earn.io", "url": "https://cardano.ideascale.com/a/dtd/419779-48088", "category": 26595, "amount": 340000, "description": "Stressed? You are not alone - many people are facing Mental issues!\nAny Prevention??\nLong-lasting trend with crazy social impact costs: €600B in EU, $1000B globally in 2018.\nThen a catalyst arrived...", "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 6352, "q0": "This proposal wants to build a Mental Health DApp on Cardano, which will gamify healthy behavior and make people win double. It will improve their well-being and earn rewards in health tokens simultaneously. Thus, it will enable healthy preventive action before people start suffering. I think it is one of the impactful proposals as it is trying to incentivize healthy behavior among people. It will also add value to the Cardano ecosystem by bringing in new users via this DApp and increasing on-chain activity.\n\nThe health data collected by this DApp will be stored on Blockchain. If the users want to share and monetize their data for research, they can decide to do so. As mentioned by the proposer, the DApp will be able to scale to cover and educate the high demand of millions of people.\n\nRegarding the risks, the proposer stated several of them and provided their mitigation strategies. However, I am more concerned about the Development issues. The proposer indicated that they prepared epics and many stories for sprints and thus have plenty to develop. However, the proposal does not lay out details about these epics and stories. Hence there is room for improvement in the proposal.\n\nThe proposer is requesting a considerable amount of $340k and will again ask for $321k in the next fund. But how the proposer will gamify the healthy behavior is not revealed. Also, the budget break-up is not provided, which is inappropriate for any proposal, especially for a proposal with such a big budget.", "q0r": 4, "q1": "It looks like the proposer has a big team to carry out this proposal. Their details are stated, and LinkedIn profiles are shared for some members. Apart from this, the proposer collaborates with several organizations. Such as for issuing the NFTs, they will utilize Nft-maker. Considering these details, I think the team is competent to execute this proposal.\n\nThe proposer provided full details of the plan, divided into five phases. Each phase is to be completed in one quarter. Thus the timeframe is spread over five quarters which is more than a year. Therefore it does not seem realistic.\n\nThe proposer asked for a massive budget of $661k, $340K in this proposal & $321K in the next fund, which does not seem reasonable. Moreover, it is not broken up into identifiable tasks. It is just divided as per the phases of the proposal. It is not an ideal approach. I suggest the proposal provide a detailed technical plan as the 80% of funds will be used on that part, then estimate which roles need to work how many hours, and based on that, they can provide the budget per the identifiable tasks.\n\nAnyhow, I still think the proposer will likely execute the proposal, but they must provide these details about the budget, how they will gamify, and reasons for the extended timeframe.", "q1r": 4, "q2": "The proposer provided several metrics under two categories. The first category will help track the proposal's progress while under development, and the second category will assist in evaluating the project's success post-launch. But the proposer did not mention how these metrics will be made available to the auditors or community and on which platform the development status will be updated, such as GitHub, Jira board, etc.\n\nRegarding the delivery dates, the timeframe is stated only in quarters which is quite vague. I suggest the proposer mention the timeline at least in months, if not weeks. Then, it will be easier to follow the progress from the timeline perspective.\n\nAs mentioned above, the proposer did not state the budget with proper brake-up. This will make it harder to audit the proposal from the budget's perspective.\n\nAnyways, I think it is possible to audit this proposal's progress, but it still needs improvement in the areas mentioned above.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Valuable feedback, thank you.\nIn terms of details provided: We could (now: maybe should) had been providing many more details. However, we also did not want to overdo it, considering all the other applications which were submitted.\n\nHence yes, there are more details available \n- for epics and stories, in particular until the metaverse part (coaching related experiences based on match-making platform careoline.life, which has been running since a while).\n- for budget: there's a breakdown considering all the incentives for attracting great developers (self-reflection journeys, backend and frontend, community, coaching interaction, reviews, APIs, security, Marketing, G&A, R&D)\n- planning: you can put too much effort into planning - executing on stories in bi-weekly sprints is important "}, {"id": 9668, "q0": "This is an excellent suggestion because n ot everyone gets access to therapists either there aren't any nearby or they can't drive far enough. The Cardano Community will have a better chance of growing if blockchain technology is integrated and an environment welcoming to everyone suffering from mental health issues is created. The challenges could be overwhelming because the majority of them have a significant impact on the proposal. When the proposer notices mental health difficulties, which are problems that practically everyone has, he has a truly great idea that he can utilize to help create a healthy community and develop the community. A major plus is recognizing the dangers and challenges presented if this idea is started with the appropriate answer to reduce them. I only have one question:Will this app be user-friendly for those who are unfamiliar with blockchain?", "q0r": 5, "q1": "The road map is extremely thorough. From this, it appears that the project is operating, thus I applaud the team. But about the budget, I see o nly the sum of the budget allotment is made public. Given the size of the amount, I anticipate it to be more diverse. A precise budget table, in my opinion, will also help raise the chances of receiving the funds all at once. Members of the team have accumulated a very broad collection of talents and experience across a wide variety of fields. Because the team is large in comparison to other teams, the proposer should include a paragraph on certain highlighted members to demonstrate the team's ability.", "q1r": 4, "q2": "The proposal includes both short-term and long-term KPIs. Because this proposal is large, these milestones, in my opinion, should be presented in a way that allows the community to understand what the activities will be. For example, instead of saying \"Number of Defects, Number of Developers\" I would advise the team to specify what numbers would be. Instead of \"Community interactions\", please make it clear about what activities will be used and how many will be carried out? Overall in terms of metrics, I believe they are appropriate and I hope the team will be success.", "q2r": 4, "assessor": "z_assessor_3080", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12503, "q0": "The proponent has raised an issue of international interest and has evidenced by data from WHO and their proposal that could make a positive impact on the Cardano community as the topic of mental health is growing in popularity. Especially for developing countries, the appearance of Covid 19 is a reminder for mental health. Therefore, this can be a channel to bring new members to the community and increase the attachment to old members. \"Heal2earn\" may become the new trend however mental heal is not an easy thing to achieve, so proponents should detail how their project effectively or exclusively helps users achieve happiness more sophisticated than traditional methods. If they mentioned on the website they built, there should have an English version.", "q0r": 5, "q1": "The project implementation team are individuals with experience in their field, and the proponent also provides linkedin of the core group members, researched through linkedin information, I found the project's personnel can complete project like road map. It would be better if the proponent provided a breakdown of the 80% of ADA's budget that would be dedicated to dApp development and show the community that they would allocate it properly. The proposal has a detailed plan, activities are clearly stated on a quarterly basis, even they are already in the process of implementing the plan when providing both the activities to be implemented in the first and second quarters of 2022, for shows seriousness and determination towards the project.", "q1r": 4, "q2": "Proposing to provide short-, medium- and long-term KPI evaluation indicators and these indicators are suitable to evaluate the success of the project, hopefully the project team can provide relevant data to public KPIs so the community can track project progress. Also as mentioned, it would be better if they have a specific spending table that is updated weekly or monthly for the Catalyst community to monitor which will increase the transparency of the proposal.", "q2r": 4, "assessor": "z_assessor_3425", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 12759, "q0": "Mental health is a world wide problem. Mental illnesses are on the rise since decades and I know myself many people who have depression, anxiety and such illnesses. Thus there is a big demand for products which can better our mental health. The demand is also proven in the proposal by the cost of worldwide mental health issues by the WHO. \nThe dApp itself brings a new usecase to Cardano which targets hundreds of millions of people. Thus it could lead to a large number of new users. Therefore it matches the challenge strongly. ", "q0r": 5, "q1": "The concept looks good. The combination of Mental and physical health is important because there are many studies in academy journals that show that physical activity (a healthy body) also has a big impact on our mental health.\nThe team has linked some of their LinkedIn accounts. The linked teammembers have great CVs with relevant skills and experience. I am missing skills of the developers. Please provide some additional infos, your website looks good but I worry about the blockchain part. \nThe budget is stated roughly but in combination with the timeplan is understandable. You could have made this a bid easier by combining the two and referring the reader. But all in all it is understandable, looks reasonable but sometimes I am missing some details which make the whole a bit untransparent. \nThe timeplan overall looks very thought through and detailed. The team has split everything into quarters and described their actions in detail. \nAlso the team needs some additional funding to complete the application. They will come back in fund ten to get 321K $. It´s very transparent. \nOverall the project looks understandable and reasonable but I miss some little parts like the skills of the blockchain developer and some details in the budget. Therefore I remove one star. ", "q1r": 4, "q2": "The team has set many good KPIs and metrics in the short and the longterm. Every one of them is relevant and reasonable. \nThe success for this project is well described and it solves the problem from the beginning. \nOverall the are easy to audit because of the many KPIs and the clear success statement. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "Thanks a lot for the assessment.\nClearly read our proposal, happy you like the transparency. Though we agree that we could provide a budget plan in more detail - however as we know based on our experience, (budget) plans do change often."}, {"id": 14741, "q0": "\"Mental health is a common issue in the modern world nowadays. Especially after/during the pandemics, the number of people suffered from mental health issues is increasing. The demand for creating a platform that promoting mental healthcare is urgent. It was quite interesting that the proposers linked the crypto world with this healthcare section. \nSome interesting features of this platform are the “heal2earn” (earning rewards by participating in healthy habits), data monetizing (since the users own their data, they can sell it). However, I think the proposers should describe clearly what is the basis of healthcare care system that this platform uses to tackle mental health issue, for example meditation, or yoga. Moreover, as far as I know, there are quite many blockchain-based healthcare platform, so what makes this platform different from the others?\nNevertheless, the project success can gain great attraction of people to the Cardano community since mental health is the prevalence issue. The Cardano ecosystem may be boosted by the new users who want to participate in this healthcare section. Therefore, the offered solution is aligned with the challenge setting. \"", "q0r": 5, "q1": "The roadmap timeline, and several sub-task processes for each milestone were provided. It was good that the proposers provide the execution methods for these task processes, and also allocate the budget in accordance with the tasks. This clear information shows high feasibility of the project. Regarding to human resources, the core team comprises several individuals having backgrounds in business, blockchain, and (mental) healthcare. This is a strong team having proper skillsets for this project implementation.", "q1r": 4, "q2": "The quantities of KPIs/metrics were sufficient in my opinion, and the proposers also divide the goals in terms of short-term and long-term. However, I do not believe it is sufficient to just suggest KPIs/metrics; instead, to increase the project auditability, I advise the proposers to think about specifying the precise number of KPIs or metrics they want to achieve over a specified time period, as well as the techniques they will use to monitor them. For example, there will be 100 new community member per week, after the project is officially launched. Additionally, the project proposers should have a way to update the community on the project's status.", "q2r": 3, "assessor": "z_assessor_4098", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "BUIDLing an impact ecosystem: Incentivizing and Rewarding Mental Health via dApp:\n\nCaring Community\nHealthy-Fi Mental Health\nCreators courses (our Coaches) & 1:1 sessions\n\n& Health.Foundation DAO", "experience": "99+ years experience:\n\nEntrepreneurs with multi sector experience\nIT Experts\nCommunity Manager\nWeb & UX Designer\nSoftware Developers\nMKT, PR, Sales Experts\nGrowth Hacker Specialist\nAudio Visual Experts\nWEB3 Advisors\nNFT Artist & Advisors\n150+ Creators (Wellbeing creators)\n"}