{"id": 419782, "author": "pipaw", "title": "Optim Finance - Liquidity Bonds", "url": "https://cardano.ideascale.com/a/dtd/419782-48088", "category": 26595, "amount": 121000, "description": "Cardano struggles to properly support small SPOs. Optim’s Liquidity Bond Market addresses this by allowing anyone to borrow and lend ADA delegation. While near complete, a few milestones remain.", "f6_no_assessments": 6, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2847, "q0": "saw a decrease in operating costs for a small group of new and small SPO holders, and this is also a possible reason for Cardano to lose its status as a leading decentralized platform. The more SPOs, the more decentralized, so the proposed team committed to provide a financial solution aimed at supporting the target groups that are new and small SPOs. so based on the rationale and commitment of this proposal, it's completely up to the challenge.\n\nThe main purpose of the proposed group is to provide a bond service for SPOs, that is, groups of shares with a small number of ADA shares that do not have enough shares to ensure that Block closing is consistent with each epoch. use smart contracts to borrow the trusts of the stake pool provided by the proposed service. this is great as I am an SPO owner myself but the ADA salary is not enough to guarantee ongoing rewards, so the operating expenses will not be enough income to cover, so If this proposal is successful it will be a way of important opening up for targeted SPOs. at the same time the arguments and examples given are reasonable.\n* however following the proposal's documentation I would like to have a few questions to elaborate on and to better understand the lending mechanisms offered by the proposed team.\n- If I need to borrow a group of shares, how much do I need to borrow to ensure that the number of ADA trusts in my SPO will be minted continuously?\n- And if I borrow, how much interest do I have to pay for the interest and how is it calculated? Thank you so much for this great idea.\nThe team is committed to controlling possible risks with smart contracts, because the core team has in-depth experience in Plutus, in addition, the theoretical solutions have been given to the community of SPOs. new and small test. Based on the reasons and solutions raised by the team, this proposal will have an impact on Cardano's own decentralization, and support for new and small SPOs.", "q0r": 5, "q1": "The reason why the proposed team did not publish the roadmap is because everything has been completed and only the last step to start the integration is: Professional Security Audit, and Liquidity Bond Grant to our initial participants, in addition the team commits that after going through this review phase it will kick off with an initial SPO team and consider this a major milestone for this proposal.\nexpenses are disclosed and explained in detail by the team, all expenses are consistent with technical checks and audits performed by MLabs.\nThe core team was determined to have two members and all relevant information was provided in full, such as identity of relevant experience and tasks undertaken to implement this proposal. Through commitments and published documents I fully agree with the feasibility of the proposal.", "q1r": 5, "q2": "The measurement indicators to serve as a basis for monitoring the activities of the proposal, are clearly announced, however, to ensure absolute confidence of the community, the proposed team should have annotations attached to the indicators. this issue, either a statement that will assist the community to be able to track these metrics on some of the most easily accessible popular platforms, or periodic reporting would be best for ensuring transparency guarantee,\n Indicators of success were identified by the team for the three most important goals:\n- secure a decentralized position for Cardano,\n-The vibrant ecosystem, and especially the small SPO groups will benefit greatly, for survival with operating costs.\n- DEFI experience for the target audience.\nso despite the lack of statements to support the measurement, that factor will not have much of an impact on the success of this proposal, but can only give 4 points for this transparency of the proposal.", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 2890, "q0": "The proposal clearly and objectively describes the pain points with maintaining and growing measures of decentralization, and offers the community a novel, decentralized, and financial solution that can have a huge impact on the competitiveness of small stake pool operators by enhancing their ability to scale in a way that is sustainable. \n\nAs a delegator, I find it hard and too time-consuming to scrutinize the integrity of certain small SPO models/approaches, and therefore become a bit hesitant to delegate with these smaller pools as the risks may outweigh the rewards. This is in spite of the fact that I know the importance with respect to decentralization. The prosper’s solution removes those risks for delegators, and removes the need to scrutinize the SPO models, as the operators themselves are willing to absorb those risks. \n", "q0r": 5, "q1": "I feel confident that the project plans and budget supplied is feasible to deliver. To start, the proposer has communicated that they have already developed approximately 2,000 lines of code that are readied for auditors. This is encouraging, as it means that the proposer has committed human resources towards delivering on the project, and that can be excluded from our assessment. The proposer does not provide direct evidence of the relevant skills of the two auditors they intend to contract with, however these entities. Furthermore, the budget is outlined clearly and broken down into identifiable terms, all that seem reasonable to achieve the goals of the project. The timeframe to complete the project seems reasonable, but even with slight delays on the auditing track, I have every reason to expect that this project will be ready for the community within six months. \n \nWith that said, the proposer could have made reference to the potential need to remediate some of the audited 2,000 lines of code, and explained whether that would be handled by their internal developers, or by one of the auditing entities (e.g., MLabs). To factor in these potential, additional tasks are actually a conversative approach to project management, and shows due diligence given to the proposal design.  \n", "q1r": 4, "q2": "There is clarity in the description of the problem, the solution and how the proposal is aligned with them. The roadmap is very intuitive, there are straightforward deliverables that make tracking the progress possible, and the proposer has committed to updating the community on the TWEAG and MLABs audit reports. Additionally, the community of course will have the chance to participate and support the application once it is readied for launch.  \n\n”The metrics and KPIs are adequate and I believe they are appropriate indicators for evaluating success. However, I do think that the proposer should have included some measures of decentralization against the benchmark (pre-launch of the application) given that this is the overarching goal of the proposal (to augment decentralization of stake pool operations. \n", "q2r": 4, "assessor": "z_assessor_2358", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 4687, "q0": "This proposal responds to the challenge's setting, where Cardano's struggle to properly support small SPOs is the problem of this challenge. This proposal expands the scope of Optim's liquid bond market challenge by allowing anyone to borrow and lend as authorized by the ADA. The solution to the challenge is that it can solve the above problems, liquid bonds are a new Defi tool that allows anyone to lend + borrow ADA authorization. This proposal poses an obvious problem regarding the challenge criteria, of which its solution is to research the expansion of the Cardano network, which if funded could provide a good impact on the community. Cardano helps the community to grow stronger day by day.", "q0r": 5, "q1": "The author provides a detailed plan, including the progress and milestones of the audit time that is highly dependent on the audit firm and detected security issues. The success of this project is related to the inspection that has been completed, only then will the defects be discovered and it will be repaired and resolved promptly. The solution to this problem is that the payment bond provides valuable use cases, benefits many people in the community helps more people participate in the market, and also benefits the network. powerful for Cardano.", "q1r": 5, "q2": "The measures of the proposal are detailed by the author: our audit results include the number of discovered security holes and the number of SPOs participating in our market, the number of bonds sold, initial interest in our platform, media coverage, and the general response of the Cardano community. The team consists of two main members: Maksymilian Brodowicz is a technical leader who is a mathematician and a computer scientist, a HoTT enthusiast, and Ethan Protas serves as a product leader with experience in the fields of technology. business and execution, his Cardano journey began as Chief Operations Officer at Minswap in April 2021. They are experienced financial professionals and entrepreneurs I believe with the experience they will do well in the challenge they have posed. The proposed funding budget of $121,000 is budgeted by the author in small increments and is consistent with the amounts that need to be spent.", "q2r": 5, "assessor": "z_assessor_2608", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5179, "q0": "The proposal wants to launch a Liquidity Bond Market, a DeFi instrument that allows users to lend + borrow ADA delegation. In doing so they need to incentives new participants by offering Liquidity Bond subsidies, and professional security audits. Because the proposal's purpose is simple, the proposal is written concisely but still complete in giving any crucial information. As the proposal wants audits from reputable firms, the risk of the audit itself is very low. However, as stated in the proposal, the risk reminds in if serious vulnerabilities discover. But the engineering team has extensive experience and even if it happens, it can be handled. Which made the chance of project failure very low.", "q0r": 5, "q1": "As the proposal's purpose is to audit from 3rd party, it's clear there aren’t any detailed milestones or timelines. With an estimation of around 5 weeks to complete the audit based on codebase size. There is budget usage information, even though the budget is not broken down in detail, it's understandable because they use third-party auditors and the Liquidity Bond Subsidies are straightforward. The proposal provides concise information on Optim's finance background. The proposers give detailed information on the experience, past projects, and relevant skills of each core team member. On top of that, they also attached a LinkedIn/Github account, thus the community can know the team has the ability needed to implement the project.", "q1r": 5, "q2": "There are various metrics used to track the project progress, with all of them being quantifiable. The defined success is straightforward with a completed audit with discovered vulnerabilities (and resolve them if found). They also provide 3 measurable points used as goals of the project, decentralization, vibrant ecosystem, and Defi experience. However, I also suggest adding an exact number from the metrics stated above as one of the goals, so the success of the project can be objectively determined. Such as more than 50 SPOs participating, at least 10 vulnerabilities discovered (and resolved), etc.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 6438, "q0": "We are currently in a severe bear market in the crypto space and a lot of community members have been struggling. This includes SPOs on the Cardano blockchain. The proposal states that there have been 209 single stake pools that have retired during this time. The team at Optim finance plans to create a product called liquidity bonds that will help support smaller and upcoming SPOs on Cardano. This will address the current challenge of properly supporting small SPOs. This is an important subject because single stake pool operators are extremely important to the decentralization aspect of Cardano. It helps it to remain one of the most decentralized blockchain networks and allows for more people to play a part in the ecosystem. For these reasons, I give this section of the proposal 5 stars. It will likely bring a lot of utility to all Cardano members and as stated before, it will help support the idea of decentralization on the blockchain. This could lead to a positive global impact in the upcoming years.", "q0r": 5, "q1": "The proposal includes specific information on each individual team member. This is important to note because the team could have easily decided to provide information by stating that they are Optim Labs and so they should be accountable enough. This team took it one more step and suggested that they would include their identity as well. I mention this because it is a positive indicator that the team is willing to be held accountable to this proposal and suggests the likelihood of this proposal being implemented successfully. The proposal includes a very detailed description of the roadmap for this project. It gives details on what the team has completed and suggests all of the specific steps the team will include in order to bring about these liquidity bonds. They also include a detailed budget breakdown that describes exactly where the requested funds will be allocated. In these details it gives information the requested funding would mainly be given to help fund their auditing process. They will receive a security audit from the Tweag team and will have it looked over by Mlabs. Some of the biggest names in the Haskell and Plutus based developers. For these reasons, I give this section of the proposal 5 stars. There is a lot of experience included and the plan likey suggests that this proposal will be implemented successfully and ultimately will bring an important utility to Cardano members and small SPOs. ", "q1r": 5, "q2": "As stated above. There is a lot of information included in this proposal. The team does a great job at including their information. This highlights their experience and accomplishments. They have also informed their community on this proposal which brings the element of accountability into the picture. There are specific dates of completion and give details on how they plan to carry-out their liquidity bonds. Given that the team is transparent with their community, it suggests that the proposal will likely be successful if the community holds them accountable to their promises. Trust needs to be established between the team and community and they have already taken these steps to confirm this. For these reasons, I give this section 5 out of 5 stars. All of the information provided makes it easier to audit the success of this proposal. The community should be able to play a big part in helping the team to be successful. This is because the proposal could potentially benefit specific people in their community and will lead them to be excited for the outcome of their proposed idea. It is a great idea and will bring utility to the Cardano blockchain. ", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7662, "q0": "This proposal offers a novel product offering and addresses issues that are well known to the community. If implemented as described, this project could bolster decentralization of Cardano by supporting small SPOs, increase innovation on the blockchain by supporting startup dApps, and bolster Cardano DeFi.\nThis challenge references impactful innovations that \"help drive more adoption.\"  For the reasons above, I rated this proposal as 5 stars for impact.", "q0r": 5, "q1": "The team acknowledges some risks for this proposal including the discovery of significant risks in their coding on audit.  This would pose a challenge to the delivery of this product in a timely manner.  It does seem unlikely that this will occur.\nThe team delivered a thorough proposal with an understandable timeline and budget.  \nTeam bios reveal relevant experience in software development generally and on blockchain and Cardano in particular.  The fact that the team has gotten this far already supports the idea that they can complete the proposal as described.  \nI appreciated the links provided in the proposal to give additional details.  The deliverables for this proposal include a security audit and mitigation as well as subsidies for their bonds at launch.", "q1r": 5, "q2": "The deliverables will be easily audited for the proposal.  It simply includes the security audit by a well known firm, mitigation of the findings and delivery of subsidies for the initial bond offering.  The community can easily track and audit these in the provided social channels.\nIn addition, the team is tracking KPIs like number of SPOs involved, bonds sold, interest in the platform, etc to monitor the overall impact of this project.", "q2r": 5, "assessor": "z_assessor_2911", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Liquidity Bonds are a novel DeFi instrument that allows anyone to lend + borrow ADA delegation.SPO Bonds allow SPOs to borrow delegation to bootstrap pools, mint blocks consistently, prove competence", "experience": "The Optim team includes Advanced Haskell/Plutus engineers experienced in building and shipping DeFi dApps, finance experts, and experienced entrepreneurs.\nTeam has built and shipped production Cardano dApps:\nTeam members formerly of Minswap, Seabug, and IOHK contractors"}