{"id": 419840, "author": "nmelon", "title": "Growing Cardano Global Presence", "url": "https://cardano.ideascale.com/a/dtd/419840-48088", "category": 26595, "amount": 25000, "description": "Cardano is heavily under radar and not supported by many of the well-known analytics brands such as CryptoSlam, Bubble Maps, icy.tools etc. due to that Cardano is losing potentially millions of eyes.", "f6_no_assessments": 12, "f6_rating": 1.916666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 165, "q0": "The problem presented has been discussed on Cardano's social media assiduously in recent months, Cardano's NFT ecosystem has increased, but several analytics websites take time to include projects developed on Cardano, this reduces the visibility that NFT projects could have. This problem is within the context of this challenge setting.\n\nAlthough the problem is clear, there is no clarity on how the team will solve it, it would be important to go into more detail about the plan so that it is possible to understand the impact of the proposal for Cardano and for the NFTS ecosystem.\n\nNo metrics or KPIs were established that could indicate the potential impact of this proposal.", "q0r": 2, "q1": "The proposal included a link to the website, but I didn't find any information about who are the people developing the project, repositories or team experience.\n\nI've been following CNFT Jungle for a few months and I already knew the work developed by the team, but we can't even be sure that the people who submitted this proposal really are part of the CNFT Jungle team. I would recommend including more details about the team's experience, if possible links to Linkedin and repositories.\n\nThere is no articulated and detailed plan of what will be developed, timeline, milestones or budget breakdown.\n\nMaybe the proposer forgot to update this proposal because too much information is missing.\n\nI would recommend that the proposer watch tutorials and workshops on the Catalyst School YouTube channel to rewrite the proposal.", "q1r": 2, "q2": "There are no metrics/KPIs, roadmap and milestones, so there is no way to audit this proposal over time.\n\nAlthough the problem is understandable, there is no clear solution.\n\nThe CNFT Jungle project is popular in Cardano's NFT community and they already have a website containing various data about NFTs, this helps to audit the project, but it is insufficient.", "q2r": 2, "assessor": "z_assessor_2048", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 897, "q0": "The proposer cnftjungle.io does add value to the eco-system already. By asking other NFT specific aggregators that haven't yet included Cardano in the statistics is vital for global exposure. This proposal does trend with the challenge setting and will allow the Cardano NFT space to scale faster due to more air-time to people who other wise wouldn't have considered Cardano to launch or buy NFT's on.", "q0r": 3, "q1": "The team is very much aligned with the proposal objective as cnftjungle.io is already up and running and highly used. There is currently no plan(sufficiently detailed) or timeframe that is listed in this proposal. Budget is also severely lacking any details of how the funds will be distributed. The risks that are listed are more like the problem that has to be solved and this could be thought about about at a higher level in my opinion. Hard to assess likelihood of success when details are lacking.", "q1r": 1, "q2": "Currently there is no way for the community to audit or track progress in onboarding of other entities. This proposal in deficient in relevant detail for the amount of funds they are asking for. Proposer must include more information on the feasibility and auditability in order for the use of treasury funds to be warranted in my opinion.  ", "q2r": 1, "assessor": "z_assessor_2148", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 1948, "q0": "The NFT market is growing and has become a great place to on-board new members to the crypto ecospace. We need to make Cardano stay relevant in the future as well, and by introducing new members to Cardano early on, we have a great chance of succeeding with that goal. This proposal aims to increase the reach of Cardano by including it in NFT related projects. This is impactful since it will increase the traction of the Cardano ecosystem. Judging by the challenge setting present in fund 9, the “Dapps, Products & Integrations” challenge is the best suited. As a result, this proposal receives a score of 5 stars in terms of impact.", "q0r": 5, "q1": "It is somewhat unclear what the proposer is asking compensation for. It is stated that Cardano is not supported by “CryptoSlam, Bubble Maps, icy.tools etc”. But in another section it is stated that they have already reached out to the previously mentioned projects. It should be further explained if this proposal seeks to gain compensation for already performed work or what the funding model looks like. \nFurthermore, a sum of 25.000 USD is claimed as their budget but nothing can back up this to be evaluated as a fair compensation for the amount of work required.\nA roadmap and detailed plan should outline how many projects you minted to reach out to/on-board. It should also state how many hours will be dedicated to this and what the hourly rate is. At the moment it is impossible to tell if the budget is realistic or not. \nSince no plan, budget or evidence is provided, the proposal is unfortunately rated poor in terms of feasibility in its current state. The proposers are encouraged to address the above mentioned points in the future. Score given: 2 points.", "q1r": 2, "q2": "The proposal is hard to audit by the community in its current state unfortunately. In order to make this process easier the following should be provided.\nClear KPIs to measure the progress and goal of the project. A definition of success that is measurable and can be evaluated. A roadmap with milestones and a timetable. A channel to provide updates about the project's progress.\nNeither of these are present in the proposal, this makes it hard to audit. It is recommended to add these in the future to gain a greater score. The score in terms of auditability will be 2 points.", "q2r": 2, "assessor": "z_assessor_2290", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2092, "q0": "Unfortunately, the proposal is poorly explained, the proponent only gives us a general idea of ​​his project, without the necessary details so that we can understand what he is saying. How the proposal will be implemented and what impact will this have on the Cardano Ecosystem. The problem raised by this proposal is that Cardano is under a lot of control and is not supported by many well-known analytics brands like CryptoSlam, Bubble Maps, and icy. tools, etc. thus Cardano is likely to lose millions of eyes and the cnftjungle.io team is looking for ways and applications inspired and approached by other ecosystems to bring the best utility and awareness to Cardano. The problem and solution statement look a bit fuzzy in its information, it doesn't provide a clear idea of ​​how this would be changed if so and what value it would provide for the Cardano ecosystem. In my view, this proposal is more like an idea than a complete proposal, because all the details it provides are of little value, so I think the proponent should return to fund 10 with a more well-presented proposal.", "q0r": 1, "q1": "There is a problem that even though the solution description fits the challenge, the concept of the proposal is reasonable, but the absence of a blueprint greatly affects the testability of the proposal. The proponent did not provide any roadmap to follow, so it is impossible to understand what steps would have to be completed to complete the project. It just says that the plan is to reach out to as many respected brands as possible and help them integrate Cardano. However, this does not tell us what will be done, what will happen next, and how long it will take for everything to be ready. This proposal did not provide enough information to help audit the progress of the plan, was very sketchy, contained only one line, and did not include information on the roadmap, timelines, or timelines to be achieved. desired results.\nThe budget division is also not justified. The proposal asks for $25,000 for the project but without any details to break the budget, which will certainly not be accepted by the community as it cannot be audited.\nNo team information has been released. The only thing this program offers is the group cnftjungle.io which includes a link to the group's website. But who are they? We will need to know each team member, name, role, relationship to Cardano Blockchain, etc. The more detailed the better, unfortunately, we don't have any details here. For the reasons above, I disagree that this proposal will be successful.", "q1r": 1, "q2": "Proposals cannot be audited based on the information provided. The proponent said that \"We hope to do as many projects as we can, so each new project that supports Cardano is a step forward for the Cardano ecosystem.\" Since the proposal has no roadmap, plan, or goal, we don't know how to check the progress. As mentioned before, this proposal would benefit from having a roadmap with milestones on an estimated timeframe. This way it can be tested transparently and the community will be able to track progress during development. I wanted this proposal to provide KPIs so that the community could easily check the progress of the project, as well as the detailed allotted budget. In this proposal, there is no detailed experience of the proponent, lacking all the basic components of the proposal such as roadmap, detailed scope, metrics, budget, etc. For the reasons just described, I strongly disagree that this recommendation provides me with sufficient information about the ability to measure progress in achieving stated goals.", "q2r": 1, "assessor": "z_assessor_2299", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3637, "q0": "The proposal is not very well formed and it’s hard to understand the problem statement and their proposed solution. It seems the team has built a website called cnftjungle(.)io to keep track of Cardano NFTs. In the proposed solution section they claim to have reached out to 10-20 (that’s a 50% deviation by the way) projects to help include Cardano, unfortunately this is not a solution worthy of being presented in “Dapps, products & integrations” challenge since they are not proposing to build anything. ", "q0r": 1, "q1": "The team didn’t provide any valuable information regarding who is actually going to work on this proposal. They don’t provide any clear description of how the amount of funds requested came to be or how they will be spent. When describing the timeline and key milestones they just mention “Plan is to reach out to as many respected brands as possible and help them integrate Cardano”. Which brands? Help them integrate Cardano how? Which skills are needed for that? How much time is going to take? Which are the risks? None of this question are answered in the proposal.", "q1r": 1, "q2": "The proposal didn’t present any auditability information, the team just “hopes” to onboard as many projects as they can. No KPIs are provided, no website where the community can keep track of the progress and no clear guidelines or objectives are provided. Funding this proposal would present a huge risk for the community since no thought or consideration was put into this project by the team. ", "q2r": 1, "assessor": "z_assessor_2465", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3997, "q0": "From what I understand of the information available, this proposals goal is to develop and expand on the utilities of cnftjungle.io. According to the proposer, Cardano is not widely supported by analytics firms (due to it being ‘under radar’), so the proposed solution is to increase collaboration with a variety of other projects (Cryptoslam, Bubble maps, etc). In my experience as a recurring PA (since Fund 6), I believe that the problem statement and the solution could be made a little bit clearer. For example asking ourselves questions similar to this: What does the proposer mean when addressing that Cardano is ‘under the radar’? Do they mean upcoming regulation? What is meant by ‘utilities’ (what tools will be part of the solution? Brief explanations on why these tools are needed and what potential effect they will have)? Increasing collaborations, support and thereby adoption makes sense and is easy to understand, but we need to know more on ‘how’ and ‘what’ will happen on the way. \n\nI might be misinterpreting, but I found it hard to know if the proposer aims to bring tools and utilities to cnftjungle, or if they want to create a marketing/collaboration campaign imploring other projects to add Cardano. I would love to have seen a clarification on this (if I misinterpreted, I stand corrected), since it addresses the challenge in different ways. \n\nThere is a risk mentioned that analytics platforms aren’t prioritizing Cardano at the moment, which might be true. It would benefit the proposal if it would have included some foundation to these statements. It would also be preferable to list some thoughts regarding the future sustainability, or if the proposer will need to return to Catalyst consecutively in order to manage an expand on the project. \n\nDue to the reasons listed above in the rationale, I disagree that this proposal effectively addresses the challenge. ", "q0r": 2, "q1": "In regards to assessing the overall feasibility of this proposal I would suggest to include a lot more details under each topic. The voters need to know how likely it is that this project will be developed into completion, and needs to have information on that. I would suggest adding: \n\nRoadmap: What are we going to do, when are we going to do it? Let’s say that this proposal is focused on a timeframe of 6 months, divided in 3 different phases of 2 months each. First two months will focus on outreach to different projects, working on utilities on the official website. Also doing analysis of incoming data. Phase 2 will keep working on outreach and have previously mentioned utilities released on the platform, and plan for an upcoming event Phase 3 will host an event to bring more collaborators together in a hackathon-like way. (Just an example for a super simple roadmap). \u2028\u2028Budget breakdown: The money estimated to be needed for this proposal is 25 000 USD, but we need to know how these will be allocated. How many estimated working hours (hourly wage?) for each responsibility area and team member? Will a developer have the same wage as the project manager, and will their workload be the same? Will phase 3 require more resources than phase 2, why? \u2028\u2028Team: There is an official website listed but no information given on any team member. I would suggest to include linkedIn-profiles, social media channels etc so that the community could access some way to validate proof of person, education and the expertise needed to implement this proposal. I couldn’t find information of the team members on the official website, but maybe that is just me being bad at navigating the website. \n\u2028It would also beneficial the proposal greatly if it would include some information on the other 4 projects submitted for Fund 9, and how it would affect this proposal if all 5 proposals were to be funded. Will the team be ready to take on 5 proposals during the same timeframe, and how do they plan to manage it? \n\nConsidering the lack of information included in the proposal, I disagree that it is highly likely that this proposal will be implemented successfully. The fact that the team has created cnftjungle.io speaks very well for the teams competency and dedication to the Cardano ecosystem, but this should also be reflected in the proposal, which it currently doesn’t. ", "q1r": 2, "q2": "The proposer mentions that they will track the development progress by measuring the number of projects onboarded, which makes sense. One further expansion on that could be to measure the impact of each onboarded project, short and long term. For example, has the website traffic increased after onboarding a specific project? And in connection with the roadmap, what is our expected target numbers of website traffic, projects onboarded, etc. \u2028As I mentioned under ‘feasibility’, there is not much information included in regards to the level of auditability of this proposal. It is vital to include spaces where the community can follow the development progress and communicate with the team members, especially if the team welcomes feedback from the community. I’m assuming that there are some social media channels managed by cnftjungle, but these are sadly not listed in the proposal. But then again, my role as a PA is to assess the quality of the proposal, and not what is assumed to be understood by the reader. The details related to the communication and transparency of this project would increase the quality of this proposal, greatly. \u2028Conclusively, I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 2, "assessor": "z_assessor_2504", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 5494, "q0": "There is no denying the proposal's potential to have a significant influence on Cardano. Adding well-known players to the chain will undoubtedly accelerate progress and boost uptake and quality over time. The NFT value would rise, and the current apps would work harder to outperform their rivals. There isn't any further reliable and practical information available for the readers, besides the justification they can come up with for themselves after reading the problem statement and solution. The team puts very little effort into identifying the major dangers involved and does not give a detailed explanation of what exactly they are attempting to achieve in their solution to enhance Cardano's value. There doesn't appear to be any common benchmark or provision included in the team's manual procedure of contacting the projects and apps across various chains. Therefore, even if the concept was original and eye-catching, a tiny bit more attention to detail would have been appreciated.", "q0r": 4, "q1": "The proposal is kept brief by the proposer, making it a little challenging for readers and the community to comprehend how the team wants to approach the challenge. There are no specific deliverables that the team has mentioned. The amount of money requested is substantial, and it cannot be justified unless the proposer gives a thorough breakdown of how and where the money will be used. Additionally, the proposer gives the community no consideration when it comes to learning more about the makeup of the team assigned to work on this concept, and there is no practical way to evaluate the team's qualifications and expertise. However, assuming the authenticity of the proposal, the cnftjungle.io team is expected to be working on this proposal, providing a little bit of a breather to it. The community has to be cautious about the proposal's possibilities of being implemented successfully in the absence of a defined action plan and team.", "q1r": 3, "q2": "Nobody can really follow where the proposal is going because there are so many details that are missing. Lack of information on earlier background study and groundwork does little to increase the credibility of the idea. Additionally, the auditors' ability to apply success definitions and KPIs is limited, which increases the likelihood that the auditing process will be laborious and complicated. The proposal's successful outcomes appear extremely weak and do not correspond to any of the challenge's requirements. Since the current manifesto doesn't support their passion or their objectives, I advise the user to go back to their meeting rooms and make a concrete plan before returning with a better one in the next rounds. To underline the comments made in the feasibility metrics, cnftjungle.io has been significantly improving Cardano for some time, and as they are not a new team, the community may find it simple to follow their progress. However, the idea is suffering from a lack of depth, thus I'll have to settle for a score of just 2 out of 5.", "q2r": 2, "assessor": "z_assessor_2704", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5729, "q0": "While I agree that Cardano is heavily under the radar, and we need to promote the use of Cardano on different platforms, I do not think this proposal directly addresses this challenge - which primarily focuses on Cardano's integration into apps and solutions.", "q0r": 3, "q1": "The team claims in the proposal that they have done several projects inviting different platforms to integrate Cardano; however, the proposal does not mention the experience and data supporting the funding for this proposal. Moreover, although they say that they have made several attempts to invite more platforms to use Cardano, I noted that mentioned platforms have not yet used Cardano in their internal systems. I am not a fan of the direct sale method, which this project is prompting to do, because this method requires lots of effort and resources, yet most of the time, the direct sale does not bring fruitful results.", "q1r": 2, "q2": "This proposal is very short and not exactly well-thought-out. Most of the important parts are briefly explained, like the profile of project members of the budget breakdowns. In my perception, these parts are of prime importance to measure and predict the success of this project. Hence, I do not think the proposal provides enough insights for me to assess it.", "q2r": 2, "assessor": "z_assessor_2741", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7905, "q0": "One could see that being listed on more platforms can bring more eyes to the Cardano ecosystem. More eyes can certainly add value to the Cardano ecosystem but unfortunately the proposer does not do a good job of explaining how this will be done with this proposal. Most Cardano users do not store their ADA on the Metamask wallet which is the prominent wallet the two targeted platforms are using. The only to way add ADA to Metamaks is through a Binance-Peg ADA.token, which can be seen here : https://bscscan.com/token/0x3ee2200efb3400fabb9aacf31297cbdd1d435d47. Also note that this is not actual ADA that exists on the Cardano blockchain as explained in this article here : https://support.ledger.com/hc/en-us/articles/4405254279953--Is-the-Binance-Peg-Cardano-Token-ADA-the-same-as-the-Cardano-ADA-coin-?support=true. This however will drive the community more to the Ethereum world which is in conflict with the objective for this challenge. ", "q0r": 1, "q1": "The url link points to one of the largest NFT databases for the Cardano ecosystem. https://cnftjungle.io/ has a good user experience and the largest CNFT marketplace , https://www.jpg.store/ , uses CNFT Jungle to obtain their data. \n\nNo timetable was provided so the reader does not know when the project will start or finish. \n\nThere is absolutely no budget outlined in this proposal. It merely states that the funds will be used to “compensate our time and monetary investment”. This is very discouraging and shows the lack of effort that was put in this section. The proposer needs to indicate for what the 25k will be used for line by line. It is near impossible to get any financial backing from anyone or institution if they don't know what that money would be used for. ", "q1r": 1, "q2": "The metrics that would define the success for this proposal was described in a vague way. No clear indication of whether these “analytics/aggregation brands to support Cardano” will be just displaying CNFTs analytics or allow for buying and selling them as well.  \n\nThere is no roadmap and the proposer failed to provide any way for the community to audit this project. The team has a discord server and could have a separate channel just for this proposal and use it to provide regular updates to the community. The team has a popular website, and they have experience in data analytics. So they could easily set up a separate page on the website displaying a dashboard for the progress of the project. ", "q2r": 1, "assessor": "z_assessor_2935", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9041, "q0": "The goal of this proposal is to reach out to large analytics platforms, creators, and other utilities in order to develop the Cardano ecosystem. The impact of this proposal is questionable. While it could have a large impact on developing the Cardano ecosystem, this proposal does not do a good job of meeting the challenge goals. This would be better suited in an Outreach oriented challenge, but there are no active Outreach challenges in this fun. Ideally this would be edited and supplemented and resubmitted to an Outreach challenge in fund 10. Another issue with impact is that this proposal does not seem to  have a detailed enough understanding of the risks associated. There are risks that are part of this aside from Cardano being low on the priority list. For example the team may not have contact information or ways to get ahold of the decision-makers at some of these utilities. Another potential risk is that this team may not have sufficient time to make all the connections necessary to maximize the effectiveness of this proposal. Again if this team were to improve and resubmit this  proposal in a future fund, I could see the impact being much higher.", "q0r": 3, "q1": "Given the details in this proposal I do not believe this will be feasible. The question asking for a detailed plan only provides the answer of reaching out to as many respected brands as possible and helping them integrate cardano. This is vague, there are no steps taken that can be measured, and this does not have enough detail to be able to see it becoming feasible. The budget is just as vague. There is no detail given to how the funds will be spent, the hourly rate being paid, or the total number of hours estimated for the completion of this proposal. The team is equally vague. The only information given about the team is that it will be the cnftjungle.io team. But when you go to the cnftjungle.io  there is no obvious location to find teen information. So all this team has developed the cnftjungle website, there is no clear indication they are capable of following through on their proposal. ", "q1r": 1, "q2": "The same lack of detail that plagued the rest of this proposal plagues the clarity and the auditability. There are no clear metrics for success, just as there are no details or milestones for completion in the timeline. The goal is not entirely clear even though it is stated. The goal is vague in that it uses the word support. What does it mean for brands to support cardano?  This is a fairly major question that is not answered in this proposal. Another question is how does the proposal team intend to maintain transparency with the catalyst community. There's no indication of public updates or reporting on the status of this proposal. There are no metrics for success or measurement of progress completing the timeline. there was also not a clear timeline or detail of work in order to follow up with. Overall the core idea of this proposal is solid, but it would need a lot more work to earn top marks. ", "q2r": 1, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11253, "q0": "The team, cnftjungle.io has been one of the go-to websites in regards to the CNFT space and they have added many utilities to their site throughout the start. The team plans to continue bringing the best utilities and awareness to Cardano in regard to the NFT space and reach out to various projects asking them to include Cardano such as CarytpSlam, rarity.tools, Bubble Maps, and more. Thus, this proposal does address the challenge. ", "q0r": 4, "q1": "In regards to experience, the cngtjunle.io team has made much progress throughout its inception and it is believed that they can continue to give amazing utilities to the community. One of which is a CNFT sniping tool that highest users on red hot sales that are happening. However, their plan is too short and lacks a lot of details. It is disappointing that there is nothing more in the plan than informing us that they plan to reach out to as many respected brands as possible and help them integrate Cardano. \nThus, even though the team is experienced and capable but the plan itself is too dry and leaves much more to be desired. ", "q1r": 2, "q2": "The means provided by the team to assess the progress and success of the proposal leaves more to be desired. For the progress the team mentioned new projects that support Cardano but what kind of support are they referring to? As for the success that all the analytics/aggregation brands will support Cardano. Expecting all of those brands to support Cardano seems to be too big of a goal that is too hard to achieve. If the team can give better metrics to assess the success then it would be much better. For instance, the adding utilizes that make their website stand out, the number of partnerships with brands, and many more. ", "q2r": 2, "assessor": "z_assessor_3233", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14050, "q0": "This proposal aims to integrate different projects to the NFT database they built on the Cardano platform. While the successful integration of as many projects/companies as possible will undoubtedly drive more adoption of the Cardano ecosystem, the proposal doesn’t clearly show how it will add value to the ecosystem. Nothing is also mentioned about KPIs or the potential of the project to be scaled to address future challenges.", "q0r": 3, "q1": "There is no clear timeline or budget breakdown provided in this proposal. It is very hard to determine if the proposal is feasible or not from the information provided. The team previously built cnftjungle.io which according to the proposal is the largest NFT database on Cardano. But nothing else is mentioned about the team members or their relevant experience to carry out the proposal successfully.", "q1r": 1, "q2": "The proposal mentions they ‘hope to onboard as many projects’ as they can, but this is a very vague statement that doesn’t provide any milestones or a time frame that can be used to track the progress. \n", "q2r": 1, "assessor": "z_assessor_3879", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "cnftjungle.io team constantly looks for ways and apps to be inspired from and reach out to from other ecosystems to bring best utilities and awareness to Cardano, however it costs us time and money", "experience": "We had built and maintained that largest NFT database on Cardano: cnftjungle.io"}