{"id": 420194, "author": "bsandmann", "title": "PRISM credentials for the web", "url": "https://cardano.ideascale.com/a/dtd/420194-48088", "category": 26595, "amount": 49600, "description": "Distinguishing trustworthy websites and projects from shady ones is a challenge — especially in crypto. We need some way to share our credentials and endorsements on the web and make them verifiable.", "f6_no_assessments": 5, "f6_rating": 4.800000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 4200, "q0": "The PRISM credentials for the web proposal addresses the Dapps, Products & Integration Challenge by building a toolkit to embed verifiable credentials into your website. The project is based on Atala PRISM and uses DIDs to identify both the identity of the Issuer and the Holder.  It is a web service that periodically check statements (JavaScript Code). The statements signed by issuer is available as a Verified Credential on Cardano blockchain. Clicking on the statement, the visitor can trace the statement cryptographically and verify its authenticity. It is also possible for the revocation of statements by the issuers. There are many potential use cases from this solution such as project mentioned by known entities, e-commerce use, NGOs and social institutions. They also foresee the risks both technologically and marketing/adoption. ", "q0r": 5, "q1": "They estimate the project launch within 5 months (3 phases) with a detailed roadmap on action plan. The detailed budget breakdown is linked to the person in charge making it a very transparent project. The team is run by 2 main team members (their linkedin provided) with other support staff. The pay rate is very reasonable and also they detail the number of working hours. Whether they will come back in the next fund depends on the adoption of solution. I would suggest the team to also disclose how much they will charge to the projects using their service. They mention in the feasibilty section part that there are some payments for credentials which were paid for, but not signed by an invited issuer. The team has considered challenges for this project. Both of which have been mitigated as they gear up for their project ie. PRISM SDK, Blocktrust identity wallet and a basic marketing campaign.", "q1r": 4, "q2": "Every 2 weeks they will update project progress on their blog. They will also publish usage number and the number of embedded credential in the last 12 months. They might want to set the specific target for these measures as they did mention in the feasibility section that this funded platform will last for 12 months. Having said that, the project progress is publicly accessible and convenient for auditing. The proposer understands the problem of transparency and trust in web3 and creates an embedded verifiable credentials which has a variety of use cases. As mentioned earlier, it is important to disclose the revenue model of these credentials as whether the community will trust and embrace these credentials depending on the transparency of the solution. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 2098, "q0": "The idea behind this proposal is great. In today's blockchain space, distinguishing trustworthy websites and projects from shady ones is a challenge. The solution to this is a set of tools to embed verifiable logins into your website for people to see and verify. Prepare your credentials, send a link to the signer, and get a badge for you to embed in your page or profile. The service consists of an electronic portal, with three sections geared toward different use cases:\n1. Management area (Owner): In the management area, the website owner can use the DID to register (e.g. use blocktrust identity wallet) and provide proof of ownership domain owner (document uploader/nameserver). With the proof of domain, API token, and JavaScript snippet generated, the domain owner can place it on the page.\n2. Certifier Area (Issuing Authority): Login to the confirmation area is done by receiving the invite link and authenticating with the browser wallet. Once signed in, you can continue with creating your statement or sign a statement pre-generated by the prospective owner. With the completion of this process, the statement is cryptographically signed by the issuer and is now available as a Verified Credential on the Cardano blockchain. If someone wants to get an endorsement from someone then everything has to be prepared and paid for so the endorser just needs to click on the link, quickly review it and click the “Sign” button in this identity wallet.\n3. Verifier API and portal: When a credential appears in one's browser, it is automatically cryptographically verified in the background. Clicking on a verifiable statement/logo/badge on a web page takes the user to the service's verifier portal to obtain detailed cryptographic proof of the claim's origin to ensure that the statement is made by the expected entity.\nIt can be seen that this proposal is not only suitable for the challenge but also helps the entire ecosystem to grow by focusing on the hallmarks of Cardano: reliability and trustworthiness. Some of the challenges and risks are presented, and the author also offers options to deal with them.", "q0r": 5, "q1": "The entire plan has been thoughtfully planned, showing a 5-month roadmap divided into 3 phases with goals tied to easy-to-follow timelines. This proposal is very detailed on the time frame with all phases, with actions taken. The budget is also explained very thoroughly. The budget required for this project is $49,600 to be used for purposes such as marketing, infrastructure, and expert salaries. We have a pretty satisfactory explanation for these costs the proponent has been very transparent in the budget issue. And finally, about the team, the project team has the necessary skills and also provides evidence to prove that the team is capable of carrying out the project. Key roles in this project are blocktrust (a startup focused on developing technologies around Atala PRISM), Björn Sandmann, and John Grabenmeier: we know their experience, as well as their role of them in this project along with their verifiable link. For all the reasons above, I think the feasibility of this project is excellent, nothing needs to be added.", "q1r": 5, "q2": "A very detailed plan is presented, and the proponent is very transparent about the funding, which clearly shows the honest motives of the proponent. Several deliveries are presented in the route section. In addition, the community can easily track the progress of this project through the biweekly blog entry at www.blocktrust.dev/blog. It will report on the technical details of the work and also state whether the project is in the scheduled period for release. The success of this project is to provide a tool to make our ecosystem even better at what it is already good at providing great and reliable solutions. That will create traction within and outside the Cardano community, with more and more people embedding verifiable credentials on their websites and profile pages.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Excellent"}, {"id": 7562, "q0": "The project effectively tackles the challenge of distinguishing trusted sites and projects from shady ones - especially in crypto this is a problem to deal with in this challenge. and it is directly related to the effectiveness of the challenge. The solution is well-defined by creating a toolkit to log verifiable information into your website for people to see and verify. This helps to solve the problem of the challenge. This proposal can scale to solve the problems of future challenges to help more people know about Cardano/Catalyst. The author also risks that affect the development of the proposal as technical risks and marketing risks. However, the author also offers specific methods to deal with that risk.", "q0r": 5, "q1": "Timeline of the project is estimated by the author to launch the project within 5 months after the start, divided by the author into 3 phases to implement this project: phase 1 is implemented within 8 weeks, phase 2 is also done within 8 weeks and phase 3 is done within 4 weeks. This timeline is perfectly reasonable to implement the project. The stages are listed by the author in detail what needs to be done. The progress of the project is easily trackable through the website https://blocktrust.dev/. Success is clearly described by the author, success is not measured by the number of users alone, but by the progress and success of the entire ecosystem. The project's success is linked to most of the campaign's challenges. The proposed solution is to create Web 3.0 that provides the ability to make statements made by companies or people about each other cryptographically verifiable. Trusted entities can delegate their hard earned trust to others by validating their work.", "q1r": 5, "q2": "KPIs are clearly defined, metrics are easily auditable. During development the author will write a biweekly blog entry at www.blocktrust.dev/blog , which will provide information on the progress of the work. Through this, the community can track their progress. Also in the blog entry, the author also reports on the technical details of the work and states the proposed release date of the proposal. About the team Blocktrust is a startup focused on developing technologies around Atala PRISM. Includes the following outstanding achievements:\nBjörn Sandmann with 9 years of related experience will mainly work on technical infrastructure, integration with PRISM and web applications.\nJohn Grabenmeier 20 years of frontend development will mainly work on JS-Snippets. The team includes a fairly comprehensive list of very active team members whose profiles show the right skills and experience to do this job.\nFunding budget is $49,600, detailed and clearly listed by the author for each item. I find it easy to measure the success of this proposal by the number of surnames the author has listed.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14354, "q0": "The team wants to embed Verifiable Credentials in web pages. Most Verifiable Credentials are private according to the concept of SSI. The idea behind this is to make these VCs public for certain use cases and make it possible to embed them in web pages. An example is a brand or logo that is issued by a company and can then be displayed on the website. As soon as there is no business relationship with the company, for example, the logo can no longer be displayed on the website. The team touches on a very interesting aspect of SSI that I haven't come across before either: the public use of VC. I think this is a very strong idea, especially for testimonials and the like that a job seeker might include on their application page. The application purposes probably go far beyond what is presented here. In any case, the proposal fits very well with Challenge and could have a very positive impact. To ensure a long-term operation of the platform, the team is apparently considering a monetization model, but this is not explained in more detail. Also, a continuation in a later fund (after 12 or 18 months?) is kept open.", "q0r": 5, "q1": "Based on the description and the technical diagrams, the team seems to have a good grasp of the subject. From a technical and personnel point of view, I consider the project to be a safe one. The budget also seems reasonable to me. A few risks have been described, one of which I would like to go into a little more detail about: the team is not using the official Prism SDK but its own version of it. On the one hand, I find this very interesting and it makes it clear once again that the team really has a great knowledge - on the other hand, in my opinion, this also carries risks. If IOG has its own SDK, then probably more than 1-2 people are working on it. How can a small team have such an SDK and keep it permanently up to date? It is a topic that probably hardly anyone can really judge well without comparing both SKDs. Consequently, I don't want to judge it negatively - maybe it is actually a very big advantage - as a voter you can form your own opinion about it.", "q1r": 5, "q2": "A timeline of 5 months is proposed, which I think is ambitious but possible. What bothers me a bit, however, is that the team has also submitted other proposals that collide with this project in terms of timing. However, the team is transparent here and addresses this and also offers a solution. Nevertheless, in my opinion, there will be unclear situations arising: Is the project then officially halted and no funds paid out? How should this work exactly? I suggest the team to think about a better solution. Maybe a public JIRA board with the different projects? Only a blog is in my opinion a little too little. However, this problem only occurs when multiple team proposals are funded, so maybe that will never be an issue. Otherwise, I would like to see some clearer metrics. Basically, though, this seems like a very solid proposal.", "q2r": 4, "assessor": "z_assessor_3996", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Excellent"}, {"id": 15202, "q0": "The problem that this proposal tries to address is rooted in trust, currently different methods are used to increase trust in products or services in general, none of which are infallible. Web3 allows us to explore alternative solutions to that problem, such as cryptographically verifying trust in companies, equipment, or people in the blockchain, in essence, this is the value proposition that is offered here. Technically, the team intends to take advantage of the possibilities offered by Atala PRISM to identify the entity that issues the endorsement or declaration of trust, and the entity that receives such endorsement, as a result of this, a Verified Credential is generated, and what the team intends is to maintain a web service that a periodic verification of these statements or endorsements so that interested entities can be deployed on their websites. For me, it is clear the value that this proposal can have for the Cardano ecosystem, as well as its alignment with the overall challenge.", "q0r": 5, "q1": "Blocktrust is a start-up comprised of Björn and John, focused on building solutions leveraging the benefits offered by Atala PRISM. Both have relevant experience for the proposal in question. This could be verified by the links provided. Additionally, Björn currently has a previously funded proposal in fund 7, which is estimated to be completed by September. The implementation plan, is very detailed, and contains all the actions that the team understands are necessary to complete the project. After reading and analyzing in detail I can't find elements that don't make sense to me. The estimated time to complete the project is 20 weeks, and the feasibility is complemented by listing the 4 core features as deliverables. Most of the requested budget is based on the cost of the professional fees per technical profile. In addition, there is a brief description of the expected tasks for each technical profile. These amounts are completed with a cost associated with infrastructure costs for the months of development plus 12 months after the launch. Additionally, it is informed that in the event that the proposals submitted for this fund are selected, it will probably be necessary to include an additional developer, this person has already been contacted. However, it will depend exclusively on the allocation of funds. So from this point of view, and from my current knowledge, the team took into consideration all aspects to make this project perfectly feasible. \n", "q1r": 5, "q2": "The roadmap, milestones and deliverables are clear and allow the community to understand what to expect throughout the implementation phase. The description of success is very detailed, and it can be clearly understood that a successful implementation directly addresses the stated problem. While I agree with all of the statements made in the description of success, I would have preferred the team not to merely leave the descriptions as qualitative in nature, as adoption goals for this project will be outlined. The team has also already defined a communication channel with the community through the blog section of their website where they will update you every two weeks about the development progress; I also find it positive that they plan to report usage numbers and embedding credentials regularly for 12 months following the project's Go Live date.  \n", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "A toolkit to embed Verifiable Credentials into your website for everyone to see and verify. Prepare your credentials, send a link to a signer and get a badge for you to embed into your page or profile", "experience": "Proposer: Björn Sandmann, 9+ years of full-stack development with .net. Focused on identity and privacy solutions in the cloud. PRISM & Plutus Pioneer, ASTRO. Working full-time on PRISM projects. Frontend support: John Grabenmeier, 20+ years of frontend development."}