{"id": 420186, "author": "openlittermap", "title": "LitterWeek Competition for schools", "url": "https://cardano.ideascale.com/a/dtd/420186-48088", "category": 26595, "amount": 160000, "description": "OpenLitterMap works but it is too academic. Society needs a better way to get started with citizen science. ", "f6_no_assessments": 8, "f6_rating": 3.9583333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 14941, "q0": "\"This proposal fits perfectly with the goal of the challenge relating to the need for a powerful marketing campaign for adoption of open source citizen science tools. \nThe proposed solution intends to request funding for the development of the OpenLitterMap platform (since 2008) and the organization of the LitterWeek challenge, which would certainly help encourage adoption of the tools on the OpenLitterMap website. Regarding the development of the platform and tools (openlittermap), it would be interesting if we knew better what the platform would look like and how the Cardano blockchain would be integrated into the development of the platform. It would be nice to address some technical aspects.\nThe author specified which target audience they aim to reach, students in Ireland\nIt is interesting to know that the pilots have been made in 2 schools and that the scalability of this project may be positive through implementation of this campaign in up to 500+ schools in Ireland. Having said that, in the scope of this proposal, the number of schools they aim to work with should be specified.\nThe KPIs definitely indicate a great potential impact on the Cardano ecosystem. Some potential risks and steps to mitigate have been discussed which is a plus.\nTherefore, without a doubt, such a project is very necessary and promising.\n\"", "q0r": 4, "q1": "\"The author provides a 12-month timeline divided into 4 phases with expected start and end months. There are few details that describe how the activities would be carried out in each phase as well as in each month. The goals/milestones/key deliverables/KPIs should be established and indicated in the plan/roadmap to make the plan more feasible and make auditing activities easier for the Catalyst community.\nThrough the simple budget breakdown, it is clear the number of people who will be required as well as average one-year salaries. To assess whether the requested fund is reasonable, more details are needed. The budget breakdown should demonstrate what monthly spending would look like. \nThrough the relevant reference links to the website the author has founded and developed many years ago and a mention of previous work which is catalyst funded, I believe there is little doubt in his/her ability to organize successful campaigns and technical background. Such details as relevant skills and experience need to be described, along with reference links to verify the information for each member who will work on this project. At the present, there is no information about other team members, so we have little idea about the whole team. If the author is the only member now, he/she needs to clarify how the required developers would be recruited. since having qualified persons would be necessary for this project's success. It also would be essential that the author could clarify the person in charge of creating educational materials because he and other team members do not seem to have the education background and experience to provide the best materials that meet the society’s expectations, which is one of the risks. mentioned in this proposal. I think the project is unlikely to be very feasible.\n\"", "q1r": 2, "q2": "\"The author does establish direct KPIs that would be needed to monitor project progress over time. They clarify how their activities benefit our blockchain by indicating their intention to increase the number of Dapps or integrations etc. Through a detailed description of this part, I understand how they will evaluate the impact our blockchain may have on the result of this project. \nThe author does establish a detailed plan so the community can make contacts with the team to understand how budgetary support can positively impact their success through the means of monthly reports, a weekly community call, a weekly blog, and weekly edited videos.\nA monthly report on team progress, updates and every invoice & proof of funds will be provided, along with a link to each significant github commit (with a sample link in this proposal)\nI found it interesting and promising when it comes to the success of this project. The team intends to qualify and publish the results of this study in a journal and create the most comprehensive national baseline dataset by citizen scientists. \nIn the reports, it would be essential for the authors to clarify how these activities benefit our blockchain. They do need to evaluate the impact our blockchain may have on the result of this project. All in all, through the information provided, I entirely agree this project is easily auditable.\n\"", "q2r": 5, "assessor": "z_assessor_4113", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 68, "q0": "The proposer described the issue they are trying to solve but it could have been clearer: OpenLitterMap needs to find ways to promote its app and engage a wider audience.\n\nAs a solution to the problem, the proposer offers to create LitterWeek, a Competition for schools, that will run year-round, with prizes announced at the end of the school year.\n\nThe idea is pretty good to introduce and onboard many new users to the OpenLitterMap app and teach them about climate change and plastic pollution.\n\nThe proposal will have a positive impact on the Catalyst ecosystem by demonstrating Catalysts' ability for real-world impact. It is unclear if the onboarding of the students will also lead to the creation of their Cardano wallets and understanding of the Cardano ecosystem. It is also unclear how many students or schools or corporations are being targeted by this campaign. \n\nOverall, this proposal addresses the challenge effectively. 4/5", "q0r": 4, "q1": "The proposers provided a short description of who will work on the project, Seán Lynch (CEO, CTO, CFO) including his current role, experience, and work. The team will also need to hire 4 extra team members ( Senior Frontend Developer, UI / UX, Videographer + Animator, Community development + social media manager). to bring this proposal to completion.\n\nThe budget is described and broken down into positions and worked hours. The roadmap is divided into yearly quarters and is well explained from launch to finish. The timetable (1 year) seems to be reasonable to achieve the set goals. I would however express some doubts regarding the budget ($160,000) which is quite high for a campaign/onboarding website. I question if 2000 hours of front-end dev and 1250 hours of UX/Design are needed based on the listed features that the website will include, but it's not too irrealistic either.\n\nThere is a detailed implementable plan but not directly for the building of the website or the video creation, which is what is being funded by this proposal. The plan only details what will be achieved each quarter regarding the general campaign, of which a lot is engagement with schools. It would have been better to detail exactly what the website will do, what each team member will work on and what the video is about and the process of filming/editing it will be.\n\nGiven the experience and plan presented, there is some chance that this proposal will be implemented successfully, but the plan could have been more precisely laid out.", "q1r": 3, "q2": "The proposal provided a roadmap and a time horizon for achievement. The KPIs that define the success of the proposal are presented and make sense. The proposer will also track the budget spending and provide monthly progress, team and updates reports as well as a post-campaign report. The plan presented is sufficient for the community to track the progress of the proposal. This project scores a 5/5 here.", "q2r": 5, "assessor": "z_assessor_2040", "no_vca": 12, "ne": 5, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5987, "q0": "The problems we face regarding pollution and the environment are one of the biggest problems we will meet in the decades to come. This proposal meets the challenge's goals because of the plan to tackle litter by collecting data and incentive the community to tackle the problem. Moreover, the project is active globally, as you can see when opening the OpenLitterMap. The main focus of this phase of the project is to roll out a LitterWeek challenge to 500+ schools in Ireland. However, the proponent also has the long-term goal of implementing the same concept globally. \n\nThe fact the project is already funded in Fund 4 ($50 000) and has made significant steps since then made it possible to be adopted by thousands of users. I inspected their website on 03/07/2022, and there a reported 183 new users in the last 30 days on that day. ", "q0r": 5, "q1": "The fact that the project is already present and actively used gives me confidence the timeline is achievable. The hourly rates stated in the budget breakdown are on the low side. Still, with the budget allocated to each role in the budget breakdown, I think it is possible to create a significant upgrade to the platform envisioned by the proponent. \n\nI assume the extra team members for the project will be hired after funding is approved. The founder Seán Lynch has succeeded with the platform in the past by creating a working platform with previous funds (Fund 4). ", "q1r": 4, "q2": "The KPIs provided are not that easily measurable and too abstract to be considered a KPI. They give helpful information on the project, but KPIs should be straightforward and quantifiable. I would advise KPIs like 'the number of LitterWeek challenges completed\" and \"Number of educational videos made\", for example. There are already some great KPIs on the OpenLitterMap site like \"Litter tagged last 30 days\", and it would be helpful to add some KPIs for this new step in the project.  \n\nThe fact they publicly will share every cost expenditure in Google spreadsheets and the fact the proponent proposes to provide a monthly report on the progress made in the project gives me confidence in the project. When visiting the website OpenLitterMaps there are also some great ways the community can interact with the project, like Slack and a weekly Zoom call. ", "q2r": 4, "assessor": "z_assessor_2767", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6709, "q0": "OpenLitterMap is a crowd-sourced database of the world’s litter and plastic pollution. The origins of the project go as far back as 2008, when it was initially launched. The app is currently complemented by the Littercoin token, which originally launched on Ethereum but now has migrated to Cardano. What is remarkable about the project is the fact that the niche is an excellent candidate for real world adoption: users simply need a phone app to interact with the system, the “raw material”, the litter, is ubiquitous and easy to document its presence and therefore the barriers to entry are minimal.  \n\nThe value proposition of the app + token is intriguing, since the combination can create an immediate connection between the general population (non-crypto adopters) and the crypto space without the need for a fiat on-ramp or opening crypto exchange accounts, but rather through a reward system for tracking and documenting litter across the world simply with the use of a phone app and geo-located photos. If you need a similar example to relate to the use case better - think about the Brave browser, which aims to democratize the advertising sector and rewards users directly for the ads placed on their devices. \n\nThe project initially secured funding in Fund 4. This proposal is now asking for funding in order to gamify the entire concept and popularize it through a championship-style event amongst 500+ schools in Ireland. The proposal also mentions Littercoin rewards for the winners, as well as physical prizes offered by their partners (UNESCO, University College Dublin and Science Foundation Ireland) although it is not quite clear which one of them will actually fund them.\n\nI find that the project fits very well within the challenge, whose role is, I remind you, to enable the development of various decentralized applications and foster adoption amongst the population. Since we are having in front of us an already built application, enhancing its features with a gamified educational challenge for schools is definitely a proposal very useful for reaching this challenge’s goals if implemented. ", "q0r": 5, "q1": "Sean Lynch, the founder of OpenLitterMap, is a very well articulated project leader and a truly passionate person about citizen science, crowd-sourced data gathering and tracking litter across the globe. He is a geographer by formation, a self-taught developer and a Bitcoin / blockchain enthusiast. Unfortunately, unlike other successful projects, there aren’t any other second tier team members that can stand out and bring a solid proof of an already existing team, well-bonded and working hard towards the project’s mission. The rest of the necessary dev positions are actually advertised as available within the proposal (a frontend dev, UI/UX specialist, videographer, community manager - none of them already filled). For me this is a worrying situation, and it makes me wonder why hasn’t Sean managed to already attract more seasoned devs close to him. Would it be the lack of ongoing funding, or perhaps is it a culture fit issue, an unconvincing business case for them? We don’t really know but these questions definitely need to be asked. \n\nThe timeline of the entire project is well presented. We are told that the project would start in august with devs being hired, as well as a pilot implementation. Early next year (Feb-Apr) would see partnerships finalized, while in May the official event would begin. \n \nA bit curious, the budget is split by functions (for each additional person), and not by task, which makes our job a little bit more difficult in terms of making the right connections when assessing the budget’s reasonableness given the proposed timeline. We don’t know the actual tasks necessary to complete the project, since we do not have estimations of hours for these tasks, or anything else for that matter. We are however informed of hourly rates for the team being around 20-25 USD/hour. The only exception to this is the budget set aside for educational resources, of 10k USD. I find this budgetary caption fairly low, considering we are in front of an educational project, and in stark contrast to the budget allocated for development, 100k USD, hence ten times higher. \n\nOverall I find the feasibility of the entire project good enough, with only a few worrisome points like for instance not having at least part of the team already or the rather too general budget, so in my opinion four stars is the way to go. ", "q1r": 4, "q2": "For their proposal funded in Fund 4 the team is using a very simple google doc that shows us when the initial funding was spent. We can only see the dates, and perhaps having a small description next to each outflow would have been excellent, but it is definitely a strong point that showcases his desire for transparency towards the Cardano community. Unfortunately the link to their spreadsheet is not included in this proposal (but you can find it in the “Littercoin: Mass Adoption” one. \n\nThey are also hosting a weekly community call, they are frequently updating their blog posts with progress updates and they pledge to continue tracking the expenditures in the google document, while allowing community access to invoices and proof of funds at any time - which is an excellent initiative. \n\nA point of improvement would be perhaps enhancing their communication channels, since neither Telegram nor Discord are available, and I know for a fact that one of these ones is the preferred medium of interaction with the Cardano community for many members. \n\nIn conclusion we have here very good auditability perspectives, also considering that they are a returning proposer, hence five stars in this category. ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 10033, "q0": "The LiitterWeek competition for schools is a proposed challenge, the problem is in line with the Challenge of creating a challenging environment for students. The proposal can expand in the future, with good action on the environment, habitat renovation. The contest is to create activities to collect data on waste around the habitat, thereby creating a treatment method. Proposed increase the number of dApps and products available to the community to use to help enrich the Cardano ecosystem; Increase the number of integrated solutions connecting products; Product quality Development Platform OpenLitterMap, marketing campaigns, contest organization taking place all year round is suitable for the provision of regular metrics. Solutions provide dApp, increase product quality and connect between website products LitterWeek.org for marketing. Open source helps assess the status of environmental pollution, provides educational materials. The proposal has contributed to protecting the environment and creating conditions for the community to join hands to protect the environment in accordance with Cardano's purposes. The proposal posed risks: there was no guarantee they would have enough time and capacity to take on the LitterWeek challenge. The solution is to generate interest in the competition, create rich educational materials including a series of short comics and rich interface content that will capture the imagination of students and inspire them to continue their studies. I have an opinion: The slippage of the ADA makes it difficult to implement the plan of the proposal. There should be a contingency budget for this.\nI rated: 4\n", "q0r": 4, "q1": "The proposal gives a plan that has 4 reasonable implementation timelines, completes the plan in a year and details of specific implementation. Quarterly goals. Q1: Developers hired and websites LitterWeek.org online. Ready to accept school registration. Q2: build marketing campaigns, make lesson plans, videos and educational materials. Q3: Completing school content, this national campaign to clean up Ireland. Q4: LitterWeek is official and we live stream the results on instagram on Friday at 3.5pm just before the end of school. The development of such a plan is in line with the solution offered. The member implementing the proposal is only the author, the information is introduced as the person with the appropriate capacity, but there is no evidence for this. OpenLitterMap has 17N participants who are good community building of the author. We have recommendations for the proposal to recruit more members to implement the proposal, which could be teachers in schools, to make the completion of the plan better. The budget analysis is detailed, showing the content of the work to be done, the amount for each working hour is reasonable. Recommended amount: $160,000 represents 2% of the funding for the F9 challenge as suitable for the proposal.\nI rated: 4 \n", "q1r": 4, "q2": "The project's roadmap can be tracked on the web LitterWeek.org and instagram. The author is committed to providing the analysis on the Google spreadsheet (no link attached); Github; Blog, Determine the implementation of the plan of the project accordingly, we see the project is on the right track. We have an opinion on building more social networking channels such as Facebook, Youtube ... these are means that can show project activities, as well as ways to attract project participants to improve the environment. Evaluating the success of the proposal is the creation of a national database; Students in Ireland experience being able to replicate the model. The success of the project in relation to the proposed challenge was funded at fund 4 ($50,000). The success of the project at F9 is defined.\nI rated: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13888, "q0": "This proposal clearly explains how it meets the challenge criteria, in particular the integrations that bring existing solutions together within the ecosystem. \nIn Summary, the proposer (Sean Lynch), who was awarded catalyst funding for OpenLitterMap during Fund 4, wants to expand the program for schools and institutions to adopt. The new LitterWeek program will collect data from citizen scientists around Ireland, and possibly abroad, about litter distribution and type. In order to complete this expansion funding is needed to increase the website/application capability, market the campaign and hire five staff members. The success criteria will be shown through detailed statistical analysis of the litter, as well as the culminating live LitterWeek that will be published on social media and have prizes awarded.\nThe impact of this proposal for Ireland, Cardano and possibly the world is clearly evident. Everyone knows that litter is a problem that urgently needs to be solved, however, the scale, quantity and responsibility are issues that society and governments are struggling to deal with. Involving students as citizen scientists to collect this data, places the issue at the forefront of the community conscience and the personal awareness for these future generations. The social media recognition, prizes and LitterCoin incentives help reward those who are choosing to do the right thing for the earth. Another evidenced impact in the proposal are the Sustainable Development Goals that can be attributed to this program - 16 out of the 17 SDGs, which is a significant achievement. The proposal has already been piloted in 2 schools with the plan to expand to 500+ within the year, furthermore, if this expansion is successful the future scalability of this program is likely. One point that has a slightly less articulate explanation, is how the proposal adds value to the Cardano ecosystem directly, the proposal mentions connecting with other Cardano citizen science projects, Cardano teams competing in the challenge, and the connection to Littercoin being funded in a separate proposal. Possibly, these connections could be strengthened and within the educational materials produced there could be references or examples of existing Cardano projects to raise awareness with the participants of the LitterWeek challenge.\nOverall, I rate the proposal’s impact at 5 stars. As a teacher working in schools around the world for 18+ years I see the need for students to be involved in authentic projects, connect to experts and be encouraged to take action to ensure their success and the future of our planet.", "q0r": 5, "q1": "The plan for implementation and budgeting are well thought out for this proposal. The proposer has worked with the OpenLitterMap project since 2008, and LitterCoin since 2015, so he has a detailed knowledge of the system and what is needed to implement the scale increase needed to run LitterWeek. I’m not familiar with salaries in the fields listed for recruitment, but I am confident that the appropriate roles have been identified and hope that the compensation is fair for the work. Of some concern is that none of the staff members have been recruited as yet, apart from the Founder himself, and there could be more detail added to the job prerequisites to ensure the right team members are hired early on in the project. The budget is reasonable for a new, yet simple educational program, as well as website development, and has money budgeted specifically for creating educational materials - which needs to be a significant focus for the project to succeed, not just an afterthought. As an educator, I am extremely confident to comment on the time and roll out of the events planned for the schools. Too often new incentives by government or companies are given to schools without testing or support, leading to wasted time, resources and a lack of adoption. Although nearly a whole school year sounds like a long time, beginning with a few trial schools, course correcting the materials from their feedback, then deploying to more schools is a very wise approach. Also, the culminating LitterWeek celebration event is an ideal way to celebrate the school community and the competition itself offers a chance for students who don’t shine at academics or sports to be rewarded for helping the program. The only feasibility question I wonder about is how to get permission from government or private schools to run this program, how does the team propose to acquire all the schools? With choosing the schools in mind, the proposers also need to recognize the increased child protection needs around the world, it would be imperative that safeguards are built-in when students are collecting data, locations and exploring as citizen scientists.\nOverall, I have given this project a feasibility score of 4, based on my extensive knowledge of program adoption in schools and believe that if the goals stated are achieved this program will not only benefit the students and community, but act as a model of how feasible it is to run citizen science projects within the education sector.", "q1r": 4, "q2": "This proposal can be clearly audited as long as the proposers provide the project progress measures they have listed. Financially they have listed a cost breakdown google sheet, monthly team report and open access to invoices and proof of funds at all times. In terms of project accountability, they already host a weekly community call and post a progress blog. They plan to add a weekly video showcasing the program progress and community development. Towards the culmination of the project, the success of LitterWeek will be evident on social media and through their website. Following the conclusion they aim to create a comprehensive national baseline dataset from the information collected and publish the results in a journal. The proposal lists three main KPI, grouped under the themes of the challenge. I think there are a few too many objectives and some that go beyond the scope of the actual proposal, however, it does show the planned development and any additional scope they acknowledge that could improve the project.\nI have some reservations about the lack of breakdown within the CTO/CEO role, it encompasses many aspects within one role. Is a single staff member going to be clearly responsible for ‘management, code review, full stack developer, business development, outreach, sales, marketing, scientific writing & more’? Within all those items, how is the focus going to be directed during the course of the proposal to ensure all aspects are covered and nothing is neglected?\nIn terms of auditability I rate this proposal 4 stars for the financial breakdown, project timeline and final data sharing opportunities.", "q2r": 4, "assessor": "z_assessor_3840", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 14589, "q0": "This part of the proposal is written adequately and apparently. I believe that the proposal has an impact on the Cardano ecosystem. Firstly, the idea of the proposal is to create a new ultimate litter data collection championship for schools called LitterWeekTM. The proposal has given the rationale of the solution. Schools and teams can take the LitterWeek challenge any week that suits them and repeat their effort any number of times with not much difficulties “ You don’t have to be good at anything if you want to get on your school's data collection team and compete against other schools for 1st place in the championship to earn prizes like iPhones, xbox subscriptions, and laptops.” I can understand that the project hooks more students into adopting the ecosystems. To explain how the proposed solution will address the Challenge, the proposal shows the KPIs transparently with clear indication. The purpose of the proposal is to increase the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases, increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products,... These objectives are closely to the challenge setting. The proposal has mentioned two risks that can be the barrier for the project to be successful and they have the solutions to those problems. But I wish that the solutions are described more clearly. However, this is just a small point, that is my bonus suggestions to the greater version of the proposal. ", "q0r": 5, "q1": "In terms of feasibility, I find it quite apparent but inadequate. The proposal has provided information about the plan which lasts 12 months. The plan is built with a timeline and key milestones. In each stage the tasks of the team are listed and explained quite apparently. The budget breakdown is calculated based on the number of working hours of the members such as UI/UX & Graphic Designer, Animator, Videographer, Youtube content creator, Community development & social media manager, Senior frontend developer, CTO &CEO. details of the people who will work on the project, the proposal has mentioned some people. However, I recommend that the proposal should give information of their experience, how suitable they are with the project and which of their talents can contribute to the success of the project. That information will help raise the ability of the proposal to be voted on.", "q1r": 4, "q2": "In my opinion, the auditability part of the proposal is not clear enough for the community to evaluate. About the measurements that the proposal gives, they do not include the transparent KPIs. What the proposal has here are tools to supervise like google spreadsheet for every spend, report on team, progress, updates and expenditure, invoice & proof of funds. The tools contribute to the convenience for the people to assess the proposal. However, I recommend the proposal should have clear key metrics like number of people joining the competition, number of competitions, … Those quantity indicators will help the project to be easily evaluated.", "q2r": 2, "assessor": "z_assessor_4073", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14977, "q0": "Initially, the main idea of this proposal is to create the Litterweek tournament with the purpose of encouraging students’ awareness of the use of science to protect the environment. Gradually, in the long-term vision, the challenge should be adopted by not only schools but also the Cardano community, or even anyone that finds it interesting. The project offers very valuable prizes for the champions, which are iphones, xbox subscription and laptops. Moreover, an opportunity to get a remarkable scientific publication and experiences with citizen science are also very attractive and worthy rewards. At my first reading, I did not think that the project could expand its partnership to 500+ schools within 1 year. Yet, after considering carefully and checking relevant links about OpenLitterMap, I believe that it is possible for 2 reasons. Firstly, this is an innovative idea which aims towards a noble purpose, which is solving plastic pollution, climate change and many other global concerns. By aiming at the education from the early for children and teenagers, it has successfully offered a very reasonable and practical solution. Accordingly, I believe many schools would consider adopting this campaign because the next generations would be creative pioneers in solving these environmental problems. Secondly, a detailed plan with specific KPIs were given sufficiently and convincingly, including steps and ambitions to deliver the project successfully. This shows the dedication as well as the passion of the team towards the environment and the well-being of the society. In addition, one feature that makes this campaign special is that they apply an open-source mechanism, which allows anyone with the compassion to help develop it efficiently. In general, the information offered in this section is well-written, easy to comprehend and well-aligned with the challenge setting. Personally, I hope to see this project achieve some proper success in the future. However, there is still one omission point that I would like to offer. In my opinion, the proposal only expressed how it would affect education and the environment, but not how the Catalyst would benefit. I agree that leveraging some specific existing products such as Lace wallet or collaborating science projects on Cardano are good ideas, but not enough. My suggestion is adding some detail about how the challenge would integrate into Cardano, how it promotes Cardano or how it widens the Cardano ecosystem, etc.", "q0r": 4, "q1": "A plan with specific timeline and milestones were offered in this part. Overall, it takes 12 months to finish developing the campaign and officially launch the first challenge among students. Every step included in the plan was quite sufficient and convincing. Besides, the budget breakdown is still missing some explanation details. The number of staff needed for each specific task, together with the salary per hour was given. Yet, I am still confused on the estimated quality of the work and whether it is sufficient to develop the whole project, since the total number of working hours needed and the average working hours per day are still not clarified. Moreover, $160,000 is still a huge amount of money, which requires thorough consideration. From my point of view, the developers should describe more about the results in their mind. They can consider giving out some imagination about the website displays, what categories it would contain, whether it is easy-to-use and attractive enough for students’ attention,... These criterias would be very helpful to evaluate the feasibility of the project. Finally, the author mentioned that the proposal is still missing 4 positions in the team, 3 would be required from the Catalyst and 1 would be potentially found. Nevertheless, he/she did not state any requirements or essential characteristics needed for those positions. Moreover, I do not see any brief introduction about work experiences or capabilities of the founder, as well as an affiliate link for further background checks. This should be an important point that he/she needs to reconsider.", "q1r": 2, "q2": "In this section, the developers ensured that regular reports will be made by many different methods. Any progress and proof of spending would be kept up-to-date so that the Catalyst would not lose track of the project. Moreover, a weekly community call as well as a weekly blog post are also prepared so that every information about this campaign would be transparent. However, key metrics and KPIs were not given enough to measure the success of the project. I would highly recommend the author describe more about what visions he/she foresees and what achievements they would reach after launching this campaign.", "q2r": 3, "assessor": "z_assessor_4118", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "We are turning cleaning the planet into a game with Littercoin rewards. Our next campaign is the LitterWeek challenge, which will encourage societal adoption of our open source citizen science tools.", "experience": "Developing OpenLitterMap since 2008 and Littercoin since 2015. Worked as a divemaster in the tropics. After 15 years I got my first funding from catalyst."}