{"id": 420106, "author": "governance.services.guild", "title": "Governance Services Guild", "url": "https://cardano.ideascale.com/a/dtd/420106-48088", "category": 26595, "amount": 51600, "description": "Cardano and Catalyst lack flexible governance support services for the ecosystem, including those related to products and integrations.", "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 6708, "q0": "This is an interesting proposal that fits moderately well with the challenge. Let’s start with the problem, that Cardano and Catalyst are in dire need of governance support services, including those related to how to better integrate things together. The value proposition is to provide governance products and services to existing groups and communities. Going through the entire proposal before returning to this point, I can say that there are definitely plenty of services outlined in the workplan, but no actual product, something that stands on its own in the absence of any other consulting  or service. So I think it’s fair to say that services are predominantly present here, in the detriment of products. Not a critique, just an observation. \n\nMoving on, the quality of a service / consulting work depends heavily on the people rendering that service, and hence from my point of view, the perceived impact of such a proposal can only be assessed by taking a very close look at the team behind (spoiler - it’s very solid, but more on it in the next section). \n\nIn conclusion, with a solid team proposing to offer their services to emergent Cardano communities, I think the idea fits moderately well with the challenge whose role is, I remind you, to foster the development of new products and integrations, since we will definitely observe indirect effects on this end goal, but it’s unlikely to have direct, measurable impacts on the number of dapps emerging, for instance. So four solid stars. ", "q0r": 4, "q1": "I mentioned a solid team in the previous section. Well, the guys behind this proposal include well known names from the community, and if you as a voter ever interacted with Cardano Discord groups, chats, town halls or Catalyst Circle meeting, you must have definitely heard of JP, Nadia, Nori, Andre, Miro or Felix. Well, it’s them right here, and for me that’s already enough, since they are well respected members of the community and comprise a wide range of competencies, from PA, VPA, proposers, swarm members, training facilitators, etc.. But if that is not the case, rest assured that there are extensive bios in the proposal and relevant social media links for each one. Go check them out. \n\nThe detailed project is very extensive, but it lacks an ELI5 section. The timeline includes details of work already done from Q3 2021 onward as well as activities for which they seek funding, but without offering concrete deadlines. But the clear message that emerges here is that this proposal is somewhat a continuation of Catalyst Circle’s activities, with the budget going towards incentives for each of the team members to continue their assistance work towards the wider Cardano community for the next four months. Monthly incentives for team members range from 1.2k USD to 2k USD, with minor other costs for supplies. A strength of the proposal is that the guild seeks two types of funding: one from Catalyst (this proposal) but they intend as well to charge commissions to the communities that use their services.  \n\nIn my view, for an excellent proposal I would have loved to see:\n\n- a simpler explanation of the services rendered, with a few simple examples\n- an estimation of the number of hours for each of the incentivised positions\n- an idea of how pricing would work for their commission revenues charged to the communities that seek their services, and even an estimation of such revenues on a reasonable time frame (half a year maybe, which is two months extra after this funding would end?)\n- a very simple explanation of how this proposal fits with the Treasury guild which is also mentioned within the proposal. Will the Governance guild seek other competitive offers from other projects offering similar services to what the Treasury Guild does or will they commission work to it without shopping around? What comfort can voters obtain to ensure there will be minimum risks of double funding operations or inability to distinguish one proposal’s added value from the other?\n\nIn conclusion we have a solid team behind the proposal, but somehow feel that the value proposition should have been made a bit more clear as well as any connection with other proposals. In conclusion, four solid stars. ", "q1r": 4, "q2": "The Cardano community will have 110 percent transparency on all the activities from this guild since the team members are very active in all social media networks and they are what can be called a significant part of the core. For this project in particular, they offer a few success measures: full attendance to each Circle meeting, at least two groups commissioning the guild’s services until the end of the year and full composite services tracked via github / Dework. Five stars.  ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 3331, "q0": "This proposal brings forward an amazing initiative to create new supporting governance services that will help support existing and upcoming Cardano projects and communities, proposed by a great mix of talented contributors and community members of Project Catalyst and Cardano. I believe the idea of a service that help teams govern, administrate and manage their initiatives is a great way of further empowering groups and projects in our community, especially when tools like this currently don’t exist, and as of Fund 9, we have a significant number of ongoing funded projects and a great influx of new proposals. Therefore, I can confidently say this proposal identifies a very relevant issue in our current environment and presents a great solution that perfectly adresses the challenge and adds value to the ecosystem. This team have provided great discussion around the possible obstacles and risks and how they would mitigate them, and it shows that they are a flexible and attentive team focused on providing value. I believe this is a type of project that can provide value to many different areas and help the community on many levels since the applicability is not tied to a specific challenge or topic, but is something that anyone can utilize. It will be very exciting to follow the development of this project.", "q0r": 5, "q1": "The team have proven their capabilities through a number of existing products and services, such as Treasury Guild, and the people behind the project seem professional and more than capable of successfully working on this project. The roadmap provided looks very professionally made and includes all relevant completed achievements and milestones since Q3 2021, leading up to their planned work in 2022 and onwards, providing us with a great understanding of the full procedure and how this project will run and develop over time. I also really appreciate how the team section is presented, with social media links of all team members as well as a description of who they are and what they will do in the project. The team has a vast range of expertise in different areas, for example vPAs, founders of Catalyst Swarm and DAOs, and many years of experience in finances, blockchain, software developent, HR etc. The budget seem sensible and is well formatted and easy to understand, but it is one area where they could provide even more information, for example including additional detail regarding the amount of hours that will be put in and how the payscale is worked out may be interesting to some people. Ultimately, this team has provided high level evidence of their capabilites in running this project, and I have no doubts in their ability to successfully implement their products and services for the community to take part of.", "q1r": 5, "q2": "This proposal has provided excellent ways of measuring and tracking the progress of the project. First of all, they have several publicly accessible channels (Dework, Discord, Github and Gitbook) to share updates and interact with the community on, which I believe is very healthy for any kind of project. Specific action items can be found on their Dework platform where it’s very easy to follow many of the tasks they work on, I have seen other projects with similar approaches, using other platforms such as Notion, and it is a great way of structuring tasks and having a public transparent way of showing progress. I also trust that their discord channels once open will be a useful channel for input and interaction. Furthermore, the proposal also highlights some specific success indicators that are easy to measure, such as facilitator and secretary attendance, number of new groups commissions, and a having a perfect record of tracked and transparently reported composite services. There is no doubt this proposal provides great ways of monitoring and measuring the progress of the project in an effective manner.", "q2r": 5, "assessor": "z_assessor_2448", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4170, "q0": "The challenge commissions proposers to serve use cases for the Cardano ecosystem.  Explicitly, the challenge presents a purpose: driving adoption.  While the challenge, refers to dapps, products and integrations, the challenge brief is sufficiently broad to expand the parameter to include services. \n\nThis proposal seeks funding for a suite of services to lead and govern Catalyst projects . These services are offered through Catalyst Circle.  These services will help funded Catalyst projects plan, manage and execute initiatives and deliver on commitments to the community.  Consequently, this project creates a resource of expertise to be commissioned by and for the benefit of future projects.  Given the significant role of Catalyst in promoting development on Cardano, this proposal will have an outsized effect on driving adoption.      ", "q0r": 5, "q1": "Catalyst Circle has been funded previously but was not funded in the most recent round.  The principals in the project have been operating in the role for more than a year. Further, they feature ample credentials to establish expertise in the domain.  \n\nIn this proposal, the team expands the Circle concept to a more decentralized network of experts called the Cardano Governance Services Guild.  In addition to the team, Circle recruits experts from the Cardano community, leveraging the power of the network to nurture new projects.  \n\nThe plan presents clearly identified positions, and plausible timeline and reasonable budgets.", "q1r": 5, "q2": "In essence, this proposal seeks operating expenses for Catalyst Circle. Circle is a highly visible part of the Catalyst community with town halls and other forms of community engagement.  \n\nThe platform uses Dework and Discord integrations to provide transparency and coordination.  Through the use of such tools, one may have confidence that progress and success will be transparent.  The specified success metrics are measurable and attainable.  ", "q2r": 5, "assessor": "z_assessor_2523", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7191, "q0": "This proposal effectively addresses the problem by attempting to solve the underlying issue, that there is a lack of support for existing & future projects launching on the Cardano blockchain, the majority of these being proposed via Project Catalyst. Here the proposer and their team is and already has been providing support to ensure 'Good' proposals and project longevity, become 'Excellent' proposals before they're submitted to funding rounds (Catalyst Circle circa July 2021). The proposed Governance Guild and their expanding Cardano network (CC), will provide numerous services & benefits to further successful projects before launching in the Cardano ecosystem on a commission basis. \"Providing support in a variety of areas that can be tailored to a team’s needs\", meaning no one individual or group is built the same or in need of an overhaul, yet the guild members will be sought after for suggested improvements where necessary. Hurdles for many who seek funding can have oversights such as: team management and available expertise, technological barriers, along with the implementation of decentralized solutions; challenges that should be  well defined before entering funding rounds. To present a concrete proposal to Project Catalyst and it's voters which answer these challenges appropriately and effectively, the Governance Guild aims to suggest the best course of action allowing for better equipped individuals, groups, and communities and their projects to make a larger and more positive impact within the Cardano ecosystem. This is a much needed implementation to improve Catalyst Circle's contiuned success for the community and it's ever growing network, the Impact rationale provided here is a 5.", "q0r": 5, "q1": "The proposer has provided an extensive timeline and roadmap dating back to Q3 2021 when Catalyst Circle found footing within the Cardano/Project Catalyst and their services thus far. The experience of these members shared within the proposal shows that all are well versed within their individual expertise to implement such changes and governance that ensures future success will be continued; as well as having an open door policy for expanding to other Cardano community members whom are willing & capable of carrying out tasks within the supportive services available. Short descriptions of academic accomplishments along with LinkedIn profiles and social's (Twitter) are provided for all members within the proposal which shows the excellent transparency of the team and what they're capable of moving forward. As the Cardano ecosystem grows along with Project Catalyst, the amount requested this fund seems more than reasonable, with clear and precise budget breakdowns outlining for future installments of the Governance Guild in maintaining a structured support system that could one day be self-sustainable. The rationale here given is a 4, as the already extensive network within CC will undoubtedly be utilized as demand becomes higher for such services.", "q1r": 4, "q2": "Audibility with a rationale score of 5 is being given to this proposal as the Governance Services Guild will be utilizing the already implemented Dework Organization, Github, GitBook and Discord to track and retain transparency with the Project Catalyst/Cardano communities. Discord and GitBook are still in preperation, although this should not be seen as missing information since all transaction and payments up to this point in time have been documented within the Treasury GitBook (link provided). The proposer is aware that even if funded, further funding may be required in the future, but states that said funding could become available through alternative means but this is not clearly defined. As mentioned above, it is the proposer's aspiration to have Catalyst Circle and the Governance Services Guild be a self sustaining governing body as the Products and Services being developed evolve over time. Lastly, as far as the key metrics for success and SDG rating, the proposer cannot specifically address this, as it will depend solely on the community involvement to determine this.", "q2r": 5, "assessor": "z_assessor_2883", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9727, "q0": "The Cardano community is growing stronger, Catalyst projects through Funds have had great growth and rich content. However, there are still many projects and developers with valuable ideas that are seeking funding from Catalyst, but they do not know how to build, present and optimize those ideas. Therefore, with this proposal, I find that the author has raised an important problem which is Cardano and Catalyst's lack of services that support flexible governance for the ecosystem, including products-related services product and integration. Although it is important, the size of the impact is relatively small and more supportive.\nThe proposed solution solves that problem. By developing the Cardano Governance Services Association to provide governance products and services to support Cardano teams and communities. The Cardano Governance Services Association is a decentralized organization composed of individuals with extensive experience in Blockchain project administration, operations, and management. The organization aims to support the discovery, development, and deployment of decentralized solutions to help teams manage their own initiatives. They have supported Catalyst Circle since Q3/2021 now and are considered indispensable in the future. This proposal reflects a continuation of the services offered to Catalyst Circle. However, it is being expanded to include more potential customer groups to avoid sole reliance on the circle's operation. Besides the solution, the team has also anticipated the risks that may be encountered during the implementation process. There are 3 risks raised that are insufficient human resources, lack of group operation services and not being funded. Each risk has been foreseen and there are solutions to minimize those risks.", "q0r": 4, "q1": "Cardano Governance Services Guild started in Q3/2021 and is still active in the management of Catalyst Circle. This proposal is to apply for funding for Q3 & Q4/2022. The planned work has also been detailed by the author. This ongoing work reflects the existing activities of the Association, including the Continuity of Facilitation and Secretariat requirements of the Association. Also, their plan includes a commission service that can be authorized.\nThis proposal's funding represents 0.7% of the total Challenge budget. This money is for planned work- Guild support for Catalyst Circle. The budget has been allocated into 5 small parts, detailed and given the basis of calculation.\nGuild members have been described by the author with very complete and detailed information. They are community members from many different backgrounds. Team members include Swarm Veterans Member, PA, vPA, Sponsored Proponent, SPO, Idea and Governance Day Organizer, ADA Holder, Treasury, Training & Self Automation and Community Monitoring. Identity is also easily identified through the personal profile links that the author provides.", "q1r": 4, "q2": "The author described in detail and transparently how the community can track the progress of the project. Cardano admin services organization's project management is tracked via Dework, Github, GitBook & Discord. All transactions and payments are fully tracked and recorded through the Catalyst Swarm Treasury & accounting system on Discord & Github. The author has provided all relevant links. However, to make it easier to measure, the author should add more indicators that the community needs to pay attention to when monitoring the project.\nThe success of the project has been clearly defined, with specific KPIs. These are: (1) providing project management services, tracking and reporting of action items, and supporting community engagement for Catalyst Circle; (2) 100% attendance of at least one moderator and one secretary at each Circle meeting; (3) 2-3 New Teams running guild services by the end of Q4 2022 and 4) 100% of aggregate services are transparently tracked and reported to the community via GitHub and Dework.", "q2r": 4, "assessor": "z_assessor_3087", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10392, "q0": "The proposal will provide support services for teams who want to take part in Cardano. The proposal's team calls the supporting services \"Governance Services Guild\". Specifically, the Governance Services Guild will provide decentralized solutions for project teams or developers to explore, develop, and implement their ideas. Although Catalyst's funding rounds are expanding and stable, there are still not many support services for teams that want to implement their ideas. Therefore, the Cardano Governance Services Guild is a real project of support solutions.", "q0r": 5, "q1": "The team has 4 core members, treasure guild's 2 members and 2 project consultants. They include PAs, vPAs, Funded Proposers, Catalyst Swarm Veteran... They all have Catalyst related experience. Currently, they are consulting and supporting the development of a number of projects on Cardano. Each member of the project publishes full information about their career, experience and community can access links to check. They need $51600 for Q3 & Q4 2022 of the project. In this proposal, the team plans to use this fund budget for developing Catalyst Circle Administration service. Besides, they will also develop and develop other services like Project Management Services, Governance Services, Documentation...", "q1r": 4, "q2": "There are some choices for auditing the project. We can visit the website of Dework Organization (https://app.dework.xyz/catalyst-circle-admi) to have more information about Governance Services Guild. They are also preparing to create a Discord channel for the project to update the project. In addition, we can check about Circle Admin commission through the link: https://github.com/orgs/Catalyst-Circle/projects/4. Furthermore, the community can track all transactions & payments through the link: https://treasuryguild.github.io/Gitbook/. Most of the issues that need to be audited are clearly listed and easy to understand.", "q2r": 5, "assessor": "z_assessor_3183", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Provide a range of governance products and services to support existing or emergent Cardano groups and communities.", "experience": "The Governance Services Guild is composed of community members from diverse backgrounds. Team members include: Veteran Swarm Members, PAs, vPAs, Funded Proposers, SPOs, IdeaFest and Governance Day Hosts, ADA Holders, Treasury, Training & Automation and Community Oversight."}