{"id": 420268, "author": "b.rad.c", "title": "Decentralized Journalism Protocol", "url": "https://cardano.ideascale.com/a/dtd/420268-48088", "category": 26595, "amount": 67408, "description": "News articles suffer from broken links, article versioning lacks transparency, profit models value hyperbole over facts, and the lack of a neutral third party review decreases trust in news.", "f6_no_assessments": 7, "f6_rating": 4.190476190476191, "videos": [], "media": [], "f6_assessments": [{"id": 795, "q0": "The proposal is for the implementation of a protocol named dBranch that aims to break journalism up into several branches: contributors (journalists), researchers (investigative journalists), reviewers, studios, curators and the audience. The aim is noble and achieving it is important in the days of capitalist-controlled journalism which gets funded by the government in positive feedback leading to an unholy coalition. The proposal presents a pleasant read on the possibility. One such example is like the following comment in the proposal “ reviewer is independent of a news outlet their incentive is not to maximize the reach of a news article so they can be as honest as they like” these are excellent features to have and can open up new ways of generating valid reviews with inherent compensation for the reviews. The protocol is providing an excellent use case for Cardano in the important domain of news and knowledge production, evaluation and presentation. The proposal is in alignment with the ethos and aim of Cardano. ", "q0r": 5, "q1": "In order to evaluate the proposer's capability and commitment, we can see the activity in the dBranch codebase in github. The application is actively in development with about 60+ commits in the last 2 months that's a commit per day. The proposer is already spending substantial effort on the project. The proposal has been broken into four phases of one-month development each of which seems reasonable and doable. He has about 15 years of experience in their related field and the breakdown of the complex subject in the proposal and in the white paper is fairly self-explanatory which presents the clarity of the idea in the proposer's mind. With this evaluation, we can come to the conclusion that the proposer has the necessary technical capability to succeed in the endeavour. ", "q1r": 5, "q2": "The proposer has enclosed a spreadsheet for the cost calculation that includes, business development consultation and engineering team consultation for 20K USD in addition to $36KUSD for the developer at the rate of $75 per hour for 480 hours over four months at the rate of 30 hours per week. There is a scope to quantify the 480 hours of development. The proposer will be hiring one or two others with experience in business development and building engineering teams to create a sustainable business plan including engineering and marketing teams. The rest is for hosting charges for the infrastructure for 12 months. The rates are reasonable and the costs are justified. The return and sustainability of the project are issues. The proposer has also recently received a micro-grant from IPFS to sustain development of a prototype and expects to get more fund to launch the proposal in a full-scale sustainable model. Therefore the complete exercise is for bold experimentation that will require more funding to make it into a production-grade system.", "q2r": 4, "assessor": "z_assessor_2129", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 1437, "q0": "This great proposal is within the challenge goal, because I think this implementation will be a high value application that introduce news content, protocol and dApp for the Cardano blockchain and it will help many people to increase their participation in blockchain application for Cardano community users.\nThe proposal want to introduce news and information protocol that will standardize publication and versioning of raw data, sources, citations, articles, opinions, reviews and fact checks, using IPFS and blockchain technology. The new type of whitepaper breaks journalism up into several branches: contributors (journalists), researchers (investigative journalists), reviewers, studios, curators and audience. Legacy institutions combine many (if not all) of these branches into one company with aligned financial incentives\nThis proposal is clear, complete and concrete, based on IPFS and Cardano blockchain, guarantees solidity in deliverables, support transparency and accountability for all Cardano community.  This is an important proposal to attract many new users to the Cardano ecosystem while reading news and contribute to them on the content development of many new contents.\nThe proposal clearly articulates the contest, the problem, the challenge and how it will add value to the Cardano ecosystem and for all of the stakeholders..", "q0r": 5, "q1": "This proposal is well written and clearly demonstrate the experience and the team's commitment, guarantees solidity in deliverables, support transparency and accountability for all Cardano community.\nThere are links in the proposal, which allowed me to verify the project founder Brad Corlett but there aren’t any other information about developers and their credentials (I think that hired after the project founded). \nThe scope of the solution is very well explained (e.g. how the funds will be spent, what features will be implemented, and so on…). There is a good cost worksheet, that contain all costs (eg. Infrastructure, cloud license, etc.)\nThe plan for implementation (4 months) could have been a bit more specific, but as it is now it's good enough as well. The proposal doesn't go into too much detail into the technical aspects like architecture, language and technologies for the implementation. The proposers have not mentioned some potential challenges and how they plan on solving them.", "q1r": 5, "q2": "The given metrics measure what the proposer wants to do, but the success of his actions is not defined. As mentioned above, the description of the solution is explained (e.g. how the funds will be spent, how the solution improve their customer experience, and so on…), so the progress of this proposal is not simple to assess.\nThe metrics for the assessment isn’t given, so it’s impossible to assess what the proposer wants to do, but the success of his actions is not defined. \nThe proposal offers a very basic timetable to complete the work (4 months). The proposer hasn’t considered challenges and risks relevant to a successful adoption.", "q2r": 3, "assessor": "z_assessor_2245", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 4401, "q0": "The proposal addresses the goal set out in Challenge: Dapps, Productions & Integrations and highlights the current state of journalism: articles with broken links, opaque versions of articles, and important profit models. The hype over the truth and the lack of neutral third-party reviews reduce trust in the news. The team is working on a solution to partially solve that by using the IPFS protocol and blockchain to create an immutable, verifiable publication history, from which to select the right article content.\nIt is very good if this proposal, the IPFS protocol is implemented on the Cardano blockchain. We know the journalism industry has many problems, but this proposal reduces negative issues and increases positivity and consumer interest in this field. Therefore, when deployed with the Cardano blockchain, it promises to add value to the Cardano ecosystem. Such is the dramatic impact of this proposal on the Cardano blockchain and the Cardano ecosystem. In addition, the proposal can scale and explain the future challenge of journalism. The opportunity to apply the practice of development in modern society is too great - because the society cannot do without the press at any time, the proposal can completely scale up and solve the problem. challenges - there is plenty of room to continue to grow and expand. I strongly agree with the impact of the proposal, I vote 5 stars.", "q0r": 5, "q1": "I realize that the author has many years of experience working in the media industry, documentaries, software development, etc… The author has also provided sufficient arguments to explain the problem, and documents related to the proposal. (website, github, videos,...). I am very pleased to see the member's identities disclosed directly on the proposal via the social network link (Twitter), this makes it convenient for the community to look up the members' identities. and verify the feasibility of the proposal and further confirm the author's credibility. The core team member count as I understand it to be 1 person - the same author of the proposal, and the author is looking for more members/contributors?\nThe budget is presented in detail, fully and reasonably with the target. I am very pleased when the author lists in detail how to calculate labor as hourly wages - this calculation is very common in businesses today. By listing the details of the work associated with the budget, the author's professionalism and meticulous attention to the balance sheet can be demonstrated, through which the community can strengthen more confidence in the feasibility of the project. examination of the proposal. The fact that the author presents the budget as it is, makes it easy for everyone from the community (who are very new - they don't know anything about the author and this proposal) to easily. That's my take on the budget. If Fund 9 has not been funded by Catalyst, does the author intend to implement the proposal? Does the author have any other funding sources to implement this proposal? (can be mobilized from other organizations)\nThe plan and implementation method have been stated by the author step by step in a certain order, meticulous and detailed for each small job. Through this, the feasibility of the proposal can be assessed to some extent. It may indicate enthusiasm in the presentation of the author's proposal. I am very pleased with the meticulousness and detail because it is a way for the community to increase confidence in the feasibility of the proposal.\nHere, I consider the necessary resources for implementation, I divide them into two main resources, which are financial resources (mentioned in the above budget) and human resources. Regarding human resources, the author is professional and experienced. As shared, the author does not make another proposal in parallel with this proposal at Fund 9. This ensures that human resources are not dispersed, and the author is completely focused on implementing this proposal. This is also one of the factors contributing to confirming the feasibility of the proposal. I understand the author is looking for other members/contributors to work together. In the unlikely event, that the author has to deal with a personal matter, will this proposal be delayed? Therefore, I think the author should demonstrate to the community that even though there are currently members implementing other proposals, human resources are still fully guaranteed for the successful implementation of this proposal. It is the best way to create more trust in the community, thereby increasing the feasibility of the proposal. If you can do so, then the author has made sure that there are abundant human resources to implement this proposal and affirms the author's belief and most importantly, the feasibility of the proposal to the community. For this proposal to be implemented successfully, in my opinion, it needs the participation of many members, not just one person. In terms of technique, technology and language used when implementing the proposal. This is a collection of high-tech technologies: Blockchain Cardano, smart contracts, cloud, IPNS, DAO, etc… I think the author is very professional and good at listing technical jobs. so. If the author intends to release NFT, then I strongly support it. NFT is not only a representation of the professional meaning of the proposal but also a way to promote the event and the author's brand to the community. It represents the application of the world's cutting-edge technology to the author's work. In addition, my advice is that the author quickly finds a few partners to work with while mobilizing external support to propose the best possible way. Support here is understood not only in terms of money but also in terms of human resources, and technology… from experts… I believe that the author will do a great job when implementing the technical and technological aspects into the project. implementation of the proposal.\nIn terms of risks when implementing the proposal, the author also states quite clearly the risks that may be encountered when implementing this proposal: (1) Failing to build the large team needed for the entire scope of work. vi of this project; (2) Not enough traction to have a large user base - accompanied by adequate solutions to hedging risks. I am satisfied with the risk and remedy that the author offers. Here, I add a third risk: Ada slippage - will affect the budget of the proposal. We know that the digital currency market is in hibernation (devaluation of digital currencies), so Ada may depreciate when I receive from Catalyst fund, then I will face the problem of lack of budget to implement the proposal. So my advice would be for the author to take a close look at Ada's budget related to slippage to make the budget requirements in the proposal appropriate.\nThose are my positive comments, the author can consider and adjust for this proposal. I agree with the feasibility of the proposal. I vote 4 stars.", "q1r": 4, "q2": "The roadmap of the proposal is presented in quite detail, lasting for 4 months with important milestones divided by month. This is a reasonable roadmap and milestone for a proposal that takes time to implement. The work steps to be performed in each stage are very specific and in a step-by-step sequence - containing all the necessary information. However, I still advise the author to attach the milestone roadmap to specific months of the year (January, February,... - this is just an example). If so, it will make it easier for the community to evaluate the transparency and auditability of the proposal. As a PA, I have evaluated several proposals and have found that not many teams do this.\nI don't feel satisfied without the presence of job performance indicators (KPIs) and key metrics. The author needs to look more carefully and specifically to come up with KPI criteria and key metrics. We all know the role of KPIs and key metrics in auditing. I consider KPIs to play a specific role in demonstrating the transparency and auditability of the proposal. So my advice is to quickly add KPIs and key metrics to the proposal. By doing that, this proposal will have higher transparency and auditability.\nI think the author defines \"what the success of this project looks like\" in a way that is clear, very real, and easy to understand: Creating a world that trusts more journalism; Information disseminated on the internet will be standardized; Link decay will be reduced to near zero; The fact-checking and review process is more in line with the scientific process. I agree with the author's definition of such success.\nThroughout the proposal, problems and solutions were clearly described. In summary, I hope that the author will consult my comments, taking note of the addition of KPIs & key metrics. I both agree and disagree with the auditability of the proposal. I vote 3 stars.", "q2r": 3, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 4678, "q0": "This proposal strongly addresses the challenge, providing a pitch for a product that has unique qualities and attempts to address a key social problem.\n\nAs someone with roughly 20+ years experience in the media and media relations, this absolutely must be said: Most of the journalism-centered proposals I've seen on Catalyst amount to the old and arguably broken strategy of \"Pay us to build a website, and then also pay us to pay freelance journalists to write articles for us.\" And, assuming it's even successfully implemented in the first place, all this really gets you is... a pro-crypto website. There's nothing interesting or new or special about that. Arguably, it's painfully redundant. Honestly, it's made me a little jaded about these proposals and so I've been a tough critic in assessing them in previous funds.\n\nBut I have to give this proposer credit, in that at least he's trying to use the tech Cardano is based on to innovate, and leverage the power of innovation to enhance the quality of information people receive through media. That's a real new product, something unique that the Cardano community could sell. And that makes it something special. And that alone merits a 5-star ranking for rising to the essence of this challenge. \n\nThe big question that remains is chances for success...", "q0r": 5, "q1": "Writing the following with it being fully in mind that the proposer is upfront that this is a proposal for protocol development and thus in a very early stage: Generally speaking the roadmap is ambitious but looks fair, the biggest weakness here is the lack of a team.\n\nI'm aware that the proposer has made team development part of its roadmap, but the proposal would be distinctively more compelling if it wasn't just one \"jack of all trades\" at this point behind such an ambitious project.\n\nThat being said, the proposer is open about this, I'm mainly highlighting this to say: This will absolutely have to be a focus moving forward. \n\nAs for the budget, some more information might have been nice. But since, again, the proposer is upfront that this is the phase in which he will be seeking business/engineering expertise and using budget funds to do so, this should not be a huge problem *so long as the proposer engages very proactively with the community while progress is being made on these fronts*.", "q1r": 4, "q2": "It's good that progress on this will be open to the public. It's better that the proposer will post videos on YouTube demonstrating their results, and publish business and engineering plans. What would have been better, was something more numerically based. How often will you post progress reports and videos? Every other week? More frequently? Less? \n\nForcing oneself to fit a schedule can be an intimidating prospect, but it does much for your proposal because it shows a willingness to work toward meeting commitments. This is especially important in a deadline-heavy field like journalism! For this reason, the auditability of the proposal doesn't quite reach a perfect score. ", "q2r": 4, "assessor": "z_assessor_2585", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6236, "q0": "This proposal seeks funding for the creation and integration of a Decentralized Journalism Protocol to the Cardano blockchain.\nThe problem is clearly stated, deterioration of links on news articles, lack of transparency about article visioning and profit models value hyperbole over facts. This proposal wants to address all these problems and more.\nThe ideas behind the protocol are very well explained in the proposal in text format and are presented in video format for the voter to listen to.\nThe impact of this proposal could be huge give a decent adoption rate is achieved. Even a small part from the news and media user base on cardano will dramatically influence the use of the blockchane.\nThis proposal is clearly in line with the challenge due to its inherent integration aspect.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer presents the ideas in detail in the proposal but also provides a link to the white paper of the project. This is a monumental project and a game changer if successfully implemented and adopted and this proposal will fund just a part of that development. The proposer confirms that he will return to Catalyst for further funding.\nThe proposer is a one man team. However he sees this as a risk for the project and the funding will partially go for consultancy for the development of a larger team.\nThe second risk that the proposer sees is traction and part of the funding will go to consultancy for the marketing of the project.\nThe plan of the proposal is very well presented, detailed yet concise. I couldn’t summarize it better for the voter, my recommendation is that the voter should read directly from the proposal.\nThe budget is very well made, super detailed and toughtfull.\nIt is noticeable, that less than half of the budget goes for a salary of the proposer as a developer at a reasonable rate. The rest goes for consultancy and hosting.\nThe proposer present himself very well and provides github and linkedin links for further investigation. At linkedin we could see that the proposer has more than 6 years of experience as a developer.\nThe proposer does not have any other proposals previous or in the current fund.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The project will be open source so the community could verify the progress directly from the repository.\nThe software will be downloadable and anyone interested could check for bugs and test it.\nOn top of that the proposer will make demos with the software and post them on youtube.\nThe developed business and engineering plans will be posted for public access and could be examined by the community. \nThe timeline could be taken from the detailed plan.\nThe success metrics are for the long term, for the whole project completion. For this stage of the project there is no success metrics provided. \nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2795", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6913, "q0": "Explanation of Use Case and Clearness:\nThe use case of the proposal will try to bring a dezentralized journalism tool to Cardano that tries to bring back trust and better documentation of sources back to journalism. The proposal is written clearly and gives indications on how the future product will look like and how it should be used. The product behind the proposal supports the open source character of Cardano and can have a positive impact on the product portfolio of the blockchain. \nCompetitor:\nNo Competitors are mentioned in the proposal. The proposer says clearly that this product can be implemented on any blockchain, therefor there is a risk on either having a parallel product on another chain or even having the connection to Cardano lost. The proposer should try communicate more reasons why cardano ist he right place tob e for this project. \nLink to challenge setting and other challenge settings:\nThe proposer explains the fit of the proposal and states that it fits into different subcategories like marketplace for journalism, social media integration tha can be agreed on generally. \nRisks:\nAs this project is still in the beginning, the risks outlined are rather general and reference tot he sucess of the project development. The proposer should give more detailed risks to give the voter and the community a more dense sense of what could go wrong. \n", "q0r": 4, "q1": "Showing of realistic timetable:\nAs the proposer is still alone in the project the project timetable seems to be pretty packed. Even though I have no experience with programming work, the points layed out seem to be too much for one person. Building a team and reaching out to consultants will be extremly important to hold the deadlines for the project.\nBudgetfit:\nThe budget is explained in much detail and seems to be realistic. Consulting cost could be calculated with more costs especially for expert jobs like engeneering. My experience as a consultant is that we usually start with 800$ a day but this can easily double with more experience. Therefore the proposer should calculate more conservative. An open point with the budget would be the 10% margin that is mentioned. If this is meant as a profit margin I would doubt that this should be founded. The proposer should think about taking this part out of the calculation to give the community the feeling to not fund somebodies wealth but to fund their work. Nevertheless all costs are transparent and this can be seen as a positive point over all.  \nMotivation/drivers:\nThe proposer shows a lot of passion in his idea and sets out reasons why this product is important for him and the world. This can be seen as a motivation and driver of the project next to building a sustainable product that will give the proposer the chance to live of (as fuure transactions will incentivise the development team). This profit thinking can also be seen as a motivation.\nTeammembers and experience:\nAs there is only one person in the team right now there is also only limited experience. The proposer sees himself as an allrounder that can be agreed on with the sentences about his past experiences. A Linkedin profile would be good to have to have a more detailed view where the experience is coming from. \n", "q1r": 2, "q2": "KPIs and goals:\nThe KPIs mentioned are only qualitativly meazured. As this is just the start of this project and there is not even a beta version of the product yet, the first goal is to complete the code and finish the product. Unfortunately this cannot be enough to get funding as the community needs a more detailed view on how the progress of the project is going. Quantitative meazures should be established as well as they are always easy to report and show tot he community to weigh against.\nCommunication channels and audits:\nThe proposer lines out that he will inform the community regularly and will make the code available so the community can look at it. Also the application will be provided so the community can test the application.  \n", "q2r": 3, "assessor": "z_assessor_2848", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7192, "q0": "The proposer, Brad Corlett, is trying to solve the problem by creating a trustless news source that uses the Cardano blockchain for immutable and historically accurate and auditable publications which eliminates the possibility for link rot and having a permanent news articles for future generations to come. The product as of now is in it's infant stages but the hopes of this proposal is to create a beta version of the idea that will allow further development. The proposer has created a white paper shared via a link here: (https://dbranch.news/dBranch-white-paper-v1.pdf). Within this document the proposer has a well thought out and detailed explanation to the overall vision of this solution, most importantly to provide an unbiased news source that is reviewed and published only after it's declared credible and while remaining untampered with the help from Cardano's blockchain technology. With the use of DAOs, the Dbranches* throughout the whitepaper for future community involvement behind the core proposal and it's functions, will be completely decentralized, which is a very strong aspect of Cardano and it's ecosystem as a cryptocurrency changing the world through blockchain technology. This proposal is but a stepping stone into what the mainstream media could look like in 10-20years time, but it must start somewhere to ensure the public is receiving quality and accurate news that's not manipulated by big news outlets for their own personal gain to exposure and the possible creation of 'fake news' that we've been enduring throughout the past. This proposal's impact as it stands is given a 4 based on the progress of the idea thus far, but the proposer hopes that with funding, and returning to Catalyst in future funding rounds, to create a top notch product that deserves a 5 star rating. ", "q0r": 4, "q1": "The core of the problem lies in the solution, as there is no decentralized news outlet in the world today utilizing blockchain technology. The proposer has devised a sensible plan to kickstart the development process of the functionality of the product, building a foundation to create a business model capable of producing a team in order to complete the tasks outlined within the whitepaper provided; link previously shared. The proposer, Brad Corlett, has described himself as a jack of all trades, having 10 years experience in media at Premiere Digital Services, a documentary film maker of 8 years and six years as a full stack developer. He has provided a Linked-In profile (https://www.linkedin.com/in/bradcorlett/), and his social media twitter & youtube channels within the proposal. Admittingly, Brad understands he doesn't have a large social media following but he does have a huge idea being presented to Project Catalyst in this funding round. The budget for this proposal is set to allow for growth of the solution to the problem, including the developing cost, cloud services necessary for web services and storage, as well as consultation cost to refine a concrete business model moving forward and expanding the team. With the given timeline of 4 months, this proposal could return to Catalyst upon completion of the tasks outlined here for additional funding. The impact rationale for this first phase is a 4 based on experience of the proposer and the likelihood of the solution to the problem being implemented successfully if funded.", "q1r": 4, "q2": "As stated by the proposer, this proposal seeks to create a beta product and after some backend development, produce a business model for a future funding round. In regards to the auditability of the proposal, the community will be able to review the open source code and download the software being used to check the progress being implemented of the outlined features. The proposer has also provided a link to Github, where milestones from the roadmap can be documented and viewed by Project Catalyst to maintain transparency (https://github.com/b-rad-c). This proposal has very little risk at this time, as it is to create a beta product, with the real risk coming at a later date once a working version of the solution is designed and further development is needed from newly recruited members of the team. Finding those developers within their specified fields of expertise may be difficult unless they're presented with an ample opportunity to build off of a working beta. The KPI's of this proposal are yet to be determined but the SDG goals are to create a sustainable source of accountable trustless and transparent institution based on information provided by the Dbranch.news. A rational score for auditability is also given a 4.", "q2r": 4, "assessor": "z_assessor_2883", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Our protocol will use IPFS content addressing and the blockchain to create an immutable, auditable history of publication. Our neutral UI will force external reviews that disincentive sensationalism.", "experience": "I have 10+ years of experience in the media industry. Several as a doc filmmaker and 6+ as a software developer. My experience as a generalist allows me to envision the final product and build a team of experts to go from prototype to beta to final product."}