{"id": 420385, "author": "lendingpond", "title": "NFT machine learning evaulation", "url": "https://cardano.ideascale.com/a/dtd/420385-48088", "category": 26595, "amount": 30000, "description": "NFT buyers, sellers, lenders, and borrowers need to have the necessary tools and evaluation tools to make educated decisions on selling, lending, buying, and borrowing on NFTs.", "f6_no_assessments": 7, "f6_rating": 3.4285714285714284, "videos": [], "media": [], "f6_assessments": [{"id": 6444, "q0": "A NFT valuation tool can be extremely important for nft assets. The idea behind this is to create a tool that can provide potential value of an NFT asset based off of rarity, price floor, and supply. The community currently doesn't have a feature that helps a user determine the real value of an NFT. The proposed idea includes this NFT machine learning evaluation because it will help their NFT lending/borrowing protocol to have more accurate information for their community. This has potential to create a lot of value on the Cardano. I look forward to seeing how this idea could benefit the ecosystem. There just needs to be enough demand for an idea like this and a community that is aware of the idea. I would suggest reaching out to the community members of Lending Pond to get their insights on how they would like to see this implemented. For these reasons, I give this section of the proposal 4 out of 5 stars.", "q0r": 4, "q1": "When looking into the team behind the project, I had to go to their website before I was able to find any information about them. There should be information included in the proposal or at least refer to the website to find details on the team members. This is important because it will allow proposers to see that there is a dedicated team behind the project. The proposal includes a roadmap that is very simple and straight to the point. The important part is that it includes specific details in regards to when they plan to accomplish certain things. They plan to start at the beginning of August and implement the proposed idea in September. There could be more specifics in this section. But the information is technically sufficient. There is also a budget breakdown that shows exactly where the team plans to allocate the requested funds. The requested funds match what the budget breakdown suggests. These are all important because it allows the team to be held accountable in the respected areas. I have to give this section 3 out of 5 stars because there can be more information included in the plan and should include the teams experience in the proposal. There should also be more information supporting their specific dates of completion. The plan should have more vigor and determination. It should be informative and also convincing. ", "q1r": 3, "q2": "There is a decent amount of information provided in this proposal. I would say that it is enough to get the point across, but it doesn't seem too convincing to me. There should be more specific dates included and as stated above, there should be inclusion of experience and accomplishments from the team. However, the project idea to bring a tool that supports NFT valuation could be extremely important. It can help users or even companies to determine value of certain CNFT assets. Something that should be implemented into this proposal is a statement on the current community or supporters of this idea. I would suggest that Lending Pond should reach out to their community and inform their community of this proposal. They can receive more insights and opinions. This would help audit the potential success of this proposal and would increase the amount of accountability that takes place. It is extremely important for the proposers to be held accountable. We are in a decentralized space and anyone could take the funds and go. We need to make sure that the information provided is sufficient to determine the likeliness of this proposal being implemented successfully. For these reasons, I suggest this information to be considered carefully and implemented. I give this section of the proposal 3 out of 5 stars. There is a good product behind this proposal. However, there should be more specific information and a section that includes how the team plans to be accountable for this. ", "q2r": 3, "assessor": "z_assessor_2817", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 13614, "q0": "Looking at the idea of ​​​​the proposal, it is an interesting solution to help NFT traders accurately assess the value of an NFT.\nNFT is currently the most difficult asset to value and extremely abstract.\nThe idea here is to create a machine learning that is able to analyze NFT indices and price data to determine a price range for that NFT.\nIn this proposal, the author has not clearly described the benefits that this solution brings and which challenge it is addressing.\nIn my opinion, this solution gives traders a potential analysis tool on the value of an NFT. From there easily make buying and selling decisions, loans or mortgages. Help drive the number of transactions on Cardano.\nRegarding pricing tools and data sources, in my opinion, relying solely on lendingpond data sources will be incomplete and very easy to go wrong or can be easily manipulated by a group of bad people.\nIt is another risk that I would like to further suggest to the author, price data needs to be obtained from multiple sources and price averaging will be more reasonable. This helps to minimize price manipulation.\nAnother risk is that the information fed to machine learning is wrong. This leads to machine learning that will analyze the prices of skewed NFTs in the future. Therefore, it is important to ensure the accuracy of the information.", "q0r": 4, "q1": "The author's plan is quite simple and I see a problem of execution time. The author only needed 1 month to complete a machine learning program. That is unusual because a machine learning program created would be very complex and take a long time to develop. I don't think one month is enough to develop a good quality machine learning.\nNext, it takes a lot of time for humans to feed the machine learning data and teach it. It's not something that can be done in a month.\nI think the author needs to clarify more about the technology and solutions for developing machine learning programs. This helps me and the voters clearly understand the feasibility of your proposed implementation plan is really feasible with a short time of only 1 month or not. Or is this a proposal to take Catalyst's money and disappear.\nThe cost description is also not really clear about the work to be performed and the cost for it.\nInformation about members is completely anonymous and no other source of information has assessed team members as qualified to complete this proposal. Looking at lendingpond.app which is the application that the team has completed, I see that this is a product that lacks investment in terms of user interface and technology. So I will not overestimate the team's ability to implement this proposal.", "q1r": 1, "q2": "The information about the implementation time of the proposal is not reasonable. The time is so short of only one month, it will be difficult to complete a machine learning program.\nThe KPIs are not clear and sufficient to assess how the success of the proposal will impact the development of the Cardano ecosystem. The author does not explain how these metrics help the Cardano ecosystem and how it affects Cardano.\nThe author does not provide a public channel to provide information about the results of the work done. This will make it impossible for me and the voters to keep track of what results the proposal has done and how it affects Carano and whether it actually addresses the requirements of the Challenge.\nOverall, this is a proposal that has a lot of problems with implementation time, unclear cost descriptions, unclear KPIs, no public channels for implementation results. Especially with the short implementation period of only 1 month, this proposal will fundraiser 50% of the amount from Catalyst in the first disbursement. If the team doesn't come up with a reasonable explanation for this, I'm terrified that the goal of this proposal is to take Catalyst's money and disappear.", "q2r": 1, "assessor": "z_assessor_3702", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1952, "q0": "The Lending Pond team is proposing a project that will include NFT’s, machine learning and price evaluation. These are all very hot topics on their own within the industry today, and combining them could prove to gain some real traction. The use case is interesting and should be explored. The “Dapp..” challenge setting is very well aligned with the proposed project and if implemented correctly, could prove to be a standard tool in the future. The score, in terms of impact, will be 5 points as a result.", "q0r": 5, "q1": "The lending pond team is experienced within the Cardano ecosystem since they have developed and delivered their existing application on their website. This gives them credibility in that sense, although the proposal itself does not reflect this to any greater extent unfortunately. A suggestion is to more explicitly list the team's experience to increase the transparency to the community. It is easy to see that they can deliver applications, but some provable experience with machine learning would further increase the feasibility from the community’s perspective. \nThe detailed plan is more or less a draft with no real details revealed to the reader. This could be refined to showcase what work goes into each phase and what the expected outcome should be. The same could be said about the budget, no hours are provided for each phase. It is not known if 1 or many developers will work in parallel, therefore it's hard to say if the hourly wage is reasonable or not. This could be improved by listing estimated work hours + the hourly wage. \nOverall, the project is probably feasible to an extent, but the proposal does not reflect this unfortunately. The score will be 2 points, but the proposers are suggested to look at other previously funded projects to structure their feasibility section.", "q1r": 2, "q2": "The proposal is quite sparse when it comes to auditability. A good beginning in terms of KPIs and measurables are outlined but it is recommended to determine more hard KPIs that can be measured and evaluated at the end of the project and during its development. It is mentioned that the goal is to integrate with 4 of Cardano's biggest apps, a suggestion is to list a set of 8-10 candidates which you intend to integrate with. This would make your ambition more clear and easen the auditing process for the community. Furthermore, a public channel (blog/website/discord channel) should be provided explicitly, where you push your regular updates to the community.\nOverall, the auditability is not great in the proposal in its current state and could be refined with the tips given above. The score today is 2 points for auditability. ", "q2r": 2, "assessor": "z_assessor_2290", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4476, "q0": "This proposal aims to use artificial intelligence to allow anyone to value their CNFT using a vector machine learning algorithm. This would be made available as an API to other NFT platforms not just Lending Pond, so I see this as a potentially high impact addition to the Cardano NFT ecosystem and a great application of the challenge setting. Relying only on broker- or peer-provided valuations is costly and not in the spirit of decentralization, and could be used to \"game\" less-knowledgeable users to either overpay for NFTs or sell too cheap. The proposal directly relates to market places, lending and borrowing against NFTs, and can have wider use in the area of collecting unique items of value tokenized as unique non-fungible proof of ownership, potentially benefiting other DApps as well. Machine learning requires a lot of data to produce meaningful results, so to start this development early with an MVP on an exiting platform like Lending Pond where some data points are already available is a good idea and even if initially results are not very exact this seems like a worthwhile undertaking to get the process started.", "q0r": 5, "q1": "The team behind this proposal have over 4000 followers on Twitter and 2000+ on Discord, a working DApp and SundaeSwap among their partners, which lends credibility to their proposal. I have no doubt that the tool described in the proposal to value NFTs using machine learning can be integrated into the existing Lending Pond platform with ease and the team have the track record and skills to make this happen. \n\nWhat I am missing from this proposal and what would have improved the presentation of the idea to request funding a lot in my opinion is a more detailed description of machine learning and valuation - how this works, and what level of output/valuation quality the community can expect in the beginning (not very high I assume) and then over time as the algorithm learns and has access to more data (ballpark correct for NFT valuation would be a huge achievement and quite tricky I imagine).\n\nIt would have been nice to get more details about the proposed vector machine and how the very short 10 day research period can produce meaningful quality of the evaluation. Knowing that your CNFT is worth x ADA or USD would be fairly pointless if this value is not trusted enough by other users of the evaluation tool to pay anywhere near this value, or if there is a high risk that your super-rare CNFT might be substantially undervalued by the tool and you sell it way below market.\n\nIt would also have been nice to see a more detailed itemization of the $10000 for development costs and salaries, and how the $8000 broker salaries will be determined (hourly rate, per NFT assessed, who are these brokers etc.).", "q1r": 3, "q2": "This proposal can be implemented over a bit more than a month, with an October releasegiven as the latest. Therefore, it is likely that half of the funding will only be released after a successful close-out. The human resources exist inside the team to carry this out regardless, so I see this as a positive factor for the auditability. It is nice that the development timeline is given with exact days and we will be able to communicate with the team via social media and check on the progress of the tool. I agree that for the scope of the project enough has been done to ensure it can be audited sufficiently.", "q2r": 4, "assessor": "z_assessor_2554", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7609, "q0": "I believe that this proposal's idea is actually a great one. As an assessor I would like to see exactly the method of which this evaluation system will operate. Even if the specifics aren't exactly ironed out, I think it would help this proposal to have a general outline or explanation of how this machine learning evaluation model will operate. For instance, how are the data points valued?, how is the data pulled?, etc. I do think that this application could be a positive value added to the Cardano NFT ecosystem. Being able to have accurate NFT appraisal estimates can have several use cases. ", "q0r": 4, "q1": "I am uncertain if the proposal can be completed do to the vague nature of the proposal's solution. Additionally, the team has stated that they are working on other F9 proposals. The timeline is confusing as there are two different timelines laid out in this proposal. One that has the completion occurring on September 1st and then one on October 1st. I'm not sure if these two timelines are related. If these timelines are not related it may be helpful to make that distinction. I don't have any issue with the amount of funds requested for this proposal. It appears these values are appropriate for the scope of this project.", "q1r": 2, "q2": "I really don't see anywhere in this proposal how the progress of this proposal, if funded, will be documented. There needs to be some indication of how this project's progress will be tracked. At minimum a user survey, application traffic, etc... I would also recommend regular updates on the development of this evaluation machine on your discord and on any other social media platform. ", "q2r": 2, "assessor": "z_assessor_2907", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9741, "q0": "The proposal falls in line with the challenge specific goals by adding features to useable Platforms already built on the Cardano blockchain. The team is bringing creative thinkers together to drive adoption and more users to the Cardano ecosystem. They already have a working NFT project for cardano, \"  lending pond \", and this was the first of its kind on the cardano blockchain. So they are innovating the space, and seem to have a good grasp of what the cardano expects from specific projects. What the proposal aims to do will expand the cardano ecosystem by allowing cross chain compatibility on NFT price discovery. ", "q0r": 5, "q1": " The proposers are the team behind  lending pond, which is a leading NFT platform built on the cardano blockchain. The proposal aims to add new important pricing information for NFTs, to make it easier and more transparent for people to trade and lend their NFTs. The fact that they already have a working platform makes the success of this proposal very good in my opinion. The proposal will also be successful because it solves a real problem: there is no way for users to know how much their NFTs are worth right now.\n\nThe success of this project depends on two main factors: the level of participation by other NFT platforms in the space, and the support of Cardano itself (which has already expressed its support). In my opinion, both factors are favorable: there are many platforms interested in creating better price discovery systems for digital assets, as well as many companies interested in creating new ways to use NFTs.", "q1r": 5, "q2": "The team already has specific rollout dates for important parts of the proposal, and already has an idea of which applications will be leveraging the tools they are planning to build. It is clear from the proposal they know what metrics to use to measure success of the proposal internally, but for the average user or community member it may be difficult for them to track the progress if they don't completely understand the technical of the proposal. It would be nice to see something implemented to give a more strait forward way to track the teams progress, even if its just something like monthly community updates.", "q2r": 5, "assessor": "z_assessor_3088", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12223, "q0": "The proposal presents the problem of lack of access to evaluate the price of NFT broker for seller, buyer, lenders and borrowers. The proposer aims to make a tool to evaluate and analysis the price of NFT broker, therefore, they (seller, buyer, lenders and borrowers) can make right decisions. The proposer named that tool is Lending pond. Lending pond will create NFT evaluation process by using machine learning which is contain and use vector machine model to estimate NFT value based on historical data and key parameters such as, rarity rank and trait sales floor are name of few. Thus, it gives they (seller, buyer, lenders and borrowers) to analysis the price of NFT. Thus, the proposal addresses the challenge", "q0r": 5, "q1": "When asked if the plan can be executed, we need to look at if the plan is doable. There is information about the plan and budget but lack of information about people who in charge the project. we do not know team leader and team member who work this project and their expertise. The proposer stated that the team has skill and experience in develop NFT tool for Cardano. Although, the team has skill and experience in develop NFT tool for Cardano, the proposer supposed to provide individual description of who they are and summed up by their contacts on social networks, Thus, it would make to know them better and improve confident that proposal will implement successfully. About the scripts, perhaps the proposer put the plan into the phase with also mentioned the date project start and end. This would help understand the community of your plan proposal thus, it would enrich your planning program. I like the proposer idea, but lack information about, make me neither agree nor disagree proposal will implement successfully", "q1r": 3, "q2": "The information provided is alright and the project is still auditable. The proposer provides the time to complete every task which in line with their propose plan. Perhaps, the proposer could submit/publish the progress report on weekly since time table based on weekly. Perhaps progress report could publish in discord channel or social media that team has it that would be provide transparency and able for the community to monitor project progress. Overall, the information provided sufficient to audit the project progress.", "q2r": 4, "assessor": "z_assessor_3367", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "The lending pond team will create and fine tune a vector machine using machine learning to mimic the price evaluation of a NFT broker.\nThe machine will also take into account floor price, traits, vol", "experience": "The team behind Lending Pond which is the second or third most active NFT platform on Cardano, and most active lending protocol on Cardano. Lending Pond also is the first and only lending protocol on Cardano ever."}