{"id": 420588, "author": "chadinassar", "title": "PLUTUS.ART: NEW KIND OF MARKETPLACE", "url": "https://cardano.ideascale.com/a/dtd/420588-48088", "category": 26595, "amount": 96000, "description": "There is a lack of innovation in what marketplaces do in the Cardano ecosystem. They do the same thing only with different UI.There is not enough competition with only 2 marketplaces leading all sales", "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1699, "q0": "The proposal is really well aligned with the challenge, directly meeting the KPIs present in the campaign summary of: “increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products +increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community”. This is due to the fact that an integration will be built that deals with solutions that already exist in the ecosystem, but are not innovative. An interface (a marketplace) will be built with new features similar to what already occurs in an Ethereum marketplace (looksrare) and which leads the market. The lack of innovation, according to the proponent, causes Cardano’s marketplaces to be more of the same, unfortunately, so it is necessary to invest in marketplaces with new functionality, in new market infrastructures, involving new smart contracts and tokennomics for the Cardano ecosystem . The bidder places us very well on the functionality that already exists in Cardano's current marketplaces, such as buying and selling CNFTs, bulk purchases, offers, auctions, etc. All this will be kept in the application created here, but new features will also be added, for example: “Reward users for interacting with the market + Gamifying user experiences through the XP collection + New incentives to trade NFTs in our market + Encouragement for NFT collectors from other blockchain NFT fans to migrate to Cardano NFTs via our tokennomics + New gamified experience in NFT markets that will increase user activity and satisfaction”, etc. The idea in theory is amazing, I think the impact can be maximum for our ecosystem, but I have two doubts regarding what has been said: “We anticipate that more and more users will come to our Marketplace and Cardano due to the new way we will structure Plutus .art and the reward system”, what would that reward system look like? In the excerpt “Indeed, the rewards system that we have implemented is a new approach to doing things in the Cardano Ecosystem + we will be working continuously on internal resources or through partnerships (for example: we want to approach CNFT.party and NFTMakerPro for their minting) to include more than is necessary to make Plutus.art a one-stop shop”: what would CNFT Party and NFTMarkerPro be? It would be interesting for the proponent to better clarify these terms, for those who are not previously familiar with these projects. Other than that, the proponent places us well in relation to the risks and solutions that the project may have to face, in general the proposal is of a high level, despite the small details that could have been better explained.", "q0r": 5, "q1": "The proposal roadmap is good, we know what would happen in the next 3 months (July, August and September). However, despite the proponent explaining a series of actions that will be carried out in these months, I think the same activities could have been more detailed. Talking about July: “Collections, Market Research, User Profiles, Buy/Sell Functionality, List NFT, Remove NFT, Update NFT Price, Offers on Wallet Contents…”. How would each of these actions be developed? It seems to me that the proponent mentions what would be the successes for that month, the expected partial results. But we don't know in what way these activities will be done, as their behind the scenes, let's say, of such works. Who would do what to make market research possible? How would user profiles be drawn? How would the NFT listing be done? That is, we know what would be done, but not how it would be done, and that is also very important to me. The funding requested is well explained, we know what the hourly rate of the professionals would be (50 dollars per hour, a very fair value compared to the current market). The total amount of 96 thousand dollars is divided into several parts, we know who would earn how much and what they would do, as for example in “1 backend engineer - They will be creating the server side of the website, developing the remaining API and the logic for posting and retrieving data - Monthly: 160 hours x 50 USD = 8,000 USD / month”. My observation regarding this part of the proposal is that it would be interesting to set aside some money to hire a designer, so that the interface is as good as possible in terms of user experience, and I also think it would be important to have some marketer involved, to help publicize this new platform in the most assertive way possible. About the team: this part is excellent, we know in great detail who the professionals involved are, what their backgrounds are, how they relate to Cardano, links to their social networks (twitter) are also provided where we can get to know them more specifically ; as is clear in the excerpt “FettuccineNFT is a marketing professional, his background is in Finance from Santa Clara University, head of marketing for a payment processing platform, C-level of an olive oil company, marketing director of a medical outreach company and much more. Also, their experience in the Cardano community, as well as the experience in the ecosystem through their Angel Baby Hit Squad project (the first ETH NFT with ADA Utility), etc.” My only suggestion then would be that linkedin profiles be made available as well.", "q1r": 4, "q2": "Unfortunately this is the most lacking topic in the entire proposal, the information provided for both progress and success auditability is quite short. On Progress: “Project progress and development will be provided/required weekly by the team. This will be done through twitter posts and medium articles like progress reports.” How will these reports be made, what content will they be composed of? How often will they be posted? Would there be so much detail on what was behind the partial results (the work routines, specifically) or would there just be updates on what was done, as a kind of check? It would be necessary to have more information about what would be posted and also how often, we know that internally the team would update once a week, but does this mean that updates to our community will also be made at that frequency? How will members of the Cardano community know when the project's social media will be updated, will it be publicized in our communication channels? About success, he is described as “Having a fully functional frontend and backend from the market that the community can support and be proud of. By the end of 2022, we want to be the premier Cardano marketplace in the world and give back to our community through this new technology.” It would be necessary to have a deeper understanding of how this final scenario would be evaluated, studied and how this research would be passed on to community members. How can we view Cardano's new marketplace as a high-value application that has had tangible positive consequences for the entire Cardano ecosystem? In addition to understanding what was created (about the final product itself) it would be necessary for a case study to be carried out, that is, to have concrete data that demonstrate how the marketplace boosted Cardano's economic activities, such as: greater commercialization of NFTs, more smart contracts being minted, more Ada in circulation, etc… If this platform would have encouraged more and more people to become active members of the community, through the opportunities that would be emerging; all this would need to be understood and passed on to us, as the proponent has already established a communication channel with the community - twitter - a final report could be prepared and posted directly there. For these reasons, unfortunately I think that many changes and improvements should be made regarding auditability, so that the proposal can be considered easily measurable and simple to monitor after funding (both the development process and the final results).", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2, "reply": "Even though I agree with the auditablity assessment here, the fact of the matter is that we are not there yet and to set those KPIs from now would not make sense. Yes, I agree that once we are launched we would have goals that would bring about all the KPIs mentioned here. Though at the moment, our main focus is to be able to bring the new tech we are working on and go from there. Also, we thought it was made clear that we are our rewards mechanisms are there to ensure we encourage users to come into our ecosystem if they are not there yet + encourage users to come use our marketplace from others. If that was not clear enough in the previous sections, we will make sure they are clearer in the future. "}, {"id": 4204, "q0": "The \"Plutus.ART\" New kind of marketplace proposal addresses the Dapps, Products & Integration challenge by building a new marketplace with Plutus Smart contracts. Their platform will allow more competition within this NFT marketplace space which is dominated with only a few players. Their NFT marketplace differs from their competitor that it will reward users for engagement and gamify the experience through XP collection. There would be new incentives for trading NFTs and will migrate NFT enthusiasts to Cardano and boost user activity and satisfaction. Their solution is inspired by the 'LooksRare.org' inspired tokenomics and a gamified experience and will structure Plutus.art and the rewards systems in place to entice the users. They will also reach out to 2 well known platforms in Cardano which are CNFT.party and NFTMakerPro for their minting service and to make Plutus.art as a one-stop-shop.  The proposal fits the challenge very well as the challenge is looking for Dapp that will bring impactful user case to Cardano ecosystem which will drive more Cardano adoption of NFT buyers/sellers, NFT art makers, Gamers etc. They have identified what could be the challenges for the projects and has ways to mitigate those risks. ", "q0r": 5, "q1": "They have listed down monthly timeline and also located beta users through twitter. From their monthly tasks, the project looks very ambitious and with total period of 3 months to complete all tasks, it would be quite a challenge for the team. The fund will mostly goes toward developers at a pay rate of $50/hour. There are a lot of well known NFT creators in the team adding to the credibility of this project. The team also works with The Canonical LLC well known for works on jpg store, NFTMaker Pro, CNFT.io and artifct (audits) ensures that their marketplace will be functional and secure. With the budget breakdown, strong team members and a very detailed set of functionalities listed in their milestone, I am very confident that the project will be carried out successfully. The team might want to consider expanding the timeline of 3 months in completing the project as a lot of functionalities need to be tested before launched and the team should provide some time in case things not going as expected. They should also include whether the audit will be done as part of this 3 months period. ", "q1r": 4, "q2": "They will provide the project update on a weekly basis through medium posts and medium articles. The team views project success as having a fully functional front and back end of the marketplace. They target the project as the leading Cardano marketplace by the end of 2022. The team has understood what CNFT space lags behind and put \"Plutus.art\" as a novel NFT marketplace to handle these shortcomings and boost the CNFT market activities. They have mentioned their KPIs for the community to track the project progress in the milestone section.  Some of which are amount of reward distributions and the launch of all functionalities. The proposal will improve if the team would summarize them again in the auditability section for easy reference to voters and to make it productive both for the team and the voters to see that the project is on track and will eventually complete. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "This person makes sense. They understand what we are aiming for, thank you!"}, {"id": 6758, "q0": "The idea of this proposal is well laid out and I believe directly aligns with the challenge.  The problem described is that there isn’t enough innovation in marketplaces in the Cardano ecosystem.  They plan to create a new NFT marketplace that includes new features like their own token, vestation periods, and rewards for users of the marketplace.  The proposal does a good job at explaining how this will provide value to the Cardano ecosystem by incentivizing trading on their marketplace and even incentiving new users from other blockchains to trade on this new marketplace because of the rewards.  I agree that this would be valuable to have in the Cardano ecosystem.\n\nOne of the goals stated in this proposal is they want to become the most used Cardano marketplace in the world.  This is a great goal to include because it also perfectly aligns with goals of this challenge which is to increase users of newly funded applications.", "q0r": 5, "q1": "The co-founders of this project have all been in the cnft scene since its inception.  The proposal states that one of the co-founders, Stale, was also a co-founder of cnft.io, the first cardano marketplace.  I’m glad this proposal included that information because it shows they have a developer with relevant experience and that they have produced working products on Cardano in the past.\n\nThe timeline provided is a very detailed, 3 month breakdown of all the milestones the team plans to reach.  It shows there are clear actionable steps that the team plans to take to reach their goals, and that they are well prepared to do so.\n\nIn the budget breakdown, the team is very transparent about how they calculated the amount for the total requested funds of this proposal.  They plan to use the funding to pay for the wages of four different full time developers for 3 months at a fair hourly wage. This is $50 per hour for blockchain developers according to their market research.  They also provide descriptions of what each developer role will be responsible for, which is nice for extra transparency.  After the three months have passed, they hope to be self-funded through transaction fees of the marketplace and that they ideally won’t need to request funding again if they are successful.\n\nIt’s important to note that this is the only proposal this team will be working on from this fund and any previous funds. With all of this in mind, it seems highly likely that this team will be able to implement this proposal successfully.", "q1r": 5, "q2": "The proposal states that weekly updates will be provided on the official twitter account for this project as well as through medium articles.  This is great for transparency and really helps the community track the progress of this proposal, especially since the timeline outlined in this proposal provides clear milestones to watch for.  They provide a link to the twitter account in this proposal but I can’t find a link to the medium account where progress report articles will be posted.  Ideally both links would be included in the proposal, but it’s not a big deal as I’m sure the team would happily provide the medium link if someone asked in the comments or on twitter.\n\nOne of the goals in this proposal is to be a leading marketplace on Cardano but they do not provide any KPIs they plan to use to determine that.  Some examples of metrics that could be tracked are daily ADA volume, number of daily transactions, and maybe number of daily or monthly active users.  It would have been nice for clarity reasons to include what metrics they plan to use to determine if they are the leading marketplace.  However, I believe it is safe to assume that the metrics I provided are the metrics they will use because they are common metrics to use when comparing marketplaces.  \n\nI believe this team has been very transparent and provided sufficient information for tracking the success of this proposal.  The only things missing are what metrics they plan to track for determining success and a link to their medium account.", "q2r": 4, "assessor": "z_assessor_2826", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you, this makes sense. We appreciate your feedback."}, {"id": 9525, "q0": "I rank this section a 4 because there is one piece of this section that answers the problem statement and presents modeling evidence. The problem statement is questionable and possibly creates more obstacles for this proposal than it does in establishing a need for it. I’ve made a point to interact with every NFT marketplace and it’s a relatively similar experience on them all, as this section states. I’ve also interacted with many of the devs and many have expressed difficulty in developing new features within an expected timeframe. There are at least 9 recognizable Cardano NFT marketplaces that list all of the same features (some of which do offer rewards through the marketplace) but the gamification of marketplace interaction is something very new. In that, the shortcomings of this section of the proposal is absolutely not because of lack of a unique idea, it’s more in the realm of impacts that are not quantified. Without tangible quantification, impacts are more of a matter of speculation based on rationalized theoretical concepts, If impacts can be quantified with user base, market research, modeling evidence or newly generated volume, the voters can more directly evaluate the cost-benefit analysis of the proposal. ", "q0r": 4, "q1": "I rank this section a 5 because it’s uniquely feasible demonstrated entirely by capability without the need for LinkedIn verification. The entire development team is pseudononymous but still entirely verifiable in their notable creations within the Cardano NFT space. All of these core team members have either created some very recognizable NFT projects or have played a central role in building the smart contracts for all notable NFT marketplaces. So, while we don’t have verifiable resumes to check their professional experience, we do have creations within the Cardano ecosystem to look to (which may arguably be better in proving capability to pursue Cardano-based development). As indicated in the proposal, the project is already in progress and has been intended to be built with/without Catalyst funding, which should demonstrate to voters that this team is committed to the project (perhaps adding more morale to voter confidence). This roadmap is very well detailed and (since they’ve already been working on the project) it seems like a very reasonable timeframe to see completion in just a few short months. While the overall budget is a good amount more expensive than average Catalyst proposals, this budget is very fair on hourly wages (perhaps even slightly under industry standard in some areas). Everything is well laid out here, so I have no criticisms to offer this section. ", "q1r": 5, "q2": "For lack of any given KPIs to define progress and success, I have to rank this section a 1. This is where the proposal falls short and misses a lot of opportunities to solidify a positive reaction from voters. For an NFT marketplace, I think many voters would’ve expected to see KPIs on user based, number of NFTs sold, volume of NFTs sold, or (in this case) amount of rewards distributed. I certainly don’t expect a scenario where no impact is made as a result of this marketplace, but the measure of succes ONLY defined by product completion is one that does not measure the outcomes that actually link to potential impacts. Establishing these projections will show voters a commitment to a specific level of performance and better enable them to properly evaluate a cost-risk ratio based on what the proposers intended outcome. There’s a lot of value that could be added here to secure a more confident voter confidence. ", "q2r": 1, "assessor": "z_assessor_3063", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "We are not in the stage to warrant the KPIs that the assessor is asking for. This stage is still building and making sure it all works when we are hooked to both testnet and mainnet. The KPIs that are being asked for are after launch which would be the 6 months to a year after beta and when we are in official launch stage. I would agree with the KPIs if we are close to launch :)"}, {"id": 11988, "q0": "Marketplaces on Cardano ecosystem lack innovation. There are two marketplaces that perform the same service but with different UI. The solution proposed is a completely new marketplace infrastructure with new smart contracts and tokenomics for the Cardano ecosystem. The new marketplace will offer all services that every other marketplace does but also provide additional features such as rewarding users for interacting with the marketplace, gamifying user experiences through XP collection.  The gamification feature is already in process and to be released as beta in September 2022. The KPIs of the project are aligned with the KPIs of the challenge in that the new features will benefit the Cardano ecosystem and ADA holders by offering new incentives for trading NFTs on the new marketplace, incentivization for NFT collectors from other blockchain NFT fans to migrate to Cardano NFTs through our tokenomics, novel gamified experience across NFT marketplaces that will increase user activity and satisfaction.  ", "q0r": 5, "q1": "The team consists of experts who have lots experience in the field.  They have provided cv as well as links to their profile and past achievements.  The team members are known to the Community and stand out for the successful projects they have completed in the past.  A detailed timeline has been provided which aligns with the tasks delivered.  The budget is reasonable and broken down into hourly rates.  The risks identified are lack of funding which will be mitigated through catalyst or other sources, finding the appropriate team members to implement the project - screening of team members was already in progress when the proposal was submitted and the team identified has agreed to work in the project. Finally, the marketplace not being welcomed as expected - high quality products and services will be developed for the Community that will be marketed to the Community. ", "q1r": 5, "q2": "A detailed roadmap and timeline have been provided by the proposer aligned with deliverables.  The proposer has done an excellent job in describing every step of the process to the reader regardless of the technical terms.   KPIs and progress of the project will be provided on a weekly basis by the team through twitter posts and medium articles as progress reports. The team is very confident of the project's success and they have all the tools to achieve this.  I strongly support the team and their project both as a user and a PA. ", "q2r": 5, "assessor": "z_assessor_3325", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for the feedback. Much appreciated."}], "solution": "We will build a new marketplace that will involve tokenomics, vestation periods, claiming of rewards and other new technology for Cardano. Think looksrare.org but with Plutus smart contracts.", "experience": "3 co-founders: Fettuccine on marketing, Chadi Nassar on operations & Stale as our Chief Technical Officer. We have all been involved in the CNFT scene from its inception. Stale was the CTO of CNFT.io and will manage the dev team."}