{"id": 420594, "author": "imperium", "title": "Projects Analytics Supertool", "url": "https://cardano.ideascale.com/a/dtd/420594-48088", "category": 26595, "amount": 55000, "description": "Most CNFT projects have failed to deliver at large scale:\ni)True utility for its community, through token-gated products & experiences.\nii) CNFTs with IP to build on top of it.", "f6_no_assessments": 8, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 394, "q0": "A service for tracking NFT analytics and data has been presented. The proposers outline a number of examples where this data can be used such as a pricing tool, project calendar and tracker. The end user of this type of data appears to be mainly these tool builder that would integrate this data into their own applications. It is less clear in the proposal on how this may be priced to these users such as the paying for the usage of the API and how sustainable this might business model may be. Better access to high quality data on NFTs could have a number of knock on effects that improve the ecosystem to improve applications that could use this data or investors who want to get more familiar with the Cardano ecosystem. It would have been good to see some comparisons with existing NFT tools (e.g. https://cnft.tools/ or others) that bring together data about NFTs so that a comparison can be made on the exact differences. Overall the proposal looks promising in being able to deliver some new approaches to NFT analytics to the ecosystem that could also lead to improving the quality and usefulness of other applications building on Cardano.", "q0r": 4, "q1": "The team intend to create a wallet and project tracker as well as a project framework to score NFT projects using a mixture of existing backend tools. Each of the projects have a timeline with the weeks and tasks involved to complete the project. A software licensing NFT collection is also mentioned - this sounds like a release of an NFT collection instead of a tool for the end user. The team provide their LinkedIn profiles that showcase the background of those involved. Most notably the CTO has a number of years of experience in the blockchain space. The team appear to have the right background and skill sets to execute on this proposal. One area of main concern is the amount of tools they intend to build when no evidence has been given of existing efforts to create some of this tooling. Due to the large amount of work that needs to be executed and the lack of evidence that this will be achievable in the short term it is difficult to give a very high feasibility rating. A slightly smaller budget but just focussing on one of these ideas to showcase the teams ability to execute would have been a great first proposal. This could have been for example the project tracker, was the only thing being focussed on and had a more extensive breakdown of the tasks and potentially wireframes to showcase the intentions. In contrast to this it must be noted there are some benefits to trying multiple things at once to see what sticks with the community to determine what is working most effectively. Overall, there is a sufficient break down of timeline, budget and team background that this proposal appears to be feasible. ", "q1r": 4, "q2": "The team outline a list of areas that will be used to track the progress of the proposal such as completion of milestones and usage statistics. The success criteria listed provide details of how they want to grow in the ecosystem with applications building on top and also a desire to help establish more interest in the NFT space to a more global audience by helping to legitimise the space with better infrastructure and applications using that data. It would have been good for the proposers to provide some details of anything that would be open source and if so where that code would be made available with a repository URL. ", "q2r": 4, "assessor": "z_assessor_2073", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4205, "q0": "The \"Projects Analytics Supertool\" proposal addresses the DApps, Products & Integrations by building a token-gated analytical toolset with free & private features (NFT for software licensing) and an intellectual property (brand-as a-service model). The example of which are a data-based score for NFT projects, a wallet tracker, a project watcher, a pricing tool, a stats screener and a project calendar. Building on a brand-as-a-service model, the team views their solution \"Imperium\" as a analytical tool/tracker of NFT projects on Catalyst and a curated platform for mainstream users to realize the potential of NFTs and to allow them for a fractional ownership. The project will onboard traditional retail investors, improve the liquidity of digital assets as a new asset class and boost activity within Cardano ecosystem. The proposal fits the challenge very well because of the above mentioned reasons. They have foreseen the challenge for this project as lack of infrastructure to obtain data, lack of activity in Cardano NFT space, and the need for community access. They also have some mitigation approaches to handle all these risks. ", "q0r": 5, "q1": "There is a duplicate timeline for the first 6 weeks of \"Imperium Project Framework V1.0\"  in the proposal. Also the description of 14 weeks are exactly the same as 6 weeks prior. This shouldn't be the case as the purpose of 6 weeks phase is not the same as 14 weeks phase.  The \"Software Licensing NFT collection\" timeline looks more plausible and will take 10 weeks. If understanding correctly, this project will take 20 weeks ie. around 5 months to complete.  However, the team should confirm this and put in the comment to clarify. The team members are comprised of LatAm team members and Wolfram Blockchain Research Labs. their CTO is involved with the data processing phase of the CNFT awards 2022 and hence, is very knowledgeable on the NFT projects. They plan to come back for F10 for future features ie. Pricing tool, statistics screener, calendar, and refined version of Imperium Wallet tracker. The detailed budget breakdown gives me the comfort that the team knows what they are doing. Although they should specify payrate and number of working hours for transparency. The sufficient info on timeline, milestones, budget and team members give me the confidence that the project will be carried out succesfully.", "q1r": 4, "q2": "The team might want to provide the numeric KPIs for some measures they list ie. amount of curated data, accuracy of results etc. They view success of this project as the engaging community using their analytical tools and building IRL and digital products on top of their brand. One of their commendable goal is for the public to view NFTs as an infrastructure to build on and not just as a speculative asset which could be a game changer to investment portfolio. The team could add the channels they would report back to the community for the project progress either through their own links or bi-weekly meetings. This will help voters to keep updated and boost the auditability of this proposal. The team has understood the problem for the limited impact of CNFT projects and come up with the solution to highlight NFT's utility and IP importance to Cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5594, "q0": "The proposal correctly adheres to the challenge at hand, and that is that although Cardano has come a long way in the last year, it still has a long way to go in terms of the NFT scene.\nTools like the one proposed here abound in Solana and Ethereum, however in Cardano we only have a couple of options that do not meet the full expectation of users.\nGiven that NFTs are generally a great entry point and public activity to the crypto environment, it is necessary to provide competent tools to users to allow a better analysis of their assets, and thus generate the environment conducive to a more active and thriving market", "q0r": 5, "q1": "The team provides a detailed breakdown of the use of the budget, which will be allocated in a consistent manner to the different stages of development of the proposed tools.\nThere is a defined schedule for each of the tools and a well-defined plan with clear needs and transparent resources to be assigned.\nThere is a multidisciplinary team that combines experience in the NFT scene, with R & D, as well as project management, I have no doubt that the plan is achievable and not only this, but that they have the bases and the appropriate vision. to replicate what other tools of this type have done for other ecosystems, allowing the onboarding of many retail users that give the CNFT scene the volume it needs to be in the big leagues", "q1r": 4, "q2": "A series of well-defined KPIs are provided that will serve to measure the progress in the construction of the tool, together with the budget report and the detailed schedule, it should not be difficult to keep a good track of the progress of this project.\nOn the other hand, the measurement criteria to measure the impact and success that the tool may have once its development is completed, are much more ambiguous and are written as good wishes.\nI would have liked the team to finish off this good proposal with a series of well-defined metrics to measure not only the construction stage, but also what success will look like for the ecosystem if it is like this:\n-Volume compared to other strings\n-What % of marketshare would you like to reach\n-Number of active users on the platform.\nTo give some examples.\nI think it's a good proposal, and I would just like to recommend to the applicant team that they refine the success KPI's of the platform once it's in operation.", "q2r": 3, "assessor": "z_assessor_2719", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9717, "q0": "The problem is clearly identified in this proposal and is closely aligned with the challenge. The team aims to deliver utility within the CNFT space by building analytical and tracking tools for Cardano NFT users to make better decisions regarding the allocation of their capital – This will help add value to the Cardano ecosystem by driving growth in CNFT projects and driving adoption as new users would have greater confidence to enter the CNFT space. As a CNFT user myself, there are already a few websites that have analytical and tracking tools for Cardano NFTs, although, many have limited capabilities and it is tedious opening many different websites for different analytics and tools. Therefore, I understand the benefits of a one-stop shop for analytical and tracking tools like this proposal is aiming to achieve. The information provided on the goals of the project aligns well with the outlined challenge settings. With the information provided, it gives me confidence that the team can solve future challenges of the project. They have clearly discussed risks regarding infrastructure, CNFT activity and community and how they would address possible issues.", "q0r": 5, "q1": "The proposer provides very a descriptive background of the team. Through the information provided, it is evident that each member of the team is competent in implementing the project. Their skills and experience are adequate and the variety of specializations give clarity to their ability to accomplish the tasks outlined. The proposer has provided reference links to each team member’s Linkedin profile to support the team’s background. The proposer addresses that they are seeking a community lead, indicating that the proposer knows, in an identifiable manner, the type of team members required to implement the proposal. Information provided on the budget is outlined clearly and broken down into identifiable items. As the budget is calculated in USD, it would be beneficial for the proposer to adjust the placement of the decimal point to add more clarity to the totals. It gives me great confidence in the financial stability of the project as they had allocated funds for contingency. This also indicates that they will be better positioned for any uncertainty inherent in cost and time estimates, as well as an unpredictable financial risk. The proposer also provided reasoning on how all salaries and service fees were defined, adding transparency to their budget. Overall, the proposal’s budget does seem reasonable to achieve set goals. The team’s ability to plan, to further grow and continually innovate is shown through information on the proposal to apply for future funding, for additional tools and features to add to their project. The roadmap is clear, detailed and well designed. The proposal has segmented each project scope and has provided realistic timeframes to complete the work. The phases of each roadmap present a sensible and conductible plan for implementation with a brief informative overview of what is being done. The team have considered the challenges and risk that are relevant to the implementation of the project through possible issues regarding infrastructure, activity in the CNFT space and community. Solutions on how to mitigate these challenges/risks have also been presented. As the proposal foresees reliable infrastructure as a risk, it would be beneficial to explain the technical aspects necessary for implementation. For example, including a description, even if it’s brief, of the architecture and language of the third-party services to be used (Wolfram Cardano Integration and Blockfrost), will give a better understanding of the team’s reasoning for their decision to use such third-party services.", "q1r": 5, "q2": "There is clarity in the description of the problem and the planned solution. Information provided shows clarity in the team's goals and the proposal has a clear understandable description of the targeted problem that can be measured against the proposed outcome. \nThe proposal also offers relevance to the outlined challenge settings. The roadmap presented is detailed and very well designed. The milestones and deliverables were informative with a clear time horizon for achievement. It was easy to track progress through their different project scopes as they had their separate roadmaps. The metrics and KPIs were well chosen and are good indicators for evaluating success, as the chosen outputs would effectively monitor the progress, indicate performance and have a gauge on their community engagement. The auditability is excellent, the team describes in great detail what success would look like through an understandable and effective solution. It would be important for the team to explore having an accessible public channel for delivering updates to the community for auditing progress - An example that may help the team achieve this and that would be suitable for this project, would be implementing a public discord server for their community. ", "q2r": 5, "assessor": "z_assessor_3086", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9729, "q0": "The NFTs market is growing and growing strongly. NFT is a global trend. Not just technology companies like Facebook, Google, Microsoft, etc. Paying attention to NFT, even people operating in other fields such as music, art, investment, etc. also started to pay attention to this asset class. However, it still has many limitations in its application in real life.\nThis proposal aims to build an analytics toolkit with free, privacy and intellectual property features that can be used through a brand-as-a-service model. Their mission was to develop a managed platform for general users to realize the true potential of NFT as an infrastructure to build and deliver products to users. The proposed solution has been described in detail by the author, taking specific examples to increase the argument. In addition, the author has outlined 3 risks that may be encountered when implementing the project and has solutions to minimize those risks.\nI find that this proposal meets the challenge because it improves the quality of the NFT projects being built on Cardano, improves user trust and attracts more users.", "q0r": 4, "q1": "The author has presented in great detail the project's plan and has a specific timeline. The plan is divided into two clear parts: ANALYTICS TOOLS AND FRAMEWORK and SOFTWARE LICENSING NFT COLLECTION. Each section has a specific route. It can be said that the presentation of the author's plan is quite good.\nThe project's budget accounted for 0.7% of the total budget for Challenge. This amount has been allocated to reasonable expenses in a detailed and clear manner. The author also explained that the cost of salaries and service charges are both determined based on local experience.\nThe project team is all experienced and competent in various fields related to cryptocurrencies, technology R&D and investment. They also have a wealth of investment, analysis and evaluation knowledge on NFT projects. I found that they fit the goal of the proposal. Identity is easily verified through the Linkedin profile the author provides.", "q1r": 5, "q2": "The author described how to get the community to follow the project. However, I find that it is not yet detailed and complete. The author should provide some metrics to make it easier for the community to check and track, such as the number of users using the Cardano wallet viewer; the number of users using the tool to view projects on Cardano NFT, etc. In addition, the author should provide a link to the project's social media channels (such as the Website, Twitter, Discord...) and add a plan to update information and progress for the community to interact easily. and follow.\nThe success of the project has also been clearly defined. It is in compliance with defined indicators. In addition, it is determined by the effective use of the user's analytical toolset; engagement of community members and the most important long-term goal is for people to realize that NFT is an infrastructure to build on and not just a highly speculative asset that does not create value.", "q2r": 4, "assessor": "z_assessor_3087", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10035, "q0": "The problem of implementing CNFT projects has not reached its full potential, not implemented on a large scale to provide real utilities to the community. Reaching the full potential of CNFT projects through tokened products and experiences tailored to the challenges to be solved. The solution to the problem is to build a tokenized analytics tool with free features, NFT, and intellectual property, proposing to come up with a solution that has a direct impact on NFT developers and users. Users can realize the real potential of NFT as the infrastructure to build and deliver products, investors will have investments in digital assets, participate in the blockchain economy. The solutionbuilds analytics and tracking tools for Cardano NFT users to make good decisions that participate in the Cardano ecosystem. Users become developers who improve the quality of projects built on Cardano, which in turn will increase trust and bring more users to the ecosystem. The solution is suitable for installed and scalable challenges in the future. The proposal has identified the risks that may affect implementation. Infrastructure difficulties have had a solution to collect processing data, using wolfram cardano integrated service, Blockfrost expanded the scale of data streams. The difficulty of reaching out to the community is solved in different languages that are building applications with english and Spanish languages. The risks have been reasonably minimized, helping the plan to be implemented.\nI rated: 5\n", "q0r": 5, "q1": "The implementation plan is detailed, divided into 4 main stages: The construction phase of Imperium Wallet Tracker v1.0 provides address data and Cardano wallets performed for 6 weeks, each week with specific work. Phase Imperium Project Tracker v1.0 provides projects for Cardano and allows users to view it. The Imperium Project Framework v1.0 phase provides the grading data for the management of Cardano NFT projects. The application implementation phase has completed a UX/UI retest, wed site development, and user engagement community building. The author has developed a good plan, full of work contents, techniques, architecture in the plan suitable for implementation. The proposal identified three key members who performed the work. The information on LinkedIn about members gives us to see their competence is suitable for the job, assigning the work is reasonable. The recruitment of user community management members is appropriate in the process of implementing the proposal. The recommended amount of $55,000 is less than 5% of the cost of the challenge. The budget table contains full details of the expenses for the implementation of the proposal,salary and service charges that have been determined based on local experience. Have a $3,500 hedging budget in line with the implementation process, in case of increasing and decreasing ADA. \nI rated: 5\n", "q1r": 5, "q2": "The roadmap is clear, the work is carried out week by week with easy progress monitoring. Indicators of progress are given in full. The beta test program is defined, the tools used are clearly stated, the stages of implementation are reasonable and the accuracy of the results are determined. The progress reports have not been produced by the author. We recommend that the author make specific monthly reports, information, and implementation materials stored on Github. This helps to track progress better. The indicators/KPIs that determine the success of the proposal are: The application is put into operation, the number of community members participating in using the application. The number of investors involved in purchasing digital assets. In order to determine the success of the proposal, the author needs more specific metrics for the results achieved.\nI rated: 4\n", "q2r": 4, "assessor": "z_assessor_3144", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12637, "q0": "The project effectively addresses the challenge. The vision of the project is great when the project aims at the main goal, which is to create a tool to analyze the feasibility of projects on the platform through the collection of data and indicators related to the project. . Thank you for the example of the great features this tool has to offer, this is pretty detailed and I totally got the hang of how it works. All the information the tool provides is really important to investors, which will allow them to make the best decisions and effectively screen out \"junk\" and worthless projects. This also improves the overall quality of projects rolling on Cardano, making Cardano a safer place to invest.\nThe project deals with brand development, through which products, services and experiences for both real and virtual will be built. I'm a bit confused on this part, is this the application of metaverse models to attract and grow the community? As you said, if you can do that, the project will have a very high success rate because of the liquidity it brings. I am impressed by your detailed analysis of the possibilities of project strategy although this is not a professional research paper, but it shows that you have put a lot of effort into the research.\nWith all the information provided, the project with its brand goals, community building and analytical tools explained in great detail left me satisfied. I absolutely cannot ask for anything more from the proposal.", "q0r": 5, "q1": "Thank you for providing complete information about the members participating in this project. The team is very experienced in developing the areas needed for the project. The members have achieved quite a lot of success. This gives the community peace of mind that funds, if given, will be given to qualified people. I was impressed that the project's Roadmap presented quite professionally, it focused on building tool features and each feature had its own roadmap with specific stages. Brand development and community building done in 10 weeks is a bit rushed. I think building a community and building a brand in the eyes of users takes more time, especially when the team is still in the stage of finding and adding more community management personnel. Finally, I highly appreciate the feasibility of the project, as I think the information provided is reasonable and satisfactory, the budget requested is in line with the scope of the project, it is quite easy to understand how it is to be used.", "q1r": 5, "q2": "The KPIs that measure the project are reasonable. You repeat quite a lot and emphasize the goals and successes you want the project to achieve, this will make the community understand your vision deeply, including: Effective development of analytical tools, community building , branding and the big goal is to help investors realize that digital assets are an asset class worth investing in. I hope you will give me another method to help me track the progress most easily, because it is quite difficult to keep track of it now. For the rest, I found the audit process to be satisfactory.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14503, "q0": "The issue is that Most CNFT projects have failed to provide true benefit to their communities through token-gated products and experiences, as well as CNFTs with IP to build on top of. This proposal addresses the issue effectively. The proposer has evaluated the proposal's future scalability. The proposal will benefit the community while also increasing the value of the Cardano ecosystem.", "q0r": 5, "q1": "The proposal includes a detailed strategy and explanation of how it will be carried out. The proposer has asked a $55K fund with no clear budget breakdown. They have provided information on the team that will be working on the proposal as well as their experience and skills. The plan also adds social links to the team members' profiles, such as a LinkedIn profile link, to confirm their legitimacy and expertise. They have also thought about possible risks and challenges. It is quite likely that the project will be carried out effectively based on the information provided for feasibility.", "q1r": 4, "q2": "The proposal also includes a detailed timeline that will assist in project execution. The proposer has provided a detailed implementation plan with milestones. They have not provided specific KPIs and metrics to help measure the impact of their success. They have also provided a definition of success, which will help in tracking the proposal's progress. For audibility, The information provided is sufficient to assess the proposal's success and progress.", "q2r": 5, "assessor": "z_assessor_4060", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We're building a token-gated analytical toolset with free & private features (NFT for software licensing) and an intellectual property that can be used through a brand-as-a-service model.", "experience": "The team has experience in a diverse range of industries and many years into crypto, from both technology R&D and investment sides."}