{"id": 420652, "author": "didnkallaehawe", "title": "Transactions for Bank credits score", "url": "https://cardano.ideascale.com/a/dtd/420652-48088", "category": 26595, "amount": 50000, "description": "The determination of the solvency of customers for obtaining bank credit does not yet take into consideration the various operations (transactions of all kinds) carried out on blockchains.", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 550, "q0": "The problem statement for this proposal has explained a clear issue that blockchain can help to solve. Many people who cannot currently access credit or bank accounts can still find ways to use Crypto and Cardano. By allowing them to share their cardano transaction history with their bank and achieve a credit history and access to bank credit, this proposal can impact a large percent of the 1.7 billion people who are still unbanked. This app can help drive people to use the Cardano blockchain as a first step towards building up their credit history that can then be used with traditional legacy finance. The KPIs in this proposal are directly aligned with the campaign challenge of onboarding users, and pushing adoption of Cardano through new use cases. It is also perfectly aligned with the vision for Cardano to \"bank the unbanked\".", "q0r": 5, "q1": "This proposal includes a detailed 10 page plan that shows the professional approach of this team. The Wada organization has delivered several successful projects, and so has ditcameroon. (https://twitter.com/DIT_Cameroon) The technical team they have involved, Secured Credit Systems (https://www.securecreditsystems.com/team-4) has a very experienced team that can be seen on their website with LinkedIn profiles and their teams relevant past experience. (https://www.securecreditsystems.com/team-4) \n\nThe budget that is linked to from the proposal is clear and reasonable and broken down into milestones and identifiable items. The budget will be sufficient to complete this proposal and will not require additional funds. The plan and timeline are detailed and professional.  I have removed 1 star for feasibility only because while the teams have been identified, the proposal does not list specifically by name who will be developing the proposal, only their relevant background skills. I would suggest including their name and LinkedIn profiles to the proposal. ", "q1r": 4, "q2": "The timeline is reasonable with an estimate of 64 weeks, and weekly deliverables are outlined in the plan. The key metrics and KPI's will be easy to track with the proposed dashboard built in to the software. The metrics are aligned with the success of this proposal and the challenge. The only thing I would suggest to the proposer is to include a plan to communicate the deliverables on a weekly or monthly basis the cardano community. The proposing team will be tracking the deliverables and metrics, but they have not specified how these will be communicated to the catalyst community during development. The plan includes documentation of progress over the 16 month timeline, just not the channels that will be used to report to Catalyst. ", "q2r": 4, "assessor": "z_assessor_2108", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5730, "q0": "This proposal well addresses the requirements of this challenge since they have adopted Cardano solutions to solve an existing problem. I agree that the Catalyst community deserves to make credit scores on payments and transactions on blockchain and Cardano platforms. If implemented successfully, this project will tremendously help Cardano level up its playfield in the banking and financial sectors, thus allowing mass adoption and attracting people to Cardano.", "q0r": 5, "q1": "This proposal is well-crafted, as I find every part of the proposal well-thought-out and informative. The team has a clear and correct vision of how to carry out this project efficiently and successfully. Through this proposal, the founding team has shown a good grasp of the market, and the team also has an objective to do good for the community, which is to encourage more people to have some sort of account in financial institutions. However, I am worried about the legal aspects of this project since banking is quite a governmental sector, and there are limited countries that have officially accepted cryptocurrency and blockchain technologies. Moreover, this project aims to apply new technologies in a very traditional economic sector, thus making market education extremely hard, especially for the banks and the customers who have the slightest idea of these technologies.", "q1r": 4, "q2": "I applaud the team's effort in making such an informative and in-detail proposal. The proposer adequately and satisfactorily explains the market, the technologies, and the success metrics. However, instead of just listing the job titles of people working on this project, the team should include each member's profile since I believe the human factor plays the most significant role in the success of a startup.", "q2r": 4, "assessor": "z_assessor_2741", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9526, "q0": "This proposal leverages an integration of Cardano with an existing system that could impact both unbanked people groups and global financial processes, so I rank this section a 4 for high impact potential and creativity. This proposal well-aligned with Catalysts mission to pursue the highest levels of community innovation and it is transformational at that. The open access nature of crytpocurrency/Cardano combined with the existing financial infrastructure in this underdeveloped economies effectively enables more access to unbanked people groups simply by providing information from the Cardano ecosystem to financial institutions on request. In other words, a new access point is created to help people get access to traditional financial tools for people that weren’t able to access them before. While most cryptocurrency developers on intent on creating new financial tools that are separate from traditional finance, this proposal enables the ability to access more established financial tools because of blockchain technology. There is a few pieces missing from this section of the proposal like where this service is expected to be implemented initially. Before something like this can be effective in the traditional finance sector, it has to be recognized as legitimate by these financial institutions. So there needs to be some work done with banks to make sure that it would be recognized. Another missing factor is the link to Digital Identity solutions that can effectively link a pseudononymous address to an individual person. With the variety digital identity solutions building on Cardano, this is not likely to be a problem with the help of third party services but I still think this needs to be more explicit in the proposal. I also think this service could be transformational for global use, if the proposer should be so inclined to pursue that scale. If not, the impacts are well worth the cost of the proposal, in my opinion. ", "q0r": 4, "q1": "After seeing the level of detail in the provided documents, I understand why they chose not to put this information directly into the proposal. However, I would recommend putting a consolidated version into the proposal for voters to easily see and evaluate. If they should choose to look, there is enough information there for me to rank this section a 4. There is still an issue with the lack of verifiable documentation to confirm the given experience of the proposer. If you assume the given information is true, the team/individual experience to accomplish this proposal is well equipped to take on what is laid out. There is a high-level of uniquely educated power behind this proposal that can make this happen, at an extraordinarily underrated cost of labor. At a rate of $30/hr, we can see transformational products accessible to unbanked peoples in a matter of months. Since the mechanics of the proposal aren’t necessarily complex (at least in theory), I don’t expect much difficulty in producing a service that can simply generate (official) documentation for transactions that take place on Cardano. It amazes me how such a simple proposal (in concept) can make such a big impact, which is why I end up voting positively. ", "q1r": 4, "q2": "This section of the proposal thoroughly establishes KPI categories that will measure the direct impact that this proposal has on the world, so I rank this section a 4. The hesitation I have is connected to some of the shortage of information in the impacts section where we don’t know where this service will be implemented at its initial stages. While these are the right metrics that should be measured for measuring progress, it doesn’t leave voters with a sense of the magnitude of the impact. These can be aided by adding further definition to these KPIs by setting target metrics for each category. This quantification can help give voters a sense of what the expected outcome will be (to contrast that against the cost of the proposal) and that the team is aiming at an objective target of success. I think the right framework is given here but there are a few more added details that can take this section of the proposal to the next level. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 3, "ne": 1, "ng": 1, "nfo": 1, "vca_o": 1, "reply": "Auditability: the requested information can be found in the google doc with additional details of our project plan"}, {"id": 9742, "q0": "In this proposal, the the team is taking a big step toward improving the Cardano ecosystem by creating a more open and collaborative environment. The Cardano blockchain is just that—a blockchain. It needs projects and DAPPs built on top of it to be competitive in the blockchain ecosystem as a whole.\n\nThis project will help drive new developers and use cases for the Cardano blockchain by creating an open-source framework that gives consumers a more fair chance at obtaining credit. The old legacy system that is in place needs a better solution, and leveraging the Cardano blockchain to solve real world issues is exactly what this challenge is trying to address.", "q0r": 5, "q1": " This proposal is a great example of how blockchain technology can be used to solve real world problems. The proposer has a clear understanding of the challenge they are trying to address, and they have clearly articulated their role in helping improve Cardano. The team has a clear path forward for how they will implement this proposal, which is important because if a proposal doesn't have a clear path forward, it's very hard to imagine it being successful. The proposer does an excellent job at explaining why this proposal is important for Cardano as a whole, as well as for individual users. A project that marks those boxes I believe has no reason not to become a success.  The team is currently working on other projects in this funding round, so it's important to keep this in mind. It is not clear how much of their time and energy will be spent on this project, or if the other proposals they are involved in have to do with the success of this proposal.", "q1r": 5, "q2": "The team has a solid plan for implementation, with a clear timeline for each step. They also have specific goals for each step along the way. The team has already begun working on their proposal, which makes me feel like I can trust them to follow through on their plans. They also have a strong background in what they're doing, which means they're likely to stay motivated and focused throughout the process. One thing i will say is that they just give links 'to other websites in explaining how they will remain accountable to the voter community, and also how to track progress. I believe it would be more helpful to list more specifics in the proposal itself. Some voters may not take the time to click a link to get the information.", "q2r": 5, "assessor": "z_assessor_3088", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12349, "q0": "The proposal seeks to create a future application that will promote and encourage the adoption of cardano blockchain. This will bring in more users and therefore more transactions, as this will contribute to customer loyalty. The app will allow integration with other systems such as banking systems. Today, the cardano platform with ADA cryptocurrency has seen quite a high flow of transactions lately. This a good sign of patronage that could drive the use of the app if it is implemented. This will work from an interface, where the client request the collection on the cardano blockchain, necessary information will take into account the calculation of credit score. The proposaladdresses the problem that is in line with the challenge settings.", "q0r": 5, "q1": "The team is an experienced in their field of expertise and will be partnering with cardano members for the project. The budget provided is reasonable to which a link has been provided. The proposal has provided a carefully laid down plan with milestones in the link which shows how the project intends to carry its activities given timelines. I believe if the project receives the needed funds it can be implemented.", "q1r": 5, "q2": "The proposal addresses the problem that seeks to create an app that will encourage the adoption of cardano blockchain. The proposal has given the needed information to be fully audit. There is a clear roadmap showing how the project is to be carried out to achieve its goals. The proposal has outlined ways to measure succes if the project is implemented. Examples are cardano has adopted the app for a credit system and a good number of cardano customers are interested in the app.", "q2r": 5, "assessor": "z_assessor_3401", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Provide users and banks with a tool to leverage operations performed on the Cardano platform in the process of computation of credit score to improve the user's solvency level and financial inclusion.", "experience": "Wada Cameroon Hub DITC developer team, local bank expert, Wada marketing team, Data analyst, Maths engineer. "}