{"id": 420604, "author": "ctin", "title": "There's no We without Me", "url": "https://cardano.ideascale.com/a/dtd/420604-48088", "category": 26595, "amount": 223749, "description": "The widespread theft and counterfeiting of Name-Image-Likeness assets of athletes must be stopped, while enhancing their ability to monetize their digital identity and personal brand through tokens.", "f6_no_assessments": 5, "f6_rating": 4.800000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 475, "q0": "The proposal aims at building a DApp that would enable the monetization of the Name-Image-Likeness (NIL) of athletes. By linking it to DIDs, it would enable verifiable rights transfer and legal enforcement. The proposal is fully in line with the DApps challenge and hits a market ready for such adoption. \nThe solution will use a complex setup on Cardano, NFTs and DIDs, bringing diverse utility usage such as: high volume of tx, verifiable NIL identity/subject/ownership, monitoring and consolidating NIL tx, strengthening legal claims of NILs etc. \nMilestones are clearly defined as a series of design and research solutions as well as implementation steps. \nThe whole proposal is very well thought out, with a lot of implementation details particularly around integrating and managing DIDs. An exemplary proposal.\n", "q0r": 5, "q1": "The proposal is complex, so it is divided into 4 phases of execution. Each phase is described in detail with work to be done as well as the allocated budget. In addition, a GANTT Chart is provided giving insight into the detailed time planning of each step.\nThe proposing team has provided impressive relevant experience in various fields such as blockchain, cybersecurity, law, governance and others. Unfortunately, no public profile links were provided to verify the claims.\nAll aspects of the proposal are described well in detail, but what I found strange is the lack of a more detailed budgeting and budget breakdown. The amounts given are lump sums for each phase without details of how each of these sums will be distributed. Given the scope, size and requested amount it would be beneficial to have insight into the planned expenses.\nThe risks of the project are centred around a lack of developers which is a know Cardano issue as well as adoption and traction. It would be beneficial to have more details on how these risks will be covered and addressed.\n", "q1r": 5, "q2": "The proposal overall is well structured and progress can be monitored for each step. Each phase, and there are four, has subtasks that need to be delivered to progress and clearly defined timelines.\nThe goal, and end delivery is clearly defined as a product test of the MVP. Success of the proposal is defined as an entity using DID claiming ownership of NIL data on the Cardano ecosystem.\nPart of auditing the proposal is defined by enabling an accessible public channel for delivering regular updates to the community for auditing progress. Such a channel is not specifically mentioned in the proposal.\nGiven the overall quality of the proposal, I will not be deducting points for the lack of public channel and will rely on Catalyst regular reporting for monitoring.\n", "q2r": 5, "assessor": "z_assessor_2093", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "For updates on our progress we will be posting updates to our blog at:  https://sports-isao.org.  Here are LinkedIn profiles:  Thomas Fuhrman - https://www.linkedin.com/in/tomfuhrman/; Doug DePeppe - https://www.linkedin.com/in/doug-depeppe-esq-7939b113/; Jane Ginn - https://www.linkedin.com/in/janeginn/; Greg Ewing - https://www.linkedin.com/in/greg-ewing-70880a11/\n\nThe corporate sponsor is a US-based non-profit: https://CyberResilienceInstitute.org.  The project website is:  https://Sports-ISAO.org.  Twitter = @SportsISAO"}, {"id": 4539, "q0": "I strongly agree that this proposal effectively addresses the challenge and has a high impact. The problem statement clearly identifies a widespread problem of theft and counterfeiting of Name-Image-Likeness (NIL) assets in sports and the proposer goes on to provide a dApp linking NFTs with DIDs to establish ownership of NIL assets. It addresses this challenge's goal by bringing an impactful user case and large potential new users and market to Cardano (as the market size for NFT sports is huge in terms of dollars and number of users/fans and the athletes and their fans are poorly served by current Ethereum-based NFT solutions). This proposal also meets two of Fund9's strategic goals: to prepare a group of people (i.e., the athletes and their fans) able to make contributions to the Cardano ecosystem, and build real-world solutions based on the Cardano blockchain. The proposal's goals are well aligned with the challenge settings, e.g, driving a high volume of transactions on Cardano. The proposer provides clarity on how they will continue to develop the product beyond this phase. My one suggestion for the team is to include some data or proxy that demonstrates the impactful size of the sports industry they address to help with community buy-in, in particular, those do not keep track of the sports sector.\n", "q0r": 5, "q1": "I agree that this proposal is very feasible. The team comprises highly experienced members who have demonstrated a strong track record in their field of expertise, including cybersecurity, blockchain technicals, cyberlaw, and sports strategy. The team members hold high-profile roles such as Group leader of the IEEE P2145 Blockchain Governance Standards Committee, Lead of the Emerging Technologies Group, and Shared Assessments. Certified Information Systems Security Professional (CISSP), co-founder of the Cyber Threat Intelligence Network (CTIN) and serves as Secretary of the OASIS Threat Actor Context Technical Committee (TAC TC), Board President of Cyber Resilience Institute (CRI), Partner of Sports ISAO. The proposal demonstrates a clear understanding of the implementation steps to take, including scoping, framework, methodologies, and key deliverables. They also provide system architecture and a GANTT chart for the timeline, supporting their commitment and focus on implementing the project. I would have given a rating of 5 with one improvement: a more detailed budget breakdown. The budget is currently allocated by phase (each phase is budgeted in a lump sum). I would suggest the proposer include more information such as man-hour required, roles/capabilities required, and the estimated daily or monthly rate to help the community better assess its reasonableness. \n", "q1r": 4, "q2": "I strongly agree that the project is verifiable. As the project scope and outputs have been very well defined, in addition to having the GANTT chart roadmap, the community would be able to audit the progress and deliverables easily.  I appreciate that they put \"Defining exit criteria for each phase\" as a measurement as it shows their thoughtfulness to consider when to stop the project if the findings do not satisfy the end goal. I think this practice should be applied across projects on Catalyst. I would just add one comment for the team to update the progress on their social media or the community Townhalls for ease of communication and tracking.\n", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Great suggestions. Thank you!\n\nHere are LinkedIn profiles:  Thomas Fuhrman - https://www.linkedin.com/in/tomfuhrman/; Doug DePeppe - https://www.linkedin.com/in/doug-depeppe-esq-7939b113/; Jane Ginn - https://www.linkedin.com/in/janeginn/; Greg Ewing - https://www.linkedin.com/in/greg-ewing-70880a11/\n\nThe corporate sponsor is a US-based non-profit: https://CyberResilienceInstitute.org.  The project website is:  https://Sports-ISAO.org.  Twitter = @SportsISAO"}, {"id": 7563, "q0": "This proposal helps to address the current brain pain problems of individuals whose names and images have been stolen. This behavior is a malicious practice that has dubbed the personal image of athletes around the world. This is a good trick if the project is implemented then someone personally who has their photos stolen will feel very happy even though I personally have experienced the same situation. This well-defined solution creates a DApp to establish ownership of NIL content by associating the NFT with the DID to: provide verifiable transfers of authentic and authoritative NIL content This solution solves current problems while enhancing their ability to monetize their digital identities and personal brands through tokens. Key risks for participants to have a better overview:\n1. Insufficient developer resources for Plutus DApp and smartphone apps.\n2. Failure to establish an early position in the market leads to competitors gaining market share.\n3. Lack of user acceptance.\nThe author has also outlined methods to address those risks. The team has now started connecting with the Cardano community and looking to engage Cardano developers.", "q0r": 5, "q1": "\"To accomplish the project's goal, the author has given 4 specific timelines to solve current problems:\n1. Define scope and problem\n2. Design and build a framework for collective rights management\n3. Proof of concept/prototype/pilot development\n4. Conduct user acceptance testing.\nEach specific stage is detailed by the author listing what needs to be done with these timelines, I find it completely reasonable and can successfully implement the project. Project progress is also easily trackable. Success is clearly described and illustrated using the DID Methodology and other features of the project will be able to claim ownership of its NIL data in the Cardano ecosystem helping participants have a better overview. Challenge campaigns promptly fulfill exit criteria for each stage. This proposed solution will provide a first-of-its-kind mechanism to establish a digital identity, protect against abuse, and enable monetization through an immutable tracking architecture to facilitate ease of use. easy for law enforcement.\"", "q1r": 5, "q2": "KPIs and metrics are listed by the author detailing how they track progress in the following ways: establishing a clear work plan that includes specific tasks, activities, and roles. Define exit criteria for each stage. Identify and monitor technical and programmatic risks. Complete milestones and deliver on time. Perform regular progress reviews. Perform regular quality assurance reviews and enforce rigorous change control measures. These indicators are completely testable and easy to measure. The team consists of 4 main members: Founder Thomas Fuhrman and co-founder cJane Ginn, Cyber ​​Threat Intelligence Network (CTIN), Secretary, OASIS, Board Member, Zero Resilience Institute cyberPresident, VECTORmv LLC, Doug DePeppe, Esq, Founder, eosedge Legal, Chairman of the Board, Cyber ​​Resilience Institute (CRI), Greg Ewing, President, Cypress Borg, LLC, Partner, Sports ISAO. Teams are people with seniority in their jobs. The proposed funding budget is $223,749. The budget is broken down by the author into reasonable chunks: scope and problem definition $50,54, rights management framework $49,580, proof of concept $51,720, User acceptance testing $51,854, and another cost $20,340. These are expenditures that match the challenge of the project.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thorough review and analysis. \n\nHere are LinkedIn profiles:  Thomas Fuhrman - https://www.linkedin.com/in/tomfuhrman/; Doug DePeppe - https://www.linkedin.com/in/doug-depeppe-esq-7939b113/; Jane Ginn - https://www.linkedin.com/in/janeginn/; Greg Ewing - https://www.linkedin.com/in/greg-ewing-70880a11/\n\nThe corporate sponsor is a US-based non-profit: https://CyberResilienceInstitute.org.  The project website is:  https://Sports-ISAO.org.  Twitter = @SportsISAO"}, {"id": 11517, "q0": "Proposal aims to improve ability to monetize brand and digital identity with use of NFTs and DID with focus on sports as an entry to complex real-world problem with data ownership. Reclaiming and monetizing own data is an important issue that blockchain technology has potential to mitigate. Creating dApp on Cardano that improved deficiencies in current Ethereum solution can bring a lot of liquidity to blockchain. Key metrics and goal completely align with challenge as useful app to ecosystem would be created, with potential to scale and bring a lot of interest into Cardano ecosystem, and its advantages over other blockchain technologies. With provided assessment 5 of 5 rating is valid.", "q0r": 5, "q1": "Evidence of team with expertise in proposal’s field is provided with thorough team member skill descriptions (references to LinkedIn or other data source for validation would improve proposal). Extensive and detailed plan of project phases and tasks is provided. What is missing is role assignments per task, and person assignment per role. As mentioned in risk evaluation, team is missing some experienced software devs, but this is mitigated by connecting to Cardano community. Other risks are mentioned, some lacking mitigation strategy. Realistic timetable for project is provided via well-aranged Gantt chart. Budget is provided only for main phases, this I see as big deficiency (time expectation per task and role, hourly wage rate per role, and elaboration of costs would greatly improve proposal). Overall, I see this proposal as feasible with some shortcomings, therefore 4-stars.", "q1r": 4, "q2": "Detailed timetable with deliverables for each phase and team performing regular progress reviews make auditing of process for Catalyst easily accomplishable. Public channel for updating community is not defined. Main metric for project is set as characterizing and illustrating an example (in real world) how ownership of data can be achieved with DID and NFTs, with and smartphone app as MVP. This is an understandable, effective, and measurable solution to targeted problem. With small deficiencies in this section, proposal’s solution process and success are auditable and solve problem. Full auditability rating is therefore appropriate.", "q2r": 5, "assessor": "z_assessor_3255", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "z_assessor_3255 asked for more detail on public channel.  The corporate sponsor is a US-based non-profit: https://CyberResilienceInstitute.org.  The project website is:  https://Sports-ISAO.org.  Twitter = @SportsISAO\n\nHere are LinkedIn profiles:  Thomas Fuhrman - https://www.linkedin.com/in/tomfuhrman/; Doug DePeppe - https://www.linkedin.com/in/doug-depeppe-esq-7939b113/; Jane Ginn - https://www.linkedin.com/in/janeginn/; Greg Ewing - https://www.linkedin.com/in/greg-ewing-70880a11/\n"}, {"id": 14075, "q0": "The proposal surely ticks all the right boxes when in comes to alignment with the challenges set this round for this category. I find the idea bold (though not entirely new) and with a lot of potential given that they are trying to penetrate a huge market: college sports. That might not mean much for many people outside the US, but trust me when I say this, we are talking about millions of fans willing to support future professional athletes and millions of dollars. The NCAA (US National College Basketball Association – this is where most future NBA players start) decided to let athletes directly cash in on NILs starting 2021. This is still untapped territory so this is the moment for Cardano community to try to start cashing in. There are specialist voices who see the college sports sponsorship market growing to $1 billion in the next 5 years.\nAnd the way proposers want to enable this is by developing a DApp to establish ownership of NIL assets by linking NFTs with DIDs and they want to do that in the sports world (an obvious choice, since we all know the money that goes into worldwide). So, if successful this will have a benefic impact for the Cardano blockchain, increasing transactions of NFTs and potential users. \nThere are not many other similar solutions out there. There is, of course, OpenDorse, launched in 2012, and look at how successful it has become. And they only work with NILs, not NFTs.\nDepending on how you look at it, this can be a risk (will they really be able to attract athletes and fans?), but also a huge opportunity. I believe that by offering a mechanism to establish digital identity and enable monetization through tracking architecture this presents more of an opportunity worth the risks. \nTo break things down, what the proposers aim to do is to i) have a NIL asset associated with an athlete, ii) create a DID as well as an NFT for that NIL and iii) create a DID method to link the NFT to the DID. And all of this would be integrated with Cardano-compatible crypto wallets.\nSome might wonder why bother to have both NFTs and NILs together, when you can have them separately, as they are now. But why not? Why not take things to the next step? I think the proposers are right in saying that by doing this they can tackle the challenges of identity ownership (linking DIDs to NILs) and enhancing monetization opportunities (via the NFTs as part of the DID document). \nI like the fact that the proposal includes links to other work, it shows the team have done their homework and they have looked into that is already out there. \nIdentity related issues, online privacy, brand abuse, fraudulent domains are well known to all of us, whether we are specialists or not, so this proposal definitely responds to a current issue and I trust that it will bring Cardano benefits if we bring NILs and DID onto the blockchain. It will surely increase users and raise awareness given the market the project is aimed at. Only Ethereum based NFT solutions exist at the moment. \nNo numbers are given in the proposal, but I admit at this stage, that seems an impossible task. \n", "q0r": 5, "q1": "Their project plan is solid and very well thought through. The 4 phases build on each other and the detailed list of actions makes sense, in my opinion. The stages and actions flow logically from one another and the core team definitely has the experience and the tech skills to do it. The fact that they have so much experience in cybersecurity, in addition to blockchain and DIDs is of course a benefit. \nMy only concern regarding the team and their experience, and my bit of constructive feedback, is related to the whether a core team of 4 people really is enough for this project, as I am not sure it is. Unless I failed to see this, there is no mentioning of extra people being brough on at later stages. It is also not very clear if they have existing Dapp development experience and skills and Plutus experience, which represent important aspects of the project implementation and, again, there is no mention of new people. For eg, Phase 3 is all about proof of concept development and involves smart contract design on Plutus, Development of UI/UX Interface and designing the Sports-ISAO website. It is not clear from the bios of the team that they actually have this experience. They do mention seeking to involve more experienced Cardano developers if they get funding, but I would have liked to see more detail on that from the start. It’s risky to start without a full team (or a plan on how to have a full team).  \nI also wished I could see links to people’s LinkedIn profiles or other professional profiles, but the descriptions are detailed enough for anyone to understand the background of the team and that they are no newbies, but quite the opposite!\nThe plan also contains a Gantt chart and very detailed outline of the tasks and their start/end dates. What is not clear (actually, I could not figure out the math, and I don’t think it was me!) is the total duration of the project. There are some bits that don’t add up, for example, they give the duration of Phase one, Scoping and Problem Definition as 78 (they don’t mention it, but logically, it’s hours), but once you start adding up the numbers for each activity you end up with lots more than that – 142. Confusion here is far from ideal, especially since duration and budget are strictly related. Which leads me to a second observation on budget. There is detailed budget for each phase, divided into direct labour and other direct costs, but have they calculated the budget based on the action plan? If so, which is the actual working hours they’ve taken into account? What hourly fee are they working on? How many people will be involved at each stage for each action? I also think it would have been useful to see at least some examples of what falls under ‘administrative costs’. \nWithout clarity on this, it is harder to evaluate if the budget seems realistic for the task or not. And this is the reason I have not given them a full score. It might seem nit picking, but funding is what this is all about! \n", "q1r": 4, "q2": "The proposers have surely done a good job here (minus the issue with the duration I’ve mentioned earlier) in setting out the road map and including the Gantt chart is surely a plus! It makes it easy to track progress and figure out what needs to be done, when. Again, I might seem picking on the small details, but they mention regular progress reviews and regular quality assurance reviews– what does regular mean? Specifics would have been welcome. It is reassuring to see they will define exit criteria for each phase – a lot of teams forget to do this, or at least to mention them. ", "q2r": 5, "assessor": "z_assessor_3891", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "z_assessor_3891 and others have asked for the LinkedIn profiles of the key team members.  Here they are:  Thomas Fuhrman - https://www.linkedin.com/in/tomfuhrman/; Doug DePeppe - https://www.linkedin.com/in/doug-depeppe-esq-7939b113/; Jane Ginn - https://www.linkedin.com/in/janeginn/; Greg Ewing - https://www.linkedin.com/in/greg-ewing-70880a11/"}], "solution": "A DApp to establish ownership of NIL assets by linking NFTs with DIDs to: (1) provide verifiable rights transfer of authentic NIL assets, and (2) enable legal enforcement of rights.", "experience": "The team’s multi-disciplinary background in solving complex privacy, cybersecurity & CRG issues, particularly in sport, provide unique capabilities & insights on how NIL subjects can best leverage DIDs & Cardano to authenticate assets, and protect and enforce their legal rights."}