{"id": 420635, "author": "victor.grecia", "title": "Amazon Cardano Store", "url": "https://cardano.ideascale.com/a/dtd/420635-48088", "category": 26595, "amount": 57000, "description": "There is no adoption of blockchain solutions on Amazon. In addition, computer products in the local market are two to three times more expensive than the value practiced in the international market.", "f6_no_assessments": 7, "f6_rating": 3.4285714285714284, "videos": [], "media": [], "f6_assessments": [{"id": 109, "q0": "First just a note for the proposers who are based in the Amazônia Legal region also known as Brazil's Legal Amazon (BLA) region – specifically in the state of Para. The title of the proposal might be confusing [I am only mentioning this aspect - if the proposal is not accepted this Fund and is resubmitted in Fund 10] as many people will initially think that the proposal is about an integration between Cardano and the US online retailer Amazon. Hence, the problem statement “There is no adoption of blockchain solutions on Amazon” might be better redefined to a more focused region – is it Para state? Or is it the Brazilian Amazon region (Amazonia Legal] or is the entire Amazon region of South America [including Peru, etc…]. The other part of the problem statement “In addition, computer products in the local market are two to three times more expensive than the value practiced in the international market” – is a problem indeed, but it is in large part due to the relatively protectionist trade policies that Brazil has in order to disincentivize imports. For that very reason, many multinationals are based in the Zona France de Manaus duty-free zone in order to avoid high customs tariffs and taxes. The proposed solution is to create a store that will offer subsidized products that will only accept Cardano as payment. The proposed solution of offering subsidized products through a “megastore” seems unsustainable in the long-term as a long-term source of funding is needed, aside from Catalyst. However, my main gripe with the proposal it that it seems very loosely aligned with the Dapps, Products & Integrations challenge, as it is not a DApp, nor a product, nor really an integration – but a proposal to use ADA for payment. Which is laudable, but would not really require Catalyst support apart from the subsidy component. The team states that this will be a self-sustaining project, however a credible plan for self-sustaining operations of the megatore is not included. There is a proposed switch to a different model of operations – after only one month – if the model is not sustainable: “if adoption is not sustainable in 1 month, we plan to implement alternative payment solutions to ADA Cardano, but with market prices”. This to me seems more like a marketing plan for opening a new web store that will use Catalyst subsidized initial prices likely only for one month with a high likelihood of moving away from ADA payments following that month. If the proposal is resubmitted, I would advise the team to think about other possibilities for keeping the business sustainable long-term. Instead of moving to “alternative payment systems” – it would be good to start with several payment systems initially and develop a good business model that does not rely on subsidized prices from the get-go. The team does wish for the proposal to be self-sustainable, however the added financing from a stakepool will not be sufficient. The CRIP stakepool currently has 1 ADA pledged and has minted two blocks in the past 26 epochs as of today. Increasing the pledge from 1 ADA – even with the entire Catalyst funding will not change the fundamentals without a more detailed plan. ", "q0r": 2, "q1": "In my view the feasibility of implementing this proposal as currently planned – is solid. There is a local, knowledgeable and competent team for setting up a store of computer-related products – although I did not see someone with expertise in retail store management. The budget seems realistic for what is planned – marketing plan, acquisition of equipment to sell ($30,000), renovation of store, website, monthly operational costs… etc.. I would have liked to have seen a detailed business plan for the store and some type of control that the subsidized first batch of equipment $30,000 will not be sold to project insiders who are aware of the subsidy. Also, the plan does not include details on how big a subsidy this will represent – nor what is the attraction of the store when the subsidized equipment sales run out of Catalyst funded subsidizes. It will then become a regular store … so it will have to have a competitive advantage in relation to traditional players in the market. What would be the competitive advantage in this case? {I am asking in case the team resubmits this proposal in Fund 10, if they do not attract sufficient votes in this round}. This proposal does offer a realistic timetable for completing the work – the store’s opening is planned for September 2022. There is a plan included that shows what will be done and also how and by whom. The challenges and risks seem do not seem to include a risk analysis of how to deal with the existing competition in computer equipment sales. The subsidized equipment sales is not a long-term or mid-terms strategy for success and the team – if resubmitting – should include a plan that details the edge that they plan to have in relation to competition, if the adoption of ADA and subsidized equipment fails. ", "q1r": 4, "q2": "The team has a roadmap with milestones for opening their store and they have offered store success metrics that would measure the success of their proposal. The team specifies that they have an “accountant, responsible for the store's sales and stock statistics” – however there is no information whether this information will be made public and whether the Catalyst community will be given access to this information. One possible conflict of interest that would need to be avoided – is a situation in which a store is launched and the equipment is sold off at subsidized prices to people who are affiliated with the team. Conflict of interest is an important issue, when subsidies are offered in the form of below-market prices and I do not think that the proposal is clear enough and auditable enough in that aspect. If the proposal is resubmitted in Fund 10, this could be addressed. Some aspects of the success – such as using renewable energy – depend on the Green Crypto Farm, however these claims need to be substantiated with some more auditable information – apart from photographs of solar panels on the website. How much fossil fuel energy is used by the company, how much photovoltaic electricity is generated per month, how much is the electricity consumption in total of the company. Real auditability requires a lot of data, not only claims. I am mentioning this as the auditability section requires precise power distribution verification & information that would corroborate the “solar mining farm” status as Carbon Zero (which is visible on the Green Crypto site (https://greencripto.com/?p=11197&lang=en). The team’s web page states: “Today, VGMD uses only its own solar energy, contributing to the preservation of the planet and the Amazon.” – however this is – at it currently stands – not really auditable, if the team does not provide documentation. Carbon Zero status implies adding all the energy use of the company and then subtracting the renewable energy generation and that equals zero. Many companies make that claim, but the data needs to back it up. I mention this as one of the definitions of the success of this proposal is “Participants will know that non-renewable energy will not be used and that the company and Cardano invest in the preservation of nature”. I am not sure how will participants know this, if the complete energy balance of the company and its employees (travel to work, use of electric vehicles for business travel, etc.) is not tallied somewhere.  Another definition of success states “The advertising pieces are the main key of this project that tend to reach at least 1 million people through radio, TV and social networks” – however it does not seem realistic with an advertising budget of $1,000. Might be better to think of effective advertising – which is converted into sales. One more definition of the success of the proposal is “Users, consumers of this project, will create a Cardano wallet - probably on mobile - to purchase computer-related hardware at low cost”. Opening a wallet is not an easy task for an average person and buying ADA is another important hurdle. There is another hurdle to achieve the next definition of success: “These same users will stake ADA Cardano and contribute to the decentralization and growth of this ecosystem”- namely those users will probably spend most of the ADA on the subsidized computer equipment, that is the main attraction – not staking. ", "q2r": 3, "assessor": "z_assessor_2047", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2, "reply": "Nomenclature and auditability considerations are very important for project continuity. Currently, the Manaus free zone is in the process of matching taxes with other regions of Brazil, due to readjustments in the ICMS tax on the circulation of goods, implemented by the current government.\n\nThe solar energy produced and data can be followed in real time, at the website https://www.apsystemsema.com/ema/security/optmainmenu/intoLargeDashboard.action?language=en_US which is also anchored on the page greencripto.com\n\nThe considerations about our project written here are very important to us, however it is important to emphasize that our main objective is the adoption of ADA Cardano and not the promotion of the Stake Pool CRIP, since in the current conditions of k factor and fixed fees, it will hardly be competitive with larger pools."}, {"id": 5278, "q0": "The Amazon cardano store proposal is to create a megastore of subsidized computer products and promote the adoption of blockchain solutions on Amazon by accepting ADA as the only form of payment. The team has been running a solar-powered minting farm in the amazon for 2 years and run Cardano pool: CRIP (green cripto). They choose to trade computer as they have the most knowledge and contact also because product is in high demand in the Amazon and Brazil. They will trade at attractive price with low margin. The proposed megastore could be the good initiative to draw other commercial centers in the region. The team mentions the risk of low adoption which could be quite important to the success of this project as it will involve educating people on their payment on ADA. They plan to mitigate this by implementing alternative payment solutions, but with market prices. This should be an enough incentive for the local to use ADA instead. The crime is also a concern along with bureucracy but taken these risk factors into account, the proposed dapp can be implemented to bring use cases to Cardano and increase Cardano adoption in the Amazon (Belem) area. ", "q0r": 4, "q1": "The project has outlined a very detailed plan on how to bring this project into a success. The proposer should include the pay rate for any manpower related cost and the number of hours working on the project. This will bring clarity to some of cost items like website, logo, branding $10,000 and also the store opening and advertising on local radio and TV $10,000  These are big ticket items that need some more clarification as to how the personnels are compensated. Also the team member online profile to accompany each team member responsibilties would be a great addition to the proposal. The fact that some team members are running stake pool and maintain solar panels are good signal that this project can be implemented successfully as they are involved within Cardano ecosystem. ", "q1r": 4, "q2": "The success of this project is more cardano wallets created on the mobile phone, more staking ADA cardano. The fact that  non-renewable energy will not be used and that both Cardano and company invest in the nature preservation. The company should pay attention to the electronic waste as a result of more computer transaction in the local area and it will be a good practice and publicity how they plan to deal with this electronic waste - recycle, refurbish options etc. The community can track project KPIs and project progress on the number of sales, number of store visits,  number of social media followers and number of direct sales with ADA cardano to see that the project is on track and can achieve its ADA cardano adoption goal. The team might want to supply this information along with its stake pool information so that it is viewable in one place. ", "q2r": 5, "assessor": "z_assessor_2684", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "We appreciate the positive evaluation of our initiative, the cost of branding, showroom renovation and radio, TV and internet marketing, in Belém, are calculated by contract and therefore the hours were not counted.\n\nThe payment of fixed employees in the store, in number of 3, are paid monthly at the amount of 1500 reais, plus transportation and food.\n\nThe suggestion to recycle e-waste is fantastic and will be implemented in the store"}, {"id": 5901, "q0": "This proposal effectively addresses the challenge posed. It promotes cryptocurrency usage in Amazon's main capital, by creating a megastore of subsidized computer products, and only accepting payments in ADA. More broadly, it will promote actions that use clean energy and stimulate technological development in an increasingly free market, but in a region with little access.", "q0r": 5, "q1": "Your team includes technicians, architects, journalists, advertising specialists, electrical engineers, etc. However, information about the team is still quite limited. I would like to know more about the team's knowledge, skills and experience. I think you should add to clarify the information of the team. In addition, there should be links to facebook, linkedin, telegram, ... to help the above information become more transparent. Providing information to demonstrate you have a strong team will be an important part of determining the success of a project.\nI want to give you a compliment for identifying the risks, difficulties and ways to reduce them. You mentioned \" if adoption is not sustainable in 1 month, we plan to implement alternative payment solutions to ADA Cardano\", specifically what is that alternative? Detailed roadmap has been provided, tasks for each time period have been identified. As for the budget, although it has been calculated, it would be great to break it down even further. For example: how many hours will work? amount to pay per hour? How much does it cost to import each device (mouse, keyboard, ...) from the supplier?... This will help the budget become clear and transparent, helping people have more confidence in the project.", "q1r": 3, "q2": "In addition to the issues that I mentioned in the previous section (clarifying budget, adding team information,...). Regarding the criteria for assessing progress and success, the committee mentioned \"The company has an accountant, responsible for the store's sales and stock statistics\". This is very good, very necessary. However, I think it is advisable to add more specific metrics to measure and evaluate. For example: Monthly, the number of visits is 300, the number of product purchases is 30,... . Having specific numbers to measure against will make everyone's assessment and tracking a lot easier.\nIt looks like this is your first time submitting a proposal, so mistakes are inevitable. This is a very useful project, if implemented, it will certainly bring a great value to the community. To do this, you need to fill in and clarify the missing information (as I mentioned), don't give up, let's work together. Hope to see you again at the next funds. Thank you!", "q2r": 3, "assessor": "z_assessor_2757", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thanks for the review. We will certainly share the team's social networks for better communication and exchange of experience.\n\nThis is the second advisory that calls attention to remuneration in terms of hours worked and, therefore, we will make it very clear.\n\nThere will be 3 employees receiving 1500 reais monthly, in addition to food and transportation. The showroom renovation, branding, and internet, radio and TV marketing works will be paid per contract, as described in the timeline.\n\nIf the project is implemented we will share the viewing and purchase statistics on the website as suggested."}, {"id": 6041, "q0": "The idea of bringing an ADA payment gateway into the business model in Amazon to increase local adoption is good. However, the intention of the proposal here is to obtain funding from Catalyst to invest in computer equipment and the proposed team will sell it for a profit. I don't know why we are applying for this funding instead of investing our own money and asking for funding from Catalyst to focus on integrating ADA as a payment gateway? It would be argued that the proposal fits the challenge's \"Hardware\" objective, but this is a misinterpretation of what it means. Catalyst purpose is not to fund B2C business proposals like this. And so the impact of the proposal I think is low.", "q0r": 2, "q1": "There are a number of issues that I consider quite a bit when assessing the feasibility of a project. The first is about the experience of each member, I'm pretty sure I've opened all the attachments but can't find a member with programming experience or mention of outsourcing to this position. Because in the statement is to integrate ADA payment gateway but which developer will take on this work? My advice for this situation is to add more resources to make this clear.\nSecond, regarding the budget, the proposal does not indicate what portion of the budget will be used for the development of the ADA payment channel. The entire budget is only used to buy equipment and hardware for the business as well as to overhaul the store. This I think is unreasonable. Besides, in the section of the main risk preventing the project implementation, the proposed team mentioned that they will deploy another alternative solution instead of ADA in case the acceptance rate is low. This is the weak point of the project, which seems to be claiming you will quit ADA if there are any difficulties. Therefore, my sincere advice is to find solutions that can increase user acceptance, so that the success of the new project is increased. ", "q1r": 2, "q2": "Regarding the auditability of the project, I do not really agree with the information provided by the project. For example I can't check the specifics of who each member of the proposed team is, there aren't any links to their profile page to follow. Lack of more convincing metrics to measure project success. I add a few criteria like: # 1000 orders paid in ADA after 3 months of implementation, # 1000 customers on the platform, etc.\nMy advice to the proposed team should be to add the above information to increase persuasion as well as create transparency for the project.", "q2r": 3, "assessor": "z_assessor_2771", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thanks for the review, but the Fund9 Dapps, Products & Integrations theme contains in its description the construction and structuring of spaces for Cardano's promotion.\n\nThe suggestion about the contact of team members and their social networks is something sensitive and will certainly be publicized."}, {"id": 7667, "q0": "This proposal aims to increase adoption of Cardano in Belem, Brazil.  The team proposes to sell computer hardware and equip in the city at discounted prices and require patrons to pay in ada.  The team does mention that they may be required to accept other forms of payment if this method is not adopted.\nWhile I applaud the passion of this team to foster the adoption of Cardano, I don't believe this particular proposal has the potential to make a significant impact as warranted by this challenge.\nThe proposal is requesting funds for the purchase of the equipment to sell initially which does not strike me as an appropriate use of community funds.\nI do believe the idea has merit and I'd suggest the team consider ways to incentivize the use of ada in the purchase of products.  I could foresee this business being a hub for Cardano education, workshops, etc.  I hope the team will consider rewriting this proposal for future funds.  Because of the information cited above, I rated the impact of this proposal 2 stars.", "q0r": 2, "q1": "The team gave a detailed budget and timeline for the project.  They have also amassed a group of talented contributors with a wide variety of skills. I believe the team could pull off the project as described.  I do have reservations about requiring ada to pay for the goods as it may hinder sales initially becoming a liability to the business.  The team seems capable of executing this proposal, but the biggest potential impact of the proposal is also the greatest risk.  ", "q1r": 3, "q2": "The team plans to monitor sales, store visits, social media metrics and direct ada sales.  These KPIs would give a good idea of how successful the store has been.\nAs a community member, I would love to see this idea reimagined to maximize the education component of this proposal and reach as many people in the community as possible.  This would create a larger impact for the Cardano ecosystem and help garner support from the community.", "q2r": 2, "assessor": "z_assessor_2911", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Thanks for the review, the suggestions are noted, we believe that in Brazil the adoption will be greater if there is an incentive to use Cardano as a means of payment."}, {"id": 10395, "q0": "The proposal plans to build a megastore of subsidized computer products that only accept payments through the Cardano platform. They choose Amazon marketplace as the place to deploy this megastore. Amazon is one of the world's most valuable brands. If it is possible to promote the acceptance of cryptocurrency payments (especially Cardano Ada) on Amazon, the Cardano platform will be accepted by more users. This project will be a sustainable strategic project. Although the project will face many difficulties, there is no doubting its potential.", "q0r": 5, "q1": "The project's roadmap is outlined in great detail and starts from June 2022 to October 2022. Costs for each timeline and each work are clearly listed. The total cost they suggest is $57,000, and the project team will also spend a portion of the budget on the project's marketing. Computers were chosen as the business products in this project because the team has knowledge about these products. In addition, the demand for buying computers is also very high. In the proposal, information about the experience and capacity of each project member is listed. However, to help people verify and check this information, it is necessary to attach additional links to this information.", "q1r": 4, "q2": "Monthly they will report on the work progress. We will base on some of the following key metrics: number of sales, number of store visits, number of social media followers, and number of direct sales. These metrics are easy for auditing, but they should also create a website and social media accounts dedicated to the \"Amazon Cardano Store\" project in advance. This helps the community be able to follow the project efficiently.", "q2r": 4, "assessor": "z_assessor_3183", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thanks for the review, the store will certainly be affiliated with the Amazon marketplace in Brazil and also with the marlet place Mercado Livre, which we already have a partnership with. The team's curriculum and social media is very important information and we will certainly publish it due to it being a recurring theme we receive through Catalyst's evaluations."}, {"id": 12638, "q0": "Proposals fit the challenge. The project with the main goal of bringing Cardano closer to the community by promoting the use of Cardano cryptocurrency in Amazon. So I welcome this project.\nSelling any item on Amazon is not an easy thing, especially when it remains in high demand in Brazil as you say. The rate of competition is the biggest barrier to this, moreover, paying with ADA makes it even more difficult for buyers who don't know much about cryptocurrencies or even they are afraid to access payment methods. new as cryptocurrencies.\nTherefore, you need to map out a good strategy in your business and I would like you to share details about how you manage your product, marketing communications,... and give specific examples possible for cases in trade. For example, customer care, money being stolen due to the risk of payment on Amazon must be through e-wallets like Payoneer, Hyperwallet, ... and many other problems. I also hope you share some of your or your members' successes in this field because in my opinion this requires a lot of experience and when doing it will encounter many problems, hope you anticipate these risks.", "q0r": 4, "q1": "Thank you for providing a complete roadmap with realistic timelines, I have a good understanding of the amount of work the team takes on and I think it fits with the project scope and the team's resources. About the budget is explained in great detail and it is quite easy to understand how it will be used. The only thing I am not satisfied about this part is that I found no evidence of the experience of the team members, you should attach the links regarding the members' personal information, more details will give PAs, vPAs and voters a more solid view of the process.", "q1r": 4, "q2": "The proponent outlined how the community can track project progress updates and metrics surveys. This is satisfactory. But I would like you to list some specific KPIs to measure your project's goals. For example website visits, number of wallet creations, reach of Marketing, number of people interested in ADA Cardano, etc. We would love to see how the proponent will collect data about Which metrics to compare with what you present on the report. That's what you need to add, in terms of success, I'm pretty confident I've understood your vision for this project with the goal of using renewable energy and its positive impacts. ", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thanks for the review, the biggest goal of the team and, I believe, the Cardano community is adoption. There are already Brazilian solutions for payment and security with cryptocurrencies, practiced by the exchanges Binance and Novadax, if the project is approved we will partner with them.\n\nThe team's social media details are sensitive information that we will certainly share.\n\nOn the store website we will implement inform website visits, number of wallet creations, reach of marketing and successful sales."}], "solution": "To promote the use of cardano cryptocurrency in the main capital of the Amazon, we intend to create a megastore of subsidized computer products, which will only accept Cardano as a form of payment.", "experience": "We have been running a solar-powered mining farm in the Amazon for 2 years. Our infrastructure meets all the regional legal requirements, with legal entity, place of operation, logo, website and suppliers. The same as will be required for an infostore."}