{"id": 420676, "author": "ghamalian", "title": "ADAGram- Decentralized Social Media", "url": "https://cardano.ideascale.com/a/dtd/420676-48088", "category": 26595, "amount": 200000, "description": "Current social media sites are deceptive and harvest our data for commercial third-party use. The mechanisms which promote and censor content is opaque at best. Content creators are not fully rewards", "f6_no_assessments": 7, "f6_rating": 3.7142857142857144, "videos": [], "media": [], "f6_assessments": [{"id": 2589, "q0": "The proposal reflects the current reality, user information on social media platforms is illegally collected, censorship mechanisms are unclear, and decided by a few. People. content creators don't get the rewards they deserve. The proposed solution is to provide ADAGram - an open-source, decentralized social media platform on the Cardano blockchain. It will resist censorship and bot accounts. Content creators will directly receive rewards in the form of utility tokens. This solves the problems of today's social media platforms. Moreover, if successful, it can replace current social media platforms such as Facebook, Twitter, ... will bring Cardano an application with billions of users. This proposal is clearly in line with the goal of increasing utility and driving more people to use Cardano.", "q0r": 5, "q1": "The project implementation team consists of 3 key members and a marketing team - Trio Marketing. they are assigned specific positions in the proposal. with the introductory information as well as evidence through the attached links clearly, they have the experience and capacity to take up positions in the project. Regarding the proposed roadmap, which is expected to be built in 1 year from the third quarter of 2022 to the third quarter of 2023, the platform will be fully running. After this period AdaGram will use ISPO to fund the project it is self-sustaining, and users and content creators will grow further. Project milestones are measured in quarters. Each corresponding quarter, the proponent has provided the work to be achieved, which I consider quite specific and complete. Finally, about the budget I see they ask for a total budget of $200000, they explain with $50000 for the salary of 3 developers for 1 year. they explain these are the most senior developers, compared to the average developer in India between $7000-8000. In addition, there is a budget when attending the Cardano summit in 2022 and 3 other blockchain summits respectively in the amount of $ 40000 for air tickets, meals and hotels. Next is the customer service rep's salary of $43800. the last is the contingency cost of $36200. Given the salary for the development team and customer service as it is the main work to carry out the project, the cost is acceptable to be explained as reasonable when compared to the general work level. however if the proponent provides it at a more detailed level of specific KPIs for each person respectively monthly and quarterly milestones. then we know what the content of the work is, how the volume is, the proposal will be more complete. Also the amount of $40000 is for participating in Cardano summit and 3 other blockchain summits to promote Dapp and get customer feedback. I suggest that the team reconsider this plan because it is quite a large expense corresponding to 20% of the budget that the group plans to apply for. Also the amount for redundancy is $36200. I don't have information what is this money back up for? Why is there this amount? and I recommend the backup budget should not be more than 10% of the total budget is reasonable. Also here I see the budget interpretation using only for the 3rd and 4th quarter of 2022. which the total required budget is $200000 for 3 developers, 4 customer service reps, costs attend the summit and contingencies. This is unreasonable. Moreover, the budget in the detailed explanation and the total budget are not identical. In short, due to the aforementioned problems with the budget section, I'm not sure the proponent knew what and how he was doing it. I suggest that the person who proposed a detailed remake of this section can refer to my improvement contributions and resubmit the proposal to the next fund. With the above mentioned content I do not think the proposal will be feasible.", "q1r": 2, "q2": "Regarding the ability to measure to track the progress of the project, the proponent says that they measure the excitement and engagement of the Cardano community in AdaGram by constantly monitoring its social channels (Twitter, discord, telegram and youtube) to track follower and subscriber counts and engagement in channels (posts, comments, retweets, etc.). and can measure engagement through ISPO to see how many authorized individual ADA addresses. also have weekly AMAs and live streams with the community. I don't think we can measure project success through interactions. It is a necessary but not sufficient factor. The community needs to track the results of the work done by the project week by week and month by month, what work did they do there, what results have been achieved and what are the targeted results next? those work goals must ensure that the goal of launching the ADAGram application is in the third quarter of 2023. The proponent needs to provide both quantitative and qualitative analytical statistical information so that the community can follow it on their own. track the project in progress day by day, not just the end result as defines the success of the proposal. In summary, periodically reporting to the community if funded is quite ambiguous so I do not agree with the auditability of the proposal.", "q2r": 2, "assessor": "z_assessor_2323", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4206, "q0": "The proposal \"ADAGram-Decentralized social media\" is creating an open-sourced, decentralized social media platform resisting to censorship and bot accounts. Creators will receive reward in a utility token. The unique selling point of this platform is to allow all users to express their thought processes and have a decentralized governance system when censoring any piece of data. Adagram users can delegate their ADA and earn $ADG token. The revenue generated by advert will be split into 2 venues. One directly invested back to the community and another one invested into ADAGram foundation. The team has not gone into detail to explain how they invest back to the community. The ADAGram team also raises the importance of their solution that it will help free speech in the country where oppressive government not allow free speech. The project risk are mentioned as blockchain based (high transaction fee) and also social based problems (balance around free speech, censorship and moderation). While I am satisfied with the solution they provide for the blockchain based issue, I find their mitigation way for social based problem trickier to implement and not well thought out enough at this stage. The team plans to outsource the problem of censorship to the community by using majority vote. As sometimes the majority vote cannot always handle every issues that will pop up in the communities (not to mention some serious issues). Also what if the votes are divided and the majority decision is not always flawless in banning and censorship. Also the method for voting is unclear. The team has  realized this potential risk and only says they will test in beta mode before implementation. Since the ADAGram team aims for this project to be one of Cardano infrastructure, the team could have showcase some background work but there is no link provided in this proposal at all except the litepaper that says this project has been in work for 2 years but this litepaper is very brief (3 pages in total) with no specific technical work in mention.  To run a decentralized social media, they still miss out to touch on important but basic foundation like how they filter content for users, how they allow users to exercise free speech rights etc. The proposal would need to address these issues as they are main features that everyday influencers are accustomed to and the building block of social media in web2.", "q0r": 4, "q1": "The project will span across from Q3-2022 to Q3-2023 with requested budget of $200,000. From the litepaper they attached in this proposal, it is in draft stage and to introduce ISPO for platform rewards already in Q3. I wonder if the ADAGram team has considered tokenomics and they will also attend Cardano summit 2022 to promote their dApp. Their dApp work is not shown anywhere in the proposal and I am not certain how the team could promote their dApp at this stage. Q4 they will introduce babel fee (denominating transaction cost in native token) on their platform provided that there is functionality on Cardano. Q1-2023 they will introduce Cardano NFTs and integrate exclusive tools Q2-2023 is for gaining feedback on its pilot release and Q3-2023 will be the full launch of platform and distribution of ISPO rewards. There are still questional action plan (particularly in Q3 -2022). Also for the budget breakdown, in Q3 2022, the cardano summit budget for 5 team members (tickets, airfare, hotel, food) are $10,000. It is not comprehensible why the founders, co-founders and board will forego the traditional salary but instead charging for these items like blockchain summit. If it would be to promote their dApp, I would expect the team to at least show that their dApp is in work in progress stage or have a clear litepaper instead of draft one. The Timeline in budget breakdown is also confusing when the proposal mention Q4, 2022 and then return to cite the cost in Q3 2022 with other 3 blockchain summits they would attain. The budget doesn't cover any period in 2023. The team is consisted of entrepreneur, PhD Philosophers and marketers in promoting blockchain products but their budget breakdown doesn't make sense with the jumping between time periods and unreasonable cost items without explanation. ", "q1r": 2, "q2": "The ADAGram team defines this project success as the launch of their decentralized social media dApp and users engaging in content creation and sharing opinion. Another success is forming meaningful partnerships. Third success is paying out content creators fairly and finally, they want to advance free speech. In order to measure these successes, they will monitor their social channel and engagement they receive in ISPO and delegation in their stake pool. The team also says that the progress can be tracked through partnerships they form. Lastly, they will do weekly AMAs and live-streams once developers are onboarded. In this proposal, they don't clarify the communication channel to the community - they could use social media or GitHub to keep community informed if their project is on track and likely to be completed by their proposed timeline. The team should consider include the links in their next proposal to show their background work more than just a litepaper attachment.", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4679, "q0": "A new product seeking to resolve the downside to the current dominance of centralized social media platforms and provide a venue for free speech certainly fits very well with the mission of Cardano and the challenge which seeks to set new and exciting projects into animation.\n\nAs someone with roughly a decade of experience managing a professional social media operation, I found this proposal intriguing on several levels: Strong but not without flaws. With regards to overall effectiveness, I offer the following observations:\n\n- The spirit of a social media platform that returns revenue for advertising back to its users is a fascinating idea, similar to what we've seen with the Brave browser. One question that appears unanswered is how advertising would find its way onto the platform: Public vote via DAO? At least a brief mention would be warranted here. It's also mildly confusing, as the proposers both describe a model in which ad revenue would be partially returned to users through their token, and also that their decentralized model would \"replace the traditional ads-driven business model for social media\". So is the idea to... move away from ads as a model at all? This apparent contradiction may have an explanation but more clarity is needed on this aspect of the team's vision.\n\n- The idea of attempting to directly democratize censorship practices is interesting. If ADAgram takes off, the proposers going to want to start thinking long-term -- constitutionally even. But this is the first proposal I've seen of its kind on Catalyst and that innovation is worthy of noting here. \n\n- I hope this advice will be taken constructively: If your proposal here fails but the team wishes to take it up again, one effort they could make would be to tighten its overall content. As it stands, the explanation is a little rambling. Tight language makes for greater clarity.\n\nAs you can see, I have criticisms (perhaps even quibbles) but overall, the project seems a promising response to the challenge. For this reason it falls just shy of a perfect score in this section, getting 4 stars.", "q0r": 4, "q1": "This team has done an excellent job on its roadmap. It's detailed, and includes quarterly goals including the division of labor responsible for each goal. Bravo. \n\nThe budget breakdown is also good. It provides figures for pay combined with rationalization for pay, and a plan for unused contingency funds. Frankly, they might have been able to justify more pay (pity the service reps making only $5/hour, even if they're in the developing world...) \n\nFinally, the team looks solid, interested in open engagement, fully accredited, with moderate experience and enough creativity to jumpstart a visionary project. This proposal has strong potential for implimentation.", "q1r": 5, "q2": "To my mind here, the weekly AMAs are key. That will keep the community in touch with the project in a way that could help it grow and legitimize it as it grows. Honestly, the proposers may not want to wait until developers are onboarded before doing these on some kind of consistent basis, though maybe not necessarily weekly.\n\nFor the second portion, the measures for success work but need to be a little less airy. I'm sure you'll \"have users participating in content creation, sharing opinions, and engaging in a fun, exciting, and rewarding platform.\" But in the days after launch how quickly are you expecting your platform to grow, numerically? This can be a range. What would you consider a failure? What would exceed your expectations? I know doing this can be intimidating but, after the platform is up and running, it provides us with a more objective metric to measure success to draw up as we consider how things have gone. Meet a pre-set expectation, and you gain credibility. Something to consider. This is why the score here is less than perfect.", "q2r": 4, "assessor": "z_assessor_2585", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8792, "q0": "The project addresses the challenge of creating an open-source, decentralized social media platform. ADAGram solves the problem when many 'influencers' with bot accounts deceive the public; specifically, you have taken advantage of Cardano's PoS protocol. In particular, I appreciate ADAGram's ability to scale when websites are run on a decentralized system with hundreds or even thousands of nodes transmitting content; governments can't stop information. Arrive. You have clearly explained the risks and given a detailed plan to solve the problems encountered.", "q0r": 5, "q1": "\"You guys have given each quarter's complete and very detailed development roadmap. However, please set a specific goal in each quarter that will be achieved, like the amount of content created, respectively—works instead of just listing such jobs.\nThe budget and cost requirements are also very detailed, and the amount of money you will spend on each activity is very reasonable, especially since you have a clear plan for attending the Association. Cardano 2022 summit and other blockchain conferences and events to promote DApps, get feedback from others in the community - founders and co-founders, marketing team.\nYour team is excellent. You have provided enough information about your team, which makes me confident that your project will succeed.\"", "q1r": 4, "q2": "This proposal is transparent as you guys have weekly AMAs and live streams with your community so we can see your growth. The metrics you give, such as community interaction, number of followers, and subscribers, are very reasonable. However, I would like to have specific KPIs for each of these indicators at each stage, through which the community can easily verify the effectiveness of the project when participating in the live AMA sessions.", "q2r": 4, "assessor": "z_assessor_3004", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9816, "q0": "The proposers would like to build a social media platform, which cannot be influenced by bots. Additionally, they would like to split the income from ads with the users of the platform. The income should be distributed through a community governance model and also provide money for the steady development of the platform. On top of this they would like to run the application on a decentralized network, which should help citizen in countries with an oppressive government. This all together seems to be a noble goal, and would definitely add value to the Cardano ecosystem. With the use of a treasury, this also could be sustainable. The project is very focused on the aspects of free speech and to provide a permissionless platform. When looking at the risks, the teams primarily mentions transaction fees (not offering a solution) and the problems with free speech (e.g. giving a home to extremist groups), which they like to fix by giving censorship-rights to the community itself. Other potential risks like technical difficulties, not getting adoption, hiring, etc. are missing. \nI do believe that a social media platform is an interesting idea on a blockchain, but the complexity and challenges of creating such a platform are beyond what it proposed here. \n", "q0r": 4, "q1": "The team offers a plan and a corresponding budget over one year. In the first quarter, they are building a website and hiring a team of developers. In the second quarter they are already hiring 4 customer service representatives to provide 24h customer service and start a marketing campaign with live stream, weekly AMAs, podcasts… well. I think they forgot the phase to actually build the platform they are proposing. Just hiring a team of “top level developers” is not enough to build anything. The team has absolutely no technical understanding of what they are trying to do. It all sounds easy to build a social media platform, without bots, governance tokens and everything decentralized. It isn’t – at all.\nThe team has some merits and interesting CV, but fails to meet the required competence in technical understanding or project management. \n", "q1r": 2, "q2": "The team would like to monitor the excitement(?), create partnerships and be open with their roadmap. Furthermore, they are planning weekly AMAs and live-streams. This could help to monitor the project in its development. Further goals or metrics are quite vague.\nThe team has a clear, but rather large problem at hand. They deliver a solution which at the first look appears to be nice, but the devil is in the details here, and they are missing a lot of them. I have a hard time giving any advice here: To build the proposed platform is a complex endeavor, very likely beyond the skill set of the team. One possible way would be to team up – there are many projects with similar ideas. By teaming up, they could focus on what they are good at: thinking about solutions for free speech. The other way would be to start very small. The chances of getting funding with such a big project without the ability to present reference to technical or relevant business skill is rather slim in my opinion.\n", "q2r": 3, "assessor": "z_assessor_3105", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12367, "q0": "The idea presented is about creating a decentralized social media platform. In short, a novel blockchain-based social media portal. At the core of the project is a utility token as a reward for content creation. Basically, The proposal fits well with the goals of the Challenge, as this is about creating Dapps that are relevant to Cardano, to attract new active members to the community, to increase the volume of Ada and CNFTs in circulation, in short, to promote the popularization of our Blockchain. However, the major weakness of the proposal is that it is more of an idea, but not yet a plan that can be immediately put into action. For this, the information regarding the manpower, but also the details regarding the structure of the platform, the go-to-market strategy and especially the technical specifications are not sufficient. A proposal that requests $200,000 should show significantly more depth. The big challenge of social networks is to achieve the so-called network effect. The activities mentioned do not address this aspect enough. What I like is the approach to promote free speech. The topic certainly has potential. However, from my point of view, there are already other initiatives that address the issue and have much more substance. The team has missed out on differentiating itself from other projects. These points only lead to a 3-star rating for the impact category.", "q0r": 3, "q1": "The attached schedule is for one year. The implementation plan lacks depth and also does not show exactly which person or team has to complete which task within a specific timeframe. So we don't know exactly what activities need to be developed and approximately how many weeks they would take. Therefore, we lack a very solid idea of what has already been done and what needs to be done next. Given the size of the budget ($200,000), I think it's valuable to have a much more detailed breakdown of how the money will be spent. Both in technical terms, and in terms of marketing and project management. Only mentioning Marketing-Activities in general doesn’t show any plan, what to expect and if the actions would be reasonable or not. For technical development, the team is still missing. Overall, the given information is not enough to give more than 3 stars for feasibility. \n\n", "q1r": 3, "q2": "The proposer provides us only superficial ways to measure the progress of the process. There is no basis for reporting (e.g., a Github page and the project website where all reports should be linked). Metrics are vaguely defined and we are not presented with numbers as to what numbers are seen as success. So we can only measure progress, but not success. Overall, the proposal does not seem mature enough to justify the total price. I recommend the team to follow the example of successful proposals in order to get a better evaluation in the next round. ", "q2r": 3, "assessor": "z_assessor_3402", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12761, "q0": "This proposal wants to create an open source decentralized social media platform. The features are described in detail. Many features are also a unique selling point in comparison with common Social Media sites therefore there is demand for such applications. \nThe values of this proposal align with the values of the blockchain and Cardano. \nOverall this proposal creates a new usecase and could bring many new users to Cardano. Therefore it clearly matches the challenge.", "q0r": 5, "q1": "The team is described in detail and they have linked website which proof their skill and experience. \nThe timeplan is clear. They have assigned tasks/ milestones to quarter year periods. Overall the timeplan is sufficient in detail. \nThe budget also described in detail. The funds are used reasonable and efficient. \nThe risks ware analyzed. They have made some mitigation proposals to solve them. \nOverall I think this proposal is strongly feasibly. ", "q1r": 5, "q2": "The team has described many way they measure the progress and the engagement from the community. Also they have weekly AMAs and live stream. Overall the progress seems easy to measure and transparent. \nThe measures of success are also well chosen. (launch, meaningful partnerships, paying out creators and free speech) The measures are explained in detail and are matching the goal of the proposal. \nOverall this proposal seems easy to audit. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "ADAGram will create an open-sourced, decentralized social media platform. It will be resistant to censorship and bot accounts. Content creators will directly receive rewards in a utility token.", "experience": "I am an entrepreneur with a focus on individual development within organizational operations. Our team has a PhD Philosopher focused on free speech, a mathematician focusing on cryptography, and marketers with experience in promoting blockchain products."}