{"id": 420741, "author": "dali720", "title": "Inukshuk HealthDigital Identity", "url": "https://cardano.ideascale.com/a/dtd/420741-48088", "category": 26595, "amount": 57000, "description": "The problems of a DID for healthcare are limited by national jurisdiction for its issuance and verification. Individuals DID’s need to be conformable to standards for clinical trials.", "f6_no_assessments": 5, "f6_rating": 3.5333333333333328, "videos": [], "media": [], "f6_assessments": [{"id": 3016, "q0": "I think that the idea of building a bridge between scientific human research and the blockchain technology is a good one, as data extracted from clinical trials will be available for any scientist to make use of and from the other side, also the participants of the clinical trial can have a record from their medical examinations to which future examinations and medical information will be added. That is indeed a new product for the community so i see how this proposal addresses the challenge under whose category falls under. Being also a no-code framework will make it easy to use templates to create an health identity, similar to the no-code model defined in the Marlowe Smart contract application for finance. I think that this project could have a positive impact on the Cardano ecosystem and that becomes clear from the proposal itself. Atala Prism features have a lot to offer to the decentralization and i thibk they should be adopted in every form that they are proposed. ", "q0r": 5, "q1": "There is a detailed plan, including a timeline that takes up to 4 and a half months which seems quite realistic given that this is a completely new product that needs to be developed from the very start. I would like to ask something though, as i am not a developer myself to completely understand that, if the framework is a non-code based one, which code is going to be audited? I understand that the development of smart contracts will be needed but that part with the code, no-code is not very clear to someone who doesn't have the technical knowledge. Despite of that, there is a budget there that has been broken down into items. However, the needed budget for the proposal is 57000 and the sum of the items gives us 9875$. Where are all the other funds going to be allocated to? That is very important to know, in order to get the budget you are asking about. In addition to that, even though there is a team and the relevant experience has been written down, there are no reference links to provide the needed evidence, nor the necessary resources. All in all, this proposal needs a little bit of work in the feasibility section. ", "q1r": 2, "q2": "There is a roadmap with milestones in it and that will seem useful when considering the success of the proposal. Now when talking about the tracking of the progress, there is infinite information that needs some explanation. Where are the weekly reports are going to be published and what will they include? When are you going to make the module tests and how will be gaining access to them? Where is the user going to provide their feedback? Key metrics are there described clearly and have been quantified which gives a good horizon to the community members to have. All in all, i believe that the inforation provided is quite sufficient to audit the proposal. ", "q2r": 4, "assessor": "z_assessor_2385", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 396, "q0": "Inukshuk HealthDigital Identity propose a no code framework to help with applying Atala PRISM identity to the health industry. They mention issuing DIDs for each individual involved in clinical trials or research studies. The proposer does not provide any depth and detail to what is included in this framework, how it will be built and exactly how it can be used. This makes it very difficult to know what will be delivered apart from that fact that a number of stakeholders could be issued DIDs. The website provided adds no added details that add clarity to this. A general risk of the usage of Atala PRISM is mentioned however specifics aren't applied to their application or around medical concerns such as privacy and data protection. Overall due to the lack of information provided there is little confidence that can be provided to this proposal as it is unclear on what will be delivered and in their own words why that specific set of deliverables would be impactful for the target audience. This proposal could have potential so we kindly invite the proposers to add a lot more detail in a following funding round to submit the proposal again to make it much more clear on the exact intentions of the proposal to the assessors and voters!", "q0r": 1, "q1": "The proposal breaks down a progress set of milestones that has an itemised list of tasks with the number of weeks and hours it will take to complete. The break down of the list address high level parts of the proposal but do not help with fully understanding the exact deliverables of the proposal. Due to this it makes it increasingly difficult to understand whether this would in fact be feasible. The budget is broken down into 725 engineering and development hours and then costs for an audit and UX design testing. A number of team members are listed down with a mixture of background in health and tech. No professional profile links are provided, the website adds no further evidence of the teams background and no evidence is given that the team is able to execute the proposal that is being suggested. Upon searching for the names on LinkedIn I found the following person using the names provided - https://www.linkedin.com/in/lauren-nickel-icd-d-149b1b18/. It does not mention anything to do with biodao making it difficult to trace anyone real to the people mentioned in this proposal. Overall the lack of clarity on what will be delivered makes it difficult to have confidence that the proposal is feasible from the itemised stages of development provided and a lack of evidence is provided that the team can feasibly execute this proposal.", "q1r": 2, "q2": "For auditing the progress of the proposal they mention that they will do weekly status reports but do not state exactly where these will come from. The Discord link is broken on their website so it is very unclear on exactly how to track this. No Github repository is added and no mention is made towards what will and will not be open source which may benefit the community. In terms of successful outcomes for this proposal the proposers mention the delivery of the application and then mention an increasing number of trial users to test it with. The overall clarity of this proposal makes it very difficult to know what will be delivered meaning the community will struggle to audit whether the proposal does indeed get executed and if so what impact it was trying to achieve. We would invite the proposers to add more clarity on exact deliverables and use cases and then provide more specific objectives that can be measured for the auditability of measuring the success of this proposal.", "q2r": 2, "assessor": "z_assessor_2073", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2100, "q0": "The problem described in this proposal fits the challenge. According to the proponent, the issues of DIDs for health care are limited by the national authority to issue and verify. Individuals with DID need to fit the criteria for clinical trials. So he came up with the solution as One Inukshuk Health DID that provides individuals and providers with clinical trials and research as the basis for action. Using the Atala PRISM SDK will issue DiD in a code-free interface. Propose shows a legitimate problem and then provides an idea of a valid solution. This proposal, if successfully implemented, will address the development of an international repository of health studies within the framework of the Trustless structure of the blockchain.", "q0r": 5, "q1": "Project feasibility is average, the proposal provides a basic budget, roadmap, and team details. Therefore, it is difficult to choose whether this proposal is viable. In terms of roadmap, it is proposed to provide several key activities to be carried out, along with the timing of their implementation. A total of 18 weeks are divided into 725 hours for this project. The relevance is statistically relevant and we know well what will happen next time, but it would be better if the proponent had more information about who made them. Next is the budget, the total budget required is 57000$ with a brief explanation: \"725 hours of Engineering and Development\n$6875 Frame and Code Test\nTesting $3000\"\" UX Design as stated means 725 hours of Engineering and Development= $47,125 or $65 an hour. Since there is no explanation for this part, I assume that the experts involved in the project have the same salary.\nAnd finally, the group is mentioned with 4 members. We know their names and experiences. However, it is not enough to assess their capacity to implement this proposal. What role will they play in this project, what is their connection to Blockchain and Cardano, the experience mentioned here is a good start but we don't have enough information about it? It would be more convincing if the proponent created a link to a public profile where these credentials could be checked.", "q1r": 3, "q2": "The ability to track project progress is referred to as the \"Weekly status report for the project.\n-Check the module\n-User feedback\".It would be better to list a few directly measurable stats so that everything can be tracked more clearly.\nAnd in the end, the success of the project is clearly defined, and this is good because it gives us insight into what needs to be achieved.\nThis is a brand new proposal that has never been submitted before.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 9941, "q0": "I think healthcare and medicine have potential to be one of the first industries having a really big impact on the adoption of decentralized systems globally. The problem of data sovereignty and incentives are common everywhere in both developed and developing nations. People lack incentives to participate in clinical trials, generate data and/or to provide it to be analyzed. It decelerates the development of clinical tests, intelligent health algorithms, wearables and the health knowledge of the individuals. BioDao aims to operate at the core of this problem. They have several (synergistic) proposals in this Fund about the topic and this specific proposal suggests building tooling to generate health DIDs for the people participating in clinical trials as well as for the trial organizer party. \n\nHaving secure and easy to use tools for offering the access to this new decentralized infrastructure lowers the threshold to make them a part of the project.\nThis would mean more use of these systems as requested in the Challenge.\n\nWhen the core elements, like identities and data sovereignty, of the mission critical industry, evolve, there will likely start the development of multiple supportive and non-critical services and applications around them. This is what this Challenge is asking for. \n\nParticipating in a healthcare trial may be the first time for many to face the concept of self sovereign identity. And for even more people it will be the first time to really realize tangible benefits and impact of the decentralized systems. This has potential to bring more real users to the industry and the ecosystem. This also addresses the Challenge very well. \n", "q0r": 5, "q1": "The roadmap provided in the proposal lists the basic phases of the project but I would like to see more details especially regarding the technical design and its implementation. It would be easier to show estimates how the budget is going to allocate against an accurate roadmap. In other respects the budget feels reasonable. This is quite a critical piece of infrastructure, so a detailed description would add to my understanding and confidence. \n\nThe information on team members is extensive, verifiable and the track records are convincing. They have experience in bio start-ups and corporate operations as well as in technology in blockchain space. Putting together the Plutus capabilities is not done yet. The team mentions building the backend team as one potential source of risk. This causes uncertainty with timelines. In conclusion, my view is that the team is exceptionally well equipped to work on this proposal and their vision. \n\nOne essential factor worth mentioning is that this project is waiting for IOG to make Atala Prism public. That should happen sooner than later. The last thing is that the team has already planned a clinical trial which enables an immediate real use case for the system. \n", "q1r": 4, "q2": "One thing promised in this proposal which I like a lot is weekly regular updates. They are open-ended and catch any essentialities faced on the way. Surely a more detailed implementation roadmap would help to follow the development progress as it happens. Because of the nature of this project, the code audits and reports will play a notable role in the process.\n\nThe first after-launch success metrics given are mostly about the progress of the planned clinical trials in Parkinson's disease. More long term KPIs like the amount of use of these tools or even surveys mapping the general impact of the health digital identity on people’s perceived utility, could convey some valuable information about the cascading effects of these initiatives. Something like those would be nice to see added to the plan. \n", "q2r": 4, "assessor": "z_assessor_3138", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14120, "q0": "The initial challenge they posed was that health care DIDs were limited by the national authority for issuance and verification. And their solution was to build an international repository of health studies within the Trustless structure of the blockchain. I appreciate their cleverness in taking advantage of this feature of blockchain. By adopting Marlowe smart contract they will build a codeless framework based on easy-to-use templates for IHDID generation. Here, they use the Atala PRISM SDK to issue DiD in a code-free interface. Identity information will be encrypted into decentralized, your data will be more secure and controlled. I evaluate whether this solution can effectively solve the challenge posed.", "q0r": 5, "q1": "The roadmap they set for this proposal lasts 18 weeks, with 7 items to be implemented. The main member of the team consists of 4 people. They are seasoned people, some with up to 40 years of experience. They are experts in research and programming; blockchain developers, technology, and financial and business companies. The team's plan is quite clear and the staff is quite strong along with the required cost of 57000$. I appreciate the success of this proposal. But their budget breakdown is not clear. I noticed their goal mentioned recruiting a test team for the Parkinson's Disease Sensor Clinical Trial. The number of participants in the test ranged from 25 to 2500 people. But the detailed budget sheet found no mention of the cost for this test. And they think that the issue of the Atala PRISM code is a significant risk, but in my opinion, it is not reasonable. Instead, the question of how to reach many people and the security of information for customers are more worrying issues.", "q1r": 4, "q2": "They list 3 metrics to track their project progress. These are Weekly status reports for the project; Module tests; User Feedback. The information provided is not clear, it is a general concept and does not provide an indicator that can be specifically monitored and evaluated. For example, the number of documentation completed or how many aspects they implemented and what those aspects are. I need to see a clearer and more detailed view. Their measure of success is the completion of the IHDID no-code application. But, they did not mention how to apply and deploy this project. In this part, they didn't convince me.", "q2r": 3, "assessor": "z_assessor_3906", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "An Inukshuk Health DID provides u individuals and the purveyors ofclinical trials and research a basis for action. Using Atala PRISM SDK,we will issue a DiD in a no code interface.", "experience": "Our team has experience with the Atala PRISM SDK and the requirements for Clinical Trials. Our CSO has been part of the development of two graduate programs for these."}