{"id": 420716, "author": "peterbisma", "title": "Cardano Rent DApp", "url": "https://cardano.ideascale.com/a/dtd/420716-48088", "category": 26595, "amount": 66570, "description": "How can we have a credible accommodation seeking platform to eliminate fraudsters, middlemen in the real estate sector while reducing the high cost of accommodation for all class of persons?", "f6_no_assessments": 8, "f6_rating": 4.791666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 198, "q0": "The proposer introduces Cardano Rent dApp using AtalaPRISM to register legitimate landlords, real estate agencies, and apartment owners with real time KYCs. By that way, we will have a credible accommodation seeking platform to eliminate fraudsters, middlemen in the real estate sector while reducing the high cost of accommodation for all class of persons.\nBy using the Apps, all subscribers (property owners/accommodation seeker) need to sign up a Yoroi wallets or any other wallets to keep their ADAs. They also pay maintenance fee as little as $0.80 in ADA value. This would onboard users into the Catalysts community, expand the use of Cardano particularities, grow the number of ADA holders in Ghana, Africa and beyond, and inspire interest to grow the Catalyst ecosystem.\nAccording to proposer, Cardano Rent dApp would be the first Cardano Blockchain Dapp in Ghana to transform the real estate sector. It have big chance to make significant impact on real estate sector which are growing yearly.", "q0r": 5, "q1": "The proposal has been planed since Fund8, and be modified with careful market analysis and strong partnership with Calogeron Ghana Limited, a construction and real estate firm and Procurement and Project Management Consultancy (PPMC) https://ppmcgroup.com/  for the execution of a successful project. \nProposal team with experience with IT /blockchain and real estate field. Their working profile in LinkedIn to ensure the successful project implement.\nBudget are affordable with specific works assigned during 13 months. Budget allocation is reasonable for each phrase.\nThe team also aware of risk which is trust in using the dApp would be critical to homeowners as well as educational levels, and they have good education plan for that.", "q1r": 5, "q2": "Timeline with clearly KPIs will be presented on Github to enable openness and transparency in development. They also update progress reports on the Discord channel. This would help in easy tracking of activities of the project.", "q2r": 4, "assessor": "z_assessor_2055", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 2464, "q0": "RealFi is one of the most important sectors when talking about blockchain. \n\nThis project would solve a real world problem leveraging the technology Cardano provides. If implemented the app could attract new customers to Cardano which would benefit the whole ecosystem. Furthermore this is a new concept which the Cardano DApp community is missing so far.", "q0r": 5, "q1": "The team chose a complex project but their skill set makes it likely that they succeed. The skills required by the task are meat by the skill the team has. \n\nThe timeline as well as the budget breakdown are realistic for a project like the proposed one. \n\nThe plan for implementation and marketing which is chosen by the team makes sense. \nAll in all this results in a high likely hod that the team will succeed.", "q1r": 4, "q2": "The information provided by the team is sufficient to audit the development process. \nThe KPIs which were chosen by the team reflect success of the project really good. The idea what success looks like aligns with the value system from the community and the challenge setting.", "q2r": 5, "assessor": "z_assessor_2307", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4207, "q0": "The \"Cardano Rent DApp\" proposal addresses the Dapps, Products & Integration by creating a accommodation seeking platform (powered by smart contracts and Atala PRISM) which eliminate fraudsters and middlemen and reduce the cost of accommodation for people who seek rental properties in Ghana. The Cardano Rent Dapp targets landlords, homeowners, real estate agencies and individuals looking for properties for rent. Although they didn't elaborate their partnership with Calogeron Ghanan Limited (a construction & real estate firm procurement and project management consultancy) on which term but they have improved their proposal from the last fund 8.  The team might want to consider elaborate more on this partnership or highlight why it is important that they mention this partnership at all. The team considers trust as the risk for delivering this project successfully and I agree that they will need to convince the landlords to list their properties on their dapp let alone verify that the properties belong to those landlords. However, they see this risk as minimal as homeowners and landlords are actively searching for the platforms to increase the visibility on their property. The project also has the potential to scale up because of the need for sanity in the housing market in Ghana. This proposal fits the Dapps, Products & Integration challenge nicely as it will onboard users into Catalyst, a great use case for Cardano smart contracts and grow the number of ADA holders in Ghana (transactions occur in the platform will be in ADA) which will boost the adoption of Cardano.", "q0r": 5, "q1": "The entire project will take 13 weeks (3 phases in total). The team has outlined their action plan in these 3 phases and provided the detailed budget breakdown. They could dive deeper into the pay rate and number of working hours for the front end, back end and smart contract development. However, each cost item looks plausible. The team also possesses strong technical skill and are locals. One team member, Peter Bismark, has involved intensively with Catalyst and adds to the credibility of the project. They have considered risk and challenges as mentioned earlier. I agree with their view on trust but think this risk would require the team to be more engaging with the landlord owners. As the landlord myself, I would personally consider only the reliable platform in listing my property so the exposure to the renters might not be the only factor that will entice the landlord owners to trust their property with the platform. The competition is very fierce among the web2 platforms (although this might not be the case in Ghana) but I believe that the team will have to carve out their unique proposition here for the project to be a success.  Having said that, I believe the team has the right skill and mindset to carry this project to the end and I appreciate their tenacity to bring their proposal back in F9 and hope it will get funded eventually. ", "q1r": 4, "q2": "Developers will use GitHub for the transparency and they will also update Catalyst members with their progress report on the discord. I enjoy the fact that the team has provided the extensive list of KPIs making it transparent for the community to audit the project. They also plan to roll out their solution among the other countries on the African continent and that is very exciting as it has a very big potential to disrupt the property market as I read in another proposal in Congo and think that the 2 teams might even consider the collaboration at some point. The team has understood what is urgently needed in Ghana and come up with excellent solution to disrupt property market there with the use of smart contract and Atala PRISM. The Cardano Rent DApp has the high potential for succeed. One thing I would recommend is to perhaps give the name to the project so that it is recognizable or mention the name if the team already has one. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9628, "q0": "Fraudsters, high fee, and lack of trust are some of the biggest issues in the real estate industry. To solve this problem, the proposal aims to build a dApps to connect homeowners and homeseekers with each other. The goal of the project is to provide a transparent and trustworthy rental platform for people in Ghana. Property owners can list their properties on the platform and tenants can easily search for the property they need to rent. Direct connection between landlords and tenants, cutting intermediaries will reduce rental costs for tenants, and also help landlords reach more home seekers. By verifying identity and property ownership of the landlord helps to reduce the rate of scams, tenants will avoid losing money into the hands of scammers who post beautiful homes and charge viewing fees but don't actually own them. A market research conducted by proposer in Ghana showed that up to 1900 searches for apartments and houses for rent are made daily. With the values ​​and benefits that the project brings to both tenants and landlords, I believe that if the project is built properly, it will be one of the most used blockchain applications in Ghana while significantly increasing the number of wallets and transactions on Cardano. Therefore, I rate this project 5 stars for its impact.\n\nAlso, to make the project more successful, my suggestion is to add the feature of housing quality review to the people who have rented the house. The content of the review will be saved on-chain as metadata to ensure it is immutable and transparent. This will make tenants more confident when using this platform.", "q0r": 5, "q1": "The information of the members involved in the project has been clearly stated and has a LinkedIn link attached. In my opinion, the skills and experience of each member are suitable to carry out this project.\n\nThe budget is divided according to each job. However, the proposer should break down the budget in more detail so that the community can better assess the reasonableness of the budget. One of the additional information that can be added is the number of employees performing each job, the number of hours they spend on the project, and the pay rate of each person.\n\nRegarding the timetable, the proposal has given a specific implementation plan, with a clear timeline and milestones. However, since the proposer also proposes another project in Fund 9 called \"African Journalists - AJEOT 2022\", therefore the proposer should explain more about how he manages the projects so that both projects can be done on schedule in case that both projects are funded.\n\nThe project outlined the use of Atala Prism to authenticate the identity of landlords and tenants, but other technical aspects such as architecture, language, and technology used to build web app and mobile app should also be clarified.\n\nRegarding the risks associated with the success of the project, the project identified two main risks: trust in using the dApp and the education levels of users. I completely agree with the risks stated in the proposal. Educating people to understand blockchain, Cardano, and how to use light wallets is necessary so that they can believe in the potential that the platform can bring compared to other traditional applications. I appreciate that the team has planned to organize educational outreachs and workshops to attract and support homeowners.\n \nOverall, I think the team has enough capacity to carry out the project, but some additional information is needed to make the project more complete. So I rate 4 stars for the feasibility of the proposal.", "q1r": 4, "q2": "The project has clearly provided a roadmap with milestones for achievement. The KPIs given to evaluate the success of the project are reasonable in my opinion. The project also outlined how the community can audit the progress and success of the project. One of the ways to audit that is to check the project's commit count on GitHub or check out the progress reports provided in their Discord channel. For me, the information that the project has given is enough for the community to evaluate the progress and success of the project. Therefore I rate 5 stars for the auditability of this project.", "q2r": 5, "assessor": "z_assessor_3068", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 12225, "q0": "The idea aligns well with the objectives of the challenge, because it intends to use Cardano DApp to create an authentic registry for property owners to eliminate scammers and high agent fees in seeking accommodation, and to allow for easy search and renting of houses in Ghana. The proposer asks for fund to support this idea. By develop Cardano Rent DApp, it allows property owners to lists their properties for accommodation seekers and avoid the scammers and the middlemen. the Cardano Rent DApp provide transparent information including cost about accommodation/apartment/flats/offices for rent. Homeowners and individuals seeking accommodation/apartment/flats through a constructive verification process (Which will require in Cardano Rent DApp) would help both parties to freely negotiate terms to build trust and competence. This confirms would contribute to the Cardano eco system. In addition, use ADA as payment app for the transaction would give double contribution to Cardano eco system and I like this idea. Furthermore, the proposal dialogues very well with the goal of the challenge and given detail information such as link to accesses more information in regards to this project. In addition to this, the proposal effectively addresses the challenge ", "q0r": 5, "q1": "The project team proves to be very well prepared to carry it out, because they provide a small individual description of who they are, which is summed up by their contacts on social networks, making real the possibility of making direct contact and getting to know them better. About the script, they present which phases would need to be completed to reach their goals and it is sufficient information that project can be implemented well thus, it makes the community easy to understand. In relation to the budget, I see that the level of detail here was high. We know what each part of the project will cost and understand how cost is spent, with that, I also satisfy. Given the information provided, the proposal will be implemented successfully", "q1r": 5, "q2": "I found it interesting how concerned the team is with auditability. They are not only careful to pass on information that would help the rest of the community to monitor the progress of the project, but they drew up an auditability plan in which they would monitor the project's growth. The community would be given progress reports on the discord channel and The DApp developers would use github to enable openness and transparency in development to the community. That way I believe, we would have the information and perhaps they could present us weekly or monthly. Thus, given information provided, it sufficient to audit the progress and the success of the proposal", "q2r": 5, "assessor": "z_assessor_3367", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12272, "q0": "The proposal addresses the challenge and seeks to remove the activities of middlemen in the process of renting. With the increase in demand of accommodation and the constant need to relocate, there will always be the need for a transparent system such as this, that connects home owners to their prospective tenants. It's adoption of smart contracts, property and identity verification will ensure  trust in the blockchain system. An increased adoption of this system will also mean an increase in the number of yoroi wallets created  (which will be used as the payment platform). I believe that with the introduction of taxes on financial transactions, an alternative like this will be easily adopted by Ghanaians when it is implemented.", "q0r": 5, "q1": "The team seems to be deeply integrated into the community as their experience with the renting process is highly evident. Given the experience that the team presents, I believe the project is likely to be implemented to meet its set target. Their plan to use multiple channels to ensure adequate understanding of the system will allow for collaboration by the Ghanaian community which translates into it's adoption. The team familiarity with protocols of the cardano ecosystem can be seen in the way they have listed the deliverables and timelines needed to measure their success on the proposal. The budget is having the details of how the money will be used to make the project a reality.", "q1r": 4, "q2": "The included KPI's have a clear roadmap and time horizon for measuring the success of their project right from the training and education to the building of the rent Dapp and implementation process. The documentation mentioned will serve as an appropriate proof of progress report which makes it easy to be audited. In summary, I do not doubt the team's ability to implement this project as it addresses a need in the Ghanaian community.", "q2r": 5, "assessor": "z_assessor_3378", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 13025, "q0": "this is an interesting Dapp proposal which I think could be a real time innovation to bring all land lords under one umbrella. This proposal is aligned with challenge because it will guide people to search for credible land owners who are verified and that people searching for homes to rent or buy can trust and rely on it. I also think the risk is minimal because when a platform is authentic people will easily subscribe to it to have their peace. ", "q0r": 5, "q1": "the team look knowledgeable and understand the real estate sector. They also look experienced in working with catalyst and computer programming. This shows they will see it that the proposal is implemented well. I also saw the proposal has already formed partnerships which is an important collaboration to help legitimize the proposal and use of the Dapp technology.\n\n  I also see the budget as something they can work with to ensure the success of the proposal.\nThe proposal team also has made the plan easy to follow from stage to another that shows how prepared they have this innovative Dapp. ", "q1r": 5, "q2": "The Key Performance Indicators are simple to follow through so the community can evaluate the proposal to see progress. The proposal also has shown as people subscribe to the Dapp to put their homes there. The number of subscriptions will also help to show the success. \nThis is good for auditing.   ", "q2r": 5, "assessor": "z_assessor_3541", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14361, "q0": "This proposal meeting the demands of the challenge and the innovation of the proposal is important for the people in Africa. I d'ont see this project to sit  in Ghana alone  but other countries can all subscribe and put their homes there irrespective of the geographical location. I also can see the team has done some market analysis and the result look positive, we all know people want something different that create the opportunities to overcome scammers and take away other bad nuts. The proposal will also make the people who needs accommodation to feel safe to deal with the owners of the apartment. This can be a great innovation in Ghana and can therefore reach many people. The cardano community will also benefits because people will have to hold the cardano coin to subscribe and this will therefore  grow the catalyst community.", "q0r": 5, "q1": "I think the team has been very consistent with what they want to achieve and have chose their timelines and deliverables carefully. This show how prepared they are to see to it that the proposed DApp would cause the real change for trust.\nThe team also has done some works for catalyst as CA/PA before and understand how the system should work to stop scammers from duping prospective customers who want to rent out. Finally, the budget is good and the team can apply it to have the system on cardano blockchain. I therefore think the proposal would be implemented easily and bring success.", "q1r": 5, "q2": "The proposal is a great innovation and has laid down KPIs that can help in the auditing. As people give testimonies of the rent DApp, it will lead to more people across Africa see it as a safe haven and a trusted platform. The number of subscribers is also a real success and the cardano community can easily evaluate with such data. The information is enough to guide everyone to see progress of the proposal in its implementation.", "q2r": 5, "assessor": "z_assessor_4001", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Utilize Cardano particularities to eliminate scammers and DApp that identify Homeowners and landlords, and the availability of accommodation/apartments/flats using smart contract", "experience": "A combined team experience of 13 years in dApp development, software engineering, real estate management and business development consultancy. The team has built credibility, duty conscious and result-oriented."}