{"id": 420833, "author": "tamerlane", "title": "Supply Chain 4 Legal Cannabis/Hemp", "url": "https://cardano.ideascale.com/a/dtd/420833-48088", "category": 26595, "amount": 115000, "description": "Legal cannabis is highly regulated and susceptible to counterfeiting. The industry suffers from lack of trust, quality certification, quality verification & transparency from seed 2 sale.", "f6_no_assessments": 7, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 867, "q0": "As with Blockchain, the proposal's author brings an industry that is gaining more followers every day. Based on the data provided, the legal cultivation and commercialization of Cannabis are growing rapidly as taboos are removed from the population and more countries are allowing its medical use. Been The United Kingdom accounts for 75% of global production. Tamerlane is a small company that has grown over the years, having grown to serve more than 300 clients in the areas of brokerage, marketplace, and supply chain. An excellent explanation of the current situation is presented, emphasizing the fact that product quality degrades as a result of time, transportation specifications, and storage conditions, as well as the potential of using Cardanon's characteristics to enhance its supply chain. Also, the author provides a good explanation of how this proposal fits within this Catalyst fund, which is led by its partners. This helps the reader understand the holistic solution planned, and how the requests within this proposal fit into that vision. Upon successful implementation of this proposal, I can see how it adds value to the ecosystem and could become a flagship use case for Catalyst. So I strongly agree with this proposal from an impact point of view.\n", "q0r": 5, "q1": "Team members have experience in the key areas needed for this proposal; skills and experience are all described, as well as the necessary links. One of the most positive elements, from my perspective, is the agreement with Jann Muller, who has extensive knowledge of the smart contract structure in Cardano and has been part of the team who build one of the most successful DEXs within the Cardano ecosystem, MuesliSwap. A great deal of attention is also paid to identifying all the professional profiles needed to ensure the success of this proposal. In terms of feasibility, one of the sections of great value is the time and effort put into explaining not only the actions, milestones, and timeline of this proposal. But on a higher level, how the work is distributed and the hours of work are estimated in combination with the rest of the complementary proposals that compete to be selected in this fund. In reading the proposal, one of my biggest concerns in terms of feasibility was the dependency of one proposal on another, and I am glad that the author has addressed this in one of the sections, explaining that each proposal is interdependent. In terms of the requested budget, it seems to me that enough detail is provided to make a full analysis of the rationale for it and I must conclude that it seems appropriate. In fact, this proposal should be taken as an example for all teams that as part of an ambitious or multi-step proposal present several proposals in the same fund, the planning and resource distribution of the proposal should be thought of as a whole and all this information should be presented to the community.\n", "q1r": 5, "q2": "A total of 5 milestones are presented, which are explained in detail, and a clear alignment between them and the actions of the work plan is evident. Each milestone has an estimated completion date. In the explanation of how the success of the project would be, a summary of the milestones is made arguing that success would be the construction of each of these. I wish to add that while this is correct, it is what the community would reasonably expect. The team should, however, also present metrics that provide an indication of the impact they intend to achieve through successful execution of all deliverables. For illustration purposes only, I have provided some examples of expected metrics. \"XX NFTs minted in XX months after launch\", \"XX products sold through the supply chain in XX months after launch\" or \"XX in revenue from this business model after X years\" or something similar. Even though this is a high-level estimate with considerable margin for error, it is important for the community to understand what the strategic objectives of this project are. To conclude, it is worth commenting that although it is explained how the reporting and communication with IOG/ Challenge Teams would be, it would also be interesting if the team could make available to the community the progress made during the implementation of the project.", "q2r": 4, "assessor": "z_assessor_2142", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1702, "q0": "The proposal fits well with what seeks the challenge, however the integration between the company's activities and Cardano's blockchain is not so clear. Talking about the problem situation, it is about the cannabis market, which is really a high growth market and that has been gaining good prominence, especially after the pandemic. The proponent argues that legal cannabis is heavily regulated and can be easily counterfeited, so it's an industry that works with consumers' distrust, particularly as cannabis is more vegetable/fruit-like in terms of talk about the quality/integrity of the product, due to the logistical problems currently encountered, the product is often not sold at a fair price, as its quality has deteriorated. While all these issues are being tackled, the cannabis industry continues to grow. The proponent brings several data that argue this, such as being the 5th most valuable crop in America, being a product that has already been legalized for recreational purposes in 18 states of the United States, and 26 states for medicinal purposes - for this, it is also quite used in several countries such as: Argentina, Australia, Barbados, Brazil, Canada, etc. It is a plant that is under research, and can be used to help treat serious diseases such as epilepsy and the effects of cancer treatment - so there is no lack of facts to make it interesting for Cardano to invest in this industry, despite the prejudice, the field of use is getting wider and the product is being legalized in more states as time goes on. The bidder also presents his company, Tamerlane, as an “experienced and well-established leader in a small market. Working in the Aperon group of companies. We have steadily increased our market position in Washington State for the past 7 years. As the regulatory environment slowly accepted cannabis as a legal but controlled substance. More than 300 clients use our brokerage, market and supply chain services. We hired Big Tree to rate 90% of the product we sell.” So now they are looking to invest in a cannibis supply chain service built on Cardano's blockchain, according to the proponent, the data minted in our network would serve for the qualitative and quantitative monitoring of the product's provenance (from seed to sale), with commercialized shipments marked with QR codes, which are linked to On-Chain data. The proponent cites exactly what integrations would be built on, in the excerpt: “The Cannabis Listing Service is the big tent that unites growers and buyers, meeting in a market environment that provides up-to-date information on different products of ever-changing quality and availability. . BigTree classification system provides confidence, a common language, immutable records and efficiency\nThe Supply Chain service allows product provenance using the International Cannabis and Hemp Standards (ICHS) Certificate of Degree (CoG). Proof of CNFT's Smoke (…)”. Despite this, none of these integrations are so well explained; despite the bidder saying that his business faces challenges similar to those of Cardano, such as “Efficient sizing, Building trust in an environment without trust, Traceability, Transparency” and so on, these points are also not so well explained. We know well what the advantages of working with blockchain would be (“Inverts the roadmap about producers being underpaid, undervalued and underrepresented at the retail counter + Provides a transparent and immutable record of product provenance and traceability from seed to sale” + Educates and informs the wholesale bulk buyer in each transaction what is being sold and bought with 100% confidence, etc.”). But it is not explained so well how this would be done, in practice, here in the impact of the proposal. The risks are also not adequately addressed, how could we solve the problems related to Cost overruns / Technological Complications / Key Persons Unavailability / Market Acceptance / Inadequate business experience? In terms of alignment with the challenge, the proposal certainly fits very well, meeting the topics “Cardano needs a thriving ecosystem of different Dapps, products and integrations for the community to use that increasingly become the best alternatives to to current centralized providers. + The more interesting and useful the products and integrations that can be built into the ecosystem, the more reasons people will have to interact with the Cardano blockchain that can help drive further adoption, feedback, growth and even more innovation.” I just want the doubts mentioned here to be clarified.", "q0r": 4, "q1": "The script is explained in a very original way here, however I think that our general view of the levels is not well defined. The first thing we are told are the tasks that must be done, they are well punctuated and we know the approximate duration of each one, as we can see in the excerpt “1. Specification: Describe exactly what the service is supposed to do, how it will be used, and how it interacts with other services -Developer Estimate Time Required Min. 2 days / Max. 7 days; With Coordination (Review and Approve and Rework) Min 5 days / Max 10 days. 2. Writing on-chain code: Building the Plutus smart contracts that govern the creation of tokens, writing of on-chain data, etc. Developer Estimate Time Required Minimum 1 days / Max. 3 days; With Coordination (Review and Approve and Rework) Min 2 days / Max 4 days”. Then the proponent attaches a table in which we can better understand the relationship between the parts, which tasks would last for which days at least and at most. In terms of detailing what will be done, I think the information we have is quite adequate, but we are not informed about how these tasks would be located in time, that is, they would start in which month, and end in which ? What is the estimate in relation to the quarters of the year for this project to be started, developed and completed? I found the way in which the development process was presented to us here very interesting, leaving only this issue of temporality in relation to the periods of the year pending. But in general I believe that this part of the proposal is good, we have a lot of information about what will be done. Speaking of financing, 115 dollars are requested, which is a very high amount, but it is well explained. We know that the amount will be divided into some parts (administrative support, developer, project management, technical management, etc.). We know how much money will be allocated to each of these parts and also the value of the professionals' working day; I found that the amount requested is very high, for example the daily rate for the plutus developer is 1100 dollars, when generally in the other proposals the salary that I see being asked for this position is around 5 thousand dollars a month, so here the value it's really high. The other workers also have their daily rates well explained (\"UI Developer - $500/working day (8 hours), Project Manager - $260/working day (2 hours), Technical Manager - $260/working day (2 hours), Administrative Support - $400/business day (8 hours)”). I think this part of the proposal is very well explained, it is only up to readers and voters to decide whether the requested amounts are adequate compared to the market average. Finally spoken in the team, this part is great. We know in great detail who the members involved in the project are, what their names, resumes, linkedins are, we see that we have people with business and global trade experience, an own developer for Cardano will be hired, people experienced in the Cannabis trade, etc. As we can see from the excerpt: “Jhavid Mohseni, over 24 years of business and business experience in global distribution and trade, commodities, supply chain management, cannabis, operations and strategy. As a recurring founder with multiple successful exits, Jhavid is focused on vision, strategy and team, while supporting mission-critical priorities, revenue opportunities and ensuring fiscal accountability (…)”; there is a lot of detail about each involved. In general the feasibility is very good, despite my scores on the script and budget.", "q1r": 5, "q2": "Progress will be measured through monthly reports, developed by the project developers, in which they will report on whether the work was done as planned; team members will communicate internally through various suggested communication channels such as discord, telegram and whatssap, where they will share weekly task sprints along with reports. They claim that they will report the progress also by the standard reports to the IOG coordinators, in the Catalyst process itself, at least from what I understand. And so that the community can be aware of the updates, from what I understand the information will be posted on websites, it would be interesting for the proponent to cite which websites would be these and what would be the momentary success, exactly, as it could be considered - the partial results, the project development activities (as in the script we know the minimum and maximum amount of each task, it is simpler to monitor this). In other words, this part of the proposal is good, although we are not so clear about what content would be reported to the community, in what media and with what frequency. The proponent defines success with various pieces of information, for example a “Transparent, reliable and traceable product provenance system for cannabis and hemp material from seed to sale. (Backend feature) + System that empowers consumers/buyers with access to accurate product information and enhances the social enjoyment of the cannabis experience. (QR Code Interface - Buyer Front) + Immutable or Non-Fungible Token that promotes trust at the time of purchase + Search tool to access product provenance data stored on Cardano Blockchain (user resource)” and etc. It would be necessary to have, in addition to these more technical terms and precise data, a more general analysis of the cannabis market, to know how it was benefited through this project, and it would also be interesting to have a notion of how these customers would be becoming members of our community, if they are, etc. The proponent cites much-needed data, which may well safeguard that the KPIs specific to this challenge (“Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases + Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products + Increased quality of existing products & integrations through suggested improvements that are supported by customer feedback or increased usage by the community”). I think that part is also good, although we could have a better understanding of how this success scenario would be analyzed, how a presentation would be created and how this content would be passed on to our community (via Townhall would be very suitable).", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 552, "q0": "This proposal is aligned well with the challenge, as it will create a unique product that will help drive adoption and potentially a large increase in on-chain transactions. The Cannabis industry is growing quickly and is a massive opportunity. If this professional and experienced team is successful in Building a global supply chain for the cannabis industry on Cardano, they could capture a significant market share and bring it on to Cardano. https://flowhub.com/cannabis-industry-statistics This is a perfect real world use case that does not depend on crypto price speculation, as there will always be a demand for cannabis products regardless of crypto market cycles. Supporting and building this type of real world applications will further help Cardano stand apart from other crypto projects, and potentially help the Ada price decouple from the cyclical price of BTC. There is also potential for this supply chain technology to eventually be adopted by governments such as Canada that are regulating the sale and distribution of legal cannabis products. https://www.canada.ca/en/health-canada/services/cannabis-regulations-licensed-producers.html\n", "q0r": 5, "q1": "The proposing team is highly experienced in the Cannabis industry and has been able to successfully grow their business from Washington over the past 7 years. They also have a top tier cardano blockchain developer who was the software engineering lead at IOHK for 3 years, and a software development company that specialized in building software for the Cannabis industry. This professional team is capable of implementing this proposal and having a significant impact on the Cannabis industry and build a leading global marketplace and supply chain for legal Cannabis. The plan and budget are clearly explained in the proposal, and contingencies are provided with extra time allocated for development time overrun. The timetable with milestones is included with generous but realistic flexibility in the scope of time required for each task.  The risks are clearly outlined with detailed risk mitigation strategies included in the proposal. \n", "q1r": 5, "q2": "The proposal includes KPI's and metrics to track as well as key milestones. These will be reported to Catalyst with monthly progress reports and townhall breakout meetings. The have also committed to swarm sessions with the community to provide information and answer any questions during development. The proposal includes sufficient information for the community to easily track and audit the progress of this proposal. ", "q2r": 5, "assessor": "z_assessor_2108", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 9380, "q0": "This proposal to build a supply chain for legal Cannabis is one out of the three projects from Aperon aimed to apply Cardano blockchain technology on the supply chain, grading system and the marketplace in the Cannabis industry. The main idea of ​​the proposal is to provide traceability and transparency with the on-chain data by creating proof of smoke CNFT as a badge to verify quality assurance of a product. This is a project with great potential to create an innovative industry in the Cardano ecosystem as the cannabis business is emerging, but also quite ambitious, considering that in order to achieve a large adoption in the future the proposer needs to ensure the success of the three integrated projects.\n", "q0r": 5, "q1": "Judging from the team and the developer they hired, the proposal has a good potential for success as they have the necessary skills set. The proposal is outlined clearly and well-organized, by integrating the whole products such as CNFT to their community ecosystem will definitely trigger further adoption of Cardano. It would be helpful if the team also stated what are the challenges when implementing CNFT in the Cannabis supply chain and by giving a brief and easy to understand explanation about the technology complication, it will further proven the feasibility.The budget breakdown is rather high for a project but detail and reasonable, only need a little more explanation such as; the number of people involved in the salary cost details.\n", "q1r": 4, "q2": "The proposal is very comprehensive and able to provide a clear roadmap. Incremental methods also enable us to see the progress milestones periodically. The proposer has clear problem identification and solution. Just to add more transparency maybe the team can provide github repo.\n\n", "q2r": 4, "assessor": "z_assessor_3048", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 11318, "q0": "This proposal is found in the Daaps, Products & integrations challenge category. \n“Cardano needs a thriving ecosystem of different Dapps, products and integrations for the community to use that increasingly become the better alternatives over current centralized providers.\n\n\n\nThe more interesting and useful the products and integrations are that can be built in the ecosystem the more reasons people have to interact with the Cardano blockchain that can help further drive more adoption, feedback, growth and even more innovations.”\n\nThe Supply Chain 4 Legal Cannabis/Hemp and associated listing service and marketplace will be among the most interesting and useful products for a broad range of age groups & particularly interesting to many Cardano and other cryptocurrency community members - globally!\n\nThe issue that the proposer, Tamerlane, is trying to fix is that legal cannabis is highly regulated and susceptible to counterfeiting. The industry suffers from lack of trust, quality certification, quality verification & transparency from seed 2 sale.\n\nThey propose to fix this by integrating Tamerlane's existing, rapidly expanding, but still small enterprise to the cardano blockchain based technology. \n\nHere is how blockchain helps Tamerlane:\nBlockchain technology allows us to tackle all of the above challenges while delivering the following value add:\n\n1) Flips the script on producers being underpaid, under appreciated, and underrepresented at the retail counter.\n\n2) Provides a transparent immutable ledger of product provenance and traceability from seed to sale.\n\n3) Educates and informs the bulk wholesale buyer on every transaction what is being sold and bought with 100% confidence.  \n \n4) Educates and informs the consumer about all aspects of the product they are buying, where it came from, how it was handled, and connects them directly to the producer and supply chain that delivered the product.\n\n5) Empowers farmers and producers to connect with their consumers while providing intrinsic value in the form of loyalty incentives.\n\n6) Educates the consumer based on what cannabis is and is not versus misleading marketing and hype.\n\nBy connecting the Cardano blockchain to Tamerlanes technologies, the value added to Cardano can only be imagined. The cannabis industry is a very very large industry. Everything from seed to point of sale will be put onto the Cardano blockchain. \n\nThis proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer has taken the time to thoroughly look into what risks are associated with this proposal. They have further taken the time to work through those risks and find solutions/mitigations to them. \n\nAs far as the timeline/plan/milestones of this proposal, I am simply blown away with the level of detail and thought that has been put into it. The timeline is very clear, broken down into milestones, a minimum and maximum time frame has been given to each incremental part, the resources needed, and comes through as easily executable. Very good job in this area.\n\nLooking into the budget of the proposal it is also very clearly laid out, highly detailed, precise and would easily achieve the goals of this proposal. Furthermore it is put into a picture as a graph of where all funding will go. Another job well done.\n\nWhen it comes down to the team itself, every member is listed, their experience and skills are clearly posted, and links are provided for each one. The level of skill, expertise, and experience shows that this is a team that can get just about anything done, and specifically fully capable of implementing the plan/timeline listed in this proposal.\n\nI strongly agree that given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audibility of this proposal needs nothing more then what the proposer themselves put:\n\"\nIn addition to internal proposal team communication channels (Slack, Discord, Telegram and Whats App), weekly sprint reviews and monthly progress reports will be required from developers according to plan. We will integrate these updates within Catalyst progress reporting. Links to Test sites can be made available to Challenge team members, as they are ready. We expect to be active in after town hall breakout meetings (main and Pacific) and swarm sessions where we can discuss progress, solicit ideas and answer community questions.\n\"\nThere is no roadmap provided in this area of the proposal, nor any milestones, but all of that is clearly and highly detailed out in the feasibility section of the proposal and not honestly needed with that level of detail already provided. Nevertheless, it would be wise to add this to any further proposals put forth in the future. This allows the community, not just the team, to see what metrics will be used in assessing the progress and success of the proposal.  \n\nI agree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3237", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 12762, "q0": "The problem is clearly stated. The current supply chain in untransparent and could be improved using blockchain technology. This would create more trust and thus there is demand for such an application. \nThe proposal wants to build a cannabis supply chain service which tracks qualitative and quantitative product information over the whole process. Currently the proposing company has a “rapidly expanding but still small enterprise” This also proves the demand and interest in this theme. Overall the market/ industry and their technical system is well explained in this proposal.\nIn conclusion the proposal wants to create a solution from supply chains in the cannabis market to make everything more transparent. Therefore it creates a new usecase for the Cardano ecosystem and could bring many new companies to Cardano.", "q0r": 5, "q1": "The team has linked their LinkedIn. I looked at their CVs and they all have much relevant experience. \nThe budget is broken down in detail. The pay per day is clear and budget allocation to each task is also easily understandable. The pay for the plutus developer is high but for the experience reasonable. \nThe timeplan was explained in detail. It is clear how and when tasks will be done. The reader is very good informed and the development is planned in detail. \nThe team has communicated that they have other proposals running in this fund 9. All of the proposals are mostly the same but the differences are listed in the table and in some shorter passages in the text. (For me it´s fine because the information is clear and the differences are visible)\nOverall the project is planned in detail and it is very comprehensible for the reader. Because of the good planning and the experienced employees I strongly agree on the feasibility. \nThe risks are addressed in detail. For the potential risks the team has proposed some solutions. ", "q1r": 5, "q2": "The team will make monthly reports and weekly sprint reviews. This vastly higher the transparency. \nThey have made 6 different success criteria. Overall they are able th measure the success of the proposal. There could have been KPIs which focus on for example the number of users but the metrics focus more on the technical aspects. \nThe successgoal comes across in the context of the proposal and overall the application solves the stated problem.\nI my opinion it´s very easy to audit this proposal.", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13418, "q0": "The goal of this proposal is to harness the capabilities of the Cardano blockchain to provide a better service to customers of the team’s merchandise, which is centered on retail cannabis and hemp products. This is to be achieved through the use of NFTs and blockchain technology to improve the trust and transparency of the agricultural and processing supply chain, from beginning to end. This will bring a great deal of order to a product that by its nature can vary considerably in quality by the time it reaches a store shelf. Further, as adoption of a tokenized supply chain spreads in this industry, it should reduce any sleight of hand that some companies employ to maximize their profits by delivering an inferior and inconsistent product. As such, the proposal meets the goals of the challenge as it gives customers more ways to review and confirm the history of their purchase and to depend on buying the same thing again the next time. Further, the use of the Cardano blockchain will increase as more and more producers, retailers, and customers adopt and use CNFTs as part of the verification process within this industry.", "q0r": 5, "q1": "The proposal explains well how the cannabis/hemp industry and the team’s company works in particular. This is useful in demonstrating the need for the integration of a blockchain-based supply chain with their existing farming, processing, and retail procedures. Specifically, it aims to deliver a more consistent, high-quality product and more transparent view of its history, all through the use of NFTs and information stored on the Cardano blockchain. The experience of the team, the detailed plan and budget are all sufficient to implement the proposal’s goal. Further, the team has the resources of their existing company to help as needed, and they reasonably can rely on that help to mitigate many of the anticipated risks to the project. However, the proposal could be improved by including more detail about the process of creating and using the NFTs, and how the data to be stored on-chain is to be gathered from all the parties involved in the supply chain. The proposal is a bit light on that front, depending on a developer to create a blockchain solution and associated code of some sort. As this solution is central to the purpose of this proposal, the lack of clarity is a significant flaw in the document.", "q1r": 4, "q2": "The team’s proposal includes sufficient reporting and milestones to allow the community to measure the progress and success of the project. Specifically, the team will include internal progress reports in its Catalyst progress reporting and participate in town hall breakout meetings and sessions with the public to answer questions and demonstrate progress. Further, the team will release a monthly video in which they will discuss and demonstrate their progress on each aspect of the project’s development. The stated goals of success are clearly defined and will be easily confirmed by the community once the project’s work is complete. This may be done by checking the product label’s QR codes and the associated NFTs and blockchain information.", "q2r": 5, "assessor": "z_assessor_3624", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Create a cannabis supply chain service built on the Cardano blockchain. Tracking qualitative and quantitative product provenance from seed to sale. Shipment tagged w/QR codes linking to On-Chain data.", "experience": "Corp mgmt has 25 yrs exp in global commodities, supply chain, and brokering legal cannabis since 2016, +300 clients served, +1000 facility visits, +10% market share in Wash US, Exp. w/food blockchain & data tokenization. Contracting w/highly exp Haskell / Plutus / DEX / Djed devs"}