{"id": 420900, "author": "lendingpond", "title": "NFT renting(by Lending Pond)", "url": "https://cardano.ideascale.com/a/dtd/420900-48088", "category": 26595, "amount": 30000, "description": "Cardano still lacks the NFT infrastructure to support play to earn games, NFT breeding, and NFT borrowing.", "f6_no_assessments": 8, "f6_rating": 3.2916666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 9529, "q0": "For establishing a well-known problem statement with a clear solution to the issue, without quantified impacts, I rank this section a 3. There isn’t actually a lot of substance here for voters to evaluate, except for the fact that there is not yet an NFT renting mechanism on Cardano. An advantage for this proposal is that NFT renting isn’t at the top of anybody’s priority list. In working behind one of the larger lending/borrowing platforms on Cardano (through which I’ve established connections to multiple NFT marketplaces core team), I’ve workshopped ideas about features for greater NFT utility. In my relatively thorough experience, I don’t see any major players that are aiming at NFT renting capabilities before 4-5 other major items on their priority list. With this proposal, I would expect Lending Pond to be the first mover in developing this feature. The problem is that this section of the proposal lacks a clear quantified vision of impacts that directly justifies the $30k requested funds. I think it would give voters a much clearer understanding of the potential impacts by having cited information about Lending pond’s user base, the amount of transactions facilitated, the volume of transactions facilitated, and other stats of that nature. I checked their Twitter page and they do have some of this information collected (2 million ADA All-Time Volume, 24 hr 150k ADA volume, and highest ATH loan 30k ADA). Additionally, weight could be added to the potential impacts with modeling evidence from other NFT renting mechanisms on other chains. Even more specificity could be added with indicated numbers of how many P2E NFT games are building on Cardano. Another piece of information that needs clarity is the data on loan liquidation on this platform. One of the biggest fears about this platform among the big DeFi players is the lack of collateralization standards on this platform. Lending Pond allows their users to set their own lending terms, which is a great commitment to free market fundamentals and unrestricted decentralized decision making. However, interactions with this platform are extremely risky (especially for newer community members that might not be thoroughly familiar with the assets on the platform) because borrowers most often list loans for the full value of the asset. If you spend a decent amount of time on the platform, you’ll recognize the color-coded risk mechnaims they put in place but they don’t clearly define that mechanism or provide any education to borrowers on industry standard practices for collateralization. These risks of the existing infrastructure may leave voters with concerns that the approval of Catalyst funding will increase the magnitude of the existing risks. While this feature is not yet built within the Cardano ecosystem as a matter of fact, this section of the proposal lacks substance on what the impacts will be, what the impacts are worth, and a thorough assessment of the risks. ", "q0r": 3, "q1": "I rank this section a 2 because of a significant lack of detail to demonstrate capability, planning, and cost efficiency. If voters are judging only by the information given on this section of the proposal, they are not left with enough information to confidently vote in favor of plausible feasibility. On the core dev team, voters are only able to vote based on the built product of the Lending Pond team, even if they do the extra work to visit the Lending Pond website. The website only provides each team member’s role, pseudonym, and Twitter link. With the resources provided, there is no verifiable information on professional experience or demonstrable capability (outside of the existing platform). If voters are understanding this section through the lens of the core team’s capabilities, this proposal carries a major disadvantage. On the roadmap, the given plan shows a 1.5 month timeframe (perhaps too ambitious without provable capability) but doesn’t provide any information on what will be done outside of coding, testing, and launch/outreach. This doesn’t provide voters with a lot of substance to understand what is going to be done and when. Voters are used to seeing breakdowns of when smart contract design begins, front/backend development, UI/UX development, testnet deployment, mainnet launch, actionable steps on marketing/social-media/community building, and a lot more in-depth specifics on what is going to be done and when. The budget also lacks essential detail like hourly rates + hours of labor allocated, number of workers needed, and cost breakdowns of each non-labor expense. Given that this team will be working on 2 other proposals in the same timeframe, we can’t assume full-time hours dedicated to this specific proposal. While the overall budget is a very average cost for Catalyst proposals, the spending does not appear to be on the efficient side, especially with most of the budget going to auditing (rather than development). I think more substance/detail needs to be established here to secure confidence in a positive voter turnout. ", "q1r": 2, "q2": "While there’s only a couple sentences of substance in this section, I rank this section a 4 because there are quantified commitments/expectations to a level of performance that directly links to impacts. Perhaps I’m being generous here but I am technically left with the information that I want to be seeing for a positive reaction. I think the measurement of NFT rentals is the exact framework needed to measure success of this feature and I think 10 partnerships and 100 rents a week is a perfectly reasonable/valuable goal to attain. Obviously, this section could benefit from some big improvements in detail and expansion of auditiblity. First, this proposal does not contain sourcing for updates on this proposal for public accountability but the short timeframe given doesn’t leave me with a lot of concern about the community letting this one fly under the radar. Second, there could be more KPIs included like rental listings, rental volume, increased user base, social media engagement, website traffic, and other changes that could be made to the status quo as a result of this proposals approval. I am in full agreement that this section has very little information provided but there is still enough for me to see that the team has a specific vision for success/perforamnce that they intend to see. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 820, "q0": "The proposal is for an nft lending platform, where the borrower receives the nft for a period of time. NFT are still hugely popular and this is a great idea. If I want a particular nft, for example, for breeding, then I could pay to rent an nft for however long I want it. The borrower would also have use of intellectual property rights (if that is including with ownership of the nft), which could be used for marketing purposes or derivatives. As an nft collector, I'd like to see this get funded.", "q0r": 5, "q1": "The Lending Pond team has successfully launched a borrowing and lending platform which uses NFTs as collateral. It was launched some time ago, and I've only heard good things about, so, I believe this team has the necessary experience to complete this project successfully. However, we don't know who the team members are. Doxxed teams have a higher chance of getting Catalyst funding. Budget breakdown and action plan seem adequate. ", "q1r": 4, "q2": "Auditing of progress through the development process isn't covered, only how success after completion is measured. It would be helpful if KPIs could be measured before the external audit: how could they demonstrate progress after the first month?", "q2r": 3, "assessor": "z_assessor_2133", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2356, "q0": "This proposal intends to build an NFT lending platform that will be governed by a smart-contract with NFT/Token Collateral.\nmy question is why will i want to lend an NFT?\nThe proposal did not do a good job at explaining the benefits and also usefulness of the application to cardano.\nI will be giving 2 stars for impact according to PA guidelines as i do not know the use of such a platform.", "q0r": 2, "q1": "The proposal provided a concise and clear roadmap with associated timelines of activities .\nI can see that Coding starts in August, is that part of the proposal not require catalyst funding considering the fund 9 funded proposals will be onboarded in September?\nThe budget breakdown was provided but lacks details to how some of the listed costs was arrived at, for example \"8000 towards development costs for coding\" - How did you arrive at $8000?\nHow many developers will be working on the development? What is the pay structure like?\nas you can see, the lack of details of the budget breakdown raises lots of questions.\nThe proposal did not provide the details of the team with verifiable links to bio.It is not enough to say a team delivered this and that in the past and that is sufficient to give the team a pass.\nEach individual proposal should be well attended to.\nFrom the provided information, i do not have confidence in the team to execute the proposal to success.\nI will be giving 2 stars for feasibility.", "q1r": 2, "q2": "The proposal listed items that can be used to measure the progress of the proposal but fails to highlight the means to which the community will be able to track the progress of the proposal.\nI will encourage the team to utilise the monthly catalyst town-halls to update the community and also provide a public link or git that anyone in the community\ncan independently track the progress of the proposal.\nI will also encourage the team to use already funded proposals as a guide to drafting proposals on catalyst here https://docs.google.com/spreadsheets/d/15ELXp81NfvXHgrerTbuIofZOXBsdjocN1YgBK0gPP3E/edit#gid=2111315347\nI will be giving 4 stars for audit-ability.", "q2r": 4, "assessor": "z_assessor_2301", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 3126, "q0": "The proposal's idea itself might meet the challenge, however currently there are no real use case for NFT renting currently. As mentioned by the author that the proposed platform is geared towards the gaming industry (i.e Metaverse Games). Although there could be potential in the future when those games are released and userbase on those games take traction. Currently I don't see NFT Renting making an impact in the current market as most blockchain games in the Cardano network are still in their development phase. Thus with this I have to stand neutral on this proposal effectiveness in this challenge.  ", "q0r": 3, "q1": "Given their working product (LendingPond) is up and running. I believe they have the know-how and skills to built and further enhance their current product. Thus I have full confidence in them in executing this project. The team has also addressed the biggest risk which is hacks and vulnerabilities of the smart contract. The team has plan to mitigate by spending extra time and funds (spend on audits) to ensure the safety. The timeline and milestones are listed, but only briefly. Would appreciate if the proposal has more information regarding the timeline and the budget breakdown i.e which company would handle the audits.  Overall the implementation of this proposal is highly likely successful given the presented information.", "q1r": 4, "q2": "There is a very brief estimation on the timeline approximately 1.5 months to deliver. However there is no detailed breakdown on how the community would track the progress or give feedbacks. There are given indicators in the proposal to measure the success of the project. Which with that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2403", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3905, "q0": "The issue being Cardano continues to lack the NFT infrastructure required to support play-to-earn games, NFT breeding, and NFT borrowing. The proposer wants to resolve it by making a peer-to-peer NFT renting platform that uses smart contracts to help Cardano NFT projects and games with their in-game economies. This proposal does address the proposal. This will add value value to cardano NFT ecosystem and thus helping cardano. The metrics of the proposal do align with the challenges ", "q0r": 5, "q1": "The proposer is the team who have built Lending Pond is Cardano's largest and most active lending platform and have been running from past 6 months. They have experienced in planning, researching, and implementing NFT tools and services for the Cardano ecosystem and also has required skills which should be adequate to carry out the proposal. The fund of $30000 USD is being requested but they have given a rough breakdown therefore it is hard to say if the requested fund is justified or no. The risk being that Plutus scripts are safe and resistant to hacks which the proposer has considered. hence the possibility of the proposal being implemented is more.", "q1r": 5, "q2": "The proposer has given clear timeline to implement this proposal from 1st August they will start working on it and by 15th September it will be launched. This clear plan should be enough to audit the progress of the proposal. The proposer has provided following metrics being number of rentals every week, and the number of partnered play to earn games. The success of the proposal can be audit by 10 play to earn game partnerships and over 100 rents a week. All these should be enough to track the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6446, "q0": "NFT renting/borrowing is something that Cardano hasn't seen yet. This innovation could lead to a lot more traffic coming from those that are avid NFT collectors. The challenge identified by this proposal is that \"Cardano still lacks the NFT infrastructure to support play to earn games, NFT breeding, and NFT borrowing.\" Their solution to this is by utilizing their currently functioning nft lending/borrowing protocol to implement NFT renting. The team plans to include more utility into the ecosystem this way and specifically plan to create partnerships with the actual NFT companies rather than users. This will likely bring more utility to their dapp and support NFT projects. For these reasons, I give this section of the proposal 4 out of 5 stars. I would suggest providing a more in depth plan on how the team plans to implement these and how it will directly benefit the NFT projects.", "q0r": 4, "q1": "The proposal includes information on their team simply by stating that they are the on the Lending Pond team. After doing more research, I decided to look into their website. This is where I was able to find information on the team. I would highly suggest implementing details on each team member, along with experience and accomplishments. This will help other readers of the proposal to identify how likely the proposal will be implemented successfully. Apart from this, the roadmap suggests that the team plans to accomplish this feature within 2 months. This is very quick and suggests that the team has already considered how they will go about working on it. There are specific details and a timeframe leading out to September 15th where they will reach out to NFT projects. The budget breakdown is very simple and concise. It could possibly include more details. But it is sufficient enough to get it's point across. The downfall of this section is that no information about the team members or experience is included in this proposal. This needs to be fixed. For these reasons, I give this section 2 out of 5 stars.", "q1r": 2, "q2": "One of the biggest parts to a proposal is considering how important the proposed idea will be and how much utility it brings to the Cardano community. Along with the team behind the proposal and the likelihood that they are capable of carrying-out their proposed plan. The proposal could include more specific information in the roadmap and budget breakdown. Including these specific metrics is very important to hold the team accountable for this proposal. Along with including the identity and experience of the team of course. Once these things are included, there can be more room for assessments. The team needs to be transparent with their community. I would also suggest informing the community of this proposal and getting thoughts and opinions. This builds trust and allows the community to be a part of the process. It also promotes accountability and increases the likelihood of the proposal being successful. For these reasons, I give this section of the proposal 2 out of 5 stars until these suggestions are considered or implemented.", "q2r": 2, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7909, "q0": "The proposer fails to explain the entirety of the project and only paints a vague picture. An assessor is left to guess on how this project can add value to the Cardano ecosystem. The proposer can seek help from peers or community members to assist in drafting a proposal. Looking back at previously funded proposals can also help in learning what makes up a good proposal. The idea is probably a good one but we as assessors need to assess the proposal and not just an idea.", "q0r": 1, "q1": "The team has an already working product, the Lending Pond. The Lending Pond allows users to apply for an ADA loan by offering NFTs as collateral and has become the largest Cardano's largest lending platform. This demonstrates that the team can build great products. The proposer does say that they have \"built and delivered many successful NFT features in the past\" but only provides references to the Lending Pond. If there are other successful builds then the proposer should provide them, otherwise not claim they did without providing proof.\n\nI am glad to see that the audit of this project was taken seriously as it makes up a third of the requested amount. The budget however could have been been presented better. The \"development costs for coding\" should have been listed item by item showing what it entails. The rest of the expenses was lumped together as a one line item. An itemized budget laying out all expenses with costs shows an assessor that the proposer has done research and found out what certain things actually cost.", "q1r": 2, "q2": "The roadmap is very short. It only contains 2 dates and less than 20 words. This does not inspire confidence and would come across that this part was rushed and/or not given much attention. A roadmap does not have to be an essay but it should be a clear snapshot of what the team is planning to do and when.\n\nUnfortunately the proposer did not provide a way for the community to audit the project. There are lots of ways to let the community see how a project is doing. A simple website dashboard to display results, github repo or Google Sheet document. Sadly, none of these were suggested.", "q2r": 1, "assessor": "z_assessor_2935", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13483, "q0": "This is a great idea useful for the community Cardano lack of NFT infrastructure to support play to earn games, NFT breeding and NFT borrowing is the problem to solve in this challenge it fits the challenge current consciousness. The author has proposed the assumption that the Lending Pond team will create a peer-to-peer NFT rental platform using smart contracts to support Cardano NFT projects and games in the game economy of the country. surname. This is the author's solution to this challenge. The author also outlined their major risks of ensuring that Plutus scripts are secure and resistant to attacks. This problem is completely consistent with the current challenge, but I have not seen the author should take measures to reduce the risk for this challenge.", "q0r": 4, "q1": "The project's author has also given the important timelines for this project as: August 1: coding, September 1: Two-week testing and evaluation, September 15: Launch, September 15: Get access to the top 30 plays for game monetization. In this timeline I see it as completely possible to execute the project successfully. The solution to this problem is that the NFT rental platform will be able to integrate with various NFT projects that require NFT to play or take to the next level. In general, this engine will be most beneficial for games in the game economy. The success of the project is reflected in the number of turns played by the participants.", "q1r": 4, "q2": "Well-defined KPIs, a measure of project success based on the number of rentals per week and the number of plays by partners to earn the game. The Lending Pond team has built and delivered many successful NFT features and services in the past. Lending Pond is experienced in being able to effectively plan, research and deploy NFT tools and services to the Cardano ecosystem. This proposal's funding budget is $30.000 less than 20% of the entire challenge's budget. The budget is divided into 3 stages to spend, but I need the team to list in more detail the hours and days of implementation for those stages.", "q2r": 4, "assessor": "z_assessor_3650", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "The Lending Pond team will make a peer to peer NFT renting platform using smart contracts to support Cardano NFT projects and games in their in game economies.", "experience": "The Team at lending Pond has ran lending pond for the past 6 months.\nLending Pond is Cardano's largest and most active lending platform. "}