{"id": 420924, "author": "nzola8", "title": "Lokole and Cardano Integration", "url": "https://cardano.ideascale.com/a/dtd/420924-48088", "category": 26595, "amount": 67200, "description": "Do you know that 33.8% of the world population cannot access crypto currency, because they are not connected to the internet and all the software applications and hardware are made for the connected?", "f6_no_assessments": 9, "f6_rating": 4.296296296296296, "videos": [], "media": [], "f6_assessments": [{"id": 1703, "q0": "Yes, the proposal fits with the objectives of the challenge, as it would promote the development of a device that would give people who do not have access to the internet the opportunity to connect with some of Cardano's technologies (especially digital wallets, so I understood). However, I have some caveats to make. The problem raised is very important to be solved, because while some projects are designed to bring more technology and solutions to populations that already have several resources, this one aims to benefit marginalized people, who live in remote regions and who do not have a good internet access. According to the proponents, this share corresponds to about 33% of the world's population - a very high percentage of people who are unable to engage with the cryptographic world precisely because of lack of internet access. So to mitigate this, a “solar-powered portable offline/online server device called the Lokole Numerique box was built, which will give the Cardano Ecosystem a golden opportunity to reach the world’s disconnected populations.” Ee would function as an “offline portable email and web network server running on a single board computer to provide an internet experience when offline in remote regions of developing countries around the world where data costs are prohibitive for the low-income population. And Cardano would relate here because there was a web application where individuals could create a digital wallet, from what I understood, that would connect at a fixed time with our blockchain network to execute transactions. I believe the idea is good but some comments must be made. The first thing I thought about the project was how these people, who live where the internet itself is inaccessible, will be educated about the basics of the cryptographic world, so that they can understand not only how to create but how to use a digital wallet. It would be good if they understood well what blockchain is, what Cardano is and what makes our ecosystem different, what Catalyst, Ada, etc. If they understood about Catalyst, it would already be a way for them to get involved with our community, being able to learn more about the world of blockchain to become PAs, and with that acquire an income that could even help them out of the precarious situation in which they meet. I think that for this to happen, it would be necessary for these people to be helped and instructed, not just to acquire a device that would give access to Cardano; it is also necessary that they understand about Cardano, how to take advantage of the opportunities that are available today. Other than that, it would be interesting if they could access the ideascale website as well, with the help of this device (so that they become APs); ideally, they would be able to establish contact with the rest of our community, but I don't know to what extent the solutions proposed here will make this variety of resources available. Yes, I agree that the starting point is that they get access to the internet/Cardano and that it is cheap, but this issue of helping them to integrate into our community is also very important, and in my view it should have been commented on in the proposal . Other than that, it is very positive as the proponent already points out some risks and how to mitigate them.", "q0r": 4, "q1": "Unfortunately, the proposed roadmap is not adequate, for two reasons. First, the temporal division is very extensive, the phases are of 3 months, and it is commenting very superficially what would happen in each quarter. It would be better if the time split was monthly, so our understanding of what would be done when would be most accurate. It would also be essential that the activities were more explained, more detailed. In the first 3 months, the activities would be about the “consultation between the software developers of the Lokole system and the developers of the Cardano Ecosystem to share and learn how the two topologies work”. How would this bridge be established? Would online meetings be held, what goals do they intend to achieve at the end of each month, to ensure the integration of these two technologies? The second quarter is summarized in “preparing the necessary tools to face the integration project”. What tools are these, how would they be prepared? In “Lokole software developers build, test and debug the system and deliver the MVP product to the public for use”: I was quite confused about this part as I had understood that the product was already ready to be released. But in that case, how would the work routine be to perform the construction and testing of the product? A very important thing for this proposal is how the product would reach the target audience, unfortunately no marketing campaign is suggested. How can we ensure that the product is widely adopted, that people understand what it is, what it's for, and engage to buy a copy and start using it on an ongoing basis? We would need to think very carefully about this approach, because in my view this is the heart of the proposal, that is, without people adopting the product, our objectives of both benefiting the local public and promoting the Cardano ecosystem would not be well achieved. . Now talking about financing, the asking amount is divided into 2 parts, the salary of the engineer and the project coordinator. I think it's pretty clear how the funding would be used, something that could have been better explained is about the routine of these workers; I am also in doubt about the payment of all the professionals involved in the first quarter, where the bridge between this project and Cardano would be made, surely they would contact our blockchain developers: would they not be paid? And, once again, it would be necessary to set aside a value for the marketing campaign, to make a good publicity that would reach the target audience in the most effective way. And finally, talking about the team's presentation, this part is good, but it also deserved some improvements. First of all, it would be important for us to have the same level of detail about all team members - for example we know a lot more about Nzolantima Swasisa than we do about Shaun Bathgate. It would also be positive if everyone had attached their linkedin profiles. Talking about the way they describe their professional performances and previous experiences, we managed to get a good visualization of who they are and trust is conveyed here, but it would still be better if someone on the team were more specialized in Cardano - or at least they had provided names of members of our community who want to develop partnerships.", "q1r": 4, "q2": "The suggested auditability for monitoring progress is very good compared to tracking partial results; but it is not clear how the development process itself of the project would be monitored, that is, the activities, work routines, what has been done during the quarters mentioned in the part of the roadmap. We would need to know in more detail what to expect for each month, and the ideal would be for a member of this team to post updates at the end of each month, this could be done, for example, through the github page (it is very positive as they already that bridge the gap between the community and the project team, it just needs to be used properly). I also found it very positive that they will carry out surveys with Lokole users, as is clear in the excerpt “we will carry out a digital survey by email among our Lokole users. In this way, we can learn and deeply understand how our solution has improved their lives in health, education, economics and social issues. Please note that no one could conduct such surveys without our technology allowing us to efficiently distribute the survey via email.” Another very important thing here were the KPIs they plotted to measure the success of using this technology in the local community: “How many people are using the service on a given day? Why do people go to the kiosk and pay for usage? How much money does the operator earn from the business?”. Both this survey and the answers to these questions should also come to our community's attention, either through gitbook or another way of executing this contact. But in general this part of the auditability is very good, very rich in information and monitoring alternatives. And about the ultimate success, they say it can be seen in three ways: “First, our project empowers everyone who is disadvantaged by poor communication infrastructure in rural areas” – they cite many examples of people in vulnerable situations. It would be very positive if they took some examples of students, remote organizations, entrepreneurs, etc. who used technology and demonstrated with verifiable data how important it was for a positive change in their lives. Second, as they themselves state, success could be seen as “in the international development community it is believed that access to efficient ICTs (such as e-mails) is very significant for people and for sustainable development” in addition to the survival\"; and finally, “Field testing our proof-of-concept deployment has allowed us to prove that our innovation actually has a significant positive impact by solving a real problem for people living and working in rural DRC”. It is clear how the proponents understand what should be generated, they explain very precisely what the success scenario should look like, so the only thing that remains to be done is to really bring all the information within reach of our community. For a final presentation, I believe that it would be very rich if they participated in a townhall where they would tell success stories and inspired examples generated from this project, always making it very clear if the objectives of the challenge were achieved. Although it was still a little unclear whether this bridge between all the information mentioned above and the Cardano community would exist, the topic is excellent.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 799, "q0": "There is a need for Internet bandwidth optimisation and compression system to achieve economical data usage in areas with very high internet access costs. Lokole devises as mentioned in the proposal and email app has the potential to provide an online email service. There is a way to have offline Cardano node synch with the local device and then upload to the mainnet whenever there is the internet as per Charles Hoskinson which he mentions in one of his videos. This device is promising similar technology and such technology is highly critical for the proliferation of Cardano in Africa which is targetted by Cardano in a major way. Cardano hopes to become the financial operating system for the unbanked. With this aim, there is a critical need to develop offline and low bandwidth low-cost solutions. The proposal in this respect is perfectly aligning with the aim of Cardano and this challenge. ", "q0r": 5, "q1": "The proposal has been filed by people who have roots in Africa and also have excellent software development credentials. The strength of the team is quite good. The team's full stack developer has experience of working with software giants. The github repository of Lokole software is active with 1500+ commits and about 15 forks. Therefore it can be said that the project is actively in development. The technical risk in achieving Cardano node integration using Lokole and its hardware is likely to be substantial. However, the Cardano node has the unique distinction of running on a raspberry pi without much issue in a stable manner using Solar panels. Therefore it is highly likely that the team will be able to successfully complete the project in the proposed timeframe. ", "q1r": 5, "q2": "\nThe proposal bids 67.2K for Engineer's salary at $35/hr for 6 months and a project coordinator's salary at the same rate of the engineer. Therefore the proposal gives an impression that one engineer will be able to develop the complete code and customisation for achieving the target. There is a phase in the project for consultation between Lokole system software developers and Cardano Ecosystem developers to share and learn how both topologies work. This is difficult to understand for me in the sense that the team proposing a project in Catalyst should be knowing the Cardano network in a better manner and the process of consultation after the project launch is likely to bring out some risks which were not appreciated during the project formulation phase. A much more detailed breakdown of the budget with better task analysis would have added tremendous value to this important proposal. ", "q2r": 4, "assessor": "z_assessor_2129", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1304, "q0": "The proposal aiming to provide internet connection to those who can not afford it, by offering a cheap device “Lokole” that is creating a Wi-Fi network when turned on. It works on minimizing the data required to be transferred and therefore reducing the cost of bandwidth which is very beneficial for users that can not afford internet connection due to being poor. The overlap with Cardano is that proposers aims to run a shareable Cardano client web application on the device, and thus provide an access to blockchain for those, who are currently not-connected. I think such solution can cause a large impact especially within Africa region (makes me wonder why it was not submitted withing “grow Africa, grow Cardano” challenge), nevertheless, its development can onboard many users and is aligned with the long-term Cardano vision in general. ", "q0r": 5, "q1": "The roadmap is set to 9 months, whilst the 3 months periods are defined – first three months are dedicated to consultation between Lokole devs and Cardano devs, another 3 monts will be devoted for preparing the tools for the integration of the project – planning and schedule, and the last three months are dedicated to testing and debugging. To be honest, the plan is only high level, with not so many details, making it really hard to assess how the proposer will proceed. The budget requested is 67 200 USD, and it is calculated as engineer salary and project coordinator, with 35 dollars hourly rate, for a FTE for 6 months. It would be better to outline at what parts of project the engineer or project manager step in, since the roadmap is 9 months, but budget is only for 6 month (so I assume some overlap, but it is not described in the proposal). The team is consisting of 4 people, the founder and three devs. From this it is not apparent who will be doing “engineer” part, and who will be “project lead” as it is not specified in their bio directly. Nevertheless linked in profiles are also posted. I have also visited the links posted, and it appears that the project is having a solid ground. The roadmap, budget and team is lacking some information which makes it difficult to verify its feasibility. ", "q1r": 3, "q2": "The audit of the proposal should be focused on two parameters at least – progress and success. The progress is usually audited via roadmap, but since this roadmap is lacking a detail, I think it will be hard to audit the proposal, unless the proposer implements some metrics such as: some reports/blogs/articles on some public media channel such as twitter/discord/telegram or even github, to provide information to the community how are consultations with cardano devs going, what issues were faced and which issues were solved, and possibly, how the team is moving towards the set goal. Regarding the success metrics, the number of users can be used or number of purchases of these devices, which could be published, again, on some public media channel, or at their website (considering that ascoderu is proposers website). Even tough not all of these metrics were stated in the proposal, I am keeping the high score, because it can be easily implemented. One star down because 9 months period is not having a clear deliverables, so it will be hard to track the progress since we do not know what is expected to be delivered e.g. after the first month, second….etc. ", "q2r": 4, "assessor": "z_assessor_2222", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3907, "q0": "The issue being 1/3 of world population doesn't have access to crypto due to lack of internet connection and also all the software applications and hardware needed to connect. The proposer wants to resolve this with the help of a portable server device they have built called box Lokole Numerique, Which will help people around the world who are not connected to the internet. to get access to the internet. By adding more people to internet more new members can be onboarded to cardano intern helping cardano ecosystem. This proposal does resolve the issue", "q0r": 5, "q1": "based on the details provided in the proposal it can be said the proposer has the required skills and experience to successfully carry out this proposal. The proposer has considered the risk of equipment theft or damage, network failures and Security and data privacy. The proposer has requested a fund of $67200 which has clear budget breakdown and upon through analysis the budget demanded is justified. it is highly likely this proposal will be implemented\n", "q1r": 5, "q2": "The proposer has provided a clear plan which are divided in 3 phases each of 3 months and also consists of work needed to be done. The proposer has also provided clear explanation on measures to track your project's progress. \nThe proposer has also provided details on how success of the proposal would look like. \nConsidering all these it can be said the info given is enough to measure the success and progress of the proposal ", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4212, "q0": "The Lokole and Cardano integration proposal is to have Box Lokole Numerique run a shareable Cardano client web application. Box Lokole Numerique is an offline portable web and email network server. This server can be run on a single board computer and can provide internet access while in remote region of developing countries. The portable server is easy to use with minimal training. With this proposal, users would be able to connect to the box and create their personal wallet offline with the box connect periodically at a scheduled time to Cardano Node in the cloud exchange transaction. The dApp will allow the community who don't have internet access individually to be able to participate in Cardano ecosystem. The proposal fits the Dapps, Products and Integration challenge very well as it will increase user base of Cardano in Africa (in the DRC in particular). The Ascoderu will also provide low cost and low maintenance system that will faciliate in the implementation of this Lokole box. The proposer also specifies risks with very plausible ways to mitigate such risks.  Since the Ascoderu was founded by the project leader (Nzola), it will be for full disclosure the involvement of Ascoderu with this project and whether his Lokole box is patent protected. It is for his own benefit and also for the community to give full disclosure on the patent and relationship between entities. ", "q0r": 5, "q1": "The total project time is 9 months with the first 3 months on planning between Lokole system software developers and Cardano ecosystem developers and next 3 months for the integration and the last 3 months for MVP delivery. The budget breakdown should include the number of hours for the engineer and project coordinator. The project is comprised of individuals with strong technical skill as most of team members are developers themselves making it very likely that they can implement this project successfully. The team will return to Catalyst for further funding to help connect the unconnected communities. ", "q1r": 4, "q2": "The proposal would be considered as a success if they could implement this solution and help to promote equal access to information for the unconnected communities. It is a good sign that many non-governmental organization are keen to purchase Lokole. The integration can be a pilot for Crypto adoption among unconnected communities. Lokole team will provide the project update via their GitHub page and also the community can check the stats on their web app users. The feedback of their users (qualitative data) will also be collected along with the ambassadors that run lokole kiosks to check the traction. The Lokole team should keep in touch with the community via meetings also if they could attend some townhall meetings as it will help the community to understand their project and its importance better.  ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5904, "q0": "This is a helpful suggestion. It has a huge impact on people living in remote areas that don't have access to the internet, especially people in African countries. This project will minimize the amount of data required to be transmitted over an available internet connection, thereby reducing bandwidth costs for users. Users only need devices that can run a web browser to connect to the Lokole Numerique Box, run webmail and locally hosted web apps truly offline so all server or database calls are all free. This will help people have the opportunity to access Cardano, they will understand information related to the ecosystem, improve socio-economic life. It is for the above reasons that this project has effectively tackled the challenge.", "q0r": 5, "q1": "Team information has been provided. Your team consists of experienced members in the fields: blockchain, software development,... . They have all the knowledge, experience and skills to carry out this project. In addition, the links to their Linkedin profiles are also listed specifically. This will make the above information more transparent. Having a strong team is an advantage of the project, it helps the project to be carried out easily, people can add confidence in this project. You did a great job in this part!\nYou described the proposal very specifically and in detail, so that everyone can get an overview of the project. In addition, I would also like to commend you for identifying the risks, challenges and ways to mitigate them. This will be a solid basis for the project to develop sustainably over time. However, I think with a project with a long-term roadmap (9 months), the volatility of ADA price will also be an unpredictable risk. Detailed roadmap (9 months) has been provided. Since you guys have experience in creating Lokole Devices in previous funds, this proposal will be a lot easier to implement. You've identified the big to-dos and allocated them to specific timelines. Budget allocation is also provided, the budget is mainly paid to coordinators and engineers, but it is also quite vague. Besides, I think marketing and communication always play an important role in a project, it helps to increase the number of people accessing the project, bringing greater efficiency. If possible, it would be great if you add it to the roadmap and calculate a budget to implement it.", "q1r": 4, "q2": "Criteria for assessing project progress and success have been provided. They are very complete and detailed. In addition, the willingness of people and organizations to spend money to buy equipment will be proof of the positive effects it brings.\nAlthough the information provided still has some shortcomings. But I still have full confidence that this project will be done. Since you already have experience in implementing similar project in fund7, this project is a variation of it. In addition, this project also brings a positive impact to the people of Africa, helping them improve their livelihood, thereby motivating them to participate more in Cardano, helping the Cardano ecosystem to grow. I will vote for you, the same way I did at fund7. Thank you !", "q2r": 4, "assessor": "z_assessor_2757", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9058, "q0": "This impact of this proposal is questionable as it relates to the challenge goals. The aim of this proposal is to collaborate with the makers of the lokole portable and durable personal computing hub. This device has been successfully field \n tested and distributed across the Congo in Africa. The team developing it has created it so that it can help people check email even if they don't have immediate internet access. This is to help bring the internet to more people in more places. The goal of this proposal is to work with that team in order to find a way for that device to have access to the cardano network.  While this is a worthy and admirable goal, it's not immediately clear how this meets the impact goals of this challenge. The proposal does not make obvious whether the proposal team plans on developing, adapting or creating some new framework to enable cardano on these devices without immediate internet access. As a result I am uncertain as to whether or not this proposal will have an impact on achieving the goals of this challenge. Even though it will have an impact toward furthering the goals of the fund and Cardano.", "q0r": 3, "q1": "I'm uncertain about the feasibility of this project. This is not a result of the team's skill experience or qualifications. But it is a result of their lack of detail regarding the overall plan of the project. The Proposal has broken its workload into 3, 3-month periods. The Milestones to be accomplished, and the plan of work during these periods are nonexistent. There are just three large goals associated with the months, one for each month. For a proposal like this, I would have preferred if the team had begun conversations with the lokole  team prior to submitting this.  it would have been better for the proposal to contain detailed information about the plan of integrating cardano with the existing operating system. Having said this, I can see that based on the experience of this team that this proposal could absolutely be feasible. As a result of my uncertainty I'm giving this a score of 3 in the feasibility category.", "q1r": 3, "q2": "The goal of his proposal is completely clear, and the auditability metrics are well thought through. I have faith that this team tends to be transparent and to be open to the community. The only reason I am giving this proposal a score of 4 is because the metrics do not align with the time frame even though they do align with the project goal. But overall, This proposal has a solid number of metrics that will help them determine the success of their proposal. These metrics involve the use of the Computing hubs, the use of the software , and email surveys to the new users. Overall this proposal would have a large social impact even though the challenge goals may not be met, and this team would be  capable and qualified to see it through. ", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "This is a very fair and honest assessments.\nThe assessor is questioning whether we have started talking with Cardano developers. \nThe answer is YES. I connected with the group IOHK and Mlabs who are experts in Cardano technology.\nAbout the details, as we continue conversation with Cardano developer, we are being advised how we should go about this integration. For instance, we will begin by installing and testing Haskell programs in our device."}, {"id": 10398, "q0": "The internet is now an essential part of people's lives. Although the internet has already become popular with most people in the world, there are still some people in remote areas that do not have access to the internet. The proposer suggests building a server device that helps the world's unconnected populations can connect and access the internet. This server device is called Box Lokole Numerique which can be charged by solar energy. Box Lokole Numerique will run a shareable Cardano client web application which helps users connect Box Lokole Numerique and create their personal wallets offline.", "q0r": 4, "q1": "There are 4 people in Box Lokole Numerique project. All of them are developers and software engineers. They will implement the project in 9 months and be divided into 3 phases. During the first 3 months, they will conduct consultations between Lokole system software developers and Cardano Ecosystem developers so the process does not cost anything. They need $67200 to build the project during the next 6 months. Their goal is to complete the Box Lokole Numerique. The project implementation location is Africa where internet access is still difficult. So if the project is successful, it will easily receive the approval of the people here.", "q1r": 4, "q2": "The team has listed 3 risks that their project will deal with. They are theft or equipment damage, cellular network failures, security and data privacy. They also have solutions for the above 3 risks. We can follow the team's work through this link: https://github.com/ascoderu/lokole/issues. We can visit the website of Lokole to update new information. The team also sends a digital email survey to users. This survey will help measure satisfaction with Box Lokole Numerique. ", "q2r": 5, "assessor": "z_assessor_3183", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10582, "q0": "The first thing I want to mention is how the proponent posed the problem, they described the main functionality that users would get when connecting to Lokole networks and instructions on how to use this network. I find this idea quite good and has the potential to help users access data and improve their quality of life. The proposal has described the solution to ensure adequate information sources such as functions, main features, potential target audience, usage, etc. Moreover, by connecting Lokole networks, taking full advantage of Lokole networks using the benefits that Lokole brings to increase cost and resource efficiency, these are issues of concern, especially in areas that are still poor, with uncertain conditions such as Africa, this idea is more and more effective and influential. The solution proposed by the proponent I found identified the problems of the challenge. However, I feel that the proponent should add more metrics to measure the results achieved against the set goals to monitor better and control the project. In addition, the proponent has not mentioned the impact of this project on the Cardano ecosystem such as the number of visitors, coverage, etc. I think that if there is more such information, it will increase the validity of persuasion for the project. In addition, the proposal also mentioned the difficulties and challenges that need to be faced when implementing this project and also proposed solutions for each arising problem. The early recognition and measurement of risks for early remedial measures show that these are serious people with a clear mindset about the potential and challenges that the project brings.", "q0r": 4, "q1": "In the \"Feasibility\" section, I see that the proponent has also given the roadmap and budget allocation as well as the team involved in the project. About the timeline: the proponent is also separating into 3 timelines: the first 3 months, the 2nd 3 months, and the 3rd month, but I think there should be a more detailed list and specifying the specific date and time to start the project. Moreover, instead of compounding by quarter, I think it is better to separate by smaller units like weeks or months and define specific tasks and tasks for each time unit. Smaller separation makes it easier to implement and monitor, and better quality control. Regarding the budget, I see that this section is showing the cost of paying for labor, there is no information on the budget for equipment and machinery systems. In addition, the proponent can consider the option of deducting a part of the budget to form a reward fund for excellent individuals/groups to encourage them or set up a risk reserve fund to respond to unexpected events and sudden occurrences. About the team involved in the project, I found the proponent presented quite clearly and in detail, these 4 members are all experienced in different fields, which helps the project to be developed promptly and more comprehensively. Information from the project team is also provided through LinkedIn so that everyone can easily access and search when needed.", "q1r": 4, "q2": "To measure the progress of the project, the proponent presented, coherently, and comprehensively the criteria. With the tracking through the GitHub page, it is easy for the community to control and evaluate the quality. However, about the statistics part, I think this section should have specific target data based on actual data and that number of plans will evaluate the completion rate of the project. The success of the project is also clearly defined by the proponent by breaking down into 3 ways their change will impact people's lives. Each section is clearly explained which is very important in the audit process because this is the information that shows the operational roadmap and how the results have been achieved, making it easy for the community to track the development as well as the results as an assessment of the actual value that the project brings. This proposal is the variation of the \"Lokole Education Centre in DR Congo\" project, funded in Challenge 7. Therefore, I think that previous experience and resources will be an advantage for the next project.", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "We have built a solar charged portable off/online server device called box Lokole Numerique, which will give Cardano Ecosystem the golden opportunity to reach out to the world unconnected populations.", "experience": "Group of Open Source developers, software engineers, coders and electronic technicians.Using Python, Microsoft Azure, Flask, GitHub, RPI."}