{"id": 421147, "author": "edvard", "title": "Farmer carbon credit validation", "url": "https://cardano.ideascale.com/a/dtd/421147-48088", "category": 26595, "amount": 88500, "description": "Smallholder farmers does not get compensated for implementing carbon removal practices, 100s of millions of farmers are left out of the multi billion carbon market", "f6_no_assessments": 6, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 1847, "q0": "This proposal addresses the challenges of marketplaces, nation governance systems and environment. The team plans to build a dApp with digital identities of farmers in Ghana to certify them to incorporate carbon removing farming with biochar (a soil fertilizer to remove carbon). The proposal also gives evidence of the lack of transparency in carbon credits in the world and low income of the farmers from a developing country. The team intends to tackle these problems by building dApps on Cardano blockchain making the carbon removal in the environment transparent and traceable. Hence, the farmers can create carbon credits. The team also will add a feature of earning and selling carbon credits marketplace in the dApp producing income for the farmers. The dApps can slowly scale globally starting with Ghana as it incentivizes farmers, corporations, and NGOs to help the sustain the environment and increasing carbon credits with transparency and verifications. The have stated the risks and how they plan to mitigate them. The team have partner with WhatIfFood, Pond Foundation and collaborate with the local team WADA.org to mitigate those risks. ", "q0r": 5, "q1": "The team have the relevant experience both in food supply chain starting all the way from farming and blockchain developer. This is important area of expertise for them to build a suitable dAppss for the farmers to lower the carbon in the environment. However, my concern is that the team do not have Plutus/Marlowe or Haskell coding language to build on Cardano blockchain. With all the hacks happening on many dApps in Ethereum, Binance and Solana, it is important to have high security to build on Cardano blockchain. The timeline is laid out over 5 months and enough information was broken down. The milestones are realistic and achievable for the team to deliver this project because they have the skills and experience in blockchain development including relevant partnerships to work together. The team have broken down the budget of where the funds are allocated for this project. Considering the expertise of the team, the amount requested is more than enough for them to execute this project. The success rate of this proposal is medium to high because they have the experience, but they need to consider the high security of the dApps to avoid hacks and loss of funds. ", "q1r": 4, "q2": "This proposal is easily audited with the metrics provided by the team. They will be transparent by sharing relevant documents in github and google drive. IIs is wonderful for them to have open source keeping the ethos of Cardano and crypto. Moreover, the community can monitor the progress as the team will also provide monthly updates on their progress building the dApps and coordinating with the farmers and their partners. The updates will include team’s status, number of farmers onboarded, carbon credit creation, dApp usage (marketplace usage by volume) and DIDs of the farmers. The team show a deep understanding of the challenges by having experience in supply chain and blockchain development. All in all, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_2274", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2471, "q0": "Blockchain industry often faces criticism for not solving real world problems or contributing negatively to climate change. This proposal aims to address both problems. If the team succeeds there are at least two effects that can take place. On the one hand we might get positive media coverage which is a step to reframing the blockchain narrative with real world use cases and eco friendly tech. The other positive effect is that the DApp can attract new people to the blockchain. \n", "q0r": 5, "q1": "The team is equipped with the knowledge and network to pull of a project like this. The proposed timeframe and work seems reasonable. The budget breakdown looks realistic. \nThe metrics which the team provides look really promising which leads to the conclusion that it is highly likely that the team will succeed with the project.", "q1r": 5, "q2": "The data and information provided by the team is sufficient to audit the development and progress of the project. \nThe KPIs which the team chose are a good representation for success for the project and for the challenge. \n\nThe team says that they will keep the public informed while they develop the DApp but the exact strategy isn't lined out yet. This is the only point which could be improved but since it is minor and the rest looks flawless 5 stars.", "q2r": 5, "assessor": "z_assessor_2307", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 6241, "q0": "This proposal seeks funding for the development of an Android app+dapp to validate farmer activity. By validating the farmer’s ecologically sound activities the farmers will be able to have additional income and thus be incentivized to integrate ecologically sound practices. \nThe problem is very well explained, smallholder farmers are excluded from the compensation for carbon removal practices due to their size.\nThis being a proposal for the creation of a dapp, is obviously in line with the challenge.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposers foresee project specific risks and provide mitigation strategies for them.\nThe budget of the proposal is clearly explained with sufficient detail. The salaries are very reasonable and this makes a good impression.\nThe proposal is a cooperation between various organizations and individuals.\nAll organizations are presented with a short presentation and a link to the organization’s website where the team of this specific organization is presented and the individual parties are presented with their personal projects and links to linked in or other type of CVs.\nOver all the team is impressive, qualified and very well presented.\nSince the team has multiple proposals from previous and in the current fund the proposer makes a special note on how the time management and workload will be distributed.\nThis proposer has 4 proposals in fund 9 for a total ask of 282K.\nThis proposal is very similar to another proposal of the same proposer “Community validation Dapp” and in sync with the “Earthtrust decentralized validation” proposal. They all go hand in hand and are parts of the bigger picture solution of the carbon credit – farmer decentralized solution.\nThis proposal is continuation of a previously funded proposals 21st century agri supply chain:\nhttps://cardano.ideascale.com/c/idea/403695 \nand also NGO transparency: \nhttps://cardano.ideascale.com/c/idea/403633\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The team is committing to monthly reports of the progress of this project with a list of data points to be measured. The team also provides a clear and accessible channel of communication where the community could follow the progress.\nSuccess metrics are well defined.\nOver all this is one of the best auditability sections I have seen, the only thing missing are some hard numbers against which the auditor could easily compare the progress. Same as for the other two proposals in the same group.\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2795", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6717, "q0": "The carbon market is a notoriously dysfunctional market for a myriad of reasons: inability of governments to set and enforce the right incentives and punitive measures, the unlikely scenario in which world governments work together towards the standardization of national carbon markets, the difficulty in tracking carbon emissions / producers, high certification costs, and many more. \n\nI find it somewhat laudable that the value proposition of this proposal dives right into this tricky market niche, in the area of compensating small farmers for their carbon sequestration practices. However from a practical standpoint, it is unlikely that a privately developed solution can bring a dysfunctional market back to functioning levels, and no matter how  brilliant the solution and the implementation will be, the fact will remain that the ecosystem will simply not be right for such a solution to flourish, let alone one that increases the complexity level by proposing a blockchain solution. \n\nFor all the reasons above, and many more, I shall maintain neutral on the possible impact of this proposal at this point in time - so three stars only. ", "q0r": 3, "q1": "This project is a collaboration of various organizations: What if foods, the Pond Foundation, WADA and four individuals. It is not their only proposal in this round, but it is yet again, one in which the split of tasks between them is not clear, nor is the added value of each party to the table. \n\nFeatures of their product are very confusing and I will limit myself to ask a few targeted questions: \n\n- For the 25 Ghanian farmers onboard (target) why is it necessary to create and mint an NFT for each piece of land? Will it be sold at any point in time? Will the Ghanian government recognize that NFT as a right, and can it be transferable?\n- who actually will buy those carbon credits?\n- can the solution be scalable in other countries? Can it at least be scalable within the entire Ghana?\n- how big is the carbon market in Ghana? Is it liquid? Is it regulated?\n- What are the hourly rates charged for the proposal’s activities?\n\nThere are way too many questions than answers concerning this project, and it is not clear at all what their end game is. Three stars only. ", "q1r": 3, "q2": "A ray of light comes from the performance indicators defined better than in their other proposals: onboarding 25 Ghanian farmers + DID + document their land rights + NFT minting for land rights + wallet for each. But overall the auditability section is no different than the first two. We are offered a lengthy list of indicators to be tracked, from stakeholder engagement, to farmers created, farmers usage, etc. It’s hard to assess the auditability of “something” which is not clear at all, so three stars again for a very unclear proposal. ", "q2r": 3, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11654, "q0": "The problem described in this proposal is closely aligned with the the challenge which explains how it will make an impact to the community in the country and to Cardano ecosystem by creating Android app plus Dapps validate farmers activities, incentives farmers to implement biochem practice, remove carbon and earn an income on the Cardano ecosystem block chain.\n          The proposal team has done well by identifiaing the three large challenge stopping climate change that is; 1. Knowledge on what to stop climate change, 2. No financial feasibility because of certification industry,3. No decentralized solution to support the Chang . And is able to provide solution to them such as; distribution of knowledge on carbon, farmers use mobile apps for an NGOs team members etc should they be granted funds to execute their project.\n      The proposer also able to effectively addresses the precise challenge and it's potential of bringing values to communities through project Catalyst block chain in the Cardano ecosystem such as, increase number of CO2 sequencing, increase awereness and increase the number of people changing an environment demaging habit etc should they be funded to execute their project which I strongly believe they will do a great job if they are funded.\n         The proposer also capture some important key metrics measure under the compaign brief on how it will bring increasment and open up to Farmers in the communities in the catalyst block chain and to Cardano ecosystem should they be funded to execute their project.", "q0r": 5, "q1": "The proposer is able to provide relevant links and details of team members who will help in the execution of the project should they be granted funds to execute their project and I strongly believe per their experience and relevance links they have the Desired Skills and experience to carry out their project.\n          Moreover, the proposal team are able to outline the breakdown budget funds on how it will be used should they be funded to execute their project which I strongly believe that is COMMENDABLE.\n          The proposal team also able to provide details plan including timeline, key milestone and roadmap to deliver the project should they be funded to execute their project and I strongly believe they will do a great job should be approved funds to execute their project.\n      Lastly, they are also able to outline some risk challenge that could prevent them from executing their project and able to navigate solution to them should they be funded to execute their project. The proposal also be able to indicate the return to catalyst on a later round funded.", "q1r": 5, "q2": "The proposal team describe measure to track their progress is well aligned with the challenge, the key metrics, milestone and KPIs are all well outline that is, the first month; progress reports,team status, stakeholders engaged, future work on , product usage number like #NGO user, farmers created etc and the outcome of KPIs after project release such as 1. Onboard 25Ghanaia  farmers into the platform . 2 create unique DIDs for farmers and land etc should they be funded to execute their project.\n           Furthermore, the proposal team also give success for their project on how it will look like by ; Creating Android app for pond  foundation team members to support Ghana farmers to get digital identity , creating wallet, knowledge and support for earning on income from regeneration farming and carbon removal, market place for total number of users etc, Environment for CO2 sequestered etc should they be funded to execute their project.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1}, {"id": 14148, "q0": "This project is looking to use blockchain and the Cardano ecosystem to address a major issue where the majority of funds in carbon sequestering projects does not end up aiding the actual carbon offset project and certification (and continuous validation) is far too expensive for small-scale farmers to obtain and thus they are left out of the carbon offset market. Improving this system would benefit these farmers but also the global fight against climate change. The potential of this project is immense. The initial certification is achieved through the blockchain and its inherent transparency and is based on community validation. Continuous validation is achieved the same way. Some more information on how that works would be useful as there seems to be potential for some people to band together to fraudulently register a non-operational carbon offset program and some safeguards against fraud may be necessary.\n\nThe authors evidently have detailed knowledge of the problem and expertise from working in that field. They provide many links for supporting information to validate their claims about the state of the problem and why they think their solutions are promising. Also, the authors have already involved several stakeholders ranging from the farmers and communities they want to help, to international companies and NGOs. The number and varying levels of influence of the interested parties is encouraging because this project could have a positive impact on many tiers of the global agriculture system if well-implemented. This project is strongly tied to the Cardano ecosystem and is well-aligned with the challenge settings. While the authors acknowledge that there is risk in the scalability of the project as well as risk in its sustainability, the authors appear to have sensible plans in place to mitigate these risks and will have help from another stakeholder to achieve this. The project also involves team members who are locals (in Ghana) where the project is to take place which is also encouraging because that will help overcome language and cultural hurdles as well as ensure that the project actually takes the farmers’ needs into account properly.", "q0r": 5, "q1": "WhatIf Foods have committed to buying a number of carbon removal offsets from this program, but the authors do not specify how much or how that will be determined. This would be useful to know as the buy-in from companies will be very important for the success of this project. \nThe timetable with the goals they aim to achieve is detailed and spans over 5 months. However, some more information on how they plan to collaborate with the farmers in developing the app, specifically for the UX and UI will be useful to have as significant issues can arise if the app is not precisely targeted enough. It is not entirely clear who exactly will be using the app – will it be team members on the ground or will farmers be able to use it themselves? Will the app be in English, or will they employ a translator to make it accessible in the farmers’ home language? There was nothing in the budget specifically regarding this, but it could be under the “Wada” section (the local team) of the budget but clarification on how this will be achieved would be good to know. Also, this issue could present a significant issue for scalability in future as each region of farmers will need to be able to understand and use the app properly so other local teams need to be recruited for this and it will not be possible for team members to provide the necessary assistance if the project scales up. How will this be addressed in future?\nThe app is going to be designed for Android smartphones and while there is a lack of smartphones in the areas the app is designed to be used in, as smartphones become more accessible, the scalability of the project will improve. \nThe budget is detailed and includes both pay rates for team member but also other costs such as infrastructure. The project is building on a project that has already received funding from Fund8 and so has already accomplished WHAT and the team members have already received funds from Fund7 so they appear to be reliable.\nThe team members and their duties are all clearly delineated and a detailed breakdown of what they have achieved already and what they are planning is given. The team’s experience and expertise is impressive and the project as a whole seems to be well-planned out and has driven people behind it.\nThe project intends to continue applying for funding via Catalyst in future rounds as they have more ideas for different dapps that all focus on agriculture and conservation. Some mention of what these ideas are would be interesting, but not essential to this project.", "q1r": 4, "q2": "The team commits to transparency and monthly updates on widely available platforms such as Google Drive. Their KPIs that they will be reporting on are relevant and will provide a good estimation for observers to gauge how well the project is going. The authors also provide what their final objective KPIs are which is useful to see what exactly they hope to achieve. \nHow will longer term communication with farmers once the initial project is launched be carried out? \nAre there plans to collaborate with scientists and industry for monitoring of these areas to provide more quantitative data on the impact this project is having on carbon sequestering?", "q2r": 5, "assessor": "z_assessor_3925", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Android app+dapp to validate farmer activity, incentivize farmer to implement biochar practice, remove carbon and earn an income", "experience": "20+ years experience working with farmers in developing countries, supported by 10+ years of digital product development experience and 20+ years of entrepreneurial expertise. Supported by local teams in Ghana. Started the project in Ghana 9 months ago. "}