{"id": 421175, "author": "edvard", "title": "Earthtrust decentralized validation", "url": "https://cardano.ideascale.com/a/dtd/421175-48088", "category": 26595, "amount": 88000, "description": "No transparent, scalable and comparable way to understand the health of land which impact efficiency of areas such as supply chains, certification, micro finance, and nature conservation applications.", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 4578, "q0": "This proposal is for an incredibly ambitious project that could have wide-ranging ramifications for supply chains, carbon emissions, land degradation, and income inequality. It also identifies a major pain point in existing systems--namely the cost of compliance for carbon removal credits--and offers a potential blockchain-based solution. \n\nThe impact statements do a good job of setting the background table before zooming in on the two use cases that would be funded by this proposal, though I'd encourage the proposers to drive home to precise scope of the proposal just because this is such a big, sprawling issue with many moving parts. \n\nShould this project prove successful, it would likely greatly raise the profile of Cardano and push the boundaries of what the average person believes blockchain technology can be used for.", "q0r": 5, "q1": "This project is largely building upon existing work and projects, some of which are from previous Cataylst rounds. The proposal cites, in particular, the Fund 8 proposal \"NGO transparency,\" which sought to build an accountability tool that tracks the allocation and outcomes of NGO expenditures. Since NGO Transparency is a major part of the foundation upon which this proposal is being built, it would probably be helpful for voters to know the current status of that tool and how successful the project was, and to have that information easily accessible to voters.\n\nThe timetable for this project looks ambitious and seems largely dependent on how well pre-existing tools and technology can be leveraged, and how well the proposers can coordinate between all of the partner organizations they're teaming up with. Despite the many potential points of failure, the project's team looks very strong, combining decades of experience in NGO management, product development, agricultural science, and satellite tech, as well as familiarity with the Cardano blockchain and community, so I think there's reason to be optimistic. ", "q1r": 4, "q2": "The team's promise to make the satellite data they gather available should make auditing this project more fun than most. Confirming that the data that's made available is of high quality may take some expertise or at least familiarity with the subject on the part of auditors, but the Cardano community should be large and diverse enough to handle the task. \n\nAdditionally, the team has demonstrated an ability to put together effective reports and an interviews. KPIs will be made available through Google Drive, YouTube, and GitHub, so progress should be relatively easily to gauge.", "q2r": 5, "assessor": "z_assessor_2564", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6242, "q0": "This proposal seeks funding for the development of a system for documentation of land health through satellite monitoring and on ground validation. The system is anchored on blockchain and the model of financing the system is through companies that seek to purchase verified carbon credits.\nThe problem is stated clearly, land degradation is one of the greatest ecological challenges for the near future.\nIf successfully adopted this system will increase the number of transactions on the cardano blockchain.\nThis proposal aligns with the Dapps, Products & Integrations challenge goals and metrics.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "This proposal is very ambitious and will be encompassing a lot of fields of expertise. Luckily the proposer is acutely aware of that and has designed the project as cooperation between various organizations and individuals.\nAll organizations are presented with a short presentation and a link to the organization’s website where the team of this specific organization is presented and the individual parties are presented with their personal projects and links to linked in or other type of CVs.\nOver all the team is impressive, qualified and very well presented.\nThe proposer considers some project specific risks and provides ways for their mitigation.\nThe solution developed within this proposal will build upon the work already done by our team member Yosef Akhtman and his company Gamma Earth focusing on remote sensing. As well as the work done in the previously fund 8 funded proposal “NGO transparency” (https://cardano.ideascale.com/c/idea/403633).”\nThe idea is explained in detail and it is very understandable, at least I understand it with my background of organic farming and environmental solutions.\nThe plan for this project includes the development of a multitude of technical solutions and  documentation.\nThe plan is very detailed and if the voter needs more information, I advise him to read directly from the proposal.\nThe budget is clearly and in detail presented. The entirety of the budget is for salaries of different specialists. It is interesting to see that the lead positions are remunerated less than some tech positions.\nSince the team has multiple proposals from previous and in the current fund the proposer makes a special note on how the time management and workload will be distributed.\nThis proposer has 4 proposals in fund 9 for a total ask of 282K.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The team is committing to a monthly reports of the progress of this project with a list of data points to be measured. The team also provides a clear and accessible channel of communication where the community could follow the progress.\nSuccess metrics are well defined.\nOver all this is one of the best auditability sections I have seen, the only thing missing are some hard numbers against which the auditor could easily compare the progress.\nI agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2795", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10038, "q0": "The study of land condition, pollution and reduced soil quality is a problem that is affecting environmental pollution, destroying the atmosphere. The project has launched a Wed3 construction solution that features tracking, soil quality assessment, jobs are done on the Blockchain platform. The solution is in line with the challenges installed at F9, meeting the needs of environmental improvement. The transparent solution is the interest of plant protection organizations, clean food manufacturers such as WhatIF-Foods, whose authors have come up with links that prove this. What is the current state of the land? The author gave specific information, evidence on Wedsite shows that the quality of the soil is being sliced, we will lose 24 billion tons of fertile soil and 95% of the land area degraded by 2050. Huge amounts of land are lost, agricultural productivity decreases, food supplies decrease, product quality decreases, human health has many problems, climate change will affect the global economy. Preventing climate change is the implementation of major challenges, the author has appropriate research to come up with solutions to the problems. The project has specific information proving that land degradation, climate change needs to be quickly overcome. The use of satellite imagery, the use of AI to determine forest status, the collection of data on plants, temperature, cloud cover, spectroscopy, etc. The figures are written on the Cardano chain and shared, the figures prove that the donors, affecting them to renovate areas that are seriously affected, degraded land needs to be renovated. The project's solution has an impact on Cardano's development goals, helping developing countries have better agriculture. The image of the Cardano ecosystem is promoted, donors make positive moves for the ecosystem. The solution of the project has answered the appropriate purpose to solve the problems presented. The project has identified challenges to the implementation plan, the work needs to be done carefully with the appropriate monitoring mechanism that increases the accuracy of data from satellites, the work of recording data locally is specifically guided to bring the most accuracy to the project. The way to solve the problem is appropriate to do it. I have an opinion on the possible risks such as: the funding is not funded by Cardano, I want the author to have the right marketing and communication plan to have tremendous support from the community and donors.\nI rated: 5\n", "q0r": 5, "q1": "The project has a detailed and very specific plan, the work is defined: Wed interface, Satellite imaging technology, data collection application creation, compliance framework and write to the ledger. The predetermined work is in line with the important milestones of the plan. The performance milestones clearly show the work that will be carried out and completed in each month. Technical solutions, wed construction structures, applications such as: UX, ledger integration, satellite technology development, etc. are clearly explained, the method of logical implementation. After 4 months of implementation the product is delivered with the wed application and all the data is in accordance with the stated solution. The project, carried out by Yosef Akhtman, had full information and demonstrated competence when implementing a proposal at F8 with the theme \"NGO transparency\". In addition to the support of 3 team members, they have information about the ability to perform proof on LinkedIn. There is a clear assignment for each member for the fields of engineering, management, satellite technology, etc. The help of the Forest Conservation Fund, the Pond Foundation, and WADA is a factor in the successful implementation of the project. Recommended amount: $88,000 is only 1% of the cost of the F9 challenge. The budget analysis is full of expenditure contents, the amount of money spent on each job is appropriate, we determine the amount of money that is being used for the purpose of the project.\nI rated: 5\n", "q1r": 5, "q2": "The roadmap for the implementation of the project has important milestones and the time to achieve results. The author commits to carry out monthly progress reports with specific metrics including KPIs: Performance status of each member, sanitary technology, application construction process, UX/UI of wed, ledger integration data, number of NGO users, CO2 is isolated etc. The data and reports are also shared via Google Drive, Youtube, stored on GitHub. The KPI is appropriate to determine that the project is implementing in accordance with the schedule. The success indicators of the project are clearly described, easy to understand, the data collection process is completed, the amount of CO2 is isolated. Data from satellites and local people collected is public and transparent. Application, wed provides additional foundation for Cardano's environmental projects. The phase of expanding that application is the method of land reclamation, habitat, combating climate change. The proposal is a continuation of two projects in F8 and will be extended to F10. We are fully committed to the success of the project.\nI rate:5\n", "q2r": 5, "assessor": "z_assessor_3144", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10277, "q0": "Your proposal is to provide a tool to certify anybody who has had carbon removal activities. This is an interesting, global project aiming to bring greater benefits to countries that depend heavily on the agricultural sector, besides, it also helps protect forests and global ecosystems. The project has focused on 2 use cases and surely when successfully implemented, a significant area of ​​agricultural land and forest land worldwide will be improved and documented, and finally published on Cardano's Blockchain as a common knowledge base. The economic benefits of the solution over traditional methods are also considerable.\nThe project really raises public awareness of the Cardano Blockchain as it is geared towards an issue that is of concern to any individual, organization or country. Allowing and encouraging everyone to take action to protect the environment and fight climate change through a transparent system to monitor the state of the earth combining Blockchain technology with Remote Sensing and AI. The author has really create a practical product, bringing a very valuable product into the Cardano ecosystem. I support and wish you to be funded.", "q0r": 5, "q1": "You have built a roadmap and relationships with reputable organizations in related fields such as Forest Conservation Fund, The Pond Foundation and companies specialized in remote sensing, environmental, these are huge advantages during project implementation. I believe this combination is the perfect basis for the parties to support each other when dealing with issues in the detailed plan. I just wonder a bit that you are missing Cardano's Blockchain expert who i think will plays a very important role in the project.\nThe team has a member from Gamma Earth company specializing in the field of remote sensing, which is a huge advantage for project implementation. However, I want you to specify the origin of satelitle imagery, because as far as I know it takes a lot of money to get a good quality satellite image source, ensuring accurate information for the project.\nThe detailed budget breakdown is provided with focus items for 4 months corresponding to the proposed implementation phases, however, it will be easier and more convincing for the community when you detail the number date and number of hours.", "q1r": 4, "q2": "When the team commit to reporting on the project's progress through Google Drive, YouTube or Github tools, I believe the team is ready for the community to have enough information to audit the proposal. The KPIs are clearly presented corresponding to the work contents presented in the planned milestones. You have focused a lot on imagery satelilte processing, I think that is correct because it determines the outcome and feasibility of the proposal. Besides, the success of 2 use cases will be the basis for environmental protection on a more global scale.", "q2r": 5, "assessor": "z_assessor_3170", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14393, "q0": "This proposal is a wonderful example of a successful blockchain ecosystem combined with environmental and social value. The team wants to create a blochchain-based validation for land and forest valuation in Africa. It is positive to note that the team is already linked to various stakeholders and has been working in this field for a long time. The proposal is structured in a clear and understandable way. The problem (land degradation + high costs for certification) is clearly formulated. The impact for our ecosystem I also see as positive. On the one hand it strengthens Cardano's Africa activities, on the other hand it implements a sustainable idea on the Cardano blockchain. Overall, a very good proposal that is based on a very nice idea.\n", "q0r": 5, "q1": "For me, besides the idea, the team is always the most important thing in a proposal. Here the team is broadly positioned: on the one hand we find technical experts and on the other hand blockchain experts as well as representatives of the Catalyst community (Wada and Yoram). Wada supports many valuable projects in Africa and has already shown excellent work in professional support of proposals. The plan for implementation is basically clear. The only thing I feel is a bit missing is a more detailed description of the blockchain (wallet) implementation of the plan. From the described content, it is not quite clear to me how exactly it should work. The budget is fairly sized in my opinion.\n", "q1r": 4, "q2": "The team provides some guidance on how to follow the project. The metrics are useful for measuring the success of the project. I'm still missing some specific target numbers. The success for this project is well described with details and references and it is easily imagined and understandable. The SDG rating part is also more thorough than many other proposals as they analyze exhaustively from goals to subgoals and KPIs.\n", "q2r": 4, "assessor": "z_assessor_4026", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Satellite monitoring and on the ground validation to document the last 10 years of land health for farm & forrest land to provide verification of success of on the ground activities.", "experience": "20+ years experience with satellite remote sensing, ML and AI. 20+ years experience working with farmers in developing countries, and 10+ years of digital product development experience and 20+ years of entrepreneurial expertise. Supported by local teams in Ivory Coast and Ghana."}