{"id": 421294, "author": "otaviolima", "title": "Event CryptoHouse of Commons Brazil", "url": "https://cardano.ideascale.com/a/dtd/421294-48088", "category": 26595, "amount": 24905, "description": "Only a few Brazilian companies know Cardano as a main Blockchain. Difficulty in adopting Cardano (ADA) in the real business world. Brazilians bought almost $4.2 billion in crypto assets in 2021.", "f6_no_assessments": 7, "f6_rating": 4.000000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 2102, "q0": "According to the proponent, Cardano in Brazil is not widely known and only a few companies know about it, so it will be difficult to apply Cardano in the real world. The solution to this problem is to exhibit Cardano at the Crypto House of Commons event, which is the first crypto community focused on promoting the growth of the crypto market in Brazil, São Paulo. This event will focus on fostering discussion of cryptocurrencies, tokens, and blockchain to bring society closer to all the constant innovations in the crypto market in Brazil and all over the world. The idea of ​​the proposal is perfectly fine and it could introduce the Cardano ecosystem to more people, however, I don't think it fits what we are looking for in the challenge \" Dapps, Products & Integrations \" so it wouldn't be fair to give it a high score for impact. I think this suggestion will be more suitable for the Developer Ecosystem challenge and suitable for \"A sense of community and conversations. Having people around to talk with.\"", "q0r": 3, "q1": "With that said, this is an event proposal, this event will take place in 3 days (November 18-20, 2022) so the implementation plan revolves around organizing and The author has given a timeline of 4 weeks to carry out the preparations. Every week we know exactly what work is going to be done to make sure the event can be as successful as possible, so in terms of development, I am completely satisfied. Next comes the budget, the requested budget is $24,905, and all necessary expenses are listed, so we also have an exact vision of what is needed for the event, however, will be even better if each activity comes with a certain amount. For example, the \"3 Support Staff (3 days)\" expense allowance has been listed, but we need to know what their salaries are like for these 3 days to have a more accurate view of how they are divided. split the requested amount. Finally, about the team, the project team is very well presented, we know the names, training areas, interests, and LinkedIn profiles of the team members, creating a strong safety and reliability in their job. The feasibility of the proposal will completely convince me if they provide some information about the content of the event, for example, what topics will be discussed, and what their advertising campaigns are?", "q1r": 4, "q2": "The auditability of the project is very well presented, the community can track the progress of the proposal as a monthly news release on the Cardano Feed, and several KPIs are provided for easy review. easily audited as:\n-Number of Cardano explained live to entrepreneurs: 800 people for the live event\n-Lecture for conference participants: 1,200\n-Twitter followers: 3,000+\n-Participants of the prize: 10\nIn the success of the project, the team identified four successes. Each success is very clearly described as stated in the proposal and has specific results to be achieved.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3478, "q0": "This proposal is about bringing Cardano presence to a crypto event to be held in São Paulo (Brazil). This indeed has much value as can certainly integrate Cardano to other blockchain network and show its potential to those who dont know it yet, specially considering the potential of Brazil, a very populated developing country where hundres of crypto traders are emerging everyday. This also alignes with challenge as it can be intepreted as an integration, that might bring new developers and possibly daps in the future, even if in a indireect way.\nIn regard to the proposal, Proposer does a good job on explaining about the event itself but it could bring more information of what Cardano content exactly will be brought by them to this event. It just mentions that lectures and presentations will be carried out but it would be interesting to know exacly what topics they will talk about and what approach will be adopted. As suggestions, it could be presented real use cases/project already developed, real interactive activities leveraging the Daps/hardwares already developed and so on. \nAll in all, the idea is nice but proposal could ellaborate more on the content itself, both to help assessing its impact and to collect early feedbacks. My rate is therefore 4.", "q0r": 4, "q1": "There's a sensible time-framed plan in place, where the main activities are clearly stated. I liked they included the supporting tasks (such as Buy airline tickets and contract the event).\n\nAs for the budget, I understood the sponsorship plan provided by the event will cover all the mentioned costs, so it wouldnt make sense to break it down.\n\nAs for the team, there are 3 people already committed with a lot of experience in Cardano that actively participate in several Cardano agendas and seem to have experience in such events. A good description is provided wit links to serve as reference.\n\nAll in all, project seems feasible. my rate is 5.", "q1r": 5, "q2": "There are good milestones plan and they will be communicate in their channel (Cardano channel), which makes it easier for everyone to track progress. Also, several good kpis are proposed and they all have pre-defined goals, that will help to assess if everything went as expected. I liked they already considered a sort of conversion rate, that will be measure by the number of Wallets donwloaded.\nMy only suggestion here would be to make a proper regular follow up wit attendes later on to check how their experience in Cardano is going and whether they need som guidance to better engage in ecosystem and Catalyst. \nIn a summary, elements provided to audit the project are good and will certainly help to verify success. My rate is 5", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3551, "q0": "The proposers plan to represent and exhibit cardano and it's ecosystem at the House Of Commons event in brazil. I think this is an importan proposal, as a lot of the other proposals mainly in the development ecosystem struggle to market their solutions. This problem will be somewhat fixed if cardano was more commonly known and a lot of efforts have to be put in that direction. I'm happy to see a proposal that tries to rase awareness and point out the facts like 800+ projects registered and much much more building on cardano already and expanding the ecosystem.\nThe proposal will surely add value to the cardano ecosystem just through representing cardano at the house of commons. It's true the project maybe not ideal for this challenge, but considering the other categories, it fits well enough here as well. I also like the targeted event is global considering the many languages that are going to be used / translated to including english, spanish, french and german, which is quite the diversity.\nI really like the idea of a company that deals with bringing companies and people together with 12 years of experience represent cardano, because this is a lot of experience for something really particular and I'm a big proponent of specialized labor.\nOverall this is an impactfull idea and I do hope it gets implemented.\n", "q0r": 5, "q1": "The milestones are given segregated by weeks and week 1 and 2 are a setup weeks that's normal for any conferance for the preparation to be longer or atleast as long as the event itself. Preparing to give a lecture is no small task as I do have some experience in that respect and preparation is really important. One shot, one opportunity and all that. Considering the milestones, they do seem reasonable and well timed so I don't have any complaints there.\nThe budget breakdown could have ben done a lot better and there are two reasons why I say that.\n1. There is a specific price 24905 - that implies some calculations.\n2. There's a really good breakdown of tasks that shows that most likely those tasks were used for the aforementioned calculation.\nConsidering those two arguments, I really think they could have presented their actual calculation used for comming up with that requested budget number. That's a a bit of an issue for me as an assesor because now I can't compare their budget to other proposals and recommended budgets and hourly rates. This is a bit of a hit and miss for me, but keep in mind the budget requested is a really small piece compared to the whole challenge available funds and I do still believe this is an important proposal to have up and running. My suggestion to the proposers would be to be as transparent and possible for their next proposals and show the calculations they made and would recommend breaking down the tasks in hours and then providing their hourly rates. This makes comparing the hourly rate to other proposals more easy therefore enabling easier recomendation by proposers and another thing would be easier estimation of wheather the time aloted for each task is reasonable.\nI was able to check out and verify the listed team members and their skills and credentials so it all checks out and I can say with confidence that these people would be able to deliver what's said in the proposal.\nIn summary this is a feasible proposal, even with the few caveats mentioned. I wish good luck to the proposers.\n", "q1r": 4, "q2": "The metrics for this proposal seem reasonable and I really like the participation in the conferance, because iot shows there will be quite a lot of people and although I haven't heard of this conferance (considering I do live on the other side of the planet) the numbers speak for themselves. I really did find the KPIs to be a bit vague, and I was hoping for some actual numbers instead of just a statement like \"increase the number of attendies\" because that could mean increase by 1 or 1000 and there's a significant difference. On that front I'd advise the proposers to have actual measurable goals. There will be emails and telegram channels so I'm not worried about auditability.\nIn summary the proposal has an importan problem to solve and the offered solution seems like a good place to start - marketing cardano to people.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4942, "q0": "The campaign brief of this challenge is about creating new dapps, products and services for the community to use and enrich the ecosystem. Unfortunately the problem statement and solution of the proposal does not match with the requirements. Creating a booth at an event with the aim to promote existing product and services in Cardano does not grow and enrich the ecosystem. There are no categories that fits this proposal for this current funding. Therefore, this proposal does addresses the challenge. ", "q0r": 1, "q1": "The team consists of journalists and mostly members with media background which are skilled to promote Cardano and successfully implement the proposal. The proposer notes that they have the required manpower to distribute the workload among their collaborators and they are ready to hire technical professional in order to accept new project. However it is not stated what type of technical professional that is needed. On your next attempt in submitting your proposal, be a little more specific on who do you need to hire. If a technical professional is needed, explain the detail for example, a plutus developer or js devs, graphic designer etc is needed to be assign on a specific tasks. \nOn the budget section, the proposer did not allocate the budget for each section of the budget breakdown. For example, it is stated that in the subsidy section, the proposer needs to pay for hiring 3 support staff, meal, transportation and hiring keynote speaker. How much does it cost for this section alone? On your next proposal, provide each cost breakdown for every section of your budget so that it will be easier to assess. Without the budget breakdown, it is hard to know whether the requested budget is reasonable or not. \nThe timeline given are well written which describes the progress of their work in a weekly basis. The plan provided are also acceptable and straight forward. From making deals with the event organizer and caterer right up until the commencement of the event day. \nOn the risk and challenges section, the proposer fails to provide any relevant information regarding it. The proposer should state the risk in implementing the project such as, in an unforeseeable circumstances of another covid outbreak, the proposer will mitigate the risk by engaging the attendee with online showcase or postpone the event to another date etc.\nWith the information provided, I neither agree nor disagree that this proposal will be successfully implemented.", "q1r": 3, "q2": "The proposer provided a roadmap of executing the event with milestones for achievement. The KPI presented are related to the event they are organizing which is the number of people they will engage, number of participant mailing lists etc. \nHowever, the proposer did not provide any information on where the community can keep track of the progress of their work. On your next proposal, provide a link or channel for the community receive updates of the progress of the project. With the information provided, I neither agree nor disagree that the information provided is sufficient to be audited.", "q2r": 3, "assessor": "z_assessor_2642", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "We believe that the advisor made a mistake with the grade 1, as we obtained an average grade of 4 from all the other 10 advisors. In the other grades, we received 3 from this advisor, far from the average of the other advisors. We put all the detailed costs and leave a channel for monitoring, reports and deliverables. We request reassessment of these scores."}, {"id": 7566, "q0": "The idea of bringing Cardano (ADA) into the real world of business is a must in this challenge. In fact, only a few companies know Cardano as a Blockchain, the problem is clearly defined. Well defined solution they will be exhibiting Cardano at the Crypto House of Commons event which is the first crypto community focused on promoting the growth of the crypto market in Brazil. This solution can solve the problem of the challenge. I think the project progress is appropriate it includes the capacity needed for the stated goals, the author has also clearly defined the short term and long term goals.", "q0r": 5, "q1": "The implementation roadmap of this project is 4 months, and the author lists in detail what needs to be done clearly and specifically. The author also aims to achieve them within a certain amount of time. The progress of the project is also easily trackable through the web links that the author has listed. The success is clearly described by the author as the results achieved: increase the number of people attending Charles' talk by making announcements, increase the Brazilian community in the Telegram group, receive recruitment inquiries Cardano, SPO transaction and ADA purchase, event executed successfully, achieving target values ​​defined in KPI. This success is linked first to the challenge of the campaigns. The mission of this proposal is to simplify the world of Cryptoassets for B2B and B2C. The solution to the problem is fueling the crypto, token, and blockchain debate. It is the ideal place for those who seek knowledge and every trend related to the market. Track developments in the crypto market and help companies discover new ways to invest. Contribute to the creation of an open, transparent and democratic dialogue between investors and the authorities. This solution could solve the present challenge of the proposal.", "q1r": 5, "q2": "KPIs are clearly defined, the proposed future implementation plan is very detailed and complete. Performance metrics are complete and unambiguous.\nAuthors will provide the community with some kind of progress report as they go along, in the form of a monthly news release on the Cardano Feed, to measure the progress of their proposal.\nThe author will also provide a board to be disseminated in the Cardano Feed, with the development of the project according to the Catalyst KPIs.\nCardano numbers explained live to entrepreneurs: 800 people for the live event\nLecture for conference participants: 1,200\nTwitter followers: 3,000+\nPrize participants: 10\nDownload Wallet: 1,000\nEmail and cell phone capture: 800\nGifts for participants: 10\nNumber of tweets with hashtags: 5,000\nWith the above indicators show that this is a good project with adequate performance evaluation and measurement indicators. Team: a journalist, crypto content editor, presenter, marketer, designer and social media. The team consists of 3 main members working on this project the author seems very experienced and has a strong background: Otávio Lima is Founder & CEO at Cardano Feed, Gino Matos is a cryptocurrency journalist Writer & content editor, Lucas Fernandes is a marketing assistant. The author also highlights what each member of the team has done, they talk about their previous experiences. They also link attached network links so we can easily follow their projects easily. The funding applied for this proposal is $24,905 less than 20% of the entire challenge budget. Crypto House of Commons created a funding plan for these goals that covers five things: Crypto House of Commons sponsors, grants, agencies, marketing, giveaways, and prizes. The author also details the to-dos for those spending items, and it aligns with the current challenge. The budget is explained deeply and logically in this expenditure.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8989, "q0": "The sole idea of the proposal is decent. To have a stand at a crypto event in Brazil and talk about the benefits of Cardano. However, the proposal is not true to the challenge. This proposal does not bring any new dapps or products to the Cardano network itself. On the other hand, it can enhance integration with the network. The proposers have identified the problem that only a few Brazilian companies know about Cardano as a main blockchain. If the proposers are successful at marketing Cardano at the crypto event in Brazil, maybe this in the long run can bring new products or dapps to the network. But this would be hard to know and is at this stage only speculative. \n", "q0r": 2, "q1": "The team that is provided in the proposal seems solid and well suited to implement the proposal successfully. Mr. Lima is well qualified and should be an excellent ambassadeur for the Cardano network at the crypto event. The timeline is solid, but it is only presented in a timeline of 1-4 weeks. The final budget is being finalized in week 2 and the event is being carried out in week 3. It could be a problem if the event stand isn't delivered on time. The proposers should take this in account. Also the fact that Covid-19 is increasing in the world could have a problem, this should be taken into account when calculating risk and challenges. \n\nThe budget is well prepared and divided into categories, however it is lacking in presenting the total cost of each different category. There is only the demanded funding presented. I would have liked to see a budget that is more specific into all the costs of the proposal in order to analyze the budget more critically. Now, there is no way of knowing that the demanded fund is too much or less. \n\n", "q1r": 3, "q2": "The metrics presented are sufficient to measure the success of the project. However , as it can be measured how many people are present at a presentation. It can be harder to measure the breakthrough and how much this proposal actually benefits the Cardano network. The proposers could, for example, hand out tasks for people to solve at the Cardano network. Then the people would report back an implemented task to the proposer and maybe get a reward in the form of ADA or merch. This way, it would be easier to measure the proposals successful impact on the Cardano network. \nThe proposers mention that they will give the community some sorts of progress reports along the way in the form of monthly news releases, which is good. \n", "q2r": 4, "assessor": "z_assessor_3013", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9065, "q0": "This proposal seeks to send three people to the Brazilian CryptoHouse of Commons event.  While this would be  a very positive and impactful opportunity to grow the influence of cardano in Brazil, unfortunately this falls outside the scope of this challenge.  If there had been a challenge directed at Outreach this could have earned a full five star assessment. However in the category that it is in where the focus is on building and growing dApps,  this proposal falls out of place.  One of the great  elements of this proposal is how well detailed it is especially in the area of impact. I do believe that if brought back to a future fund with an Outreach challenge this should be a slam dunk. The team has a solid concept of how they will build and connect with the community at this event. They have done their homework to determine how many people and how many opportunities they will have there. This is a solid plan. However because it does not really fit in this challenge I have to give it a score of 3.", "q0r": 3, "q1": " This proposal is entirely feasible. The team who put this together have done their research and homework regarding this event. They have determined how long it will take to  do the paperwork and get a sponsorship for the event. They have put together the funding request appropriately. They know exactly what the spend will be and what it will be spent on. They know the costs of even renting  presentation displays for the event. The time frame is well-designed and the team who is investing in this are well experienced and would complete this project successfully without issues. This is an ideal proposal and deserves a full feasibility score of 5.\n", "q1r": 5, "q2": " This proposal is incredibly clear with a very auditable goal. The team plans to make regular progress reports and they included that in their proposal. They plan to measure  Twitter followers and new wallet sign ups. They evcen have a plan to meet with up to 800 new business people at this event. This team has done a great job of putting together this proposal, and I have no questions about it. I believe this could be fully feasible and completely auditable and it would have a great impact on growing the Cardinal Community.", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We will exhibit Cardano at Crypto House of Commons event - The First Crypto Community Focused on Accelering the Growth of the crypto market in Brazil, São Paulo - November, 18th-20th 2022 (3 days).", "experience": "The team: a journalist, cryptocurrency content editor, presenter, marketing, designer and social media. Conceived and produced by the CardanoFeed team, the largest media specialized in Cardano coverage. We already have over 800+ projects registered in the Cardano ecosystem."}