{"id": 421345, "author": "ceviteam", "title": "Learn to Earn Cardano Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/421345-48088", "category": 26595, "amount": 28650, "description": "Lack of places to collect & update information and knowledge about the Cardano ecosystem on a regular, complete, accurate basis for the community of developers and investors who do not speak English.", "f6_no_assessments": 8, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 2619, "q0": "In the community of investors and developers who do not speak English, finding information and knowledge about the Cardano ecosystem isn't easy. To solve the above problem, this proposal was born to build an information platform based on Discord called CEVI, with a core group of members initially being software developers, project managers, and translators... have in-depth knowledge of the Cardano blockchain. In the beginning, the core team will fill the learning platform to monetize the Cardano ecosystem with information, documentation, and knowledge about Cardano, the Catalyst fund. The platform attracts new members, educating them with the above in-depth knowledge. After a while, the members all understand the Cardano ecosystem. In addition, they also built an English club, attracting members with good foreign language skills to support developers to develop dApps on the Cardano blockchain and support Proposers and PAs to participate in Catalyst. Members will earn additional bonuses by using their knowledge and enthusiasm to contribute content to the platform. To have a high income, members need to continuously learn to improve their knowledge and contribute that knowledge to the foundation to serve the community. The learning, sharing, and monetization loop will create a community with in-depth knowledge and insight into the Cardano ecosystem. In addition, this proposal can expand service and attract users from many markets with translated content. From the way of developing and engaging the community above, I consider this proposal to have a strong impact on the development of the Cardano ecosystem.", "q0r": 5, "q1": "The proponent has built a Discord channel with many active members discussing and sharing the latest knowledge and news about Cardano daily. This proposal is aimed at helping members earn rewards based on contributing quality content to the platform and educating members on how to monetize the Cardano ecosystem. Currently, this Discord channel is in phase 1 of the proposal. This is the stage where the channel collects, synthesizes, and regularly updates information and knowledge about projects in the Cardano ecosystem. Along with that, training on blockchain knowledge and Cardano's programming knowledge in Plutus language for a set of members is also being worked on. The core members of the team that built this proposal have completed KYC and publicized the information in their Discord channel, each with expertise relevant to the assignment. Some members of the proposed team have been members or project owners funded in previous funds, which proves that they have the practical experience to contribute to the completion of this project. Therefore, I appreciate the team capacity of this proposal. This proposal applies for a fund of $28650, divided into 3 phases in 9 months; the budget of each stage is also divided by each job, which is completely reasonable. Each stage has a different workload and importance, so phase 1 has a budget of $ 12850, accounting for the highest proportion, and is broken down into the parts of building the initial foundation, Bot, knowledge training, Article synthesis, marketing helps the manager of the proposed group to determine the budget to achieve the set goal. Similarly, the budgets for phase 2 and phase 3 are also broken down for each item, and this will help determine with the requested budget and nine months of construction time, this proposal will be successful. As stated by the target. When the proposal is completed and put into stable operation with two Vietnamese and Japanese-speaking communities. The proposal team also has a plan to grow, bringing the platform to many other non-English speaking communities, so it is normal for this proposal to appear in Catalyst in subsequent funding rounds; this is a plan well built. However, the proposal is excellent, and there are still certain risks; the proponent has also identified three risks and solutions. I see this as a plus for foresight for this proposal to be completed.", "q1r": 5, "q2": "This proposal provides a 9-month roadmap for completion, which is a feasible goal with the existing staff. The proponent also has a plan for each month, each phase with the number of jobs and KPIs giving specific numbers, based on which the community can track the progress and which stage of the project has been completed. Completed in the most intuitive way. The KPI measuring the success of this proposal upon completion is also specific numbers such as 60 documents in Vietnamese, 60 documents in English, 60 documents in Japanese about the Cardano ecosystem, and more than 500 newcomers to the CEVI community… above are the stats that anyone can check live on CEVI's Discord channel: https://discord.gg/SBaz2kUe. I believe that with a clear development roadmap and verifiable KPIs, this proposal will achieve its goals.", "q2r": 5, "assessor": "z_assessor_2324", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6044, "q0": "The idea of ​​the proposal is quite innovative, and is also necessary for increasing awareness of blockchain knowledge as well as the development of the Cardano ecosystem. The idea here is to build a win-win model around providing value to students when participating in online learning on the platform. Students when they register to study and then contribute to the platform with quality articles or contribute translations to the content of the articles. When completing the above tasks, students will receive a number of bonus points, which will be used to upgrade members or buy higher courses. Overall, this is a model that benefits both sides: developers and students. The platform will help the knowledge exchange to take place regularly and contribute to adding value to Cardano. Attract more new users to the platform.", "q0r": 5, "q1": "The proposer provides us with an implementation roadmap with full information and at what timelines. Regarding budget breakdown, I think that's quite reasonable. For example, at the cost of translation, 0.02 USD/word is reasonable. The training cost is 200 USD/session, but I would like to suggest that you can be more specific about the number of hours for a session. Regarding the challenges and risks involved in the project implementation, the proposer also clearly indicated the problems that will be encountered and prepared measures to respond. As a member of the implementation team, I have full confidence in the team's experience because most of them have in-depth knowledge of blockchain from 5 years or more, and also have relevant experiences in community management and marketing.", "q1r": 5, "q2": "Here I think the audit aspect of the project is ok but there are a few points I would like to add to make it as complete as possible. The first aspect of information verification, I suggest that the proposer should more specific examples of individual members' profiles (such as Facebook, Linkedin, Telegram) The purpose is to increase the credibility and transparency of the project. Second, it can be quantified Numbers to measure the success of the project such as:\n- Acquired 10 developers and investors with knowledge of the Cardano blockchain (for example)\n- Library resources contributed from students reaching about #50 articles, translations (# can be replaced with another number)\n- #referrals from former students\n", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7800, "q0": "The proposal provides a platform for the community to learn from Cardano and make money from it. This is an interesting idea, offering a unique product that is very beneficial for the Cardano ecosystem and solves the problem of Challenge Dapps, Products & Integrations. The proposal addresses the problem of the lack of places to gather information about Cardano, especially for those who are not fluent in the English language. They have come up with a relatively convincing solution that is to create a platform to share information, everyone joins it to learn and make money together. The operating mechanism of the platform has been given clearly and with great enthusiasm. This is a good product, pushing users to learn more deeply about the Cardano ecosystem, and helping Cardano products reach wider and deeper to users. The scale of the impact of this project is huge, not only on the current user community and projects on the Cardano platform, but also helps to attract new people to Cardano.", "q0r": 5, "q1": "The project has established a full personnel apparatus, including those who are capable and experienced in implementation. I watched the project's discord channel, it's really impressive. The project has come a long way by building many high-quality channels, especially channels related to learning and sharing information. In terms of communication, the project has built a few relatively reputable channels to attract the community such as Facebook and Youtube. The project asks for a fund of nearly 30,000 USD, an amount of money in my opinion is enough for you to continue to develop the project successfully. All expenses of the project are explained clearly and reasonably. The proposal also anticipated some risks and put in place appropriate mitigation measures. I highly appreciate the enthusiasm and professionalism of the team when making this proposal and fully trust them to successfully implement it.\n", "q1r": 5, "q2": "The project has given a specific plan, implemented through 3 phases with specific and reasonable timelines. The information to verify the development of the project is relatively clear and easy to check. The community can directly see the results achieved by the project by visiting their Discord channel. The KPIs to measure the success of the project are also easy to measure, easy to check such as the number of documents in English & Japanese, the number of new members… The project has also clearly defined the goal of success, I believe they will develop according to what they have set out.", "q2r": 5, "assessor": "z_assessor_2922", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10768, "q0": "This project is useful for non speaking English community, helps candidate easy to study all about Cardano Blockchain system such as Cardano Ecosystem, Cardano Knowledge....This project also helps to spread knowledge about cardano more widely in the community. I strongly believe that this project will help the cardano community grow and provide a lot of useful information to the community.", "q0r": 5, "q1": "Staffs: Obviously, have the right experience to do engineering and community systems. However, the marketing & security team are not describe. \nThe proposer need to provides evidence of relevant skills and experience needed to implement this proposal (references, linkedin, CV, etc..)\nThe proposer team needs to describe more about the process of developing the team, building successors, training and continuing to operate the project.\nThe proposer needs to specify more security operating points for the admin account on the social network platform.", "q1r": 5, "q2": "The proposer has a clear, specific plan and sets clear timelines and goals in each stage of development.\nAccess information by directly participating in the Telegram channel, but it is important to expand on social networking platforms and build forums to increase interaction between members.\nThe KPIs to measure the development of the project such as number of users, quantitative messages, bot frequency of use are reasonable, easy to check and evaluate objectively. It is necessary to create report forms with diagrams and images to increase visualization and evaluate search trends and user behavior.\nThe development costs are suitable for each stage, the expenses are explained clearly, transparently and in accordance with the development roadmap of the project. However, it is still necessary to pay attention to the provision for precaution, which is expected to be about 10% of the total mobilized capital.\nThis is a highly feasible project, spreading the understanding and knowledge of the Cardano ecosystem to a wide audience, especially those who do not speak English. This is a reasonable project to invest and build.", "q2r": 5, "assessor": "z_assessor_3192", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 11657, "q0": "The proposal team has done a great job by glancing into the challenge and placing it in its right challenge which indicates how the proposal will bring benefits to the communities in Africa country and to Cardano ecosystem by creating platform to provide documents, information, knowledge about the Cardano ecosystem and Cardano, knowledge,multilanguaga at a reasonable cost by win win collaboration of the community.\n        The team has also done well by effectively addresses the precise challenge and it's potential of bringing values to Cardano ecosystem by creating a community with in depth knowledge and deep understanding of the Cardano ecosystem thereby increasing the number of developer's and investor in project on Cardano block chain, through language clubs attract human with good foreign language skills to support developer , Proposer,PA voters in Cardano catalyst development activities etc should they be funded to execute their project which I strongly believe they will do a great job should they be funded to execute their project.\n     The proposal team is able to capture some key metrics measure under the compaign brief on how it will bring increasment and benefits by creating blockchain user,PAs and voter's should be approved funds to execute their plans and I strongly believe it's COMMENDABLE.", "q0r": 5, "q1": "The proposer is able to provide details plan including timeline of 9month which divided into 3 three phase and key milestones of creating a mechanism to accumulate bonus point, set up of payment features record achievement with bonus points in the first month,set up the learn to Earn mechanism, create video and document to guide members using the learn to Earn mechanism etc in the second month, promote marketing to attract the community, planning for improvement etc in the third Month and the KPIs which is well explains how it will bring values to communities in Cardano ecosystem should they be funded to execute their project.\n        However, the proposal team is able to provide details budget breakdown funds to how it will be used should they be funded to adopt their project and I strongly believe they will do a marvelous job if they are granted funds.\n       Furthermore, the proposal team is able to provide relevant links and details of team members who will help in the execution of the project and I strongly believe they have the Desired skills and experience to carry out the project should they be funded to execute their project.\n      Moreover, the team is able to outline some risk challenge that could prevent them from executing their project, but able to mitigate solution to overcome them should they be granted funds to execute their project. They are able to indicate the returns to catalyst for future funds to support in the next stage of the project development.", "q1r": 5, "q2": "The proposal describe measure to track their project progress by report progress every month in the official catalyst channels and with key metrics such as;  60 Cardano ecosystem documents in English, 60 documents about Cardano ecosystem in  Vietnamese etc should they be funded to execute their project.\n       Furthermore, the proposal team is able to indicate how their success for the project will look like, increasing the number of developer's and investor with indepth Cardano block chain knowledge creating multilanguaga resource, create the learn earn Cardano ecosystem platform, increase income and knowledge for those who want etc should they be funded to execute their project and I strongly per the KPIs, key milestones roadmap and key metrics they will do a marvelous job if they are approved funds to execute their project.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12892, "q0": "With the Learn to earn mechanism, the community that is participating in CEVI (an application that you developed to introduce Cardano, Catalyst to the community) has the opportunity to increase their income from activities such as translation, contributing content to CEVI, participating in Airdrop projects, etc. through the utilization of the information that CEVI makes available. To be able to earn additional income from CEVI, participants need to learn and have good knowledge about the Cardano ecosystem, and they need to be able to reach the highest level possible in CEVI, which is level 5, in order to be eligible for the special incentives that CEVI offers to those who have reached level 5. This is truly a project because you have the answers to the problems that need to be solved in order to establish a location for the community in which people can gain additional knowledge while also earning supplemental income. face the challenge that has been posed. From that vantage point, it will be possible for CEVI's translation activities to entice a sizable number of users hailing from different language communities.\n\nYou identify three primary dangers associated with your proposition, and the countermeasures you suggest are both comprehensive and compelling. I have no problem with the way you deal with those potential dangers. Therefore, I give this effect a score of 5 points.", "q0r": 5, "q1": "You have demonstrated to the community how to construct a project, how to make a good project, by laying out the construction roadmap for the project within 9 months and requiring it to go through 3 distinct phases after it has been funded. It is specific to each month, and within each month of each stage, there are specific jobs that need to be completed as well as results that are expected to be achievable. Personally, I think it is very detailed, and I am able to see the path that needs to be taken very clearly.\n\nYou have also mentioned that there are very small costs associated with each phase of the project, which demonstrates both transparency and clarity regarding how to manage cash flow. The cost of the project is also clearly divided into stages. yours I find this to be a strong team of people with experience in community development, Translator, Coder, and long experience in the market as well as Blockchain Cardano.... shows that your ability is fully capable of successfully building this project. Your team consists of 10 people, each with specific jobs and links to each person's personal pages. I give this feasibility a score of 5 points.", "q1r": 5, "q2": "The key performance indicators (KPIs) that you provide are quantifiable and fully capable of being successfully implemented; in fact, your team may even be able to surpass the target through those numbers given its current level and capacity. You have stated it in a way that shows that the project's roadmap as well as the development of the project have been made public by you on the project's channels and forums. This is something that is essential for any project. complete We can see, based on the data and information that the team shares with the community that is responsible for monitoring and supervision, that if the project is successful, it will provide us with human resources that have the ability and the knowledge to communicate in a foreign language. In order to support the development activities taking place within the Cardano ecosystem, we are looking for knowledgeable professionals, developers, and investors. The auditability section receives a score of five points from me.", "q2r": 5, "assessor": "z_assessor_3497", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14020, "q0": "This proposal aims to build a platform that people can share information, knowledge or earn knowledge from separate channels from this proposal. The given description demonstrated that there would be 3 phases and each phase play its primary role. The proposer also explained about the cost for creating a platform based on the Win-win collaboration of the community. Thereby providing knowledge value for the participants. Each course will correspond to a specific amount of bonus points and after finishing all the assigned tasks, participants will receive these corresponding rewards (the bonus point) and then they can decide whether to upgrade the level of membership or the advanced course. In the description of the course mechanism, each participant will have different rights and benefits that are included in their levels as being divided before (there are 5 levels totally). The participants are encouraged by being offered more rights and privileges if they can gain a higher level. Moreover, this platform also encourages the interaction and development for both developers and participants so that will diversify the ecosystem of Cardano and bring more novel value about knowledge, data, etc. to the community of Cardano. ", "q0r": 5, "q1": "The proposer has described in-depth each phase of the plan and there would be 9 months total. I have compliments on this part when the proposer has estimated the KPIs monthly and also pointed in detail about the probability of potential risks while conducting the process and absolutely provided the solutions for them. On the other hand, the budgeted plan has shocked me since it is the most elaborate description I have ever seen. The given plan has indicated how to come up with the amount of costs for each phase and also the total number for the whole expenditures that are included in each part of the cost. Moreover, I think those mentioned costs here are quite reasonable and acceptable such as the translation cost that counts per word is only $0.02 so it means for 1000 words there will be only $20. In other words, there would be about 1.5 pages translated with the cost around 20$, and obviously, it is not an expensive amount. On the other hand, I am quite impressed by the experience of each member in the team. By the way, the ability of this team is appreciated by my recognition as they are experts in each divided team. For example, members in project management with experience working on blockchain, or the managing programming team who are expert in using programming languages like C/C++, JavaScript, and crypto. Also, they have an English translation team who are experts in the English language as well and Mr. Lam Nguyen used to be community advisor since Catalyst Fund 8. Furthermore, the Japanese translation team is also mentioned here with such a tremendous profile. The information provided is really impressive.  However, it would be more perfect if we have the attached profile link like Telegram, twitter, or Linkedin maybe as the attached link with their profile will increase the reliability and the confirmation about the teammates’ identification. People in Cardano can recognize who they are voting for and what ability of the members who are responsible for the proposal. ", "q1r": 5, "q2": "In the auditability, we will receive a monthly report by this team via the official Catalyst channels in which records the proposal’s achievement and provides visible data to make a comparison whether the proposal is successful or failed. The project success will be measured based on a given targeted number that is described in the project success metrics. For example, 70% of users participating in the survey are satisfied with the platform or 60 Cardano Ecosystem documents in each language (Vietnamese, English, and Japanese). This is not a large number for a 9-month duration, so I appreciate the successful proportion of the proposal and expect to see their later products especially after 9 months. Moreover, I hope to see a visualized number about measuring the attractive level of the proposal, like how many new users or new developers are attracted to Cardano by this proposal’s offered course. It would be more persuasive for the benefit that the proposal will contribute to the growth of the Cardano community. ", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14093, "q0": "Their Discord platform has been around for a while and has brought a lot of value to the community. Their platform management team worked hard but received no compensation. The fact that they introduced the Learn to Earn mechanism makes a lot of sense.\nFor the staff, it brings income to them, so they can work more actively. That is necessary to maintain the Group's sustainable and stable development.\nFor the cardano ecosystem: It attracts the language community to the Cardano platform. People with good foreign languages will quickly learn and better promote the platform. The \"Learn to Earn\" mechanism also helps the community have a stronger motivation in self-learning to improve knowledge, thereby improving the quality of the community.\n", "q0r": 5, "q1": "The proposed solution is not too complicated, but they have presented it in great detail at each stage. With each stage the work is broken down logically, it can be done. Phase one is currently underway. The discord channel works very well. There is a lot of information to be shared. They regularly and promptly update the latest information from projects on the Cardano ecosystem. There is a lot of interaction on the channel. The channel also has rich content with various categories. With the enthusiasm of the development team, I believe that they will perform well in all phases of the project to operate the \"Learn to earn\" mechanism well. I see the project as highly feasible.\n", "q1r": 5, "q2": "They have also made public many support information channels for Discord channels such as Youtube, and Facebook. The cost is given quite detailed with each stage. The amount applied for a large amount of work done in all three stages is reasonable.\nThe KPIs are also fully listed. I find that the way the proposal is put forward is transparent and easily auditable.\n", "q2r": 5, "assessor": "z_assessor_3900", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We will create a platform to provide documents, information, knowledge about the Cardano ecosystems&Cardano knowledge, multi-language at a reasonable cost by the Win-Win collaboration of the community", "experience": "Our team includes software developers, project operators, administrators, Community builders, Multilingual Interpreters, Catalyst PA, vPA, and funds Proposers."}