{"id": 421355, "author": "newmindflow", "title": "NFT Film Distribution Dapp&Showcase", "url": "https://cardano.ideascale.com/a/dtd/421355-48088", "category": 26595, "amount": 149820, "description": "The film industry could be a very powerful ally in the mainstream adoption of blockchain tech, but they are understandably reluctant.\nHow do we get decision-makers interested?", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 1706, "q0": "The proposal is well aligned with the objectives of the challenge, the problem is that the film industry is not currently aligned with blockchain technology, it is a market that still encounters some resistance and also does not see ways in which blockchain technologies can intersect with their activities. And this would be resolved through the launch of a platform where tickets would be sold as NFTs, according to the proponents, it will be a secure, decentralized platform fully based on the technologies pertinent to the Cardano ecosystem. NFTs need to be desirable to the public, so to make the project an acceptance success we will build an “NFT minting platform and custom dapp tailored to meet the needs of the film industry, with a focus on affordability and the industry’s large storage requirements.” . The minting platform will be accompanied by a very easy-to-use NFT-based authentication service to implement access to movies, additional content and perks.” In other words, the objective is to demonstrate, from what I understand, to both customers and companies, how tickets can become active tokens and how producers and filmmakers can benefit through the royalties that will be generated. In other words, the idea has everything to do with what we are looking for in the challenge, as it will bring a dApp with a new use case to the CNFT ecosystem, so I think the idea deserves top marks in the impact topic, this is also super clear in the excerpt “Our proposal to create an alternative distribution model for the film industry addresses the central objective of this challenging scenario. That is, driving Cardano adoption by deploying useful and interesting real-world dapps, solutions and use cases in a way that adds value to the entire Cardano ecosystem.”", "q0r": 5, "q1": "The proposal is viable, although the information given here is not perfect. The script is presented based on certain activities, we know what would happen and how long each thing is expected to last, for example: “Production of the making-of documentary (it will be distributed through the other stages of the project), Digitization of the 35mm negative (1 week), Film processing and restoration (1-2 weeks), Scanned negative color grading (1-2 weeks), Film reprint (2-3 weeks)” and etc. Two observations: first, could we have had more information about each activity, such as the production of the documentary? How is the process of digitizing the negative, how would the processing of the footage be? Second observation: it would be interesting if we knew in which months of the year these expenses would be organized, for example what would happen in August, September and so on. Talking about the budget, the asking amount is very high, it's almost 150 thousand dollars. They are divided into several parts, which in my view could be more detailed. For example: “Marketing (events, festival entries, social media campaigns) - $10,000 / Blockchain Development - $57,700 / Back-end distribution - $15,000 / Front-end web distribution - $10,000 / Miscellaneous Expenses - $ 27,750”. How would this publicity campaign be carried out, what are the events and festivals targeted here? How would the 57 thousand dollars paid for blockchain development be divided, why such a high amount of 27 thousand dollars is requested for miscellaneous expenses? A certain trust is passed on to the team, as we know who the professionals are in terms of audiovisual involvement, but we are also told how they fit into our community, that is, how they are connected with the activities of the Cardano; This is clear from the excerpt: We have been exposed to all aspects of the NFT ecosystem in Cardano since before the 1st (March 1, 2021 - The Mary Hardfork). As artists and creators, we launched two Cardano NFT projects: Trybbles, in May 2021, and Icons, in September 2021. Authors of the first NFT release on Cardano with a smart contract, buildable and working in the token metadata (…)” .", "q1r": 4, "q2": "Auditability is also good, only a few adjustments are needed for the topic to be fully adequate. Speaking of progress, it is said that updates will be passed on through Catalyst Monthly Reporting, but will this be available to our community as well? As the various KPIs cited (”Number of users visiting the project submission website + Number of users accessing the restored movies through NFT authentication + Project social channel followers and positive interactions + Number of external articles and media content written and produced on the NFT-based distribution model of the project in general”, etc) can be constantly monitored by us? In my view, there was a lack of establishing a more solid communication channel between the team, updates and the Cardano community. It would be necessary for us to have clarity about updates, both in relation to development processes, the work of each professional involved in the team; and partial results, which would be precisely the KPIs presented here. Moving on to the success scenario analysis, a similar thing happens. We have a good breakdown of what would be considered the ideal scenario. For example in “3 months - The 35mm is digitized, processed and remastered. NFTs are being prepared for distribution. The making-of production is well underway. Plans for the launch event are in the works / 6 months - Films and NFTs are complete. The launch is successful and the launch event organized for members of the film industry is well received.” Really, what was lacking here was, once again, to make it clear how such scenarios would be perceived by us, how the team intends to prove that such events came true, how we can, through quantitative and qualitative data, understand what would have been consequence of this initiative? In other words, some clarifications are lacking here, despite the fact that the proponents provide us with a lot of necessary information and very rich in detail. The communicative bridge between the proponents and the Cardano community would need to be more solid, more secure.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "In the Feasibility section of the assessment the assessor is requesting a level of granularity that is totally unrealistic and would be equivalent of the Catalyst community micro-managing the project. For instance he justifies lowering our score with the fact that we didn’t describe “How is the process of digitizing the negative, how would the processing of the footage be?” . In reality this is something that we can’t know exactly at this stage of the project and would depend on several factors, such as the state of the film negative and the audio material.\n\nHe also makes the claim that “the asking amount is very high”, but doesn’t provide enough justification for this assessment. In fact our budget is very descriptive and broken down, and we have tried to be very conservative in our estimates.\nFor instance he wrote that “why such a high amount of 27 thousand dollars is requested for miscellaneous expenses?” , when in fact the Miscellaneous Expenses part of our budget is clearly split between Project Management, Accounting Services, Legal Consulting, Travel, Software, Subscriptions, Web Hosting, Web Domains. The fact that he didn’t notice this indicates that the proposal has not been carefully read or analysed.\n\nThe assessor also doesn’t seem to be aware of the fact that Catalyst Monthly Reporting data is public and is basing his Auditability assessment and score on the fact that this is not available to the community, when in fact the data is available : https://docs.google.com/spreadsheets/d/1wAG5O4PBLRTM01PLUyc3iS9EYOaucyDHryOOG8OVKuk/edit#gid=0 "}, {"id": 3914, "q0": "The issue being even though film industry could be a very powerful to encourage people to adopt of blockchain technology but they are reluctant. The proposal is trying to get the decision makers interested by building a platform for NFT film distribution and showcase a successful example of a blockchain enabled solution to attract the attention of key players in the industry. This will be helpful to get the interest of decision makers. This does help add value to cardano. This does address the issue ", "q0r": 5, "q1": "The proposer has a combined experience of 30 years in film, TV and games production also has experience in NFT space. hence the given experience and skill should be enough to execute the proposal. The proposer has provided a very clear plan and a detailed timeline. The fund requested of $149820 USD has clear budget breakdown and the fund demanded seems justified for the work needed to be done. thus it is likely the proposal will be implemented successfully ", "q1r": 5, "q2": "The proposer has provided a clear step by step tasks to complete the project and have provided a time horizon according to which the project is expected to launch by earlier 3rd quarter of 2023. The proposer has also provided clear KPIs for the proposal which will be very useful. this should be enough to measure the progress of the proposal. The proposer has provided monthly targets of 3 month, 6 month, 12 month and 24 month which should be helpful to measure the success of the proposal. thus the information provided should be sufficient to audit the progress and the success of the proposal", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 4541, "q0": "I agree with the impact of this proposal. The proposal identifies a problem (i.e., build a dApp that provides a new, useful use case) within this challenge. It may also meet Fund9's strategic goal by building a real-world solution on Cardano. It provides an understandable context with supporting metrics and numbers (e.g., the impact that that pandemic has on movie theaters and the impact of centralized film distribution has on filmmakers). The proposal articulates how it will add value to the Cardano ecosystem by providing an alternative solution to the existing centralized ones. This solution impact is quite straightforward for the filmmakers (i.e., having a platform to distribute their film by NFTs rather than working with Netflix or the like), but it is unclear to me what advantage this solution will bring to the end-users / consumers. What benefits the consumers would have by using this platform rather than the existing centralized platform. Probably, the proposer may think further about incentives for the end-users (watch to earn?).\n", "q0r": 4, "q1": "I strongly agree that the implementation of this MVP is feasible. The core team of this project is New Mindflow, award-winning filmmakers, film and animation directors, app and game developers with a strong track record on Cardano: 2 CNFT projects (Trybbles & Icons), and core team members of the Cardano NFT-Guild. The proposer provides evidence (websites and links of their previous projects on Cardano) of relevant skills (mostly related to film restoration, backend development, and NFT preparation on Cardano) needed to implement the proposal. The proposal provides a sensible and conductible plan for implementation that shows how they plan to build the MVP, with special consideration given to achieving the goal with the lowest possible budget (by restoring the old films for distribution). The proposal offers a realistic timetable to complete the work and the budget is outlined clearly into identifiable items. The proposer expects the dApp will be self-sustained after this round of funding.\n", "q1r": 5, "q2": "I strongly agree that this project is easy to verify. The proposer clearly articulates what success for the project will look like in 3 months, 6 months, 12 months, and 24 months with key deliverables for each milestone. There is a list of 6 quantitative KPIs to gauge the outreach, influence, and actual usage of the platform. The proposer also states the frequency and channel of project updates (via Catalyst Monthly Reporting form)", "q2r": 5, "assessor": "z_assessor_2558", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13486, "q0": "The problem stated is clearly defined that the film industry can be a very strong ally in the mainstream adoption of blockchain technology, but they fail to attract public attention this is a problem that needs to be solved. tackle this challenge. The solution to this problem is to build a platform for the distribution of NFT movies and showcase a successful example of a blockchain-enabled solution to capture the attention of key industry players. This solution can completely attract participants. It fulfills the purpose of this challenge. The major impediment to the progress of the proposal is the lack of highly skilled personnel, which can affect the small delays the team has accounted for. However, this is not a difficult problem to affect the progress of their project. These problems are foreseen by the project owner and offer reasonable solutions. I found this to be a good idea that could be scaled up to address future challenges. This proposal if funded it can bring a lot of Cardano/Catalyst value it will help a lot in attracting the community.", "q0r": 5, "q1": "The future implementation plan listed by the author is very detailed and complete. Performance metrics are complete and clear. The metric KPIs are listed as follows: the number of people from within the film industry who are aware of the Cardano NFT-based distribution model, the number of people from outside the film industry who are aware of the Cardano NFT-based distribution model. , the number of users accessing the website presenting the project, the number of users accessing the movies restored through NFT authentication, the project's social channel followers and active interactions, the number of articles and external media content written and produced about the NFT project-based delivery model in general, the number of producers/projects considering adopting the NFT distribution model. With the above indicators, I find that the proposed group is very close to reality and very convincing. The project has a strong team, the team list is detailed by the author, clearly they are good people with expertise in many different fields. They are a veteran group with 30 years of combined experience in film and television production. With the long tenure of the team, I believe that the project will soon be successful if it is funded. The proposed funding budget is $149,820 in a clearly outlined and appropriated budget. The author divides it into 5 main stages to spend: Introduction of movie distribution in the amount of 42,600$, Blockchain development in the amount of 57,700$, Other expenses in the amount of 27,750$, Expenses - 10% for an amount of $12,805, Tax - 7% for an amount of $8,965. Detailed budget allocation will increase the credibility of the proposal.", "q1r": 5, "q2": "The future implementation plan listed by the author is very detailed and complete. Performance metrics are complete and unambiguous. The metric KPIs are listed as follows: the number of people from within the film industry who are aware of the Cardano NFT-based distribution model, the number of people from outside the film industry who are aware of the Cardano NFT-based distribution model. , the number of users accessing the website presenting the project, the number of users accessing the movies restored through NFT authentication, the project's social channel followers and active interactions, the number of articles and external media content written and produced about the NFT project-based delivery model in general, the number of producers/projects considering adopting the NFT distribution model. With the above indicators, I find that the proposed group is very close to reality and very convincing. The team is the creator of 2 successful CNFT projects: Test Boxes & Icons, Cardano NFT-Guild core members, Emurgo marketplace Genesis artists, Fibo, Anamaria Kövesdi, Rares Kövesdi... veteran group with 30 years of general experience in film and television production. With the long tenure of the team, I believe that the project will soon be successful if it is funded. The proposed funding budget is $149.820 in a clearly outlined and appropriated budget. The author divides it into 5 main stages to spend: Introduction of movie distribution in the amount of 42.600$, Blockchain development in the amount of 57.700$, Other expenses in the amount of 27.750$, Expenses - 10% for an amount of $12.805, Tax - 7% for an amount of $8.965. Detailed budget allocation will increase the credibility of the proposal.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 4, "ne": 2, "ng": 1, "nfo": 1, "vca_o": 1}, {"id": 15131, "q0": "This intriguing proposal expands on a previously unfunded idea to expand the scope in order to capture much more possible impact.  Here they describe a distribution platform on Cardano where filmmakers (or anyone who owns a visual asset, but lets just stick with filmmakers since they are the target) can leverage NFT functionality (and this goes waaaaay beyond price speculation...in fact, speculation isn't even a part of this conversation) to extract new and critical value from their resource.\n\nThe plan is put a movie from creator-collaborators that are on the team (https://www.imdb.com/title/tt1428049) into the pipeline on this project as a proof of concept.  This divides the project up into two stages.  The first is to turn the 35mm asset into a digital asset that can be leveraged via DLT.  The second is the buildout of an actual distribution platform MVP to show the functionality of NFTs for asset holders who choose to distribute their product on the platform.  The first stage provides both a necessary piece of the proposal (need an actual asset to run through the protocol), but it also provides a PoC for what the team feels is an approachable sector of the market, which is the 35mm asset holders who need unique use-cases to incentivize them to mobilize their assets.  (There is an area of synergy that the proposer may not have identified with their idea about these \"nostalgiac\" assets...this is the prime territory of *collectors* as well, which is a unique bridge between NFT functionality and 35mm assets.)\n\nTo actually deliver an MVP of a film distribution platform would be a tremendously impactful, as the industry is already eyeing crypto (but in ways that don't recognize true functionality of security, accessibility, uniqueness, etc.  https://amplify.nabshow.com/articles/crypto-goes-hollywood-studios-back-blockchain-projects/).  There is definitely a sense of FOMO in this sector.  Because this proposal describes well the role of relevant, sustainable NFT functionality in creating bridges to a massive, as yet untapped market desperately looking for new ways to create value, I believe it deserves a full 5 stars for impact.", "q0r": 5, "q1": "The team has demonstrable knowledge of the space they are working in, with both the relevant film industry experience (and they are the asset holders for the PoC as mentioned above) as well as the critical NFT experience.  In particular, what I want to see here is an understanding of NFTs that goes beyond speculation, or even collecting and really looks at the technological functionality and unique, innovative use cases they present (the proposers do exactly this), while noting the challenge of general industry involvement in the \"unproven\"...not a whole lot that can be done about that except to have a good showing with security and reducing risk, which the proposers address via onboarding a low-risk part of any asset-holders portfolio, i.e. this isn't about distributing hot new releases (though it could), but reliable undermobilized capital.\n\nThe budget is challenging, as the film restoration is both a somewhat unpredictable line item, as well as a large expense.  However the team appears to have a solid plan for this.  They have also struck a decent balance with the budget by leveraging the need to go through the restoration process to create a \"making of\" documentary (they're film-makers...what did you expect?) which can actually be filed under \"documentation\", i.e. it will function like a tutorial or how-to, while also serving as a marketing piece as the MVP finishes development.  (This is another nod to the team...their experience in these spaces will likely lead to other interesting synergies and problem-solving, if I don't miss my mark.)\n\nOne area of long term concern, that isn't wholly relevant to this specific MVP iteration, is the issue of storage solutions.  Film and visual media has massive infrastructure requirements and the prices do not scale in any meaningful way.  For one movie this isn't an issue, but that MVP will struggle with adoption in the future (and their long term KPIs are relevant here) if there isn't a solid, sustainable solution in place.  On the one hand it isn't anything that loads of funding won't solve, but the proposer is encouraged to look at some of the distributed computing and storage models that are being developed on Cardano as well.  I don't know if it is appropriate to single any of them out, but I can say there was a really good one in X-chain collaboration challenge here in Fund9, that may fit the bill.\n\nBecause the team has backgrounds and current, relevant knowledge critical to delivery of an impactful solution here, and because they have provided an excellent roadmap with clear milestones and deliverables, I believe this proposal warrants a full 5 stars for feasibility.", "q1r": 5, "q2": "While the roadmap was clear, the actual timeline for this proposal was not perfectly explicit.  I believe it is a 6 month funding timeline, however, they may consider it to be a 9 month timeline.  Either way, they are committing KPIs here that go out to two years beyond the start of the project.  This is because the metrics they provide are really about measuring the impact, which necessarily will be accrued as the platform is adopted.  To that end, the provided KPIs seem relevant and effective, as well as actionable.\n\nAs always, I look for the in-progress auditing metrics as well, which are not presented explicitly, but which can be distilled from the great list of milestones.  These are things like tracking the %complete on the film transfer, or amount of a- and b-roll shot for the documentary, etc. (a shot list in sync with a production schedule or equivalent can make a good, trackable metric to show %complete on the creation of the documentary).  These metrics can help define the monthly beats of the project, which is critical since these are the beats that funding is distributed on.  When they are present they allow a projects budget/timeline to matchup in understandable ways that reduce risk and increase confidence.\n\nBecause this is a team that has delivered on funded proposals, and is managing current proposals, I feel like they have a good grasp of the auditability process.  However, despite strong success and impact metrics, I am marking down by one star due to a lack of robust progress indicators and a firmed up funding schedule.  4 stars for Auditability.", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Build a platform for NFT film distribution and showcase a successful example of a blockchain-enabled solution to attract the attention of key players in the industry.", "experience": "30 years of combined experience in film, TV, apps & games production\nCreators of 2 successful CNFT projects: Trybbles & Icons\nCore members of the Cardano NFT-Guild.\nGenesis artist of the Emurgo marketplace, Fibo.\nVery active in the Cardano NFT space since February 2021."}