{"id": 421537, "author": "gondlr", "title": "AEROS Universal AirMile BasedOn ADA", "url": "https://cardano.ideascale.com/a/dtd/421537-48088", "category": 26595, "amount": 75000, "description": "Airmiles are the biggest currency in the world with 10 Trillion outstanding miles and 500B issued annually. Miles depreciate over time and are difficult to track and redeem frustrating 300M members.", "f6_no_assessments": 5, "f6_rating": 4.800000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 1956, "q0": "In the impact section it is stated that “There is no better target audience than reward programs since their currency depreciates over time but crypto tokens can offset this problem since they could appreciate it in the future.“. A question that might arise is that crypto is very volatile in its nature and has a potential for +/-90% swings in a short span of time. Why would crypto be a preferred solution over a slowly deprecating currency (Aeros miles points)? The miles points are at least predictable in their nature.\nIt would be suggested to address this in the proposal - how would you on-board customers from a deprecating scheme to a very volatile scheme instead? (This is not an argument against crypto, but it is important to know how you would sell the proposed idea to the users).\nFurthermore, it is mentioned that there will be extensive data collection (or already exists). Is this also true for European users? Are you compliant with GDPR today? No points are deducted as a result of GDPR aspects, but it would be interesting to hear about compliance and/or potential issues.\n\n\nThe proposal is well aligned with the “Dapp…” challenge setting and all things considered, it is impactful to an extent. The project could absolutely gain traction if it is implemented, marketed and adopted. The main question is how the proposers will market and on-board users so that it has a significant impact. The resulting score will be “good” in terms of impact, 4 points.", "q0r": 4, "q1": "The proposing team claims to have 10+ years of experience working alongside significant airlines. Furthermore, the team has listed their experience together with verifiable LinkedIn profiles. The team is already assembled and they have the tools needed to bring life to the proposed solution. They work in a structured, agile, manner which is described alongside their detailed plan. The plan is divided into sprints which lists major milestones within that also acts like a great alternative to track progress.\nThe listed hourly wages are reasonable for the positions, and it matches with their claimed budget. Overall, the team is very credible and as a result, the feasibility of the proposal is also very high. The proposal receives 5 points in terms of feasibility.", "q1r": 5, "q2": "The team will have their sprints and dashboards open for the community to audit during development. This is a great solution to stay true to the community and allow for full transparency. No KPIs are listed explicitly in the proposal (with estimates/metrics) but it is assumed that this is included in the publicly available documents. However, for an easier auditing process for the community to evaluate the project after its live, it would be great to have real and measurable metrics to compare. Overall, the strengths in terms of auditability outweighs the small shortcomings, and the score will be 5 in terms of auditability.", "q2r": 5, "assessor": "z_assessor_2290", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Thank you for the feedback! I know Airmiles is a specific industry that not everyone is aware of, but with a great potential for Cardano and ADA. The goal is that the airlines to find this solution appealing therefore the adoption will be incentivized. We are extremely familiar with the companies in the sector and a token like Aeros could bring a solution to many of them. \n"}, {"id": 9534, "q0": "There is a level of creative brilliance to this proposals idea that appeals to mass adoption of the Cardano ecosystem, with well quantified impacts to give voters a sense of magnitude, so I rank this section a 5. This section of the proposal gives voters a very strong start with demonstrable proof that this team is committed to producing something to address the given problem statement. As much as I love the quantified nature of the problem statement, I do think there’s room for this proposal to further define that quantifiability by translating data to USD to give a clearer sense of how big the problem is AND how much money could come into the Cardano ecosystem because of this proposal. I also wince a little bit at the first sentence that states “Aeros is the first universal ‘currency’ issued and owned by airports.” This statement might appear a little antithetical to decentralization but it is a rather fair model because airlines are the ones that are supplying the goods and services, so it makes sense that they own the controlling rights to the medium of exchange. On this point about decentralization and the use of blockchain, I would also like to be given more assurance about protection of privacy to contrast a lot of the rhetoric about collecting information about passengers. Furthermore, I think there’s an opportunity here to lean into the potential impacts of this platform by theorizing connections to credit card companies that offer travel rewards, international utility on a global scale, and MASSIVE Cardano adoption potential. These are kinks that I expect to be worked out and addressed along the way but they are seem to be at a rather impressive place for a project that is rather newer in their development. I think the proposers have a very creative solution for a very real problem within a trillion-dollar industry, which is why I rank so positively. ", "q0r": 5, "q1": "Between the impressively comprehensive skill set of the core development team and the surprisingly efficient spending, I rank this section a 5. The project director has direct experience (and established relationships) working with some of the biggest airlines on the planet to create loyalty programs, which scores major points for the positioning of this proposal. Beyond that, this team has large-scale experience working with multiple fortune 500 companies to create top of the line digital products. If voters are evaluating the feasibility of this proposal through the lens of the capabilities of the core team members, I think the outcome is overwhelmingly obvious to the positive side. On the roadmap, the only thing I love more than the outrageously fast process of producing a demoable product is the detail in the roadmap that shows different aspects of the proposal beyond just development tasks. In this roadmap we get company culture actions, advertising campaigns, partnership acquisition and tokenomics panning, which is a nice level of detail that we don’t get a lot from many Catalyst proposals. Though what’s most impressive about this proposal is the insane level of efficiency in the budget, especially for the high-level experience that we get out of it. The $3000/mo compensation for full-time hours comes out to $17.30, which is criminally low (I mean that positively). I’m inclined to assume that a project of this scope is likely getting some funding from investors/partners in other areas outside of Catalyst funding (which would be a VERY good sign of success), so I am under the impression that this proposal is more supplemental. I vote yes. ", "q1r": 5, "q2": "For a very organized and well compartmentalized KPI outline, I rank this section a 5. I appreciate the breakdown of KPIs into different aspects of the project because it gives me a sense of all of the different modules being measured for performance AND it tells voters that this proposal has 4 separate categories for success that must all perform at a minimum standard. This is a unique auditibility format that I might like to see implemented in other Catalyst proposals, I’m a fan. I also appreciate the quantification throughout this section, specifically the aim to integrate at least 5 loyalty programs in the first draft of this project. For where this project is in its development, I don’t expect to see further quantifiability in different areas of usage. Still, I don’t think it could hurt to stretch existing KPIs across multiple timeframes to show the anticipated progressive performance AND point out additional metrics like usage data, traded volume, and other stats that might point to solvency on the problem statement. I would expect to see these stats on future proposals but for this one I am very enthusiastic. This proposal is very well aligned with Catalysts mission to pursue the highest levels of community innovation, so my reaction is positive. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "This is the best assessment we received. Even though we did get mostly fives from other PAs, this assessor really understood what we are trying to do and how we could increase the value of Cardano and ADA through a real case. This PA paid a lot of attention to the description of the proposal and how all the different pieces interact.\nThere are many interesting comments like the one related to credit cards that we did not explain but are on the roadmap. Cardano could be the main blockchain that addresses the loyalty industry with a revolutionizing tool that could trace points and miles in a transparent way. Thank again for your positive assessment, hopefully, we get enough votes to get funded!"}, {"id": 801, "q0": "Airmiles loyalty program encourages flyers to use a single airline to increase the chance of getting a free ticket at some point in time. Or there are also lateral rewards which can be exchanged with other services or products. These are non-core activities for airlines and there is a trend to outsource them leading to a dilution in loyalty due to convergence in reward structure among airlines. In other words, there is no major benefit in being loyal to a septic airline since all airlines give the same or similar rewards. There are ways to overcome them by reward inflation with repeated travel etcetera in this aspect the Aeros token has a great business appeal, providing great flexibility for users and the airlines. With smart contracts and crypto tokens, there is a chance to unlock great business values. In this respect, the proposal is in alignment with the challenge. The success of the proposal can bring huge value to Cardano.", "q0r": 5, "q1": "The proposal is from a team of at least eight people with excellent professional backgrounds. The idea for using Cardano native assets as Airmiles may not be unique and there is sufficient literature and knowledge in the ecosystem to use the native assets for a loyalty program. The technical similarity is likely to help the project implementation. The current status of the company is shown as the pre-seed funding stage and any information regarding the same in the proposal would have added value. However given the scale of work involved in onboarding airlines to the crypto-backed loyalty programmes, there are risks. The team’s contact with airlines or the state of talks with them or any information on the interest shown by Airlines in the proposal would have added great confidence to the proposal. ", "q1r": 4, "q2": "The cost of the proposal is mostly for paying six developers and CTO at the rate of 3000 USD per month for five months with the exception of a graphics designer who is hired for two months. The cost also includes hosting charges in AWS. The total comes to about 70K USD. The project is expected to be completed in five months and the proposal includes a fairly detailed road map. There is a need to estimate the scope of the project in terms of shops/services that will come on board and more importantly airlines that will use the aeros coin. The outcome expected is quite clear however roadmap to active has risks. The expenditure is daily clear and auditable. ", "q2r": 5, "assessor": "z_assessor_2129", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for the feedback! I really appreciate the time and effort to put this idea together. I know Airmiles is a specific industry that not everyone is aware of, but with a great potential for Cardano and ADA. We are extremely familiar with the companies in the sector and a token like Aeros could bring a solution to many of them. \nOf course, as suggested, there is a risk since it is a B2B solution so I understand why we received 4 stars in FEASIBILITY."}, {"id": 5910, "q0": "This is a very interesting proposition, it is highly practical, it effectively solves the challenge posed. Aeros currency can be converted to any miles or used as a payment method managed by unique wallet. Aeros will be exchangeable for ADAs, converting ADA into the first crypto associated with miles. A product like Aeros plus the integrations to the different loyalty programs will increase the utility & adoption of Cardano through exposure to a massive customer base of loyalty programs. Also this project can introduce to the airlines the usage of blockchain and the advantages of this technology to migrate their programs to be run on Cardano. This increases the number of Dapps on the Cardano ecosystem.", "q0r": 5, "q1": "I am impressed with the information about the team you provide. The team consists of many members, all of whom have experience, skills and knowledge to implement the project. Each person performs a separate task (UX/UI development, communication, marketing,...). Together they form a strong team. Having a strong team is the first condition that makes the project possible. In addition, the link to their Linkedin profile is also provided. This makes the above information transparent and easy to verify.\nDetailed roadmap for 5 months has been provided. You have fully identified the to-dos, the important milestones. This will help the project stay on track, on track to the set goals. The budget allocation section is very clear and detailed. You calculate a budget on a specific job based on the number of people involved in the job and the number of months worked. However, I think it would be better to know the number of hours worked, the hourly wage. Because budget transparency is always essential.", "q1r": 5, "q2": "The information provided is quite complete, based on it people can evaluate the success of this project. In addition to my comments in the previous section, I also want to commend you for identifying the difficulty, the risk and how to overcome it. This is the foundation to help the project develop in the long run. In addition, the progress and success indicators are also very specific, making it easy for everyone to track and evaluate the project.\nOverall, I fully believe in the success of this project, if it is implemented it will definitely bring great value to us. Thank you for the great suggestion!", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you a lot for the time and all the ideas shared in this assessment! It helps a lot for us to see if PA understands what we are trying to achieve and it looks like we made it, hopefully, now we get enough votes to be funded! Thanks again for all the comments and the support on the assessment."}, {"id": 15218, "q0": "The idea is very good and could make for an extremely profitable use case for Ada. It's about converting air miles into Ada via a token called Eros, it's argued as miles are the world's largest digital currencies, with around 500 billion units being issued each year. With the Eros dApp, passengers would be able to convert their miles to our token, and several advantages would also be provided, such as: that passengers “monitor their flights, gate changes, airport maps, lounges and store promotions such as Duty- free and other traders”. There would also be other applications like Eros Shop and Eros Pay. In my view, the proposal has a lot of potential to take Cardano's technologies to a huge audience and is fully aligned with what is sought in the challenge, thus deserving a maximum score for the impact.", "q0r": 5, "q1": "Feasibility is very good. We know what would happen in each month, with a not so deep detail, but that allows us to have an understanding of the whole, as seen in month 1: “Planning and Initiation Eros system definition (values, exchanges) APP configuration and customization Wallet Earn and spend Eros configuration Graphic design, logo, branding and program color definition”. The expenses are clearly explained, for example we know the monthly salary of the professionals involved, and also how much time they will dedicate to the project (for example, full-time). And finally, the amount of information given about the professionals is interesting, the demonstration of the CVs could be even a little bigger, but it is still satisfactory because it allows us to have a good knowledge of the team.", "q1r": 5, "q2": "In terms of progress, it is quite possible for us to monitor the project properly. Sprints will be generated, through which we can follow the creation of different parts of the proposal, such as “Graphic design, logo, brand and program color definition, wallet, exchange, gain, expense, payment module, movements and notifications”. There is also a backlog, so we have better control over what is produced. What happens with the ultimate success is something quite common among the proposals, we know what the success scenario would be (“Becoming the first AirMile Cardano token in the world to be integrated with many airlines and loyalty programs around the world . Integrate at least 5 loyalty programs into the first MVP”). But we don't know how this could be demonstrated, researched, presented to the Cardano community, through quantitative and qualitative data.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Aeros currency can be converted to any miles or used as a payment method managed by our unique wallet. Aeros will be exchangeable for ADAs, converting ADA into the first crypto associated with miles.", "experience": "We have been working with airlines for 10 years, United Airlines, Avianca, British Airways. We have developed a solution for end-users to accumulate a universal currency (Aeros) that can be connected to many loyalty programs. Our background is in Economics and fintech products."}