{"id": 421535, "author": "soloappoh", "title": "sustainable usage of energy", "url": "https://cardano.ideascale.com/a/dtd/421535-48088", "category": 26595, "amount": 58700, "description": "high electricity tariffs due to high consumption of electricity as a result of too much leakages in wiring systems of 90percent of homes and public places in the country.", "f6_no_assessments": 5, "f6_rating": 3.1333333333333337, "videos": [], "media": [], "f6_assessments": [{"id": 1562, "q0": "I heavily advise against funding this proposal. As an engineer I can assure 100% that there is NO scientific foundation for this product and it WILL not work. The notion of electricity flowing out of cables does not have anything to do with reality and there sure is no card that you stick somewhere that affects electric circuits in such a way that it safes electricity. If you want to safe electricity, turn off your appliances when you don't use them or buy appliances that use less energy. The other products offered by the company in question are also fradulent and have no scientific basis. It would be very negative for the Cardano ecosystem and its reputation of Catalyst funds were used on subsidizing selling a scam product to people that don't have a lot of money (they explicitly mention they want to use the funds to \"help\" people who can't afford it.", "q0r": 1, "q1": "The proposer wants to sell a product that does not work. He makes claims about his qualifications but does not prove them. He claims in the proposal to have worked with WADA, which I have verified with people in WADA is actually not true. There are fake testimonials for the product in the comments. All this hints to malvolent intentions of the proposers, so I can assure this proposal is not feasible.", "q1r": 1, "q2": "For the reasons mentioned above this proposal isfradulent, hence it does not make sense to discuss auditability of selling a worthless product that does not work to innocent people.", "q2r": 1, "assessor": "z_assessor_2257", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 5909, "q0": "This proposal makes a lot of sense. First, people will be able to use electricity at a discounted price, reducing electricity consumption by 30-40%,... . This will contribute to improving people's lives, especially those with low incomes. In addition, it also has a strong impact on the Cardano ecosystem. The project will attract a large number of people, Donking staffs and agents to join Cardano because that way they can buy \"the electricity saver card\" at a discounted price. It is for the above reasons that this proposal has effectively solved the challenge posed.", "q0r": 5, "q1": "Based on team information. Your group consists of 3 members. They are Founders, Business Developers, Strategic Marketers, Chief Finance Officers,... Each of them are individuals with extensive experience, skills and knowledge to carry out this project. However, it would be great if there were more links to their profiles (Linkedin, telegram, ...) This will make the above information more authentic and reputable. From there, people can easily believe in the ability of this project.\nDetailed roadmap (within 5 months) has been clearly provided. You've identified the to-dos and allotted them to specific timelines. This is very necessary, it is like the core of the project, helping the project develop in the right direction, with the original set goals. The budget has been calculated. However, it is not really specific. I think you should clarify your budget, break it down, so people can see how the $58700 is being spent. For example, how many people will be involved in each job? How many hours will UX/UI designer work, what is the hourly salary? As for the criteria for assessing the progress of the project, how do you plan to inform everyone about the progress of the project, are there any notification channels (eg: website, ...)? In addition, you should also provide specific metrics to evaluate the success of the project according to midterm targets and long term targets.", "q1r": 4, "q2": "After reading all the information you provided, although there are still some shortcomings (as I mentioned in the previous section). However, it is still enough for us to judge the success of the project. I also want to commend you for identifying the risks, challenges and ways to mitigate them. This will help prevent and prevent factors that hinder the development of the project. In addition, there is another plus point, this proposal is aiming for autonomy, not requiring investment in the following fund. This is great!\nAlthough the proposal has a few shortcomings. However, conceptually, this proposal is exciting and great for the Cardano ecosystem. I very much hope it will be implemented successfully in the future. If that is true, the great benefits it brings us will be undeniable. Thank you for a great suggestion!", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8416, "q0": "This proposal is interesting with the adoption of the cardano blockchain for the sale of energy-saving cards from one of the electricity providers in the area. I think the problems that occur with the large amount of electricity usage as a result of wiring leaks and are solved by selling cards are irrelevant. What must be resolved is the leakage of the wiring itself because it is related to electrical installations and electricity transmission networks. The idea of using blockchain as a medium for selling energy-saving cards is a very good one and of course I fully support it, it just sample for using one product to sell on blockchain.", "q0r": 3, "q1": "I think everything that is presented from the timeline, the use of funds and the team is not suitable for dApps development. In developing applications or dApps, we do not need to agree with the manufacturers of the products to be sold because these dApps can later be customized for various types of products. There is also no mention in the timeline when the dApps will run on the testnet or a schedule to the mainnet if they already exist. Even from a budget perspective, I don't think there is a need for a negotiated budget. The existing team seems to be recruiting technical personnel according to the written budget. And for technical personnel, it is necessary to explain in more detail, for example the development of smart contracts for dApps and other things related to blockchain because usually dApps are related to web3. Marketing I think is another thing and beyond dapps development. It is different if what will be created is in the form of a marketplace that accepts payments manually from a cardano wallet. Suggestion, there is nothing wrong if the proposer learns about https://indigoprotocol.io/ or maybe thinks about using it, even though indigo is not running yet.", "q1r": 2, "q2": "For audits, as a development team, of course, it is necessary to include, for example, a github link so that progress monitoring can be carried out and at least there is a prototype. But here the proposer mentions the unnecessary for dapps development. If this proposal falls into the grow Africa category, grow cardano may be appropriate because it sees the introduction of cardano to producers and the target number of products sold through a platform built using ADA as a medium of exchange.", "q2r": 2, "assessor": "z_assessor_2982", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9533, "q0": "I rank this section a 3 because the rationale for how this helps the Cardano ecosystem is well argued but there are some uncertainties the mitigate impacts. If I understand the value proposition correctly, Donking Enegy saver has proprietary technology that can save users money on their overpriced electricity bills. The only way to get access to this technology is the adoption of the Cardano ecosystem, though the product appears to be purchasable now, so there’s question of actual Cardano adoption. The numbers almost seem too good to be true and the only thing I’m skeptical about, that was not thoroughly articulated in the proposal is how this proprietary technology works. Or if that’s too complex to simplify, I think some kind of documentation on the testing/results of this technology would suffice. The proposer says that it’s proven to work but it’s not proven in a formal sense. There is attached documentation to show that a technology has been approved for sale, so I take that to assume there’s something of substance behind this proposal. The impacts are well articulated and well argued (though could be quantified more with population data), but there’s a lot of hesitancy on the mechanism that actually enables access to these impacts (being the technology). I reached out to my uncle (who is an electrical engineer) and he explained that vibrational waves can emit electromagnetic waves, so there’s an element of confirmed accuracy for this technology. In the end, I’m just not entirely convinced of the effectivity of the technology or the link to the Cardano ecosystem. ", "q0r": 3, "q1": "For inconsistency between the skills of the development team and the roadmap, I rank this section a 2. This core team appears to be well-equipped for business related endeavors but the actionable steps listed in this proposal are all dApp development based. There are no developers on this team, which calls into question the feasibility of the proposal. The steps of the proposal seem relatively reasonable to accomplish in the given timeframe (though I might’ve expected a longer timeframe) but voters are not given the tangible information to understand who is doing these actions and if they are capable/qualified to do them. The overall budget is pretty well over the average Catalyst proposal but the breakdown of the spending is pretty reasonable and aligned with industry standard hourly rates. If another round were needed for this proposal, I would suggest further breaking down the “negotiation cost” and the “marketing cost” to give voters more substance to evaluate. Overall, feasibility falls short for me. ", "q1r": 2, "q2": "With a comprehensive set of KPIs and target metric projections across different timeframes of this project, I think this is the best section of the proposal with a ranking of 4. This proposal lays out 5 KPIs that directly link this section to the benefits of the potential impacts. This proposal provides an acute definition of success by setting specific target metrics that tells voters how much impact they can expect to see (or how much the team is aiming for). I wish that all of the metrics were quantified with projected goals. This substance helps voters see that this team is committing to a specific level of short term success that the community can hold the team accountable to. Unfortunately, this team does not provide a public line of communication and outlet for progress updates. I think a few more tweaks on this section could give voters more substance to be able to react positively to. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 15393, "q0": "The “sustainable usage of energy” proposal addresses Dapps, Products and Integration challenge by creating a decentralized platform where buyers can purchase in-demand energy saving cards with Donking Energy saver Ltd at discounted price (30-50% discount). This proposal is based on the assumption that there would be a demand of Donking Energy saving cards which the proposer mentions that the company has a tried and test product that regulate the flow of electricity current and sealing leakages. The benefits from this card is that there would be a reduction in monthly energy tariffs by 30-40% for a period of 5 years. The product will increase ADA and Cardano adoption and hence this platform suits the Dapps challenge very well. ", "q0r": 5, "q1": "From the team roadmap, I would like to add that it might be a great idea to get the feedback from users/buyers before approaching the agent of Donking company. This will help the team to cut the best deal for platform users. Total project duration is 5 months (first 2 months negotiate and finalize agreement. Later in the second phase (2 months the team will subscribe users onto the platform and the last month is spent on reward system. The budget breakdown is in hourly pay rate and the number of days working. The team might want to justify why hourly pay rate was provided only for the developers but other functions e.g. Negotiation cost with Donking Energy saver ltd, marketing cost and UX/UI designer, the team only shares per cost items. The team lead is a business developer with Wada West Africa and this adds to the feasibility of project. It is great that the project will be self-reliant after funded as it shows that the business would be self-sustaining.  ", "q1r": 5, "q2": "It is thoughtful that the team sets short term (500 sign ups as buyers of energy saver cards), medium targets (weekly growth in the number of buyers) and long term targets (buyers convert to become agents and receiving discount). The metrics are Signed partnership with Donking, number of buyers/agents on the platform, discount and transactions on the platform. The team has only provided the media clip but didn’t mention where the community can track project progress. The official site link or social media channels would be great channel of communication so that the project is auditable by the community. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "In partnership with Donking Energy saver Ltd. which is widely known in the country for the sale of Energy saver cards, We create a decentralized platform where buyers can purchase at discounted prices", "experience": "With over 4years experience as Director of Operations for Isaac trucks Ltd and . I have studied the dynamics of procurement and the nature of the business development also worked on numerous projects with wada as a business developer"}