{"id": 421534, "author": "shamrockstakepool", "title": "Poolpeek Stake Pool Pledge Tracker", "url": "https://cardano.ideascale.com/a/dtd/421534-48088", "category": 26595, "amount": 4000, "description": "Within all blockchain there are metrics that people turn to for confidence and one such stat we would like to gather is the total pledge / holding of all the cardano stake pool operators. ", "f6_no_assessments": 7, "f6_rating": 4.428571428571429, "videos": [], "media": [], "f6_assessments": [{"id": 397, "q0": "Poolpeek Stake Pool Pledge Tracker is a proposal that looks to gather and verify the total pledge of information of all the stake pools. The main reason for this solution is the proposers believe the information should be displayed to the community and the impact will be just displaying this information. It would have been good to have heard of more examples of community members or organisations that have stated they would benefit from this information to provide more real world examples. Another thing that would have been useful is a statement of whether any of the existing pool stats websites have this information as then the voter could have confidence that this is indeed something novel and new that is currently unavailable. Another key thing would be how can this data be accessed? If the poolpeek site had an open API where this would be accessible then this would be more easily integrated into other applications. If this was the plan it would be easier to state with more confidence this could produce a growing impact for the ecosystem. Overall with the information provided it is hard to state with any confidence that this solution would produce high impact for the ecosystem. If this is a novel solution then that is fantastic and I would kindly ask the proposers to clarify that in a future proposal submitted in the future if that is needed.", "q0r": 3, "q1": "A simple breakdown is provided to track the progress of this proposal. First is to create the batch process that will gather the information, the second is to update the site to showcase this information. All the funding will go to the developers of the proposal for their labour effort. It would have been good to provide some professional links to know the background of the proposers and also some more depth in what is involved with doing the batcher just to provide a higher level of confidence the proposers understand the implications involved. However the site that already exists provides evidence that the proposers have already implemented a solution that handles stake pool data which provides sufficient evidence that this proposal would be feasible by the same team. Overall the budget is very modest in terms of budget considering what the team has already delivered and offers a way to showcase that the team can deliver further iterations for the community if the community decides to vote on this proposal.", "q1r": 4, "q2": "The proposers outline the website has been live for 2 years and freely available. In terms of tracking success the statement is that the website will be updated. It would have been good to have any Github links provided if anything will be made open source or that already is. Also it would have been good to have some information on who may use this and what kind of ways they may track the usage of this feature. There is already evidence people can audit their delivery of this proposal and the clarity is there in terms of it being simple to understand the intentions. Where the proposal is lacking in clarity is the depth on use cases and how to measure the impact of those use cases. For instance is the code going to be open source for others to use - if it was you a successful outcome is people using that tooling or if it came in the form of an API then you could track the usage of that API.", "q2r": 3, "assessor": "z_assessor_2073", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 800, "q0": "Pledge by the pool operators is an indication of their skin in the game and is a metric which is important for the delegators to make choice. As per the PoS protocol, the person with a higher pledge is more trustworthy in a simplistic manner. These details are available on the chain in a real-time manner. However, it is impossible for a normal delegator to extract the detail. There is a large number of online tools and one such tool is poolpeek. The proposal is to add the stake changes details feature to the peekpool and also to tweet the information. This will provide the Cardano deligators with one more source to monitor this important information. Therefore the proposal is in line with the challenge settings. ", "q0r": 5, "q1": "The proposal is from the builders and the operators of the peekpool and the proposal is to add new features. There is no reason to doubt that the team which has to build such a complex platform will not be able to deliver on this one feature. The team’s competency is visible in the quality of the peekpole web suit. I am very confident that the team will be able to successfully implement the proposed feature. The proposers are currently operating Shamrock Pool and brave pool. Therefore they have substantial experience in operations and also understand the dynamics and the concerns of the ADA delegators. ", "q1r": 5, "q2": "The proposers are planning to add three important features, they collect the pool pledge information every epoch, tweet the details through a bot and display this information as a graph in the site. The estimated timeline is 2 months at the cost of $4K. The outcome will be in open domain and the result will be visible to the complete community to see. The amount which has been proposed seems to be quite reasonable when compared to the amount of work involved. Therefore the project can be classified as just in auditability. ", "q2r": 5, "assessor": "z_assessor_2129", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2700, "q0": "This is a proposal by the owner of the Shamrock stake pool and the creator of a very cool site called Poolpeek https://poolpeek.com to expand its functionality to also track and display an overview of the total holding of cardano stake pool operators.\nThe proposer argues that this will help in educating and bringing a sense of trust to the wider Cardano community and I agree, more transparency is always a good thing in this space.\nThe proposer has not identified any risks, as this is a rather small and straightforward project, the site is already up and running, the only thing that's needed is to work a bit to gather this data and make a dashboard for it. \nI fully agree that this proposal effectively addresses the Dapps, Products & Integrations challenge. Score: 5.", "q0r": 5, "q1": "The proposer plans to gather the necessary data with the help of Koios, which through googling I found out is an API for Cardano that helps people query the blockchain for information (https://www.koios.rest/). As a recommendation to the proposer: when using special terms / acronyms / referring to companies, either explain what they are or add a reference so that the voters and assessors can understand what you are talking about. The timeline is short, the estimation being that in the first month the work to gather the data will be complete and by the end of the second month, it will also be displayed on the PoolPeek site. I have over 8 years of experience in software building and delivery and I can confirm that the requested amount of 4000 USD for 2 people (Paddy, the owner of the Shamrock pool and Brave, a member of the Poolpeek team) for 2 months to complete the work here is not only feasible, but at a very good price as well. Another comment here: try to add some social links to the team section of the proposal, so that people can put a face to the name and get in touch with the people there if needed.\nI agree that this proposal is highly likely to be implemented successfully. Score: 5.\n", "q1r": 5, "q2": "The proposal is a bit lacking in the auditability section, as no KPI’s have been added. Please consider, in order to follow the proposal guidelines and not get a low score by strict assessors, to add at least some basic key progress indicators, like “we will have X commits per Y amount of time in Z github”, or “we will share screenshots of the dashboard as it’s in progress after 2-4 weeks of being funded” etc. These are simple things which can give the community trust that the progress will be auditable.\nI would also recommend being very specific with the measure for success, as this again needs to be clear to the community so that it is easy to say whether the proposal was completed successfully or not. In this case, I think that simply stating that success looks like the PoolPeek website having a dashboard which displays data regarding the holdings of stakepool owners would have been perfect. That being said, I still think this proposal merits a score of 5 here, as in reality it will be extremely easy to audit it at the end. Good luck!", "q2r": 5, "assessor": "z_assessor_2335", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3915, "q0": "The issue being the total pledge or holding of all the cardano stake pool operators are the metrics that people turn to for confidence in other blockchain. The proposal seeks to provide an overall total holding of cardano stake pool operators in order to educate and trust the larger cardano community. This will help people to trust cardano more thus helping cardano ecosystem. This can be scaled to add more stats about the cardano ecosystem\nThis proposal effectively addresses the issue", "q0r": 5, "q1": "The proposer has been adding features and tool for the cardano community for past 2 years therefore it can be said they have the relevant skill and experience to successfully implement the proposal. The proposal consist of a clear plan and with timeline. The budget of $4000 requested seems justified for the work needed to be done. The only risk of the proposal being not being funded. with all these it is very likely this proposal will be carried out successfully", "q1r": 5, "q2": "The proposer has given clear tasks to be implemented and only 2 months of worked is needed to implement the proposal. this proposal can be easily audited for the progress of the proposal. The success of the proposal is when Poolpeek website will be updated with this feature. the provided information is sufficient to audit the progress and the success of the proposal", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4219, "q0": "The proposal \"Poolpeek Stake Pool Pledge Tracker\" proposal addresses the dapps, product & integration challenge by gathering the total pledge/holding of all Cardano stake pool operators. Pledge is a widely discussed issue among SPOs as it shows the commitment of SPOs (their own ADAs as part of the stake pool). The higher amount of ADA pledged, the more reward the pool will receive. The team will provide graphs (updated every epochs) and twitter bot to tweet out the information regularly. They want to display this info on their poolpeek website. It fits the challenge in the sense that the feature will bring more transparency to the community. Pledge is one indicator of decentralization as it encourages decentralization and large operators control fewer pools with high pledge instead of many pools with low pledge. As Cardano promotes decentralization, having this info displayed will show that the ecosystem is transparent and fair in reward distribution which will drive more Cardano adoption that is a goal of this challenge.", "q0r": 5, "q1": "The project duration will take 2 months with month 1 gather database and month 2 on website updates. The budget will go towards poolpeek developers (although the name of pools are disclosed, it will be beneficial to voters if they could provide URL links or linkedin of pool operators). As they would come back for future funding round, I would suggest the team to look into the features that not only benefits the pool but to the wider community in Cardano. This will increase chance of getting funded also. The team could do budget breakdown in more detail as the community would have no idea what $4000 will be spent on. They need to supply more information on their profile and budget breakdown in order to improve this proposal. This will increase the community confidence that the project can be carried out successfully.", "q1r": 4, "q2": "The measure of success for this project is that the poolpeek website has been updated/populated with this pledge information regularly. Although they mention the service they provide for free for 2 years, it is part of running their own SPOs. This information should be provided to stake pool delegators anyway and hence, the team should try to supply the community with more information on the KPIs and how they plan to report back to the community once the project is carried out as plan. The score in the feasibility and auditability sections reflect that I appreciate their genuine intention but they need to improve on brushing up their proposal to make sure that the Cardano community appreciate in what they do and that we will support their causes.", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6455, "q0": "Tools are huge in the Cardano community. Especially right now. There are so many new projects building and lots of new SPOs trying to grow their stake. Poolpeek helps community members by providing information on all of the stake pools on Cardano. This includes lots of data. In this proposal, the proposal is suggesting implementing another feature that will help further education in the community. The more tools we can build on Cardano, the more involvement we will see. It is extremely important to build those tools right now because soon there are going to be so many dApps launching. It will be easier to have those tools built so that they can keep up with the traffic of the blockchain. I believe that this additional tool can help benefit the Cardano community by helping viewers to see the pledge of all pools and find the average pledge among all the pools to see how much Ada is coming from the SPOs. I see the important utility that can come from this proposal. For these reasons, I give this section of the proposal 5 stars. ", "q0r": 5, "q1": "The current experience from the team is easy to monitor. There is already a functioning product that has a lot of important information and tools that benefit the ecosystem. This is important because it shows that the team will likely be capable of implementing this proposal successfully if funded. Furthermore, the proposal provides a detailed roadmap that describes what will need to be done and the timeframe to do so. The timeframe of 2 months is specific and allow the team to be held accountable to those dates. There is also a detailed budget breakdown that mentions why they are requesting funds with this proposal and exactly where these funds would be allocated. In this case the $4000 would go to the developers that would implement this additional feature. With all of these different metrics, it promotes feasibility in the proposal and leads the readers to believe that this proposal will likely be implemented successfully and will bring further utility to many users of the blockchain. For these reasons, I give this section 5 stars.", "q1r": 5, "q2": "The information provided has been specific yet concise. This caused for an easy read and an understanding on what the proposal wants to achieve. There are different metrics that can help lead to a successful proposal. One thing that can be extremely important is transparency. The team should be open with the community while building. This will involve more people so that we can ensure that these funds would be utilized properly and that the additional feature would function properly. The second principle is accountability. If the team can provide details to the community, it will increase the likelihood of being successful because the community will hold the team accountable. This is important because the Poolpeek pledge tracker will be a beneficial addition to their dApp. This utility is something that the community would want to see which makes it an easy case when sharing with the community. For these reasons, I give this section 4 out of 5 stars. Once this additional step has been completed and there is a more specific measurement for accountability, this section can also receive a score of 5.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14032, "q0": "POOLPEEK is an application which is running for two years already, displaying a wide range of information about Cardano blockchain, being specialized in DeFi metrics and information. For Fund9 the team is aiming to implement a new functionality to their application that would consist on gather and verify the total pledge information of all stake pools during every epoch and show it up on POOLPEEK platform, which effectively addresses the challenge.\nThe idea of the team is to give publicity to this information, spreading this not only on their platform, but also on Twitter via the bot they have for such purpose, providing some important information to the community, helping on the task of choosing which pool to invest in, increasing the awareness on Cardano blockchain and DeFi.\nIn terms of risks, the only one mapped by the team was the lack of funding, not giving a way to mitigate it. I would like to see more risks mapped, what would show a better planning was made.\nI would suggest the team to provide more details about their solution in the next time. The contribution of this proposal is clear for me, but maybe it could not be for other assessors. What I mean is that besides having a good idea, it important to show it up in a proper way.\n", "q0r": 5, "q1": "The plan provided by the team seems feasible and reachable for the timeline proposed. However, it would be important to break the macro tasks into smaller ones in order to give a better idea on the amount of work that needs to be done, helping the assessors to understand the roadmap to be followed.\nOn the budget breakdown perspective, I could not actually identify the breakdown as it was not provided, only the total budget was mentioned in order to deliver the proposed plan. It would be important to have an idea on how much hours of coding would be needed for each task and also the rate to be paid per hour worked. This is the type of information I am expecting to see as an assessor who is thinking about the best destination for the funding.\nRegarding to the details of people working on the project there were informed two components who are part of PoolPeek team, what gives an idea about their capability as the application is up and running, but it would be good to have more information about their experience.\n", "q1r": 3, "q2": "The way the team sees the success of this project is to have PoolPeek website updated and running the new feature they are proposing. \nRegarding the tracking of indicators to measure the project progress the team has not elected any indicator, just mentioning their website is up and running for free on the last two years, which is awesome, but does not help much on measuring the project progress. A suggestion would be having 100% of pools with pledge mapped, for example, or even rank the top pledge pools and the opposite too, helping people in their decision process.\n", "q2r": 3, "assessor": "z_assessor_3872", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "We believe providing an overtime total holding of the cardano stake pool operators will bring a sense of education and trust to the wider cardano community. ", "experience": "Poolpeek has been operating for the past 2 years actively adding features and tool for the cardano community. "}