{"id": 421602, "author": "kennyt", "title": "Chatbot AI for Project Catalyst", "url": "https://cardano.ideascale.com/a/dtd/421602-48088", "category": 26595, "amount": 40124, "description": "The information involved in Project Catalyst is continuously updated and disseminated through many different channels and media, making it hard for users to find the neat info when needed.", "f6_no_assessments": 10, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 2569, "q0": "It is true that newcomers in Project Catalyst may have hard time to find information about its community, its governance and its funding process. This is the problem that this proposal tries to resolve by developing an AI chatbot for mobile phones. The idea looks feasible as this technology is not new and there are several chatbot solutions found in various support systems. The proposal is fully aligned with all goals of the challenge by providing clear answers for each KPI. Besides supporting only the Catalyst community, the AI chatbot has a lot of potential to extend its information base to the broader domain of the Cardano ecosystem.  The proposal has also identified two major risks and provided a plan with mitigation actions. As a conclusion, I strongly believe that this mobile app will have a positive impact in both Project Catalyst and Cardano including their communities.", "q0r": 5, "q1": "The development team consists of two people with strong background in software development and blockchain technology including experience in the Cardano ecosystem. Although the team is small I think the nature of building a mobile app does not need more resources. In contrast, small teams are more agile and fast to accomplish their tasks.\nThe proposal provides a very detailed and well defined plan for the current FUND9 and it also includes some bullet points about the next phase to be executed in a future funding. I would easily say that this project plan should be a reference point for other proposals.\nSimilarly the budget analysis can be used a reference too. It is clear, it is reasonable, it is consistent, it is broken down to several identifiable items and includes whatever is needed to understand the calculation of the costs.\nThe only missing item I would like to be included is an overview of the design and architecture of the software solution showing also how the bot will be trained to provide more information. However, I am absolutely sure that this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal provides everything that is required to track the progress of the project and the performance of the chatbot. It has added clear and well defined metrics based on the AppStore and PlayStore and metrics that the the bot will provide itself. The community will be able to track the progress by the use of Kanban boards, design documents, reports and Github commits. The success of the project and solution is also clearly specified and it leaves no doubts on the way it will be measured. The clarity and auditability of this project is guaranteed and it can be used as reference point for other proposals. Well done.", "q2r": 5, "assessor": "z_assessor_2322", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2596, "q0": "This proposal is about creating a mobile application - an AI chatbot aimed at quickly answering questions related to Project Catalyst. This is necessary because the information on catalyst is huge and constantly updated. When having this application, helps everyone including newbies learn about official catalyst information, quickly, with new updates, right in focus, making it easier to integrate more new people into our platform. Clearly, This proposal fits the challenge.\n", "q0r": 5, "q1": "There are two people working on the project, Cao Thinh and Darlington Wleh, which, according to the information listed, as well as the links provided by the proponent may identify them as experienced programmers, developers application developers, database analysts, they are all experienced with blockchain and knowledgeable about our blockchain platform. With such information can assess their project suitability. However, the proponent should provide information on what work they will undertake for this project, who is the project manager, who is the developer, who is the loser and database analyst, who will be in charge of the communication position,... to prove that the proponent understands, can categorize each position and the number of personnel needed for the project and they also say that there will be 2 more engineers participate in the project. however, they do not disclose who they are, what their professional experience is, what position they take on this project. implementation plan proposed by the proponent will be divided into 2 phases and this proposal is for phase 1 of the project. It is expected to roll out in 5 months. they have specific work to achieve for each month, I think this plan is enough to be able to implement the project if they only do this project. however as the information i read about the proponent he has 2 more projects. I advised him to provide a reasonable time allocation plan for all 3 projects to better clarify the possibility of successful implementation of this proposal. Finally on the budget, the proponent provides a fairly detailed list of the tasks and the hours worked for each of them. normally it would be sufficient to assess the feasibility of the requested budget. however with this project I see the item \"Cost to hire 1 person to update the database for 1 year\" I don't know if I missed any information? as the implementation plan for this proposal is phase 1 it will be implemented in 5 months, it is clearly contradictory. Besides, the job of creating a chatbot to update this data I think is quite easy. I am a telegram community manager with nearly 300 members, I don't have much experience in programming, but I also use the chatbot \"rose\" to continuously update information about catalyst as well. like Cardano information for the community and I know many other groups that have also used this type of chatbot. Moreover, for programming and application building jobs, 50 dollars for 1 hour of work I think is reasonable. other tasks such as data collection, analysis, team management or marketing are simple tasks that the proponent also charges $50 for an hour of work which is not reasonable. From the reasons given I disagree with this proposal.", "q1r": 2, "q2": "As mentioned in the feasibility, the proponent provided the month-by-month timelines and corresponding results achieved. The progress of the project will be tracked through the Kanban management method in Trello. The recommendation's KPI is determined by the number of downloads on the AppStore and Playstore, and the star rating on that. The above information can be targeted for measurement. but I want the proponent to clarify how this information reaches the Cardano community, they will have a monthly report provided on the group's media pages or catalyst chat groups. Will they report monthly to the IOG coordinators? About project success definition is a chatbot mobile application available in Appstore and Playstore. Ideally, the chatbot is frequently used and appreciated by users. Users will have a good experience and benefit from chatbot responses. In short, the auditability of this project is there, however it can be further improved. so I rate it 4 stars for the auditability of this project.", "q2r": 4, "assessor": "z_assessor_2323", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2674, "q0": "The point of the proposal is that the information related to Project Catalyst is constantly being updated. Making it hard for users to find the latest information when they need it.\nThe proposed solution is to Build a \"Chatbot-AI\" that can quickly answer most Project Catalyst related questions when the user needs it. The project's product is a Chatbot-AI that will be applied on smartphones such as iOS and Android, which is very convenient for users. Chatbots can answer frequently asked questions and provide Project Catalyst-related information (such as proposal name, proponent, voting, and funding...). It has the following benefits: Saving time and effort; Reliable information; Provide principles;\n\nIn addition, the proposal describes how the solution will solve the Challenge such as:\n-Increasing the number of dApps and products available to the community -> Chatbot is a free mobile application.\n-Increasing the number of integrations that bring together existing solutions -> Chatbots will bring these pieces of information together in one place where people can instantly query the information they need.\n\nThe proposal also introduces two risks:\n- \"Understand the user intent behind the question\". The solution is to deploy the most modern natural language processing AI algorithm.\n- \"The chatbot's database needs to be updated regularly\" they will hire a person responsible for updating the database. With these risks, they have solutions to reduce risks. The proposed team can consider the risk that the number of users is small because they are afraid to download a new software to the phone. The team can develop bots on tellegram, or other popular platforms. I appreciate this project.", "q0r": 5, "q1": "The project roadmap consists of two phases. With this proposal, phase 1 will be implemented in 5 months. The roadmap built for each month is as clear as:\n- First month: build landing page; Design the main functions and user interface of the chatbot; Collect data related to Project Catalyst.\n- Second month: Processing of collected data; Build a chatbot database.\n- Third month: Training AI models; Evaluate chatbot responses.\n- Fourth month: Build iOS and Android apps; Run tests with a small group of users\n- Fifth month: Modifications based on feedback after testing; Application marketing and advertising; Launch the official app.\n* Phase 2 will apply for funding at Fund10\n\nWith a roadmap like this, I value the team with good expertise in software, AI and information technology products.\n\nRegarding the budget, the Group also detailed each item including 3 main parts: Development Cost: $36000; Infrastructure and Deployment Costs (Total $3124) and Redundancy: $1000. The cost details are quite reasonable. Particularly for the AWS Infrastructure for development and testing: $3000 the team needs to be more specific such as how many months to test, how many months to run for the community to use, when the funding runs out, can it continue to be used by the community? use anymore?\nThe capacity of the team consists of 2 members, they are experts in AI, and computer science and have a lot of experience in Blockchain, and Cardano. They all have Linkedin that checks for credentials. I am confident that the team will be successful when funded.", "q1r": 5, "q2": "The team provides very specific and measurable metrics. Metrics during project development such as Number of \"completed\" tasks (we will use the Kanban management method in Trello); Number of design documents and reports; Amount of Github committed (we will use CI/CD to ensure the quality of our code); Number of unit tests. At the same time, they also give other indicators after the project is completed and put into operation such as: Total downloads on AppStore and Playstore > 500; Star rating on AppStore and PlayStore above 4.5, and other metrics.\nThe success of the project is a chatbot mobile application available on the Appstore and Playstore.\nI strongly agree with this item.", "q2r": 5, "assessor": "z_assessor_2331", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 4411, "q0": "The idea of ​​the proposal is very practical and can be applied to life to bring efficiency and convenience to the community - those who are interested in Project Catalyst. This proposal correctly addresses the goal set out in the Challenge: \"Dapps, Products & Integrations\". I found the team's proposal very interesting. The problem to be solved here is that information related to Project Catalyst is constantly being updated and disseminated through various channels and media, making it difficult for users to find information neatly when needed... This proposal was created to solve an existing problem by building an AI chatbot that can quickly answer most Project Catalyst-related questions when asked by users. This is great because this is a problem that almost no one can do at Project Catalyst right now. While many people want to find concise quality information about Project Catalyst among the many different sources of information, this proposal serves as the key bearer (chatbot) to open the door to the best information. for community. Thereby helping to add value to the Cardano ecosystem (if it succeeds) and fully scaling and solving future challenges (quality information will bring a lot of opportunities for the community to there are ideas and proposals in all aspects of society - understood in a macro-expansion sense). Not only me but the whole Cardano community, Project Catalyst is looking forward to it. I hope in this proposal and wish it to become a reality as soon as possible. With such impact when I completely agree - vote 5 stars.", "q0r": 5, "q1": "I found that the author and team have extensive experience in computer science, data analysis, web, software engineering, etc... The team also provided sufficient reasoning to explain the related problem. regarding the proposal. The team has disclosed the identities of all team members via the Linked social network link. I strongly support this public disclosure, because it will be convenient for the community to look up the members' identities and verify the feasibility of the proposal. It is very commendable that the team has been clear and very specific about the detailed list of members (not all proposals will work). The number of core members in the team as I understand it is 2 people, these are the key members, and the team may also have other collaborators that have not been identified.\nThe budget is divided into sub-sections (the work to be done) and is reasonable with the goal. The team lists in detail the key milestones in the important work to be done, which clearly shows professionalism. However, as a PA - I am very pleased with this listing, the community can look at it and feel more confident about the feasibility of the proposal. The fact that the team presents the budget in such a clear and detailed way makes it completely understandable to newcomers in the community. That's how I feel about the budget breakdown. The method of calculating the team's wages is calculated by working hours - this is consistent with the calculation of wages of large companies and corporations in the world today - it brings accuracy and outstanding efficiency. . Also, I have the additional question that if Fund 9 has not been funded by Catalyst, will the team continue to work on this proposal? And what other sources of funding does the team have to be able to implement this proposal (from contacting support from other organizations)? I want to know the clear feasibility of the budget so I ask 2 such questions.\nThe plan and implementation method have been fully and professionally stated by the team. This is one of the points in the proposal that impressed me the most (one of the key factors in clearly defining its feasibility).\nWith the necessary resources for implementation, I would like to divide it into two main resources: financial resources (mentioned in the above budget) and human resources. With the current 2 key members, with professionalism and good expertise, I am confident that the proposal will be successfully implemented (although as the team shares and explains it is a member of the team that is currently working on the project). made another proposal at Fund 9 - but this did not detract from the work of this proposal).\nIn terms of technique, technology and language used when implementing the proposal. This is a collection of high-tech technologies: Chatbot related to AI applications on iOS, Android platforms, cloud system software engineering, Cardano blockchain, etc... It is mainly implemented by 2 people with a lot of experience and expertise in information technology market. That is the basis for me to believe that the team will do a good job when implementing the technical aspect of the proposal implementation.\nThe team is also pretty clear about the risks involved in implementing this recommendation: Understanding the user intent behind their question; The chatbot's database needs to be updated regularly to keep up with the latest Project Catalyst information - accompanied by two solutions to prevent these two risks. I add a third risk which is Ada's slippage - which will affect the budget. We know that the digital currency market is in a downtrend phase (the price movement in the downward direction of digital currencies happens every day), so Ada may lose value when the team receives Catalyst funds, then the team will face the problem of lack of budget to implement the proposal. So my advice is that the team consider the detailed budget related to Ada's slippage to make the budget request accordingly.\nHere are the questions, and my positive advice, that the team can consider improving this proposal. I strongly agree with the feasibility of the proposal. I vote 5 stars.", "q1r": 5, "q2": "Through the proposal, I see the team's progress and clear milestones. What I am very satisfied with is that the team has attached the milestones that need to be done in combination with the small jobs that contribute to the big work. It also demonstrates the team's interest in the proposal milestone roadmap. I only regret one thing if these milestones were tied to specific months of the year (January, February - this is just an example) it would be even better. Because it makes it extremely easy for the community to assess work progress, and demonstrate the transparency and auditability of the proposal. Having such a detailed roadmap is very helpful for newcomers to the community - they can easily read what the team needs to do at the milestones.\nThe team presented performance indicators (KPIs) and key metrics. The KPI that the team gives is specified in numbers: Downloads on AppStore and Playstore > 500; Star rating on AppStore and PlayStore above 4.5. With key metrics being the number of interactions that the chatbot has weekly; Chatbot response time, etc... We all know the role of KPIs and key metrics in auditing. This makes it much easier for the community to evaluate and audit the proposal. KPIs and key metrics play an important role in proving the transparency and auditability of the proposal. Therefore, I am very satisfied with the KPIs and key metrics that the team has come up with. Having these two indicators in the proposal will greatly improve the transparency and auditability of the proposal.\nOn the other hand, the team stated what success is, it's simply a chatbot mobile application available in Appstore and Playstore - Very practical. I agree with this definition of success. Throughout the proposal is a clear and understandable description of the problems, along with a clear solution of the problem - the team made a strong effort to identify the problem and provide a solution to solve the problem. subject.\nHere are some of my positive comments to build more transparency and auditability of the proposal. Regarding the auditability of the proposal, I strongly agree - vote 5 stars.", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6457, "q0": "I love this idea. Being a part of project catalyst, I know what it is like trying to find information. For example, I have been looking for the overall scores/approvals for Fund 8 and it took me a while to find. This could become a proposal that will help improve the organization of Project Catalyst and will help all users to find what they are looking for. Most of the time that would be in search of educational content which is extremely important to the Cardano ecosystem. The team plans to address the challenge by providing a AI Chatbot where users can search what they are looking for, and the chatbot will help guide them to the right area to find the information. This would create a simple solution to a growing problem. The proposal states how Project Catalyst continues to grow, and the longer we go without a tool to organize all the data. It may become harder to implement as time progresses. For these reasons, I give this section of the proposal 5 stars.", "q0r": 5, "q1": "When looking into the experience of the proposer. I was glad to see that there was a link to the linkedin profile of the team members. This helps allow for readers of the proposals to trust that the team will more likely implement this proposal successfully because they will then be held accountable if they receive funding. When looking into the proposal. There is a great section based on the detailed roadmap. It was important to read that there is a specific timeline of 5 months and details on each month. There is also a detailed budget breakdown that articulates exactly where the requested funds would be allocated. The responses in these sections are very concise and straight to the point. In terms of feasibility, this proposal has included a great deal of information that will help lead to the likelihood of success for this proposal. For these reasons, I give this section 5 stars.", "q1r": 5, "q2": "I was impressed with the amount of information that applies to their proposal. It is obvious that thought and time has been put into this proposal. This suggests that the team is passionate on building this product and ensuring that it will be a benefit to the Cardano ecosystem. When looking into a good proposal. There are typically two concepts that help gauge the potential success of the proposal. The first principle is transparency. Without transparency from the team. It can be hard to monitor how likely this proposal will be implemented. However, when the team provides a lot of information and keeps the community updated on accomplishments and potential changes, there is more room for trust and accountability. Accountability is the second principle that plays a similar part as transparency. Once there is trust built within the team and the community. There can be a positive form of accountability where the community will keep the team on top of things. They will help ensure that the proposal is progressing and that it will be successful. For these reasons, I give this section 5 stars. I believe this AI Chatbot can bring a lot of utility to the ecosystem and will help all users navigate and become familiar with Project Catalyst.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9719, "q0": "The proposal clearly describes a problem and presents a solution that aligns well with the challenge. The proposal’s idea is to build a chatbot AI to promptly answer Project Catalyst related questions will create a more seamless experience for users, thus adding more value to the Cardano ecosystem as a whole. As a first-time community advisor/proposal assessor in the last fund, I found it difficult to find answers to the questions I had regarding assessing proposals. Asking questions on discord usually had no reply or lengthy wait times and it usually resulted in me going through proposals unequipped with the necessary knowledge. I believe that the project which this proposal is aiming to achieve will increase the quality of Project Catalyst and assist new users – therefore driving growth and increasing adoption. The proposal clearly and suitably presents key metrics and goals that are in line with the outlined challenge settings. They also sufficiently provide information on the relevant challenges and risks that their team may face in the process and show clarity on how they plan to mitigate them. Giving reassurance of their ability to forward think, problem solve and handle risk. The team articulates a plan for their project's future sustainability by adding more features such as voice support, localizing to different languages and adding state-aware functions.", "q0r": 5, "q1": "The proposal provides adequate information showing the necessary skills and experience of the team members. The team appear to be competent to undertake the work required for successful implementation. The proposer also supports this by providing relevant Linkedin links of the team that showcase their capabilities. It is also adherent through the information presented that they understand, in an identifiable manner, the type and number of team members required to implement the proposal. The budget is outlined well and broken down into identifiable items. The proposer clearly presents how working hours for the appropriate items were calculated and grouped related items in the budget. There is sureness in the financial stability of the project as they had allocated funds for contingency. This also indicates that they will be better positioned for any uncertainty inherent in cost and time estimates and/or any unpredictable financial risk. With the information provided the budget seems reasonable to achieve set goals. The team has also provided a verifiable plan for phase 2 of their project and will be looking into further funding in the next funding round of Project Catalyst. In this regard, it shows the team's drive to provide a high-quality product for the Cardano community. The proposal provides a realistic timetable to complete the work. The roadmap is detailed and very well prepared, providing clarity on the project’s timeline and milestones/deliverables. The team offers a practical plan for implementation with information on sufficient details on what is being done. There is assurance that the team understands the necessary resources needed as information has been provided on how the team will manage the workload of the project. The proposer has considered the challenges that they will encounter through the process and has effectively provided how the team plans to mitigate them. The team's ability to foresee future challenges and to have a solution in place before they happen indicates that they are proactive and can anticipate the right way to carry out a task or reach a specific goal. ", "q1r": 5, "q2": "The team provides clear and detailed information on what success would look like. Furthermore, the proposal has a clear understandable description of the targeted problem that can be measured against the proposed outcome. The roadmap is very well designed - The milestones and deliverables were informative with a clear time horizon for achievement, making it easy to track progress. The metrics and KPIs of the proposal were chosen well and are suitable indicators for defining success as they effectively measure the team's progress, the number of users and the satisfaction of users. A feature of the team’s project is that users, through asking questions via the Chatbot, have an accessible channel to directly receive regular updates to audit the progress of the proposal. Overall, the proposal provided excellent auditability.", "q2r": 5, "assessor": "z_assessor_3086", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9883, "q0": "The Project Catalyst platform is growing rapidly and things are constantly changing, so even those with experience, apart from new entrants, may have a hard time keeping up with things. Even if everything does not progress that fast, it can be challenging to reach some information. The proposal aims to solve the difficulties while accessing information within Catalyst network with a chatbot they will create. The chat bot they will create will allow people to quickly access information by answering their questions. I think this project has the potential to be very beneficial for everyone because accessing certain information can be very time consuming, people can both cool off from the things they want to do and use this time more efficiently. In addition, this project will be usable by everyone, as well as a new one for integrations that improve the user experience within the Project Catalyst.\nThe only thing I've seen negative up to this point has been they stated that the bot database should be updated regularly and they would hire someone for it. \nI think essential part and key of sustainable success  of the project is to keep the bot database up-to-date and to provide the users with the correct answer. For this reason, I think there should be more than one person dealing with this issue instead of one person.\nI find this proposal effectively adresses the challange in general but I find the approaches and solutions to the problems that may be experienced in the project as under-thought. That's why I give 4 stars\n\n\n", "q0r": 4, "q1": "2 people will do the project, considering the skills they have, I consider the project as feasible. Cao Thinh is a developer and experienced in coding, data anylysis and databases. Darlington Wleh is experienced in blockchain and Cardano ecosystem. We can access information about them from the linkedin profiles they share. The budget they specified for the project seems appropriate. They set a working wage of $50 an hour. The working hours they specified to complete the project seem appropriate. Other expenses they specify for AWS and app stores are eligible for the project.", "q1r": 5, "q2": "They have specified the milestones of the project nicely. Milestones seem suitable for the implementation of the project. They specified the technical steps of the project and also a timeline for testing and marketing. But there are some problems though the methods they have stated to monitor the progress of the proposal do not seem sufficient, although I like the other parts of the project, this part seems not very well planned. They stated that their code can be followed on github, but where is the git repository where we can check the progress of development ?\nThey mostly talked about the control methods they will do after finishing the project. For example total downloads, star ratings and chat bot user related services. I'd suggest them to prepare more detailed/planned auditing for the proposal.\n", "q2r": 3, "assessor": "z_assessor_3125", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12641, "q0": "All major platforms today have chatbots to support users, which is key to making it easier for users to access and use the platform. And that can also be implemented on Project Catalyst, This project aims to create an AI chatbot that specializes in answering user queries that has met the challenge requirement.\nThe problem you raise is quite understandable that users are often overwhelmed because the amount of information is quite large and the information is updated and disseminated through many different channels, the chatbot will synthesize and provide accurate information. for users. But I don't understand how you can optimize the accuracy of the information, how you aggregate the information and the information sources that the chatbot uses. I wish you would have made this part more specific because the project has a very clear impact, which will increase the number of people participating in the platform and grow the community and increase the richness of Catalyst.\nThe chatbot's database needs to be updated regularly, the intention of the solution you give is not clear, it seems that you are still in the process of completion, with such a huge amount of data, I think your solution is hiring a the person responsible for updating the database is not very feasible, because the risk of accuracy is very high, some types of data may be automatically updated by bots, you should highly recommend this part of the recommendation because Accurate data entry is most important for chatbots.", "q0r": 4, "q1": "The route you provided has the necessary information I would expect, hours and working days are reasonable but you should systematize your route more clearly by breaking down specific timelines realistic and realistic, the goals to be achieved in each timeline and the people who will be involved in each activity. The development of this project should be specified in a clear time frame, I believe it will take a long time to implement it, but more details will help CA, vCA and voters have a more solid view of the process.\nI don't understand how you calculate the budget by adding all the hours worked together and multiplying by $50 an hour, I think the people involved in the development will have different rates for their work, or you have probably also calculated the average salary, you should make it clear. The budget section I found the information to be adequate, but not to the extent that satisfied me. You should clarify this whole section.\nWhat makes me most likely is that the team is very experienced in relation to the development of this project, and all the background information of the team members is provided very clearly.", "q1r": 4, "q2": "Indicators and KPIs to measure project progress and success are given to me as reasonable and I will not mention too much in this section. I would like a better solution so that the community can track the entire project progress instead of just being able to see user opinions and satisfaction through surveys on Google form. .I recommend you systematize this information on an official website with enough pictures and videos of activities like many projects have done. This helps the team work closely with the community and easily receive support.", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 12856, "q0": "I fully support this project and I set 5 stars because of the following reasons.\nThe problem that the author faced is the same problem that I faced when I first joined Project Catalyst. I have had a lot of trouble finding and managing the Project Catalyst information.\nI had wished that if I could have had such tools as this chatbot, the management of such information would have been better for me. I'm sure this is a great project. Newcomers can ask to know more about Project Catalyst just by questioning the chatbot. People with good ideas can also use this Chatbot to reference similar ideas in the past. So they can form their proposal quicker (e.g they will know more about how to plan their ideas, budgets to consider, timeline, etc). Also, answering a simple question as “what is the plan of Fund 10?”, also brings a lot of benefits to users who want to get information as quickly as possible.", "q0r": 5, "q1": "I have to say that I do have any worries about the feasibility of this proposal. The team is a perfect combination. They are experienced, and strong engineers and have the perfect skill set to deliver this proposal. One of them has a doctorate degree in AI, and currently working as a senior Data Scientist. The other is Darlington, founder of LIdonation. Everyone joining Catalyst must have to know Darlington for his phenomenal website. By looking at Lidonation, we can see how Darlington knows to process the information of Project Catalyst. This team combination is a perfect match and I am 100% sure that this project is absolutely deliverable. The budget for this project is also very well allocated and explained in detail. I think that the budget would be even bigger comparing the workload that the authors have to deal with. The authors separate the development into 2 phases, which is very appropriate. If there's something that I need to add, I would like to see a bit more detailed plan for Phase 2. This is not so a problem since this proposal is only for Phase 1. I believe that the authors will be back to ask for funds for the next Phase in later Funds.", "q1r": 5, "q2": "Based on the metrics that the authors provide, the Cardano community can completely track and monitor this proposal. The KPIs are all based on the number of downloads, and rating on Appstore and Playstore, which is objective metrics. I understand that in Phase 1, the authors seem to want to focus on processing data, as well as building algorithms for training the chatbot. The authors seem not to focus on increasing the scale of the chatbot in this phase. I totally agree with that. Thus, I think KPIs that the authors set in this Phase are reasonable. If something that I would like to include in the KPIs, it should be the satisfaction of surveyed users. Since the authors included it in the measurable indicators, I find it better to be included in the KPIs. ", "q2r": 5, "assessor": "z_assessor_3494", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 13804, "q0": "The proposal is about an AI-based app for anyone outside or within the Project Catalyst communities to find information involved in Project Catalyst. \nIn my opinion, this proposal can perfectly address the challenge because since it would make it easier for anyone, especially a new user to assess the information about Project Catalyst in a more effective way in terms of time and a more convenient way in terms of any-time approach. . I also completely concur with the proposal's assertion that one of the major hazards is the information's obsolescence and the best way to gather, organize, and update it. This risk mitigation strategy also has a logical solution.\nThose are reasons why I am giving 5 stars to this proposal \n", "q0r": 5, "q1": "The proposal goes into great depth on the size of the team, the backgrounds and experiences of each member, and the schedule for development. The budget needed to bring the product to the market is divided up into identifiable items.\nHowever, it would be preferable if the proposer included additional details regarding the tasks assigned to each team member in order to carry out the plan. Even though the 2 main members are experienced IT engineers; the proposal might be more convincing if crucial technical element such as architecture and technologies are illustrated to more easily determine the feasibility of the plan.\nThose recommendations are minor, so I am giving 5 stars to this proposal.\n", "q1r": 5, "q2": "The proposal provides quantifiable KPIs and indications that are easy to understand for gauging the proposal's success. These measurements match the challenge setting. Additionally, the proposal includes detailed guidelines for monitoring development progress and public evaluation. But no mention is made of a publicly available channel for providing the community with regular updates on the auditing process. I would thus advise using a public method to inform the public of this update, such as making frequent announcements that increase voter confidence.\n\nBut this is minor, as a result, I am giving 5 stars to this proposal.\n", "q2r": 5, "assessor": "z_assessor_3832", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Building an AI chatbot that could promptly answer most of the Project Catalyst-related questions when users ask.\nExamples:\n• \"How many DAO proposals are there?\"\n• \"When are proposal drafts due?\"", "experience": "Cao:\nPh.D. holder in Computer Science. Skilled in data analysis, databases, networking, web and application development.\nDarlington:\nCo-dreamer at Lidonation & developer behind Lido's catalyst research tool with 14+ years of software and cloud system engineering experience."}