{"id": 421737, "author": "catalystswarm", "title": "SwarmLabs - Treasury Systems", "url": "https://cardano.ideascale.com/a/dtd/421737-48088", "category": 26595, "amount": 66100, "description": "There is a lack of tools and services which allows project to establish fully transparent and accessible treasury & account systems", "f6_no_assessments": 5, "f6_rating": 4.933333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1483, "q0": "The collaboration between four successful teams to provide a treasury system provides a unique solution for funded projects looking to increase auditability. Additional benefits of this project include budget management, transparency and the filing of monthly reports. Integration with Discord, DeWork and GitHub facilitate a managed workload and a seamless user experience. Strategic goals from fund 9 including increased adoption rates, integration of open source projects and development of tools on Cardano offer significant impacts and clearly align with the missions of Cardano and this particular challenge setting.", "q0r": 5, "q1": "When assessing feasibility, team strength and the history of past deliverables are the two most important metrics. This project has that and more! Catalyst Swarm, Aim, The Treasury Guild and Fluid 7 all have a verified history of success, and 60% of the activities identified on the roadmap have already been achieved. Many Project Assessors use the tools created by AIM on a regular basis, and the tool kit developed by Swarm also has a high usage rate. All metrics align to point in the direction of maximizing the likelihood for success.", "q1r": 5, "q2": "KPIs are similarly the most important metrics to use in determining whether or not a given project can be audited to verify incremental progress that leads to successful implementation. In this case, development can be tracked through Discord and DeWork, with Github submissions also available for transparent investigation of the progress being made. Transparency and sufficient measurable metrics clearly demonstrate that this project is highly auditable and all progress can be verified. Adherence to the roadmap timelines provide another layer of accountability to a very thorough system in which to conduct metric analysis. ", "q2r": 5, "assessor": "z_assessor_2252", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 1565, "q0": "The impact section of the proposal manages to explain really well why it is important and what benefits this proposal has: 1) To facilitate DeWork tasks\n2) To enable full transparency for proposers in funded projects without much of a hassle and having to put in aditional time, money and work that eats away from funding and time.\n3) To provide a general usecase to onboarding transparent payment data onto the blockchain\nand much, much more....\nIn my opinion it fits well ti the challenge as it will basically affect all future funden projects on catalys positively and increase the trust in the whole process by transparency as well as it halp with scalability of future projects by reducing work effort for every single proposer.", "q0r": 5, "q1": "Yup, definetely. Half of the work is already done (and I have personally experienced that it works since I have already taken part in a DeWork task since then). The team has a detailed implementation plan, consists of several competent, commited and active groups within the Catalyst community, has disclosed who works on the proposal and has made a detailed budget that exactly explains where the budget will be going to. They have also discussed associated risks and set up a contingency plan. This proposal is perfectly feasible and deserves the funding needed, as the impact compared to the funding will be huge.", "q1r": 5, "q2": "I'm normally not so much for copy paste, but in this case, you can very easily convince yourselves about the efforts the proposers put into auditability here on various sites: \nThe Project Management & development will be tracked via Dework & Discord Integration on the Catalyst Swarm Discord & Dework Server\nDework: https://app.dework.xyz/i/0m6XgGE7wrVTyzZcV2Q6oR \nDiscord: https://discord.gg/tU9umVcQNe \n\nAll transactions & payments are fully tracked and documented via the Treasury Guilds Treasury & accounting system on Discord, Github and Gitbook.\nDiscord: https://discord.com/channels/832894680290951179/973497013519925278\nGithub: https://github.com/treasuryguild  \nSwarm Gitbook: https://treasury-guild.gitbook.io/catalyst-swarm/ \nOther Gitbooks - https://treasuryguild.github.io/Gitbook/  \n\nDeveloped Tools & Projects are open sourced and accessible via\nhttps://github.com/treasuryguild \nhttps://gitlab.com/swarmlab2 \n\nThat being said, the problem and solution description are also quite clear and the several usecases and success criteria give more than enough grounds for auditability.", "q2r": 5, "assessor": "z_assessor_2257", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 2106, "q0": "First, let me start by saying that I like the idea of ​​the proposal. The problem is that with the development of more and more projects on Catalyst, it is difficult and time-consuming to set up a transparent budgeting & accounting system and there is no time and focus on the development of those systems. It can be seen that this is a pretty important topic for Cardano's success to acquire skilled developers, this proposal positively affects the development of Cardano. The solution was to develop tools and systems that provide fully transparent accounting and treasury management for projects, built on the Cardano & Catalyst Ecosystem. together with the Catalyst Swarm & The Treasury Guild, we develop the first tools & suits, platforms, and services for the Cardano Community which help to build strong and transparent auditable, Treasury and Accounting processes. This proposal's problem and solution statement is presented simply and clearly, and it is agreed that the proposal effectively addresses the challenge. Guild & SwarmLabs funds build and develop products from the Community, for the community. At the heart of this proposal and on building Accountability and trust between Projects & Communities and aligned with the goals of this challenge:\n-Increasing the number of dapps and products available for the community to use helps enrich the ecosystem with new use cases\n-Increased number of integrations bringing existing solutions together for a more seamless and connected experience between disparate products\n-Enhance the quality of existing products and integrations through suggested improvements supported by customer feedback or increased usage", "q0r": 5, "q1": "This project has been in operation since the fourth quarter of 2022 and has so far accomplished certain goals that we can fully track based on the links that the proposal provides. Since the proposed work has already been done, I take it as an answer that the proposal will be successfully implemented. It's great that the proposal provided enough information so that we can understand more from the scale to the roadmap, the team as well as the major partners behind this project. Regarding the roadmap, the proposal provides a detailed plan for the 3rd & 4th quarters of -2022 so we have a very clear view of the project's process. Next is the budget, $66,100 was requested and also explained clearly and convincingly. We understand what the money will be used for in great detail. And finally, about the team, the recommended team is also very well described, we know who they are, what their experience is, and what role they play in this proposal, through each member's LinkedIn page, the more I strengthen my faith in the group. Without a doubt, with the experience and plan presented, I am confident that it is very likely that this proposal will be successfully implemented.", "q1r": 5, "q2": "Yes, the proposal provides enough evidence to audit its progress and success. The community can completely follow the project based on the links that the group has provided. This way the testability is done well, and there is enough detail to understand how things are going and how we can monitor them. It is impressive that such a large amount of work has been initiated, and beyond the scope of the funds required for this proposal. A very detailed scheme is presented, the proponents are very transparent about themselves and the requested funds are very low, which clearly shows the honest motivation of the proponent\nThe success of the project is so clearly defined it is the progressive development of our Treasury & Accounting products & services, the successful integration of our tools with the Projects Catalyst & Cardano communities, and the set up of a SwarmLabs environment that allows developers to collaborate on the Projects that are best for them while being rewarded and paid for the interaction and time invested. The project is very well established, I highly appreciate this project, and I hope to receive a lot of support from the community so that the project can be approved and put into practice soon.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7430, "q0": "The project develops a treasury system and provides fully transparent accounting solutions for projects built on the Cardano ecosystem. Make it easier for projects to report their finances and progress when funded. Therefore this proposal is a perfect fit for the Challenge\nThe developers, builders, and teams on Catalyst are really messed up about financials and reporting. Since they are really not good at that, they always focus on their expertise. This tool, if successful, will be like a breath of fresh air for the entire Catalyst community\nI was really impressed with the previously built toolset, which includes 7 seamless workflows that help build robust accounting, treasury, and audit workflows. As for the audit, I really don't understand how the project evaluates the activities of the projects correctly when all the projects are spread in many areas and many aspects. Not to mention whether the completed result report is really accurate or not. The project please clarify this, and help the community understand more deeply about the project.\nAs for the risk, the project fears that no one will use these tools and has a mitigation plan for that. In addition to promoting the community, I have a few suggestions as follows, take the initiative from small projects to large projects completely free, give them results, and help with their reporting process. Accurate, fast, and transparent.\nAs for the impact, the project is very detailed, I rate it 5 points\n", "q0r": 5, "q1": "The project is expected to last for 2 quarters of 2022, with 12 specific items listed. The project should clearly state how the processes are implemented. For example, in the steps of developing treasury and accounting tools, automating processes, and creating dashboards. Thereby helping the community to more accurately assess the development of the project.\nAlso, does the project plan to make different types of reports? For example, spreadsheets, columns, business tables, diagrams, analysis tables, etc. It is suitable for many audiences, easy to provide services, and projects can report progress in many ways differently. As for the detailed budget, the full project listing, all estimated by hours, is very intuitive. With a total application budget of $66,100 accounting for 0.8% of the entire Challenge, a fairly reasonable number to implement\nThe team consists of 2 main members and 4 support members. With 2 social network links provided, you have a lot of experience in the development of treasury automation, and treasury accounting, which is very suitable for project development. I appreciate this. Despite spending all their time on Catalyst, do members participate in other projects in this fund? So how do you arrange your schedule to get the job done well? Please describe specifically for the community to evaluate.\nI trust the feasibility of the project. 5 points for this part\n", "q1r": 5, "q2": "You have a lot of links, and social networks to deliver and report on progress. I appreciate this transparency. However, you should list specific indicators for the community to rely on to review the progress of the operation. For example, project structure, number of tools, content, and number of promotional videos, projects in progress... All metrics are intuitive and easy to quantify\nThe success of the project strengthens the core of Catalyst, giving developers a great experience in treasury and audit product services, and professional, accurate progress reporting.\nIt's a bit lacking in the project progress list, so I rate this part 4 points\n", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7570, "q0": "This proposal effectively solves the challenge that the lack of tools and services that allow the project to establish a fully transparent and accessible system of accounts and funds is an issue that needs to be addressed or challenge this. This is a great problem that can scale and solve future challenges. The solution is clearly defined by the author by developing Tools and systems that provide fully transparent accounting and treasury management for Team Projects built on top of the Cardano & Catalyst Ecosystem. The author has measured the possible risks of no one using the team's tools and a lack of feedback on the tools the team has developed.", "q0r": 5, "q1": "This proposal has been clearly defined by the author with important milestones, and the timeline given by the author is completely reasonable to proceed with the project's process. The fourth quarter of 2021, the first quarter of 2022 and the second quarter of 2022 have been implemented by the author and successfully completed the proposed roadmaps. Currently, the team is completing the remaining roadmaps of the 3rd and 4th quarters of 2022. The goals for the progress of the project are listed in detail and clearly by the author. The project's progress is easily checkable by followers through the group's attachment pages, which makes it easier for the community to follow. The success is clearly described by the author by integrating the proposal's tools with other Catalyst & Cardano Community Projects and establishing a SwarmLabs environment that allows developers to collaborate on the Projects that are best suited for the project while being rewarded and paid for the interaction and time invested. The success of this proposal is entirely related to the challenge of the campaign it is to create sustainability for the core team and growth by establishing enough relationships with customers. The solution to this challenge is to fundraise Guild & SwarmLabs to build and develops products from the Community. The main issue of this proposal is to build accountability and trust between projects and communities. The author considers the treasury and accounting project to be a great product that provides an effective and necessary solution for the project.", "q1r": 5, "q2": "KPIs are clearly defined, information is provided for audit, and they also provide the necessary metrics to measure project success. As for the metrics that the team has provided this project promises transparency, which is great for the community as they can audit it at any time during the entire project phase. This is a good project I think if funded the project will be successful. This is a powerful group with all members having their own specialties. The author has detailed each job that they are currently doing it very clearly and in detail. The group consists of the following members: André Diamond, Miroslav Rajh, Felix Weber, Tevo Saks, Phil K, Jonathan Adjei. The research team has presented well in their competence I believe that success is just the destination. The funding budget is $66,100 less than 20% of the entire challenge's budget. The budget is divided into reasonable small amounts, the author has allocated a very detailed budget that will increase the reliability of the proposal.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We develop Tools and systems which provides  fully transparent treasury & accounting management for Projects, building on the Cardano & Catalyst Ecosystem", "experience": "This Proposal is a collaboration between Catalyst Swarm, Treasury Guild, AIM & Fluid7.\nWe are an assembly of highly committed, engaged and experienced Catalyst & Cardano Community members, working on solutions to build a strong Community infrastructure"}