{"id": 421797, "author": "astroboysoup", "title": "CardanoPress: NFT Gated Content", "url": "https://cardano.ideascale.com/a/dtd/421797-48088", "category": 26595, "amount": 12000, "description": "We are seeing NFTs come out with more and more utility making them more desirable. One such use case is gated content on websites. We want to make this easy for any project that wants this use case.", "f6_no_assessments": 7, "f6_rating": 4.285714285714286, "videos": [], "media": [], "f6_assessments": [{"id": 6467, "q0": "It is exciting to see NFTs coming out with more and more utility. It would be awesome to see a dApp where you can see more information about NFTs. This proposed idea will provide a place where you can see more information on your NFT assets. Given ideas are rarity, metadata, and the number of nfts in wallet. I would agree that this proposal effectively addresses the challenge by providing a dApp that will show all of this information. This dApp could bring a lot of utility to the Cardano ecosystem by having an influence on the power of CNFT's. It could have a global impact by giving more users the ability to see what nfts utility would best support them in their circumstances. For these reasons, I give this section 5 stars.", "q0r": 5, "q1": "Learn Cardano is a Youtube channel that highlights projects in the Cardano community. Pete is the head of that Youtube. He is also the project owner of CardanoPress. He has experience in this community and has a large following that will help support him in this project. The proposal has a specific roadmap that highlights the ideas and timeframe that will be implemented into this project. It splits it up into 5 different phases that will be completed one at a time. Something that could be beneficial is to include a potential timeframe to this section. Even something as simple as Q3 or Q4. This will help the community hold the team accountable to completing this project in a timely manner. There is a detailed budget breakdown that shows exactly where the potential funds will be allocated. This helps allow the readers of this proposal to address where the funds will be going so that they are held accountable for utilizing these funds properly and improving CardanoPress. For these reasons, I give this section 4 out of 5 stars. I believe there can be more information included in the roadmap. This would include specific dates to allow for accountability from the community. ", "q1r": 4, "q2": "The information provided in this proposal is good. When measuring the success of the proposal. There are two main principles that I like to have the proposer think about. They are both very important to the auditing process of a proposal. The first concept is transparency. The team behind a proposal needs to ensure that they are completely open and honest with their community. When transparent, it allows for more ideas to be shared on how the proposal can be improved and how the likelihood of the success of the proposal can be improved. The second principle is very similar to the 1st. That is accountability. When there is a community behind a project/proposal, there is more room for the community to hold the project team accountable for reaching their roadmap goals. For that reason, I suggested including a more set timeframe of exactly when these phases will be completed. Then the community will hold the team accountable and that promotes more work to ensure that the project is reached on time. Especially with an idea such as CardanoPress. I'm sure the community will be excited to support this project. That will make the idea of accountability a positive thing, because the community will be following up in excitement. Rather than making sure that the team is being honest. For these reasons, I give this section 4 out of 5 stars. ", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2108, "q0": "The problem is that nowadays NFTs have more and more utilities that make them more desirable, but their content is often controlled by the website, so the proponent wants to make this easy. easy for any project that wants this use case. The proposal team built the core features of NFT-controlled content into their plugin called CardanoPress (https://cardanopress.io/). Now they want to extend it further to cater for the wide range of use cases that have been requested. CardanoPress has the ability to login to a website with a DApp connection page, detect the NFT with a policy ID, and assign permissions and roles based on that policy ID.\nAs a core addition, the proposed team wants to provide different levels of access and permissions, based on different scenarios including:\n-NFT . metadata\n-Rarity of NFT\n-NFT number in wallet\nThis will allow projects to create flexible use cases on their website for NFT holders. The problem has been identified and a solution is clearly explained, even completely obvious. CardanoPress allows users to create small DApp websites that interact with the Cardano blockchain and allows them to create widgets and interactivity for their community.", "q0r": 5, "q1": "This proposal is divided into 5 stages for implementation, in each phase there are tasks listed, but it would be better if these stages are tied to a specific timeline, so that the community can know get the completion time of each stage. Next to the $12,000 required budget, the items listed indicate how the financial amount will be used, in a very specific way. However, in my opinion the hourly salary of $150 seems a bit higher than other projects. And finally, the project team consists of 4 members including Peter Bui, Gene Torcende, Martina Kocian and Karlo Ilanos mentioned with experience as core members at PB Web Development for more than 6 years. We also know their role and link to their profile, where we can verify them more easily. So in my opinion this project can be done successfully based on the details provided by the team.", "q1r": 4, "q2": "Several indicators have been provided to measure the progress of the project such as:\n- Number of users and projects using the plugin for use in their projects.\n-How many users participate in the development process and then do our work and develop their success.\n-The projects that install and integrate the plugin with their NFT are the main indicator for the recommendation\nWhat is missing from this proposal is to provide a means by which the community can monitor the progress of the project. I suggest that the team consider other forms of reporting as well, online meetings or biweekly reports to keep the community informed that the project is on track.\nThe success of the project is well defined as the Cardano NFT project installs the plugin and creates fun and amazing experiences with their plugin and NFT collections. And the further vision is that more projects that can do this will generate interest from NFT collectors bringing adoption of the Cardano blockchain.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3919, "q0": "The issue being NFTs are becoming increasingly useful, making them more desirable. One example is gated content on websites. They want to make it as simple as possible for any project that requires this use case. The proposer have built core features of gated content by NFTs into their CardanoPress plugin. they want to expand it now to accommodate a number of extended use cases that have been requested. This does help the CNFT ecosystem. The proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer and their team has 15 years experience developing WordPress solutions and also have previously worked on WordPress/Cardano solutions for projects building on Cardano. These experience should be enough to successfully implement the proposal. The proposal consist of a very clear plan and the proposer has provided a clear budget breakdown which would be helpful to analysis if the fund requested is justified The fund requested of $12000 USD seems justified for the work needed to be done. The proposal has considered possible risk which effect successful implementation of the proposal. With all of these it can be said it is likely the proposal will be implemented successfully  ", "q1r": 5, "q2": "The proposer has provided a step by step plan in which work are being divided into 5 phases which would be very helpful to audit the progress of the proposal but the proposer hasn't provided any timeline or time horizon which would have helped auditors. The proposer has mentioned metrics that would also help auditors to track the development of the proposal. The proposer has provided details on how success for this project look like which will be useful too. Therefore with given information should be enough to audit the progress and the success of the proposal. 1 star deducted because of no timeline", "q2r": 4, "assessor": "z_assessor_2496", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4171, "q0": "The challenge seeks to drive adoption by growing an ecosystem of Dapps, products, [services] and integrations.  Ultimately, adoption – transition from innovator and early adopter to early majority and late majority phases – depends on the provision of utility to end users.  People will be drawn to the blockchain that enables them to DO things safely with the least friction. IMPACT: This proposal fits within the challenge problem.\nProposal Clarity & Fit (4): The proposal is clear and fits within the challenge specification. The proposal is supported by links to several explainer videos as well as code repositories.  The proposal proposes to add features to the CardanoPress plugin for Wordpress that enables NFTs to authenticate user permissions.  Through the app, users can create mini Dapps that interact with Cardano without such users being technically advanced. The success section of the proposal implies the expected users are NFT platforms, which would limit impact. Can other types of websites (e.g. a community platform), using an endogenous or exogenous minting and distribution platform, use NFTs as indicators of certifications (e.g. developers versus legal, accounting or leadership direction)?   \nCardano Impact (4): Recently, NFTs have attracted a massive amount of attention in blockchain. Most of this attention has been speculative around art projects and scarcity.  However, there is great potential for NFTs as utility instruments. Such use in emerging game platforms has been well publicized.  This project seeks to add integrations with Wordpress.  This proposal adds a form of identity to the NFT, where the NFT becomes an access token granting appropriate layers of access to a web application.  Presumably, this could be revolutionary feature for managing communities.    \nScalability (3): However, it is limited in present form to Wordpress integrations in centralized websites.  Perhaps, future iterations would scale the project to other platforms.\nThe challenge presents the following KPIs: 1) increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases, 2) Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products, and 3) increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community. A project would be successful under the challenge if it satisfies at least one of the conditions.  \nKPI Alignment (4): KPIs are reasonable for the scale of the project and consistent with the challenge.\nAverage Impact Score (3.75).\n", "q0r": 4, "q1": "Experience Required and Fit of Team (4): The team seems to have substantial experience in web development.  Since the integration works through linkage to browser-based wallets, the project is more web oriented than blockchain focused.  Team members are identified by name and role. \nImplementation Plan & Budget (4): The budget is modest ($12,000) and appropriate for adding a feature to an existing product. The timeline is organized by objective and phase, presented as an order of execution.   \nTechnically Sound (4): The project seems to be technically feasible.  \nRisk Awareness & Mitigation (4): The team recognizes the existence of 3rd party risk arising from dependence on the Blockfrost API.  The mitigation is vague, but seems to imply the team will establish a dialogue with the Blockfrost team to proactively address changes in protocols.    \nAverage Feasibility Score (4).\n", "q1r": 4, "q2": "Roadmap, Milestones and Time Horizon (2): The roadmap, milestones and time horizon appear reasonable. However, the reliance on \"phases\" without reference to a calendar, even at the month level, is less accountable.  \nReasonable and Quantifiable KPIs (3): The KPIs are plausible and quantifiable, but very limited. It is likely that more meaningful KPIs could be developed and tracked.  \nTransparency (3): The proposal does not make reference to reporting.  However, the team provides its Github repository, allowing community members to follow development.  \nAverage Auditability Score (2.67).\n", "q2r": 3, "assessor": "z_assessor_2523", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9538, "q0": "For a brilliantly innovative idea with a shortage of quantified impacts or articulated outcomes, I rank this section a 4. Perhaps I end up doing a little bit too much work for this proposal in inflating this sections ranking because of my enthusiasm for the idea. However, I’ve been a part of many Cardano NFT utility think tanks for a variety of different collections (some of which were able to brainstorm up to 50 possible NFT utilities to add value for holders -but in many cases were not yet totally enabled by the given technology). This proposal enables a whole world of NFT functionality that was never possible before. Just on a simple level, this enables exclusive membership to content for filmmakers, bloggers, trading information, subscription access, anti-counterfeit ticketing capabilities, and exclusive access to additional NFT minting that is more secure than what we have access to now. With more real world application, NFT gating technology could enable house/hotel/office keys, safebox/banking access, computer access protection for personal/work computers, legal documentation protection (perhaps in the case of leaving crypto assets to someone in a will), and an unlimited list of possibilities. As transformational as this technology could be, there is a bit of missing information here that could provide voters with a greaters sense of confidence in impacts. Normally, I like to suggest adding measurability to the problem statement to give voters a sense of urgency for the need of this technology, which I think could be  pulled from modeling evidence of similar concepts on other chains. However, the more pressing weight that needs to be added hear is the quantifiability of the impacts. This could appeal to usage data of NFT gateways, market research on subscription exclusive content (both on corporate levels and content creators that aim to monetize their content), or security of exclusive content protection. This kind of status quo data will leave voters with a narrative about adoption potential by demonstrating how much money would become accessible to the Cardano ecosystem, what industries could utilize these tools, and how many people Cardano could impact with these additional utilities. Also, while data can tell tangible stories, it couldn’t hurt to tell actual stories that frame the potential use cases for voters to imagine. I think all the right logistical content is here to tell voters how these impacts will be achieved but I think some additional weight could be added to show voters what these impacts could be. ", "q0r": 4, "q1": "For a perfectly experienced core team and clearly outlined roadmap, I rank this section a 4. I love that the project owner is a content creator (one of the more well known YouTubers in the Cardano ecosystem). As a content creator myself, I could see myself using this technology to monetize my content with exclusive access to backend features like blogs, additional videos, and information releases. Overall team appears to be very familiar with WordPress, which is a fantastic starting place to implement this technology with 455 million websites that utilize their services. On the presentation of the core team, I would suggest providing brief descriptions of the professional experience of each team member so that voters don’t have to go digging for it. The roadmap seems rather clear but perhaps a little too simplified to cut out a lot of substance. The budget has me a little surprised that the proposer expects only 80 accumulated hours of labor to see completion of this product. I defer to the expertise of the team but I’m both skeptical and excited to see such a short timeframe. While the overall budget is very much on the cheaper side of most Catalyst proposals, the given hourly rate seems rather exorbitant and well above industry standards for the given lines of work. However, I think the impacts substantially outweigh the given cost and I wouldn’t be surprised if it took a good amount more time than the allocated hours. Ultimately, I think there’s plenty reason to see feasibility with only a few minor qualms from me. ", "q1r": 4, "q2": "In fairness to the simplicity of the proposal, I still rank this section a 4 for providing only a few KPI categories to measure success by. If this project is an open-source plug in provided through Github, there’s not a whole lot of comprehensive data to be able to pull from other than the number of downloads and Github comments. So I lend some credit to limited access to the expansion of measurables. However, I do think there’s always room for more tangibility through quantification. I would like to know how many projects this proposal expects to see from this proposals approval. This additional dimension helps to provide voters with a sense that the proposer has a specific vision for success (which directly feeds into the magnitude of the impacts) and that the team has an ambition/comitment to achieve those milestones. I put a lot of stress on usage data because the most innovative product ever invented would still make no impact on the world without someone using it. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11264, "q0": "The proposal mentions the ability of CardanoPress to allow users to create mini DApp websites that interact with the Cardano blockchain giving plugins for projects to pick up and utilize. This will then enable the projects to develop utility and engagement for their communities. The team at CardanoPress wants to eliminate the side of technical expertise that is required to build such websites and enable any project to build DApps that interacts with NFTs and exceptional experience. This would bring more utilities to NFTs thus making them more desirable. What the team is doing is definitely addressing the challenge. ", "q0r": 4, "q1": "There are 4 individuals currently working on this project. They have various experiences. Such as Cardano Ambassador, stake pool operator, content creator, WordPress & API Developer,  UI/UX Designer, and Frontend Developer. The team has had 6 years of experience working together as a core team at PB Web Development. Based on the experiences above alone the team should be able to implement the proposal successfully. As for their plan, that is set into 5 phases. For the initial phase, the team plans to gather feedback and user testing. Then onto phase 2 where they plan to create use cases and testing scenarios. Next in the 3rd phase, they will develop against use cases and scenarios. For phase 4 the team plans to run testing again and gather more feedback. Finally, for the last phase, the team will submit the final stable version of the plugin. One aspect that the team failed to mention is marketing. I believe that should not be overlooked during the plan of the proposal. With the aforementioned plan, the team should be able to implement the proposal successfully. ", "q1r": 4, "q2": "The means provided to measure the audit of the progress are as follows. Though measuring the number of users and projects that take up the plugin, the engagement during the development, and finally the number of projects that install and integrate the plugin. As for the success, it would be measured by the number of Cardano NFT projects that utilize the plugin and how they have great new experiences with it. Both the audit for progress and success provided by the team are sufficient.", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 12980, "q0": "This proposal is about NFT's where the NFTs become more useful, which increases their popularity, The Websites with gated content are one example of this use. The proposer wants to make it simple for the projects that wishes to use this use case With the help of the plugin that is  CardanoPress  that  has fundamental NFT gated content capabilities .The proposer wants to develop further features that have been requested by various projects to make NFT gated content more flexible.The proposal identifies the problem that must be addressed. There is no doubt that the proposal enhances the Cardano ecosystem. After looking over the proposal The proposal's primary metrics and objectives line up with the described challenge circumstances.By the help of the CardanoPress , anyone can develop the DApp that interacts with NFT's and creates unique experiences without even knowing the technical aspects .", "q0r": 5, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for implementing the proposal. The proposal will have 5 Phases  . The proposer have provided breakdown of each phase in the description . \nwhich includes Gathering Feedback & User Testing, Creating Use Cases and Testing Scenarios ,Developing Against Use Cases and Scenarios ,Testing Against and Gather Feedback , Submit the final stable version 1.0.0 of the plugin .The proposal's budget breakdown is described in great detail, and the proposer has also included data about the team that will be implementing the idea as well as the expertise needed. The proposal has taken account both the risks and struggles to the project's successful implementation. After reviewing the idea, I fully agree that it is likely to be implemented successfully.", "q1r": 5, "q2": "The number of users and projects who adopt the plugin for usage in their own projects can be used to assess the proposal's development. By counting the number of users who interact with us while still in development and then successfully use our ideas for their own work. The primary metric for the proposal is projects installing and integrating the plugin with their NFTs.The proposer have provided the clear understandable description of the challenge and The approach for the successful implementation is described. The Metrices/Kpi's mentioned in the proposal define the success of the proposal.\n\n", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We have built core features of gated content by NFTs into our plugin called CardanoPress. We want to now extend it further to cater for a series of extended use cases that have been requested.", "experience": "The team working on CardanoPress have been developing WordPress solutions for 15 years. Using WordPress & corresponding technologies, we've delivered API solutions for clients worldwide.\nRecently, we've delivered WordPress/Cardano solutions for projects building on Cardano."}