{"id": 421864, "author": "zabelinaarina", "title": "Universal Chemical Library", "url": "https://cardano.ideascale.com/a/dtd/421864-48088", "category": 26595, "amount": 137860, "description": "So far, there is no decentralized system that would support distributed R&D of new chemical compounds. Progress in molecular chemistry is slowed down by the cumbersome structure of academic papers.", "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"id": 398, "q0": "NanoLab are proposing a universal chemical library that will host the data of chemical compounds that can be used in their molecular simulator platform that can help with the education of chemistry. They mention that the goals of this project cannot be achieved using a monolithic software system. It is not clear why they would not be able to first prove that the data structures they are suggesting would have value using a centralised approach initially as this would be far simpler to setup and test. They mention putting the chemical library on Cardano yet due to the amount of data that would be involved in this project the use case does not match very well the use cases for Cardano. Large amounts of data would be better suited on distributed file storage solutions such as IPFS or Filecoin rather than Cardano. Cardano is better suited for high assurance verification of ownership such as of native assets. As an example they mention the ownership of patents that could use a marketplace they are creating. The ownership of these patents would be a fantastic use case for Cardano. What would increase confidence of how this proposal intends to use blockchain technology is to provide examples of how things are currently in a separate attachment and then showcase how they are suggesting this data be formatted and structured. With that information they could then provide their justification of what a certain piece of blockchain technology is suited for storing this information so that the assessors and voters can evaluate those statements. The team mention risks of the time and estimations required for this project and mention contacting specialists. Another key area for them to discuss with these specialists is using the correct tools for each of the components of this application. Overall this proposal suggest some very interesting concepts that could have great merit in using blockchain technology. From the descriptions and evidence provided it is not convincing that the some of the approaches being suggested are fully suitable for the task at hand and more evidence should be provided on the exact data structures they will push onto the blockchain so the potential intentions and potential impact can be better assessed.", "q0r": 3, "q1": "The proposal progress is broken down into an itemised list going through the data structures, smart contract development and integration into the VR experience they are looking to provide. The detailed budget break down provides more detail on how the funding will be allocated which includes work on the data structures, conversions, development, marketing and management of the project. More detail could have been added regarding the 'creation of a system for distributed storage of chemical data based on the Cardano platform'. This is vital part of the proposal that really indicates how it integrates into the ecosystem and whether that is feasible or logical. The team provide some details on who is involved in the project with some emails and one with a link. No progressional links were provided and the website also does not provide more information - https://nanolabvr.com/. Overall it is unclear on exactly how the Cardano ecosystem will be used for this project and more details could have been given to increase the confidence that this is both logical and feasible. The team have not provided sufficient evidence that they have suitable backgrounds to feasibly execute this proposal. In future proposals my advice for this team would be to be very clear on how they will use Cardano for this solution and why that makes sense and then provide more evidence that the team can feasibly execute against this plan.\n", "q1r": 2, "q2": "For tracking the progress of this proposal the team provides the intentions to track number of users, scientific projects or institutions interested in the system and number of chemical compounds made using the platform. They also intend to track the execution of the milestones as outlined in their budget report. Some more information on where the community will be able to find out more about the progress of this proposal would have been beneficial and also any link to a Github repository if anything was going to be open source so development could also be tracked. In terms of success an overall larger vision of success is provided which is the widespread usage of the system for the development, patenting and research of chemical compounds. More specific objectives would have been useful here rather than the long term vision to know what exactly the community should be expecting from this exact proposal. Overall the clarity of this proposal needs refinement to clear define exactly how and why the Cardano blockchain benefits this ecosystem with stronger examples and justifications. There are many concepts presented in this proposal that make it difficult to follow on whether this will be easy to audit and know that it created any impact. This clarity would have led to it becoming easier to make very specific objectives relevant to deliverables that make sense for the project at this stage of development. With more refinement this proposal could be very interesting and useful so I kindly encourage the proposers to resubmit the proposal in future after the proposal clarity and specifics are improved.", "q2r": 2, "assessor": "z_assessor_2073", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3797, "q0": "Blockchain is still novel and unfamiliar in applied science field. Only a few studies had been done to discover and measure the impact and utilization of blockchain technology in advancing research and development in general. Distributed, immutable computing and knowledge base sharing could be a very interesting application for Cardano which has a strong academic root and background. I believe the idea of decentralized research and development (deR&D) is an idea worth investing and exploring and a good way to solve some real-world issue with high impact and promote Cardano blockchain technology adoption among academics.", "q0r": 4, "q1": "Proposer explained the technicalities in a somewhat understandable manner. Milestones looks solid with well-planned actions. However, the targeted time of delivery is not clearly stated and reading all steps in the detailed budget breakdown implying the execution of this proposal will be about 4 months. I am not sure if it is enough looking at the scope of the works needed to be done. Though the budget seems detailed it looks a bit cluttered, however rate is still reasonable. The team looks complete with 2 developers, domain expert in simulation, and a manager but still lacking in their track records and credentials verifiability. The author outlined some risks in budget and time and also the lack of experience in integrating 3D and VR with Web3 applications. The proposer mentioned to consult specialists to get some help in design and calculation best practices.", "q1r": 3, "q2": "Honestly, it is too bad that I am in difficulty to find the best way to measure and track important metrics or KPIs in this proposal execution. No resources such as social media or Github links will make members of community hard to track and verify the works being done. Proposer implied that the success of this proposal if the successful launching of this proposal and its utilization and adoption by the scientific communities but failed in explaining on how to reach that endpoint. In conclusion, while the idea itself is very good, the proposal is still shaky in its content and presentation thus rendering one confused to imagine the best possible implementation and execution by proposer’s team.\n\nI advise proposer team to seek some support and assistance from launchpads or incubators in Cardano such as Kick.io, GeniusX, etc. to familiarize themselves with Cardano ecosystem and technology stack, hone their idea, and get some assistance with writing good Catalyst proposal or even secure alternative funding.", "q2r": 3, "assessor": "z_assessor_2482", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11739, "q0": "The problem that the proposal wants to work toward is that progress in molecular chemistry has been slowed down by the cumbersome structure of academic papers because so far, no decentralized system can support distributed R&D. new chemical compounds. This proposal aims to create a single scalable library of chemical compound models and a platform for working with them based on the proposed molecular simulator and the Cardano network. The integration of information chemistry data and knowledge at levels ranging from basic science of chemistry to application developments in the chemical industry, the pharmaceutical industry, and the emerging nanotechnology industry, cannot be achieved using a monolithic software system such as a simulation package but must use a distributed platform that merges discrete data. So it can't be denied that this proposal is no longer up to the challenge. This proposal completely addresses the requirements of the challenge as it will expand Cardano's influence, making it a platform for students and professionals in the fields of chemistry and molecular physics, The creation of a chemistry library could become an important part of Cardano's infrastructure and attract a large number of interested users. The proposal raised worrying risks when implementing the project, which is true because the entire global community has very little experience in software integration leading to difficulties in determining the completion time. benefits and costs incurred in the implementation of the project. However, the proposal still offers solutions to reduce this risk. I think this solution will limit or also solve the risk.", "q0r": 5, "q1": "The proposal has not provided a specific work schedule and timeline for carrying out activities to complete this project. We only see a proposal that summarizes the problem, so we can't assess how complete the proposal is and how long it will take to complete proposal.\nWe have seen a fairly detailed budget table, it is broken down and shows transparency. The project needs to cost a lot of items, but the proposal still explains in detail each specific job. Although it is difficult to calculate the time and budget, it seems that the proposal team has covered all the costs involved in creating the library, which has been very convincing to the community.\nThe participants in the project were reviewed by the team and selected qualified people. They indicated the identities and experiences of those involved in the construction of the project. However, the proposal did not specify what each person needs to do. The team should divide the work for each person or group to evaluate the work progress and the success of the project.", "q1r": 4, "q2": "The measure of success of the proposal is shown in the budget table presented by the team above. For export with the explicit goal of achieving an index of the number of users, scientific projects, or institutes interested in using the system, and the number of chemical compounds produced using the platform. Of course, these metrics will fit the proposed solution.\nThe proposal has succeeded in creating a single scalable library of chemical compound models, used by many for patent development and research of chemical compounds.\n", "q2r": 4, "assessor": "z_assessor_3273", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11817, "q0": "Mathematics and Science is one of the most important discussions in the current world. Everyday new theories and inventions are being created at an exponential rate many of which have found its way to the practical side in the modern world. Chemistry is one of the most practical fields out there. From creating drugs to studying molecular biology, chemistry is one of the vastest, and growing fields out there. \nThe team has proposed a platform for chemistry practitioners, a single library based on molecular simulator and cardano network. This will integrate all the different fields related to chemistry where the data currently distributed will be unified. This will greatly simplify the work of chemists all around the world and also on the other hand will expand the cardano community to a whole new area. \nTherefore, the proposal is addresses the challenge accurately, focussing on the current research. This project can also be expanded to physics, biology, mathematics and many other fields.\n", "q0r": 5, "q1": "The proposer has himself written that the entire global community has very little experience in integrating VE/3D and web3 software. Hence, this proposal is technically challenging. Contacting specialists who have carried out similar collaborations will only reduce the risk to an extent. Nevertheless, we never know unless we try. \nA budget breakdown is provided by the team. Personally, did feel the team is asking for a huge amount, given the difficulty and newness of the project and the risks involved but going through the breakdown the amount is distributed and sometimes additional funding might be required as this is a technically intense project.\nA timeline or a roadmap was not provided by the team but have given the key milestones for the project. At least an approximate time on the expected time for the completion of each milestone could have been provided by the team. This will also provide a deadline for the completion of each task, which will increase the productivity of the team.\n", "q1r": 4, "q2": "The project demands high technical knowledge and skills for proper implementation. Hence the team will face a lot of challenges along the way. but given the experience and preparation level, there is a good chance the project is implemented successfully. The number of users , projects and activities held on the platform is a key metric for measuring the success of the project ( even mentioned in the description of the challenge).  \nBefore the success, the team has suggested “going to track achievement of milestones” as a means to track the progress but did not mention how one is able to track the achievements or progress. Kindly look into this matter. Another drawback is the lack of a timeline for the individual tasks or the project. This would raise doubts on when a milestone is expected to be completed, which makes tracking and auditing harder than usual. This will also help the team to have a deadline for reaching the milestones. \n", "q2r": 3, "assessor": "z_assessor_3284", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12983, "q0": "The solution to the problem of a lack of a distributed R&D system to enable the development of new chemical compounds is provided in the proposal. where academic publications are only available in long form, which prevents the development of molecular chemistry. To prevent this, the proposer is about to develop a platform for working with chemical compound models based on molecular simulator and cardano network, as well as a single expandable library of compound models. The proposer will integrate chemical information, knowledge, and data at various levels from basic chemistry to contemporary chemical industry applied advancements. By becoming a forum for academics and professionals working in the domains of chemistry and molecular physics, this will expand Cardano's influence.", "q0r": 5, "q1": "The proposer has fully described the plan for implementation, including a timeline and significant checkpoints. The proposer has provided information on the team and linkages to their published research.\nThe team is very professional and has made mention of the skills necessary to implement the idea.\nThe proposed timetable and budget breakdown are excellent, and the proposal has addressed the pertinent risks and obstacles for the project's successful execution, which is a wonderful approach.\nAfter reviewing the plan, I agree that it has a great chance of being put into effect.", "q1r": 5, "q2": "The successes of the proposal can be determined  by looking at the s the number of users, scientific projects or institutes interested in using the system, the number of chemical compounds made using the platform.\nThe proposer have provided the clear understandable description of the challenge and The approach for the successful implementation is described.\nThe Metrices/Kpi's mentioned in the proposal define the \nsuccess of the proposal.", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We will create a single extensible library of chemical compound models and a platform for working with them based on our molecular simulator and the Cardano network.", "experience": "We have created NanoLab, a realistic simulator for designing and studying molecular structures, testing their behavior and exploring their properties interactively."}