{"id": 421973, "author": "vyfinance1", "title": "VyFinance DEx and Bar", "url": "https://cardano.ideascale.com/a/dtd/421973-48088", "category": 26595, "amount": 1673728, "description": "Most DApps mint their token, then use this token to distribute rewards to existing holders. This causes a downward trend in token value. Income should be generated not minted and distributed to users.", "f6_no_assessments": 9, "f6_rating": 4.259259259259259, "videos": [], "media": [], "f6_assessments": [{"id": 114, "q0": "The team that is behind this proposal is has created a proposal that is aimed at building a second-layer solution for the ViFy DEX that will have a Cardano native token with a maximum supply of 450 million, to be farmed out over the course of 20+ years. Essentially, the team wishes to achieve a situation in which their token becomes inflationary (gains in price), as opposed to the trend of such tokens losing in price (becoming deflationary). The proposal does fall square into the challenge and the team has aligned their proposal well with the challenge and with many of the Fund 9 goals for Catalyst/Cardano. The expected impact of the Dex and whether it will be more competitive than other Dexs is debatable and open for discussion, but in terms of alignment with the challenge – the team has done as required. ", "q0r": 5, "q1": "The proposed budget for this proposal is very large and it does provide a budget breakdown – but it is a bird’s eye view of a budget breakdown. For a proposal with such a huge budget, we have large components in the budget that cost $473,665 (First iteration MVP Dex without BAR) – and that is it. The cost is attributed to engineers and that amount is to be spent in the first 10 or so weeks. I don’t know, but half a million dollars would require a much more detailed plan – to convince me of its feasibility. I think the proposers should [if the proposal is not approved this round] submit a much more detailed budget breakdown for all the stages of the planned work. Not just an umbrella budget breakdown, as this proposal – seems to be requiring one of the largest budgets in this challenge. With great funding comes great responsibility for transparency of utilization of funds. The same is evident with other components of the budget. We are given a lump sum for the “Merge Bar with CClib/Finish Bar Containers” that costs $426,299… etc.. Yes, these partial budgets to contain a small (but that is negligible) component that is paid out to the Haskell consultancy Well-Typed of up to $10,000 per budgetary component… We have no hourly rates, or number of engineers working on the project, it is very difficult to extrapolate the feasibility of achieving what the team wishes to achieve. The team has provided the links to their respective LinkedIn profiles. The link to the Vyfi.io website and app did not impress me. The homepage left me underwhelmed and the fact that the Dex is not functioning – but the proposal is focused on a deflationary aspect of tokens by other Dexes has me questioning whether the team has really presented and developed this proposal well. The challenges and risks section seems to be a very generalized and very ad hoc approach to these challenges, there is a lot of discussion without clear specifics for a proposal that is seeking $1,673,728 in funding. For example: \nBusiness risk: Cashflow Proposed solution: “We have cash reserves, and a Cardano reserve. But as for any start-up, this is always something that needs to be managed appropriately….” \nCompetition. Proposed Solution: “We won’t be the only DEx on Cardano. We believe that whilst our design is unique and economically more capable, it is important to ensure that the user base is aware of this fact…”\nThese are general statements that are not backed with facts, but are backed with statements or statements of belief. For me, this seems insufficient for a proposal of this magnitude. \n", "q1r": 3, "q2": "The team has stated that the solution to the problem that they raised [Most DApps mint their token, then use this token to distribute rewards to existing holders. This causes a downward trend in token value. Income should be generated not minted and distributed to users.] is to bild a second layer solution to the DApp. However the proposal seems to be for much more than just building a second layer solution. The proposal is broken down into components such as” First iteration MVP DEx without BAR (integrated with CCLib)”, followed by “Complete and merge Bar with CCLib”, then “Second iteration merged (DEx and BAR integration)”, then “Build farms” and then “Start Audit”. Effectively this seems to me to be a proposal not to build a second layer solution to a functioning DApp and Dex, but a wider proposal to complete the Dex itself. What I am trying to say is that the scope and budget of the project seems much wider than the problem statement and the proposed solution. I find the presentation of the proposal relatively unclear for a project that is seeking $ 1,673,728 in funding. If it is not approved I would advise the team to resubmit the proposal with a clearer focus – if the proposal is to build a functioning Dex (or an MVP Dex) – then the Problem Statement and solution should clearly reflect this intention. Further, as regards Auditability, again the team seems to use somewhat vague terminology. “We have a clear sign of progress to share with our community for each stage. This is our Public Testnet. Once launched, we will be continually updating the testnet with features as they are constructed. This will allow us to have an open dialogue with our community whilst development is taking place, as users will be able to interact with the platform itself.” However, the testnet appears in the project timeline between weeks 22 and 24 – which is a long way away. Also, for a project worth $1.6 million I would expect much more than “a technical update fortnightly” – as we do not know where will the technical update be released, who will be releasing it and in what format (two sentences – or a full report). The AMA’s on Twitter and Discord for the community to speak with the team directly – seem not to have a regular time schedule. I would advise the team to use part of the budget (if resubmitting this proposal) to make a much more mature public relations and auditability component of this project that will allow the Catalyst community to be convinced that the extensive and exhaustive and precise information will be made available all the time during the implementation of the project. This proposal’s auditability segment seems more akin to an auditability segment for a proposal that is worth 100 times less funds. The definition of success “Success for this project is a fully functional DEx with an integrated distributive mechanism (BAR)” – seems modest if it is not used by users and is not superior to other Dexes by other metrics. I would advise the team to be less modest with the definition of success, as a functional Dex that is not better or not used – is no big success. ", "q2r": 2, "assessor": "z_assessor_2047", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"id": 399, "q0": "VyFinance are a DEX application building on Cardano and are proposing a solution to prevent the deflationary effects on the value of DEX tokens over time by introducing the concept of a 'BAR' which is a 2nd layer distributive mechanism that users can stake their VyFinance token to. The BAR will redistribute a percentage of every swap made on the DEX for those participating. The BAR has a number of ways it generates income such as from NFT sales, a percentage of yield farm staking, a percentage from swaps and 15% from a fund investment. The last one regarding the NM trust as shown in the diagram is less clear in the proposal. This solution helps to give an increased reason for holders who earn tokens through the DEX to stake them in this solution which will help to prevent the downward pressure on the token price. In terms of risks the team detail regulatory risk, cashflow and competition as three main business risks each with a response. The competition response to the risk could have done with better analysis on why it is unique to other DEXs due to the high levels of competition that exist in the ecosystem. Stating their design is more unique and economically more capable without providing a resource to confirm this makes it hard to believe without sufficient evidence. Technological risks are also included with solutions focussed on either creating tools themselves or needing to wait for IOG to finish their releases like the Vasil hard fork. Overall the deliverables for this proposal sounds promising in being able to deliver impact to the ecosystem and would provide further utility and use cases to the token holders of the VyFinance DEX application.", "q0r": 4, "q1": "For the proposal progress roadmap a list of items have been provided that the team have already completed such as full integration of CIP-30 wallets and smart contracts, initial construction of the BAR and development of a Concurrency Library (CCLib). The next five steps are then provided in a simple list. It would have been good to expand on these items in more depth - especially considering the size of the proposal budget being requested! For each development cycle they mention the different parts that are involved such as on chain and off chain development, audits, UI development, query integration, testing and use of a testnet prior to launching. The budget break down helps to both show how the funds are being distributed and also a timeline of when each part will be executed. Team details are provided, and the link for the VyFinance team also has professional profiles on each of the members. The team have already launched a working application which gives sufficient evidence that they are able to deliver on complex projects such as this one. Overall it looks very likely that this team will be able to feasibly execute the proposal that has been described based on the proposal deliverables and evidence provided of the plan, budget breakdown and teams history of their ability to execute.", "q1r": 5, "q2": "In terms of auditing the progress of this proposal the team highlight how they will continuously update their testnet with the updates as they go through development to interact with the community during development. In terms of public disclosure of progress the team intend to do a fortnightly update of the technical developments along with AMAs on Discord and Twitter to collaborate with the community. For progress it would have been good to have any clarity on what, if anything, will be open source, and if so provide a Github link for the community to track the progress and benefit from this work. Due to the large budget being requested I believe this is some fair feedback for the team to consider - how are you going to give back to the development ecosystem with tools or increased understanding of how to effectively develop on Cardano? This is both good from an auditing perspective but also to improve the wider ecosystem as well as the VyFinance DEX. The ecosystem thrives when there are more collaborative efforts! In regards to success the main points given are around the fully functioning 'BAR' layer for token holders to use and stake with and to ultimately try and put an upward pressure on the token value over the long term. The team could have broken down some more specific objectives to show how the community can determine what to expect in terms of adoption and also what can be considered a success in terms of the outcome of this proposal. The clarity of this proposal is overall fairly high however could have had more depth and resources to cover the proposal deliverables - especially when considering the higher budget requested. ", "q2r": 4, "assessor": "z_assessor_2073", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1525, "q0": "Vyfi's proposal for creating a DApp that addresses the deflationary way tokens are distributed to users, fits the challenge at hand.\nTheir feeling is, income should be generated not minted.\nBy building a second layer solution for their DApp that allows users to access yield generated from the swapping of tokens on the DEX. Users can also stake their tokens/coins and accrue distributed fees from the DEX, as well.", "q0r": 5, "q1": "VyFinance a defi protocol and decentralized hedge fund, has a working ecosystem where people can stake NFTs and coins/tokens to earn rewards. The site is constructed (now live) for ease of use, making it accessible for the tech savvy to the new-coiners.\nThe team working on this addition to their other VyFi offerings are no slouches in finance or developing:\nSteven Ward, CEO- has over seven years as a hedge fund manager. Add to that, years of experience in the financial world before that undertaking. His team includes experienced engineers, including Haskell developers. A plethora of partnerships: Adahandle, Adaswap, Cornucopias, Charli3 and Genius Yield, to name a few.", "q1r": 5, "q2": "The mechanisms for auditing Vyfi's progress will be shared with the community for each stage: Public Testnet; upon launch, will be continually updated with features as they are created. Continued communication with the community is key during the development of the BAR. Allowing an open dialogue while development is taking place. It's exciting to know users will be able to interact with the platform itself, in real time.\n-Bi-weekly technical updates, to be held via live AMA’s on both Twitter and Discord. So the community can ask questions directly to the team and get updates on day-to-day goings on along with general tracking of the project.", "q2r": 5, "assessor": "z_assessor_2256", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 1804, "q0": "This proposal from VyFinance offers to create a sustainable DEX, by limiting the deflationary trend of their governance token, a problem many DEXs encounter. Sustainability is the heart of this Dapps project, which meets the challenge criteria. \nThis main objective is achieved by a distributive mechanism rewarding the staking of the token by a percentage of the swap fees. This mechanism named \"The Bar\" is a second layer of utility for the token, outside of providing liquidity. A schematic,  a whitepaper, and an video interview are provided in the proposal to describe the mechanism.\nThe problem identified by the proposal is well explained and so is the solution which is well documented. What I am missing is a deeper analysis and evidences of why DEXs with a deflationary token are not sustainable. I found an article from orbs.com against inflationary model which assumes that \"token holders don't expect to get rewarded for holding it, are doing so only because they used it or intend to use it\". I understand that this \"only\" is what is changed by VyFinance. I recommend to elaborate on the drawbacks of the deflationary DEX model, by a more detailed analysis making the distinction between launch phase and long term sustainability.", "q0r": 4, "q1": "This proposal includes all of the elements required for maximum feasibility score.\nFirst of all, the team (5 identified workers, whose we have names and CVs) has already completed several milestones : the dex is developped (not audited yet), wallet intergrated, offers NFT staking, on chain governance. They have proven that they deliver, and that they gather the necessary skills for coming developements.\nSecond, the second layer solution is described very precisely, and supported by a whitepaper and a video explanation. \nLast, I particularly appreciates the quality of the risk analysis (divided into business riks and technical risks) and mitigation plan.\nThis is a good quality proposal that deserves the maximum score for feasability.", "q1r": 5, "q2": "As the development plan and the budget breakdown are very much detailed, the community will have a reference to monitor the progress of the project towards his goal : development of \"The Bar\".\nAt each stage of the development plan, the progress is shown by the public testnet implementation. \nThe team also commit on publishing technical updates and on holding regular AMA's session on public channels twitter/discord, which is not something I see often in Catalyst proposals.\nOverall, the proposal includes what is necessary for the maximum auditability score.", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2972, "q0": "This is one solution to this problem that could give Cardano Dexes a leg up in the DeFi space. I have a question:\nWill this be open sourced so existing DExes and upcoming DExes can utilize this second layer to become a Cardano standard for DExes? Why, why not?", "q0r": 5, "q1": "The team of 8 engineers led by Anusheel Bhushan seem to be up to the task given VyFi’s previous work. Under [IMPACT] What are the main risks that could prevent you from delivering the project successfully and please explain how you will mitigate each risk? You state: “We have renegotiated with our development team and have confirmed our current engineering staff for the next 3 years.” This inspires a lot of confidence, but this is a bear market and things are unpredictable. However, after scanning the telegram channel it seems funding of this project is not dependent on the Crypto market, but on Steve’s experience as a hedge fund trader. So the project seems to be self funded and has cash flows to fund the project in the immediate future.\nThis proposal has been on the teams roadmap since day one and does not seem to be dependent on Catalyst funding.\nHas this or something similar been done on other chains and what have the results been? Or is this the first time a Bar will be implemented on the Dex? If the Bar is the first time something like this is being implemented on a DEx the risks are of course higher, but so is the reward. Looking at VyFis track record they are a pioneer in DeFi in general and Cardano DeFi in particular as they have successfully brought many “firsts” to the Cardano DeFi space. ", "q1r": 5, "q2": "Please include your telegram channels as a way to keep up with the progress. Please include the interviews you frequently give to various youtube channels which provide clusters of updates and answers to questions posed by the viewers. How will the community be able to view the audit results from Well-Typed?\n", "q2r": 4, "assessor": "z_assessor_2375", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 3800, "q0": "Though DeFi is not the most exciting and interesting topic in the market and industry right now, I still believe exchange and fluidity of value will leverage the development of Cardano blockchain. The stated problem that minting token as rewards distributed to existing holders creates a downward pressure in the overall value is real and apparent in few DeFi protocols. We can take one page or two from OlympusDAO or even the last Terra Luna’s collapse story books. The Bar is also a relatively novel and interesting concept as a mechanism to distribute incomes from the protocol through creation and preservation of value to stakeholders by providing an extra layer of utility and service to sustain the liveliness of the protocol.\n\nWhile it is true that we already have few working DEXes such as MuesliSwap, SundaeSwap, MinSwap, WingRiders, and others, the ecosystem is still in an early phase and each DEX is still finding their own respective niches. Many alternatives for consumer also result in positive outcomes and benefits to the greater ecosystem of stakeholders. This is achieved through promotion of healthy and productive competition by progressive and endless innovative iterations by these service providers or companies working in the DEXes. The elaboration of the possible risks is also commendable and can encourage community in providing valuable feedback and insights from various points of view.", "q0r": 4, "q1": "The skills and experiences brought by the VyFi team are extensive and sufficient to deliver this project in a serviceable manner. Anyone curious with the backgrounds of the members can go to their LinkedIn profile page through the Team pages of the VyFi website. The budget, timeline, and methodologies for the delivery of this proposed project is also clear and detailed enough. Proposer had also completed in advance three major milestones of integrating fully CIP-30 (dApps-enabled) wallet and smart contracts with the PAB, constructed the initial structure of the Bar, and completed the Concurrency Library (CCLib). This puts the proposer team about halfway through the delivery of full proposed products. The technical necessities staring from the protocol design, programming languages, and solution architecture are mentioned explicitly and given enough rationale.\nThe fact that this is the only submitted proposal from VyFi team I think it is safe to assume that we will get all their teams’ hand on deck. The focused attention and resource from VyFi will surely be beneficial to the fullest delivery of this proposal. Risks associated with the delivery and implementation of this proposal have also been addressed and VyFi team had indicated some mitigations such as careful and prudent financial resource management, implementing Know-Your-Customer (KYC) procedure during ICO, and working with advisors to ensure compliance with current and future regulations. My input to proposer is to state the hourly rate of the functions especially the engineering. Alternatively, how many engineering work hours will be needed in the listed weeks to finish each stages/milestone will help to estimate and benchmark if Cardano community is paying a fair price in funding this proposed project. According to my calculation by breaking down the table and assuming the team of 8-10 engineers working 40-hour week, the hourly rate came out to be between USD 60 to USD 100 which is a fair rate for most developer works in the US. Still, there is a chance that I am totally off in above calculation here.", "q1r": 4, "q2": "The roadmap is defined explicitly: fully working DEX with the Bar integrated as protocol’s income distributive mechanism then in the future they will propose the Auto-Harvester which is an automated Yield farming tool (liquidity aggregator) as stated in the VyFinance Whitepaper. If all goes well, we can expect the delivery of the final product in about 28 weeks or end of January 2023. Since the success is mentioned to be solely the DEX and the Bar, it can rather be hit-or-miss. However, when we are looking at the track record of VyFinance and the dApps they already presented to the Cardano community already, I will not worry too much about non-delivery. Delay is much more plausible since software and application development involving significant values will need to be measured twice and cut once, adopting the development philosophy of the Cardano blockchain itself here.\n\nVyFinance team also promises bi-weekly technical update and both Twitter and Discord AMAs to communicate with and update community members regularly, which are fine standard for most projects in the crypto space. Public testnet will also be launched as the primary feedback loop on the performance and user experience of the deliverable DEX. Since this is a commercial, for-profit project and competition is quite fierce in this area, open-sourcing is still not in the picture for now. The same constraint can be said for the usual Github tracking. Nonetheless, if this project got funded through Catalyst, community can check Cardano’s DeFi metrics such as Total-Value-Locked (TVL) later next year to benchmark and measure the real impact of this dApps and help deciding for another project funding in the next Catalyst series or rounds.", "q2r": 4, "assessor": "z_assessor_2482", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6361, "q0": "This proposal is about creating a DEX and a second layer on it as distributing mechanism (BAR) for the Vyfi DApp that allows users to access yield generated from the swapping of tokens on the DEX and other income generated in the Vyfi ecosystem. The proposer says that some DEXes incentivize the liquidity providers with their DEX token by consistently minting it only. This is not true as we can see already established DEXes on Cardano Sundaeswap & Minswap both offers both the liquidity fees and their DEX tokens. They provide liquidity fees to liquidity providers and both the liquidity fees and DEX tokens to Yield farmers.\n\nThe Vyfi protocol also offers one more source of income from the fees of offshore Bank (Vyfi's lending platform). The proposer thinks that these benefits will encourage the Vyfi token holders to hold their tokens to earn more rewards, thus reducing the selling pressure on DEX tokens. This feature, along with the other two reasons, will incentivize the holding of the Vyfi tokens and will be helpful for them to compete with other DEXes and make Vyfi an attractive DEX. This way, we will see one more successful DEX on Cardano. Hence, it will positively impact and add value to the Cardano Ecosystem. Furthermore, the proposer has plans to scale the DEX features to include 'Auto Harvest.' The proposer seems to have considered potential risks and has prepared the proposed solutions to tackle those risks.\n\nI cannot understand why the Vyfi team wants funds from Catalyst after raising 1.2 million ADA through ICO at a time when ADA value was more than $2 and after minting hundreds of NFT to be staked on their platform. It seems something is off; hence I doubt this project's future. I would have been positive if the proposer could have provided a plausible reason for coming to Catalyst. Therefore I am rating it three stars.", "q0r": 3, "q1": "The proposer provided some of the team members' details and a link where we can find the other team members' details. If we check the Linkedin profile of Haskell Engineer/Team Lead Mr. Anusheel, it looks like he is working for some other company, and it seems he is working on a part-time or contract basis for Vyfi. Anyhow, if anybody wants to dig deeper, they can check the teams' LinkedIn profiles on their website.\n\nThe detailed plan is stated and segregated into five stages to complete the final product. Each of these stages is again broken down into seven sub-segments. Moreover, the timeframe to achieve all these five stages is seven months, as seen in the budget document.\n\nI think the budget is too excessive to achieve the mentioned protocol. On the other hand, I was not expecting any proposal from the Vyfi team asking for an enormous fund because they have already raised a significant amount from their ICO and NFTs Sales. For reference, they raised 1.2 million ADA when ADA value was more than $2. So it looks like something is off, and I am also skeptical about the team's capability to materialize this DEX up to the final product. Hence I cannot agree or disagree with the feasibility criteria.", "q1r": 3, "q2": "The proposer said they would regularly release technical updates alongside AMA's on Twitter and Discord. These updates will be helpful in tracking/auditing the progress of the project. But there is room for improvement in the proposals. Accordingly, the proposer should provide valid reasons for applying for funding through Catalyst and also explain why the requested budget is enormous.\n\nAs mentioned above, the detailed plan is stated and segregated into five stages to complete the final product. Each of these stages is again broken down into seven sub-segments. Furthermore, the timeframe to achieve all these five stages is seven months, as seen in the budget document. Hence the delivery dates are in months, as reflected in the budget picture.\n\nAs described by the proposer, the success will be a fully functional DEX with an integrated distributive mechanism (BAR), allowing users to share the earnings of the DEX ecosystem through Yield Farming.", "q2r": 4, "assessor": "z_assessor_2811", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6470, "q0": "There is a clear challenge to their proposal which helps determine if the proposal effectively addresses the challenge or not. Vyfi is one of the biggest projects building on Cardano and they already have a huge following. They are striving to implement a decentralized exchange into their project and provide a \"bar\" that will give more utility to token holders. The project plans on distributing their token rather than minting it and giving it out to investors. This will help allow for a token distribution that takes place overtime. Being such a big early player in the defi ecosystem, there project will help benefit the overall Cardano ecosystem if this challenge is addressed properly. It has the potential to have a global impact and will help other defi projects building on Cardano to learn from their example. This could promote further growth and more innovation. For these reasons, I give this section 4 out of 5 stars, as I believe that this proposal will resolve this challenge.", "q0r": 4, "q1": "The team at Vyfi has proved to be successful thus far. They have a great team that is dedicated and they have already created a functioning dApp. This is always a good sign because it shows that even in the case that they don't receive funds from catalyst. They will still be building and making sure that their products come to fruition. They are a part of the \"Cardano Defi Alliance\" which consists of the biggest Cardano projects that are plutus native. This suggests that they are trustworthy and that they work closely with some of the other projects that share the same standards. The plan presented is very articulate and the proposal includes a specific roadmap. There is a lot of information, and it shows that they have thought through this process and will ensure that things are taken care of. There is a detailed budget breakdown that shows exactly where the requested funds will go. It shows how they will be utilized and why they will be necessary for the continued building of their project. However, the team could potentially reconsider the amount requested from catalyst. They are requesting 1.67 million which is a lot of money. Maybe the team could decrease this amount and find another way to gain funding from other sources while still benfiting for this proposal. For these reasons, I give this section 4 out of 5 stars. I believe that the team is trustworthy as they have demonstrated in the path and will create a project that will benefit the Cardano ecosystem for years to come.", "q1r": 4, "q2": "This proposal is very clear to read and gives lots of information. When determining the likelihood of success for this proposal. There are two concepts that can help determine this. The first thing is accountability/auditability. Vyfi has a great advantage over some other proposals. That is that they already have a large following. Their community will hold the team accountable for this proposal. I have done the research and can confirm that the team has made their proposal public through their social media channels. This is promoting more engagement and allowing the team to hear from the community and potentially make changes to their proposal if necessary. Once this is done, there will be a strong principle of accountability because their community will want to see this proposal come to fruition. They will likely give constant updates in regards to their progress and will likely carry-out their proposal because their community will hold them accountable every step of the way. The second principle that is extremely important in this section is transparency. If the team remains transparent and open about their proposal. It will be easier to audit the potential success of the proposal. They have already included set dates and timeframes which will ensure that the proposal will be taken care of in a timely manner.  For these reasons, I give this section of the proposal 4 out of 5 stars.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12775, "q0": "The proposal plans to create a DEX without the problem of inflationary coin printing. \nCurrently many exchanges reward users with their own tokens for liquidity providing. This creates many new tokens who lower the price. The proposal wants to create a mechanism which gives a part of the fees back to the users who stake at “the bar. Thus the proposal creates a sustainable tokeneomics for the users. \nIt´s clear that this proposal matches the challenge strongly because it creates a new system of a DEX which brings the usability of not inflating the tokens and thus not decreasing the value of the token. ", "q0r": 5, "q1": "I checked the team on Linked in and on their website. Ryan Feld and Anusheel Bhushan have many relevant experiences. There is little information on Steven Ward, even his LinkedIn link on teir website doesn´t work. There isn´t any information on their Tech leads. (Franco Luque and Maico Leberle) They aren´t even on their website. But on the other side they have creates a good, working product with some innovative features like NFT-staking. So they seem competent but please provide more infos next time. It´s important to assess you fairly. \nThe budget is described but not in detail. It would be great to know, how many workers work in each section and how much the subsections cost. Therefore it give a overview buit it´s not fully transparent. \nThe timeplan in combination with the timing of the is very detailed. It´s clear to understand and it´s transparent when they do which task. \nOverall I miss some infos and with the budget of over 1.6 million it should be more complete and detailed. Therefore I remove one star. ", "q1r": 5, "q2": "The roadmap is clear and understandable. The team has conveyed a reasonable plan with a specific goal. \nThe team plans to publish technical updates and daily operations on discord and twitter. \nThe success is clearly visible by the status and usability of their own application. \nThe problem in the beginning was clearly stated and the proposal solves it by creating a DEX with an new incentive/ monetary system. \nBut there are no KPIs/ metrics to measure. Good KPIs would have been for example: TVL, number of users and number of interactions. Therefore I will remove one star, because this lower the auditability.", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "Build a second layer solution to our DApp that allows users to access yield generated from the swapping of tokens on the DEX. Users stake their token and are distributed fees accrued from the DEX.", "experience": "The team at VyFinance has a diverse and accomplished range of staff. Steven, our CEO, has been working/trading in markets for 7 years building a wealth of knowledge. Annushal Bhushan, our Haskell Engineer Lead, heads a team of 8 engineers, each highly qualified and experienced. "}