{"id": 421968, "author": "kenoyenaku", "title": "Licensing Remixed Music On-Chain", "url": "https://cardano.ideascale.com/a/dtd/421968-48088", "category": 26595, "amount": 80000, "description": "\nMost remixes are unofficial, creating revenue leakage for the original Artist and limiting the potential of a remix / mixtape.\nCreating remixes is a technical skill set not everyone has time to learn\n", "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 4416, "q0": "This proposal is purely music related, I'm quite interested in it. The proposal addresses the goal set in Challenge: Dapps, Productions & Integrations and identifies the problem that most remixes are currently unofficial, creating a revenue leak for the Original Artist. and limiting the potential of a remix, and making mixes is a technical skill that is not everyone has the time to learn. The solution was for the artist to sell the remix rights (commercial use) and sample their music through NFTs. Thus, the team identified the problem to be solved and came up with a plan to solve the problem. In my opinion, this is a necessary proposal because so far there has been almost no music field applied to the blockchain. The team can be one of the pioneers. Especially when it is related to economics and finance to solve the problem of commerce and the lives of people who work in music. This is a creative idea. This proposal adds value to the Cardano ecosystem by it deploying and generating NFTs on the Cardano blockchain. In addition, the proposal can scale and explain the future challenge in the music industry as NFT will be a tool that will gradually become indispensable for the field. It will make music not only commercially valuable but also spiritually valuable with a platform that is fair, easy to use, and highly innovative, with a focus on providing an experience. I think there is real potential and there is still a lot of room when proposing to expand the scale and solve challenges in the future. I strongly agree with the impact of the proposal, I vote 5 stars.", "q0r": 5, "q1": "I found the team to have full-stack experience, music producer, record, MVP/Beta, software development, website, etc… The team also provided full reasoning, explanations, and solutions. documents related to the proposal (paradime website,...). However, I do not see the disclosure of all team members' identities via social networking links (Linkedin, Facebook...), it is a hindrance to the community that will not be convenient to look up the name. count members and verify the feasibility of the proposal and further affirm the team's credibility It will take a little extra effort and time to visit Paradime's website and learn about its members. Team. I've come across several other proposals that do the same. The number of core members of the team as I understand it is 4 (listed names and areas of expertise in the proposal), these are key members, can team other members/collaborators yet identified in the proposal. My advice to the team is to try to add a social media link (Linked, Facebook, etc...) directly to the proposal to make all the members of the team public. Because thanks to the full complement, the community has a lot of advantages in looking up the members' identities and verifying the feasibility of the proposal.\nThe budget is presented briefly, somewhat sketchy. Still, it's fit for purpose. I think the community needs to detail the important work that needs to be done rather than such a sketchy presentation. Because when listing the details of the work associated with the budget, it will clearly show the professionalism and meticulous attention to the team's budget balance sheet, through which the community can strengthen more confidence in the ability of the team. examination of the proposal. It's perfectly understandable for the team to present the budget as it is, for people who already know the team well (know what the team needs to do), but I think letting everyone from the community (some people are very new - they don't know anything about the team and this proposal) can understand it easier than we need a more detailed, more understandable presentation. That's my advice on the budget.\nThe plan and implementation method have been fully stated by the team in a very logical step-by-step. It is divided into 2 phases, each phase consists of smaller work execution steps. The team noted the correction because there was a slight typo (“phase two” listed twice, I think misspelled phase one). This is one of the important factors in clearly defining the feasibility of the proposal. I was very impressed with the team that the team did not need additional funding at the time of working after this proposal. This shows the initiative and financial autonomy of the team. I hope this proposal of the team will be approved for funding to implement.\nHere, I consider the necessary resources for implementation, I divide them into two main resources, which are financial resources (mentioned in the above budget) and human resources. Regarding human resources, with the key members having professionalism and experience, I believe the proposal will be successfully implemented. As the team shared that no member is working on another proposal in parallel with this proposal at Fund 9. This ensures that human resources are not dispersed, and the team can fully concentrate. personnel to implement this proposal. This is also one of the factors contributing to confirming the feasibility of the proposal. For this proposal to be implemented successfully, I think it needs the participation of many members, not just a few key members. So can the team share more about who (collaborators or others) could work with the team to develop and implement this proposal? My advice is that the more the team shares publicly, the more trust the community will gain. That is favorable to the feasibility of the proposal.\nIn terms of technique, technology and language used when implementing the proposal. This is a collection of high-tech technologies: Blockchain Cardano, smart contracts, Haskell programming language, combined with management techniques, information dissemination, information dissemination, etc… The fact that the team intends to release NFT makes me very supportive. NFT is not only representing the meaning of musical expertise but also a way to promote the event and the brand of the team to the community. It represents the application of the world's advanced technology to the work of the team. I think it's mainly built by core team members who already have many of the skills I just mentioned. In addition, the team can completely mobilize external support to propose to be implemented in the best way (possibly with the team's ability - it is not necessary). Support here is understood not only in terms of money but also in terms of human resources, technology, etc. I believe that the team will do a great job when implementing the technical and technological aspects of the proposed implementation. \nIn terms of risks when implementing the proposal, the team is also quite clear about 3 risks that can be encountered when implementing this proposal: Identity Theft, Unauthorized remixes, and templates through content leaks. Security vulnerabilities of Smart Contracts through third-party thread providers, etc… - accompanied by satisfactory solutions to prevent risks. Here, I add a fourth risk which is: Ada slippage - which will affect the budget of the proposal. We know that the cryptocurrency market is in hibernation (devaluation of digital currencies), so Ada may depreciate when the team receives from the Catalyst fund, then the team will face the problem of a lack of budget to implement the proposal. So my advice would be for the team to take a close look at Ada's slip-in budget to fit the budget requirements in the proposal.\nThose are my positive comments, the team can review and adjust this proposal. Behind what I wish the team added - I agree with the feasibility of the proposal. I vote 4 stars.", "q1r": 4, "q2": "The roadmap of the proposal was presented in quite a detail by the team with the time until March 2023 (including the current milestone and the next 2 phases). This is a reasonable roadmap and milestone for a proposal that takes time to implement. The work steps to be performed in each stage are very specific and in a step-by-step sequence - containing all the necessary information. I am very pleased that the team has attached the milestone roadmap to specific months of the year. This has made it easier for the community to evaluate the transparency and auditability of the proposal. As a PA, I have evaluated several proposals and have found that not many teams do this.\nI don't feel satisfied without the presence of job performance indicators (KPIs) and key metrics. The team needs to look more carefully and specifically to come up with KPIs and key metrics. The team just mentioned the global KPI and human rights indicator title without any reasoning or specific numbers. We all know the role of KPIs and key metrics in auditing. I consider KPIs to play a certain role in demonstrating the transparency and auditability of the proposal. So my advice is to quickly add KPIs and key metrics to the proposal. By doing that, this proposal will have higher transparency and auditability.\nI think the team should define \"what the success of this project looks like\" in a clearer, more specific way to demonstrate auditability rather than just stating the project's success in terms of revenue. and NFTs.\nThroughout the proposal, problems and solutions were clearly articulated by the tissue group. I hope the team will refer to my comments in a positive way, noting the addition of KPIs and key metrics. I both agree and disagree with the auditability of the proposal. I vote 3 stars.", "q2r": 3, "assessor": "z_assessor_2552", "no_vca": 7, "ne": 4, "ng": 2, "nfo": 1, "vca_o": 2}, {"id": 4486, "q0": "This project can in my opinion be best understood as three separate parts that together could form a highly impactful but also risky implementation as a Catalyst proposal.\nFirst, the main proposer Kenoye Naku is a music industry expert and founder of Paradime, with the intention to bring remixes to the mainstream. This idea in itself is quite cool: how many times have you been annoyed that parts of your favorite music cannot be used on Youtube or wherever else you want to use it? The solution: allow artists or labels to sell rights to remix or sample music. \nSecond, use NFTs and blockchain technology to overcome the many obstacles and vested interests in the implementation of this idea.\nThird: Do the whole thing on Cardano with CNFTs because it is cheaper, greener, the community is more awesome and there is project Catalyst.\nTo achieve the second objective, the proposer has partnered with a full stack engineer and a solidity developer. This team, I would assume, might pitch their idea with other blockchains and have launched this  this on Ethereum last year with new updates coming every quarter.\nTo achieve the third objective, we are presented with a Cardano implementation team around the Cardano Canucks staking and publishing folks, bringing credible Cardano ecosystem muscle to work on this and deploy the requested 80k. \nThe proposal has the potential to bring a lot of users to Cardano and create buzz with remixing contests and the potential to create new products and dApps around this launch. in that sense, it does fulfil the challenge brief extremely well.\nI also see some risks, however, as it appears that this project is Solidity-first and conflicts or unresolved contractual issues between the parts mentioned may disrupt the implementation of this proposal. While I should discuss this in the following sections, I see it as highly relevant to Impact as well. I would have preferred the Cardano Canucks team to propose this instead, to ensure funds are kept with Cardano-first builders and some legal contracts would have been drawn up (there were some Catalyst close-outs about legal templates for proposal teams presented by Len Delunas in Town Hall if I remember correctly, other such resources surely exist).", "q0r": 4, "q1": "The budget and timeline are sufficiently clear, but the coming together of Paradime, Canucks and Internal Team are not. More time should have been dedicated to draw up clear arrangements and provide risk assessment and mitigation. With a project this ambitious that might result in future funding requests, it makes sense in my opinion to start with strong project management basics and prepare as many contingencies and documentation as possible. Having said that, the overall team looks very strong and credible and the risks of a project of this kind seem worth the potential return and value of partial implementation or learning curve from bringing the development to Cardano in the first place. The main proposer seems very likeable and intelligent and the proposal is written with a lot of detail and care. To ensure the voter that the detail is not a result of disjointed parts coming together in an overambitious \"all-singing, all-dancing super-project\", presenting the entire team in one place and adding some overarching project management tables or diagrams would have been super.", "q1r": 4, "q2": "The Auditability section of this proposal answers a lot of Feasibility questions and vice versa. While not ideal, I find this acceptable and would trust the strong team and many Cardano \"natives\" working on this to carry the project out successfully and use their existing social media links with the community to communicate progress of this proposal. Formalizing this a bit more and putting every detail of the business plan in the proper place with a coherent narrative how the business plan will be implemented would have made this proposal outstanding, right now I still like it a lot and think it will be sufficiently auditable, but would love the proposers to tweak it a little bit for the sake of mitigating some of the risks mentioned.", "q2r": 4, "assessor": "z_assessor_2554", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 4066, "q0": "This is a profound and well-thought proposal. It is so comprehensive it approaches a business plan. Paradime is a disruptive music platform that has a different perspective from the other music platforms out there. By focusing on the artists, publishing and minting remixes, being a creative platform and allowing token issuers to give their fans unique value through the sale of commercial remixing rights, the platform aims to be fair, easy to use, and highly innovative in order to be the image of the next generation of music consumption experience. It is a novel application built on top of Cardano that will attract new users. Also, it is a real-world application using Cardano tools that will benefit musicians and all those that consume their music. Moreover, the goals of the proposal strongly align with the challenge settings, the proposer will be delivering a high-caliber product to expend the possibilities of the available dApps in the Cardano ecosystem.", "q0r": 5, "q1": "The team is composed of Vivek Nankissoor, Michael Stewart, Dubem Okoye and Nhan Trieu. They all have relevant skills in web analytics, marketing automation, software development, law and music. In addition, there are detailed bios in the proposal for them but unfortunately no LinkedIn page links were provided to verify their claims. The budget is broken down into topics, with cost and duration estimated for each of them. However, more details could have been provided. For instance, in the \"Cardano Blockchain / Haskell Developer(s)\" item the team could have explained how many members will be used and many man-hours will be needed. Assuming they will only use one developer that would mean a cost of USD 10k a month, which is overpriced. Also, the timetable provided is in line with the tasks required. Furthermore, the proposer lists three main risks the project faces, identity theft, unauthorized remixes through content leakage and smart contract security loopholes. They have provided effective mitigating solutions for all these risks. For example, for the last one, before a stream provider is approved, they will be manually vetted to help prevent any loopholes.", "q1r": 4, "q2": "A roadmap with milestones was provided but it could have been better organized. First, I believe they mistakenly called the July-November phase by phase two when actually that was supposed to be phase one. Second, they listed a bunch of milestones prior to the description of the phases (ten to be more precise) but never linked them to when they believe they will be completed. Instead, the phases could have been further divided (lasting from one to two months, for example) and these milestones fit in the right phases. Third, they indented phase two for no reason which only contributes to more disorganization of the plan. Apart from that, the proposer signaled in which months the phases would happen which is helpful. Some of the KPIs defined are number of major features per quarter, which they expect to be at least one, and number of remixes created and published. These are good objective metrics to assess if the platform is gaining traction and is being improved upon. Finally, the proposer could have provided a public channel to update the community on the progress of the project. A lack of an easy way to check the status of the proposal directly hampers its auditability.", "q2r": 3, "assessor": "z_assessor_2513", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6896, "q0": "-\tAwesome proposal submission the arts and entertainment space focussing on music and challenging business models in the music industry as we know them\n-\tThis proposal brings together Digital Rights Management, Gamification, Incentivization, and social networking features all in one platform aiming to decentralize and disrupt the music industy\n-\tIn doing so, it challenges the Cardano Ecosystem to provide tools needed for such innovations to materialize and also positions Cardano to compete with some recent products like Audius (https://audius.co/)  & the UtopiaMusic ecosystem (https://utopiamusic.com/)\n-\tThe business model is clearly thought out and planned, and the big challenge is more about implementing features, scaling up rapidly. This can benefit from Cardano’s roadmap for scaling up from the Basho era features (https://roadmap.cardano.org/en/basho/)\n", "q0r": 5, "q1": "-\tThe longer term roadmap, vision and mission have been clearly explained and the immediate objectives for Phase 1 and Phase 2 implementation until Q1 2023 with the release of a mobile application is ambitious but definitely feasible given that the team is not starting from scratch\n-\tThe cost breakdown appears to be adequate and brings together competencies much needed at this stage ( technical, legal, customer experience design )\n-\tThere may be some gaps related to go to market, i.e marketing and communications campaign and gearing up with an operations team, business developers & partnership managers  to develop the partnerships needed. Setting up a business model canvas to explore an operating business model could highlight some other gaps or hypotheses that the team is making ( https://www.strategyzer.com/canvas/business-model-canvas) \nIn order to accelerate time to value, the team could consider looking at some of the references below: \nSome developments in the Ethereum space with regards to royalty standards : \n-\thttps://eips.ethereum.org/EIPS/eip-2981 - standard for royalties in Ethereum\n-\thttps://cips.cardano.org/cips/cip27/#simplesummary standard for royalties in Cardano\n-\thttps://www.openlaw.io/ - platform for legal smart contrats\nDigital rights management : \n-\thttps://www.zdnet.com/finance/blockchain/new-platform-uses-nfts-as-a-gateway-for-digital-rights-management/ \no\thttps://rair.tech/ - Blockchain based digital rights management platform\nCardano ecosystem integrations that may be of interest : \n-\tProfila for CRM from Cardano ecosystem\n-\thttps://www.clanity.com/#Platform  for social marketplace from Cardano ecosystem including business to business and business to customer features.\n-\tIntegration with lending protocols to faciliate liquidity for those purchasing rights to create content from artists\no\thttps://www.meld.com/ from Cardano ecosystem\nThere are also some similar proposals in Fund9, so probably setting up a Cardano community focussing on the music industry, eg a Guild or even a consortium going forward could benefit everyone : \n-\tDecentralizeMusic.com, https://cardano.ideascale.com/c/idea/414289\n-\tProject Catalyst... for Musicians , https://cardano.ideascale.com/c/idea/414440\n-\tCardano Music Marketplace, https://cardano.ideascale.com/c/idea/416274\n-\tFML : P2P sync licensing protocol , https://cardano.ideascale.com/c/idea/418686\n-\tCardano For Musicians , https://cardano.ideascale.com/c/idea/419013\n-\tPerma-music rmNFT Marketplace, https://cardano.ideascale.com/c/idea/415152\n", "q1r": 5, "q2": "-\tThe team has laid out ambitious objectives in rolling out new features and customer acquisition. This could benefit from a clearer timeline, allocation of budget and capacity for a specific phase reserved for go to market with a stable product. As this is an arts & entertainment space with active players the product needs to be solid and stable in order to develop the acquisition level it clearly deserves. Poor user experience could probably adversely affect growth, so some caution may be needed there. The team is rather experienced, so I would assume this is taken care of.\n-\tNonetheless, some operational KPIs may be handy as the user-base scales, eg, some performance related metrics like number of crashes of application, outages, support requests and resolution rates. This could inform the sizing of the operations team needed as the application scales, and  I sincerely hope it will\n", "q2r": 4, "assessor": "z_assessor_2845", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 12647, "q0": "This proposal effectively addresses the challenge. Providing copyright to remixes using NFT and sharing profits based on its popularity is a great idea. A lot of remixes are unlicensed and taken down even though it's great and goes viral, which are unfortunate things that shouldn't happen. So I welcome this project.\nThank you for explaining in great detail the distribution of music copyrights and the features of the project. But I think the project is leaning a bit more in favor of the original artist. As nowadays some remixes are mixed before they claim the copyright, because very small number of remixes invested and become famous makes the sales high. So I suggest adding some rights of the copyright buyer about revenue sharing, maybe depending on how long the track is used, when the first remixes become viral, the song will become more famous and will receive more requests to buy using the copyright.\nThat is my opinion and a small request about the project, hope you will listen. The project is very detailed and complete and I couldn't ask for more. I rate this part very highly.", "q0r": 5, "q1": "The proposed scenario is very detailed, it defines each action to take place. Although not the most detailed scenario, I believe I have a safe understanding of its development. I have no further comments on the proposal's roadmap, as I think the workload provided is satisfactory and in line with the team's human resources. Financially, I think the amount requested is reasonable given the scope of the project, and simple to understand how it will be used. This project has great opportunity for implementation, the team has experience related to this field, and proof of their experience is provided in full.", "q1r": 5, "q2": "Thank you for providing clear goals in the progress of the project. Constantly updating new features based on user feedback shows that the team is always working to improve and fix defects. One requirement is that you should list clear KPIs and metrics for me to accurately measure how well the target meets or exceeds the target. We hope that you will publish user opinion surveys and related metrics to the community to create closeness and easily receive help from the community. I agree with this part, I think I have understood the proposer's vision for this project.", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14507, "q0": "This proposal appears to be in line with the challenge criteria. Within the proposal, Paradime Audio presents a beta version of the application, exhibiting their progress, the application for remixing, and demonstrating the overall ease-of-use for a wide spectrum of consumers. The website was simple to navigate and use. The challenges that this plan seeks to address could have been explained more thoroughly. They did go into some specifics in the key challenges part. This project team has a thorough understanding of the difficulties that musicians face. However, for those readers who are unaware of how horrible it is, a more detailed description of the primary obstacles for artists and remixers would definitely be beneficial. On the Cardano blockchain, Paradime Audio offers a business use-case for music. This appears to be a very appealing chance to bring new creative talent to Cardano through this unique enterprise. It also appears to correlate well with several currently developing Cardano-based music streaming solutions, and I believe that new ideas like the remix competitions have the ability to draw a lot of attention to their project and Cardano. This appears to be a very appealing option for anyone with musical talent.", "q0r": 5, "q1": "The plan and ensuing timeframe are thorough and precise. They are divided into two parts, each centred on a specific blockchain, beginning with Polygon because the developer only has Solidity experience, and then from July to November, the focus will be on implementing the platform on the Cardano blockchain. The budget is appropriately broken down, and it naturally exclusively covers Cardano blockchain development. A number of departments have been considered, including servers, user experience, legal,  marketing, and development . The numbers are acceptable and realistic, and they can lead to the desired results. The team has provided extensive information about their abilities and previous work.", "q1r": 5, "q2": "The team makes a very compelling case for their roadmap. Additionally, it describes how to keep up with project updates. They do look to be active on social media and to be interacting with their followers. In order to reach particular milestones, such as the deployment of Cardano, they have identified their obstacles and the technical talent requirements. The plan appears doable and reasonable. Although a little general, the budget was kept within acceptable bounds. In addition to the marketing and promotion charges, I would have anticipated that legal services for a project like this one involving music rights would be on the upper end of the spectrum offered. It would have been fantastic if the proposal had included additional information about what success will look like once the system is fully running. I would advise the team, if this application were to be funded, to present a compelling vision for what the project would look like when it is fully completed.", "q2r": 5, "assessor": "z_assessor_4060", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Allow artist to sell the rights to remix and sample their music via NFT's. Allow creators to remix commercially | monetize | pay royalties", "experience": "\n\nFull Stack Engineer with 8+ Years experience\n\n\n5+ Years in the music industry as a Producer and Recording Artist\n\n\nWorking MVP / Beta\n\n\nSolidity Development Experience\n\n"}