{"id": 421982, "author": "gabrielaxel", "title": "Dynamic mind-brain NFT design", "url": "https://cardano.ideascale.com/a/dtd/421982-48088", "category": 26595, "amount": 265500, "description": "Basic ID mechanisms, e.g. fingerprints/keys, are ill-suited for accelerating cybersecurity risks and dynamic complex environments\nCurrent NFT design is too simplistic to represent dynamic brain states", "f6_no_assessments": 5, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"id": 13636, "q0": "This is the longest proposal in Catalyst that I know of. In terms of ideas, this is really a very innovative idea and can create a new revolution in the improvement of Cardano. However, in the proposal I do not see a detailed description of how the user will reach and use the product. For example, how can users use dNFT? Who has permission to create dNFTs? How can users who own this dNFT use it? Those are the issues that the writer proposes to clarify. How about assessing whether this proposal solves the problem posed by the Challenge? I think \"Yes\" and this proposal completely solves the problems presented by the Challenge. Because this proposal will help more people want to own this dNFT to increase security when interacting with decentralized applications. That will help increase trading volume on Cardano and attract newcomers to this dNFT because of the innovative ideas it brings. This could be a groundbreaking proposition. If this idea is successfully implemented, I believe a lot of people want to use it without the need for massive advertising. So the 5 star rating is one that I find extremely relevant to this recommendation.", "q0r": 5, "q1": "Looking at the team and their work experience I see that they are talented people in neuroscience, specializing in brain. I regret that they are missing a good programmer on blockchain and especially a good programmer on Cardano. I have talked to a lot of programmers on blockchain even though they have a lot of experience programming solidity on ETH, but when programming on Cardano they find it very difficult. So, with a highly innovative and groundbreaking proposal like this, it takes a programmer who is extremely good at haskell and proficient in writing smart contracts on Cardano. Since this is a highly groundbreaking project, there will be no source code to refer to and learn from, but must be self-created. I fear that your team will be hard pressed to find such a core member in the market. Because I used to do that too and had a lot of trouble finding an average programmer who could program on Cardano. I appreciate the core team and advisors, but I regret that you are missing an extremely core person and determine 80% of the success of the proposal. Not to mention the implementation of dNFT, there are also problems with Oracle, the problem of loading data for dNFT. How to continuously and accurately update data from the data center to get information and images of the brain of a user or a certain member, for example. With all the above notes I think I can only give 3 stars on this recommendation.", "q1r": 3, "q2": "It is extremely difficult to assess the success of this proposal at the present time. As this proposal is not like the proposals due to technical difficulties, infrastructure as far as I know it is very difficult to complete the proposal in 3 to 6 months. However, it is possible that my views may be limited and that I am not up to date with new technologies. So I think the success of this proposal is probably 30-40%. Next, the success of the proposal depends on 80% of the people making the product who are programmers who are knowledgeable about blockchain and especially must know how to program in the Haskell language on Cardano. At the same time, that programmer will have to be a very creative person because there will be almost no reference material. I see a lot of huge challenges presented to your team. In particular, technologically by feeding data into the dNFT so that the NFT transforms. Currently only LINK is doing the best but I see very few projects that have succeeded in turning static NFT into dynamic NFT, which proves that Oracle technology still has many problems to implement. This further reduces the chances of the proposal being successful if it is funded. However, that's just a subjective perspective from me and I still hope something extraordinary happens with this idea because if it succeeds, it could help the Cardano ecosystem to have a great product. impressive and attract a lot of new users. I would give this recommendation 4 stars instead of 2. Hopefully the project team will not let me down.", "q2r": 4, "assessor": "z_assessor_3703", "no_vca": 3, "ne": 2, "ng": 0, "nfo": 1, "vca_o": 2}, {"id": 72, "q0": "The proposer described the issues in their Problem Statement : (1)Basic ID mechanisms are ill-suited for accelerating cybersecurity risks & (2) the current NFT design is too simplistic to represent dynamic brain states.  The team proposed to work on a solution: creating dynamic NFTs that contextually map to dynamic brain signatures, to be paired with decentralized keys for authentication.\n\nThe proposal fits within the challenge as the problem statement defines a problem within the challenge which needs to be solved (ID & authentification). If successful, the proposal will have a positive impact on the Cardano ecosystem with the creation of DNFTs for Cardano, increased usage of the blockchain ( Cardano and SingularityNET's AGIX tokens), and future integration of the solution with Atala PRISM. It is an innovative solution with great potential.\n\nDespite the proposal articulating how it will add future value to the Cardano ecosystem, it is very difficult to quantify the potential IMPACT of the project and it potential uses in terms of number of users. To gather the data, and then to use the data later on for authentification purposes, it seems users will require to have a device to analyse their biometric markers (brain waves etc.). Affordability is essential for a solution to be widely adopted and used but the cost of these devices it not mentionned. If the cost is high, it means the target audience could be small. Next is Practicality, the solution might be superior to passwords and crypto keys however if the solution is somehow impractical, its usage will be limited. Is using this solution more practical than a traditional authentification method? I am unsure. Last, funding this proposal means funding R&D, for which the results have not yet been proven. To be widely adopted, this solution needs to work and be as, if not more, secure than traditional authentification methods. Nobody would want someone else to access critical data by cheating the method.\n\nAs funding amount increased, we as a community need to be aware of the risks of funding an R&D project as well as the size of the potential target market. High funding (+ past and future rounds) targeting a nich market might not be the best use of funds compared to other app proposals, this is why I rate IMPACT of this proposal a 3/5.", "q0r": 3, "q1": "The proposer gave a good account of what experience/skill sets will be necessary to deliver on the proposal as well as a complete description of who they, and their partners are, including their credentials, roles and past experience which brings confidence that they can lead this project to term.\n\nThe budget is outlined clearly, understandable and broken down into identifiable items (management, development, engineering, marketing and equipment). The budget seems to be reasonable for a project of this kind and size, to achieve the set goals. The project is likely to seek further funding to progress.\n\nThe proposer provided a detailed plan and roadmap, a timeline for execution that is realistic (3 months/6months/12months goals), as well as identified some the risks to the project and given some indication of how they will mitigate them. (Finding the right team members to work on the AI, grow the user base via marketing/social media and the speed of research findings.)\n\nI rate feasibility a 4/5. Given the experience, team and plan presented, it is likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposers provided a roadmap with milestones and a time horizon for achievement however the proposers themselves warned that much of its roadmap is open-ended, it is hard to define exactly what will constitute progress. Added to this, the community needs to be mindfull of the complexitiy of auditing a project that has participated in past funds and will participate in future funds. The team is keen to provide and share their progress via screenshots, documents, diagrams and other means.\n\nUnderstandibly difficult due to the nature of the project, the information provided is however not sufficient to precisely and easily audit the progress and the success of the proposal, this is why I give auditability a 3/5 rating.", "q2r": 3, "assessor": "z_assessor_2040", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1, "reply": "Impact: The assessor made a solid review, however, some crucial points have not been fully understood or read in detail. \nThe assessor views a need for expensive equipment as a blocker to the implementation of the proposal. However, such equipment is not mandatory and is only an addition to other methods of mapping the neural signature. Therefore, the project can and will be implemented without specialized hardware. Biometrics are only one component of the R&D. The other is an already functioning MVP (Architex), which is described and linked in the proposal.\nThe second issue is related to the asking fund's amount. It is not up to the assessor to decide if the amount is too much in his view and compared to others, only if it is too much for the delivery of the actual proposal. Voters decide if the project is worth funding in comparison to others.\n\nAuditability: The assessor did not comprehend the complexity and details of the proposal.\nThe goal and metrics of this proposal are simple, in terms that it will deliver a solution to map neural waves to a dynamic NFT. The success of this proposal is defined as a usable technical solution. Next phase of the project will be about scaling up, increasing usability and users based on this technological solution unique to Cardano.\n\nBased on these points, we consider that this assessment should be removed."}, {"id": 4122, "q0": "The dNFT idea for authentication using bio-signatures developed through mapping the human brain offers a possibility to reduce the stressful situation of getting locked out of your KuCoin, MEXC, or other trading accounts where there is no human to talk to, and which require 4-6 ways of communication to verify your account when you forget the password they make you update every few months.\n\nIn all seriousness, the cyber security threats faced by humans in a decentralized future require better ways to authenticate who they are in order to protect them from unauthorized access to their assets and accounts.\n\nI see this as an essential part of expanding our access to new technologies and promoting a decentralized future.  Is this proposal the correct approach?  We won't know for sure until the research is complete, but it's a step in the right direction, but financing qualified experts to do the necessary research and determine how we may be able to use our unique biologies to provide security and stability for online systems.", "q0r": 5, "q1": "The budget breakdown could have benefited from more details on rates and expenses in developing this research project.  However the roadmap/timeline and milestones lays out thoughtful 3/6/12 month alternatives, depending on availability of funds and thus the researchers ability to deep-dive and continue working on this project pending support from the Catalyst program.\n\nIn any case, the teams overall intention and ability to develop appropriate steps in the direction of a functioning Neuralprint product are promising, and certainly worth an investment in this effort.", "q1r": 4, "q2": "This is a strong proposal in terms of value offered to the community, and the teams ability to assemble a qualified and competent team to provide this work.\n\nAs the team confirms in the auditability section regarding key metrics for success, \"much of the above is open-ended.\"  My neutral rating for auditability was due to this open ended nature.\n\nThe one thing I would have liked to see in closing this proposal, due to the academic nature of the work and the contributors, is that they treated delivery the same way they would in an academic environment.  As that relates to research for the Cardano community (and funded by the community) a scholarly paper or whitepaper detailing the results of the research could be appropriate to advance public knowledge and work towards new effective authentication solutions in the future, with or without the proposal team as they are able/interested to continue their work.", "q2r": 3, "assessor": "z_assessor_2517", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8142, "q0": "After gaining widespread acceptance across the Web3 community, NFTs are slowly becoming mainstream, with major media attention and especially deeper involvement from celebrities like Elon Must, Cristiano Ronaldo, artists..etc. And since then NFT has become one of the most prominent public applications of Blockchain technology. The next step in the evolution of NFTs has just begun, dynamic NFTs (dNFT) are expanding the design space that NFTs can address through their ability to adapt and change in response to events and external data.\nThis proposal raised an important issue related to dNFT and the relatively large scale of impact. The problem is that the underlying ID mechanisms (fingerprint/key) are still risky regarding network security, depend on memory or a centralized password manager, and are unsuitable in complex environments motion. The current NFT design is too simple to represent the dynamic state of the brain.\nThe proposal's solution solved that problem by creating a dNFT that maps contextually to dynamic signatures and pairs them with decentralized keys for authentication. This solution has been described in great detail by the author in the proposal, the method of strict argumentation. The author has provided images, videos and examples to help readers visualize. This is a sequel to the NEURALPRINT project funded in Fund8. NEURALPRINT whose goal is to unlock deeper functions in Web3 through the use of brain data for authentication. dNFT is the representation of this kind of data on the Blockchain. The project's orientation is mainly around self-sovereign identity (SSI) and decentralized identity (DID). This project will be an innovative and groundbreaking authentication solution using cutting-edge technology. From there, it will bring unique value to the Carano ecosystem, attract many users and promote the sustainable development of the ecosystem. In addition to the solution, counterfeiting has also raised three risks that may be encountered during the implementation process. These risks have all been calculated and there are solutions to reduce them.\nFrom the above analysis, I see that this proposal perfectly meets the \"Dapps, Products & Integrations\" challenge.", "q0r": 5, "q1": "The proponent provided a plan with a clear roadmap and timeline. For better, the author can present the plan by month (or week) so that the community can easily track the progress. In addition to this proposal, the team has a number of other proposals also submitted in Fund 9. But the team has a plan to allocate time and manage and divide each member's work to match the workload of each proposal. Ensure progress and goals of each proposal. They have also had proposals funded by Catalyst from previous Funds, with experience and success in the past.\nIn addition, information about the members of the implementation team has also been described in full and detail by the author in this proposal. I'm really impressed with the team. They are all people with a lot of experience and proven competence. Identity is also easily verified through the personal profile link that the author provides. I found them to be a perfect fit for this project.\nThe proposed budget represents 3.38% of the total Challenge budget. This amount has been allocated to 3 main expenses (R&D, Marketing & Social Media and biosensors). R&D expenses have been broken down and detailed. However, to make it better, I think the author can add an explanation and basis for calculating these costs. For example, is it calculated as a package or calculated by 1 month (or 1 hour) and how many hours (or months) is the total implementation time.", "q1r": 4, "q2": "The author has provided the main indicators that the community needs to pay attention to when monitoring the progress of the project, these indicators are related to the goals and plans of the project. In addition, the team will be dedicated to sharing the progress of the project, using screenshots of exemplary aspects of the R&D progress on architectural models (such as text documents and diagrams). However, it would be more complete if the author provided a link to the communication channels of the project with which the team plans to share that information and progress.\nThe success of the project was determined through the creation of a schema for the most useful brain architecture components to generate dNFT for NEURALPRINT technology; research and development dNFT full of dynamic features of the brain; there is much awareness of NEURALPRINT in the Web3 community.", "q2r": 5, "assessor": "z_assessor_2956", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9945, "q0": "The implications of this proposal introduce a whole new universe of potential applications and growth paths. Here, to remain concise, I want to highlight just a few synergistic concepts and their relevance to the blockchain space as well as in addressing this challenge. \n\nIn the case of authentication, in addition to increased security, the user experience of many existing dapps and services improves when identity management becomes easier. By filling the gap from a digital signature to digital twins, enables a person to message his/her preferences, through actions, at scale. Among other things, this leverages and enriches all kinds of decentralized collaboration tooling such as DAO infrastructure. There are also opportunities for self-transcendence. By learning more about one's brain states and responses to inputs and doing micro intervention exercises, one has means to mentally evolve for dealing with new powerful technologies, applications and become better at using them in purposeful ways. It means more value per user from old and new services on the platform.\n\nThe development of all these applications for example utilizes and evolves the existing NFT infrastructure, brings new dimensions to DAO operations, SSI tools and so on. Tooling for mapping mind states into dynamic tokens or even a new dynamic NFT structure alone are fundamental infrastructure for all kinds of applications to build on. ", "q0r": 5, "q1": "I see this as a high risk, high return research.There are several technological risks which may delay the project significantly. This again means that more funding is needed to finish the work. On the other hand every ADA invested will be used to chase exceptionally high rewarding science and engineering solutions. The next steps in delivering the vision require more funding anyway and the team has different choices for that. There are also previously funded synergistic and partially overlapping projects going on and that diversifies the funding risk. \n\nThe work is a joint effort of Architex, Neuralprint and Pathform. All the participants have their own well defined roles in the project. The roadmap has been divided into three and six months phases with 17 different tasks. The follow up roadmap beyond the scope of this funding round is also given. The budget breakdown for R&D presents five distinct areas of work. Furthermore, there are costs for hardware and marketing. Being a highly technical R&D project I consider the level of detailness of given information acceptable but not excellent. Information about the companies involved and the members of the team with areas of responsibility are, in turn, more than excellent. I believe the proposal gets implemented as planned.The success metric is not a binary one and not achieving the optimal outcome doesn't mean not achieving a reasonable outcome.", "q1r": 5, "q2": "The proposal gives four development entities to be tracked and reported. In addition, they will analyze the quantifiable community feedback from various media channels. I think that the qualitative approach mirrored against the roadmap is the best way to capture most of the dimensions of the R&D work. The advancements of the work are to be documented and shared with the audience as they occur.\n\nWhen this phase of the project is completed there should ideally be an opportunity to capture brain models in dynamic NFTs but any technological progress toward this goal can be seen as return on intention. Perhaps some ambitious quantitative goal for example about small scale test pilots within a certain timelines would have been nice to see even if that might be slightly out of the scope of this proposal.  ", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Dynamic NFT's that contextually map to dynamic brain signatures, to be paired with decentralized keys for authentication.", "experience": "2 neuro PhD's; startup founders. Human resources, organizational transformation. Web 3.0. Evolutionary neurosci of art. Media artist using AI & tech; pioneer in the aesthetics of data and machine intelligence; projects in 50 cities, 6 continents. Award-winning Director & Designer"}