{"id": 421937, "author": "operations", "title": "Adosia Spaceprinter Lite", "url": "https://cardano.ideascale.com/a/dtd/421937-48088", "category": 26595, "amount": 50000, "description": "The current Spaceprinter requires additional hardware and network expertise that create barriers for some users.", "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1803, "q0": "As insight for voter : Adosia SpacePrinter is a a linux distribution that runs on a Raspberry Pi and allows you to plug your 3D printer into the Cardano blockchain. The MVP was funded by Catalyst F8.\nThis proposal offers to lower the entry barrier to this application (as it currently requires hardware and network expertise) by developing a lite version deployed in the Adosia decentralized Marketplace. This proposal meets the challenge criteria, as its purpose is to increase the quality of an existing product in response to customer feedback. This will foster quick market integration by Adosia.\n", "q0r": 5, "q1": "This team has already proven his ability to deliver projects (F8 Adosia Spaceprinter MVP, Dripdropz), and this project does not require new specific skills that the team does not already have. \nThe solution is well described, with a user story : the lite printer will enable users with no hardware/no network expertise to participate in providing production to the marketplace. This will be achieved by the mean of a smartcontract that will handle each step, from the purchase order of an NFT that includes the printable file, to the payment of the registered printer operator and of the 3D designer that made the file.\nThe budget seems reasonable for the work described, but it is lacking a breakdown in identifiable items. The Adosia teams commit on completing development and implementation of the new feature in a 4 month timeline, but agains it would deserve to be more detailed to get the 5 star feasibility score.", "q1r": 4, "q2": "Success is well defined by SpacePrinter Lite beeing deployed. \nThe team plans to use git and a project communication tool like trello to show the progress to the community.\nNot having a detailed development plan with intermediate milestones in the 4 months development timeframe is not ideal for a monitoring of the progress during development. I do not remove one star for this reason as one has already been removed in feasibility section.", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5957, "q0": "I was initially thinking \"What the h... is a space printer?\" and felt a little stupid when I did not find any further description on the website or inside the proposal. A Google search than revealed that this is a linux distribution that runs on Raspberry Pi and allows plug-and-play for any printer \"into the Cardano blockchain\".  My printer does not look like he has a lot of 3D functionality left in him, but I want to give it a go. I assume that this is about minting NFTs and then creating an immutable record on the blockchain while at the same time printing the image plus provenance of CNFT ownership onto the (Spoiler alert: Anticlimax) 2D page in your home. It's a cool, creative idea and I think it aligns extremely well with this Challenge. It is Hardware, a Physical Product, and at the same time a dApp. I am tipping my hat to the entrepreneurial and visionary minds who came up with this connection. Must have for Cardano, with the potential to make waves.", "q0r": 5, "q1": "There would be no fewer than 10 people working on this proposal, including most of the team members that have brought the amazing DripDropz token distribution service (Sundae swap reverse ISPO and many, many others), Tokhun NFT Marketplace and REAL 3D printer funded in the last funding round of Catalyst. The team are Cardano OGs and highly skilled in smart contract development, running teams, delivering, and even have their own hardware store. They are already meeting online 6 times a week, which is as good as, if not better than, sitting together in a Silicon Valley cubicle. This makes it super likely that they will not disappoint and deliver a top-notch product / integration with this proposal. ", "q1r": 5, "q2": "As mentioned above, this team is meeting 6 times a week, and have been very upfront with their profiles and background information. As well-known community members and serial proposers, access to the team for audit should not be a problem at all. Git and Trello will be used for project management. What I like to see is some more specification about the finished product and how to measure success of delivery quality and distribution / adoption. Some metrics like number of downloads, number of devices connected, number of NFTs minted, re-tweets of the launch tweet, and other possible ideas how to judge whether this great idea is something the community wants to see more of, or less. That data could then be used to drive future product development and ideation. Maybe we can go full space features, or if there is no appetite for it, move the project direction a notch closer to physical product shipping - the blockchain feature is obviously a must-have, but it may be nice to gauge how virtual or physical the community vibe is in 2022. I recently read that Peak Metaverse is already behind us, and the thriving nature of the proposer's hardware store underpins this hunch. Other may disagree vehemently.", "q2r": 4, "assessor": "z_assessor_2761", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 15129, "q0": "The Adosia SpacePrinter Lite proposal addresses dApp, Products & Integration challenge by building a lite version of Spaceprinter. The team specifies that the lite version of SpacePrinter will lessen difficulty in term of hardware and network requirement for general users. If you check “SpacePrinter Cardano” in google, you will find the team GitHub defines “Space Printer” as a linux distribution that runs on a Raspberry Pi and allows you to plug your printer into the Cardano Blockchain. The intro video is a useful demo that shows the connection between Raspberry Pi and 3D-printer through your Raspberry Pi printer wallet (that contains the NFT within the Adosia Market or their partner marketplaces). The end result is that the users (who mint or drop their NFT collections) can have their 3D NFTs printed and delivered to them. The Adosia SpacePrinter is a fully cloud based printer deployed into Adosia Marketplace. Their MVP was funded in fund 8. This proposal is a complement to the Adosia Decentralized Marketplace and will allow users who do not own hardware nor technical expertise to join in the marketplace. The risk of this project is to find the best feature for the lite version that allows users to function and later upgrade the hardware. The proposal fits the challenge very well as this is a stepping stone that bridge blockchain to tangible result. The solution is not only important to Adosia adoption but also helps to promote Cardano NFT market. ", "q0r": 5, "q1": "The Adosia team has a very good track record and some of team members are behind the well-known protocols e.g. DripDropz, Tokhun, Heidrun. The team lead is Kyle Solomon who is equipped with technical knowledge on the IoT devices supported with strong team members that are very experienced in engineering, manufacturing and smart contract development. The team expects to design, build and implement the feature within 4 months. They regularly meet 6 times per week to keep their tasks on track and to troubleshoot for any unknown issues. There are 3 reasons behind my full rank (5) in their feasibility section 1) as the target is to find the best balanced features of lite version SpacePrinter and integrate them into Adosia Marketplace within 4 months, the milestones are relatively clear within this short yet possible timeframe  2) I have followed their various projects closely, claim my token drops, and appreciate their contribution to Cardano ecosystem 3) It would be great to see this project through to the end (from their F7 delivery until now). With these 3 main reasons coupled with the fact that I always rank the proposals based on the team’s ability to deliver the project successfully which I have a strong conviction. Therefore, I would like to rank feasibility of this project as 5.  For future proposals, I highly recommend that the team should provide detailed plan (roadmap & key milestones) and budget breakdown rather than only state 50K as the requested fund amount as it is recommended to specify hourly rate since fund 9. ", "q1r": 5, "q2": "The team views this project as a success when the SpacePrinter Lite is deployed to the Adosia Decentralized Marketplace. Git and Trello will be their primary tools to manage the project progress along these 4 months. As they are previously funded, they will submit the monthly report with percentage of project completion. From the conception of their 3D Design and Print NFT Spacecoins in fund 7, their initial MVP of the Marketplace and the Cardano Box System in fund 8 and now Adosia SpacePrinter Lite in fund 9, it is remarkable what the team has achieved so far. It would be a great idea if the team could do the whole run through (from users perspective) on their video clips once the SpacePrinter has been successfully deployed into marketplace. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15293, "q0": "Extending adosia will surely to some degree be useful towards both the challenge and the Cardano ecosystem. What is a bit unclear is the exact scope of this proposal. \nAs far as the description goes, a service of decentralized 3D modelling and 3D printing of NFTs is established. However, the description does not go far enough to \nenable estimating the cost-benefit ratio of the proposal nor to enable one to see how scalable the proposal is.", "q0r": 4, "q1": "The proposers are well-known within the community and have in the past implemented proposals successfully. Let me say ahead that if it wasn't for that the feasibility \nof the proposal would be rated far lower; someone unknown to the community could not afford to post such a proposal and still get funded. The only thing that is \npositive about this feasibility section other than the implicit track record of the proposers is the fact that the proposers are transparent about the people involved \nand their qualifications and that some possible risks are discussed. Other than that there are a lot of deficiencies in the feasibility section: \nNo detailed implementation plan/roadmap is presented, the budget is only posted as a lump sum and not further discussed or explained apart from the general \nconcept that is explained very coarsely no further technical details are explained.", "q1r": 3, "q2": "The proposers are pretty transparent about their different proposals, which is a positive thing. Since the description of THIS proposal however is not that clear, \nno KPIs/metrics unless the ones related to the SDGs are provided. Also, no proper success criteria are shown. While a github and trello are mentioned they are not linked.\nSince in the past, the Adosia team have delivered, there can however still be some confidence that they will provide some auditability.", "q2r": 3, "assessor": "z_assessor_2257", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Provide a lite version of Spaceprinter that is fully cloud based, driving wider adoption.", "experience": "The Adosia team has a proven record of deploying highly successful projects on Cardano, including 1st Decentralized 3D Printing Marketplace. We are the team behind DripDropz, Tokhun, and funded proposals such as Heidrun. "}