{"id": 422041, "author": "muesliswap", "title": "Liquidity Efficient DEX models", "url": "https://cardano.ideascale.com/a/dtd/422041-48088", "category": 26595, "amount": 91000, "description": "The automated market maker (AMM) model used by many Cardano DEXs is not well suited for  Cardanos eUTXO model. Moreover, it has many downsides like inefficient use of liquidity and impermanent loss.", "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 400, "q0": "MuesliSwap are proposing liquidity efficient DEX models that build on their existing efforts on the order book maker model. The proposers mention the downsides of the AMM model as used in Uniswap v2 that results in impermanent loss and lacks efficiency. The team propose to research and propose new liquidity provision models that help to address these problems. The results of this proposal will be made open source to the benefit of the wider ecosystem. The proposers could have added more specifics on what exactly would be novel with the research they are carrying out with some examples to be more explicit on how they will try to solve the problem. This proposal would ideally be located in a development and infrastructure type of category as they are producing open source work for the betterment of the ecosystem. Overall as the proposal will be fully open source and be usable and relevant for all the DeFi products in the ecosystem I would agree this proposal could create impact for the ecosystem.", "q0r": 4, "q1": "The breakdown of the timeline for this proposal is divided into research, development and audit. During the research stage a paper will be produced to disclose the findings of the work, development will take that work and make examples and finally the code will be audited to provide more confidence that it is secure. The budget breakdown is then provided which adds more depth into where the funding will be used. They mention they will cover the remainder of costs to get this work done as it will not cover everything. The itemised list breaking down the tasks and hours is sufficiently detailed and even breaks up the on-chain and off-chain work. For the team involved they mention there are 9 developers involved in the MuesiliSwap team and mention their release of the MuesiliSwap DEX which is an order book model which is what gives them the relevant experience. The proposers provide a Github repository showing evidence of their previous work and also have the evidence of a fully functioning DEX using the order book model. It would have been good for the team to share their professional link backgrounds if possible. Overall with the evidence provided of previous execution and development delivery it appears very likely that this proposal will be feasible due to the teams experience in this area.", "q1r": 5, "q2": "Tracking the progress of the proposal consists of the research paper, the open source development and the audit. All of these key progress points are open source and publicly available to the community which will make them easy for the community to audit but also good for the community to benefit from the efforts made in this proposal. The success for this proposal looks at enriching the DeFi ecosystem with better approaches to utilise the eUTXO model over competing account based mode blockchains. The only main feedback here would it would be good to have been more specific on the exact innovations and outcomes the proposal is looking to deliver in more depth than improved liquidity provision models. This would make it easier to verify and audit whether this has been achieved. Overall it should be easy to audit this proposal for the community. In future proposals the team would be advised to provide as much depth as possible into the exact areas of focus for the research so it can be more easily scrutinised and evaluated or the statements that we are unsure on exactly what we will confirm out of this research. This clarity would inform the assessors and voters how far along the team are in pin pointing the potential outcomes of this research and the potential value that could be achieved that the community would be able to verify.", "q2r": 4, "assessor": "z_assessor_2073", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1216, "q0": "This is a proposal to research a new more efficient liquidity model for Dex on the cardano platform, in line with cardano's unique EUTXO accounting model. The project is made by OpenSwap Technologies - the team behind MuesliSwap. MuesliSwap is a Dex exchange combining AMM and orderbook on the cardano platform that has been in operation since November 2021. Therefore, I have no doubts about the competence and seriousness of this team.\nThis research, if carried out, will promote more appropriate and advanced liquidity models on Dex to reduce risks for users when providing liquidity on Dex with EUTXO model, reducing risks Irregular losses, increase capital efficiency.", "q0r": 5, "q1": "I had to read both the plan and the proposed budget to see the progress of this team. Because the plan part they state the content is quite basic. They will implement the project in about 4 months, possibly longer depending on the research progress, and work with partners.\nThey will focus on researching traditional liquidity supply models, with the advice of financial experts, thereby discovering new liquidity models for Dex and studying the appropriate technical structure for the model. cardano's EUTXO accounting model. I basically understand this direction of research. The team identity is public and competent, so I am confident in the feasibility of the project.", "q1r": 5, "q2": "In this project, they will cooperate with an audit company both on code and costs. They plan to make the code publicly available on github - an easily accessible page for all the community. In addition, the reports will be summarized in writing and communicated via twitter.\nTwitter and github are channels that are easy to follow, and open to everyone.\nThese are the few projects that use the audit unit in Catalyst. It is a testament to their transparency and willingness to disclose information to their community.\nTheir only downside is that the visualization of successful results is not really clear. I can't figure out how much research they will have and how many new liquidity models after this process. And it's also possible that it will fail altogether. That's why I can't give a maximum score yet.", "q2r": 4, "assessor": "z_assessor_2217", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 2481, "q0": "Cardanos EUTXO accounting model is very different from ETHs Account based model yet most Cardano DEXs use a model developed for the ETH account model. \nThe team identified many problems which the AMM DEX model has and is looking for solutions. Those problems not only affect the DEX but mainly the users. \n\nShould the team finde a new better suited model for Cardano not only MuesliSwap would profit but all Cardano DEXes. \n\nDEXes are an integral part of the ecosystem which is why a successful solution from the team would have a huge effect on the whole Cardano DeFi sector. ", "q0r": 5, "q1": "The Team presents a good case but research is never definitive. There is a chance that the team might not find a better solution or the implementation is to complex yet this scenario is pretty unlikely. \n\nThe team is known in the Cardano Community and is highly skilled. The breakdown they provided budget and time wise is realistic and shows that they have thought about the journey they are about to go on.\n\nThis is why it is likely that they will succeed with their task. ", "q1r": 4, "q2": "The information provided by the team is more than enough to audit the whole research and development. The team has a communication strategy and is know in the community and always did a great job communicating their progress. \nThis is makes the audit of the development by the community fairly easy.\nFurthermore they plan on going open source which is the maximum audit you can do.", "q2r": 5, "assessor": "z_assessor_2307", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3801, "q0": "I am glad upon realizing that many OG builders in Cardano are submitting Catalyst proposals during this Fund 9. This might be triggered by the fact that we are in a bear market. However, this is signaling that Cardano accomplished and successful builders are not being lax and not giving up building. Here I am also seeing the positive side effects of having many DEXs in Cardano. They are sharpening themselves to be better than their competitors so one of them can be the market leader. Ultimately, the end users or customes will enjoy the greatest benefits from this betterment.\n\nIt is true that our presently working DEX still have a lot of room for improvement. Upcoming DEXs such as MalaDex is promising to solve the impermanent lose issue and better capital liquidity and efficiency, while WingRiders has USDC and interoperability via EVM sidechain such as Milkomeda. I just reviewed BashoSwap’s proposal and they are developing transaction-chaining model for better UX through reduced latency and no/less slippage. It feels so good to see that ecosystem is so vibrant and the competition is so healthy in Cardano ecosystem despite current market condition. This proposal will also be beneficial to all these DEXs since the result will be utilizing the power and advantages of eUTXO-based blockchain. I believe all those benefits outlined and detailed in the proposals will push deeper and vast adoption through much more effective and efficient yet still enjoyable consumption of the products of blockchain technology. Also, the implementation of this proposal may make our dApps to be more decentralized since trusted element such as transaction batchers will be eliminated and also it will eliminate extractable values problem.", "q0r": 5, "q1": "MuesliSwap is the de-facto first working DEX in Cardano ecosystem. Although it is not the AMM everyone expects for, it still provided important service such as the price discovery of fungible native assets/tokens. This achievement speaks volume for itself and a solid proof that the team especially the developers in OpenSwap/MuesliSwap have the necessary experience, skills, and knowledge to deliver this proposal. Budget is detailed in clarity and reasonable at development/engineering hourly rate of roughly USD 80. The rate is fair when compared with other projects in the ecosystem and similar service providers in Haskell/Plutus-based smart contracts.\n\nImplementation timeframe of roughly 6 months is also perfectly acceptable since this is a development work with good amount of investigation and research works preceding it. The deficit in budget will be covered by MuesliSwap team which mitigate the risk of budget/financial problems. Other risks are also well-addressed and the proposer team is assuring they are well-prepared to tackle any challenges in the delivery process.", "q1r": 5, "q2": "The execution of this proposal is divided into three major phase serving as the key milestones: research which result in paper (2 months), development (3 months) which result in the improved smart contracts, and audit (1 months) for security purpose. They are well-detailed and broken down into actionable plans. The research papers will be published and open for anyone to read and the smart contract codes will be in public Github repositories that can be monitored and tracked by curious and interested community members. The audit details and results/reports will also be made public. Twitter Spaces that can serve as AMA session as well will be held weekly.\n\nThe success is simply defined as the outcome delivered through this proposal will be beneficial and applied by all dApps in the Cardano, enriching the ecosystem especially DeFi area, and ultimately giving Cardano extra competitive advantage over account-based model blockchain. This success can easily be quantifiable with the number of projects or protocols using the resulted research and smart contracts. I think this is as transparent as we can get. Lastly, I want to conclude that all of these invaluable findings will be made into open-source for the greater good of the whole Cardano ecosystem. I can feel the dedication of the team and strongly hope this proposal will get funded. I commend the MuesliSwap team for this initiative and appreciate the will and effort. Best of luck and Godspeed to this proposal!", "q2r": 5, "assessor": "z_assessor_2482", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7500, "q0": "The proponents identify one of the biggest problems within our ecosystem: the difficulties that our DEXs are having to operate within an eUTXO structure.\n \nAnd for this they offer a double solution: study and implementation of a model that makes this type of apps more compatible with the original Cardano structure.\n \nIf the company is successful, we would be talking about one of the best destinations that the money from our treasure can have. Since it would have a hugely important impact on our ecosystem. Since the developers are committing themselves to share the results of their study in a paper.\n \nFinally, the proposal fits perfectly within the framework of this challenge, so no points can be deducted in this category.\n", "q0r": 5, "q1": "This is another strong and solid category of this project, since the proposers present themselves, without a doubt, as the ideal candidates to carry out this project. I think that everyone in our community knows about the history and work of Muesliswap and we have even used the application on occasion.\n \nThe proposers attach the links that prove that they will be in charge of carrying out this task.\n \nOn the other hand, the proposers present a clear and quite ambitious timetable (which makes me suspect that they have already started the study). And they present a budget that is well broken down and quite reasonable for the magnitude of the proposed project.\n \nFor all these reasons, I believe that the project is highly feasible.", "q1r": 5, "q2": " \nThe proposers offer different means and channels to make it easier for the community to audit their work.\n \nThey will be doing weekly Twitter Spaces to share their progress and at the end of their study, they will share their results in a paper that will be freely accessible to the entire community.\n \nThe proposers present metrics and kpis. And to conclude a perfect presentation, they lacked a roadmap with detailed and clear milestones. This is important since it would allow the community to carry out a better control task during the development of the project.\n \nFor this reason, only one point can be deducted in this category.", "q2r": 4, "assessor": "z_assessor_2899", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11458, "q0": "As we know, current Defi apps are limited by financial inefficiency. Therefore, the proposer would like to research a novel liquidity provision model which could take advantage of the Cardano EUTXO. In my opinion, this is a very promising proposal and it fits well with the Challenge. If successfully, this protocol could protect users form loss, increase liquidity that help attract more Defi users to Cardano and mitigrate the risks for new users, as a result, improve the competitiveness of the Cardano Dapp ecosystem. I fully support their idea. ", "q0r": 5, "q1": "I think the feasibility part is ok, but some parts need to be more detailed. Regarding the team, I am more convinced about the feasibility of this project because the team behind this idea is OpenSwap Technologies and MuesliSwap which is one of the biggest decentralized apps on Cardano. And through process of carrying out their last project, they gain experience in developing Plutus smart contracts, off-chain codes, auditing process which could be applied to this proposal in Fund 9. I know there are 9 core members in their team now. My suggession is that the proposer should introduce shortly about each member in the proposal scripts: who they are, background, project roles, experiences, and if possible, with provided link for more community reference. It shows their professionlism in writing proposal script and their seriousness in this proposal. Next, speaking of their plan and budget part, I think, the information provided is quite clear for me to visualize the whole process of executing the project. Their plan will include 3 main phrases: research, development and audit in which I know how many months does it take for each phrase. The proposer clarify what activities involved in each phrase, how many hours needed for each item, and the corresponding cost, total required cost is $91,000. If not sufficient, it will be covered by the MuesliSwap team. After all, I agree with the proposer about the feasibility of the project, with some improvement in team part would be perfect. ", "q1r": 4, "q2": "It is possible to check the project development. The proposer would publish their findings in a research paper on weekly Twitter space for Cardano community. Moreover, community could check product code on Github. Besides, to implement this project, they will consult multiple audit companies, in which the audit details will be made public for community. However, for the success outlook of the project, I would like the proposer to clarify about their KPIs for this proposal. In short, this is auditable project. ", "q2r": 4, "assessor": "z_assessor_3246", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "We will research and propose novel liquidity provision models in order to address problems like inefficient use of liquidity and impermanent loss. The solution will use the unique Cardano EUTXO model.", "experience": "We are OpenSwap Technologies - the team behind MuesliSwap, one of the biggest decentralized apps on Cardano. As developers of DeFi infrastructure, we have experience with all relevant aspects of Cardano (off-chain, on-chain code), Haskell programming and smart contract audits."}