{"id": 422040, "author": "randall", "title": "Catalyst Governance Tooling", "url": "https://cardano.ideascale.com/a/dtd/422040-48088", "category": 26595, "amount": 97715, "description": "Today's Catalyst process and tools are not supportive of experiments in process, governance and allocation of funds. Challenge setting lacks continuity and our ecosystem suffers.", "f6_no_assessments": 5, "f6_rating": 4.933333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1714, "q0": "Yes, this idea certainly fits well with the objectives of the challenge and would also be an important step towards decentralized governance. We know that there are already several groups dedicated to discussing governance issues and also to carry out collective decision-making, for example the Catalys Circle group, the Quatility-DAO meetings (if I'm not mistaken this is the name of one of Cardano's projects dealing with the matter). There are also groups focused on more specific regions, such as the Municipality of the East, the Wada group, the LATAM community (Latin America) and so on. All these groups, in a way, already work towards the creation of a self-governing community, they already carry out activities necessary for the maintenance and improvement of our community; but still, there are not many design tools that are specifically geared towards this collective decision-making process, which involves, for example, the definition of challenges according to investment funds and allocation of funds. Therefore, to mitigate this scenario, the proponents built “modular environment based on the Done Collectively platform, where the community can experiment and test objective setting, proposal prioritization and co-development and other innovative approaches”. In general, it is a tool that would enable joint decision-making. through collaborative strategies that allow community members to interfere in decisions, participate with leadership in changes, so that the processes of communication, understanding and collaboration between projects, decisions to be made, Cardano's tools and technologies can be best performed by all those who wish to be involved in such aspects. This would all be done through a few tools, as the proponents report: “fluid funding mechanisms, collaborative sizing of treasury for objectives, question and answer templates to propose and evaluate different types of proposals, workflows” and so on. In other words, it is a project that very precisely meets what is sought in the challenge, as it will create a new valuable dApp that will help the Cardano community in the migration between being governed by the IOG and being self-governing, so I understood. The specific objectives that would be addressed here and are present in the scope of the challenge are “to increase the number of dapps and products available for use by the community that help to enrich the ecosystem with new use cases. By delivering the “Collectively Made” platform + Creating or improving different Dapps, products and integrations that add value to the Cardano community and the wider ecosystem.” Further detailing the solution to be created, the proponents explain that the Done Collectively DAO group would be working together with our catalyst process, so that the community could have access to frameworks and applications that work with workflows guided by the missions and objectives of the that would be the center of debate. This tool would be called Catalyst GPS; my only doubt regarding the impact of the proposal would be: how will all people learn to use this dApp, including those who do not have an easy time dealing with technological tools and virtual programs in general? What has to be done here is complex, it seemed to me to be a very extensive tool with several parts involved, so I missed it being a little clearer how this introduction would be made, let's say, for the average user. Other than that, I think the proposal is very well aligned with the challenge, deserving top marks in this topic.", "q0r": 5, "q1": "Lots and lots of information is provided to us about each phase. My suggestion to make the script more accurate would be to make the timeline a little clearer, for example, phase 1 would run from July to September 2022, and several activities are mentioned here. Which activities would take place in July, which in August and which in September? I believe the timeline was broken down into months, our understanding of what would be done and when would be best. talking about the activities, although we have a lot of information, including the amount of hours that would be allocated to carry out the activities, for example in “We developed graphic design and general UX refinements for our current prototypes: 20h product management + 30h UX design + 60h of user interface development”; we know that in this part the designers will approve workflows and carry out the feedback consultation for a support team (Catalyst GPS) and also for the general community - how would this contact with our community be established? Do the proponents intend to establish contact, for example, through the telegram group “The Project Catalyst”? In “Scenario Testing, User Testing and Validation of Essential Workflows”, the same question arises. How do we bridge this gap with the community, would the tests be done by the team members themselves or by members of the community itself? From the way the information is presented, we were able to have a good view of the project development process - only a few points could be better detailed; I believe that the division into months would be the most ideal, even for the script to be easier to visualize. We did manage to have a good understanding of the phases and what would be done in each, so my suggestions are just to raise the level even more here that is already good. Moving on to the next topic of analysis, which is the budget explanation: in my view, this topic is adequate, although its information is a little confusing. We know how the $97,715 would be divided into a few parts, some of which would go towards paying the professionals involved here (e.g. into “$4,000 Initial Process Consultation (Nadia), $2,700 Ongoing Consultation x 9 times (Nadia), $4,000 Innovation and Initial Design (Tomi), $2700 Continuous Consultation x 9 times (Tomi)” among others; we also know the hourly value of some parts, but I think it would be important to define for example who would be the high quality contributors ( so that we could understand that it would work at the rate of 120 dollars per hour, which is actually above the values ​​commonly requested here.) Some parts like marketing, problem analysis and processes and user acceptance testing and validation don't have their values ​​explained/ I think it would be very positive if they had explained the finances in a more unified way, because a lot of information is given, but at the same time the relationship between the parties is not it is so simple to trace and some specific parts are less explored than others. But we cannot say that we lack information about the use of funding, because just like in the script we have a lot of content regarding this part. And finally in terms of the team, this part is fine, my suggestion is that everyone had provided a more or less similar amount of information (for example, we know a lot more about Nadia than we do about Randall). I also think it would be appropriate for everyone to have provided their linkedin profiles, but yes, trust is passed on in this team, especially since we have people here who have been involved with Cardano for a long time.", "q1r": 4, "q2": "The proposal is easily auditable. We know that the main ones are “The number of Catalyst experiments performed on the “Collectively Done” platform and the number of decentralized organizations using the Collectively Done platform”. It is also said that progress would be reported through the Discord of the Done Collectively and Catalyst United/GPS groups: for this information, we needed to know how often updates would be made, and if these updates would say about the activities/routines of work only, or they would also report the partial results obtained so far. It is said that “we will also measure progress on our planned milestones and deliverables” - it would be positive if at this point they had clarified here what the milestones and deliverables would be, even though the information is already understandable through the roadmap. So I would say that we do have adequate and safe ways of monitoring the process, because in addition to what is said here, we have a very detailed and specific roadmap, which provides us with a lot of information about what would be done, so that we know which would happen quite easily (although we don't know exactly when and how). In general, this part of the monitoring is good and can only improve in small points. On the success scenario, I think we have this pretty much summed up in “Once the Catalyst GPS framework is adopted, various community-led initiatives can utilize the tools and platform built to work together more efficiently. Our aim is to increase understanding of where we are, where we are going and how to get there. We help communicate the direction and show how different initiatives contribute to the same dream. We facilitate coordination within and across initiatives and ultimately enable efficient collaboration.” It is said that the goal is that 5 DAOs are making use of the technologies available and that “to create strong use cases for the world which is really the main thing that will grow the Cardano ecosystem”. What I find very positive about the auditability of success here is that it is totally focused on how the dApp will benefit Cardano, and not just how the dApp itself would be successful and widely used - which is natural, since is a project totally focused on a collective governance process and that has a lot to do with the general objectives of our blockchain. My only suggestion here would be to make all this clear to our community through a presentation, where some people/DAOs who use this tool could present their use cases, their experiences, and tell us in detail how this would have all been beneficial. and helped them become increasingly active and engaged members of Cardano. Despite the suggestions, I agree that it is a very well placed project in terms of auditability.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2, "reply": "Thank you for the constructive   comments and suggestions : )"}, {"id": 3297, "q0": "Done Collectively is a community built platform that specializes in user-centric UI/UX designed and implemented collaborative tooling.  I would flip the general description of \"DAO tooling\" on its head to describe this more as a \"Tooling DAO\".  As such, it makes a lot of sense that it has partnered with the Fund8 funded proposal for Catalyst GPS, a community led initiative to provide collaboration structure and frameworks customized to working groups and committees that are trying to create and build within Catalyst.  One provides the working knowledge, the other provides the tools, and together they provide guidance and support for users. (Note that there is also a partnership here with PACE Funding Categories.  However I will address this under feasibility because it is really a use-case rather than a goal).\n\nThe development work that gets done in Catalyst (to the extent it can be...it is not an accident that \"Done\" is included in the name of the tooling) typically is ad hoc, undocumented (outside of countless hours of video recordings...which is only one type and way of documenting something that should have robust top to bottom documentation) and unintegrated to wider community efforts.  If you describe such work environments on a spectrum from \"simple\" (tasks with clear beginnings and ends) through \"complicated\" (many simple tasks integrated together), further through \"complex\" (tasks with no clear beginning and ends), to \"chaotic\" (many unintegrated complex tasks), then Catalyst is \"complex bordering on chaotic\".  Chaotic is not an environment conducive to getting work done, as it describes a turbulent, unpredictable set of circumstances that tends to get worse before it gets better, and where action is often limited to either blind effort or inability to do more than transfer information (it is this information transfer which can increase the entropy in such systems and allow sectors to eventually wrangle the problems in their area into some semblance of predictability). \n\nComplex is a good place for a network focused on innovation to be, as it requires a certain amount of space for disruption and adaptation, but for actual tasks to be accomplished by humans, at some point complex efforts need to be captured in a framework that delimits and brings them within our scope and capabilities.  The first step is data acquisition and manipulation.  The second step is to pipeline that data in discrete packages that nodes (working groups for example) can use to simplify the range of actions available and to inform their decision-making process to account for the short and long term needs and values at play in order to assess and deliver priorities against relevant roadmaps.  (I apologize for the length here, but that is about as summed up as I can get this incredibly important topic).  The second step is funded, and they are actively seeking partnerships to get step one funded as well.\n\nAnd step one is this proposal, the capturing and manipulation of data in order to reduce dangerously chaotic decision-making and action-taking environments into complex, but understandable environments that can be user-developed to make space for complicated collaborative work that assigns simple, achievable tasks. (whew!)  I think it is safe to say that when it comes to Impact within Catalyst and Cardano, (and anywhere in the world where chaos injects itself, like hurricane disaster areas) the potential ROI from tools like this are nearly incalculable.  5 stars for Impact.", "q0r": 5, "q1": "The team here are a few active developers in the community (and if user-centric, data-driven design matters to you, they represent these ideas well, and it is a huge component of their participation in the community) with partnerships with equally active community members, including PACE and Catalyst Circle reps.\n\nThe timeline and budget describe a series of collaborative milestones (this proposal essentially gets a development and facilitating/coordinating team working full time on this project over the next 6 months) followed by a use case implementation involving the Funding Categories from PACE (and for scaling in the future, they see future funding for running a side protocol through this mechanism to fund a cohort of Fund 10 proposals through an alternate proof of concept funding mechanism).  Rather than describe a detailed architecture for this fundamentally member driven UX, they focus on describing the environment into which the tooling will be deployed, and how they intend to navigate that environment.  This is the challenging part of assessing a decentralized UI/UX...by its nature it must remain emergent, but I believe by describing the environment they avoid leaving \"emergent\" in undefined territory.  To get the best feel for this process, read the Risk Mitigation section, as it shows the methodology with which they are approaching this.\n\nThe budget itself seems pretty reasonable given that the core development team will be full time on this project, and that they are building out a pilot system that could provide fundamentally different options to proposers within Catalyst.\n\nBecause the team has the bandwidth and capabilities to do this, and because they have provided a lot of details for a difficult to capture process, I believe they have effectively laid out an actionable plan with realistic deliverables.  5 stars for Feasibility.", "q1r": 5, "q2": "They accomplish two things in the auditability section:  the first is that they describe a solid plan for keeping the community up to date and specific areas where progress will be reported (and they have a section elsewhere in the proposal that describes their roadmap for opensourcing elements of the work, which would provide another layer of transparency).  \n\nThe second is that they restate the goals of the proposal in such a way as to really nail the deliverable that is being developed here within the wider context of their long term roadmap.  They are basically constructing a customizable innovation lab that anyone can enter and begin to tinker with Catalyst process in a safe, non-disruptive way in order to collect data and deliver PoCs for longer term protocol change.\n\nThis is a team that is transparent and makes themselves available to the community with regularity (and with an inside track on problem sensing, which is key data for solution design), and they have provided here a good set of progress and success criteria to keep this project focused and on track.  I believe they warrant a full 5 stars for Auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Wow!  This assessment does an amazing job acknowledging the difficulties and uncertainties inhering in the problem space we are working in.  Thanks for the nuanced analysis."}, {"id": 2113, "q0": "The idea of ​​this proposal is great. According to the proponent, the Catalyst process and tools currently do not support in-process tests, governance, and capital allocation resulting in challenging setups lacking continuity and our ecosystem in jeopardy. towel. So the team came up with a solution to build a modular environment based on the Done Collectively platform, where the community can try and test goal setting, recommendation prioritization, and co-development and methods. other new approaches. A great idea that identified a very topical problem and offered a potential solution. Done Collectively is a platform for orchestrating impactful work while sharing meaning, influence, rewards, and trust, it aims to enhance the community-led governance of the process Catalyst, as well as continue to develop a top-level tool for decentralized management of organizations...Through what is presented, it can be seen that the proponent clearly understands what needs to be done. Risky challenges have been foreseen and they also have measures to overcome them.", "q0r": 5, "q1": "The feasibility of the proposal is excellent, every piece of information about the roadmap, budget, and team is described extremely specifically. Regarding the project's roadmap, the author explains through 3 phases, that it's great that phase 1 was put into operation in July 2022 to prepare for funding. This proposal will be for phase 2 and phase 3 lasting from September 2020 to January 2023 (4 months). Each phase is broken down into specific activities so that we have a very clear view of the process\nNext is the budget, $97,715 requested and explained in great detail. We understand what this money will be paid for, as well as the salaries of the professionals involved. So, in my opinion, the proposed budget is completely reasonable.\nFinally, the team was also very well presented, offering to provide information about team members with relevant skills and experience to successfully carry out the project, in addition to a profile. LinkedIn profile for us to verify the above information.", "q1r": 5, "q2": "Regarding the progress of the project, I think the possibility of an audit is doable as the proponent lists several activities that need to be done so that we can see that everything is going according to plan. The project is fully auditable by the community based on public channels on the Done Collectively and Catalyst United/GPS discord servers. The success of the project was also very well presented, giving us a vision of the project and an understanding of what the expected outcome would be.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "This brief assessment will be useful for voters who may not wish to review all the details of our proposal (or some of the other assessments that were less concise).  "}, {"id": 8795, "q0": "Your proposal solves the challenge of building a modular environment based on the Done Collectively platform, where the community can try and test goal setting, proposal prioritization, and co-development. as well as other novel approaches. The project also provides the essential tools for decentralized organizations to get work done together transparently. Structured and organized, allowing for shared planning and reflection, motivating and engaging to get it done, emphasizing accountability and trust among members. The Done Collectively team is jointly owned and organized and will benefit from the GPS team's hands-on experience, and the community will increase the app's effectiveness and usability. When the project is successful, decentralized organizations are easier to manage, then everyone - even those in conventional world organizations - can all benefit from these benefits.", "q0r": 5, "q1": "You guys recognized the risks you would face and came up with concrete solutions. With the strength of when the team won two Catalyst Fund 8 grants, the team could attract and lightly fund many multiples. Dedicated collaborators with skill sets in graphic design, product and market research, user interface development, and project management. Even though your collaborators are working on multiple projects, most of these projects are closely aligned with Done Collectively's proposals, timing, and roadmap.\nYou also carefully plan your project; each product will help the community and GPS Advisors gain insight and clarity before moving on to the next delivery step. Your project also shortens the time from the proposal to the start of the funded effort. It strengthens the connection between the concerted effort towards those proposals & projects and the payment for those projects. That effort. The plan is to develop the Catalyst Administration Tool in phases, with iterative tests and user input/feedback.", "q1r": 5, "q2": "The community will easily track the project progress as the team always reports the progress on public channels on the Done Collectively and Catalyst United / GPS discord servers. The columns and KPIs you have set are also magnificent. Detail.\nBorrowing from Tom (TCT) ADAO, \"\"This platform will create the Cardano blockchain for DAOs. [It] will allow ADAO to effectively and efficiently reach new members and collaborators.", "q2r": 5, "assessor": "z_assessor_3004", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you for your thoughtful assessment."}, {"id": 9072, "q0": "The impact of this proposal would be high. It is an integration that needs to happen as it relates to the governance of Project Catalyst and many future DAOs. It falls cleanly within the challenge goals, And would make a big impact on accomplishing them. The goal is to develop a team to evaluate that assists in determining some of the best ways for decentralized organizations to work together to accomplish a shared purpose. This is a big problem existing in the cardano ecosystem and beyond. In many ways this is blazing a trail for the future of DAOs  and putting cardano  at the center of it. In completing this proposal, this team would be able to provide a toolkit  that could be used by many other proposals and community organizations.  I think this proposal is excellent and should be voted highly. ", "q0r": 5, "q1": "This proposal is highly feasible. The budget is clear and detailed, and the time frame for work delivered and tasks to be accomplished is also very detailed. There is plenty of background information regarding the goals of this proposal and how they match the goals of the challenge. There is a developed framework for understanding the purpose behind this work. The team is already in the middle of developing this, and have been working together to accomplish many of the tasks in his proposal already. There is no reason to question the feasibility of this project, unless you disagree with the goals of the project. But to me it seems like this proposal sets out to create a framework for a variety of different voices and people from different cultures and backgrounds to be able to work together to accomplish a shared vision through a DAO. Again, I would love to see this proposal fully funded and highly voted.", "q1r": 5, "q2": "This proposal has a very clear goal and a strong list of metrics. This team is already connected to the catalyst community in a way that highlights their transparency. The goal of this proposal is to provide a public method for working together and setting a shared vision together. Their metrics line up with this goal and they have experience publicizing this information. One of the ways they plan to be auditable is to create additional proposals in fund 10 where the community can assess and ideate on these proposals. So much of their work will be intentionally public and therefore highly auditable. ", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thanks for taking time for this assessment."}], "solution": "We build a modular environment based on the Done Collectively platform, where the community can try and test objective setting, proposal prioritization and co-development, and other novel approaches.", "experience": "Veteran product and engineering team dedicated to enabling decentralized organizations, actively collaborating with the Catalyst GPS core team. Deep engagement with the Catalyst community over the past 12+ months."}