{"id": 422001, "author": "unbox", "title": "MyUnbox", "url": "https://cardano.ideascale.com/a/dtd/422001-48088", "category": 26595, "amount": 108875, "description": "There is no ability to combine ‘real world’, positive social interactions with your unique experiences; all while creating a digital (web 3.0) presence in the process.", "f6_no_assessments": 9, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 564, "q0": "The proposal includes a problem statement, but this is also included as the problem solution. This could be clarified by including a better description of the problem and the solution as separate ideas, and not include them both in one sentence. I have decided not to reduce the star rating for this minor confusion, because of the overall potential impact of this proposal. The proposal could potentially have a significant and scaleable impact on the cardano ecosystem. Unbox currently has over 50 people on their team, and they are looking to hire an additional 10 employees https://jobs.lever.co/unbox This tells me the company is successful and growing. They are operating in 17 countries, and they are looking to work within municipalities and cities with products such as unbox litter, and large food retailers with unbox wellbeing. If this proposal is funded, unbox will contribute an additional $115,475.00 to complete the development work. If unbox continues to scale, this project could bring a large volume of users and transactions onto Cardano. (Forecasted to scale to over 7 Million users in 2025. For perspective cardano currently has about 1.1 Million delegated wallets. https://datastudio.google.com/u/0/reporting/3136c55b-635e-4f46-8e4b-b8ab54f2d460/page/k5r9B)", "q0r": 5, "q1": "The team has already completed a functioning product, and is well qualified to deliver on this proposal. An example of their work is the city ucoins and the city of Antwerpen used Ucoins, and distributed to more than 16,000 city employees, and a peak transaction volume per day of €626.510 https://www.unboxuniverse.com/unbox-your-city\nThe budget is reasonable, and the proposer is willing to fund over half of the total cost, which shows a commitment from the proposing team and confidence that they have the skills and resources to complete it successfully. They have provided a comprehensive plan and timeline. The budget is broken down to show the average $rate per day for developers. This rate is generous and ranging from 400 to 930 per day. I would prefer to see some additional detail linking the budget to specific tasks or milestones on the roadmap, but this could be estimated by simply multiplying the daily rates for the team by the weekly milestones provided. Therefore I think the team has provided sufficient information to justify a 5 high star rating for feasibility, although the timeline and budget could be refined in more detail. \n", "q1r": 5, "q2": "As mentioned above, the team has provided a budget and roadmap with milestones. However I have removed 1 star from my review due to the fact that some of the milestones are quite vague such as the following:\n\"Week 11 – 25: Tech development, integration and platform testing\nWeek 26 – 36: End to End User testing.\" These milestones cover a very large timeframe and it is not clear what the expected budget expenditure would be. This leaves a lot of flexibility for the proposing team to deliver, but I would prefer to see a commitment to meet slightly more specific deadlines and detailed budgeted items. I would recommend the team provide a more detailed updated roadmap and budget estimates to the catalyst community after the week 1 milestone is completed: Project launch includes discussions of the technical needs to be included in the Product requirement document with the COO, CTO, and System integration\nadviser. The KPI's provided make sense for the proposal and will allow the community to track the progress (assuming we have access to them). However; the proposal does not include how the team will be updating the Cardano community on the progress. I would suggest to the team that the proposal should include what channels of communication will be used to share monthly progress reports with the Catalyst community. I do believe the team intends to be open and transparent with development progress, but they have not specified how this will happen in the proposal. A budget ask of this size should include detailed plans for reporting progress updates, and as much transparency as possible with the Catalyst community. This omission is why I have rated this 3/5 stars for clarity and auditability. ", "q2r": 3, "assessor": "z_assessor_2108", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "-\tThe proposal includes a problem statement, but this is also included as the problem solution. This could be clarified by including a better description of the problem and the solution as separate ideas, and not include them both in one sentence.\n\nQuite right, please see the below separation. \n\nDescription of the problem:\nThere is no accurate ability to combine ‘real world’, social interactions and experiences; with a digital (web 3.0) presence.\nWhether engaging in positive sustainable practices or trolling on the internet (as well as everything in between) – we believe that you should be totally accountable for your actions. Not only do we think you should be accountable, but you should own your actions as well as your information. As it stands there is no ownership and no accountability. \n\nDescription of the solution:\nUnbox is creating a platform to enable someone’s ‘real world actions’ to represent and form their digital persona. All whilst creating a universal gateway into all of Unbox’s closed loop systems. \n\nWe intend on leveraging our closed loop system verticals to aggregate people's skills, talents, experience, and behaviour. Transferring to the digital arena the depth of a real-world social profile. \n\n-\tThese milestones cover a very large timeframe and it is not clear what the expected budget expenditure would be. This leaves a lot of flexibility for the proposing team to deliver, but I would prefer to see a commitment to meet slightly more specific deadlines and detailed budgeted items.\n\nThe timeframe was provided based on a best possible outcome (top-down) analyses. We have created internal timeframes based on the ‘man-power’ available at Unbox. We will be able to provide those to the Cardano community once our application on the project catalyst has been advanced. This also includes our KPIs and Milestones. Once we have a better understanding of what we can achieve, with the combined support of the Cardano community, we will then be able to provide a far greater breakdown of the budget and timelines associated with each KPI/deadline. \n\n-\tHowever; the proposal does not include how the team will be updating the Cardano community on the progress. I would suggest to the team that the proposal should include what channels of communication will be used to share monthly progress reports with the Catalyst community\n\nOur main goal is to work with the Cardano community and be as open and transparent as possible. This will provide us with the support and feedback to ensure the best possible outcome. Therefore, it is our intention to set up regular feeds and comms through Twitter, Github, and Telegram. If there are other channels that would be preferred, we will also utilise those. Perhaps organising webinars and seminars on progress updates (milestones) and community feedback. \n\nPlease visit our LinkedIn to see some of the webinars and Q&As we have held in the past: https://www.linkedin.com/company/unboxuniverse/posts/?feedView=all\n"}, {"id": 1312, "q0": "The proposal is identifying the problem that there is currently no possibility to combine real world positive social interactions with your unique experiences, and aims to solve it by developing an app. The idea is to allow its users to set up their profile – set their skills and possible offer these as services. Then, this person will decide with who these data will be shared, and it will operate in closed loops. Then, these can be used to help society in a form of a service, in return to Ucoins (I believe) that can be traded for different discounts/vouchers in partnered shops and stores. Overall it appears as a very interesting idea, even tough the proposal is lacking a lot of details and information, and I had to dig at their website for a while to get the complete picture. Nevertheless, I can imagine that since it will be free for registration, it can get traction and adaptation very easily, but the risk will be how to get traction of people who will not be able to utilize their Ucoins. It is important to state, that Ucoins will have no value, and can only be traded for vouchers/coupons in local economies.", "q0r": 5, "q1": "The roadmap is set to 25 weeks of development and 10 weeks for testing, so 36 weeks in total = but the time spend is estimated for 6 months. The roadmap is divided into various week-periods, with the description of expected tasks to be performed such as development sprints or testing. The budget requested is 108k USD, and is divided to hours spend and day wages. I find this detail reasonable, but for better clarity, the items from budget could have been linked with weeks. The team is already having different working products, based on the visited website, and is consisting from dozens of various people. I have also checked some linked in profiles, played with the website, and I find their skill and competence sufficient to perform the successful delivery of the proposal. ", "q1r": 5, "q2": "I am not really sure if proposers understood audit section, so I am just going to suggest some metrics that I believe should be used, and at the same time, are easy to be implemented. Regarding the progress of the proposal, I would stick to the roadmap deliveries, and this can be done some weekly/bi-weekly blogs, posts or articles on a public social media such as twitter, discord, telegram, medium. Also, reports from sprints, e.g. sprint retro can be used to measure the progress (burnup/burndown, or any other chart). As for the success, we are talking that the project is finished (its development) – so how do we determine it is successful? First, we have working product, then we have community (users), active participation and possibly increasing trend of adaptation (new partnerships etc.). All of this can be also monitored on some public media channel.  Some of these are mentioned in the proposal, some are suggested, but I believe that in relation with the problem-solution, it is possible to keep the track with both progress and success. ", "q2r": 5, "assessor": "z_assessor_2222", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 3920, "q0": "The issue being while crating a digital web3 presence there isn't an ability to combine real world positive social interactions with our unique experiences. The proposal wants to resolve it by able to let user connect their web3 digital presence with person's real world experiences such as skills, talents, interests and behavior inside a closed loop also having user to have control over their data and with whom they want to share this data. \nThis will be really helpful for users to experience their web3 presence more realistic. hence this proposal effectively addresses the issue", "q0r": 5, "q1": "The proposer is a team of 51 people operating across 17 countries and After visiting their website and checking their previous products it is safe to say they have required skills and experience to implement this proposal successfully. The half of the budget will be contributed by the proposer and rest are being requested. They have provided clear budget breakdown and the budget request also justified. The proposal has taken into account all possible risks and it can be said it is likely that this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has provided a clear plan and with a timeline where work is has been divided in weekly basis. this would be very helpful to measure the progress of the proposal. The proposer have also mentioned explanation on how to to measure the progress which will be also useful. The proposal also consist of details on how the success of the proposal would look like which should be sufficient to measure the success of the proposal. The proposer has also sustainable development goals. All these information should be enough to track the development and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 4123, "q0": "At first the project reads very confusing.  The problem statement \"no ability to combine ‘real world’, positive social interactions with your unique experiences\" makes me ask, like Google reviews?\"  Then I'm forced to think of more mutual interactions, referencing Black Mirror's Downward Spiral episode, where a woman on her way to a wedding has a series of negative social interactions, causing her to virtual social ranking to plummet, ultimately causing her mobility difficulty and even losing access to the wedding.  China has implemented similar social ranking systems.\n\nAlas, reading through the Unbox website, a new explanation is offered.  A closed loop distribution system, how it's linked to social interactions and unique experiences I'm still not sure.\n\nThen, somehow, it becomes more clear that this may be a centralized fund management platform.  Links can be made to the \"digital dollar\" proposal where the US Federal Reserve indicated their interest to design a currency that could experienced programmable depreciation and a short list of eligible spending outlets.\n\nIn summary, I have no clue what this proposal aims to actually do.  Endless opportunity, as they say, lies in \"allowing individuals to create, manage and participate in various closed loop systems that help improve society.\"\n\nHopefully someone can understand it.", "q0r": 3, "q1": "Besides the attachment detailing a budget breakdown which includes developers making $50-100+ USD/hour (expressed as a daily cost, very expensive), it's difficult to evaluate feasibility because the proposal presents an unclear description of the actual deliverables.  This confusion is furthered by the fact that the requested funds, $108,875 USD, is less than half that they require to deliver whatever it is, and a promise that their organization will co-fund it.\n\nThe timeline and milestones create a heavy use of adjectives such as \"required\" and \"traditional\" and \"rich,\" leading me to believe as a reviewer that they are skilled in paying attention to details of what they are doing, and closely understand the requirements.\n\nIn the end, hopefully voters will understand and see the value in this proposal, since I'm just neutral/not sure how/why/if it could be implemented.", "q1r": 3, "q2": "The 2 stated goals of auditability, 1) the \"ultimate objective of assisting people,\" and 2) \"to increase awareness of the technology\" are difficult to evaluate.\n\nAs they also state, the most prominent KPI for success is \"deployment speed\" but there isn't much info available to understand \"why\" that is...\n\nAs an observer, and person who invested considerable effort to try to understand this proposal, I would be unable to evaluate or audit this proposal.  But not wanting to base auditability for this technology on my personal capability, I would challenge other reviewers to evaluate exactly what it is this proposal aims to do.", "q2r": 3, "assessor": "z_assessor_2517", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "\n-\tChina’s Social Ranking & Black Mirror's Downward Spiral Episode\n\nThe 2 references mentioned (Chinese social score and Black mirror) are very interesting. This is exactly what the MyUnbox solution will correct. The idea of totalitarianism within technology and digital ownership is exceedingly prevalent. Our solution will be able to counteract this concept when and where it exists. \n\nI direct you to the following tweet from @IOHK_Charles (link below this paragraph). The clip in this tweet discusses Cardano's initiatives. In particular 'banking the unbaked' and 'self-sovereign identity’.\nIt is our goal to develop verifiable credentials. As those used by Atala PRISM are not sufficient to create a true sovereign identity solution. We do NOT want to create Sybil resistance but to create reliable identities for parties to engage without necessarily compromising privacy.\n\nThe user’s data belongs to the user and no one else – it is up to them to do with, be recognised, held accountable and rewarded for their information as they wish. \n\nhttps://twitter.com/inputoutputhk/status/1548691817474002948?s=21&t=BcU-OxZFx3tCEPv-Jz5kjg\n\n\n-\tIn the end, hopefully voters will understand and see the value in this proposal, since I'm just neutral/not sure how/why/if it could be implemented.\n\nAs mentioned by another assessor – “As for the success, we are talking that the project is finished (its development) – so how do we determine it is successful? First, we have a working product, then we have a community (users), active participation and possibly increasing trend of adaptation (new partnerships etc.)”\n\nAs it stands “Our current market is approximately 364,100 users and at our current trajectory; we foresee that within 5 years we are likely to reach a total user base of 7,282,000. This analyses, is assuming that we focus solely on current operations. Only expanding into neighbouring European markets. Excluding all other operations (America, MENA etc).” Source: Extract from our proposal submission\n\nThis project combines a tried and tested product and growing company (CLS, Unbox and users) with a problem that needs addressing (tweet from @IOHK_Charles - link below this paragraph). We have the technical knowledge and experience to develop this solution ourselves (I invite you to visit the company’s LinkedIn). However, we understand the benefits that the Cardano community can provide. That is why we have submitted this proposal in this catalyst and want to use the Cardano chain. Together we can build the solutions to create a better future.\n\nhttps://twitter.com/inputoutputhk/status/1548691817474002948?s=21&t=BcU-OxZFx3tCEPv-Jz5kjg\n\nPlease visit our LinkedIn to see some of the webinars and Q&As we have held in the past: https://www.linkedin.com/company/unboxuniverse/posts/?feedView=all\n"}, {"id": 5302, "q0": "Unbox, a successful Belgian startup and provides a platform/system that \"ensures efficient and targeted distribution of funding in any form only to those for whom it was intended\" in a closed-loop and no-code or low-code manner. The proposal to consider for funding is a collaboration with Cardano/Catalyst to create a mutually beneficial collaboration, for which the work hour costs involved by some of Unbox's 50+ staff would be shared by Unbox and this project's budget. As the final outcome would be a product, suite of products, or integration of existing Unbox customers into \"web3\" solutions by Cardano, this fits the challenge setting very well. I think it is unfortunate that the problem and solution statement provided to the voting app are identical and not very precise or catchy, which could either be a miscommunication of an extremely well-meant intention (I suspect), or concealing fluff and lack of strategic ideation prior to submitting the proposal. Generally, this is a highly impressive company with a sleek website and strong team, so I am curious about working with them. On the other hand, I would have wished that some more care and communication savvy would have gone into this proposal, to explain the ideas of possible avenues of working together more succinctly. Overall, a good fit for the challenge setting, but with a little more care a much better impression could easily have been achieved, which is a pity.", "q0r": 4, "q1": "Unbox received VC funding of USD 8,500,000 in May this year and seed funding by Belgian KBC bank of USD 5,500,000 in December 2021. They currently have a team of 50+ people and specialize in donation/distribution management systems for users who prefer no code or low code and a closed-loop system, example customers may include NGOs, municipalities, impact businesses or \"web3\" type of projects. Their website looks very professional and the management team have a lot of experience in the field of impact, ESG, branding, academia and startup/freelance. \nThis is all very impressive and polished, but lacks focus and purpose in my subjective opinion/impression. The problem and statements are identical, and there is pain point that needs solving that has been identified very clearly. Unbox wishes to establish a relationship with Cardano, and would (give or take) match the budget requested from their treasury to create a \"product\" (which I imagine to be some kind of portal / community platform / services overview) tailored to Cardano's needs and leveraging the Unbox system. I am very impressed by the team and how their website is presented, their clients and funding, but would have loved to see some more \"meat on the bone\" when it comes to the vision and objectives of the collaboration and possible product(s) this funding is for. The budget is entirely for staff (which is already on the payroll) and the timeline is arguably a bit vague as well.\nThere will be some positive outcome of this collaborating though, so I can see the merit and likely success of collaboration.", "q1r": 4, "q2": "The auditability and KPIs are matching the business plan's general and collaborative nature. Success would be measured in integrating existing Unbox clients into \"web3\" solutions that Cardano provides, foster greater transparency, deploy at speed and assist people. I can glean the gist of this in terms of success definition, but for a quantitative performance evaluation this would not be sufficient. As a word of advice, for startups from a branding and impact  background, it would be advisable to cut back the \"marketing speak\" a bit and provide binary or numerical KPIs, workflow diagrams, feedback channels or version control systems when engaging with a \"web3\" community like ours who mostly or originally come from cryptography, engineering or socio-economic backgrounds.", "q2r": 3, "assessor": "z_assessor_2687", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "-\tI think it is unfortunate that the problem and solution statement provided to the voting app are identical and not very precise or catchy, which could either be a miscommunication of an extremely well-meant intention (I suspect), or concealing fluff and lack of strategic ideation prior to submitting the proposal\n\nWe can assure you our intentions are entirely well-meant. We foresee this project being separated into two phases. The first is to develop a web 3.0 technology where your online persona is dictated by your physical actions and where you own all of your information. Whilst the second is to combine this technology with our closed loop solutions (this is where we will be able to get the Unbox users operating within our CLS onto the Cardano chain and interacting with the community). Where your web 3.0 persona will be improved by the positive acts you undertake in the real world (an example of this could be recycling with Unbox Litter or assisting with our humanitarian initiatives). \n\nDescription of the problem:\nThere is no ability to combine ‘real world’, positive social interactions with your unique experiences; all while creating a digital (web 3.0) presence in the process. Whether engaging in positive sustainable practices or trolling on the internet (as well as everything in between) – we believe that you should be totally accountable for your actions. Not only do we think you should be accountable, but you should own your actions as well as your information. As it stands there is no ownership and no accountability. \n\nDescription of the solution:\nUnbox is creating a platform to enable someone’s ‘real world actions’ to represent and form their digital persona. All whilst creating a universal gateway into all of Unbox’ closed loop systems. We intend on leveraging our closed loop system verticals to aggregate people's skills, talents, experience, and behaviour, transferring to the digital arena the depth of a real-world social profile. \n\n-\tAdvisable to cut back the \"marketing speak\" a bit and provide binary or numerical KPIs, workflow diagrams, feedback channels or version control systems when engaging with a \"web3\" community like ours who mostly or originally come from cryptography, engineering or socio-economic backgrounds.\n\nThis was our first proposal and therefore absolutely will take this advice on. We intend on providing details which outline KPIs and relevant information. We appreciate we must use feedback channels or version control systems which are commonly used within a web3 community. \n"}, {"id": 5351, "q0": "The MyUnbox proposal solution is an integrated platform that combine all verticals to build user identity (connect their future events with their individuality). It allows any users Unbox domain access to any of the 'closed loop' solutions. They will have total control of their own data. The participation of individuals in the closed loop system will improve society and hence, the myunbox becomes a portal to a thriving ecosystem. The information provided in this proposal is not sufficient to determine that the proposal effectively address the challenge. The Dapps, Products & Integrations challenge seeks dapps that will make impact to Cardano. It is unclear how the user identity created by MyUnbox will impact to Cardano ecosystem. The MyUnbox is an ecosystem that house various close loop solutions of one digital identity. There are a lot of close loop possibilities and this proposal doesn't clarify which close loop solution will the app initially focus on. Also MyUnbox doesn't detail about their infrastructure that will help the app or platform they create  to gain Cardano adoption. ", "q0r": 3, "q1": "The proposal provided the timeline for 36 weeks (9 months) in total along with the milestone the team aim to achieve in each period. However, when it comes to the budget breakdown section, the proposal mentions that the project will last 6 months. There is an inconsistency in total time period for the project between 2 parts in the feasibility section.  The team estimates total cost for this project as $225,000 of which they would like to ask $108,875 from Cardano. It is unclear from the budget how many hours per day will the developers spend on working with the project. Assume that the developer will work 8 hours per day, then the senior developer will get paid $116.25 per hour which is quite high compared to the market rate. Not all of the unbox team members listed on the website will be working on this project. The proposal will improve if they are more specific in term of number of team members along with the name of those who they plan work on this project. Should the project return to Catalyst for further funding, it would need to resolve the issues of inconsistent timeline, questionable budget and lack of info on team members who will work on the project. ", "q1r": 3, "q2": "There are 3 indicators for MyUnbox success which are 1. their integration into web3 and Cardano. 2. technological awareness in various fields 3. deployment speed in how close loop solutions establish how quickly data and modelling insight applied to the real world for improvement. The team will track project success using 4 focal points (scope, resource, time and  utilization) The team will need to find the communication channel to the Catalyst community so that they can check and see project progress. The team should consider adding the extra resource on their website to explain their concept and to possibly obtaining feedback from the community and share them with project progress. The proposer can do more in explaining how 'MyUnbox' solution can solve the issue of real world positive social interactions with your unique experience and aligned with the challenge goal. ", "q2r": 4, "assessor": "z_assessor_2695", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "-\tMyUnbox doesn't detail about their infrastructure that will help the app or platform they create to gain Cardano adoption.\n\nThe infrastructure, built from our Infinity platform, will allow communities to create their own self-governed close loops. The creation of digital personas will help with governance and allow for an environment where granular trust can be created. Therefore, MyUnbox could be considered as one of many tools that Unbox is creating for the Cardano ecosystem to build value on.\n\n-\tThe team should consider adding the extra resource on their website to explain their concept and to possibly obtaining feedback from the community and share them with project progress\n\nAbsolutely, we intend on organising Q/A sessions with the community. Inviting talent from the wider community and Cardano leaders to take part in webinars and public forums (we invite you to see the webinars + Q&As held in the past). A place where questions can be answered, and concerns raised. We will also provide regular feedback to contributors and developers through Telegram, Twitter and Github. As part of the MyUnbox solution – we intend on combining all of the products on our website into one ecosystem. So that is the next stage – once we progress this application, we will start working with the Cardano community to determine the best way to release updates and to interact. \n\nPlease visit our LinkedIn to see some of the webinars and Q&As we have held in the past: https://www.linkedin.com/company/unboxuniverse/posts/?feedView=all\n"}, {"id": 6256, "q0": "The problem statement is clearly defined, lack of ability to combine real world experience and digital presence at the same time.\nThe solution section of this proposal repeats the proposal title, this is an obvious mistake that could have been mediated if the proposer had posted the proposal for community discussion sooner than the last couple of days before the deadline.\nThe solution however is explained in the impact section clearly. The proposer wants to combine all of their products, (the voter can find their products on the website https://www.unboxuniverse.com/products) into an aggregated digital profile that is true to the real-world social profile. \nSuch platform will allow the user to build their web 3 presence during their every day real-world actions. This aligns with the challenge goals and metrics. \nThe proposer does not specify in detail how that platform will be anchored on the Cardano blockchain.  However the proposer specifies “Cardano’s L1 versatility, speed and cost for high volume use” as one of the challenges that they foresee. Therefore we could assume that the web 3 profile will be on the Cardano main chain.\nThe potential impact for the Cardano ecosystem of such project is significant due to the number of people involved. The predictions that are stated are for mover 7M users by 2025.\nDue to the not very clear definition of a solution I have to remove one point.\nI agree that this proposal effectively addresses the challenge.\n", "q0r": 4, "q1": "The proposer has a very experienced team that has proven track record. The company has multitude of working projects and has secured 8.5B funding in their first round. \nAlso this proposal asks for a bit less than a half of the funding needed for this project and the rest of the funding will be provided by Unbox. Skin in the game always brings trust.\nThe proposer outlines possible risks and challenges for the project, unfortunately does not offer any mitigation strategies for set risks. My advice for the proposer is to always provide mitigation for the expected risks.\nThis proposal has a detailed plan with timeline. \nThe budget is divided in two sections almost evenly split between Unbox and Project Catalyst. The positions needed are outlined and the hourly wage is clear if we consider 8 hour work days, because the budget is in days/position/total format. Overall it is satisfactory.\nThe proposer wants to build a long-lasting communication with Project Catalyst and will return for funding for other projects and future development.\n I strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The auditability section of this proposal is not correctly developed. It does not provide any milestones, numbers or dates for the auditing of the progress of this project. There is no information how and where the auditors could take the information in order to release monthly funding.\nThis could be due to the lack of experience of the proposer with the Project Catalyst proposal creation. The proposer has registered to idescale on 29th of Jun 2022, one day before the deadline. \nHowever the information provided in the auditability section is insufficient to easily audit the project according to the Proposal Assessor Guide F9 and I have to say: I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\nDear proposer, your work is valid and Cardano needs projects like this, however your proposal has to be developed according to the rules of Project Catalyst. I strongly advise you to read the Proposal Assessor Guide F9 https://docs.google.com/document/d/1g-iZhDlKhUBZkui1uv8NVNfJC4oVD3JtR-P6Fue7XPU/edit# and apply again in F10. Publish your proposal in the beginning of the fund and refine it according to the community feedback during the weeks before the deadline, this will help you.\n", "q2r": 2, "assessor": "z_assessor_2795", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "-\tThe proposer does not specify in detail how that platform will be anchored on the Cardano blockchain. However the proposer specifies “Cardano’s L1 versatility, speed and cost for high volume use” as one of the challenges that they foresee. Therefore we could assume that the web 3 profile will be on the Cardano main chain.\n\nThat’s correct. We aim to implement the web 3 profile on the Cardano main chain. Specifically, the Identity Solution will be built on L1 mainnet. We will require an L2 for most of the closed loops, however, it’s possible to use the ‘centralised’ closed loops with the Cardano-based MyUnbox Identity seamlessly. \n\n-\tThe auditability section of this proposal is not correctly developed. It does not provide any milestones, numbers or dates for the auditing of the progress of this project.\n\nThe progress of this project will be assessed through KPIs and Milestones. These can be provided to the Cardano community once our application has progressed.  \n"}, {"id": 6471, "q0": "I enjoyed reading through this proposal. It is interesting learning about a new way that creates a new \"true digital identity.\" Currently there is a lack of projects that take into consideration an individual's skills and uniqueness in a Web 3.0 format. I believe that this could create new opportunities for users that before MyUnbox wouldn't have had. These opportunities take more information into consideration and that goes against the current form of identify based on a few principles. By creating MyUnbox, they plan on aggregating people's skills into a new web experience that hasn't been done before. For these reasons, I give this section 4 out of 5 stars as I believe it could have a large effect on the current status of the on-boarding process. ", "q0r": 4, "q1": "The team appears to have lots of combined skills and have a way to reach many people in different parts of the world. This is aligned with the Cardano project by being all inclusive. The more people around the world that can use their project, the more active users will be found on Cardano. There is a detailed roadmap of plans that goes for around 36 weeks. I like that the plan extends of a long period of time. It shows that there is a lot of work to be done, but also that they have thought about the future of their project. This helps the readers of this proposal see where the project is at. These specific dates of completion will allow for the principle of accountability to influence the team's likelihood of successfully implementing this proposal. The detailed budget breakdown is written very well. I find it important when the team stated that they see this proposal as a grant and that they will pay the rest for the completion of this project/proposal idea. There are details on where the potential funds will be allocated throughout the course of building. There are certain risks that have been carefully considered by the team as described in the proposal. For these reasons, I give this section 4 out of 5 stars. I believe that there can be more room for engagement of the community. This will increase the likelihood of being implemented successfully and ultimately increasing value to this project and the Cardano ecosystem.", "q1r": 4, "q2": "The proposal includes lots of information that supports their cause. When looking into the potential success of the proposal, there needs to be a main source of auditability. There are two strong factors that lead to the auditing of a successful protocol. The first including the openness and transparency of a team. When there is an honest team that is open with their community, they are likely to build a strong following. They are more trustworthy and that leads to a successful project and in this case, a successful proposal. The second principle is accountability. When developing a strong community, they will likely hold the team accountable for their project milestones. This is generally a positive form of accountability because the loyal community members want to see the project be successful and see those specific dates of implementation come to fruition. The proposal includes proper information that supports their project idea of MyUnbox. It is also good to see that the project has already been building without receiving funds. We are likely to believe that even in the event that they don't receive funds in this fund setting. That they will still do what it takes to follow-through with their proposal. For these reasons, I give this section 4 out of 5 stars. ", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "-\tI believe that there can be more room for engagement of the community. This will increase the likelihood of being implemented successfully and ultimately increasing value to this project and the Cardano ecosystem.\n\nAbsolutely – We intend on working very closely alongside the community every step of the way, it will help us as well.\n\n-\tWe are likely to believe that even in the event that they don't receive funds in this fund setting. That they will still do what it takes to follow-through with their proposal. For these reasons, I give this section 4 out of 5 stars.\n\nYes, our plan is to 100% proceed with MyUnbox. However, an integrated relationship between Unbox and the community would optimise the commitment to support the success of the project. We believe this will be beneficial in optimising the value of this project. Unbox has already started working on MyUnbox, however, we think that support from the Cardano community would be the best partner to optimize absolute success (quality and efficiency). \n"}, {"id": 12985, "q0": "The proposal addresses that their is now way possible that we can build the virtual (web 3.0) presence while satisfying the social relationships in the real world and sharing unique experience.The proposer is building a a project \"MyUnbox\" in which they will combine all the verticals into one platform in which they will be creating a user \"identity\" involves tying their individuality to all future events related to their experiences. MyUnbox will gives users the ability to build, manage, and participate part in a variety of closed loop control system that improve society. Whether they are a brand, government, NGO, refugee, or other entity.The proposal enhances the cardano eco-system.The proposal is able to scale to addresses the future challenges.\n", "q0r": 5, "q1": "The proposer have  provided a detailed plan, including timeline and key milestones for implementing the proposal. The project will be completing in the 6 months of timeframe . The proposer have provided the detailed plan and the time duration to complete the project in the description . The Team have provided the detailed budget breakdown in the description .\nThe team looks very professional and have provided the links of theirs works and the skills needed to develop the proposal in the description .\nThe proposer have mentioned the resources that are needed to implement the proposal .\n", "q1r": 5, "q2": "The proposal's success can be monitored by looking at , By giving the Unbox community an easy way to integrate into the web3 world and the Cardano community,  First. Therefore, both groups gain.\nThe challenge has been presented by the proposer in a way that is both transparent and understandable, and the plan for its successful implementation is also described. The Metrices/referred Kpi's to in the proposal serve to specify\nsuccess of the proposal.", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "There is no ability to combine ‘real world’, positive social interactions with your unique experiences; all while creating a digital (web 3.0) presence in the process.", "experience": "The Unbox family of 51 operates across 17 countries, speak 20 languages and are specialists in each person’s own right. We have over 100 years of experience in Technology development, marketing, law, engineering, product development and all things attaining to improving society"}