{"id": 422045, "author": "mwojtera", "title": "Login with Cardano Wallet - cAuth", "url": "https://cardano.ideascale.com/a/dtd/422045-48088", "category": 26595, "amount": 35500, "description": "Cardano doesn’t have a lightweight, autonomous login mechanism.. As a result apps depend on legacy systems to authenticate users, limiting growth and decentralization", "f6_no_assessments": 4, "f6_rating": 4.916666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 2114, "q0": "The idea of ​​the proposal is quite good, Cardano Ecosystem is growing rapidly and many solutions in the ecosystem require users to authenticate. Usually with login/e-mail and password. This adds to what is commonly known as password chaos and password fatigue and is also a potential security risk. So the solution was to develop a decentralized, open-source authentication system that uses open standards and provides a way to log in with only the Cardano blockchain. The proposal provides a lightweight solution that will use an NFT and CIP30 compatible wallet that provides users with a way to log in with the Cardano wallet.\n1. Login with Cardano Wallet\n2. You connect to the wallet (CIP 30 compatible)\n3. Access is granted by NFT, if you do not have the NFT required to access this resource or your NFT is no longer valid, your access will be denied.\n4. Also, if the resource you want to access has specified a custom policy, that resource will be launched\nImplementing this solution will enable new scenarios. Using NFT can provide additional levels of security, as it is possible to encrypt the data stored in the database so that it can only be read by the user. The problem raised and the intended solution presented in the proposal fit the challenge meeting clearly and logically.", "q0r": 5, "q1": "The feasibility of the proposal is highly appreciated. It can be seen that the proponents know how to develop a sound action plan. There is a very good explanation of the route. It is structured over 6 months and has extensive explanations of what happens in each month. We understand the tasks that will take place over the months which means we have a very solid view of the process. The great thing about this section is that the author defines the results achieved after implementing the project very clearly.\nThe $35,500 budget request is reasonable, the numbers are well defined, allowing the community to clearly understand what the money will be used for.\nRegarding the team behind the proposal, Phil Khoo is mentioned as the project lead, he is also a PA member, a veteran VPA of Cardano, along with experiences that I consider appropriate for this project. In addition to Michał Wojtera and the AIM Developer Team, we know their role in the project and their contributions to Catalyst. So 100% confidence in the team is passed.", "q1r": 5, "q2": "The team identifies measurable deliverables that provide us with enough information to audit project progress and implementation:\n-Number of commits on Github\n- Milestones achieved\n-Number of Github issues opened/resolved\n-Number of Github PRs reviewed/merged/accepted\n-Number of DAOs, dApps, and websites using their solution...\nWith that, we know what to expect, and we can keep an eye on whether things don't go as planned. I think by providing metrics, they have a solid plan to measure success and deliver the product. KPIs are very clear and fit the definition of success. This way the testability is done well, and there is enough detail to understand how things are going and how we can monitor them.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2546, "q0": "While a DID solution for log-in is waited for patiently by all the community members and various apps and DAOs,... This project presents a solution to provide logins using NFTs without compromising security and without having to wait for all the infrastructure needed for the DID solution. \nThe community will benefit immensely from the project and it will help the ecosystem evolve more rapidly than expected and compete with other chains that have similar products already in use. The project aligns perfectly with the challenge's guidelines and it also presents a serious paradigm shift in the way how Dapps and DAOs would deal with login issues which are highly discussed amongst interested members. Furthermore, the ability to scale is huge since the product is needed as soon as possible. The only hurdle would be how will the product compete with other DID solutions when they are out which is fairly discussed by the team.", "q0r": 5, "q1": "From the information provided by the team and according to all the links shared with us, the success likelihood of the project is pretty high. For starters, the team is a veteran one with wide-ranging experience from front end to back end and sysadmin,...\nThey have worked on various relevant projects before within the Cardano ecosystem as seen in the Github repos which brings up confidence in their ability. The time frame of the project is broken down monthly with a presentation of what will be then and what can be expected of the team in that time period. Also, the budget is detailed and split between different needs of the project like salaries for developers and research and design fees. Furthermore, the fees seem to be fair and match the market value. Furthermore, risks are discussed in detail, and mitigations are presented. Amongst them is the issue of the use of the product after DID solutions are presented to the community. The team successfully manages expectations and doesn't seem to over-promise a radical solution that will make DIDs redundant.  ", "q1r": 5, "q2": "The community can check the progress and audit the project by checking Github commits and merges and forks plus the documentation the team will create. This will help us keep track of the project's advancements and make sure that what is said is done. Furthermore, the team presents a very detailed roadmap that is broken down in months with what exactly needs to be done in that month and what can be expected of them. This specification provides a framework and milestones joined with delivery dates that makes tracking easier to manage. \nAlso, the details provided about the process of the project and budgeting provides the necessary clarity needed for such projects.\nFinally, the team presents a very quantifiable metrics for the measurement of success in the form of Github commit, merges, forks, users,... which is again a form of making it easier for the community to assess the project's success.", "q2r": 5, "assessor": "z_assessor_2317", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12422, "q0": "This proposal is well aligned with challenge brief and can bring value by providing a great use of SSI that can be utilized in numerous services or products in the Cardano community. The proposed solutions stem from an issue that I think is very relevant, especially since Cardano is growing rapidly and services that requires authentication will keep popping up. I do however think there is a lack of mention regarding the challenge of getting a solution like this into wide use. I’m assuming it’d be done by convincing products and/or services in Cardano to utilize cAuth as a sign-in solution and how the service will transition to using cAuth it since I don’t think the services will just deny users entirely if they’re not using cAuth. Regardless, I think this is a really good idea that can be beneficial for the Cardano ecosystem.", "q0r": 5, "q1": "The team member have the relevant experience and skills needed to implement this project, as provided by the links in the proposal as well as having the track record of contributing in the Catalyst community. \n\nThe roadmap is well laid detailing specific timelines and its respective milestones going over the planning and research, development, review and revision, and finalization of the project in the span of 6 months. The plan seems realistic to be completed in a timely manner. \n\nThe budget has been broken down into identifiable items detailing the needed resources and total workhours involved for implementing these items. \n\nOverall, I think the proposal has provided sufficient details regarding the implementation of this project.", "q1r": 5, "q2": "The KPIs chosen by the proposers are well defined and easily measurable providing a quantitative approach to measure the project’s performance. For example, number of forks, clones, downloads on Github, number of products using cAuth, etc. And since the metrics involved are available on Github (which has been linked in the proposal), the project’s progress and performance will be transparent and easily tracked. ", "q2r": 5, "assessor": "z_assessor_3408", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 15266, "q0": "This proposal aims to deliver a \"decentralized, open-source authentication system\" based on OAuth open-standard for access delegation and the users will be able to login on various platform/Dapps using their wallets which will have as an authentication token a NFT. The idea looks very promising, as it will create the necessary foundation for a seamless authentication method.\n\nThe project, it if succeeds, it will have a consistent impact to the Cardano ecosystem as various existing (or future) Dapps could use it and also very beneficial for the the Cardano users (for the proposal assessment phase could be of a good help when using the AIM tool). The proposer is also thinking about the future of this project as a security audit could be required for the released code and the use of ATALA Prims is also a viable feature for a next iteration of the authentication system.\nThe project aligns well with the Campaign settings and the potential impact is well drawn.\n\nI rate this section with 5 stars.", "q0r": 5, "q1": "The requested budget of $35500 is broken down into identifiable items, some are clear but others require more explanations. Per example, for the Design item I thinks is better to be split into separated items for what is to be the UI/UX design and for the creation of promotional materials (marketing - are there any stationery to be delivered? how many?). Also the Research item needs a better explanation to clearly understand what is to be done for this stage (\"Establishing current state of the art\" - state of the art is already at the highest level - it is necessary an analysis and an adjustment?)\n\nThe proposer states that the team behind this project was involved in proposing and delivering since Fund4, which is handily verifiable. We know that there are 2 team members presented (one of them needs external references to know him better) and the intention to hire additional personnel for the \"Design\" phase. What is not very clear, the details about \"The AIM Developer team.\" (how many actual members are in this team? How many will be part of this project? What are their areas of expertise?)\n\nThe roadmap is presented very detailed and we know what is to be done for the each of of 6 months of the timeline (September 2022 - February 2023 - even is a typo there for the ending months, we can understand when is the deadline) what are the milestones and also the deliverables for the entire period. The proposer also presents very well what are the technologies and programming languages that are to be used in this project (Node.js, Java, OAuth). What I would like to see is when the budgeted \"promotional materials\" are to be delivered during the span of the 6 months of this project\n\nThe proposer is aware of the risks and challenges that could affect the implementation of this proposal (such as the complexity) and how to mitigate them.\n\nI rate this section with 4 stars.", "q1r": 4, "q2": "There are plenty of KPIs/metrics defined to measure the success of this proposal and they are aligned well with the Challenge settings. (GitHub centric, user feedback and also by the level of adoption)\n\nThere is a intention to present, for three consecutive months, during the Town Halls, the progress of this project, and also the code will be available via GitHub. Another Catalyst social media channels could be used for delivering updates.\n\nThe roadmap is very well explained (broken by months) and we know what are the milestones and the deliverables of this project.\n\nI rate this section with 5 stars.", "q2r": 5, "assessor": "z_assessor_2336", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Develop a decentralized, open-source authentication system that uses open standards and provides a way to login with just the Cardano blockchain.", "experience": "Developers of the AIM Community Tools. Successfully funded (since F4), active community members (PAs, vPAs). 30+ years of combined experience in software development (Java, TS, JS, PHP, Swift, bash). 15+ years of experience in devops and sysadm. Atala PRISM Pioneers (2nd cohort)"}