{"id": 422018, "author": "adalink.io", "title": "SPOxNFTs: A Decentralization Tool", "url": "https://cardano.ideascale.com/a/dtd/422018-48088", "category": 26595, "amount": 87600, "description": "Not everyone has the technical knowledge or capabilities to run and manage a Cardano Stake Pool and many SPOs struggle with visibility many times resulting in them having to retire their pools.", "f6_no_assessments": 5, "f6_rating": 4.200000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 2112, "q0": "This proposal wants to build a platform that gives both individual SPOs and NFT Projects or creators the ability to promote delegation to a specific group and share the rewards of SPO equitably. By using the NFT Policy ID to identify the authorization that will come from the promotion efforts of the SPO allies. The platform will make Cardano the first blockchain with NFTs with an innate utility: helping to promote SPO and decentralization of the network while receiving rewards for it. If this proposal is successful, it will benefit the entire Cardano ecosystem by giving people the ability to be incentivized to promote the SPO of their choice using any primary ID. NFT books as tools. In the end, the more successful the SPOs in the ecosystem, and the more decentralization is distributed across multiple channels, the more decentralized Cardano becomes. Through the proposal, it can be seen that the proponent clearly understands what needs to be done for the proposal, and the description of the solution is well explained and consistent with the objective of the challenge.", "q0r": 5, "q1": "The proposed plan is very good, we know the whole project will take 7 months, and what will happen each month. The activities involved are accounted for and we know well what will happen in each subsequent month, i.e., our visualization of the process is pretty solid. The budget is also presented in great detail. The requested amount of the proposal is 87,600 divided into sections such as Platform development, Project management, Community management... In each such activity, we know its execution time. for how long and how much per hour. So the budget has been allocated straight to the point.\nAnd finally, speaking of groups, this part of the proposal is great, providing a lot of information about who they are: their names, different social media like LinkedIn or Twitter, we also know the role. roles of each member of this project and their experiences. With this, we have a very complete picture of who we are dealing with, and a lot of trusts is passed on.", "q1r": 5, "q2": "A very detailed plan is presented, the proponents are very transparent about themselves and the amount requested is very reasonable, which clearly shows the honest motives of the proponents. Project progress should be easily tracked against the proposal's roadmap, but what's missing here is that the proponent needs to better establish how the Cardano community can access this information be it the project's website or Twitter, or Telegram, any means that can keep you updated on the project's progress", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you for your assessment. We will work to have better tools to communicate with the Cardano Community so they can keep track with our progress. We have a Twitter account where we will be posting regularly https://twitter.com/ADALink_io\nAnother assessor recommended the following and we plan to implement it:\n1) Having our documents in github for the community to audit our codes for bugs and security reasons.\n2) Publish a blog in Medium every month with the status of our project.\n3) Publish the amount of SPOs, NFT projects and Whales as they join the platform. "}, {"id": 2479, "q0": "SPOs are the backbone of Cardano. Helping new SPOs to get exposure to increase the decentralization of Cardano is always good since a more decentralized protocol is more resilient against attacks. \nThe proposed solution could be one of many tools to help SPOs to promote their pool while giving back to the community. \nIf successfully implemented this proposal would have a huge positive impact on the Cardano community as a whole. ", "q0r": 4, "q1": "The Team is already experienced on the Cardano blockchain and in Plutus which is a really important factor since learning Plutus is not that easy. Considering the challenges that might come ahead the team is equipped with the necessary skill set to solve them.\n\nThe timeline and the budget/budget breakdown which the team provides look realistic and give a good idea in the workflow the team plans. \n\nConsidering all the above it seems highly likely that the team will successfully implement the proposed solution.", "q1r": 5, "q2": "The team provides sufficient information to audit the development process but does not propose a communication strategy. This is not a major problem since it can be fixed quiet easy but is somewhat necessary to keep the community informed.\nThe KPIs which the team chose are fitting for the problem they want to solve. \n\nAll in all the community is able to audit the development but the team could make the process more enjoyable and easier for the community with a dedicated communication strategy. ", "q2r": 4, "assessor": "z_assessor_2307", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thank you so much for your assessment. We will work to have better tools to communicate with the Cardano Community. We post regularly on Twitter   https://twitter.com/ADALink_io and plan to post in Github https://github.com/ada-link and Medium accounts to keep everyone updated."}, {"id": 2544, "q0": "The project proposes an innovative idea that uses NFTs to promote Stake Pools by affiliated projects. It is a real use case for NFTs in what can be considered Web3 affiliate marketing that simultaneously promotes decentralization by giving the chance to smaller pools to shine regardless of their media/marketing ability. This project is definitely an added value and a pioneer in the space for Cardano and amongst other chains too. The beauty of the solution is that it presents a simple solution that results in an impact that is local on the Stake Pool level. But this impact snowballs to affect the whole network through an increase in decentralization and the number of stake pools which automatically creates a stronger ecosystem. On the other hand, the project is as limited as the number of SPOs willing to use it and the projects willing to participate which in my opinion won't be a big problem due to the nature of the Cardano community and willingness to support every idea that promotes decentralization.", "q0r": 5, "q1": "From the links provided by the team and according to their past experiences and previous projects, I feel confident to say that the success likelihood of the project is pretty high. \nFor starters, the team is experienced enough to make such a project happen. For instance, the main technical person in the team has worked as dev in multiple notable NFT projects which not only shows the expertise needed in the technical side but also the right relationships in the ecosystem needed for such a project. The team also presented a detailed plan for development and an infographic to showcase the design specifics of the solution. Furthermore, they gave a monthly breakdown of what can be expected and what will be done. Finally, they mention some risks and how to mitigate them but perhaps that part needed more attention. On the other hand, the detailed planning and careful design, and so on make up for that which is the main reason the project has a high chance of success.", "q1r": 4, "q2": "The team presents their projects mainly in the form of a monthly checklist of what will be done to manage expectations, they also provide detailed design infographics. These specifics can be used by the community to keep them accountable on a monthly basis by keeping track of their progress. The roadmap is the same as the monthly planning talked about earlier and it includes multiple milestones for accountability purposes. The nature of the project being open-source makes the task of auditability whole lot easier. For instance, the community can keep track of the Github commits, the documentation provided, and so on. The budget is broken down in the number of hours needed for every person working on the project which showcases transparency in spending that is appreciated by the community. No delivery date is specified, but one can assume that the team will resume work after funding, and then the monthly roadmap will start taking effect.", "q2r": 5, "assessor": "z_assessor_2317", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you for your assessment. We can sense you share our passion for the decentralization of the network. “Web3 affiliate marketing” Yes! Your comments were on point, completely understood the concept and goal of this platform. We will work on opening communication channels with the community and make this platform fulfill its full potential."}, {"id": 6474, "q0": "I love the idea of this proposal. It is very unique and has potential to bring a lot of utility to Cardano members. I know that there a lots of people that would love to be an SPO on Cardano but lack to means to successfully mint blocks each epoch. This proposal intends to address this challenge by providing a platform where users can go to delegate their ada to assist that stake pool and receive a portion of the funds as well. The people that are running SPOs should have a lot of education in the space and know how to successfully run a stake pool. I believe that this proposal could improve decentralized activity on Cardano because it will allow for more single pool operators to run a successful stake pool. It has the potential to have a global impact by helping stake pool operators around the world. For these reasons, I give this section of the proposal 5 stars.", "q0r": 5, "q1": "It is important to note that this proposal includes information on the team members of this proposal. They have included several twitter accounts an Linkedin accounts as well. It is important to include this because specific details and information help determine the likelihood of success for a proposal. There is a detailed roadmap that gives details on exactly what the team will be working on for the next couple of months. In this case, they have a plan to work for the next 7 months. It is stated that this will being during Q4 of 2022. There is also a detailed budget breakdown that includes details that describe who the funds will be allocated to. It appears that the funds detailed in this section is accurate according to the amount requested. The team's plan and experience appears to be sufficient to complete this decentralized tool that will help SPOs to be more successful and promote single pool operators. For these reasons, I give this section 5 stars.", "q1r": 5, "q2": "There is a significant amount of information that has been provided in this proposal. More importantly there is a significant amount of specific details and timelines. This information is extremely important when auditing the potential success of a proposal because it allows for the team to be held accountable for it. The team has provided specific details on each of their team members and also includes their experience and achievements. There are a couple of ideas that should be considered with this proposal. The first is, does this project have an engaged community behind the project? If not, how does the team plan to have an engaged community that is aware of this proposal and the value that it can bring to these members. It should be rather easy because it will benefit both community members and SPOs. There needs to be a community or rather, a form of a community that can hold the team accountable for this information. Aside from that, this project seems to be very promising and includes a lot of specific information that helps lead me to believe that this project is likely going to be successful if funded. For these reasons, I give this section of the proposal 4 out of 5 stars. ", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to read our proposal, we appreciate your comments and feedback."}, {"id": 15325, "q0": "A brief description of the proposal:  NFT projects can choose to support specific SPOs by directing their NFT holders to delegate to the pool.  In return, the SPO gets whatever percentage of the block rewards their delegators represent (in a pool with 10m staked, if the wallets of NFT holders total to 9m, the NFT project receives 90% of each block reward).\n\nThe proposal is for the research and development of the platform to facilitate the onboarding of these relationships (a marketplace for what they are calling alliances) as well as a lightwallet integration that provides transparency for all parties and observers into the alliances.\n\nIn terms of helping small SPOs acquire delegation, which is one of the most significant factors for decentralization of the network, there is a certain elegance here.  NFT projects can market themselves as helping to decentralize Cardano and SPOs can gain stake (the first block of any epoch goes 100% to the SPO)  The NFT project will likely choose to support smaller pools, on the grounds that the delegation they bring to those pools will be a larger percentage of the rewards (though there does need to be an analysis done to see if supporting larger pools is a more ideal target, as they have higher total rewards.  Wherever the the protocol settles, this will need to be tested.  This and other issues reappears under feasibility).\n\nIt is worth noting that this harvesting of the rewards from small SPOs may end up having unintended consequences, for example slowing the growth and development of the node operators themselves.  Early SPO rewards can be the key to setting up better marketing, enhancing service, upgrading hardware and covering fixed costs.  While guaranteeing the rewards from the first blocks protects the smallest pools, there is this tricky moment in the pool's growth where they are able to make more than one block per epoch due to the influence of a big alliance, but suddenly their revenue drops sharply.  They become dependent on the alliance at that point, because if they cancel it they likely drop below one block per epoch, but if they keep it, they are missing out on the most lucrative, pre-saturation period of rewards.  This isn't a healthy dynamic.  However, the marketplace presumably could solve for this by allowing the alliance to be formed with specific agreements in place, such as a scaling rewards percentage that favors the pool beyond just the first block, etc.\n\nBecause the problem being addressed is one of the most critical issues to the sustainability and future security of the Cardano protocol, and because the team has provided a workable solution built around a distributed marketing model, there is definitely the potential for impact here.  Unfortunately, due to gaps in analysis here for game theory and unintended consequences, I feel there is more work to be done on the practical applications of the theory here, and find that I can neither agree nor disagree with the ultimate outcomes that will be achieved here.  3 stars.", "q0r": 3, "q1": "As noted above, there are gaps in the practical application of this idea.  The first is the note about whether sharing the SPO rewards beyond regular delegator rewards actually delivers positive outcomes for SPOs.  More research is needed there.  Additionally, there is a broad issue of how SPOs go about sharing those rewards, which is indicated to be a manual process, enabled by smart contracts in the future, but currently down to trusting the SPOs in the present.  Even without smartcontracts many aspects of this could be automated and governed, and the buildout of the wallet integration for transparency can serve as a temporary support for the outcomes desired (you may be starting to see a thread developing here...I'll point it out in full under auditability).\n\nFurther, there are legal ramifications to be considered, as the construction of these alliance agreements are really contracts, and both parties will need guidance and governance for entering and leaving them (what if an SPO wants to back out of an alliance that has been lucrative for the NFT project once the SPO might be able to make blocks on its own?)  There is also an added issue about whether it is possible for a malicious actor to be the sole holder of an NFT project (which can be disguised with auto wallet creation and distribution) and to basically execute a type of sybil attack where they ally with SPOs within a certain range and effectively dominate their rewards distribution, grabbing both the delegation AND spo rewards, and then undelegating (can't regulate the actual delegated wallets via the alliance so the NFT side of the alliance has an imbalance of power even for honest actors), rebranding and approaching another project.  More risk analysis is definitely needed here.\n\nThese aren't issues with the timeline, milestones or budget, and they aren't even criticisms of the team.  While there are specific issues with these areas, they all are adequate in many respects, and reasonable on most points.  Because of this, there is definitely a basis here for supporting the feasibility of the project.  However due to unacknowledged risks throughout the proposal, I am not able to agree or disagree here.  3 stars.", "q1r": 3, "q2": "And this is where the chickens come home to roost.  The milestones on the roadmap have been provided as reference for the KPIs (note to proposer, it is always a good idea to include the metrics here specifically rather than referring readers elsewhere...auditability is an opportunity to summarize the roadmap and impact in an easily understandable, actionable way).\n\nThe issue here is that what has been drawn up leans heavily into the building of the platform, and integration of tools like the light wallet.  Looking over the strengths and weaknesses of the proposal, it occurs to me that without changing the budget or team, and without even really altering the timeline (but 100% redesigning the metrics) this project could pivot from delivering the fully functional platform, rife with risk and unintended consequences, to instead developing a *proof of concept* that they than ran in a controlled way with interested SPOs.  The legal issues become deliverable milestones rather than risks; the edge cases and opportunism become parameter discoveries instead of adoption blockers.  Framing this project as a proof of concept alters the warp and woof of the entire proposal, turning weaknesses into strengths while allowing the real shine of the proposal, which is its attempt to address sustainable decentralization in an innovative way, to come through as a north star for expressing and pursuing outcomes.\n\nI love the direction and innovation being considered here by the team, but there are real issues that must be sussed out before going too far down the road of building the solution.  My caution here is to \"look before you leap\".  Because of the lack of KPIs and metrics that effectively describe progress towards and realization of the goals described under Impact, I'm afraid I cannot agree that this proposal is ultimately auditable:  2 stars.", "q2r": 2, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We want to build a platform that provides both Single SPOs and NFT Projects or creators the ability to promote delegation to a particular Pool and share the rewards of the SPO in a fair manner.", "experience": "Our developer is a Mechanical & Mechatronics Engineer that has been an active builder in the Cardano ecosystem. He has helped launch multiple NFT projects, built a highly efficient batch minting engine & built a Token ATM as a proof of concept of the scalability of the UTxO model"}