{"id": 422053, "author": "workshopmaybe", "title": "Dandelion: Decentralized Web3 APIs", "url": "https://cardano.ideascale.com/a/dtd/422053-48088", "category": 26595, "amount": 90000, "description": "APIs are a bottleneck to decentralization in Web3 apps. Dandelion provides an alternative to centralized services like Infura and Blockfrost, but it is not yet built to be reliable at scale.", "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 803, "q0": "Dandelion is a free community API service which is powering a few applications in Cardano. Exact utilisation is not provided in the proposal. I have personally used it and have experimented with hosting a node. It helps a large number of Cardano enthusiasts to experiment with Cardano. True decentralisation of Cardano will rely on the availability of services like dandelion. Therefore there is a need for the community to support such an initiative. Further as stated in the proposal Dandelion model demonstrates a new way of thinking about distributed value capture. The well-marketed API providers like Blockfrost will be meeting a set of requirement however community-sponsored services will enable better decentralisation and has the potential to remain as a standard/reference for the other in a federated setup. With these considerations, I personally feel that Dandelion hosting with Catalyst support is a just requirement. ", "q0r": 5, "q1": "Gimballabs has been a major contributor to the Cardano community from the very beginning and has successfully completed a large number of catalyst proposals. The current proposal is to support the hosting of Dandelion for one year and to develop an Infrastructure as a code base which can be readily used by people having the capability to support Dandelion.  I have personally used the Dandelion code and the amount of development that has gone so far into the project. The proposal is to support three components for improving the Dandelion ecosystem, they are Research Decentralized Cloud Computing Networks and utilise poject-Based Learners to research and implement tokenized access systems. These two activities can create a new model for supporting and sustaining dandelion. The team proposing has already build and has supported Dandelion for last 2 years, therefore it is very likely that they will be able to implement the proposal. ", "q1r": 4, "q2": "The proposal is for 90K USD out of that 60K is for supporting the hosting of Dandelion servers for 12 months at the rate of 5K USD per month. The cost of one instance of AWS server m6g.2xlarge with 8 CPUs and 32 GB RAM ( three such machines are likely to be sufficient for one Dandelion node) is approximately 220 USD per month. Therefore the hosting will support up to 6 Dandelion nodes this will give good geographical redundancy and will be able to support a large number of dApps and light wallets. This had the potential to open up the scope for many free services and dApps. The remaining 30 K USD has been earmarked for “the development work of making sure that the network is sustainable in the long term.” that is for developing tokenamics and for developing APIs. Clarity on how this 30 K USD will be utilised would have added tremendous value to the proposal. However the output of the proposal will be in open domain and the services of Dandelion will be measurable by the community, therefore the project is highly auditable. ", "q2r": 4, "assessor": "z_assessor_2129", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4068, "q0": "This is an important proposal that aims at increasing the quality and robustness of Dandelion, a solution that is already bringing value to the Cardano ecosystem for the past 21 months. Cardano builders have been using it to test their ideas and learn how to use Cardano and will continue to do so. To improve this solution already approved by the community the team is proposing to increase the number of servers to keep Dandelion running reliably and to develop an access service that allows the network to capture enough value so that operators are incentivized to run resilient Dandelion Nodes. This way web3 apps built on Cardano will be truly decentralized and will not need to rely on centralized services like Infura and Blockfrost. The goals of this proposal clearly align with the challenge settings because it will contribute to the construction of a thriving ecosystem of different dApps, products and integrations for the community to use that increasingly become the better alternatives over current centralized providers. Additionally, not only the team is concerned at tackling scalability issues but this is actually the core of the proposal.", "q0r": 5, "q1": "The team is composed by Roberto Morano, James Dunseith and Giovanni Gargiulo. The three have strong skills in software engineering, devops and Cardano and have provided evidence of that by linking their LinkedIn pages. The budget is broken down into identifiable items, but the team could have further broken down the topic on development of the API access system and tokenomics design. It is not clear how they estimated the amount requested for that item. Nevertheless, the total amount requested for the proposal is within acceptable limits. The detailed plan provided is well explained, it is divided in three stages and they show exactly what will be done in each of them. For instance, in the first phase they will Research DCCNs and will develop a long-term partnership with the chosen DCCN community and ecosystem. In addition, they have identified the major risk of the project, which is that web3 developers do not free themselves from existing systems. Unfortunately, they have not proposed a mitigating solution, but a suggestion would be to invest in targeted marketing to spread awareness of their alternative solution.", "q1r": 4, "q2": "The team has provided a three-stage roadmap with clear milestones and an estimated timeline for the execution of the tasks proposed. Oddly enough, the timeline was provided segregated from the plan. It would have been better if they were integrated. For example, the way it was described it is not clear what the team will be doing in the 5th month. The only KPI mentioned is total requests. It would be enriching if they added others KPIs to the proposal such as users' perceived quality of the product (could be reached by survey or a small pop-up where user selects a grade from a range of options) or number of web3 apps using Dandelion. Finally, even though they claim monitoring of the network and the deployment deals will be public they could have announced where this information can be found.", "q2r": 3, "assessor": "z_assessor_2513", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5193, "q0": "The proposal wants to extend the Dandelion dApp, by funding additional servers, at the same time ensuring the app is still decentralized by using DCCN. The project is already running for 21 months, and the developers are very experienced. The proposal itself is well written and provides crucial information. These factors make me confident that the team can implement the plan seamlessly. The proposal outlined the main risk of the project (and practically any other web3 projects) as dependent on the existing web2 system, which can make the alternative option not viable.", "q0r": 5, "q1": "There are three stages in the project, and each of them is explained in detail and clearly. The proposal provides a general budget breakdown, of how they will use the proposed budget. However, the funding that goes for development can be written in more detail. It will be better if they give information on the hours needed to complete each milestone and their rate per hour. That information is important to let voters know the workload of the project and determine if the proposed budget is reasonable or not. The proposal provides comprehensive information on the core team member's background, experience, and past projects of them. On top of that, they also attached LinkedIn profiles so the community can easily verify that they are giving funding to legitimate persons.", "q1r": 5, "q2": "The auditability of the project is easy by using the project’s public GitLab repository activity. Also, the DCCN is fully public for the community to check and observe how it behaves. The defined success is clear and simple, successfully deploy Dandelion federated network and ready to accommodate new, independent node operators and contributors to distribute and decentralize.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 6082, "q0": "Another proposer quotes Preethi Kasireddy in his proposal Fix web3 rabbit holes: \"many DApps choose to use services like Infura or Alchemy to manage their node infrastructure for them. Of course, there’s a trade-off since this creates a centralized chokepoint, but let’s leave that rabbit hole for another day.\"\nDandelion and Gimbalabs have been tinkering on the community's behalf and in the service of decentralization since the early Catalyst funds, trying to tackle this challenge head on. Decentralized Web3 APIs are a crucial bit of plumbing to enable real world mass use adoption of Cardano the way it was intended. The scope of this particular proposal is to scale Dandelion, and allow its \"testnet only\" disclaimer to be gradually peeled off the can. As the proposal mentions, the Dandelion network is already used in production by a lot of smaller project, sot this is a fantastic, spot-on direction for the Challenge Setting. In fact, almost all possible directions for dApps, products and integrations could benefit from a truly decentralized, scalable alternative to private APIs.", "q0r": 5, "q1": "Two Gimbalabs co-founders and Giovanni from ArgusNFT will be working on this project.  They have been funded successfully in previous funds and delivered. The timeline for this proposal over about a year starts with researching Decentralized Cloud Computing Networks, deploy and expand a network of nodes, and create tokens (fungible or non-fungible) to allow \"metered\" access in a decentralized fashion. This is a highly credible and feasible implementation recipe, and only vague where it needs to be, i.e. keeping flexibility to scale to demand and incorporate research findings. The main risk the proposers see is that decentralization does not become a treasured goal, but very little in terms of operational or procedural risks, and I agree.", "q1r": 5, "q2": "The Auditability section is extremely short for this proposal, but that is acceptable as the network and the deployment deals will be public by default and it will be easy for the community and auditors to simply get feedback by looking, or asking some of the many Dandelion users. Maybe some nifty charts or links to a dedicated project website or Gimbalabs' Discord channel could have been provided here to give auditors and voters more peace of mind, but I see zero risk of the proposal being insufficiently auditable. It is also worth noting that the team will provide monthly key metrics such as total requests to the network.", "q2r": 4, "assessor": "z_assessor_2781", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 15021, "q0": "This proposal looks a bit complex but it really isn't.  It is seeking the funding required to keep the Dandelion server nodes running full time for 1 year, and of the total budget ask, approx 30% is targeted at weaning the nodes off of Catalyst funding and making them sustainable.\n\nThe first part of that is easy to understand:  the decentralized API service that Dandelion provides is community built and maintained, and acts primarily as a free to use and deploy prototyping lab for projects of all types building on Cardano.  Unfortunately it has a huge problem...its too damn good.  Projects continue to run their projects on it after successful prototyping and as a result, more and more requests put stress on the servers and the people who maintain them.  Given this value to the community, it makes a lot of sense that dandelion should lean into Catalyst funding, as it is a big part of putting funds in the treasury in the first place.\n\nBut the team would like to improve it even more.  Now this is a bit more complex, but if you just transpose your knowledge of Cardano over the top, it lines up pretty nicely.  They would like to build and deploy a federated core of nodes (like Cardano staking started as) to take over with dandelion.  Then they want to design a governed tokenomics that is able to translate requests into a self-sustaining treasury for the node network, effectively rewarding anyone who adds themselves to the API hosting network, via either cloud or full metal setups (like Cardano staking became).\n\nThe model they are emulating is accessible and relevant, and the service is quite nearly critical in the community.  And on top of that, they are modeling the best attributes of decentralized computing and governance.  A full 5 stars for Impact are deserved here.", "q0r": 5, "q1": "As mentioned above, there is complexity to this problem, but in theory, it isn't anything new under the sun.  The team is as experienced as it is possible to be in executing everything except the token engineering (but they are actively learning and iterating already in the gimbalabs server).  \n\nThey have put the costs for the people side of the equation in a separate proposal, on the grounds that the nodes deserve to exist whether they have to tend them for free or not.  Hopefully it doesn't come to that, but focusing on this proposal, the budget appears at first glance a bit sparse, but all the info is present to break it down:  the upfront server costs are for a full 12 months (Fund 13 at least before funding would be required again on this timeline), and the costs are pegged to the current costs already being accrued.\n\nIt does get a little less transparent for the \"sustainability\" section of the budget, where the costs of an engineered token, a minting contract and an access system to the node operators (remember, federated to begin with but designed to decentralize) are all smashed together.  To me, the governance framework is the wildcard here...  hard to predict a cost since no one is really building those except ad-hoc within projects.  But the contract is a mundane expense and the server costs involved in the access systems will be set by the governance scheme.  So this looks like an educated guess on the sustainability, and frankly, I doubt a bunch of other educated guesses that add up to it would have served any better.  Maybe they could have got an estimate on the contract, but I have a hard time removing a full star just for that.\n\nGiven that the team is experienced and knowledgeable, and that they have provided great descriptions of the deliverables I believe there is a solid feasibility foundation here.  Despite the chunky budget numbers provided, I also believe that the audit trail they provide (more below) along with the aforementioned experience do not limit the feasibility of the proposal, and I am giving it 5 stars for Feasibility.", "q1r": 5, "q2": "The main detail here is that the servers are self-reporting and thus everything related to their outputs and costs is public info via the governance protocols they are going to design.  This is an elegant solution very much akin to being able to track block rewards (does that mean we will need to have a dandelion explorer?  Maybe call it Meadow).\n\nTheir description of the deliverables here is succinct, limited to the reports provided showing server status and requests, as well as the buildout of the federated server node and governance token.  Everything here can be adequately described via any software development protocol, just like they are using throughout gimbalabs for multiple projects.\n\nBut at the end of the day, it is a transparent, highly accessible team that builds for the community and makes themselves available on a daily basis to learn and grow together.  I expect nothing less than continued full accountability from this team and project.  A full 5 stars for Auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15250, "q0": "Dandelion offers an alternative to centralized services like Infura and Blockfrost, but it is not yet built to be trusted at scale. The proposal wants to implement the Dandelion Link Network on top of the decentralized computing grid while developing a platform for other independent node operations to join the Cardano API layer decentralization mission. The project has been running for 21 months and the developers are very experienced. Dandelion has been built and it is offered as a community service so that Dapp developers can test their ideas and learn how to use Cardano. The proposal is to use Catalyst funding to ensure that Dandelion continues to go strong so that everyone who relies on it can continue to use it. The proposal shows a legitimate problem and then provides an idea of ​​a valid solution, proposing a suitable challenge.", "q0r": 5, "q1": "This proposal has three phases: Research DCCN alternatives, Develop IaC (Infrastructure as Code) Open Source project for server deployment on selected DCCN, and System Development, and Deployment Access tokens to allow the network to capture + deliver value. Each stage of activities is explained in detail and clearly. Besides, the proposal has also provided timelines for implementing those stages in great detail so we can easily visualize the development process of the project.\nThe budget requested $90,000, used for server costs x 12 months, and financed the development of the API access system and tokenomics design. I think the development funding needs to be explained in more detail.\nFinally, the project team consists of 3 main members: Roberto C. Morano, James Dunseith, and Giovanni Gargiulo. The team provides a pretty satisfying breakdown of who they are. We know their names, and their role in the project, and a small text is also attached to reveal the history of those involved. It's good that when they attach the LinkedIn links of each member, we can have actual proof of the work they say they do. Another very positive point is that we have several team members who have a lot of experience and involvement with Cardano. Therefore, 100% trust in this team is passed", "q1r": 5, "q2": "The auditability to track the project's progress is referred to as network monitoring and deployment transactions (DCCN) that will be public for everyone to check how the service is doing and how much money is being spent. How to use it on hosting servers. The open-source nature of the project is highly appreciated and will facilitate project progress audits. It would be better to list a few stats that are directly measurable so that everything can be tracked more clearly. This may offer a solution to the given problem, but the proposal is not fully developed.\nThe success of the proposal is also very simply defined as a federated network authorized by Cardano's native assets and an ecosystem of tools ready to provide new, independent node operators. and its contributors to further distribute and decentralize it.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Deploy a Dandelion Federated Network atop a decentralized computing grid, while developing the foundations for other independent node ops to join the mission of decentralizing the Cardano API layer.", "experience": "Roberto C. Morano has been running Dandelion Community Service for 21 months. Dozens of apps have used it to bootstrap their businesses. Open Source projects have been built and are ready to use as deployment options. Now it's time to build business models that keep up."}