{"id": 422069, "author": "arnecke", "title": "Mobile Multisig Live Asset Trading", "url": "https://cardano.ideascale.com/a/dtd/422069-48088", "category": 26595, "amount": 18000, "description": "Secure trading is not easily accessible for people limited to mobile devices, forcing them to use insecure trust-based escrows. Mobile accessibility is of utmost importance for ecosystem growth.", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1715, "q0": "Yes, the proposal is well aligned with the following challenge KPIs: “Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products + Increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community”. I say this because a functionality would be built for mobile devices - cell phones - with compatibility with the Tent platform, used to trade P2P personal assets, such as NFTs, tokens in general and Ada. In other words, the proposal would be working with something that already exists, a technology that has already been used by the public for some time, and would expand it to this new form of use, totally designed for cell phones. I think this proposal is very relevant, not everyone has a computer, often people who only have their mobile devices find themselves excluded from using some of Cardano's tools, which are entirely designed for the web. The business of trading is something that is very intrinsic in the activities of our community, it is part of the daily life of collectors and holders of digital assets wanting to sell, buy or exchange their personal assets. So developing this dApp would definitely work directly with Cardano's technologies, as it would expand the reach of a very basic and necessary activity for the active members of the community. This would target the specific KPIs of the challenge, such as increasing the amount of tokens in circulation, of Ada, probably these negotiations would be done through smart contracts… that is, in general, Cardano would benefit as a whole, and also our community. It is positive that the proponents already have some experience with this activity, as they themselves attach the site to Tent, we can get to know the platform and see many compliments from users - which conveys a lot of confidence in the project. It is also positive that the proponents claim to have more than 10 years of experience in the field of strategy and design. The need to develop this tool is well explained in the excerpt “users have used trust-based collateral, requiring an intermediary to facilitate business. These escrows not only charge a percentage of the trade, they also demand trust and act as intermediaries. This should be better, which is why we developed Tent, a trustless p2p trading system that allows 2 wallets to connect and trade in real time using any native Cardano asset (NFTs, ADA or any token), for a fee fixed, irrespective of the commercial content”. It is also super valid that the proponents make it clear that, while this tool is already ready and being used for mobile devices, it is challenging to create a perfect experience for mobile devices, but they are prepared for this because I use the design thinking approach, that is totally focused on definition, idealization, prototyping and testing (that is, they will go through a very complex work, involving several steps, to reach their goals. It is also positive how they define some parts that would make up the solution development such as “Research and Analysis, Brainstorming and Prototyping, User Experience Design, User Interface Design” and etc. It is rare for this to happen, but there was no doubt in my mind when reading the full detail of the impact, I think this topic is perfect.", "q0r": 5, "q1": "The topic is fine, but not ideal. More detail could have been provided for the 3 main topics, roadmap, cost and team. Talking about the script, at first, we know what would happen superficially, the temporality is also not very clear, since it is said how long each phase would last - for example, the research phase would last 2 weeks - but we do not know when these phases would begin and when they would end, in a matter of months and dates. Commenting on the level of detail of the phases, all we know is what would be done, but we don't know how it would be done. For example, the research phase would aim to define dApp design references and directions for mobile applications. But how would these surveys be done? What parameters would be used to define the choice? How would the first tests, the prototyping, be executed? How would the more advanced testing and revisions in the roadmap be carried out? In my view, it would have been important for the bidders to have attached more information about each of the parties so that we had a more solid understanding of the development process itself. We also don't know, for example, how the Cardano community would carry out the tests (I believe the beta version of the dApp) and how the feedbacks would be collected and used to make improvements. Thinking about the costs, something similar happens in the case of the script. We have basic information about the money that would be used, but there is not much explanation regarding each of the parties. The total amount, of 18 thousand dollars, is divided in some parts: design, development and marketing. An $8,000 request is made for the design, which would include activities such as \"research, prototyping, user flows, look and feel, writing, components, assets, and screen designs.\" But we don't know, for example, how many hours the professionals in this area would dedicate to the project, and with that it is not possible to calculate the value of their work hours (we know how many weeks are set aside for this part of the script, but not how many weekly hours the designers would dedicate to the project). The same doubts arise in relation to the development part and the work of the developers. Talking about marketing, finally, $2500 is ordered that is split between a few parts: “Creating marketing material, graphic design, writing, and community management to appeal to this new, wider potential audience.” How much would go for each, more or less? And finally, talking about the team, an immediate confidence is transmitted to those involved because they are already developing this same project for the web, so it is natural that we have the peace of mind that they are ready to create a mobile version of their platform. But in addition, they provide us with a bit of information about each and various links from their pages, such as instagram, linkedin (some), twitter and etc. My suggestion here would be that we had more detail about each and that everyone had attached their linkedin profiles, if any, so that we could get to know them in more detail, in relation to their careers.", "q1r": 4, "q2": "Unfortunately, this topic leaves a lot to be desired, because very little information is reported on both the auditability of the process and the success. Regarding the progress, all that is said is “As this is a full development for Tent, we will be giving periodic updates according to the previously established schedule, also sharing our progress every step of the way”. But how will this be done, exactly? First, it would be necessary for the script to be written in a more detailed and specific way, for the activities to be explained more carefully. In this way, we would be better able to carry out adequate monitoring. We would need to understand better beyond what would be done, how it would be done and within what deadlines (it would be important that the proponents inform us about the dates, as I also suggested in the part of the script and feasibility analysis). How often would updates be made to our community, how would steps taken be shared? It is pending that a communication channel is also established. That is, a lot of important information should also have been included here: more details about the phases, start and end dates, a communication channel, and finally how often updates will be provided (in my view this would need to be at least once a month). On the final success, finally, much more needs to be said about the “full public launch with positive user feedback, accompanied by analytics that clearly indicate usage and adoption of the mobile iteration of Tent”. How would the launch be carried out, how would feedbacks be collected, how would the analytical data be monitored in relation to the use of the dApp? It is necessary to have clear ways of understanding whether the objectives of the challenge would have been met, and in my view this could be done, for example, if the proponents did a survey, after some time of launching the web version of Tent, to understand how the users would be using the dApp. Would the number of transactions, trades between active tokens have increased? Would the existence of a mobile dApp have actually attracted more audiences? How many people would be using the dApp and how? Had they been involved in some way more with Cardano? One idea would be to provide a user satisfaction survey, both for those who already used the web version of the tool and for new ones; and in this survey there could be some quick questions to understand if these people are interacting with our ecosystem in other ways. The research could be disseminated through social media, such as community telegram channels, discord channels (especially those aimed at monitoring funded proposals) and etc. For these reasons, in my view, much still needs to be added here, and unfortunately the topic is not adequate.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2482, "q0": "Many people only use mobile phones for blockchain business since it is possible but right now we don't have a escrwo on mobile devices. \nAdding one would be a huge benefit for the CNFT community and would empower more people to join since the entry barrier would be lowered significantly. \nThis project meets the challenge criteria perfectly and would impact the community greatly!", "q0r": 5, "q1": "The team already developed a desktop application which runs smooth and without many bugs. They have the necessary skillset to develop a mobile application. Their timeline and budget request look realistic and in an good range for the task at hand.\n\nTaking all that into account it is highly likely that the team will be able to deliver a working product.", "q1r": 5, "q2": "Since the team is well known in the CNFT and Cardano community in general it is relatively easy to audit the progress. In the past they always shard information fasst. The info and communication strategy which is presented in this proposal suggests that the same will be true for the future of the team. \n\nHence 5 stars.", "q2r": 5, "assessor": "z_assessor_2307", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3921, "q0": "The problem being non availability of Secure trading for people limited to mobile devices making them use insecure trust based escrows. For the growth of cardano ecosystem Mobile accessibility is a must. The proposer is trying to resolve it by developing a mobile version of tent allowing people have access for secure trading with a great user experience. This will be helpful for people to trade who are only limited to mobile devices and boost the growth of ecosystem. This does address the problem", "q0r": 5, "q1": "As per the proposal the proposer has experience developing many products and they have already developed tent therefore it's safe to say the proposer and their team has the required skills and experience. The proposer has given a clear plan with timeframe for each work. The fund demanded for the work needed to be done seems reasonable.\nAs the proposers and their team already have good experience in developing products not much risks are being involved other than getting delayed to some technical issues. based on the above observation it is safe to say it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has divided the work into phases and has given timeline for each phases this would be very helpful to track the progress of the proposal. The proposer have said that they will be providing updates about the development of the project this also helps to track the progress of the project. The success of proposal will be public release of the tent for mobile so, the success of the proposal can be easily measured. All these information should be enough to audit the progress and the success of the proposal", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7674, "q0": "This proposal aims to take the team's technology for trading NFTs to a mobile platform.  I believe this is an essential step for the ecosystem because of the widespread adoption of smartphones.  This will facilitate adoption of Cardano as it will give access to additional users and foster adoption.  This is consistent with the goals of this challenge prompting a 5 star rating for impact on this proposal.", "q0r": 5, "q1": "The team does acknowledge the possibility of challenges or delays in development, however this is an experienced team and they have already delivered the core product.  It seems likely the team will be successful in implementing this enhancement.\nThe team presents a clear process and a timeline of 14-18 weeks for completion of this product.  The bios provided for the team show a variety of skill sets, including past developments on Cardano.\nThe team does have multiple proposals for Fund 9 and I would have appreciated a short statement on how they plan to manage the multiple proposals should they all be funded.  Overall, I believe it is likely the team can deliver on this proposal.", "q1r": 5, "q2": "The deliverable on this product is a peer to peer NFT trading platform for mobile wallets.  The team plans to give updates based on the timeline in their proposal.  The community can easily audit this proposal the the deliverable is rather straight forward.  The team acknowledges they may ask for further funding related to Tent, but would not need further funding for this particular enhancement.\nAs a community member, I would be interested in the number of mobile transactions and users as a KPI after mobile is implemented.", "q2r": 5, "assessor": "z_assessor_2911", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9542, "q0": "For a clearly explained quantifiable set of impacts, at a lower than average cost, I rank this section a 5. Trading tent is the go to escrow service for NFT enthusiasts, so the impact provided here is uniquely facilitated by this team. This section of the proposal clearly defines impacts with stats on how much volume/assets/trades have been facilitated by their platform and they effectively articulate a problem statement that poses real security threats. These threats may be more convincingly defined with statistics on crypto/NFT thefts from phishing scams but I’m convinced enough without that data. The appeal to user experience is another major impact that is identified in this proposal that speaks to greater Cardano ecosystem benefits like experience, adoption and retention. ", "q0r": 5, "q1": "I can’t quite give this section a perfect score because it doesn’t include experience details and LinkedIn profiles for ALL core team members and the budget could use some further definition, so I rank this section a highly enthusiastic 4. I think the section on core team members is very well organized to show voters the role associated with each name but without LinkedIn profiles (or at least bullet points for each member’s professional experience) voters are not thoroughly enabled to evaluate the capability of this team to deliver. I think the roadmap is a great outline that concisely describes what tasks need to be done and how long it would take to deliver on a finalized product. However, the budget doesn’t finish the job on that outline by further defining labor by a breakdown of hours and hourly rates allocated to each category. This isn’t a huge deal, for me at least, because the overall low-cost of the proposal breaks down to an estimated $33/hr if you assume full-time hours and the minimum weeks for each task. Still, voters will want that work to be done for them so that they don’t have to put the extra work in. My verdict is feasible and efficient. ", "q1r": 4, "q2": "For neglecting this portion of the proposal by only providing general statements about the proposals definition of success, I rank this section a 2. While a 2 might be rather generous given the lack of substance in this section, the KPIs for this proposable are relatively simple and predictable. Plus, it is a pretty great proposal in every other section. Other proposals with sections of this quality will more often define success merely as completion of the product, so I appreciate that this section at least identifies usage as a metric that defines success. I think voters would respond well to specifically identified KPI categories and target metrics for each line (bonus points for progressive milestones throughout different timeframes of the life of the project). I would very much like to see much more substance here that would provide voters with something to tangibly evaluate and I think they would be more likely to respond positively with these additions. ", "q2r": 2, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will design and develop a mobile version of Tent, allowing easier access to secure trading to a wider audience while providing a first-class user experience.", "experience": "We are a team specializing in strategy and design for more than 10 years, we have designed countless of digital experiences and products.\nWe are also the developers of Tent, which has already been used to trade over 3,000,000 ADA and +10,000 assets."}