{"id": 422171, "author": "arnecke", "title": "Multi-sig Trading Audits & Security", "url": "https://cardano.ideascale.com/a/dtd/422171-48088", "category": 26595, "amount": 15000, "description": "Tent allows 2 users to trade assets using a multi-sig transaction. We lack security and penetration tests, and code audits done by a third party to better guarantee user and platform security.", "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 1960, "q0": "The proposing team has developed a solution that uses multi-sig to allow two users to exchange assets in a secure manner. This solution is developed and available, the proposers have acknowledged that they need further security testing and auditing in order to stay competitive on the market. We all know that one single breach or failure can destroy an otherwise healthy project within a short span of time. Therefore, it should be in the interest of the Cardano community to secure already successful solutions. This will allow the Cardano ecospace to remain a leader among the blockchains and it can strengthen the network further by promoting security. The proposal aligns with the “Dapp..” challenge setting the best among the available challenges in fund 9. As a result, the proposal is regarded as impactful and will receive a score of 5 points.", "q0r": 5, "q1": "In terms of feasibility, there is not much stopping this proposal from being feasible. The proposers already have their solution implemented and the security audit/testing will be performed by an external company. As long as the funds are available, it should not be a problem to go through with the security testing, and this aspect relies on the community vote i.e. it is not a risk to the feasibility of the proposal. \nThe plan and budget is rather sparse but given the scope and relatively low cost/risk of the proposal, it is deemed sufficient enough. They gain more credibility since their team is experienced with development and have delivered before. In total, the proposal is feasible to a great extent and its shortcomings are not impactful enough to deduct any points. Score given: 5 points.", "q1r": 5, "q2": "The auditability of the proposal is considered good overall. Due to the nature of security audits, it is hard for the proposers to share too much detail or even deliver a set of relevant KPIs. Instead, the focus should be spent on providing a roadmap with milestones and then delivering progress reports to the community that summarizes the findings from the security audit. The proposal indicates that they will deliver some form of updates to the community, but it is unclear what channel they will communicate through. It could be more explicitly stated where the community can follow the progress (example: blog/website/discord).\nOverall, the auditability is good within the proposal but some few aspects could be improved upon. The final score will be 4 points as a result.", "q2r": 4, "assessor": "z_assessor_2290", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 2116, "q0": "Tent is a service that allows users to directly trade native Cardano assets (NFT, Token, and/or ADA) in a single transaction in an easy, secure, instant (https://www. .tradingtent. io/). The problem mentioned is that Tent allows 2 users to trade assets using multi-signal trading, however, it lacks security and penetration tests as well as code testing performed by third parties to ensure better user and platform security. Through funding this proposal, the authors want to be able to perform all security and penetration tests as well as code tests performed by third parties and make any necessary changes to improve security. Everyone benefits from this. Users can fully trust Tents' codebase and server security, and the Cardano ecosystem enjoys an extremely secure trading system. This proposal effectively addresses the challenge and is a necessary component to add to the Project's Catalyst.", "q0r": 5, "q1": "Regarding the roadmap, the proposal suggests 3 important phases: 1 Code Testing (~4 weeks), 2 Server Testing: Security & Penetration Testing (~4 weeks), and Security Improvement & Development. In each stage, the necessary activities are explained. However, in the 3rd stage, we are not given time to know how long it will be done. A slightly more detailed plan by which this proposal can be measured would help ensure that the right progress is being made. The budget requires $15,000 and is allocated to three phases in the roadmap, each of which is $5,000. In my opinion, the budget needs to be explained in more detail why each stage needs 5000$? What will they be used for? Finally, the team, there are 4 members mentioned, we know their role in this project, but the experience related to project implementation is not mentioned. Therefore, I think it is not enough basis to be able to assess the capacity of this group. Any reference to team size, qualifications, and previous experience of team members will help to better evaluate the proposal", "q1r": 3, "q2": "The ability to check the progress of the project at a relative level. The proponent states that and for security reasons, not all results can be shared, but any progress that is shareable, will share with their community. The final audit results will also be shared with all their capabilities. However, the proposal did provide some KPIs so that the community could audit the project, which is both security audits should be reflected on communication and marketing materials, such as the website, social media, and even on the website. The Trading Tent app itself, allows users to know they can trust both the codebase and the infrastructure.", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2483, "q0": "Trading tent is one of the most used trading solutions in the CNFT community and partners with many projects. \nIf the code has bugs the damage to the community can be sever. This is why a code audit and penetration testing would highly benefit the community. \nIf the community looses trust in trading NFTs safely the market loses value and Cardano looses customers.", "q0r": 5, "q1": "The timeframe the team provides seems reasonable. They already have a working product which is used extensively by the community. The timeframe and cost for the audit match expectations. \nSince they already have a product which works it is highly likely that they can fix any bugs which are found during the audit.\n\nThis leads to the conclusion that it is more than likely that the team will succeed with implementing the solution", "q1r": 5, "q2": "The team presents a reasonable approach on communicating the progress of the audit. Since the audit concerns security-questions of a working product they can't share every detail but their open communication in the history of the project suggests that they will continue the same way in the future.", "q2r": 5, "assessor": "z_assessor_2307", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 7614, "q0": "This is a straight-forward proposal. Tent is already a functioning dapp and has a sizeable userbase. The proof of product is self evident. This proposal is simply asking for funding in order to conduct the appropriate third-party code and security audits that, while aren't absolutely necessary, vastly improve the trust with potential customers. When it comes to dapp development, an integral codebase and security parameter are paramount. This is especially true with regards to a dapp such as Tent which directly deals with handling customers ADA, NFT, and DeFi assets. Trading Tent has already had a sizeable impact when it comes to the Cardano NFT ecosystem. This proposal stays true to the F9 challenge as it improves upon an integral product that is utilized by many Cardano users.", "q0r": 5, "q1": "Based on the team members involved in this proposal and their experience with dapp development I am comfortable with stating that this proposal would be implemented successfully. Having your head developer be the liaison to the third-party auditors is the right decision as he is the most knowledgeable when it comes to the current codebase and can answer any pertinent questions the third-party audit team may have. I would recommend detailing the parties that you intend to use in order to complete these audits. This will help voters have a clear understanding of the reputation of the these groups. This is also the only reason I didn't give a five star rating. It appears that the budget set for this proposal is appropriate but we cannot know for sure since we are not aware of the third-party auditing groups that you plan to use. ", "q1r": 4, "q2": "While certain qualities of this potential audit cannot be shared for various reasons it is important that regular announcements and updates are communicated to ensure your customers the work that is being done. I understand that this is essentially stated in the proposal but I would like to emphasize this in terms of auditability. If this proposal is rewarded with Catalyst funds the responsibility is on you to provide accurate and detailed updates on the progress of this audit plan. There aren't any relevant KPIs that can be used with regards to this proposal so this is why I specifically stress communication with your customers through Discord, Twitter, your website, etc.", "q2r": 4, "assessor": "z_assessor_2907", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Through the funding of this proposal, we will be able to perform all the security and penetration tests, and code audits done all by a third party, and implement any changes needed to improve security", "experience": "We are a team specializing in strategy and design for more than 10 years, we have designed countless experiences and products and successfully launched them to market. We are also the developers of Tent, which has already been used to trade over 3,000,000 ADA and +10,000 assets."}