{"id": 422296, "author": "jpg.store", "title": "JPG Create: Generate Art + Metadata", "url": "https://cardano.ideascale.com/a/dtd/422296-48088", "category": 26595, "amount": 140000, "description": "The Cardano NFT Ecosystem is at the point where it is starting to attract creators from other spaces, yet the chain at this time does not have tools that allow for easy onboarding.", "f6_no_assessments": 7, "f6_rating": 3.8095238095238098, "videos": [], "media": [], "f6_assessments": [{"id": 9549, "q0": "For a lack of thoroughly described impacts that appeal to quantifiable impact on the Cardano ecosystem, I rank this section a 3. I’m rather surprised to see a Catalyst proposal coming from jpg.store because the most dominant service provider within the largest volume industry in the Cardano ecosystem is most likely the most profitable organization in the community. That been said, the impact section is an opportunity to provide voters with a clear sense of cost-impact ratio to determine if this proposal is more valuable to the ecosystem than other Catalyst proposals. In this case, the proposal only provides what the proposers intend to create but it doesn’t explain what value this would provide. I would suggest providing information about the number of existing users on the platform, the growth rates of platform/industry adoption, and some form of research that demonstrates how these kinds of features could grow the greater ecosystem (perhaps with displays of modeling evidence from other ecosystems). For a rather expensive proposal that could otherwise fund 5 more average priced Catalyst proposals (that might not have the cashflow to fund their proposals), I think voters will want to see more substance here as to what value this provides and why the funds are best spent here. ", "q0r": 3, "q1": "For lack of thoroughly displayed information on development team capability and spending efficiency, I rank this section a 2. While it’s likely obvious to most that there is a capability of this team to produce a product that is usable by the masses, this proposal does not thoroughly prove it by providing core team qualifications, names, and resumes. The proposal only provides a link to the website that displays team pseudonyms, Twitter links, and no LinkedIn profiles (which is standard practice in Catalyst fund proposals). The roadmap is a functional display of how long the proposal would take to reach completion but it doesn’t leave voters with a sense of efficiency that can tie well into the budget section. The best proposal roadmaps breakdown each task according to macro timeframe AND hours of labor needed. This budget isn’t thorough enough to give voters a sense of confidence in the proposal spending funds efficiently and responsibly. This proposal could greatly benefit from a further breakdown of the budget as allocated according to hourly rates and hours of labor needed as well as more definition of what is included in the “overheads” category. If voters are left with the information given in this proposal, they would likely determine inefficiency in spending as $3500/week comes out to $70/hr evenly split between 5 developers (if you assume full time hours). At this rate, this translates to a yearly $136k that well exceeds industry standard in many areas (unless working at major corporate tech companies). I think these concerns can easily be aided with further breakdown and definition. ", "q1r": 2, "q2": "For omitting the specific KPIs that will be measured from data collected from beta testers, I rank this section a 2. I give this section a little credit, as I assume the proposer has particular KPIs/metrics/data in mind when they indicate beta testing feedback and feature testing. However, without explicitly identifying these metrics, voters are not left with a clear understanding of what the team is evaluating pre-launch. I would suggest also including metrics measure post-launch, as this is where the actual impact of the proposals approval manifests itself. The best proposals take that extra step to quantify these metrics to display to voters that there is a specific level of impact that is being aimed at for this proposals approval (bonus points for setting progressive metrics at different milestones in the future of the project), which enables greater confidence in voter perception of cost-impact. Overall, I think this proposal displays an innovative idea that lacks the presentation that voters will expect for an expensive request from a top-tier Cardano project. ", "q2r": 2, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 13626, "q0": "The proposal is a solution that simplifies bulk NFT generation for those who do not have much technical knowledge.\nIn the proposal, the author has not clarified the specific user audience for this product: who are they? Why do they need this app?\nIf the author clearly states these contents, it will help readers understand a lot more about the solution and its benefits.\nFrom my point of view, the audience that the author wants to focus on serving are 2D 3D artists and designers. They are the creators of beautiful NFTs but they don't know how to get those pictures into NFT and put them on the exchange.\nWith the solution created by the author, it will solve the technical difficulty, making it easy for artists to put their works on the Cardano Blockchain. That drives sales and new users.\nBecause the content proposed by the author is a lot of technical words and the way the information is expressed is quite difficult to understand. So I want to describe more easily the solution that the author wants to talk about.\nIn my opinion, the author should present the proposed content focusing on the main issues such as who are the users, what benefits do they get, and what requirements does this solution solve for the challenge. Thus the proposal will be very easy to understand.\nIn the presentation of risks, the author may face other risks as the system is not designed to be simple enough for non-technical users to use. ADA slippage caused insufficient funds to complete the proposal.\nIn this category, I found this proposal to completely address the requirements of the Challenge.", "q0r": 5, "q1": "The proposal's blueprint lacks detail and is very general. Next, the author should state which tasks will be performed by which members. This made it clear to me and to the voters that the team members were qualified to carry out the proposal.\nRegarding the cost description, I don't see it as detailed. For example, an employee cost of 14000USD/week, this cost is for employees to perform what jobs and tasks.\nOverheads: $3500 USD/week. The author needs to clarify who these costs are for, what activities, events, equipment?\nFinally, about the experience information of the team members, I visited the link that the author provided at https://www.jpg.store/team\nI see team members are mostly anonymous. I know jpg.store because your team has created a very good and useful product for Cardano. But I am worried that the account applying for funding from Catalyst is a member of the jpg.store team. Or the person who wrote this recommendation is an impersonator of the jpg.store team.\nThat's what you need to make clear to win the trust of the voters.\nWith the detailed plan and the cost description not yet detailed, I only rate this item at 3 stars.", "q1r": 3, "q2": "Regarding KPIs, the author did not provide clear metrics that would help me and the voters understand how they determine the success of this proposal and how it will impact development. of the Cardano ecosystem.\nI can give some suggestions on recommended performance metrics, such as the number of people using the application, the number of NFTs generated, the number of transactions generated from the NFTs.\nThe solution that the author presents to me is a bit confusing and not yet detailed. There are many issues about implementation plan, implementation cost and proof that this is a team member of jpg.store applying for funding. Because I am very worried that the author proposed to be fake.\nAnd if the author is really a member of the jpg.store team, then I feel completely reassured that the author and the team will complete this proposal. Because they are the creators of real applications and have generated a sizable amount of transactions for Cardano. The problem here is just how they can prove to voters that this is not a fake account.", "q2r": 4, "assessor": "z_assessor_3702", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 571, "q0": "This proposal directly addresses the challenge question, and will help to bring more adoption. The challenge brief includes \"Novel and viable applications and products get built on top of Cardano attracting users. Integrations manage to pull in more adoption.\" Considering the recent growth in NFT projects on Cardano, which by some reports make up about 40% of the projects building on Cardano, and the success of jpg.store to become the most used NFT marketplace on Cardano this proposal can help to onboard a new wave of NFT artists and NFT enthusiasts. By making it easier and cheaper to launch an NFT project on Cardano than on other competing chains, this proposal may also help to bring existing NFT artists onto Cardano from other competing chains. However, I think the largest impact will be in bringing new users to learn how to launch their first NFT project. This proposal can easily scale with increasing adoption and users. \n", "q0r": 5, "q1": "The team is known by the Cardano community and while most of them are sudo-anonymous with only twitter profiles and aliases listed on their team page, they are accessible to the community, and are well known to be able to deliver a high quality NFT marketplace, so it is also very likely they have the skills and experience to deliver on this proposal. The budget is clear, and broken down into employee costs and overhead categories. It could be refined with some more details but I think this is acceptable for the company to generalize the labour cost and time required to build out the proposal. There is a detailed plan included with specific features that will be delivered. The jpg.store website includes individual NFT minting service, and they have already announced that large NFT collection minting services will be available soon, so this shows me they are capable and confident they can deliver this proposal and that they are probably already working on this solution. \n", "q1r": 5, "q2": "The proposal includes a specific timeline of 8 weeks, with key deliverables included. There is limited reporting to the community during the development process, but this will be straightforward to audit after completion and launch of the service, as the final product and deliverables are clearly defined in the proposal. It would be nice to see the team commit to specific reports or development updates produced weekly and provided to the community, but considering the scope of this project I'm not sure that would be necessary for this 8 week project. I believe the community can audit the success of this easily after the 8 week period. The KPI's would be to audit the process and insure the process includes all the stated features in the proposal such as the metadata standard and a low tech simple solution to turn layer files into an NFT collection minted on Cardano and stored on IPFS services. ", "q2r": 4, "assessor": "z_assessor_2108", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5633, "q0": "The proposal has described a problem closely aligned with the challenge. Indeed, the NFT space is very technical and costly for most CNFT projects, who particularly do not possess the necessary infrastructure to launch their own NFT collection. To date, minting services, metadata generation sites and art generation platforms are highly scattered and less integrated in the Cardano ecosystem. This raises the barrier of entry for NFT creation significantly as project founders/artists may find themselves overwhelmed by various other tasks, instead of doing what they do best. \n\nThe proposed solution has communicated clearly that it intends to lower barriers of entry of launching NFT collections on Cardano for all aspiring non-technical people by providing a one-stop, integrated service for all aspects of NFT creation. Should this be a success, I foresee this service to be a great addition to the Cardano ecosystem as it introduces more use-cases that can be used by virtually anybody of any background. \n\nAfter understanding the proposed solution, I am certain this is an impactful proposal with metrics and goals aligned to the challenge. The CNFT space is a thriving space with growing recognition from the crypto community worldwide. Having an integrated service which covers all aspects of NFT creation and minting will significantly drive mass adoption further. However, I think the proposal lacks clarity in this regard as there should be quantifiable metrics for the Catalyst community to objectively gauge the impact of this proposal. This will be explained more in the latter section (refer section 2 & 3 of assessment). \n", "q0r": 4, "q1": "I am certain this proposal is feasible as the team is the backbone of  the leading CNFT marketplace platform. The success of the marketplace showcases the team’s resources and technical capabilities. Plus, the team has demonstrated confidence in the aspect of artwork generation. This conveys a reliable and productive team. \n\nHowever, one reason I deem this proposal to be less feasible than it is supposed to be is down to the reason that the proposal does not address the background, experience of the 5 core members. The only information given on the team is “4 engineers and 1 UX/UI designer”. There is a significant lack of explanation as readers are left wondering what will the 5 core members be doing to materialise this proposal. By doing so, the team has missed out on one of the most crucial aspects determining the feasibility of all Catalyst proposals. Without clear explanation on the 5 core members, it is hard for readers of various backgrounds to gauge if the team has enough talents to work on the project, hence negatively impacting feasibility. I also have the same issue with the budget breakdown of this proposal. Although the requested amount is reasonable, the amount provided is very superficial. For example,employee costs of $14,000 / week, how will the $14,000 be distributed, what will it be used for, has it accounted for the possibilities of requiring extra staff? Ideally, we would have a breakdown of pay rates of the 4 engineers and 1 UX/UI designer so that readers can compare their pay rates and measurable benchmarks such as industry rate and task difficulty. \n\nRegarding timeline, I think it is reasonable, given there are several one-stop integrated services the likes of what the team proposed in other chains as references. What’s left is mostly on integrating services provided with the respective vendors, whilst ensuring its workability in the Cardano ecosystem. Again, I would suggest the team to provide more clarity in their timeline. For example, under the umbrella of core functionality development, what would be done, when it would be completed, who would be in charge, and how it would be done? Such information is essential for readers to gauge the scale of this proposal with more objectivity. \n\nI think the team has identified the appropriate risk, that being product usability as the proposal targets non-technical individuals. \n", "q1r": 3, "q2": "As a whole, I find this project to be less auditable. The roadmap has no clear deliverables and milestones. Sure, all aspects of the project are said to be tested in a modular manner and having beta testers for feedback. Question is, what would be tested, and would updates be provided by the team as the project progresses? \n\t\nThe identified metrics/KPIs focus on usability being the success of this proposal. This is a relevant KPI. But, the measures given in this proposal are highly subjective. What does it mean by “empowered enough”? To me, this is not the most useful indicator as everyone has varying technical capacity, tolerance levels, workflows and experiences. For one person to feel “empowered” does not mean the same for the others. There are so many variables determining usability, such as product’s user friendliness, users’ satisfaction score, time needed from art generation to NFT minting etc. Should this proposal be funded, I strongly suggest the team define “empowered enough” in a more quantifiable, objective manner for auditability. \n\nThat aside, I believe there’s a clear description of problem and the solution in conjunction with the proposal. \n", "q2r": 2, "assessor": "z_assessor_2729", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6483, "q0": "There are not a lot of tools for easy onboarding into the CNFT community. As Cardano NFT's continue growing, there are users from other spaces that want to take part in the fun. This proposal is suggested to create tools for the \"non-technical\" people to be able to create their art on Cardano easily. This addresses the challenge because there are currently lots of people that would love to put their art on-chain. They just don't know how. Creating a tool like this by a team such as Jpg.Store could be very significant to the community and helping Cardano to scale. This can potentially become a global change as people from all over the world start using Cardano and having the ability to put their art on-chain. For these reasons, I give this section 5 stars.", "q0r": 5, "q1": "The team at Jpg.Store has a great history. They are currently the biggest NFT marketplace on Cardano. This also means that they have a large community that continually supports them. The proposed plan is very clear in their roadmap. It appears that the team plans on completing this proposed idea within a couple months. Having a specific timeframe is very important when calculating the likelihood of this proposal being implemented successfully. It will be beneficial for the team to keep their community updated in regards to this proposal and educate them on what utility this proposed idea can have on new creators. This will allow the community to hold the team accountable for this proposal. For these reasons. I give this section 5 out of 5 stars as I believe that it will bring long-term utility to the ecosystem and a positive outlook on the CNFT space.", "q1r": 5, "q2": "When looking at a proposal, you want it to be easily auditable. Without this, it will be hard to manage the potential success of the proposal. There is a very detailed budget breakdown that shows exactly where the potential funds will be used and how quickly it will be executed. Having a timeframe in a proposal is very important because it allows the principles of clarity and accountability. When auditing the information in this proposal, we need to look for things that can be monitored by the community. By having a roadmap, the community will be able to see what the team plans to accomplish and can help the progress until successful. There are clear delivery dates on when the team plans to have things finished and with the help of the community, it is likely that the proposal will be successful if funded. For these reasons, I give this section 5 stars.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7200, "q0": "With the advent and explosive adoption from the crypto community of Non Fungible Tokens (NFT)s on Cardano specifically in 2021, and the respected marketplaces such as jpg.store and other similar smart contract enabled web applications, the increasing number of individuals within or outside the Cardano ecosystem who want to create content of their own, tend to run into the roadblock of not having enough resources to do so. The proposal presented here is to solve this problem by allowing more people, groups, and businesses the opportunity to create new projects using Non fungible tokens with more ease and much less hassle. The proposer suggests developing an onsite tool for those users to expand into the Cardano NFT ecosystem, with minimal technical experience. This could have a significant impact on the markets, for the Cardano NFT community, investors as well as more real world adoption into the space when considering a target audience such as artists and business's for an easy entry level solution. The rationale for the Impact would be a 4 which could be a 5, based on the volume of users in the NFT space presently and to scale for future adoption.", "q0r": 4, "q1": "If you're not familiar with jpg.store, the team has been growing since launch in 2021 to allow for a more seemingly, carefree user experience in the selling and buying of (c)NFTs and has overcome many obstacles, making updates to improve the interoperability of the site while also listening to feedback throughout. Community within the Cardano space is very influential and passionate about what the future holds, and NFTs are definitely apart of it. The proposer and the team's references are not well defined within the body of this proposal, but social profiles can be found via the website provided (https://www.jpg.store/team); though a Linkedin profile for each or even past history of credentials and capablities would be better if not publicly limited. With only jpg.store as a reference, the team should be more than able to accomplish such a task which the majority is backend development & testing. The budget for the implementation of the web application is estimated to take 8 weeks according the the roadmap, which seems fair, though the allocation of funds seems significantly high. Rationale score of 3 for the lack of information provided of the team's credentials and having a less than sensible budget.", "q1r": 3, "q2": "The rationale for Auditability is given a 2 based on the information provided. Everything the proposer and their team wish to accomplish will be done internally but no specifics on milestones from the roadmap throughout the 8 week estimation will be publicly accessible. For Project Catalyst and it's voters, this type of information would be best shared with the community to ensure the tasks are being completed in the proposed timeline; perhaps with the use of GitHub or Gitbooks which some team members can be seen are familiar with via the link provided. The clear definition of success would have a working product for artists and content creators giving them the ability to build an entire NFT collection using jpg.store. There's a clear understanding that this solution will solve the problem to many looking for an easy entry point into the Cardano ecosystem, most specifically NFTs. The challenges and risks involved have not necessarily been considered by the proposer, though it should be noted that this timeline could be ambitious unless the tools are already being developed before funding.", "q2r": 2, "assessor": "z_assessor_2883", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14136, "q0": "I strongly agree that this proposal effectively addresses the challenge stated. I believe that the idea to make the creation of NFTs on JPG store a bit easier for the common person to do is fantastic. I'm sure that there are thousands of artists around the globe that would like to turn their art into an NFT, but simply do not because of the technical block. This proposal does an excellent job explaining how their team will be working together through different phases to create a new layout where non-technical artists can partake in the excitement of creating and selling their own NFTs. Being an artist myself, I am all for supporting this. With a team of five, working throughout an eight week period, I find this something that can be accomplished, and I agree that they should be funded for their purpose.", "q0r": 5, "q1": "Jpg.store is a highly-trusted and well-known platform where anyone who learns how to can upload their art into an NFT for selling and buying. I strongly agree that they have presented an excellent proposal with intelligent ideas to make the interface easier for non-technical people. This is a great idea because it will help people all over the world to be able to use their website, and will overall grow the popularity and usage of the jpg.store. I trust that the team has great experience, and if funded, will carry out what they have proposed they will do. It is exciting to me, and probably to many others, that the process of creating NFTs could become a little simpler for the more common person.", "q1r": 5, "q2": "I agree that this proposal offer's the necessary amount of information to audit the progress and success of the proposal. It includes how there will be a team of five people; four engineers, and one UX/UI designer. They also clearly state the steps of their 8-week process in creating the following steps of their proposal. The only reason I didn't give this 5 stars was that the steps of their 8-week process are very short and straight to the point. It could be helpful to add in more information on what will be taking place within those weeks. Especially during step 2 which is a four-week process. It would be nice to have more information in that section and see it broken down a bit more. Other than that, I think this proposal is really great, and I'm excited to see how it will turn out.", "q2r": 4, "assessor": "z_assessor_3915", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We want to create an application that would allow non-technical people to launch their work on Cardano easily; by providing the ability to generate art, create metadata and link to IPFS services.", "experience": "The team at JPG launched the marketplace in the second week of November 2021. Since then JPG has pushed to create a community driven marketplace servicing all NFTs on Cardano with a strong development team of 10+ engineers."}