{"id": 422273, "author": "arnecke", "title": "P2P NFT Trading and Offers Market", "url": "https://cardano.ideascale.com/a/dtd/422273-48088", "category": 26595, "amount": 25000, "description": "There are established NFT marketplaces, but there is a clear lack of P2P personal trading environments facilitating collectors to connect with each other and discover NFT trading opportunities.", "f6_no_assessments": 8, "f6_rating": 4.125, "videos": [], "media": [], "f6_assessments": [{"id": 1489, "q0": "Using an existing, trustless NFT trading platform developed by team members, this project aims to vastly increase utility by increasing discoverability. After execution of successful product design in the form of Tent, which boasts a trading history of 3 million Ada and 10,000 assets, an obstacle to wider adoption was identified. Namely that people looking for a trade had no place to find trading partners outside of Discord. The proposed solution is to design a platform where trades can be advertised and executed in a manner that provides much greater exposure to assets and individual would like to trade, or trade for. The impact on the cNFT community could be quite significant, and this proposal aligns nicely with strategic funding goals of adoption and integration. Challenge met.", "q0r": 5, "q1": "Based on the successful delivery of Tent, this project seems to be exceedingly feasible. The experience of the team only serves to bolster that observation. One possible minor concern would be that the budget indicated in the proposal is $3000 less than the sum total of the five line items it contains. It may be necessary to request a small level of funding next round, or not, but that does not significantly change the assessment which identifies this project as on with a high likelihood for success.  A seven person team on a project this size instills great confidence. ", "q1r": 5, "q2": "KPI metrics could be described in greater depth and would provide much greater insight into incremental measures of advancement. Please take this a respectful, constructive criticism as one of the roles of project assessor is to advice proposers on ways to improve the quality of proposals and their chances of gaining funding. Another helpful suggestion would be to state where constant updates will be reported and what specific metrics will be used. These criteria are essential to Project Catalyst auditability and verification proceedures, and help facilitate the disbursements of monies following successful voter approval for funding. On the whole, the project has merit and reasonably good feasibility scores, and this assessment concludes that the determining factors in funding this project should not be unduly influenced by this one section alone. The request for more detailed and defined metrics in no way disqualifies this project for consideration. Metrics are provided, ideally they would be more robust.", "q2r": 3, "assessor": "z_assessor_2252", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2119, "q0": "According to the proponent, there are established NFT marketplaces, but the lack of a P2P personal trading environment allows collectors to connect and explore NFT trading opportunities. So the solution is to provide A platform & community where collectors can post NFTs they are willing to trade, specifying ADA or other NFTs they are interested in, and allow them to connect and trade in a trustless system (Tent). The problem and solution statement presented by the proponent is clear and consistent with the spirit of the Challenge Summary", "q0r": 5, "q1": "The feasibility of the project is relative, some parts are suitable, and others can be improved. We know what will happen in great detail: in one part of the roadmap, the proponent divides the time into 6 phases, which are carried out for months and over several weeks, stating what activities will be developed in each of them. This is very active, so we have a very clear view of the process. Regarding the financial amount, we know how the total amount will be divided into large parts such as Research, Planning & Strategy, UX & UI Design, Front & Front Development Back End.... but each of them could be further explained. For example, how long will this process take, who will do it, and what are the salaries of the parties involved? And finally the project team, the strength of this proposal is the transparency provided behind the background and related skills of the proposal. We have a complete and very satisfactory description of the team that implemented the proposal, including their areas of training, time of experience, their role in the project even more than an attached affiliation, where we can know them more intimately", "q1r": 4, "q2": "\n\nANH\n\nVIỆT\n\nPHÁP\n\nVIỆT\n\nANH\n\nTRUNG (GIẢN THỂ)\nVăn bản nguồn\nIn my opinion, it will be difficult for the community to judge the progress of the project based on what is described. Proponents say they will share ongoing updates on the design and development process, possibly even including external users to test and validate ideas. However, the proposal did not provide a means by which the community could follow these updates. Besides that, I think that to make it easier to audit, it is suggested to list a few statistics that can be directly measured so that everything can be tracked more clearly.\nIn my opinion, it will be difficult for the community to judge the progress of the project based on what is described. Proponents say they will share ongoing updates on the design and development process, possibly even including external users to test and validate ideas. However, the proposal did not provide a means by which the community could follow these updates. Besides that, I think that to make it easier to audit, it is suggested to list a few statistics that can be directly measured so that everything can be tracked more clearly.", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 3131, "q0": "The author clearly solves a major issue with P2P NFT trading, by creating a platform for users to perform escrow trades. This proposal might increase adoption rate by creating a marketplace where user may browse and discover new assets. However, the proposed solution seems to be targeted at advance users in the NFT space since users would need to first own an NFT to use the platform. It would be helpful to have more information on the marketplace as it lacks those information for me to score it higher. As the main driver for adoption is the simplicity of the platform. Thus I stand neutral in this proposal effectiveness for this challenge.", "q0r": 3, "q1": "The proposers has provided their working product (Tent) and the community are using it actively. The budget and roadmap looks reasonable and achievable. With this information I believe the project will have a high success rate. However, more information on how the Close and Open testing would be helpful. Like what is the channel (Discord, Telegram, Twitter) to gather feedback from the users. Overall, this project is feasible and achievable. ", "q1r": 5, "q2": "The proposal did state the roadmap and timeline clearly and it looks achievable. However there is a lack of metric and KPI measurement makes it hard to quantify the success of the project. The author did mention that the team would be sharing constant updates of the project which is good, but as mentioned it would be great if the proposal did state which channel (Discord, Telegram, Twitter) the team would use to gather the feedback and track the progress.", "q2r": 3, "assessor": "z_assessor_2403", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 4491, "q0": "The proposer team have already created a working MVP called \"Trading Tent\" where pre-arranged P2P transactions in NFTs can take place. As this is not a smart contract driven marketplace, and intended for more bespoke and direct transfers, the \"market\" addition proposed in this project will create a User Interface where users can find trading partners and search for assets they may be interest in, which currently would have to happen outside their DApp. This undertaking is a viable and impactful match to the challenge setting brief, as it would give users more choice and a possibly valuable addition to the DApp ecosystem on Cardano. Too many market places for CNFTs may dilute liquidity, but the peer-to-peer character of the Tent and the innovations that the team want to develop to match buyers and sellers have the potential to meaningfully diversify the landscape and also possibly contribute to keeping fees of smart contract driven platforms in check.\nBy promising to increase the number of users, innovate the DApp portfolio and improve the quality of existing solutions, this proposal meets the setting very well and I strongly agree that the potential impact is high.", "q0r": 5, "q1": "The existing Trading Tent MVP works well with my Eternl wallet but is not useful if you do not have an existing trading partner. The existing UX gives me confidence that the team would be capable of executing a P2P market place functionality, and the entire team, which is mainly based in San Salvador, is presented complete with social media links, work portfolios and twitter profiles. The skills present further support the likelihood of successful implementation. A 17 week timeline is given and the milestones and design principles of the team seem reasonable and realistic. The budget could have been broken down into more detail and explained over the timeline, but are detailed enough for the scope of the project.\nIt appears that the vision for the features of a P2P marketplace are still fairly vague, based mainly on the personal preferences of the team as NFT collectors themselves. No formal market research has been carried out and no clearly defined design direction has been set yet. In my opinion, this is alright, as the timeline allows 8-10 weeks for strategy and design prior to development, so this is by design and not oversight. However, it does increase the risk for the voter and Catalyst funds, and is the reason why I \"agree\" instead of \"strongly agree\" that the proposal business plan is likely to result in a great and fully useable product.", "q1r": 4, "q2": "Although the team of proposers is very transparent about their skills and social media contacts and a clear 17 week timeline is provided, a lack of performance metrics, channels to track success like Github, project management tools, Discord or Zoom sessions are currently arranged or scheduled. It would be great if the proposers could add any of these means of communicating back to the community, so we can follow the progress of the project. This would not only help audit the responsible use of funds, but may also channel valuable user feedback from the voter community, many of whom might be NFT collectors, back to the development team, and create mutual trust between builders and community.", "q2r": 3, "assessor": "z_assessor_2554", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6048, "q0": "I consider the impact of this proposal to be low. Basically, the proposed content is to build an NFT trading environment. One place that will connect ready-to-trade collectors and buyers who can exchange live chat before trading. I still don't understand why we need to build such a market. How can we attract users from decentralized NFT marketplaces? Why do we need chat to negotiate when we can bid on a certain NFT collection we want to buy?\nThe above questions are still unanswered for me, so I hope the proposal team can clarify these details. And so, I think the impact on Cardano is low, not attracting users and increasing transaction value on-chain. I give it 3.", "q0r": 3, "q1": "I do not agree with the performance of the project. The risks and challenges when implementing the project have not been considered. Our biggest risk is competing with today's decentralized NFT marketplaces. From there, propose plans to solve this challenge.\nBudget breakdown of the project shown is very general and not specific, I don't understand why Branding Refresh/Overhaul needs $6000?. Why UX & UI Design is $10,000. There must be an explanation here of each work to be done in each of these details. I suggest that the proposed team should list it in detail so that it can accurately assess whether such funding is reasonable or not, can the project be successfully implemented without lack of funds? ", "q1r": 3, "q2": "There are quite a few metrics to measure the progress of the work done as well as measure the success of the project. What numbers will be checked on the social site to make sure the right project is well underway? Did the project's NFT market create any value after running the mainnet? What is the basis for properly assessing that? How many NFT collections will be presented on the market?\nThe above questions will be a suggestion for the proposed team to be able to add more criteria as well as numerical milestones to increase auditability. At the same time increase the persuasion as well as transparency of the project.", "q2r": 2, "assessor": "z_assessor_2771", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7679, "q0": "The proposal presents additional innovation by a team that has already successfully implemented a widely adopted innovation in the NFT sector.  They are now proposing an additional innovation that will improve the experience for NFT collectors.  In this way, the proposal meets the challenge goals of implementing innovative products that drive adoption.  Cardano is uniquely designed to serve the NFT sector and can/should be the industry leader in this arena.  Innovations like this will facilitate adoption of Cardano.", "q0r": 5, "q1": "The team wrote a thoughtful and well planned proposal to deliver on the project.  I appreciate that they left room for discovery and research, but also have a clear plan for completing the product.  They estimate 18 weeks to completion.\nTheir team seems to have the necessary skills as illustrated in their bios and supported by completion of Tent.  I think it's likely the team can execute this proposal in the timeline given.  The team identified risks of scope creep and acknowledged the need to be specific and focused on primary deliverables.  I think the proposal could have been strengthened with a short description of any technical challenges the team anticipates in this type of build.\nOverall, with the timeline proposed and funds required, I think it likely the team can deliver on this proposal.", "q1r": 5, "q2": "The team plans to give regular updates in their social media channels on the progress of the project.  The community could audit the proposal based on the. stages given in the proposal and the approximate times.\nI think the proposal could be strengthened with a place where the community could look at anytime to audit progress.  \nThe deliverables are clear for this project and can be audited by following social media reports.\nAs a community member, I would be interested in metrics monitored to give a picture of adoption of the tool (# of users, volume traded, etc).  This would give a good indication of return on investment for the Cardano community at large.", "q2r": 4, "assessor": "z_assessor_2911", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7913, "q0": "Before smart contracts were available on Cardano, NFTs were bought and sold mostly on Discord via an escrow service. Most members bought and sold NFTs but there were a few of us that traded. Trading was kind of like the bartering system. You would have to look for someone who a) is willing to trade with you b) wants the thing you are willing to offer and c) you want the thing they will offer in exchange. This “coincidence of wants” was hard to come by and while some Discord servers tried to accommodate the community by offering dedicated trading channels, it only improved the experience slightly as now members could only see what others were willing to trade. And alos you have to scroll an awful lot to find something. If you finally wanted to trade with someone you would either have to trust that person, or work via an escrow. \n\nThe proposers solution is an “upgraded” version of the https://www.tradingtent.io. This is different from the conventional CNFT marketplace. Instead this platform(in its current state) allows users to trade CNFTs in a trustless “tent”. This opens up new options to community members. They would not have to forgo their ADA. For example they one could trade 4 Season 1 Knitties NFTs and 20,000 dripdropz tokens for a Cardano Warrior. \n\nThe proposer indicates that the “missing piece” to the trading tent is the “discoverability” of trading offers. A platform where one would be able to see all those CNFTs on offer to trade, and what the trader is willing to trade them for. This can also allow for direct communication and negotiation.  People all over the world can use this platform to discover trading deals. And those that were not part of the project mints or those who like to haggle can obtain those CNFTs without using their ADA. ", "q0r": 5, "q1": "The team has provided their references and they are the team behind https://www.tradingtent.io and https://www.fort-gotten.com. The team has working projects which adds a lot of credibility to this proposal .They have a diverse team with lots of experience and their urls point to profiles and past projects. \n\nThe budget is well laid out and matches with the layout described in the “Please describe your proposed solution” section under the subheading “Implementation”. ", "q1r": 5, "q2": "The team will share contacts updates regarding the developments and will also include users to “test and validate ideas”\n\nI was very impressed with the roadmap. It was very well laid out and thorough.It not only contains tasks they want to complete but they also describe those tasks in detail. This is good to see showing that a lot of thought and effort has gone into making the reader understand what they are planning to do. \n\nBefore the solution was described the context was laid out by the proposer. The context with the solution is well divided into sections and contains more than 400 words. This was very good to see. The target problem is clearly described as there is a lack of peer-to-peer trading platforms. The solution was well laid out with adding the missing piece of discoverability which benefits all members who would like to trade.", "q2r": 5, "assessor": "z_assessor_2935", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11964, "q0": "I like the idea that swapping assets in a single multi-sig transaction - providing the an all or nothing type of deal. Moreover, having a successful NFT team behind this project proves that it is from a consistent builders that care for the ecosystem. I believe that this project effectively addresses the challenge and also reduce the risks of users from getting scammed in Discord. As we know that Discord servers are likely to have scammers that would create a duplicate account of escrow services. Since this will be a live trading between two actors, it would be very efficient and secure to trade NFTs. I do agree that the project needs more user experience research and building and I hope that it gets funded. ", "q0r": 5, "q1": "Given the experience presented, I believe it is highly likely that the proposal will be implemented successfully. With the team doxxed and have social links, backed by an NFT project that been successfully launched, I think this clarifies the professionalism and dedication of the team members. I have personally asked questions on their Discord channel about this proposal and they were quite active and fast to respond. They have also stated a detailed roadmap and all the UX factors that need to be achieved in making the website more user-friendly. I also suggest that the proposer could focus on their branding design and have a design system at hand to have consistent front-end interface. They have also claimed that there has already been trades over 3 million ADA and 10k assets, which I think its great. The budget required is reasonable, and its breakdown are clear and makes sense. Though I hope that the dApp could provide an integration with Yoroi wallet so that the team could also implement a mobile size of the website. This will improve user traffic and its usability of the dApp.", "q1r": 5, "q2": "They have social links and discord that can easily have constant feedback with users. Though, the proposer could provide key metrics to measure their progress and milestones to be achieved when funded. UX need constant user-research and also feedback, and I feel that the team are active in the Discord to provide updates or ask suggestions. Overall, as stated, it would be great if the team provide key metrics such as number of trading volume after funded/while progressing, bugs and feedbacks from users, new updated key features on the dApp. Or they could also create a tab where users could check the health of the dApp through statistics and date visualisation. That would be great!", "q2r": 4, "assessor": "z_assessor_3320", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "A platform & community where collectors can post NFTs they are willing to trade, specifying ADA or other NFTs they are interested in, allowing them to connect and trade in a trustless system (Tent).", "experience": "We are a team specializing in strategy and design for more than 10 years, we have designed countless experiences and products and successfully launched them to market. We are also the developers of Tent, which has already been used to trade over 3,000,000 ADA and +10,000 assets."}