{"id": 422218, "author": "ololuo1", "title": "Voteaire Decentralized IDs", "url": "https://cardano.ideascale.com/a/dtd/422218-48088", "category": 26595, "amount": 78880, "description": "In order for blockchain voting to be relevant to real-world use cases, there must be a way to map wallets to real-world individuals.", "f6_no_assessments": 9, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 11326, "q0": "Blockchain voting will, most likely, play a very important role in the future. There are several hurdles to overcome to get to that point in time, but it can be done, and is being worked on in several projects. One of those projects is Voteaire which is a Daap that is already up and running. This proposal looks at the current problem with blockchain voting, in that wallets, which are used for voting are not mapped to real-world individuals. \n\nThis proposal will increase the quality of the existing Voteaire platform by providing additional utility and use-cases beyond the traditional blockchain ecosystem which is firmly in alignment with the challenge it is located in. This would allow for corporations, and even governments to use the Cardano blockchain to do  voting in due time. This would increase integration of the Cardano blockchain, as well as add utility. Furthermore this proposal would expand the use case of other projects on the Cardano blockchain depending on which identity solution they use, or multitude of identity solutions that they use.\n\nThe voter is looking at whether or not this adds to the ecosystem, can be easily expanded/scaled out to bigger use cases, and would bring integration of the chain to real-world use cases. All these are covered except expandability. It is important that they proposal detail just how easily this proposal can scale or not scale to meet bigger needs in the ecosystem as use case arrive. Other then that area, This proposal effectively addresses the challenge.", "q0r": 4, "q1": "First of all, the proposer has taken the time to sit down and determine what all risks may be encountered along the way to successfully implementing this proposal, and has laid out what they can do to mitigate these risks. This is very well done in the proposal. \n\nHowever, taking look at the timeline and milestones, it is less then desirable. First there are not time frames at all in the timeline. The voter wants to see that the proposer has taken the time to figure out what workd exactly needs to be done. This is provided in the proposal. The voter also wants to have a basic idea as to how long each phase will take, and what milestones will help to show they forward movement of that phase so we can see if they project is on track to meet its timeframes. By not providing the amount of time, or the approximate day and month or quarter of completion, to the voter, there has not been enough research done by the team. It is highly recommended that any future proposal that you all submit, should list these timeframes.\n\nThe budget section of this proposal is not very good to be honest. They have listed what all needs to be budgeted, but no amounts per resource. The proposer has provided us with this:\n\nScrum Master\nProject Owner\nDesign / UX Specialist\nSmart Contract Developer\nLead Architect/Lead Developer \nBackend Developer \nFrontend Developer\nWeekly Budget: $9,860\nEstimated number of weeks: 8 weeks\n\nThis does not allow the voter to see where each dollar is going. We are given an overall amount needed per week, and the number of weeks, but there is no way for the voter to understand who or what is getting what amount for what work done. This area of the proposal needs to be improved moving forward giving us a detailed breakdown of where funds are going, to whom, and for what purpose. With the current information given, it is near impossible to determine if the budget is reasonable to achieve the goals of this proposal.\n\nThis proposer has done an excellent job in providing information on the team, their skills, their backgrounds, and their education and successes. Viewing the information on the team shows us that they should have no major issues in implementing this proposal after receiving the funding as they have the skills and knowhow to get the job done and have been involved in other projects that have had success.\n\nI can neither agree nor disagree that that given the experience and plan presented it is highly likely this proposal will be implemented successfully, but the budget section of this proposal needs work done to it and I hope, moving forward with any further proposals (as mentioned they may be needing additional funding later) that they would really focus in on the budget section and give us a detailed breakdown of where all funds will be used.", "q1r": 3, "q2": "This proposal has listed what the projects team will be using to track standard scrum metrics, however the team has provided no way for people to track the progress of the proposal after it has received funding. There is no break down of a timeline, nor are there any milestones that can be used to gage where the proposal is in it's implementation and progress.\n\nSome ideas for the proposer for future proposals would be to include a youtube channel with videos showcasing achievements along the way, a discord channel to communicate progress, a reddit, town hall meetings, or any number of other avenues to enable people to track the progress. Furthermore there should be information released when the team has researched out the various DID currently available, and who they chose to partner with or work with. \n\nThe proposal should take the timeline in the feasibility section and provide information to the public at each phase or at the end of major milestones of each phase. The voter wants to know that once funding has been received, and the proposal gets under way, that they will easily be able to track the progress of the project. As of the current state of this proposal it is not easily identifiable as to how the information provided is sufficient to audit the progress and success of this proposal. I would like to see more work put forth in future proposals as the request for funding is a very important part of project catalyst, and the cardano ecosystem. We want to fund projects, but those projects need to detail out everything for the voter to make an informed decision as to whether or not to vote to fund the proposal. Lacking detailed information in a proposal is not beneficial to the proposer, nor to the voter who is trying to determine if this proposal will be easy to track progress, be implemented successfully and bring value, products, and integration to the Cardano ecosystem.", "q2r": 3, "assessor": "z_assessor_3237", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 568, "q0": "The proposals problem statement has identified a current need to map real identities to wallets for blockchain based voting systems. Their proposed solution to research and integrate Atala Prism and/or IAMX into the Voteaire platform would allow multiple organizations to easily integrate blockchain voting systems on Cardano. This is directly aligned with the challenge to bring impactful use cases to Cardano ecosystem that help drive more adoption. Many people are now aware of the benefits of blockchain voting, however they lack a simple, low cost, and fast way to set up a voting system on the blockchain. By leveraging already completed work by Atala / IAMX and Voteaire, this proposal can offer a simple solution to many new users. The following metrics from the proposal are clearly aligned with onboarding new users: \n\"Number of end users (voters) using the application\nTotal number of DIDs connected to the application\nTotal number of ballots created using the new functionality\"\nThis proposal has the potential to scale to multiple voting use cases, however I have given 4/5 stars for impact because the overall impact will likely be on smaller projects such as NFT communities or schools/organizations and others who's voting results are important, but likely not as critical as a nation state election. As security and auditability are critical for these larger projects with billions of dollars or lives at stake, it is likely that more experienced and larger teams will be required and they would most likely work directly with the Atala Prism team, as opposed to using the Voteaire software. There are also other potential options that could fill this use case, therefore it's not clear how much market share or use the Voteaire system will be able to secure as they have not included a marketing plan for this proposal. ", "q0r": 4, "q1": "The proposing team has included examples of their past work on Canucks Publishing, a professional NFT minting service, and Votaire.io. They have included LinkedIn profiles and background information that includes their extensive experience and qualifications. The team has been a part of the Cardano community and development since 2017, and has proven their ability to deliver functioning on chain voting software. It is highly likely that this team has the skills to deliver on this proposal. The Budget is reasonable and broken down into a weekly budget of $9,860 for the team of seven professional developers who are already involved. There is a detailed plan that includes 4 major major milestones with subtasks. The proposal does not include details of how the DID credentials will be verified as real individuals, prevent voters from creating multiple profiles, or other attack vectors. However, one would assume these issues will be resolved by Atala Prism/IAMX, and are of less concern for implementing the DIDS into Voteaire, and therefore not the direct responsibility of the proposing team.  The proposal includes potential risks to the project and outlines risk mitigation strategies for each anticipated risk. ", "q1r": 5, "q2": "The proposal includes a roadmap with milestones and an estimated completion time of 8 weeks. They have not linked specific sub-tasks to time or budget estimates, but this may not be required for a project that is only 8 weeks in duration. The KPIs provided can be used to track and audit the success of this project. Unfortunately they have not included a plan to submit any progress reports to the Catalyst community, or information on how the Catalyst/Cardano community can observe or audit the development progress. There is no mention of Github or open source, so it's not clear if this will be accessible to the community during development. I would recommend the team provide at least 1 or 2 progress reports during the development phase to the Catalyst community that includes the KPI's in the proposal and % competed. Once the project is completed successfully it should be easy for Catalyst auditors to track the following KPIs:\nNumber of end users (voters) using the application,\nTotal number of DIDs connected to the application,\nTotal number of ballots created using the new functionality.\nHowever, the team has not provided specific detail for how these metrics will be shared. ", "q2r": 3, "assessor": "z_assessor_2108", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1961, "q0": "Voting backed by blockchains has been a hot topic within the blockchain community almost all through its existence. The proposing team intends to explore different DID solutions to implement a solution that would allow for a fair and transparent voting process down the line. The Cardano ecospace could gather some great traction if it were to be a leader within DID voting, therefore it should be a high priority to explore projects and solutions related to this within Cardano. The proposal aligns great with the challenge setting and the authors even acknowledge this in their proposal. The score in terms of impact will be great as a result, 5 points.", "q0r": 5, "q1": "The proposing team has developed with successful results within the Cardano ecospace for a while. They are seasoned and have credible proof that they have the right set of tools to implement their proposed project. The feasibility is high in terms of these aspects.\nAn improvement could be done by further breaking down the budget to provide hourly wages for each position in order to back up the claimed budget further. The team consists of multiple members which makes this a rather cumbersome task, the team will get an exemption in terms of scope because of this. There are some risks that the proposers have listed, by identifying potential issues early they are well aware of where they should spend additional time in order for the project to succeed. The feasibility of the project is great overall and the score will reflect just that. 5 points. ", "q1r": 5, "q2": "The proposers have provided a detailed plan along with milestones within each phase. Furthermore, they have included a set of relevant and good KPIs that makes it easy for the community to audit the progress. A suggestion is to add estimated goals to each KIP in order to make the evaluation easier. Another suggestion is to explicitly list where the progress updates will be provided and in what format this will be done. Will you write progress reports from the scrum metrics during development or just provide the raw data?\nOverall, the proposal is auditable but could be further refined, the total score will be good in terms of auditability, 4 points.", "q2r": 4, "assessor": "z_assessor_2290", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3335, "q0": "This proposal presents a very interesting concept that’s been talked about a lot in the blockchain space, which is blockchain voting. They want to utilize existing DID solutions such as Atala PRISM and IAMX and potentially integrate them into their platform Voteaire. They have a strong experienced team behind them but the main concern is that it seems they haven’t fully completed their initial reseach to be able to provide a full action plan. Due to this, there is a lack of clear metrics and goals in their solution procedure, leaving us unsure about how the actual project will proceed. Atala PRISM and IAMX both provide services that certainly can be useful for this project, and have been part of several other proposals in other funds. Personally \nI would recommend knowing more about what DID solution will be attempted before looking for funding for the entire project. Having experience with teams trying to integrate DID solutions it can be a very complicated process and it would therefore be a much stronger proposal if the details on how this process would look like could be provided in the description since this is a very technical topic. That said, this proposal targets the challenge objectives well and could very well turn out to be a successful project that provides a lot of value to the Cardano ecosystem.\n", "q0r": 3, "q1": "The overall plan has a reasonable structure with clear major milestones and is easy to understand. However as previously mentioned, due to the lack of specific approach and technical detail there is a shortage of milestone components and a description of what resources are necessary for success. To strengthen this proposal, I would recommend a more detailed breakdown of the plan that includes a timeline, as well as relevant technical architecture and technologies required for implementation. Since the research, architecture, and integration plan isn’t complete yet, it can also be hard to justify the presented budget since there is no complete breakdown of what money goes to what department, hourly rate etc. The team behind looks professional and have evidence of their skills and experience presented in the team section, on this front there are no issues. Overall, the plan covers the major milestones well and the team is capable which is why I believe in the project, but due to the lack of detail and initial direction I would like to see a new proposal with some added details in the next fund.", "q1r": 3, "q2": "Auditability wise, the proposal presents a variety of good KPI’s that can measure and track the success of the platform. While these are great for auditing the success and usefulness of the platform, I would also say there is a lack of auditability in terms of the development leading up to the completion of the project, are there any KPI’s and measurements we can set for the initial planning and integrations, if so how do those look like etc. A great way of increasing auditability is also to add public channels where users can either follow updates or interact with the project development. I believe this project idea has good potential and the team seem knowledgable in how to present a reasonable plan and relevant KPI’s, it is just a very early stage to ask for funding for the complete procedure when there aren’t enough details to be put forward to help us understand exactly how this project would be carried out.", "q2r": 3, "assessor": "z_assessor_2448", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6764, "q0": "The problem defined in this proposal is that blockchain voting isn’t relevant in the real world unless there is a way to map wallets to real people.  They explain the solution to this is to integrate a Decentralized Identity solution into their on-chain voting platform, Voteaire.  I believe this aligns with the challenge well, as it seeks to integrate one of the already existing DID projects known as IAMX or Atala PRISM into their already existing voting platform.  The proposal does a good job at explaining how this integration will allow for additional use cases of their voting platform, perhaps for more corporate and government applications.\n\nI believe the KPIs provided, like number of end users of the application and total number of DIDs connected to application, align well with the KPIs of the challenge because they are good indicators to track if this integration was successful in bringing more users to their platform.", "q0r": 5, "q1": "The proposal provides a good amount of information that indicates the team has relevant experience by having built an NFT publishing platform and an on-chain voting platform for Cardano.  There are also linkedin links provided for each team member which is great for transparency. \n\nI really like the section of the proposal where the team acknowledges 3 different risks that could prevent them from being successful, and then provides multiple risk mitigation strategies for each risk.  This shows that the team has put a good amount of thought into what it would take to implement this proposal successfully, and have plans in place to stay on track.\n\nThe plan provided in this proposal does well in describing the steps the team plans to take and certain milestones they plan to reach, but it doesn’t provide any time estimates for each step or milestone.  In the budget breakdown section, they show that the total estimated time is 8 weeks. However, I think showing how that 8 weeks is estimated to be broken up on their timeline would’ve been useful to know when to expect certain milestones to be reached.  It also would help the community know if the proposal is on track or not when tracking its progress.\n\nThe budget breakdown provides a decent explanation for how they calculated the amount for the requested funds, but I would have liked if more details were provided about the calculations.  Currently it states that the allocated funds were approximated using average hourly rates and the amount of time that is expected to be spent on their project by each role on their team.  I think it would have been helpful to show us these time estimations and hourly rates to help determine if the amount of funds requested seems reasonable.  That being said, $9,860 per week split among what appears to be 7 different people over 8 weeks doesn’t seem unreasonable if each member is working full time on this project, but it would help knowing how many hours each team member is expected to work each week.\n\nIt’s important to note that members of this team are working on proposals from previous funds as well as seeking funding for some other proposals in fund9.  However, the team is fairly large and has stated that they hire additional contractors when needed, so I believe they can handle working on multiple proposals at once.\n\nI believe this proposal does well in showcasing preparedness and that they are likely to implement this proposal successfully.  The only things missing for me are time estimations in the project’s timeline and a more detailed budget breakdown.", "q1r": 4, "q2": "Even though there are no time estimations for when to expect certain milestones to be reached, the proposal does still provide some milestones to look out for when tracking development progress.  The problem is there is no public channel provided for where to expect updates on development.  There also is no statement about whether the team plans to provide updates during development.  I believe a simple solution to this is providing a twitter account or discord that the community can watch for updates on this project.  This would greatly help the community be able to track progress of this proposal.\n\nOne thing this proposal defines very clearly and sufficiently are the KPIs and metrics they plan to track.  A scrum metric is a new term to me, but they seem like useful metrics to track during the development process. \n\nI believe the team has shown they have clear ways of tracking progress for this proposal during development and post development, but I do not believe sufficient information has been provided for the community to track the progress alongside them.  Therefore, my score remains neutral as I believe these two things sort of cancel each other out.", "q2r": 3, "assessor": "z_assessor_2826", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7676, "q0": "The team is proposing to address the challenge by improving on an innovation the team has already created.  This improvement would have a positive impact on the Cardano ecosystem as we are headed toward changes in governance structures.  Multiple types of governance and voting is an essential part of creating decentralized solutions for Cardano.  Advancing the ability to use Cardano for voting, especially with DID integration is an important step.  Many projects are working on these solutions which will certainly result in a positive impact on the community as a whole.\nI appreciate the impact this team has already had on our ecosystem.", "q0r": 4, "q1": "It seems very likely to me that this team can complete this proposal as presented.  The team has already built widely adopted technology and has shown a commitment to building on Cardano.  The team proposes a scrum structure for project completion and given a budget per week. Total time for the project estimated at 8 weeks.  I would have appreciated a more granular budget estimate, though the amount requested appears to be within industry standards for the number of people involved.  The team acknowledges they may return in future funds to further improve this project.\nOverall, I believe it likely this team can complete the proposal as described based on the bios of the team, past success in building on Cardano and shown commitment to the success of the Cardano ecosystem.\n", "q1r": 5, "q2": "The deliverables for this proposal are clear in delivering a voting system with DID integration.\nThe team plans to report progress with \"standard scrum metrics\"  and will also track KPIs upon launch of the product in users, DIDs connected and ballots created to give indication of the impact of this proposal.\nThis team is well known in Cardano and would likely be responsive to requests for information from the community.  This would make it relatively easy to audit the progress of the proposal should it be funded.", "q2r": 4, "assessor": "z_assessor_2911", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9076, "q0": "The goal of this proposal is to add a decentralized ID to the Voteaire  system. This fits within the goals of this challenge well. The purpose of this challenge is to further creative uses of decentralized applications on cardano. In addition to furthering this goal, this proposal would also further the goals of this fund by creating more people using wallets and making transactions on the network. By adding a DID system  to the voting platform, the platform will be expanded and its usefulness would be increased. More transactions would be had on the network. More people could use this in more use cases. The team has done a good job of explaining the impact on this Challenge and shown that this proposal earned a score of 5.\n", "q0r": 5, "q1": " This proposal is reasonably feasible. The team is definitely experienced and has the skill set necessary to pull this off. They have some Milestones involving initial planning the development of the application and the front-end web development of the user interface. However these could be more detailed. There could be specific milestones within each area. Or a time frame in terms of how long they're planning on taking. As for the budget it is also sufficient in terms of how many positions and what positions they will need. They plan on taking 8 weeks and they have a weekly budget. Would have been better to show though how many hours of work they're planning on accomplishing and what the hourly rate is for each position they are planning on hiring. However given the information here it is reasonable to assume that this team is aware of what is needed and will be able to pull this off without issue. This is why I'm giving us a score for it is reasonable to assume that this team is aware of what is needed and will be able to pull this off without issue. This is why I'm giving this a score of 4 for feasibility.\n", "q1r": 4, "q2": "The team does plan to measure their progress and development. They are using a scrum metric approach. This approach appears to be feasible and clear. The goals of this proposal are clear: they are planning on investigating and implementing a DID  system into their voting application. How they plan on going about it is also clear. There is not any mention in The Proposal of how they plan on allowing the community to be aware of their progress. However I assume they're planning on using an open coding system. And I believe that they will make regular reports to the Catalyst community as requested. They also plan to measure how their system is functioning. They plan to measure users (voters) using the application, they plan to number how many DIDs are connected.  Overall I believe that these metrics are sound and this proposal is solid. There could have been more detail regarding exactly how they plan to report out to the community, but given what is here I believe this is auditible and has earned a score of 4.\n", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9546, "q0": "For lack of clearly identifiable uniqueness, I rank this section a 3. While there’s clearly identifiable reputability behind this project, the impacts section here doesn’t have enough substance to provide voters with a clear understanding of what competitive features are being brought to the table (appeal to innovation) and how this proposal links to its impacts. This section points out that it aims to increase the number of Dapps, increase the number of integrations, and improve the quality of existing Dapps/integrations but it doesn’t rationalize how this would accomplish that. There is also a reference to “Voteaire” as a platform that could be improved as a result of this proposal but it doesn’t explain how it would do that. One could draw that connection by doing more research on voteaire but I think it would be much more advantageous for proposers to do the additional work of explaining this platform and identifying the link to different increased capabilities. ", "q0r": 3, "q1": "For clearly demonstrative capability and a understandable roadmap outlook, I rank this section a 4. The biggest issue that this section of the proposal struggles with is the budget breakdown that doesn’t exactly leave voters with the right type of breakdown that they can evaluate spending efficiency on. I think if this section contained hourly rates, hours of labor needed, and total budget allocated for each role, I would be more likely to rank this section a 5. The rest of this section is done well enough to make something (that is likely rather complex) seem simple and reasonable to accomplish, especially with this team. The core team has top tier experience in both their respective fields and in Cardano, so there’s no concerns about the team’s capability to carryout this proposal to completion. ", "q1r": 4, "q2": "For laying out a understandable starting framework for relevant KPIs, I rank this section a 4. From a voters perspective, there isn’t a lot of substance here to thoroughly evaluate the teams definition of success. While it does point out all of the right categories for KPIs, it does not take that extra step to further define these metrics with quantifiable targets. This would help voters understand that the proposers have a very specific definition of success and is committed to an objective level of performance/impact. I vote positively because I have everything I need to determine that the team’s attention is in the right place but I think this proposal could secure more confident positive reaction from voters with that additional quantification. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12782, "q0": "The proposal aims to create a connection between wallets and the real world individual to make real world voting a viable option. Real world voting on blockchains could be a big usecase which could possibly be adopted by every government and other institution which is dependent on the opinion of their stakeholders. \nIn addition to this could create easier ways to vote for currently unstable/ undeveloped nations because the whole organization isn´t dependent on voting offices who use much resources but just on digital infrastructure. Maybe this is currently not that easy to implement in undeveloped countries because of the technological standards, but it could be a viable option in the future the create a fairer world and gives everyone a voice in the politics. And thus matches some sustainability goals. \nIn conclusion the proposal matches the challenge strongly. ", "q0r": 5, "q1": "The team has provided their LinkedIn profiles and some additional information. All in all the team looks very competent. Their CTO and CEO have both much experience in relevant fields. The rest of the looks competent too. Also they have already developed their current voting system “Voteaire”. It´s a voting application for Cardano where current users can ask the opinion from their community. So they are currently correctly positioned in the market and have experience overall. \nThe budget was described shortly. The team has just told which workers they need, an than the overall pay. The weekly budget is 9860 for 8 weeks. It would be great to know how much money you allocated to what field. \nThey will come back to catalyst to get additional funding to develop the application “Voteaire”. This project is a standalone which develops the feature to map real world individuals on the wallet. The additional funding is for other enhancements. \nThe timeline is unclear. The phases and the task are listed but I miss the timing. It would be great to see how much time you allocate to the different phases. Please provide this info next time. \nAll in all the team looks competent and the current application is usable but there is some additional information missing which makes the project a bit untransparent. Therefore I remove 1 star from the feasibility. ", "q1r": 4, "q2": "The KPIs and metrics are devided into scrum metrics and completed application. The scum metrics are useflul to improve the team internally and the KPIs from the completed application measure the success of the new enhancement numerically. Therefore they are easy to measure. \nThe target problem was clearly described and the solution solves it. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "We plan to research existing DID solutions such as Atala PRISM and IAMX, and integrate one or more of them into Voteaire to allow ballots which are limited to authenticated individuals.", "experience": "We have been building on Cardano since the dawn of the Shelly Era.\nWe have an Enterprise software development background, we're stake pool operators, and are the creators of https://canucks-publishing.com/ and https://voteaire.io"}