{"id": 422283, "author": "ranket", "title": "Japanese Traditional Crafts NFT", "url": "https://cardano.ideascale.com/a/dtd/422283-48088", "category": 26595, "amount": 51000, "description": "The intrinsic values of NFT were questioned due to the absence of the supporting value . On the other hands, Japanese traditional craft face to crisis of survaival due to decrease of the Craftsman.", "f6_no_assessments": 10, "f6_rating": 4.300000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 218, "q0": "This proposal is in line with the purpose of the category, as it seeks to revitalize the traditional Japanese paper and kimono industries and to support the craftspeople involved in these industries by establishing a market for the trading of art NFTs.\n\nThe issue of art NFTs corresponding to the crafts and the possibility of exchanging them for actual products is an interesting mechanism to address the issues of how to protect and revitalize traditional industries and how to foster the development of future generations. \nIf this initiative takes off and expands further, it will lead to a virtuous cycle that will strengthen the ties between CARDANO and traditional industries and increase their influence on each other.\n\nHowever, I have the impression that the artisans who form the basis of this plan are aging and have little understanding of technologies such as blockchain and NFT. \nI understand that the on-catalyst funds will be used to support the immediate operations and purchases, but I would like to know what kind of organization you intend to establish after that for sustainable operations, or whether the artisans will be able to understand each other better and operate independently. \nWe feel that this proposal would be more understanding.", "q0r": 5, "q1": "The Kittamu Project is a project centered on a tourism promotion team that is closely involved with the local government, but the website introducing the team and its activities is still incomplete, leaving the impression that the team's achievements and what role it will play in this project are somewhat unclear.\n\nThere is also a lack of information on how the team will promote the project to increase the number of craftspeople who support the project and the number of crafts handled.\nThe storage cost of the crafts and the purchase cost of NFT seem reasonable, but I feel that a more detailed explanation of the necessity and details of the administrative and PR costs ($1,000 x 6 months) is required.\n\nIn particular, the PR is to be conducted for the CARDANO community, but we would like to know what kind of media and method will be used with that community, and if this proposal is aimed at revitalizing traditional crafts, we would like to know what kind of media will be used with the CARDANO community and how it will be used. \nIf this proposal is aimed at revitalizing traditional crafts, it would be more effective to promote it not only to the CARDANO community, but also to the communities of other chains, mass media, etc., which would help improve the NFT brand image in CARDANO.\n\nIn any case, we believe that our proposal is feasible within the current budget, but it would be more persuasive if you could present some ideas for a sustainable direction for the project after the six-month period is completed.", "q1r": 3, "q2": "We believe that it is relatively easy to achieve the number of NFTs generated for each period, since the content of the project is simple: generating NFTs and purchasing NFTs.\nFor example, in the area of PR, we set the number of advertisements per day or week on various social networking services, the number of NFT sales increase, and the number of new demand and sales channel expansion through NFT purchase support and questionnaire surveys. \n\nIn addition, the company may also provide NFT purchase support and conduct surveys to uncover new demand and expand sales channels. In addition, the expansion of sales channels could include setting goals such as increasing the number of craftspeople and the number of crafts handled.\n\nAlthough this proposal overlaps with the evaluation in the other section, I believe that the essence of this proposal is not only to support the revival of traditional crafts on this occasion, but also to take a long-term perspective on the revival of traditional crafts and realize it through a fusion of old and new solutions in the form of the NFT market. \nTo this end, we feel that the proposal would be more attractive if it includes the establishment of an organizational structure for sustainable independent management as a goal setting.", "q2r": 4, "assessor": "z_assessor_2061", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "For Feasibility part. I would like to emphisize that \"the KIttamu\" and RANKET2 work as a system system manager of the crafts and help for the NFT minting. The crafts itself will be produced or already produced by Awagami-Factory for \"Washi\" and Inagaki Factory for \"kyonui\".  They already have some apeal method for themselves.  The important things for our project is that the some traditional crafts partners certificated by Japanese Government  agree with our project. In japan usually, the crypto currencies are considered as only scam like tools. However, the Kittamu project and RANKET2 activity get the trustness of our Cardano project. And this is also important that the Cardano NFT can be distingushed from other miner chains. The traditional crafts NFT should be on the long lifed chain. So We want to ask to aepal long lifed chain characters of Cardano for the Crafts partners. The 1000 $ / month include such kind of the ngociation and sometimes it also use for the NFT mint help fee. Apparently to these traditonal crafts activity, we also appeal to Jpg store to make Crafts market. We also ask to our activity for Japanese PR compony or group. They are also related to widely NFT community and Crypt currencies. We already start some co-working with them, but it not related to our Crafts Project directly. However, after funded our project we will promote PR of our NFT project. Finally, we want to demonstrate the future plans after 6month. We are goint to appeal this system for other crafts componies who are not understand the Crypto , NFT and/or Cardano. Probably the Cardano NFT appeal by the profession from same field will work as effective method. We will scale up Crafts NFT market. Then craft NFT market work as a new way to sell their product and it wll be quite fascinable news for ordinaly media. If such kind of new market development will bu succeeded, we will develop automated storage system based on block chain technology to make standard for our market. Then the futures our benefit will be obtained by the storage management fee and market management fee from Crafts Componies. Thank you for your review."}, {"id": 4124, "q0": "Overall, I'm unsure of the merits in linking Japanese crafts to the intrinsic value that was missing in NFTs.  Likewise, I'm unsure that NFTs have the value to save/revive the Japanese crafts industry or re-inspire the declining Craftsman population.  As the proposal text clarifies the author's dream that NFTs might \"save tradtional culture\" I remain neutral in terms of impact due to two conflicting realities:\n\n1) Recognition that this is a unique field which could offer value and onboarding of new users to the community\n\nvs.\n\n2) The understanding that the value of those new users is the expectation that this transition will save their art forms. \n\nI believe the greatest impact from this proposal will be the team's ability to onboard very high profile works, or publicly desirable works that will build demand from the buyer side.  The ability to gain government/master certification will contribute to that goal, however the complexity in doing so and delivering the impact is the most questionable factor that keeps me neutral in my review of the team's impact capability", "q0r": 3, "q1": "The concept of pre-purchasing artwork to stimulate this emerging opportunity among artists is good.  Although, in the future it could be a more efficient use of capital to provide some advance, and then reimburse yourself if/when the art sells, rather than essentially speculating on the price in advance of open market trading - potentially producing losses which could threaten scalability of the model at an early stage.\n\nThe team has a demonstrated commitment to the Cardano community, and presents a timeline and budget which is reasonably thoughtful when considering the distribution of work required to set up and stimulate this market.\n\nI would have liked to see more details about the team to evaluate feasibility on this.  Some of the members are listed only by pseudonym rather than real name, and  others have limited information presented about their identities and experience.", "q1r": 4, "q2": "The general metrics for success and KPIs for auditability are presented in a way that may facilitate auditors to track success in the case that this proposal generates success in gaining traction with art sales.\n\nThe difficulty in auditing could arise in the case where the projects PR efforts to not deliver on an anticipated early volumes, since the proposers themself would essentially be stuck sitting on unsold art and no blockchain activity that would be visible to an outside observer.\n\nOverall, I believe the proposer demonstrates a firm grasp of the community expectations in Catalyst and offers a way to add value within that framework.", "q2r": 4, "assessor": "z_assessor_2517", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you for detailed review.\nFor Impact, your review is reasonale. However, please understand for two points. The one of most imporatant our aim is \"to save Japanese traditional NFT\". A part of co-operators of our proposals are already certificated by government. Our goal is not to get government certification but the refognization of CNFT market importance by government certificated craft misters. When our aim will be achived, probably the mass-media report will be performed. And We will promote that. Already, a part of members start co-working of Cardano PR japan with famous media. \n\n"}, {"id": 4640, "q0": "This is a good proposal, helping to maintain and develop long-established traditional Japanese professions such as Kyo-Nui and Washi arts through creating and selling NFTs in the Cardano ecosystem. This proposal, if successful, will help many artisans in Japan earn income and more people will know about Cardano, boosting the demand for dApps in the Cardano ecosystem. The proposal has a significant impact on the Cardano ecosystem.", "q0r": 5, "q1": "The plan was written easy to understand, the timeline is clear, and the KPIs are reasonable.\nThe plan is 6 months, and includes actual craft purchases and NFT minting, NFT ads attracting the Cardano community to buy. KPI reaching 100 NFT is not too high and suitable in the early stage of testing manual NFT market operation.\n The proposal outlines how to implement and convert from actual products to NFT. In particular, in addition to ensuring the characteristics of NFT, handmade products are also certified by the government, ensuring the actual product quality. This is a pretty nice differentiator of this proposal.\nRegarding the budget, the cost items are listed quite specifically and have a calculation formula attached. The budget is easy to understand, and clear.\nAbout the project development team, including reputable experts in the Japanese community and especially, there is cooperation with the Awa-gami factory, which is a fairly large and long-standing factory, famous in the manufacturing industry. Export of Washi paper. In addition, cooperation with Kyo-Nui craftsmen and other arts and crafts diversify resources and create a richer community of craftsmen. The proposal includes the relevant link of the partner, however, if it is possible to write more about the size of the factory, the community size in the proposal will increase the persuasion even more.", "q1r": 5, "q2": "The proposal states that KPIs with specific numbers are in the testing phase, selling over 100 NFTs and attracting more than 10 traditional workers to join. The goal may not sound like much, but it shows caution in testing implementation. Hopefully, in the next stages of development of the project, it will attract more cooperation from other craft industries and support to expand to more countries.", "q2r": 4, "assessor": "z_assessor_2578", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6049, "q0": "Traditional handicrafts have long been a feature of Japanese national culture. Famous works include the Japanese original patch work \"Kyo-nui\", the Japanese original crafting paper \"Wa-Shi\". However, traditional crafts are facing the danger of survival in Japan because the average age of skilled craftsman is around 50- 60 years old or older, and the group of new people who want to enter the skilled class is quite small, so it is the proposal to propose an idea that is to build an NFT market supported by the value of handicraft items. NFT sales will be used to buy back handicraft items and when NFT holders have a need to convert to real products, they can easily do that and their NFT will be burned. This idea would further encourage handicraftsmen to preserve the unique culture of Japan, and at the same time create more opportunities for young people to enter the craft. On the user side, investors will realize the value of NFTs backed by real-life valuable products, making the prices of NFTs impervious to the price of cryptocurrencies. That will attract more users to this product. Make the NFT exchange active on the network, increasing the number of transactions as well as the transaction volume on the Cardano network. So this is an idea that I think makes a lot of sense, a very necessary idea in the Cardano ecosystem.", "q0r": 5, "q1": "I completely agree with the feasibility of the project. Initially, the cost of the Catalyst fund will be used to buy some works from the craftsmen. This cost is detailed in the budget breakdown, 200 $/NFT for Awagami and $400/NFT for Kyo-nui are reasonable but I would like to know more details for what the management fee and PR fee include, can you add details for these two fees? I think this is necessary. In terms of team member experience, I still don't know if we already have a member in charge of project marketing and who is in charge of minting the NFT, can you be specific about their relevant experience?", "q1r": 5, "q2": "We have a specific number of NFT sales after the project is operational. We have a (expected) number of new people entering the handicraft industry. Also, I mean want to add more about the measurement criteria, which is the number of transactions on the network that this project brings, the cumulative transaction volume (the first 3 months).", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 9366, "q0": "Currently, NFT is helping the art to improve transparency and traceability through Blockchain technology. While the future of NFT art is still up for debate, the traditional art world has taken notice and is beginning to adapt. Thus establishing a value-supported NFT market with the Traditional Japanese Craftsmen Group that will develop as a standard for the future NFT art form and a way to preserve the art tradition. This is really necessary. I think maybe people don't understand the importance now and haven't received it strongly, but first of all with the Catalyst community I think I will strongly support you.", "q0r": 5, "q1": "Regarding your work plan, I see that you have divided it into specific timelines. However, the budget analysis is still sketchy, there is no total amount. Members of the group have very little information, general information. I see no experience related to blockchain nor traditional craft. You should provide more complete information.", "q1r": 3, "q2": "After reading your suggestions, I see you did not indicate how you would provide progress updates if funded. You can update your work progress in many different ways, for example, you can use google sheets or update videos on YouTube, a website with a traditional craft product demonstration, a weekly project presentation. Catalyst... Regarding the success of the project, you also did not give specific goals, there are numbers for example I think should give the number of handmade items that are minted NFT...", "q2r": 3, "assessor": "z_assessor_3046", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 10279, "q0": "I agree with you that traditional crafts are being lost and this situation is happening not only in Japan but also in many other Southeast Asian countries. To support and maintain the traditional craft, it is extremly important that we need to protect the copyright and find the output for the product in the most appropriate form, the solution is based on the new supported NFT, the craft product holder being the final holder of NFT is a very good proposition, it is within the challenge in Fund9 which is to mining and popularizing NFT in the Cardano community. NFT has been used a lot with photography, music… however, with this proposal, the Group has applied it to handicraft products, an item that always has a place in the market, I think it is The positive points you have brought to the Cardano ecosystem, although the value brought is not too great.\nThe KPIs provided in the proposal fairly match the ones indicated in the challenge, each month you set a mint goal and sell appropriate number of NFTs. Working with the authorities to get the certification of the crafts by authority is crucial to ensure the success of the proposal.", "q0r": 4, "q1": "Unfortunately, information about each member of the team is given too little and not enough to assess the capacity and experience of implementing the proposal. You need to provide information on the LinkedIn platform that shows proof of ability and experience. I think you need to have in your group some Blockchain experts to make the project more convincing. The budget oulined has been properly divided for the work items implemented in 6 months, mainly including minting NFT and crafts sell support different kind of products. I think your detailed plan is acceptable, even though you have not shown a PR method to offer to NFT communities.", "q1r": 4, "q2": "The proposal has included a roadmap with expected results in each stage of implementation, I think your plan in 6 months is very feasible and successful. The result is the number of traditional craftsman joining this platform and using ADA as digital currency to trade. The expected results are not too big but it is highly realistic, the number of successes in the sell of the NFT based on Japanese traditional crafts can exceed 100 because Cardano Blockchain is very popular in Japan. I think your proposal will become more perfect when all information in the implementation process is published under a specific website in addition to social networks. Although this is a new proposal, I support and wish you all the best.", "q2r": 4, "assessor": "z_assessor_3170", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11363, "q0": "The proposal represents the idea of ​​establishing a value-backed NFT market with the Traditional Japanese Craftsmen Group.\nHowever, the proposal to develop only one piece of traditional art in Japan is too limited to scale up. Instead, it is proposed to develop a platform where all those in need can. demand for art pieces such as pictures of artists who want to be identified, or some nft of other art forms.\nWhat is the specific output of the project? I find that everything is still general and a bit confusing for most people. and how does your proposal affect the cadano ecosystem if the holder uses NFT without holding ADA.\nThe proposal that presented the main risk was the sale of NFT, but the solution was to promote the Cardano Community. Mainly for the Japanese Cardano Community (2000-4000 members) is it too restrictive because not everyone out of the 2000-4000 thousand has the need to hold a traditional NFT.\nI think the proponent needs to expand it to the international community for the project to develop strongly and sustainably.", "q0r": 5, "q1": "progress and milestones for making the proponent's proposal are: will mint the NFT based on \"Kyo-nui Art\" or \"Awa-Washi Handicraft\".\nTo incentivize Traditional Crafts players the proponent will purchase the suggested crafts. And mint NFTs based on these. Then will request to put these NFTs on the Cardano NFT marketplace like Jpg Store or Fibo\nThe solution proposed by the proponent is to promote his NFT to the Cardano community mainly in Japan. We also do PR giving to NFT communities like \"NFT is community\".\nOnce the NFT is sold and we receive the ADA, we keep the original Crafts with high security and we buy the NEXT traditional crafts for more NFTs.\nIn my opinion, the solution to sell NFT is not really convincing, if only selling in the community of people who are passionate about traditional crafts in Japan, it is quite risky because it may be difficult to liquidate. out of the large number of NFTs generated.\n\nThe crux of the project is the government-certified craftsman's certification. Blockchain technology prevents DATA or NFT from being tricked or hacked.\nThe project owner needs to come up with a way to get the NFT certified by the government for the craftsman, as blockchain is still in its infancy at the moment it is still difficult to get the government approval.\nThe proposal to split the budget to realize the objectives of the proposal is quite reasonable.\nThe project participants have experience in the field that is not really transparent, I need more pictures, profiles, links, social networks of project members.\n", "q1r": 4, "q2": "The proposed metrics are still general and not really specific, obviously, I need specific numbers for each performance item.\nThe output of the project is not really clear.\nThe proposal should clearly state who will benefit after the project is successful.\nWhat will NFT holders benefit, whether the project will issue tokens or not.\nSustainable Development Goals (SDGs)\nEnd poverty in all its forms everywhere\nEnsure inclusive and equitable quality of education and promote lifelong learning opportunities for all\nAchieving gender equality and empowering all women and girls\nPromote sustained, inclusive and sustainable economic growth, full and productive employment and decent work for all\nReducing inequality within and between countries\nMake cities and human settlements inclusive, safe, resilient and sustainable\nEnsuring sustainable production and consumption models\nSustainable development goals are quite specific and create conditions for the development of the cadano ecosystem\nHowever, KPIs need to be more specific in terms of data\nI agree with the sustainable development goal of the proposal.", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 12507, "q0": "In the Problem Statement, the proponent provided a precise and specific problem. Conservation of culture and fine arts is an issue that needs to be solved, this is something that every country cares about. The proposal to bring a good impact to the Cardano ecosystem because of the cultural value of Japanese handicrafts, unique culture in Asia, will attract a large amount of attention, from which The community can accept new members. The expansion potential of the project is absolutely there because the theme of Japan's age-old culture takes a lot of effort to exploit, it's like a priceless treasure.", "q0r": 4, "q1": "Proposers provide the skills and experience required to implement the proposal because they have worked on related projects. Furthermore, the proponent also provided evidence to confirm the experiences they mentioned. I trust the experience and project implementation ability of the members. Proposals provide a detailed plan, they clearly list tasks and include a timetable. Their budget is also broken down by specific categories, in my experience these expenditures are reasonable. However, there is one thing that they need to clarify, is there anything so that the original products will not be copied or guarantee the validity of NFT. The proposal also provides risks and plans to minimize their impacts.", "q1r": 4, "q2": "The proposal provided an implementation roadmap with specific milestones and timelines. Actually, I find that the proposal has selected very specific and detailed indicators / KPIs, and those indicators are also very reasonable to evaluate the success of the project. However, in order to improve the transparency of the proposal, the proponent needs to provide a way for the community to track the actual progress of the project. The proposed team can also build a project's information channel on Facebook, Twitter, or the community on Telegram and publicly operate and spend on those channels.", "q2r": 4, "assessor": "z_assessor_3425", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 12651, "q0": "The proposal fits the challenge setting. The project of molding traditional Japanese products into NFT, this is great. It will contribute to diversifying NFT in the ecosystem, preserving traditional culture at risk of being lost, and potentially attracting a community of collectors or the Japanese community.\nThe proposer also clearly outlined the process by which the project mints an NFT and the proposer's views on the project. It's true that craftspeople don't usually care about cryptocurrencies or NFTs, but I think these NFTs will attract a significant amount of collectors, who often just keep them as mementos. This brings cultural traditions closer to everyone and will potentially keep them from being lost.", "q0r": 5, "q1": "Thank you for presenting a fairly complete and detailed, step-by-step roadmap that you will take on this project. I think I have a clear understanding of the KPIs and the tasks assigned in the roadmap. In terms of budget, the requested funds are in line with the project scope. But the only problem is that it is difficult to find the details of the project owner, it is not provided in the proposal. And it's also difficult to find links when all are in Japanese and the web interface is quite hard to see. I managed to find it anyway, but I only see their names and no attachment links, probably because the interface is too hard to see. I think next time you should detail in the proposal, it will be easier for me to check the team's experience. Hope you will improve this part.", "q1r": 3, "q2": "Thank you for providing the project KPIs and vision for this project's success. Your KPIs seem like you are not really confident to achieve, I understand the difficulties that the project faces. Hope you will always update the project progress and the data fully and transparently for the community to follow, this will help the project close to the community and easily receive comments and support. And it will help me measure the effectiveness of this project.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Thank you for reviewing. \nFor Feasibility, your opinion is correct. However, main member (RANKET) can not open the indivisual informations, since I am a professional scientist with Ph. D over 50 papers including nature publishing group, but not related to block chain..\n\nIn stead of that, I was recognized by a lot of Japanese ADA holders and the famous Cardano ambassadors at least 5 ambassadors. And, I am also recognized by a part of IOG members. If you want my information please contact to YUTA the most famous Japanese Cardano Ambassadors. Thank you for reviewing."}, {"id": 14024, "q0": "I appreciate the meaningful impact toward this proposal to our Cardano community as well as Japanese culture. This new NFT market will blow a novel wind toward the traditional intrinsic value of Japanese crafts and inspire the Cardano community about the intriguing value of these types of culture. Since the crafting artist’s age range is in 50-60 years old and above but it seems like a minority of the young generation as well as the new person is attracted by these types of culture, it causes the crisis as well as the threat of being forgotten toward some traditional crafts. On the other hand, the proposal also mentioned Kimono as a famous traditional masterpiece of Japan, or some original crafting paper, patch work like “Kyo-nui” or “Wa-shi” to prove the team’s concern and passion for this proposal. I agree with the reason why the team came up with the idea to create a new NFT system based on the art NFT with the idea support from real art mentioned above and others. Perspectively, all members in the team are from Japan so that they yearn to maintain and develop and spread their countries’ culture is an understandable and respectful desiration. I am avid about the Kimono and the Geisha culture, so it is extremely wonderful for people who have the same thought or favorite like me to have more chances to understand how appealing these cultures are. Also, the Cardano community can attract more users who are both ADA holders and non-ADA holders as well as gain popularity in Japan and more other countries if the proposal is successful. The proposer is really conscientious when using both English and Japanese to express how passionate the team is. I must say it is essential for us to vote, believe in the proposal’s value that would be contributed to the Cardano ecosystem. Not only the Cardano community is beneficiary, the investors will also be inspired to recognize the value of NFT that is supported by the real-life valuable art and their price is not affected by the volatility of the coding coin price. ", "q0r": 5, "q1": "The allocation of the assumed financed fund is quite reasonable. A part of the fund would be used in buying the recommended crafts to create motivation for the traditional craftsmen to produce more meaningful products. These costs are described specifically in both formulae and the use of them. In the provided detailed plan, the team indicated that they understood which tasks of work need to be done and followed which chronology. They describe the purposes of those tasks and how to perform them and the KPIs as their expectation toward the proposal. For example, in the first 2-month, they tend to mint 100NFTs from craftsmen who want to mint NFTs with their original product and then the team will put those NFTs on the marketplace. It is such an obvious plan that I have ever read. However, I did expect to see in-depth the information of each member in the team. Since it is not only me who wants to know but all the supporters, people in the community need to know who the team members are, and which responsibility of each member. That would enhance the reliability and convincity of the proposal toward each person in the Cardano’s community.", "q1r": 5, "q2": "Generally, the auditability is quite easy for people in the community to estimate the overall proposal. However, I suggest the team providing a more specific number as a useful measurement for us as well as people in the team to evaluate how successful the proposal is. Moreover, it would visualize the expectation target of the team from the proposal for us. The integrating trading volume, or number of occurred transactions on the networking can be taken as examples. ", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "We will establish the value supported NFT market with Japanese Traditional Craftsman Group. We want to make this system as a standard for art type NFT and a way to save the art tradition.", "experience": "Main members are RANKET, RANKET2 and Makoto Harda(@kittamu)\nRANKET(Ph.D) is Japan Cardano community moderator and Japanese Catalyst project supporter.\nRANKET2 is a Stake pool operator and Kyo-nui Crafts man.\nMakoto Harada is a CEO of Kittamu Project with 4 projects."}