{"id": 422251, "author": "alejandro", "title": "Fluent: Bridging TradFi+DeFi", "url": "https://cardano.ideascale.com/a/dtd/422251-48088", "category": 26595, "amount": 250000, "description": "The lack of a trusted and transparent stablecoin within Cardano has stagnated growth and expansion into critical sector such as DeFi, and even inclusion of TradFi solutions.", "f6_no_assessments": 7, "f6_rating": 4.047619047619048, "videos": [], "media": [], "f6_assessments": [{"id": 570, "q0": "This project could have a significant impact on Cardano, as they have explained in the problem statement and solution, there is a current need for more stablecoins on Cardano. The proposal is aligned with the challenge brief to bring more use cases and drive adoption. Many business models, merchant payment systems, and Defi applications could use this stablecoin infrastructure, and it would benefit many users as Cardano scales. I have given 4/5 stars because I believe if this was not funded, the team would still bring this project to Cardano, and it's not clear why they need Catalyst funds. They appear to have a very professional team, and their websites \"get started\" button asks if you are \"An investor interested in funding Fluent or providing liquidity\" Therefore I believe the team would be able raise funds for this project without catalyst. It's also not clear how this stablecoin will have a more significant impact on Cardano then other stablecoin projects that will be launching such as the soon to be released Djed or Ardana, or liquidfinance stable coin, or the existing wrapped stablecoins like MadUSDC and MadUSDT available on wingriders DEX. It will be important for Cardano to have several stablecoins available to users, however this fluent project is unlikely to be the only one that impacts the ecosystem. ", "q0r": 4, "q1": "The team consists of several of the top professionals in the industry, including having Joel Telpner\nChief Legal Officer, IOHK as an advisor. There is little doubt they would be able to complete this proposal and deliver as promised. The team consists of experts from every relevant field of blockchain, banking, and legal.  The timeline and budget are clearly outlined, and the team has the resources required. They are familiar with the technical challenges, as well as having explained detailed risk mitigation strategies. ", "q1r": 5, "q2": "The community will easily be able to audit this project if it launches successfully. The team states \"Fluent primary metric of success is USD+ in circulation with our near team goal across the organization being 1 billion USD+ in circulation in the next 18 months.\" Obviously this will be an easy to track public metric, however there is no monthly progress reports, or development updates to the catalyst community. They have made no specific commitment to share any information with Catalyst during development, only promising the end results that will be visible to all. ", "q2r": 3, "assessor": "z_assessor_2108", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2028, "q0": "The idea of the proposal is to create a stablecoin that is fully interoperable with the traditional fiat system and that is fully supported by a member banking federation, ensuring that it has a 1:1 exchange.\n\nThe problem observed is precisely the absence of a stablecoin on the ADA blockchain that is fully auditable, interoperable with other systems and has a commission/federation that guarantees this transaction 1:1.\n\nThis is fully in line with the challenge because it increases the interoperability of stablecoin in the Cardano system, making it increase the number of transactions, financial flows, bringing more investors, companies and institutions. In addition, the proposed idea increases the trust of all users, or not, of Cardano, improving the ecosystem as a whole. Therefore, increasing trust in the ecosystem, bringing in investors, increasing the cash flow, among other things, makes the value of the blockchain increase.\n\nThe idea's metrics and goals are directly correlated with Cardano's goals. In the project, there is talk of building a circulation of USD+ (stablecoin) of 1 billion in 18 months, and obviously it would increase with it the transaction volume and Cardano adoption.\n\nScalability and its support are intrinsic to the project. Once they are able to launch and have flow, the project will sustain itself.\n", "q0r": 5, "q1": "In order to verify its feasibility, we need to verify the following aspects:\n1 – roadmap: Lack of detail in the plan involved. As a suggestion, it would be great if you included all the necessary steps, including tools and people for each task. For example, in the mentioned stage 2, it would be important to add all the necessary points to reach the end goal, which is described. That is, the roadmap is described more as a deadline to reach the goal than a plan with tasks to be accomplished with your specific needs.\n\n2 – budget: USD 250K was requested, which is a considerable amount and therefore should have more details on the allocation of this money. As a suggestion, it would be interesting to add information on the individual costs of the tasks – software development, legal costs, etc.\n\n3 – team: The team is composed of people with different skills and necessary to fulfill the objective. The linkedin of all members was provided. Therefore, the team seems to have the competence and knowledge to proceed with the project.\n\n4 – risk management: Due to having a multifaceted and experienced team, several risks were addressed and the respective actions were allocated to mitigate each one. In addition, it was said that there is a huge concern at each stage of the project for its development, making it possible to obtain a significant and lasting result.\n\n5 – self-funding/scalability: As mentioned before, once the project is realized and starts running it is entirely plausible that it will be self-sustaining and scalable.\n\n6 – tasks: It would be quite interesting if the proponent had said what tasks are needed to complete the project. Also, of course, add the time needed, tools needed and the team needed to complete it.\n", "q1r": 3, "q2": "In order to audit, we need:\n1 – roadmap w/ milestones: As already mentioned, in order to be able to audit any project, you must verify how the tasks were exposed and the checkpoints. In this way, we can view partial deliveries and verify that everything is in order. However, unfortunately, the tasks are not exposed in this way and, therefore, it is not possible to audit. As an improvement suggestion, you can include more information about tasks and deliverables in the middle of the project.\n\n2 – Metrics and KPI: Another aspect is metrics and KPIs. The final objective and the expectation of success were informed, however the metrics that will be used to measure the evolution of the project were not informed. As a suggestion, metrics should be added to verify the evolution of the project such as transaction volume, amount of USD+ in circulation, number of portfolios, etc. This is on the client side. On the banks' side, I'm sure there must be other metrics to be controlled.\n\n3 – Channel: They have a channel to share all the information and, besides that, it was told that there will be a monthly report release. \n", "q2r": 3, "assessor": "z_assessor_2298", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 4224, "q0": "Fluent: Briding TradFi & DeFi proposal addresses Dapps, Product and integration challenge by \"Fluent\", an interoperable stable coin and settlement system (2 layers: interbanks and cross-chain). Fluent's private and public layers connect legacy banking to digital finance. To mint Fluent's stablecoin USD+, they have 'Federation Member Bank' Network. In order to join this network, the Federation Member Banks must guarantee a 1:1 exchange with US Dollars and USD+. The team mention in the proposal that \"they will use real-time on chain analysis and audit to prove that the Federation Member Bank can meet their fiat obligations to USD+ Holders instead of a delayed third party audit.\" However, they haven't managed to clarify this unique selling point of their proposal. How does this real-time on-chain analysis and audits work? The entry into the federation should be a one-time occasion and it worths having the proper audit; however, this process is skipped. How could they ensure that their real time on-chain analysis would be better than third party audit? Until they can answer these important questions, the integrity of their solution is called into question. By claiming that Djed (algorithmic stablecoin) would find it hard to attract users in this market climate, they would have to prove that their unique selling point of real-time on chain analysis and audit of federation member bank would also work in this difficult market. The Federation members play a vital role in their project: mint, redeem and distribute tokens and their performance is measured by F-score which shows the quality of reserves. The low F-score could trigger the risk mitigation actions and freeze on a bank's node. The solution of this proposal is still relatively unclear to address the dApp, Products & Integration challenge. The team would need to provide more technological knowledge to back up their statement. The proposal is very ambitious to make a stablecoin and settlement system to increase Cardano adoption. However, from their official website and information in the proposal, we still need more precise info how the process would work for the Fluent protocol and also for the users. Until the process of protocol is explained and more logically organized, it can't be determined that the proposal will address the challenge or not. ", "q0r": 4, "q1": "The project timeline (in total 4-6 months) is divided into 2 stages: stage 1) structural planning will take around 1-2 months and stage 2) cross-chain integration will take around 3-4 months. There is no detailed budget breakdown and the total funding ($250,000) will go towards the development of different component within solution their product offers. The team member profile can be retrieved by visiting their official website and one team member (Oliver Gale) is also a co-founder on another protocol (Panther protocol) which puts on another proposal in F9. Enabling privacy for Cardano DeFi: https://cardano.ideascale.com/c/idea/422402  The action plan hasn't been clearly laid out in detail except splitting in stages with mentioned time period in each stage. The team would improve if they could shed light on their action plan in both stages, break down budget and declare team member profile and  linked protocol in a more transparent manner. ", "q1r": 3, "q2": "The team mentions about the success of this project to create an ecosystem compatible with the Cardano infrastructure that have all relevant capabilities in the solution. The metric for this success is USD+ circulation ( 1 billiion in circulation in the next 18 months). The team still has relatively well understood the necessity of stablecoin within Cardano as it will be critical for DeFi and TradFi solutions. However, they are still not very succinct when it comes to explain this solution technically. They will have their chief compliance ofiicer to produce monthly report that include technical updates and report back to the community and the real time monitoring of total USD+ minted on cardano via oracles. Their target and end products are ambitious but if they could update the community regularly of the use of fund and unexpected deviation, the project's auditability is decent for the community to observe as they go along with the project. ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10405, "q0": "Although Djed is the first stablecoin built on Cardano, it is still in the process of being developed, and the application of Djed is not high. The proposal will suggest creating a stablecoin (called USD+) which is built on Cardano. This stablecoin will connect digital assets to core banking. Stablecoin is an important part of an ecosystem, so developing more stablecoins will give Cardano more choices.", "q0r": 5, "q1": "The project team is the Fluent team. They are also the team that built the Fluent protocol. The Fluent protocol is a network that will be a bridge between core banking and the USD+. The Fluent team consists of 8 people. They are experienced in blockchain, Nfts, software, and banking. In the proposal, there are not any links to their profiles, but we can visit the website: https://www.fluent.finance/team. We can find out more information about their team through their LinkedIn. They have outlined 5 risks that the project will face, and they also have proposed mitigation actions. The stablecoin project’s roadmap will be divided into 2 stages. Stage 1 will last from 1 to 2 months. Stage 2 will last from 2 to 4 months. They need a budget $250000, but they don't have a detailed plan for this budget.", "q1r": 4, "q2": "They only have one metric for their stablecoin project. That is, they will achieve their goal of 1 billion USD+ in circulation in the next 18 months. However, apart from this metric, I think they should have key metrics in every stage of the roadmap. For example, in stage 1 and stage 2, what are their targets? How to gain these targets?... This will help to manage and audit the project better.", "q2r": 3, "assessor": "z_assessor_3183", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11268, "q0": "The proposal sets to deliver a stable coin USD+ that is more secure from de-pegging and is regulated. With a stablecoin, it will help facilitate the growth of Cardano as things can be represented in fiat value in the DeFi ecosystem, which is very much needed. As of now there is Djed but is it still not yet out and running and is an algorithmic stablecoin. Whereas USD+ would be 1:1 exchange US Dollars as it would be a condition to enter into Fluent Federation which the plan sets to do. This would be rather reliable in the eyes of the public based on the events that have happened in regards to algorithmic stablecoins. Thus, this proposal does address the challenge. ", "q0r": 4, "q1": "The team consists of 8 individuals, and all of them are very experienced and capable. There is Bradley who is experienced in product development, technical architecture, venture capital, blockchain business development, and strategic acquisition. Then there us Oliver Gale, the inventor of CBDC and founder of the privacy-focused Panther Protocol. Jaime Plata, who is an entrepreneur, published author, researcher and strategist responsible for designing complex systems for the National Bank of Canada, PEMEX, ATB Financial, Paypal and more. The list goes on, all the individuals involved in this proposal are very capable and know what they are doing. Thus, in regard to their experience, the team is very likely to implement this proposal successfully. As for the plan, that is a little different. The plan provided is not nearly detailed enough for the $250,000 they are asking for. I highly suggest the team write up a more detailed plan for such a huge plan they have set. Upon reading their plan no matter how excellent the experiences are I have my doubts. ", "q1r": 3, "q2": "The audit of the progress provided is sufficient as it gives more than one means to assess it which is USD+ in circulation with their near team goal across the organization being 1 billion USD+ in circulation in the next 18 months, reports on a monthly basis which contains technical aspects, use of the funding to date and sharing of any unexpected deviations. However, apart from the first mean (circulation of USD+) the rest of the audit signs of progress is put in a different part of the proposal thus it could have been easily overlooked. As for auditing the success of the proposal, the team said it be by achieving their final goal, where an ecosystem compatible with the Cardano infrastructure that uses all relevant capabilities in the end solution. This is sufficient to assess the success of the proposal. ", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 11328, "q0": "This proposal covers the challenge it is located in, which is Dapps, Products, & integration. Fluent aims to bring about USD+ which is a stable coin that is backed 1:1 with fiat currency.  Fluent is create a Dapp, the product is USD+ and integration is for the Cardano blockchain, but eventually could be used interoperability  across all chains driving people to use a Cardano based asset. \n\nFluent will help drive adoption and traction across the Cardano ecosystem by bringing investors and institutions in both the traditional and digital asset financial landscape with an opportunity to service an untapped market by providing a trusted, low-risk entry to crypto markets.\n\nFinally, the only true stable coin coming on Cardano currently, in any significant stage is Djed, but Djed is a algorithmic stable coin, whereas Fluent or UDS+ is a fully backed stable coin. The two can co-exist, and the user of the Cardano chain can decide which is best for them to use. \n\nConsidering all this, the proposal effectively addresses the challenge with the added benefit, that once successful, has the ability to draw people in from other blockchains to use the stable coin.", "q0r": 5, "q1": "First of all, the proposer has clearly considered all risks concerning fluent and its stable coin USD+. Furthermore they have laid out how these risks will be minimized and actions that can be taken if these risks were to arise. They have taken the time to really think things trough to a very deep degree and also have the advantage of seeing the things that have taken place lately with algorithmic stable coins such as Terra Luna. \n\nNext, looking at the team, we see that we have a set of people experienced in banking, technical architecture, venture capital, blockchain business development strategic acquisitions, inventor of the CBDC and founder of the privacy-focused Panther Protocol (I did an assessment on that proposal as well), designing complex systems for the National Bank of Canada, ATB Financial, PEMEX, PDVSA, Liberty Mutual, the Costa Rican Stock Exchange and Paypal, and so many other things. \n\nThis team is literally an \"all-star\" team with amazing historical experience and accomplishments, but we need to also consider the timeline and milestones of this proposal.\n\nAs far as the timeline and milestones are concerned, it would be nice to have a lot more detail presented to us to consider. As it is written right now, it is a very basic ETA timeline with minimal milestones. However, the proposal makes it clear that the ETA is 3 to 4 months out to start minting USD+ and the alpha launch on Cardano.  \n\nThe only thing I would have liked to have seen is more details concerning each of the phases in the timeline, such as further detailed milestones. \n\nWith that said, based on the teams background, history, and accomplishments, along with the the details concerning the risk and management around those risks, and the timeline, combined with a federation of member banks, I see this proposal as being highly successful in being implemented on the Cardano blockchain, and very needed addition to the blockchain. We most certainly need a 1:1 backed stable coin on our chain.", "q1r": 5, "q2": "I would like to have seen more details around the auditability of the proposal, but when you consider that the proposer is expecting 3-4 months to have the alpha version out, really, the only auditability if the product will come down to USD+ in circulation. This is exactly what they have listed.\n\nHowever, if ever, the people on the team of this proposal ever start a new project requiring funding from project catalyst, I would recommend to add more details in the auditability section of their proposals.\n\nThis section of the proposal is important, because without auditability it is near impossible to see the progression of proposal as it moves forward. Not being able to audit the progress of a proposal actually hurts the proposers chances of getting funding. We need a clear way of being able to see where the project is at, what is being done, and how far along it has come every few weeks or per month. \n\nConsider adding more details to auditability in any future proposals to help us assess it properly. These can be basic things such as recorded meetings of the team covering what has been done or is being worked on once per month, or a github webpage detailing progress along the way, or beta versions and/or screenshots of the app, or any number of other basic inputs allowing people to see the progression of the project after it has received funding.\n\nWith everything said here, The information provided is sufficient to audit the progress and the success of the proposal. The information written here is mainly for the proposer, but hopefully the voter can see that there is sufficient information to accurately audit the progress since alpha version is 3 to 4 months out.", "q2r": 4, "assessor": "z_assessor_3237", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 12785, "q0": "The proposal tries to make the DeFi and the connection to TradFi easier by creating a new interoperable stablecoin. This could provide many new possible application and be a use in DeFi and TradFi by bringing more security to the system. \nThere are other stablecoins in development on Cardano like Djed. But Djed is an algorithmic stablecoin and the is a fully backed stablecoin. So even from this perspective there is the usecase that the user can decide which stablecoin to use. \nTherefore the proposal matches the challenge strongly by bringing a whole new implementation with many uses in the whole finance ecosystem of Cardano. ", "q0r": 5, "q1": "The team is well chosen with much relevant experience. Their LinkedIn account is linked on their website so I checked their CVs. They should be capable to implement the proposal. \nThe budget is unclear. It´s not possible to see where you allocate how much money and to check there for the reasonability. Please provide more transparent infos next time. There are some short informations, but it´s not enough to be transparent. Therefore I remove one star. \nThe timetable looks ambitious but reasonable. It gives a short but sufficient look into the timing of the implementation. \nThe team gives a detailed overview on the risks. The risks are described in detail. ", "q1r": 4, "q2": "The roadmap for the development is described and the have set a midterm goal which is numerically verifiable. The goal is to have more than 1 billion USD in circulation in the next 18 months. It´s a large sum of money but it´s a stablecoin and therefore with the growth of the Cardano ecosystem (especially DeFi) reasonable.\nThe target problem is described clearly in beginning and this project solves it. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We will be launching an interoperable stablecoin and settlement system connecting digital assets to core banking, and thus providing an efficient bridge between enterprise and public layers.", "experience": "We have assembled one of the highest skill teams in the industry with the proven record and extensive experience in developing enterprise scale applications, operations and technology systems for both traditional and DeFi markets. "}