{"id": 422328, "author": "fluxcap", "title": "PillarWheel Studios Cardano Apps", "url": "https://cardano.ideascale.com/a/dtd/422328-48088", "category": 26595, "amount": 16100, "description": "Arkansas and the surrounding area is very remote for brick and mortar game/media development studios, and there is a need for a DAO type studio to compete with ones in Austin, Texas.", "f6_no_assessments": 8, "f6_rating": 3.291666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1719, "q0": "The proposal fits relatively with what seeks the challenge, in fact I think it would fit better with the challenge of DAOs. Here we are seeking to develop dApps, integrations and products that add value to the Cardano ecosystem, with added value being observed through some metrics such as: Cardano community engagement (adding new active members or making current members more involved with our purpose); increase the number of NFTs minted on our blockchain; increase the number of Ada and smart contracts; the number of cardano digital wallets (like Yoroi, for example) and etc. This idea, in a way, can generate these increases and also the better engagement of our community, but from what I understand a company would be founded, a platform, a specific dApp would not be created. Maybe it is, but it's not so clear. For this reason, I believe that the idea could fit more perfectly into the challenge of DAOs, as in this challenge we intend to form groups that, gathered around a common cause that concerns our blockchain, can also bring benefits to Cardano. And that's what would happen here: the idea is to promote a company (which from what I understand already exists), called Pillarwheel Studios. This company is created to help those who work remotely, helping to develop products and services, which would be built on top of our blockchain. The proponent attaches a website, but it gives an error when we try to access it, unfortunately, which does not allow us to get to know this group in a more practical way. The proponent argues the need for such a company since Arkansas (USA) media/game developers and producers need a collective initiative that brings them together and benefits them. It is said that there is no other group of this type in this state, as for example there is in the state of Texas. One problem that I identified here was the lack of detail about what is already done and what would be built by this group. For example, in the excerpt: “PillarWheel Studios was built out of the need to organize developers in northwest Arkansas into a centralized LLC, in principle, which also incorporates decentralized autonomous organizational tools centered on the Cardano blockchain for its internal organization of consultants and developers”. What would these tools be? How do they contribute to the work of these professionals? There is a lack of clarity about what is already being done in the company. In “The Cardano blockchain is our choice of blockchain integrations for many reasons - some being that our missions have similarities. We will use Cardano as our blockchain of choice for our products, and this proposal will help build the necessary infrastructure to develop these products and services”: which products and services are we talking about? On the risk side, the proponent states that it is very difficult to found a successful Startup, and states that “sometimes, the strategy would be strong, but the infrastructure would be weak. The company name \"Pillarwheel\" came from the study of what can go right and which variables contributed to the success of the startups I was involved in. have action plans, partnerships and the ability to follow through on these strategies”. Once again, it would be positive for him to exemplify what action plans, partnerships and strategies are. That said, I think the proposal has potential, but the impact is not perfect due to the absence of some important information, and in my view it would also be a proposal more focused on the “Cardano <3 DAOS” challenge.", "q0r": 4, "q1": "This topic is average, we have some basic information, but unfortunately it is not very suitable. The roadmap is not precise, first the proponent states that some activities have already been done (\"we have already started to form the L.L.C. in Arkansas, USA, and are forming partnerships with state resources for startups, in addition to DAO and other resources in the non-centralized space , with Blockery.io and other organizations to assist in our decentralized infrastructure”). But it would be important for him to better detail this information: what has been built so far, with whom have partnerships been established? What is the decentralized structure they have been creating like? Just as we don't have enough details about what has already passed, we also don't understand exactly what will come. In October 2022, the goal is to build an MVP and demo the main product. It is mentioned that a demo of the game Above So Below would be done, but not much is explained about this project. As much as they have provided a link to the game's proposal, it would be important for them to make a small summary of what the game is and also how it uses Cardano's technologies. The proposer states that the game will be developed in a group if the proposal is funded, but does not give further details on this. How would the project become reality? Which professionals would be involved? If the proposal is not funded, how will he handle it all on his own? From October to December some things would need to be delivered: “having the LLC formed, the LLC agent secured and then starting more aggressive efforts to welcome investors (using these funds from this proposal as a means of obtaining and solidifying partnerships and investors individuals)”. But, as in the case of the game, it is not detailed how these products would be developed, what efforts would be made to get investors, what the “LLC” would be, etc. In general, the script does not allow us to have a solid understanding of what will come, precisely because of the lack of detail about what would be done. The costs are also not well explained. We know that the total amount is 16,100 dollars, and it is divided into some parts, but not one of them is properly broken down. Why does a year of cloud hosting cost $11,600? What legal services would be needed to establish these activities, and how would marketing be produced? What would the publicity campaign be? I think that maybe in the state in which the company would be founded, people would not be so familiar with blockchain technology, which generates the need for a solid and accurate marketing campaign. And finally, even if it is a group/company, the only person presented in the team part is the bidder. What we do know about him is that he works in the technology field at a university in Arkansas, that he is involved with cardano as a veteran proposal evaluator and that he has studied blockchain for a few years. But it is not clear if he already has a project developed with our technologies. More people would need to be introduced, for example the team that would develop the game, other people relevant to the company and so on. The topic gives us background information, and not much confidence is given about the applicability of this project.", "q1r": 3, "q2": "The auditability of the proposal is also quite average. I say this because, first of all, we don't have a very detailed script and we don't have a good idea of ​​what would happen, how and when. From that point on, it becomes difficult to carry out adequate monitoring. The proponent suggests monitoring the process based on some metrics, but they are quite abstract. For example, generating income: how many people are we looking to employ? In what way do we expect them to work, what salary claim is considered here? How many projects, in addition to the game that is mentioned in the script, are thought to be put into practice? The definition of generating deliverables is very generic too, this can say about many things, we would need to know which deliveries we are expecting, in what way and for when. Get Partnerships: Who are we looking to do this with, and what kind of partnership are we looking to set up? It would be beneficial if the proponent cites some names, even from groups relevant to our community (eg Cardano4Climate, Gimbalabs, Wada and etc - well-established groups known for their projects funded on Catalyst). It is said that videos would be posted on youtube, but we do not know 1) what content should be posted; 2) how often; 3) how the target audience would be reached. Generally speaking, it takes a lot more detail to audit progress, we need to know clearly what would have to be done, in what way, and by what timeframe. Ideally, the proponent should share with the Cardano community monthly reports that say about what was done that month, who worked on what projects and what partial results would have to be obtained (he could even be guided by the KPIs mentioned here in the scope of the proposal). The success scenario is also defined in an abstract way, in the following excerpt: “launch it from a series of plans, to concrete and measurable actions with KPIs showing success, or at least paths to it. Articles in at least local publications detailing our launch and then interested investors who will help us get a greater amount of funding from our efforts contact them for these opportunities, or investors contacting us.” What would be the concrete plans and actions? What content of articles and local publications do they intend to release? How will they engage and engage local stakeholders? How can the actions of this company be observed in practice and how can we draw a direct relationship between them and the objectives of the challenge? For these reasons, I think that again there is a lack of detail and more clarity on what could be monitored as a success scenario. My suggestion is that the proponent be more exact in relation to the generated products and can present them in some direct and verifiable way to the community, through some presentation in Townhall, for example.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2440, "q0": "We realized that the general idea of the project is to raise funds so that a tool aimed at building decentralized applications is established. With this, other ideas could be developed using technologies related to Cardano. In fact, in this context, we have that the project fits the goals established by the challenge. However, it seems that the budget being requested would be insufficient for the project to reach the intended external interest, even working only as an initial push, because we did not find enough innovation in the idea to make it clearly differentiated. This jeopardizes the potential impact of the proposal on Cardano's ecosystem.", "q0r": 2, "q1": "In line with the concerns raised above, the project feasibility plan is not providing a great deal of detail on how the planned activities would bring engagement and interest from outside investors. In general we can see that the activities assigned in the project timeline are related to the production of the game. But when we looked for the team responsible for the development of this product, we found only Steven. Although his experiences are relevant to the development of the project and his curriculum is available, we know that for a game to be successful and attract a large number of players, it needs to have good storytelling and original gameplay. Although we have examples of games developed by a single person and that gained relevant notoriety, it seems important that in this case more people already made up the team so that different knowledge of the world could be applied in development. It would be interesting, for example, if professionals specialized in marketing were on the team. On the budget breakdown, we see that the largest allocation of capital (approximately 70%) is focused on hosting resources in the cloud. However, we did not find a clear explanation of why this is a fundamental action for development.", "q1r": 2, "q2": "Regarding the ways described for the project's evolution to be monitored and also in relation to the perception of success, we found very vague ideas. It would be nice if the cited concepts were more grounded, in this regard, parameters could have been cited indicative of the gradual progress of the game's development. For example, the methodology used could have been cited (something like Agile method) or the duration of production sprints. It would also be interesting to indicate some tool for the community to follow the evolution of the project.", "q2r": 2, "assessor": "z_assessor_2306", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4125, "q0": "Problem Identification: The concept of a cloud-based DAO as a global scalability tool is being simplified in its relevancy to encompass the sparsely populated Arkansas area, as it is relevant to competing in other small cities in Texas.  I'm not 100% sure I understand the impact of the problem/solution fit as presented. \n\nValue-add: The goal seems to be to facilitate remote workers access to compete in certain markets, using a DAO and legal entity to facilitate legal/operational framework for entrepreneurs.\n\nAlignment with challenge: I believe there are 2 more closely aligned challenges than the one selected for this proposal, 1) DAOs <3 Cardano, and 2) Legal & Financial Integrations - since the project aims to establish a DAO for the purposes of centralizing remote work and facilitation of new products and services around this framework.\n\nScalability: Scalable, but not broad in its ambitions, this project aims to define its relevant market within a small subset of rural America.\n\nSustainability Plan: \n\nJustification:  While the proposal has some merits in its benefit for the community, my neutral position is based on the belief that this proposal is not optimally located within the most relevant challenge, and falls short of scalability ambitions that could maximize impact to the community.", "q0r": 3, "q1": "Team Skill Relevance:  I generally support the entrepreneurial mindset, ambition, and capability.  However in this case, the proposal aims to deliver a legal/regulatory solution, and the proposal author is an IT personnel / CTO, having no known legal experience.\n\nTeam Appropriateness: The proposal author has indicated they will work alone, with the assistance of 3rd party contract support.\n\nBudget Outline/Reasonableness: I'm not sure I agree with the budget appropriateness.   For example, the proposal states that LLC formation will require use of funds $2,750.  Online resources indicate this can be done for $50 in 2-3 business days with an online application.  However, I'm not knowledgable on the legal complexity of establishing a DAO, so unsure if the additional cost is somehow related to that, but the proposal is not clear in this direction.  The bulk of the funds (around 70%) after that are used as a cloud hosting budget.\n\nAdditional Funding Plan: Unclear, as the proposal states \"yes\" they will seek future funding, but it is not clarified if the author means for this proposal or others.  There seems to be a placeholder left in this section where the author intended to provide a link to a past proposal on Catalyst, but the placeholder has no link to view.\n\nImplementation Plan:  The implementation plan is very basic, and also contains a reference to another proposal which is not provided (another missing placeholder).  The second part of the implementation plan includes only establishment of a legal entity, which the proposal states it will outsource, although it maybe possible to do online and save cost.\n\nResource Plan: The main comment that the author repeats regarding resources is that he plans to keep the needs minimal so he can under promise and over delivery.  The main problem is it's not completely clear all of what will be delivered, or how detailed of a plan exists to deliver on those minimal promises.\n\nRisk Mitigation: The author states that persistence and conservative use of funds will be the best ways to overcome failures which are common in the startup industry.\n\nJustification: I don't agree or disagree with this proposal, perhaps there is more in depth knowledge that the author knows about the operational problem in his geography or the intricacies of the proposed DAO solution that, if I had more information, could help to evaluate better.", "q1r": 3, "q2": "Clear Roadmap/Milestones: The roadmap and milestones are not clearly defined, but the proposal to deliver a DAO for legal simplicity is relatively simple.\n\nDefined Metrics/KPIs: The Metrics/KPIs for this proposal are not well defined, and push this responsibility to the next phase after DAO setup.\n\nMeasurable Problem/Solution Impact: In my opinion, there is little ability for the community to evaluate a problem/solution fit based on the information provided regarding the Arkansas and Texas geographies or operational challenges that exist in these markets.\n\nPublic Update Channels: PillarWheel does have public channels listed, a website with various links all leading to the same homepage.\n\nJustification: I think the proposal author has presented a problem/solution fit that they are very familiar with in their industry/geography, but offers not enough information to evaluate by the community in terms of impact.  If the proposal were to elaborate on a use case or give us a more clear example of some limitations that exist now, it might be easier to see the value they are pitching here.", "q2r": 3, "assessor": "z_assessor_2517", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4586, "q0": "This proposal seeks to create a DAO focused on leveraging game/media development resources within Northwest Arkansas, a region the proposer identifies as being remote from established geographic hubs in those categories. Unfortunately, as Fund 9 has a category  specifically dedicated to DAOs, I believe this project to be miscategorized under the Dapps, Products & Integrations heading. \n\nI'm also a little confused about the mission this DAO would be focused on. On the one hand, the proposer identifies game/media production as the focus, but later states that he is focused on providing SSI solutions for higher education immigration compliance. This may indeed be the case, but so far as the proposal is concerned it adds confusion as to what, exactly, will be the DAO's scope. ", "q0r": 2, "q1": "The proposal is seeking a modest amount of funding to establish an LLC and web hosting services. The proposal states that the process of forming the LLC is under way. While I have every reason to believe Steven possesses the skills to accomplish this, I do have some concerns. \n\nMy primary concern is that aspects of the proposal appear premature. The company's flagship product Above So Below currently doesn't have much available to show. There's also not much discussion of what governance might look like. I would also suggest identifying some of the partnerships and/or resources the proposer hopes to tap within his state.", "q1r": 4, "q2": "The proposer claims to be able to produce legal filings showing LLC name reservations and is offering to produce additional documentation of the incorporation process. As part of the proposal also includes marketing materials announcing the formation of the LLC, the community should have a pretty good idea of whether or not the proposal has met its KPIs.\n\nHere again, however, some aspects of the proposal appear premature with placeholder text standing where links will go in the future. Narrowing the focus of the proposal, at least until such time as those resources become available, will likely help with clarity. ", "q2r": 4, "assessor": "z_assessor_2564", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5284, "q0": "The PillarWheel studios Caradano Apps is to build utility app space for both centralized company and decentralized autonomous organizations (DAO) for those working remotely and to assist in SSI solutions for US higher education immigration compliance and economic simulations. The proposal identifies a problem quite clearly that Arkansas and the surrounding area is very remote for game/media development studios and there is a need for DAO type studio to build the community for game developers and producers around Northwest Arkansas. It is not clear on the demographic size of this group as the challenge objective is to implement a dApp that will bring impactful use case into Cardano and increase its adoption. This proposal objective might fit better with the DAO love Cardano challenge than with the DApps, products & integration challenge. ", "q0r": 4, "q1": "The project spans from Oct-Dec (3 months period). In October, the proposer plans to offer a flagship product \"above so below\" game development and by December, he will set uip LLC and begins to locate investors. This media push will cost $1600 and the proposer might need to explain which approach is this marketing push. Other costs are sensible although the one year of cloud hosting for web resources will take the most from the budget ($11600). The project will improve in term of feasibility if the proposer could explain more on this cloud hosting. The proposer explains that this proposal is to start a new company. It is a great effort from the proposer trying to start the company and build a DAO for game developers although I think that the proposer should focus on game development first and once this takes off, this proposal will be a good complement proposal and easier to implement. ", "q1r": 4, "q2": "The success of this project for the proposer is to launch this dApp from a series of plans with the KPIs to measure the success. The proposer expect to have local publication detailing on the launch and interested investor. The proposer also offers to produce more content on youtube and share the view numbers on their initial product offering. He already has document on LLC's name reservation and can show document on LLC formation. The community can check the project progress and success quite easy. The proposal would improve with its clearer roadmap with milestone and horizon for achievement. The target solution is to build a DAO studio and have the utility Dapp to serve this community. The proposal will need to clarify on the elements to achieve this objective. By forming a LLC and marketing campaign shouldn't be the main focus of this proposal but rather the DApps itself that will bring the utility to the game developer community. The proposal will improve in its auditability if the proposer will focus on his goal and consolidate the proposals to show the flow of his idea clearer and also for the project to be easily auditable. ", "q2r": 4, "assessor": "z_assessor_2684", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9077, "q0": "I believe in the core idea of this proposal, that is to develop an LLC DAO to help unite web3 developers in the Northwest Arkansas Area. I think this is a worthwhile endeavor. However the goals of this challenge are to develop dApps  and frameworks to develop and grow the dApp  ecosystem on cardano. I do not believe that this challenge goals are met by this proposal. This proposal will be better off in the DAO  challenge or going back in a future Fund in a similar challenge. Main concern here is that the goal of this proposal appears to be related to setting up this LLC as a decentralized autonomous organization. I think this is something that needs to happen, and I'd be happy to see it supported. However it does not further the goals of this challenge at all. Additionally, the proposer did not do a good job expressing how this proposal would further the goals of this challenge. Instead of addressing the goals of this challenge, the proposer focused more on the challenges that his organization is facing. It would have been better to primarily focus on answering the question how will this proposal address the challenge that this proposal was submitted to.  And in this case the challenge is dApps,  products and Integrations. For these reasons I have scored this proposal at a 1.\n", "q0r": 1, "q1": "Solely based upon the information given in this proposal, I do not believe this to be feasible. I do believe that this team and organization are capable of accomplishing the goals that they have. Their branding is sharp and clean and they have put a lot of effort into thinking this through. However the answers given for the questions that were asked are not sufficient to be able to ascertain whether this is truly feasible. Part of that comes from the fact there seems to be some confusion between this proposal and others that this team is proposing. While this proposal aims to develop an LLC, part of its time frame for feasibility mentions of a flagship product. But this mention refers to a different proposal. This is very confusing for assessors who do their best to assess each proposal based on its own merits. Additionally there is not a whole lot of information about how this team intends to go about getting their LLC formed. Also a large portion of this budget is to be spent on a year of cloud hosting for web resources. This funding does not make sense in light of this proposal which is primarily seeking to form an LLC. I believe that this team could have done a much better job of organizing their information and presenting a clear proposal seeking to accomplish a single goal. Mixing in web hosting on a proposal designed to achieve a legal goal, muddies the waters, at least for me. It's for these reasons that I'm giving this score of 2. I would like to see this proposal redeveloped and resubmitted in a future funding round because I do believe that this team is capable of accomplishing their goals. I just think they need to do a little bit better of a job organizing their proposals so that assessors can fully understand what the funding is going towards. \n", "q1r": 2, "q2": "As mentioned in the feasibility section, this proposal is not entirely clear. There are questions about whether they are seeking funding to generate an LLC, or to accomplish the completion of a flagship product. Additionally, while I appreciate the language about the goals of the pillar wheel organization to “generate income, generate deliverables, etcetera,” I would have preferred to see information regarding how they plan to be transparent with the progress of their proposal to the Catalyst community. This section of the proposal is dedicated to helping assessors determine how this team plans to audit the success and progress of their work. So there should have been some mention of measurables. For example, “We plan to visit with a lawyer 3 times,” or “We plan to visit with a lawyer for an hour by October 1st.”  Additionally there should have been some mention of how this proposal would report their progress to the community. For example, “We plan to provide a monthly update on Discord.” Without this clear information, I just don't know that this proposal is auditable. I do think that this  team would be more than willing to fill reports out and to be transparent about their progress. But they  just did not give enough information in the proposal to be able to assess this at a higher score. It's for these Reasons I'm giving this a score of 2. \n", "q2r": 2, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9552, "q0": "For an inexpensive (therefore lower risk) proposal with a regionally optimized influence capability, I rank this section a 4. This proposal falls a little short in explaining the proposals impacts all the way to completion beyond just the lack of DAO tools in the given area. There are little bits of indicated influence capabilities in the acknowledgement of locations for larger and more influential corporate entities. The link to these entities needs to be explained out a little more but it’s a functional outline of the value of Cardano’s exposure to this particular region. I vote positively on this one because it just barely meets the criteria for what this section is meant to accomplish for a Catalyst proposal, but this one does need a lot more work to explain the status quo of game development, influential capabilities, and the ultimate end goal impact that would appeal to Cardano community members. I would suggest a little bit of quantifiable market research that might demonstrate need or impactability and some explanations that can more clearly link this proposal to the given impacts/benefits. I would also like to see some more direct acknowledgement of the risk of regulatory uncertainty in the US and how the proposer intended to prepare for potentially poorly formulated legal frameworks. ", "q0r": 4, "q1": "For seemingly sufficient experience to reasonably produce the indicated LLC and indicated progress for this process, I rank this section a 4. This proposal presents actions that come along with a level of simplicity that makes this feasibility section not difficult to accomplish but I do feel like the proposer does a sufficient job at showing a comprehensive legal foundation to protect future endeavors built through this LLC. This section does lose some points for stating intentions to provide links to other relevant Catalyst proposals but apparently forgetting to include that information, so I had to go track it down (https://cardano.ideascale.com/c/idea/422332). The information from this proposal isn’t necessarily relevant to the actions of this proposal, except for what this LLC represents (which will help voters evaluate if they feel this proposal is relevant). Aside from that, the roadmap is clear to understand and the spending seems reasonable, so I vote positively. ", "q1r": 4, "q2": "For perceived simplicity of this proposal by itself and a positive framework for success indicators, I rank this section a 4. At this stage in the development of these projects, it’s reasonable to assume that target metrics aren’t easily clearly definable. However, I think there is some room to provide voters with some measure of targeted performance at different timeframes of the life of this project. I think a range of generated income could be targeted and I also think a target number of partnerships would be an appropriate measure of success. These metrics would show voters that the simplicity of this proposal does not eliminate the capability to commit to certain targets for success (even if just tentative). ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12357, "q0": "The problem described aligns with the challenge settings. The proposal seeks to assist in the building of infrastructure needed to develop these products and service. This project intends to bring together developers and youth in Northwest Arkansas. I believe once this infrastructure is completed it will serve as a source where products and services are provided. This will increase the use of cardano blockchain in the area and hence lead to its adoption for its environs. The project if implemented will provide both a centralized company for legal purposes and decentralized autonomous organizational tools for working remotely that assist to develop needed products and services. The proposal provides a solution to the use and adoption of products and services on the cardano blockchain which is line with the challenge settings.", "q0r": 5, "q1": "The team is well established with experience in their area of expertise. The budget is brief and reasonable for the launch and LLC and prepare to  obtain other funding. The proposal has a clear and detailed plan that have described its activities given timelines for its implementation. The project if implemented will be commencing in October 2022 for the first phase and through to December 2022.", "q1r": 5, "q2": "The proposal provides a solution to the need of a building an infrastructure. But the proposal is seeking for funding for the launch of the project with some activities. The information provided for the project is clear and understanable for the implementation of the project. There is an able roadmap that has been put in place in achieving its goals. The project has indicated KPI's that will see to the progress.", "q2r": 5, "assessor": "z_assessor_3401", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Provide both a centralized company for legal purposes, and decentralized autonomous organizational tools for those working remotely: that assists to develop needed products and services.", "experience": "CTO, Steven Sevic, has had a varied career in journalism/media production and information technology. Starting in the 1990s: these two worlds needed each other. Creating websites and 3D graphics led to coding, now C# based, and as lead: Steve can carry most development solo."}