{"id": 422339, "author": "wlodek", "title": "Small-Business Crypto Payments DApp", "url": "https://cardano.ideascale.com/a/dtd/422339-48088", "category": 26595, "amount": 50000, "description": "Small-business owners and vendors are not crypto-savvy they don’t know how to set-up alternative payments using crypto currency’s.\nThere is no an alternative payment method for small businesses.", "f6_no_assessments": 8, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 2122, "q0": "The problem with the proposal is very clear. Small business owners and vendors are not crypto-savvy, they don't know how to set up crypto-alternative payments. There is no alternative payment method for small businesses. So the solution is to create DApp software that will give merchants access to the technology they need to tailor crypto payments to their business. DApp will approach the adaptation of cryptocurrency in real life. This proposal addresses several key issues that are key to this challenge. The “Small Business Crypto Payments DApp” will be executed on top of the Cardano blockchain’s compute layer and thus will spark awareness of the Cardano blockchain. This proposal, if successfully implemented, will help global providers in the developing country community know about the Cardano blockchain's ability to solve problems with payments and increase interaction with the Cardano community. Several challenges and risks have been mentioned and the proponent has an appropriate solution to those challenges.", "q0r": 5, "q1": "This project is planned to be implemented within 5 months and is divided into 3 phases. Each phase is presented very clearly and in detail about the activities that will take place so we have a very overview of the implementation process. The budget requires $50,000, we know what the money will be allocated for, so the investment need is very clear giving us more confidence in the project's budgeting needs. And finally, about the team that implemented the proposal, all the team members have a lot of experience that I think is suitable for successfully implementing this proposal. Each member is introduced to their field of training, experience, and role in the project and attached a link to the member's CV. Therefore, I have a lot of confidence in this team, based on what the proposal provides I am very confident in the feasibility of this project.", "q1r": 5, "q2": "Proponents provide several ways to track project progress:\n- Statistics of the number of application installs, will indicate whether the interest in the project is increasing or decreasing.\n-Measure DApp interest by the number of subscribers and compare these metrics each month.\n-Statistics of the number of transactions per month, which will show the adaptation of Crypto payments by small businesses and vendors.\nIt can be seen that all products offered are specific, providing clear dates so progress can be tracked. However, what is missing from the proposal is to provide a means by which the community can check the number of data generated. So in my opinion, the proponent should prepare reports, at least monthly, with project updates, and share them directly with the community. This will make it easier for the community to track the project's progress.\nThe success of the project is clear, it has been determined from the moment the issue was raised that the DApp project will empower small businesses and willing vendors, with mobile applications easy to use to receive payments for goods and services in cryptocurrencies, as an alternative payment method without additional hardware or software", "q2r": 4, "assessor": "z_assessor_2299", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4495, "q0": "Creating a crypto payment dApp for small businesses, online and brick-and-mortar alike, is almost the \"holy grail\" of cryptocurrency adoption in the mainstream. This proposal claims that this is currently held back by lack of savvy of small merchants, but does not address the elephants in the room: crypto volatility, KYC, taxes, fiat-crypto ramps. There was a dedicated COTI Pay challenge in Fund-7 where a solution for integrating real world payments and the ADA-verse already exists, and many proposals wanted to create plugins, integrate Shopify and other such noble solutions. Unfortunately, none of this matters if the jurisdiction your shop is based in does not recognize crypto as money, the local currency that the shops pays its rent or payroll has huge swings against ADA, there is no stablecoin that merchants would understand and trust, and exchanging between fiat cash accounts and crypto is expensive and complicated.\nI appreciate greatly that the proposer wants to start working on this huge problem, and help bridge the legacy economy and cryptocurrencies, in particular our ADA. This should be done step-by-step with small, credible wins. Simply giving merchants the \"tech\" that they would need to accept crypto is not a huge step in the direction of overcoming the divide. It has been done before, and unfortunately, other parts of the puzzle need to be solved before any value to merchants can be provided by a solution such as the one proposed. ", "q0r": 4, "q1": "The proposer shares the team CVs online, which shows commitment and respect to Project Catalyst. The team seems to be likeable and enthusiastic. I would have loved to see more discussion and milestones about overcoming the problems that have held back crypto adoption by merchants before. Ada has been around for many years, and many merchants are quite savvy at using Apple Pay or AliPay etc. Please think about this issue and try to discuss and solve.\nThe skills presented by the team do not appear to be sufficient to create a crypto-fiat bridge for small merchants wanting to accept ADA in their stores. It may make sense to collaborate with crypto payment experts, and reach out to the community to learn about existing projects to maybe team up. \nThe first milestone of the project is a feasibility study whether Cardano can be used by local merchants, and in my opinion it would have been better to carry this out before submitting the proposal. I would have loved to hear some of the feedback and problems produced by any market research or even interviews, Google forms or anecdotes from friends and family. Overcoming huge price swings, know-your-customer processes, on-and off ramps for local currency and integration of payment solutions like COTI would all require some very specific domain knowledge. \nThe business plan and project outline how to create a mobile app is fairly detailed, and the team have strong backgrounds in mobile app development. The part that would need much more coverage by the timeline and business plan is the crypto integration: how to create wallets for merchants, transfer ada to their bank accounts via foreign exchange platforms, how to consult them about taxes or legal implications, and give them ways to track or manage price volatility.", "q1r": 2, "q2": "The stated goal of this proposal and key performance metric is to achieve adaptation of ada by small-businesses and vendors from developing countries. This would, I suppose, be traceable via app downloads and providing links to use cases. As it is unlikely that the proposal in its current form will produce a minimum viable product (MVP) mobile app that merchants can and will already use to accept ADA, this goal could have been aligned much better with some realistic proof-of-concept character of the project, such as number of merchants listed on the project's website, Zoom meetings with said merchants, transaction volume in ADA, or other goals more appropriate for piloting a completely new concept to the target audience. \nIt is positive that the proposing team is transparent about their identity and ways to be contacted, but without meaningful metrics to evaluate the roll-out of the solution, Project Catalyst is unlikely to gain enough information to keep up to date with progress. ", "q2r": 3, "assessor": "z_assessor_2554", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5652, "q0": "Firstly, I would like to say that the idea of this proposal is great when it tries to solve the payment issue, especially international trade. Additionally, applying the Cardano platform to build this Dapp will create a decentralized environment that securely protects merchants against fraud. I love this idea because the proposer help to increase awareness about blockchain application in solving business problem, not trading cryptocurrencies as most people know.\n\nI think the idea is good in terms of risk forecasting, but it would be better if the proposer showed the strategy to help small businesses join while the legal policies of some countries still do not recognize payments via cryptocurrencies, what would you do if their government does not allow cryptocurrencies payment? Additionally, I would like to understand more insight on their plan to specifically attract small businesses into this Dapp?", "q0r": 4, "q1": "The proposal included 3 phases running in 5 months to complete the Dapp. The proposer describes granularly step-by-step to accomplish the technical portion of the app. With this timeline, the Dapp can be done on time. However, my concern here is that there is no audit phase in the timeline, so it's difficult to prove its safety and reliability, I think the proposer has their thinking sleeves but not showing here. Apart from that, the proposal would be more significant if it had a clear long-term roadmap in the big picture: how it goes into the market, the business model,... Because the detailed plan focus more on technical information.\n\nI think you guys provided clear and detailed information about human resources in their CVs, including images, and relating experiences,...", "q1r": 4, "q2": "There are many ways to measure the progress the proposer indicated in the proposal. I strongly agree and want to add my opinion more because this is a dapp used for payment, so I think KPIs should measure it related to transaction time and smooth user experience. Additionally, to help the Cardano community efficiently audit, I believe the KPIs should have a specific number, like how many small businesses will use this app? Etc", "q2r": 4, "assessor": "z_assessor_2732", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5921, "q0": "This is a useful proposition, it effectively addresses the challenge. This project will benefit Cardano blockchain, adapting the Cardano blockchain for every day use by small business and vendors. This proposal will expose the global vendors in developing countries community to the capability of the Cardano blockchain to solve the problems with payments, and increasing interaction with the Cardano community. The resultant value to Cardano blockchain will be its exposure to the business community as a source of generating small business solutions.", "q0r": 5, "q1": "The team information is very detailed. Your team consists of seasoned members who have all the knowledge and skills to carry out this project. In particular, they have achieved certain achievements: deploying many applications on mobile phones, holding many important positions,... Besides, their CV pages are also listed specifically, I appreciate this, it will help your team become transparent, making it easier for people to trust the team's capabilities.\nA 4-5 month work path is listed, and milestones and tasks identified. The budget allocation part, you did a great job, you allocate the budget specifically, clearly define the number of hours worked, the hourly wage, this helps the budget become a lot more transparent. I appreciate this part.", "q1r": 5, "q2": "Overall, the information provided is quite complete. In addition, I would also like to commend you for identifying the risks, challenges and ways to reduce them. This is one of the necessary conditions for the project to develop sustainably. However, I think you should provide specific metrics to gauge the progress and success of the project. For example, in the first 1 month, there were 30 downloads, 10 transactions,... Having specific numbers makes it easy for people to evaluate and track.\nAnyway, this is your team's first time submitting a proposal, you guys did a great job. This is a potential proposal, I hope it will be implemented in the future. If so, it will certainly bring great value to the Cardano ecosystem. Thank you!", "q2r": 4, "assessor": "z_assessor_2757", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8084, "q0": "To develop blockchain technology, it is necessary to support small businesses to accept payments in cryptocurrency, especially with Cardano.\nWith the fast development of e-commerce, adding a payment method that is electronic money will bring more benefits to users.\nThe proposal described the advantages of providing payments in cryptocurrency; However, it does not provide a solution to overcome its disadvantages such as how to fight frauds and scams, fight criminals used to launder money, the price fluctuation range of cryptocurrencies is very large. , etc.", "q0r": 4, "q1": "The proposal has given milestones for the respective phases.\nThe project's budget is also suggested an acceptable allocation.\nProject team with experienced members is an advantage. However, whether or not they have experience in the field of payment or finance and banking is not clearly described. For payment projects, having someone knowledgeable about payment methods, finance and banking is essential, so I'm a bit concerned about this issue.\nThere is no information on working experience with blockchain technology for payment methods in the proposal.\nAnd as mentioned in the impact section, the proposal does not provide solutions to overcome the disadvantages of electronic payment, which will pose a very high risk to users, making it difficult for them to accept this DApp.", "q1r": 3, "q2": "They only give parameters to measure when the product has launched.\nIt is still possible to track project progress through the milestones they are released. However, the proposal does not provide a way for the community to monitor the progress of the project. I think Proposer must provide more Github information or weekly report for the community to easily monitor and check.", "q2r": 3, "assessor": "z_assessor_2945", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10406, "q0": "The proposal intends to build crypto payments DApp for small business owners and vendors. This Dapp will help them have an alternative payment method in cryptocurrencies. This Dapp will be built on Cardano so it will help Cardano develop more and more. Although the project focuses on small business owners and vendors, it still has the potential to expand further. Furthermore, the Dapp is built on the Cardano blockchain, transactions will become decentralized and transparent.", "q0r": 4, "q1": "Four people on this team are all software developers. The information about them is attached clearly and in detail. Project Manager, Wlodek Sass is an experienced programmer and designer. He has over 17 years of experience in website and mobile application developments. His apps are still live on the App store and Google play. From that, it can be seen that this team has many strengths in developing this project. They divided the roadmap into 3 phases. The whole project will last for 5 months and every work is listed in detail. The total budget required for the project is $50000 and they have a detailed budget breakdown for each job.", "q1r": 5, "q2": "Auditing and evaluating projects is quite easy. The team has listed the following metrics:\n- Number of the app installation will help judge whether the project is in development or not.\n- Through number of the subscribers, we can measure level of interest in our Dapp\n- Finally, we can base on the number of the monthly transactions to measure adaptation of the cryptocurrency payments.\nIn addition, we can visit the website http://payecrypto.com to have more information about the project.\n", "q2r": 5, "assessor": "z_assessor_3183", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 13627, "q0": "In the proposal, the author has made it very clear who will use the product that the proposal creates. Those are small business owners and their partners. Regarding the benefits of the proposal, it helps to reduce the transaction fees that both sellers have to pay to the banking system.\nLike myself, I am paying fees from banks for international payment activities from 1-2.5%. It will be a very large number if the monthly payments are over 100,000 USD with a fee of 1,000 - 2,500 USD.\nIf you look at transactions with ADA, that transaction fee will probably only be a few USD. A number about 500 times lower than the bank side.\nI think this is a potential business model and there are opportunities for new developers. Helps eliminate middlemen and make transactions more transparent and less fee-based. This helps buyers and sellers own more value.\nThis proposal addresses the challenge's requirements very well. This is a potential application to make international traditional purchases more flexible and cheaper. This application will attract traditional business owners who know Cardano and use the Cardano ecosystem more often.\nWhat I just find lacking is the presentation of the proposal on how the application will use which technology to get the data that provides the price for coins like ADA or other Stablecoins. To help accurately update price pairs when users trade.", "q0r": 5, "q1": "In the proposal, the proposed implementation plan is lacking in details. The author is describing the implementation plan in phases. Question here? The period that the author gives is how many months.\nNext, the author needs to provide details about who will perform each of the tasks listed in the period. This allows me and the voters to assess whether team members have the skills and experience to complete all of the tasks to complete the proposal.\nDuring the development process, I found the author did not mention the design of the user interface. But in the cost, it refers to the design cost. Could this be a shortcoming?\nNext, the author does not mention an important cost in developing applications that is the cost of data storage. The author should also add a cost of 10% of the total amount required to hedge against the risk of ADA slippage. This will result in the project not having enough funds to complete the proposal.\nThe author should take a closer look at this supplement of mine.\nFinally, in terms of information about the members, I see that they have a lot of experience in developing centralized applications. But they don't have much experience in developing decentralized applications on blockchain. That would be a huge minus and a big hurdle in completing this proposal. Because if the team members are just now starting to study Cardano and learn smart contract programming on Cardano, this proposal will be delayed or cannot be completed. Worse, bad guys can exploit security holes to get users' money.", "q1r": 3, "q2": "Their KPI evaluation indicators are very complete and do not need to add anything more. The solution is clearly presented and easy to understand.\nThere is a plan to build a public communication channel to update the work results to the community. This is what I appreciate very much about the transparency of the project.\nI only see the cost description and the blueprint being different in the UI design.\nFinally, the point that worries me most about the team's experience programming contracts on Cardano is that there isn't. That makes them not able to measure all the risks that may occur during the implementation of the proposal and may prolong the implementation time. This is a huge minus in this proposal and everything else is fine.\nIf this proposal is successful it has a lot of potential and attracts users from traditional business. So I will favor this recommendation at 4 stars because of its potential instead of 3 stars.", "q2r": 4, "assessor": "z_assessor_3702", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 13796, "q0": "The author argues that the current problem here is that there is no alternative payment method for small businesses. The team proposes to create a solution to create Dapp software that will approach cryptocurrency acceptance in real life. Proposed impact on the challenge posed. Here, the author is aiming to give merchants access to the technology they need to tailor crypto payments to their business. The team has clearly analyzed the problem here, which is that small businesses and vendors have to spend a lot of money on credit and debit card transaction fees. The Dapp solution aims to help them use crypto wallets with low fees, expand the scope of buying and selling, fight fraud and reduce the possibility of chargebacks. The “Small Business Crypto Payments DApp” will be executed on the computing layer of the Cardano blockchain. It also sparks awareness and understanding of the Cardano blockchain that is used by small businesses and vendors every day and will be extended to users when it comes to collecting and paying in crypto. Proposals match the challenge and are described in detail. In addition, there are many risks in the project and solutions have been put in place by the team to reduce risks when the project is implemented.", "q0r": 5, "q1": "The proposal team outlined a very clear and detailed plan for the project. The milestones are established through 3 phases, each phase is divided into specific months and detailed analysis of the work to be done in the project.. With the given roadmap, we know the implementation time. project within 5 months. The proposal will be implemented once funding is received. Next is the budget. The proposal requires a budget of $50,000 and is presented clearly and coherently. The budgets are broken down and allocated to each specific job on a monthly basis, estimated at an hourly rate. Finally, about the team of team members. We know the identity, role of each member, have enough expertise, techniques and experience to perform well every step of the project. At the same time, the author also provides presentation materials about each member and attaches links so that we know more about the history and experiences of the members to which the proposal is presented. Overall, the plan is very good, the budget is transparent and the members are all skilled and experienced people. Proposal is highly feasible.", "q1r": 5, "q2": "The auditability of the proposal is very good. The team provided us with good data to evaluate this section. Starting from the fact that in this topic the team assigned work tasks according to very specific milestones. In this way, we know what work is done and completed according to the schedule that has been set. We know the intended goals and the benefits it will bring to the community and the Cardano ecosystem. We are provided with indicators to measure the progress of the project. And transparently checked on the basis of: App installs (Updates Analytics SDK and Analytics feature adds parameters to URLs); Number of subscribers in the Database; Number of transactions per month ... we have many ways to check what has been presented. In my opinion, the necessary and satisfactory information has been established. Proposal has good auditability.", "q2r": 5, "assessor": "z_assessor_3813", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We create DApp software solution that will give merchants access to tech that they need to adapt crypto currency payments into their business.\nThe DApp will approach adaptation of crypto in real life.", "experience": "We are multidisciplinary team of four professionals with a vast skills, from software engineering, data base and programming with over 15 years of experience in apps development with multiple functionality.\nProject Manager has 17 years’ of experience with mobile apps development."}