{"id": 422465, "author": "jepzapata", "title": "PetLove Social Media & Marketplace", "url": "https://cardano.ideascale.com/a/dtd/422465-48088", "category": 26595, "amount": 90000, "description": "The pandemic resulted to unprecedented movement restrictions in most countries which led people to adopt online pet consultations and shopping. A need to standardize pricing and digitize pet records.", "f6_no_assessments": 7, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 13896, "q0": "This proposal has some connection to the dapps challenge in that the team plans to develop a platform to allow stakeholders in the pet industry in the Philippines to interact. \nBasically, they are looking at combining an ‘amazon’ type ordering site, with ‘google maps’ type reviewing capability, and vet industry specific connections. This marketplace of sorts will support pet owners in the Philippines to care for their animal companions. My concern is that most of this information is easily and readily available to pet owners worldwide already, including great apps and communities for pet sitters, online vet consultations and ordering supplies direct from vendors. As a pet owner who has lived and traveled with my cats through 4 continents I am highly aware of how easy it already is to get verified quality information with a few simple searches. How will the company bring onboard all of these aspects to fill their marketplace with enough data to make it a better place to go than the existing solid, tried and true solutions? One interesting detail that could be a great separate proposal is their idea to digitize pet records. Currently, my cats travel on a paper printed passport with handwritten information and a photo I stuck on myself! Future thinking, worldwide adoption of international digital pet records would be a challenging yet worthwhile proposal for the millions of pets and their owners. However, within the scope of this project it is not explained or defined how they will accomplish this. \nBeyond this initial explanation the proposers struggle to show any key impacts and state ‘we will give more details in the coming days’. Upon checking the comments today, there are no follow up details or information.\nDue to the already existing market solutions, limited sphere of potential users (only pet owners in the Philippines), I rate this proposal 3 stars for impact.\n", "q0r": 3, "q1": "The proposer lists a roadmap with some milestones, however, is not nearly detailed enough to confidently fund this proposal. For example, the first four weeks are listed as user research, strategic partnership and planning, for which $10,000 has been allocated. The rest of the timeline contains only single phrases, or, at most a small list of ideas for whole chunks of time. As noted in the impact section, the proposer has promised ‘a more detailed plan will be provided in the coming days’ however, this is not clearly evident in this proposal and the website they have set up is empty.\nAnother worry is the financial feasibility of the plan. A total of $90,00 has been described within categories such as research, development, marketing and management. Within this they list $20,000 for team fees, is this the salaries of the current 3 employees? Or the money they will spend on hiring outside talent?\nOf some comfort is the transparency in the three main team members, all current employees of ‘Euodoo Technologies’ in the Philippines. They have tech experience and a solid list of companies they have previously worked with, although no specific dapps development is mentioned. However, it does feel like the company specifically wants funding for themselves to create a product, rather than a community development.\nIn addition to the current staff members they list 5-7 positions they would need as additional manpower to complete the project within the 8 month timeline. Not having identified specific needs, staff needed, or the direct funding correlation shows a lack of detail from possibly a rushed proposal.\nGiven the aforementioned concerns I can not confidently see how this project in its current wording is feasible, hence, a 2 star rating for feasibility. \n", "q1r": 2, "q2": "As with the impact and feasibility sections, the auditability information written in the proposal lacks significant detail. Each section has a few sentences then they write ‘A more detailed description will be provided in the coming days’ without that information to be found anywhere in the proposal.\nThey have a few brief solid ideas how they could prove the marketplace effectiveness by collecting analytics of logins, purchases and other interactions, but do not detail how, where and when this information will be collated and published. \nThere is no mention of the company reporting on their development proposal, no mention of a blog, or Github, which is worrying to not be able to see the progress along the way if they achieve Cardano funding success.\nIn particular, there is no mention of an expenditure report or proof of financial records along the way. Who knows what they are spending the money on?\nThese concerns, along with the lack of detail provided lead me to rate this proposal 2 stars for auditability.\n", "q2r": 2, "assessor": "z_assessor_3840", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 2125, "q0": "This proposal provides a fresh but equally interesting idea. The increase in COVID cases has led to more travel restrictions in most countries, according to the proponent, prompting people to register and shop more online than to buy pet supplies in other countries' real stores. Using a blockchain-based pet app with digital payment integration brings pet communities together, builds relationships, and provides pet owners with immediate, comfortable care support at their homes. Using technology and artificial intelligence on mobile phones, allows owners to build a new social network among other pet owners. The solution is to provide a platform called Petlove which is an advanced ecosystem that demonstrates transparency, traceability, and value creation for pets and pet owners by using Cardano Blockchain Technology and NFT to securely deliver resources, to improve the quality of care pets receive and increase the value of the global pet community. With the help of Cardano, Petlove will use a combination of blockchain and NFT smart contracts to organize and store collected information and facilitate personalized data monetization. The problem raised and the intended solution presented in the proposal by the meeting summarize the challenge clearly and logically. The minus point of this section is that the proponent has foreseen some challenges and risks that may be encountered, but has not yet offered appropriate solutions to deal with them.", "q0r": 4, "q1": "The proposed team estimates that this project will be implemented within 8 months, the progress of the project is divided into 7 phases, and each phase is divided into specific periods and activities to be carried out, so in my opinion, the route part looks fine. Next is about the budget, the proposal asks for $90,000 we know the budget will be allocated to expenses such as Research & Development, Application Development, Marketing, Product Management, and Advertising ....in each section there is a certain amount required, however, these sections can be explained in more detail, such as the marketing cost why $20,000? It's a pretty high value, we need to understand exactly what marketing strategy will be used, how to reach the target audience, how long the process will take, and who will be in charge of the publicity? Since the required budget is high value, the more details the better\nFinally, the project team consists of 3 main members: Julius Evan P. Zapata, Alejandro P. Zapata, Giselle P. Bantug, and I was provided with a lot of information about their experience and field of activity, however, information about their role in this project is not provided, nor is it necessary to have a link to the members' profiles, where we can verify the details stated above theirs", "q1r": 3, "q2": "The proponent says that it will track the progress of its Petlove platform using its built-in software to collect data whenever a user takes actions such as logging in, making a purchase, visiting, and summarizing everything on the dashboard. However, this method has no value to the community in assessing progress. Because there aren't any KPIs mentioned we don't know exactly what to expect from the development process for this project. I suggest that the proponent include KPIs and measurable outcomes that can be expected at the end and during the project. in addition, proponents should also prepare reports, at least monthly, with project updates, and share them directly with the community. This will make it easier for the community to track the project's progress.", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5928, "q0": "This is a project with potential. A blockchain based social network platform with AI capability and digital payment processing will allow all stakeholders within the pet industry to network, conduct e-commerce, and digitize records. Petlove platform is a layered solution to a number of challenges in the pet care industry. Petlove's core components architecture are the pet identification system, generalized document storage system and the data marketplace. With the help of Cardano, Petlove will use a combination of blockchain smart contracts and NFT to organize and store collected information and to facilitate personalized data monetization.", "q0r": 5, "q1": "The team provided includes many members, including 3 key members, they have full knowledge, skills, many years of experience. In particular, they have achieved specific successes: holding many important positions, having a high level of education,... However, it would be even better if you provide a link to a profile like linkedin, their facebook, instagram. This will help increase transparency for the team. You mentioned there will be the participation of Senior Developer, System Analyst, SEO and SMO Specialist, Quality Assurance Specialist, and Sales and Marketing Specialist. Their profile and experience also need to be listed, it will help your project more convincing to people.\nA long-term roadmap within 8 months has been provided. The budget portion is also determined. However it's not really specific, I think you should make it more clear by defining the tasks in each time period, thereby breaking down the budget further. For example: specify the number of working hours for application development, hourly wages; List the things that need to be done to market and advertise the product, how much it will be paid for, etc. This will help the budget become transparent. Indicators to measure progress and evaluate success are not really clear, because this is a project with a long-term roadmap (8 months), so the specific listing of progress measurement indicators is necessity. It will make it easier for everyone to track the progress of the project.", "q1r": 3, "q2": "It seems that the information you provided is not really complete. This will make it difficult for anyone to judge the success of this project. In addition to the issues that I mentioned in the previous section (Clear budget, list specific success criteria, add team profile,...), I think you should review some content. stand behind:\nYou provide the link https://www.petlove.com.ph/ but by the time I visit (07/03/2022), I can't access the website, it says \"Security Error\". Sorry if this is my fault.\nI appreciate that you have identified the difficulties and risks that will be encountered. However, it would be great if you listed ways to solve those difficulties and challenges. This will be the fulcrum for the project to develop sustainably.\nIt seems that this is the first fund the team has participated in, so it is inevitable that there will be shortcomings. This is a potential project, it will bring great benefits to everyone, especially to animal lovers like me. I hope in the future the team will add the missing information, to make the project more complete. Let's work together, don't give up! Good luck!", "q2r": 2, "assessor": "z_assessor_2757", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8797, "q0": "Your proposal is new when the pet market has great opportunities and potential for growth. I was apprehensive about the scale of the project when I clicked on this link https://www .petlove.com.ph and error; I'm currently in Vietnam. However, as you have shared, I expect this PetLove social network when it's blockchain-based with AI and processing capabilities. Digital payments will allow all stakeholders in the pet industry to access the web, conduct e-commerce, and digitize records. Cardano and NFT blockchain technology Overall, this proposal is a breath of fresh air that matches the challenge posed.", "q0r": 4, "q1": "\"The plan to complete the project you give is very detailed. However, I realize that it takes up to 5 months to prepare yourself, so you should consider hiring a capable 3rd party. The ability to design applications for the project to deploy soon will be better. Also, the information about the project members is very experienced. Still, please provide me with LinkedIn about them or Which projects the members have done successfully.\nThe information about the costs used for the project you have mentioned is precise, but I do not know on what basis you give it, such as this is a quote from a company, or you have done it. I have found out.\nOverall, I think the project is feasible because your team has many experienced members, but I would love to provide the above information for a better understanding.\"", "q1r": 4, "q2": "\"I find it helpful when you intend to use the built-in software to monitor your PetLove platform progress; I am just concerned that this is already available software, and you need to integrate it. Suitable for the application or need to build.\nI have not seen the specific KPI you have set for this application so that the community can evaluate the project's success.\nAlso, I'd love to have somewhere updated on your project's progress so the community can keep track of your project.\"", "q2r": 3, "assessor": "z_assessor_3004", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9745, "q0": "The proposal directly contributes to the challenge in a positive way, and is a unique idea for bringing a new sector to the Cardano ecosystem. The proposal will aim to directly build an app on top of Cardano, and will utilize different aspects of the blockchain to meet its goals. The pet industry is a very large one, and a project that can find a way to encompass all the different areas that make up the pet industry as a whole will be a great addition to the community. This is a project that has the potential to bring in people who have never even herd of blockchain tech, like grandma and grandpa. A lot of people have pets, and implementing a reward based system will give people a good reason to interact with the app, which in turn is them actually interacting with the blockchain itself.", "q0r": 5, "q1": "The proposal has a good understanding of what it is trying to accomplish. The team seems to have the right perspective that is needed to bring an industry such as pets into the cardano ecosystem. People from all walks of life have pets, and introducing such a diverse group of people to the blockchain is what every app would hope to do. There are challenges to implementing the proposal successfully, but the proposal has a very good understanding of these challenges. The proposal goes the extra effort in informing the reader of issues that could possibly disrupt the project from being fully executed. Most of the issues they gave I found could ultimately be overcome, but the most worrisome to me would be their heavy reliance on 3rd party technology providers and suppliers. ", "q1r": 5, "q2": "The proposal lists a good outline on future goals, and gives a fairly detailed timeline of what can be expected. The timeline is listed in 7 phases that is expected to finish in 32 weeks. The website that is listed is where I would expect to find the most up to date information on the teams progress, but unfortunately the link they provided is to an unsecure website. I would hope the team would fix this issue as it could be a negative factor when tracking the proposal progress. There is a good breakdown of budget allocation with reasonable cost expectations. ", "q2r": 5, "assessor": "z_assessor_3088", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14776, "q0": "The post-pandemic situation entails movement restrictions in most countries. From these limitations, proposers assume that people are gradually turning to online pet shopping and consulting services. This leads to the need to standardize prices and digitize livestock records. Therefore, the team wants to create a platform connecting the pet industry. I think this is a good idea and has the potential to grow the Cardano community when it is successfully implemented.\nThe proposal gave viewers a clear view of the current difficulties. At the same time, the Solution that the proposal offers is quite detailed. The writer of the proposal had to present very specific functions and features of the platform. Moreover, the proposal also indicates the target audience of the project and the impact of the project on these objects. This also shows the project's positive influence on the Cardano ecosystem community. However, to be more appreciated, proposers should add in-depth technical explanations or give case studies as examples.\nProposers should also show content to show what results in their project produces and whether it is consistent with the challenge's KPIs/Key metrics. And after the project is completed and communicated, what results will it achieve? The information in the proposal is quite general. There should be content showing synchronization with the Challenge's key metrics and it must be clear to each part, each stage. If possible, show how the above will directly affect the Cardano ecosystem and expand in the future.\nProposers have anticipated the challenges that will be encountered while implementing the project. These challenges have been anticipated and they will soon have a plan to address them in the future.", "q0r": 4, "q1": "The project is divided into 7 phases. In this section, the proposal also stated the roadmap, milestones of the plan and what the project will deliver at the time of that roadmap or at that milestone. However, this roadmap is just basic and not really detailed. The project needs to have a realistic timeline to complete the given tasks in a reasonable manner. Proposers should also clearly define the locations and number of people needed to carry out the proposed project. The proposal should show a reasonable plan not only in terms of what they will accomplish, but also how it needs to be, and should include more details on technical aspects such as architecture, language, etc. language and technology needed to execute the plan.\nIn general, the budget to complete the project is quite reasonable. However, we need a more detailed budget plan so that the community can easily evaluate based on this plan. The budget should be clearly broken down and bulleted for what activities are being used and should also clearly state the asset categories needed for the project.\nThe project is led by leaders with extensive experience in the field. The knowledge and skills of the people in the team will promise to build a successful project according to the set plan.", "q1r": 4, "q2": "In this section, information and goals to be achieved in the roadmap have been outlined. However, this information needs to be more specific for each timeline of the roadmap. Proposers should also display clear quantitative indicators to track project progress. Please include specific numbers that show the amount of traffic that the project will attract. This makes it easier for the community to track the progress of the project and evaluate its success of the project. The more detailed this information, the more serious it is to pursue the goals that the team has set.\nThe criteria for describing the success of the project were clearly stated. That is the result when the project is completed. These results are completely consistent with the plan set out.", "q2r": 4, "assessor": "z_assessor_4099", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14880, "q0": "The proposal is written clearly that describes a platform to connect people in the pet industry with the purpose to create a community for pet lovers and be an online marketplace by using Cardano Blockchain Technology. The subjects of the platform can be pet owners (rewarded by providing pet information), pet stores, clinics, services providers, doctors. The proposer has provided general information of how the platform take advantage of Cardano to build its core architecture components. There are 5 factors that could affect the project's success are indicated clearly but the writer hasn't provided any method to address them yet.", "q0r": 4, "q1": "The proposer writes project plan including 7 reasonable phases from strategic planning to application development and deployment activities with a clear timeline. The budget is divided for R&D, subscription, marketing, and employment costs. Regarding manpower, the writer mentions 3 experts who have over 20 years of experience in different fields, that expect to lead and deliver the project successfully and some positions they need. However, the proposal doesn't state how many or how can they get the employment for the project.", "q1r": 4, "q2": "The project progress as mentioned is tracked by using a software built to capture all data and crowdsourced reviews to make the platform operate more trustworthily and effectively. The success of the project is described as a decentralized ecosystem based on blockchain technology. They did a great job to align their product with their initial purpose of gathering pet information, create value for pet and provide pet lovers access to pet products and services.  It would be better if the proposer can provide more details about the project’s vision with milestones so that we can be easier to evaluate its auditability.", "q2r": 4, "assessor": "z_assessor_4107", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "A blockchain based social network platform with AI capability and digital payment processing will allow all stakeholders within the pet industry to network, conduct e-commerce, and digitize records.", "experience": "We are a System Integrator startup company offering wide range IT solutions to vast industries in the Philippines. We are a visionary team with 15 years of experience in software development, information technology, product engineering, and operation management."}