{"id": 422419, "author": "nad", "title": "APIs for Private Applications", "url": "https://cardano.ideascale.com/a/dtd/422419-48088", "category": 26595, "amount": 54000, "description": "Building Private Applications using Zero-Knowledge Proof (zk) is getting a lot of traction in other blockchains. There is no easy way to build private (zk) apps for Cardano.", "f6_no_assessments": 10, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 531, "q0": "For people with less knowledge about the subject I would encourage you to start with reading their Hippocrates whitepaper at https://hippocrades.org/hippocrades-whitepaper-v3.pdf \nThe whitepaper will help you get a broader sense of what the proposer(s) already accomplished and where exactly their proposal fits in/what they request funding for.\nWhile the proposal aims to build and provide an publicly available API to build private applications they also are working on their own already working application build for the health sector. This could not only help others develop private applications that will generate zk-proofs build on Cardano using their API but also act an inspiration for the mass to show the potential use cases. Considering the things above I would say this proposal is in line with the challenge.\nAs for the impact I would not immediately think this could have a global impact without knowing the current customer base they already have for their Hippocrates application. I would think the success of the that application could partially define the future success of the API. \n", "q0r": 5, "q1": "The team is well defined and they have given quite a lot of evidence to prove they could be capable of delivering on the promise. \nThe fact that they are planning to use this API for their internal applications give me a little more confidence this will not be a create and forget project.\nLastly, considering the amount of work needed the requested amount does not seem overly excessive.\n", "q1r": 5, "q2": "The auditability of the project should be straight forward and easily to see once the API documentation is published on their website and is available for public use.\nWhat I could not see in the proposal is if the actual code for the API would be opensource or proprietary.\n", "q2r": 4, "assessor": "z_assessor_2105", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 1444, "q0": "This great proposal is within the challenge goal, because I think this implementation will be a need for the Cardano improvement and adoption from end users and developers and it will help many people to increase their participation in real applications and increase transactions volume on blockchain (The healthcare world is a billion dollar industry)\nThe team here is also part of Team Hippocrades which is selected by Cardano in the Ariob Incubator / Iceaddis program in Africa. \nThis proposal is clear and concrete and will contain the original implementation of new APIs, so developers will be encouraged to easily develop private applications without having to learn the nitty gritty of zero-knowledge proof protocols , furthermore the project bridge new platform with other projects from the community to help each other develop, and they are planning.\nThis is an important proposal to attract many new users to the Cardano ecosystem while using healthcare ecosystem, because the applications of zero-knowledge (zk) crypto protocols in the blockchain can be far-reaching and game-changing especially in the fields of privacy and security.\nThe proposal clearly articulates the contest, the problem, the challenge and how it will add value to the Cardano ecosystem and for all of the stakeholders..", "q0r": 5, "q1": "The proposer team is well skilled about the whole context of the project and they has already a healthcare program: https://www.hippocrades.org/.\nThe scope of the solution is well explained (e.g. how the funds will be spent, what features will be implemented, and so on…). \nThe plan for implementation is general and doesn’t offers basic detail into the technical aspects like architecture, language and technologies for the implementation. The proposers doesn’t have also mentioned some potential challenges and how they plan on solving them.\nThe budget requested is completely related on the software development. \nThe team here is also part of Team Hippocrade, with 10+ skilled people involved on core team.", "q1r": 4, "q2": "Success criteria is simple to identify and trace with key metrics to measure the success by tracking the milestone and tangibly verified since we are building an open source repository.\nI think that the successes and metrics are qualitative verifiable and there aren’t quantitative KPIs\nThe proposal offers a very basi timetable to complete the work. The proposer hasn’t considered challenges and risks relevant to a successful adoption.", "q2r": 4, "assessor": "z_assessor_2245", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 3134, "q0": "With the ever increasing awareness of user data privacy, the need for ZK application are needed. This proposal would surely help out companies or individual that wants to build a private app. In turn this would surely increase the adoption rate of Cardano Network. This proposal has 2 variants of the product, a service API base which can be used by virtually any application that calls the service, or a Javascript SDK which is a widely known scripting language that many of us use. Overall I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team consist of a group of experience Software Engineers. They have a working ZK module ready for demo call Nightingale which further gives me the confident that they can execute this project successfully. The budget breakdown is clearly outlined and seems achievable with the given timeline of 6 months. Given their pass track record, I firmly believe they would successfully implement this proposal. With that in mind, I believe it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "Clear milestones and deliverables are provided in this proposal. Progress and deliverables may be track/monitor thru Github. This proposal also includes precise metric to quantify the success of the project. However, would be helpful to include more indicator on the success of the project (example x number of API per month) to determine the success of the project. All in all, I have nothing to add but strongly agree this proposal has given sufficient information regarding the audit progress and success of the project.", "q2r": 5, "assessor": "z_assessor_2403", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 3367, "q0": "Given the information provided in the proposal, I think that this project fully addresses the objectives set in the challenge setting. This proposal intends to make a zero-knowledge (zk) enabled module that is complete with APIs called Know Zero that other developers can use to integrate zk into their services. I like the idea because it allows other developers to integrate zk into their project without having to fully learn the nitty gritty details that are the foundations of zk. This concept is directly in line with the challenge setting because it will allow for the improvement of many DApps and products – when developers can integrate this module into their product, people’s data will be even more secure and private. I think that this proposal falls under the integrations part of the challenge setting DApps, Products, and Integrations. Zk will most likely play a big role in the future of the internet (web 3.0), so I see this proposal having a big impact for many DApps and products in the future. The proposers already built a similar zk module for healthcare, so they do not anticipate any issues or major roadblocks when implementing this proposal. I did not have any issues with the proposal with regards to impact, so I can give it a rating of 5 for impact. (score given: 5) ", "q0r": 5, "q1": "After reading the proposal, I believe that it can be successfully implemented by the proposers. The proposers listed a very solid roadmap that has all of the tasks they will complete over the next six months if they are funded. The first month involves systems analysis and design. Months 2-4 involve developing the backend and front end components. The 5th month involves testing, release of the alpha, and the development of the SDK. In the 6th month, the proposers plan to release the 1.0 version of the module, integrate it to the website, and release the SDK. I think that all of these tasks seem reasonable to complete in the planned time frame. Roughly three months for the bulk of the development definitely makes sense since that is the most important step to get right. \n\nI also have confidence in the team behind this proposal and believe that they can achieve these milestones because they are a part of Team Hippocrades. Not only have they been finalists in a recent Cardano blockchain challenge, but they also have prior experience building zero-knowledge. The core tech team consists of 10 people, but they also have outside experts, advisors, and consultants who they can call on to provide advice when needed. The three leads for this project (Trista, Joff, and Nad) have many years of experience with coding, web development, systems analysis & design, and zero-knowledge cryptography protocols. Based on the many skills listed in the proposal, I think they are fully capable of making this project happen successfully. \n\nThe proposers also had a well-laid out budget. The pay rates were broken down by the role of the person on the team. For example, the project lead will be paid $1,500 a month for 6 months, leading to a total of $9,000. There were also pay rates listed for the two senior backend devs, the two front end devs, and the systems analyst and designer. The overall budget of $54,000 seems reasonable for the scope of this project since it will involve a lot of time and effort from the team. Since this proposal will last 6 months, I think it makes sense to compensate the team accordingly.\n\nSince I did not have any critiques for feasibility, I can give this proposal a score of 5 for feasibility. (score given: 5)\n", "q1r": 5, "q2": "\nBased on the information provided in the proposal, I don't know if there is enough information to audit the success and progress of this project – my opinion could fall either way, and I’ll explain why. The proposers listed some guiding principles for development, such as stable code, simple code, testable code, team velocity, and knowledge sharing as ways to audit success. While these are decent metrics, I feel that they could have included some other KPIs, such as number of integrations made with the software and number of people making use of the software. These metrics would really show the Cardano community that the proposal was successful in building their zk-module for other devs to use. Having some metrics to show the end use of the project is always a good idea, especially since this proposal is for the Cardano community. The proposers did explain that they will keep the community updated via a GitHub page where they will have all tasks and deliverables that are marked as pending, ongoing, or done, so it should be easy to tell if tasks are being completed on time. I think that the GitHub page is a great idea, however, there was no example or link provided to the GitHub page. I assume it was not created yet, but it would have helped me better rate auditability if I could see what the GitHub page would look like. The final outcome of this proposal, according to the proposers, is to have the product deployed on the website (knowzero.org) and have it available for devs to use. Only then will the proposal be completed.\n\nSince this proposal did not have many end-product related KPIs/metrics of success or a link to a GitHub page as an example, it is hard for me to say whether the proposal will be fully auditable. I would need more information to come to a better conclusion. In the future, I would recommend that the proposers add some more specific KPIs related to the final product and also list even just an example of their GitHub page if it isn’t created yet. As a result, I can only give this proposal a score of 3 for auditability. (score given: 3)\n", "q2r": 3, "assessor": "z_assessor_2457", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1}, {"id": 5357, "q0": "The proposal API for private applications is building a zero-knowledge module with APIs. The project is called \"Know Zero\".  The developer can easily build private applications that will generate zk-proofs without knowing Rust language. Zero knowledge (ZK) is a mathematical method to verify things without sharing underlying data which can be a gamechanger in the field of privacy and security. The team will use zk-SNARK-(ZK proof enabled cloud run outside of chain)  on top of other ZK libraries. In addition, the proposer team will provide SDK for Javascipt devs as well so that can focus on building zk apps without having to learn extra languages. The API for private applications proposal is the integration that can be implemented to bring the impactful use cases to Cardano. The developer will be encouraged to develop private apps without having to learn zk protocols and neither Rust language. This will increase private apps, attract users and increase Cardano adoption. The team has experience developing Nightingale which has a zk module built in and hence it should not be no issue for the team to build a zk module with API.", "q0r": 5, "q1": "The total project timeline takes 6 months. It would be great if the team would explain more into tasks list so that the project feasibility  can be measured. The budget breakdown and rate per month are satisfactory although the team could go deeper to number of hours. The team behind this project is Hippocrades who is selected by Cardano in the Ariob Incubator/ Iceaddis program in Africa. The core tech team should add their linkedin or GitHub to provide background of their experience. One of their team member has ZK cryptograhy protocols and should be able to bring this project to reality. Given the familiarity with zk module from Nightingale, good budgeting and reasonable timeline, it is likely that this proposal will be implemented successfully. ", "q1r": 4, "q2": "During the development, they will stick to the task listed on their milestone and cross off once it is done. If delayed, they will bring it up in the weekly meetings. The project will be a success when the API for private application is deployed in its own site at knowzero.org and available for developers to use. Community can check in their Github for pending, ongoing and done on their task lists. The team should have provided GitHub link for this project. Also they should disclose all other proposals in this funding round and previous linked funded proposal. This is so that the community can know if the proposal is likely to be on time as the team have numerous projects in the pipeline.", "q2r": 4, "assessor": "z_assessor_2695", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5926, "q0": "This is a great idea. Currently, the applications of zero-knowledge (zk) crypto protocols in the blockchain are bringing great buzz and huge investments. This project creates a zk-enabled module complete with APIs so any developers can just integrate with the services through these endpoints. This is of great benefit to the developers and the Cardano ecosystem. It will make it easy for developers to build private applications without having to spend time and effort learning the required programming languages ​​and knowledge. In other words, it improves the developer experience, making private app deployment easy and seamless. From there, it helps to increase the number of applications, attract more users to participate, and help the Cardano ecosystem grow. With the above reasons, I believe this project will effectively solve the challenge.", "q0r": 5, "q1": "Team information has been provided. Your team has a lot of knowledge, skills, experience in areas such as: web development, mobile development, healthcare,... . In addition, they also achieved many important achievements: a finalist in theSeedstar - FT x Cardano Blockchain Challenge, built a zero-knowledge module called Nightingale, developed the Healthcare Hub API,... . Those are proof that this is a strong team, they are fully capable of carrying out this project. However, I only found information of 3 members (while you mentioned that the group consists of 10 members). It would be great if you provide more information about the rest of the members. Besides, having their linkedin links is also essential. It makes the above information much more transparent.\nDetailed roadmap (6 months) has been provided. You've identified the to-dos and allotted them to specific timelines. However, I think there should also be a plan for communication and marketing. I think it would be great if you provide some marketing and social media ways (a few best practices suffice). It will help your project reach more people. The budget has been calculated, you have determined how many people will be involved in each job and how much to pay, but I think you should clarify it further. So that everyone can see how the $54000 funds are used transparently. I have a few suggestions that may help you: determine the number of hours worked, hourly wages,... . In addition, additional funding related to marketing and communication should also be added. As for risks and challenges, I feel your confidence, because you have experience in building zk modules for healthcare. This is a very good signal. But besides that, with the 6-month roadmap, I think ADA price volatility will be an unforeseen risk. I also hope you tackle the challenges you've posed. Another plus point of this project is that you are aiming to be self-sufficient, not requiring funding in the following funds, which will help optimize capital from Catalyst.", "q1r": 4, "q2": "In addition to the issues that I mentioned in the previous sections. You have also identified the criteria for evaluating the progress and success of the project. You mentioned that the observation, monitoring, evaluation of progress will be updated on github. However I didn't find any github link (honestly sorry if this is my fault). Besides, it would be great if there were some specific numbers to measure success. I have a few suggestions that might help you: 30 apps for \"APIs for Private Applications\" per month, 50 downloads per month,...\nThe information provided is relatively complete, can be relied on to evaluate the success. I see that you and your team have confidence, experience, and enthusiasm for this project. If implemented successfully, it will certainly bring a positive impact to the developers in particular and the Cardano ecosystem in general. As a developer myself, I feel very excited about this project. Hopefully in the future I will have a chance to try it out. Thank you for this proposal!", "q2r": 4, "assessor": "z_assessor_2757", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8145, "q0": "I see that the proponent raised an important issue, the size of the impact is relatively large not only in the Cardano ecosystem but it affects the entire Blockchain industry. That problem is \"There is no easy way to create zk-apps for Cardano\". While permission blockchain networks have emerged as a means of protecting transaction privacy for organizations from public scrutiny, ZK allows organizations to securely interact with networks public blockchain often benefiting from massive network effects of users around the world, without giving up control of sensitive and proprietary data sets. As a result, ZKP technology is successfully opening up a wide range of institutional use cases for previously inaccessible public blockchain networks, encouraging innovation and creating a global economy more effective.\nThe proposed solution has solved this problem, the method of rigorous reasoning. The solution is to build a zero-knowledge module with APIs so that it is easy to build private applications that will generate zk-proofs and be stored in the Cardano blockchain. The proponent described the solution in great detail, explaining the terms to make it easy for the reader to visualize.\nObviously, this proposal meets the \"Dapps, Products & Integrations\" challenge as it creates a ZK module on the Cardano Blockchain that attracts developers to create more applications, thereby attracting many new users. than.\nAs for the risks, the author says that there aren't any challenges or risks that are foreseen because they have been overcome before when building similar modules. The team that developed Nightingale, has a built-in ZK module, some of which have also been funded in Catalyst. I have an opinion that the application of ZK to a blockchain is still new and one of the challenges facing is the absence of uniform standards, systems and languages. ZK protocols are often based on complex mathematical equations. Therefore, they require a large amount of computing power to operate and compute. This means that it will be difficult for ordinary computers to participate in the transaction validation process. How did the team overcome these limitations, can you explain this problem to me.", "q0r": 5, "q1": "The project has a specific roadmap, timeline and goals but has not been described in detail. For the better, I think that at each stage the author should add more work items to make the plan more detailed.\nThe budget of this proposal represents 0.69% of the total budget for Challenge. This money has been divided into small amounts and to pay the salaries of those who work. Divided into 4 parts corresponding to the salary cost of 4 positions including 1 project leader, 2 back-end senior specialists, 2 user interfaces and 1 system analyst & designer. The author calculated according to the average salary cost of 1 month and the total number of months they worked.\nThe project team is all of the people with a lot of experience and technology capacity, suitable for the purpose of the proposal. The team is also part of Team Hippocrades selected by Cardano in the Ariob/Ipaddis Incubator program in Africa. The team was also a finalist in the Seedstar - FT x Cardano Blockchain Challenge. Some of the team's projects have also been listed by the author and have links attached. The core technology team consists of 10 people. In this proposal, the author has described the complete information of 3 project leaders.", "q1r": 4, "q2": "The author has shown how to monitor the project, but no measurement indicators are available. The community will track the project's tasks, work and progress on Github. It would be better if the author provided more specific metrics that the community needs to pay attention to when tracking the project, so it will be easier to check. In addition to following on Github, I think the team should update information and progress on Twitter, youtube..etc those are communication channels with a large interactive community.\nThe success of the project is determined in 2 aspects: success in development (completed tasks, goals and due dates corresponding to the roadmap outlined by the team) and success as a project. (The APIs for the Private app are implemented on its own website at knowzero.org and are available for developers to use).", "q2r": 3, "assessor": "z_assessor_2956", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10547, "q0": "As the internet grows and is being used for more and more sensitive transactions everyday, privacy is becoming a big concern. Blockchain technology has enabled us to keep anonymity, and explore a new range of possibilities on areas that were otherwise never online, for fear of privacy breaches. I believe this project is extremely important to give people the confidence to explore and innovate the cardano space further, with their identities protected. The system offered, \"zero knowledge proof\" is a very interesting system that answers the challenge of safeguarding privacy perfectly. If successful, I believe this API will help new users get into the cardano space, as well as veteran users develop more dApps that were previously limited for security concerns. ", "q0r": 5, "q1": "The team has already successfully coded and used a ZK system before, and their experience shows that there is no worry to be had on the technical front. They are also established cardano community members, and I believe the application will be popular within the community thanks to that. However, I do believe that in order to attract new users, from both the cardano community and other communities, the team will have to work on a campaign to explain the ZK system, as it is still quite unknown. As the target audience of the application is people who cannot code this themselves, it must be explained in an easy to understand, concise manner so that people know how and why to use it. Overall, I do believe this project will be implemented successfully", "q1r": 4, "q2": "The author offers auditability of progress by having a clear timeline with deliverables, that can be tracked on gitHub. As the majority of the work to be accomplished is coding, this is sufficient for us to track progress. As this is a privacy-protection application, i believe it is wise to not show any metrics such a number of users. The success will be shown by how popular it is in the developer community. I believe this project is easily auditable. ", "q2r": 5, "assessor": "z_assessor_3189", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14590, "q0": "I believe the proposal has an impact on the Cardano ecosystem. The proposal is written adequately and informatively. The proposed solution is to build a zk-enabled module complete with APIs so any developers can just integrate with the services through these endpoints. Devs can just focus on their apps front end development and quickly generate zk-proofs that are also integrated on the Cardano blockchain. This project called “Know Zero” makes building zk apps easy for developers in Cardano by eliminating the hard stuff. No need to learn so much of the intricacies of zk. No need to learn Rust language. The proposal has provided full definitions of the terms related to the project, which are necessary and make it easy for readers to understand. The project concentrates on attracting further more users to their apps, thus increasing more usage of the Cardano blockchain, which is closely aligned to the challenge setting. The team has experience in building a similar module, they overcame the risks before, so there are almost no challenges for them now. The probable challenge is the timeline of activities that will be set. Some allowance should be provided to consider external factors that are outside of the team's control. In this case, I recommend the writer should write about the challenges that the team had overcome before so the voters can understand more. But this is a bonus suggestion, generally I think the proposal is impactful to the ecosystem. ", "q0r": 5, "q1": "The detailed plan is built in months. The activities in each period of time have been listed apparently. However, I highly recommend that the proposal has more description about each activity. A good proposal is one which can not only include the name of activities but also the way to conduct the work. The budget is calculated based on the salary of the people working on the project. The budget is logical with the plan presented above. About the details of the people who will work on the project, the proposal is written to have 10 main members in the team. The team here is a part of Team Hippocrades which is selected by Cardano in the Ariob Incubator / Iceaddis program in Africa. The Hippocrades app has a zk enabled module so the team has a good experience in building zero-knowledge. The team is also a finalist in the recent Seedstar - FT x Cardano Blockchain Challenge. The profile of the core tech team with 3 leaders are provided. With their experience, I believe that they can bring success to the project.", "q1r": 4, "q2": "The proposal gives some principles during development like stable code, simple code, testable code, team velocity, knowledge share. Tasks and deliverables of the Dev Team are placed in GitHub from which they track, monitor, manage activities that are pending, ongoing, and done. Those are good but I recommend the proposer should list the apparent KPIs or key metrics so that the community can based on those to evaluate the project. The success as a project is that the APIs for Private Application is deployed in its own site at knowzero.org and available for developers to use. So that is the final result of the proposal. With Success During Development, I think it is better if there is a more transparent explanation about the tasks. The proposal can give examples or give more information about the task. With each task, the writer should describe how it is when it is done.", "q2r": 3, "assessor": "z_assessor_4073", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14693, "q0": "The proposal is provided detailed information about the Buzz in Zero-Knowledge Proof (zk) project. It also allows for more efficient proofs and less data usage – an important feature in blockchain networks where memory and space are critical to keeping the network alive. The Know Zero, Defi, and Metaverseproject are making building zk apps easy for developers in the Cardano ecosystem. The proposal is aligned with the challenge zk-enabled module complete with APIs to attractive and easy for developers to build zk apps by decreasing, these could also attract furthermore users to their apps, thus increasing more usage of the Cardano blockchain. Using ZK Snarks, ZEXE Protocol, and Javascript SDK that not only can transactions be generated offline and efficiently verified on-chain, and the time needed to verify the transaction is independent of the time required to do the offline computation to which the prover attests. It will help the ecosystem become a professional social network DApp.", "q0r": 5, "q1": "The timeline for your project is around 6 months and has key milestones for each month. a detailed budget breakdown based on 4 steps of the project totaling $54,000 but the funding needs to depend on how it works for the Cardano ecosystem. It is good to have team Hippocrades which is selected by Cardano in the Ariob Incubator / Iceaddis program in Africa. About the allocation of zk enabled apps in Cardano, I appreciate it when your team has professors for positions with extensive knowledge in zero-knowledge.", "q1r": 4, "q2": "I think you could be elaborated on for project KPI communication. For example, provide details on clear quantitative indicators to track project performance such as the number of users, the time to complete which part - what activities, the number of traffic.. and community members at large can keep track of development progress. Make it apparent how the APIs for Private Applications are deployed on their own site at knowzero.org and available for developers to use when this is considered done. I think if you add a short paragraph below each bullet point in your road map it might be better understood.", "q2r": 2, "assessor": "z_assessor_4095", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We will build a zero-knowledge module with APIs. This way, a developer can easily build private applications that will generate zk-proofs which can be saved in Cardano blockchain.", "experience": "We have built a zero-knowledge module called Nightingale for a healthcare platform using Rust. Capitalizing on this experience plus our 5 years highly-focused development work for a API Healthcare Hub, we are very confident in building this zk module with APIs in Cardano."}