{"id": 422408, "author": "mavster04", "title": "Decentralized Health Info Exchange", "url": "https://cardano.ideascale.com/a/dtd/422408-48088", "category": 26595, "amount": 27000, "description": "Health Data is highly sensitive. Challenge is how to make health information shareable & interoperable without compromising security and privacy? Existing solutions have more failures than successes.", "f6_no_assessments": 9, "f6_rating": 4.37037037037037, "videos": [], "media": [], "f6_assessments": [{"id": 1721, "q0": "The proposal fits well with the objectives of the challenge. The problem raised is the difficulty of dealing correctly (respecting people's security and privacy) with health-related data. The proponent then suggests that a Health Information Exchange (HIE) solution be built on top of Cardano's blockchain, they will leverage an already existing infrastructure (Hippocrades) and harness this into cryptographic protocols. The proponent explains that this is not simple, but they already provide some technological solutions necessary to develop the project, as can be seen in the excerpt “Hippocrades offers the complete configuration of health modules and APIs that will be integrated with the proposed HIE. In fact, you've already built a Proof of Concept (POC) for your HIE. However, the team further improved the framework by adding a Medical Records Rights Management and an improved protocol called Hippr (short for Hippocrades Protocol). A separate white paper is written about this.” It would be necessary for users to have their own systems linked to the HIE, for APIs to be built and for all this to be interconnected. Due to technical requirements, HIEs are not so simple to be made, therefore they are not easily found neither in emerging countries nor in those already considered developed. And finally, the excerpt that makes it very clear how this proposal will be beneficial to our ecosystem is “Hippocrades Healthcare offers solutions for clinics, pharmacies, diagnostic centers and doctors (…). Second, these systems are automatically integrated into the intended health exchange platform. Other installations that have their own systems can still integrate via the provided APIs. Once integrated, the potential number of transactions/exchanges (built on top of Cardano) can hugely drive adoption and traction.” For these reasons, the topic deserves top marks in terms of impact.", "q0r": 5, "q1": "The script is ok, my suggestion is that the proponent should detail more about how each activity would be. As we can see from the example of week 1, the activities that are planned after this period of time are: “Definition of team and project goals/objectives + Requirement review + System Architecture Review (Hippocrades is a platform with several modules , use cases, and complexities). How would the team's goal definitions be made, perhaps this would already be interesting to be included in the scope of the proposal, no? Regarding temporality, I don't think there are any problems, because the time intervals are very short, usually involving 2 to 3 weeks per phase; so my only remark would really be about the details of what will be done. About the budget, it's confusing what the \"T\" is: Project Leader (1), 4 months (spread) @ $1.5T/month, $6T + Systems Analyst and Designer, 2 months (spread) @ $ 3T/month, $6T”. It's probably the same as a k (thousand) so I'll consider that in the reviews. The total amount of 27 thousand dollars is divided between very clear and direct, however it would be interesting for us to know some more details, such as how many hours the professionals involved in the project will dedicate to this work, so we would know the value of the work hour of each and we would be better able to assess whether the value is fair or very high. I'm a little worried about the fact that there isn't someone focused on marketing here, in my view it would be important for the project, as we would have more guarantee that the disclosure would be done properly. Regarding the team's presentation, this part is great, we have a lot of information about those involved (for example in the case of Joff: \"has been programming and focusing on web development using JavaScript for the last 9 years (since 2012). Most of his time is spent mastering front-end development using AngularJS, Angular and Vue.js frameworks. He is currently interested in SvelteJS. He is passionate about contributing to the open source community”); it is also well explained how the team is involved with Cardano, giving a lot of confidence. So, the topic is good, needing a few improvements.", "q1r": 4, "q2": "The proponent explains to us some KPIs that will serve to monitor the process, such as: “Testable code (acts as documentation so that changes immediately show errors) + Team Velocity (story points delivered per sprint) + Knowledge sharing ( collaborative meetings and adequate documentation). However, it is not so clear how these partial results would be understood and how the Cardano community would be aware of such updates. How can we observe progress at the end of each phase? How will tasks and deliverables be shared on github, and how often? In my view, the proponent already guides us well in relation to what should be monitored, it just doesn't explain as well how it would be monitored. Finally, in relation to success, this can be understood through the creation of “Modules and resources are listed according to the tasks/activities required and their corresponding due dates to carry out each one” and also by marking “each task performed per module. For overdue items, they are regularly presented in daily meetings and weekly meetings to discuss blockages/issues and what needs to be done to resolve them.” However, the proponent does not focus so much on the results that could be perceived directly in Cardano, as the challenge KPIs would be supported, such as are present in the campaign summary: “Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases + Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products + Increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community”. Therefore, two things are important here - the first would be to understand how the project would affect our ecosystem, directly, through verifiable data; and the second is how all this could be passed on to the community, if there would be a final report that would better detail the success scenario, some presentation at townhall and so on. So, I think the topic is on track, but it needs some adjustments and deepening.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 6736, "q0": "Hippocrades aims to be a decentralized healthcare infrastructure that utilizes, where appropriate, blockchain solutions, zero knowledge proof and decentralization to power a better healthcare infrastructure for the myriad of healthcare stakeholder that need to interact with patients’ data: doctors, clinics, drug stores, hospitals, research centers, etc. \n\nThe proposal mentions that the main platform is completed, since it has been in the making ever since 2016, and right now they are seeking funding only to build the medical records rights protocol and to bring additional improvements to their proof of concept solution, already built on the testnet. \n\nThe healthcare industry is prone to being disrupted by the blockchain technologies, and the use cases are extremely varied: multiple stakeholders involved, all requiring access to different levels of data, makes the industry a perfect candidate for zero knowledge solutions, for instance. There is tremendous potential in the area, and given the advanced stage of this project, five stars are definitely deserved as this is a proposal with an excellent potential for a real world solution built on Cardano. ", "q0r": 5, "q1": "The team behind Hippocrades has been building it since 2016, and right now they have been accepted in the Ariob Incubator, which is excellent news considering that such a program can help participating teams to speed up their development processes and build much more resilient and market-ready products. They have also received funding in Fund 8 in order to onboard developers into their project. We also have available three bios of the core team: Dale, Joff and Nad, but it would have been excellent if these presentations were complemented by social media profiles where one can have a more in-depth look at their background and past experiences. \n\nThe project will take 16 weeks to complete, and is only lightly sketched. For example weeks 6 to 10 are devoted to simply SecureShare backend development, but we have no other additional information as to what this SecureShare actually entails. \n\nThe budget is divided by each resource: a project lead, a system analyst, a backend developer and a QA analyst, with costs ranging from 1.5 to 3k USD/month, for periods of 2 to 4 months. A great addition to the budget would have been an estimation of hours involved or at least a confirmation that those four resources will work full time during that time. What is also not clear is whether the entire development will take place inhouse or if they will employ additional outside resources. \n\nOverall we have a good, but not excellent, case for the project’s feasibility, with more transparency necessary for the team presentation and project details. Four stars.  ", "q1r": 4, "q2": "I am not convinced that the team is doing a very good job at ensuring full auditability. In the section concerning the project tracking, they only offer vague explanations concerning past projects, with only a very brief mentioning of deliverables placed in GitHub. Nevertheless, we do not have any Github link for previous work - and considering that we have an already existing solution - shouldn’t this be the case? Also, where are performance indicators, and the concrete measurement points that track the project from a healthcare perspective? Will we be able to count on boarded patients, medical facilities onboarded, information flows available or cases intermediated? I would have expected much more at this stage, when we are dealing with a returning proposer. \n\nThe overall success is brushed too vaguely. The proposal offers a few explanations about project tracking, but no concrete targets are put on the table. When, where, what exactly should we expect once the project launches? Lacking any concrete milestones to look forward to, I have to maintain a neutral stance and can only offer three stars. ", "q2r": 3, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2124, "q0": "The problem is how health information can be shared and interacted with without compromising security and privacy because medical data is very sensitive. The solution is to leverage the existing Hippocrades Healthcare Infrastructure plus blockchain and zero-knowledge protocols, which can now securely and decentralized healthcare information exchange. whole. Hippocrades provides a comprehensive decentralized healthcare infrastructure and protocol that unlocks interoperability and security challenges between disparate health systems. This allows users - patients, healthcare providers, and medical facilities to manage and check their medical records while still being able to share them in a decentralized health exchange. , private and permissionless. The benefits of Health Information Exchange include improved quality of care, better healthcare delivery, increased safety, elimination of duplicate tests, to reduced healthcare costs. It can be said that the idea of ​​this proposal is very good, the proponent has a clear understanding of what needs to be done for the proposal, there is clarity in the description of the problem and solution presented, and the proposal is suitable. fit the challenge. The decentralized exchange of health information will bring a powerful use case to the Cardano ecosystem and help drive more adoption.", "q0r": 5, "q1": "Regarding the plan, the proponent provides a step-by-step plan for implementation with clear and defined timelines. The proposal's roadmap consists of four months and breaks it down into smaller milestones, at each milestone we know what needs to be done. The budget is also reasonable, $27,000 is requested and allocated straight to the point, and most of the budget required will be paid to the professionals. We know exactly what their salary is and how long their contribution is to this proposal, so this budget is a perfect fit. And finally the project team, this part is very appreciated by me. Team members are very experienced and relevant to the objectives identified in the proposal. The proposal also provides their achievements, which is the best evidence to affirm their competence in this project.", "q1r": 5, "q2": "Unfortunately, the audit is not as convincing as the other two. I feel that the only real proof of success is the finished product. The team uses GitHub as a platform to track project progress They should provide better KPIs within the quantifiable deadline. While it's good that they have their internal module tasks to bookmark, it's more transparent to know these module tasks in the project's account. They should also consider other forms of reporting, online meetings, or biweekly reports to keep the community informed that the project is on track.", "q2r": 3, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2995, "q0": "The project has identified some serious issues facing both developed and developing nations concerning how we interact with our healthcare data. Building a decentralized medical data exchange on the Cardano network will be hugely beneficial as it will connect pharmacies and hospitals. Offering them the possibility to exchange healthcare information electronically from one organization to another among different information systems. Having grown up in a region plagued by poor or total lack of systems that store/share health information and watching people die from misdiagnosis due to a lack of personal medical records, I do see the benefits this will bring.\nHowever, it is unclear if the Hippocrades team intends to make the codes open-sourced so that other devs can build APIs. ", "q0r": 4, "q1": "The links provided by the team on what has already been built from the last Catalyst funding show the team's ability to complete this task. For example; Pharmacy Management System and Integration of Health Infra to Cardano blockchain. The risks identified with the success of the project have been identified and addressed like having extra Devs on standby. Despite the links to their website, app and their details my concern is the is no link to a Github account that shows what has been built code-wise. That said, the project has offered a realistic breakdown of key milestones that appear to be concise but failed to offer the same for their cost. For example; Under cost break down it says project lead 4 months(spread) @ $1.5T/month what does that mean?", "q1r": 4, "q2": "Since the project has been building for 5years and most of the work has already been done it is quite easy for the community to follow up on the progress. Things like the demo of the Hippocrades app and Healthcare API documentation are up to date, and businesses like MyCure offer healthcare management solutions for doctors and clinics. \nMaking Hippocrades more than an app but like an infrastructure that other developers can use to build more healthcare apps and APIs appears to be the direction they're choosing. This is good because more Github Repos and forks is a metrics that show the community finds the Hippocrades work well written.\n", "q2r": 4, "assessor": "z_assessor_2381", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5733, "q0": "I agree about the challenge of sharing sensitive health information that this proposal has pointed out. By adopting decentralized and NFT technologies, this project offers a creative solution to allow the sharing of sensitive health information safely and securely. Therefore, this project meets the spirit of using Cardano technologies to improve current problems and hardships happening worldwide.", "q0r": 5, "q1": "I am assured that this proposal presents a nearly-finished project, and there are several test run cases that affirm the effectiveness of the APIs and system integration. The founding team members has more than demonstrated the determination and relevant knowledge and experience to execute this proposal effectively. I am impressed by the technical aspects of this project. The team understands well what they are doing and what should be done, in terms of technical issues, to finish this app. Both the people and the technology are impressive. The funding asked in this proposal is also reasonable, and I am excited to see the team's future progress presented in the proposals next Funds.", "q1r": 5, "q2": "It is recognizable that the team has put a lot of effort into writing this proposal. Every part of this proposal is written with care, and the team has proved to have a well-thought-out plan to carry out this project. I am totally impressed by the complexity of the budget breakdown, the team's profile, the progress evaluation, and the pseudocode in this plan.", "q2r": 5, "assessor": "z_assessor_2741", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6823, "q0": "The model at which health records are kept and shared among healthcare centres is of questionable quality considering how sensitive health records are/can be. The proposer identify these challenge and intends to provide a solution.\nThe proposed solution is focused on building a healthcare information exchange leveraging on  Zero Knowledge Cryptography made possible by blockchain.", "q0r": 4, "q1": "The team have proven with verifiable links showcasing their ongoing project (Hippocrades) which is a decentralized healthcare infrastructure (currently on testnet) embodying several APIs for easy integration for health centres. These shows how competent the team is.\nAdded to that, i was provided with a well structured roadmap that effectively describe a realistic plan of implementation and that nicely add up as a continuation of their ongoing project. Budget is reasonable and fair, team's information is adequately provided. However, considering the information provided and the team formation and quality of their previous product, i believe the project is highly likely to be implemented successfully. ", "q1r": 4, "q2": "There is a clear, concise and objective roadmap for the project with key expected deliverables, tasks and expected outcome of each and every team member will be updated in github which i believe are great point to monitor progress. Proposer also provides some relevant KPIs as elements that can be used to evaluate success which i also agree to that.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 10407, "q0": "The COVID-19 epidemic has made humanity more aware of the importance of health and health. However, health data is sensitive data. It is difficult to share data between organizations and stakeholders. This proposal will further build a decentralized healthcare infrastructure on Cardano. This decentralized healthcare infrastructure enables safe and secure data sharing based on blockchain. This project is a useful idea that benefits the community, especially the Cardano community.", "q0r": 4, "q1": "The team is building the Hippocrades platform. To continue building this platform, they need $27000. They will use this budget for project lead, system analyst and designer, Backend Senior Developer and QA. The project roadmap will last for 16 weeks. They do list 3 people in the core team but they should attach their profile link for easy tracking by the community.", "q1r": 4, "q2": "They will upload their entire work to GitHub. Besides, they can also visit hippocrades.org for more project updates. Everyone can track the work progress easily. They also have criteria by which to measure the project. However, they should give specific metrics and time to achieve them.", "q2r": 4, "assessor": "z_assessor_3183", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11332, "q0": "The proposer is proposing a decentralized & secure healthcare information exchange (HIE).  The proposer is part of the Hippocrades Team and there is a link to this as well. This link has a working demo for everything the team has already done and is interesting to use this demo and learn what all they already have working.\n\nThe concept of an HIE is very well needed in the world today, and would most certainly bring more people to the cardano blockchain. This would bring doctors as well as patients to the Cardano blockchain.  ", "q0r": 5, "q1": "The teams working demo located at https://hippocrades.org/ shows just how qualified the team itself is, what they have already accomplished, and how easily they could implement the healthcare information exchange, though it will not be an easy task. \n\nThe website is Hippocrades, a decentralized healthcare infrastructure for web 3.0 which still has some work to complete but is well on its way toward that completion and now makes it possible for them to bring about a healthcare information exchange.\n\nThe team has been working on the infrastructure since 2016 and is now a 10 man team. Furthermore it is now part of the Ariob Incubator / Iceaddis program in Africa!\n\nWith the milestones they have laid out, the experience of the team, and the work that has already been completed over the last 6 years, it is very highly feasible that this proposal  will be completed.", "q1r": 5, "q2": "The team has a github page where they track, monitor, manage activities that are pending, ongoing, and done. This github itself can be used for auditability in and of itself.\n\nThey also have a website where the modules are, as well as a demo and many other things. Progress and auditability can be done through this website as well. \n\nOnce it gets to test net, we would also be able to see a working version, then it is simply time to deploy it on main net. I would say, overall this proposal would be highly auditable as all their proposals have been.", "q2r": 5, "assessor": "z_assessor_3237", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14053, "q0": "The proposal very elegantly describes the need for a Health Information Exchange(HIE) system, issues that the current system faces and proposes a solution that leverages the use of blockchain technology to overcome these issues without compromising data privacy, which in their whitepaper they very accurately point out can be an issue with blockchain’s ‘transparent, anyone can see’ setup. \n\nThis is a well-researched and well prepared proposal that will definitely have a positive impact on the Cardano ecosystem after its implementation. ", "q0r": 5, "q1": "The team has already built a proof of concept for the HIE system they are proposing and have prepared two white papers, one that shows the need for the system another that explains their concept called Hippocrades. \n\nThe timeline and the budget breakdown they are proposing is very feasible and reasonable. \n\nThe team has already built a decentralized healthcare infrastructure and the members have impressive accomplishments.\n", "q1r": 5, "q2": "The deliverables of this project will be hosted on Github which makes it easy for the community to track its progress. The only thing lacking in this proposal is clear KPIs that can be used to measure the success. Monitoring success by ticking off each task done per module as suggested by the proposal doesn’t give a chance to quantify the success of the project. ", "q2r": 4, "assessor": "z_assessor_3879", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Capitalizing on the existing Hippocrades Healthcare Infrastructure plus blockchain and zero-knowledge cryptography protocols, a decentralized & secure healthcare information exchange is now possible.", "experience": "We are from the Hippocrades Teamthat has built a decentralized healthcare infrastructure for Cardano. We have been selected in the first batch of the Ariob Incubator / Iceaddis program in Africa which is supported by Cardano for high-potential startups."}