{"id": 422443, "author": "futurefest", "title": "Fiat to NFT Payment Gateway", "url": "https://cardano.ideascale.com/a/dtd/422443-48088", "category": 26595, "amount": 106200, "description": "There is too much friction for the average new user when purchasing their first NFT, which restricts mainstream adoption of Cardano NFTs.", "f6_no_assessments": 7, "f6_rating": 4.238095238095238, "videos": [], "media": [], "f6_assessments": [{"id": 6737, "q0": "Beginning with the problem statement, we find out that “There is too much friction for the average new user when purchasing their first NFT”, but the proposal does not go into the details of explaining what kind of friction it is referring to. Is it perhaps too many counterparties to interact with? Or simply the need for having wallets, or the general uncertainty regarding what NFTs really are? \n\nWell, the value proposition is to create a tool that facilitates the onboarding of new users by using classical payment methods to purchase NFTs. The proposal also mentions that it wishes to create a user experience similar to what Nifty Gateway offers for the Ethereum blockchain. The proposal also embeds a Catalyst Proposal video (high hopes like for the Seedstars proposals!) but it is a rather disappointing experience since it’s simply a video game excerpt with some music in the background - no relation whatsoever with our use case.  \n\nRemember, the purpose of this challenge is to foster the creation of new applications and integrations that can drive adoption further, and having a tool to easily integrate payment methods would definitely help with the user experience, so there is an excellent connection between the proposal and the challenge and definite scalability potential. However, I have subtract one star due to the cumulative effect of an unconvincing problem statement, an introductory video not connected at all with the idea and the desire to create an experience similar to Nifty, which leads me to believe that the team does not have a very high potential for innovation or introducing new features that could help with the adoption of the tool / feature. ", "q0r": 4, "q1": "The team does a very good job at presenting themselves, with biographies for all and linkedin profiles for five out of the six members. They call themselves Future Fest, and most have developer experience, but they will share the building work with Ada Anvil, an external team of Cardano developers. They will also be assisted by Imani Partners with legal and compliance solutions. \n\nThe timeline is very easy to understand, and is divided into four sprints, with an overall deadline of mid October this year. For each sprint we have the responsible team for each feature (Future Fest, Ada Anvil or Imani Partners) although no other information. An excellent addition would have been setting concrete deadlines for each of the sprints, not only for an end of the overall project. \n\nThe budget is simple and easy to understand, with very clear splits. Development would eat half of the budget, 50k USD and take more than 1.000 hours to complete, charged at rates of 40 to 80 USD/hour. Legal costs would be the next major expense with 35k USD, while marketing and the security audit would each cost 10k USD. \n\nThe proposal is definitely feasible, but I feel a few pieces of information are missing about the general value proposition. How do they intend to use the tool, will they aim to have it integrated into existing NFT platforms? Will they develop their own platform and keep it internalized? Will it turn into a white label, off-the-shelf solution? What about financial sustainability, is there a business model behind, do they intend to get paid, and if yes how? Who will be their payment processor partner? What countries do they plan on accepting payments from? Sadly we don’t have details for any of these things.\n\nThere is a decent team behind the proposal, with a clear budget and concrete partnerships. However, given the lack of details regarding how the tool will be used and whether it will be financially viable in the long term, I have to offer only four stars. ", "q1r": 4, "q2": "We have a fair case for auditability but not excellent. The team promises to have a blog post after every milestone hit, and organize an event at the end to allow users to try the service. The team will also track the volumes of NFT purchases. The case for what success will mean for the project is not great, since it contains only rather general statements that can’t really be measured or connected directly to it (more real use cases for Cardano NFTs, driving mainstream adoption, etc.). The proposal also does not mention anything about the use of open source development (that might be true still , we just don’t know). For all these reasons, again, only four stars are appropriate.", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1813, "q0": "This project aims to facilitate the purchase of NFTs by users who may not know anything about blockchain technology. The goal is to facilitate all the steps specific to the blockchain so that for the user this purchase of an NFT is similar to a purchase on a traditional online store. A classic use case is mentioned: the purchase of concert tickets.\nUser story: payment in Fiat, creation of a wallet, NFT minting and transfer to the wallet. In this centralized approach, the keys to the wallet are held by FutureFest, like a centralized exchange.\n\nBy making it easier for novice users to buy NFTs, this project will have a big impact on the adoption of the Cardano blockchain.\n\nThis impact could be greater if this first purchase of NFT opened the door to other more complex uses of the blockchain, such as DeFi. This could be done by offering - as an option - the user to carry out certain steps himself, such as the creation of the wallet, and by presenting the associated advantages and disadvantages.", "q0r": 4, "q1": "This proposal is supported by an experienced team, 6 project developer profiles with a detailed LinkedIN profile, as well as 2 development partners ADA Anvil and Imani Partners. The skills needed for the project are brought together: frontend, backend, dapp, UI/UX. The Project Plan details taks for each parties, and includes a roadmap composed of 4 sprints, each two weeks long.\nThe risk analysis mentions 2 main risks: legal compliance with local laws, and security since the keys to users' wallets would be held centrally. Regarding this last risk, I think that a way to reduce its exposure would be to facilitate and recommend in a second phase of the user journey the transfer of NFTs to a wallet generated by the user. About 10k€ is reserved for a security audit, which gives confidence in the correct mitigation of this risk.\n", "q1r": 5, "q2": "A detailed roadmap is provided in the form of 4 sprints lasting 2 weeks, and within which tasks are detailed and assigned between the FutureFest team and its partners ADA Anvil and Imani Partners. Delivery of a demo is scheduled for October 15, 2022.\n\nThe team provides a detailed view of its costs, which will allow monitoring by the community, in particular the volume of hours for each development activity (eg 400h for DApp, or 80h for UI/UX).\n\nThe auditability elements provided ensure that the progress of the project can be properly monitored.", "q2r": 5, "assessor": "z_assessor_2264", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3136, "q0": "This proposal will definitely change the game of the NFT space. I have been asked countless times by my clients, is there a way that they could buy NFT with fiat. The sad truth is we are still early stage in the blockchain technology and the options are limited, thus this proposal is a good bridge for new users (who are familiar with fiat) to join in the NFT space and familiarizing with the blockchain technologies. The proposal did mentioned that in the future, they would allow integration with other dApps (as right now they plan on integrating into their own platform FutureFest). With this proposal being built on Cardano, this would definitely drive the adoption rate of users to enter the Cardano blockchain, also would spawn more creative developers to built on Cardano in the future with their product being open to share with other dApps. With this information, yes I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposal's details are outlined very clearly. They have beautiful flow charts and images to present their product. Cost breakdown and timeline are clearly listed out as well. The timeline of approximately 1 month could be a little tight, but I have full confidence in the team as the partners listed and the team that are building the product and highly skilled and experience. As mentioned they have a working product (FutureFest) and this further solidified my confidence in them. By far the biggest challenge/risk of this proposal would be regulations. The proposal did mention this risk, but would be better if the team could provide more details regarding the regulation area (i.e KYC of users).  With all this information, it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "As mentioned the proposal provided a very clear and precise milestones and deliverables. Which on their own are very good. To track the progress of each milestone, the team would publish blog post after each milestones has been hit. This is good and all, but I would appreciate if the proposal has more detail on the indicators and KPI (i.e 100 NFT purchases per month) to quantify the success of the project. With all the information given, I have nothing to add but strongly agree this proposal has given sufficient information regarding the audit progress and success of the project.", "q2r": 4, "assessor": "z_assessor_2403", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7201, "q0": "The proposer presents a problem in which adoption of Cardano based NFTs is still a fairly difficult process to manage for new users looking to invest. A solution to this would be to providing an easy entry option that could allow the overall access to projects and dapps launching on the blockchain much less of a hurdle, by implementing a payment gateway on site (https://futurefest.io) to enable credit & debit card payments, supplying the user with a seamless process to obtain NFTs without the knowledge needed to do so in the traditional practices. The solution of fiat payments for NFTs directly is an ongoing concern to Cardano based projects looking to onboard new users without the necessary knowledge to safely create, authorize and manage transactions through a Cardano based wallet. The impact of this proposal based on the amount of interest for such a solution to the problem is a 4, as it is still unclear or certain the solution would reach the targeted audience without further development and community outreach.", "q0r": 4, "q1": "The proposer and the FutureFest team have been very influential throughout 2022 with their own NFT project launching and finding success within the Cardano community as well as establishing numerous amounts of partnerships with other projects and real-world businesses, influencers and mainstream artists i.e: American artist Kaskade & Space Yacht Music Events (https://solo.to/spaceyacht). All members of the FutureFest team can be found within the proposal by clicking on their names for LinkedIn credentials and network connections. The proposer has described a realistic plan and budget to execute the problem's solution within an 8 week timeframe. The main concern within the proposal is that futurefest.io would need to have it's own Treasury of ADA to support a gateway of fiat payments; in turn the user is not in full control of their assets until the transactions are processed and they've received them in their own wallet. For this reason alone, it seems counterintuitive in providing a secure service intended for new users to feel safe & confident to embark on during their first of hopefully many Cardano NFT buying experiences. It would be more helpful if these users are given the option to educate themselves first, perhaps the Marketing campaign could budget for an onsite tutorial on how to create their own Cardano native wallets, before actually purchasing NFTs through the gateway. It would be beneficial to this particular proposal who wishes to focus solely on new users, to allocate more effort towards education to the product and overall engagement with the growing community. The rationale for this proposal in regards to feasibility is a 3 based on the provided information.", "q1r": 3, "q2": "The proposer is lacking a standardizes auditing tool to monitor the progress of such a solution to the presented problem within this proposal. The proposer has stated that blog posts will be made after milestones are completed, yet the internal allocation of funds and accomplishments may not be easily accessible to Project Catalyst and the voters to maintain transparency. It would be wise of the proposer to submit a formal link to similar services such as Github Gitbook to where this information can be viewed if successfully funded. The overall success of this proposal is based on the notion that the solution will enable new users to purchase their first Cardano NFT, subsequently driving more mainstream adoption of Cardano. But the only source of measuring success is the transaction history of the gateway fiat payments, which will need to be audited and in compliance with legal verifiable local regulations. This area of legality is still vaguely determined in the US and other countries involving NFTs and cryptocurrencies; funds allocated to the outlined Legal stage within the budget should suffice this concern. The Auditability rationale for this proposal based on the information given by the proposer is a 3 given the information proposed.", "q2r": 3, "assessor": "z_assessor_2883", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8590, "q0": "The problem statement is clear and concise. According to the proposal, there is too much friction for the average new user when purchasing their first NFT, which restricts mainstream adoption of Cardano NFTs. I like that the proposed team aims to address this problem by creating a system that facilitates the rapid onboarding of new users using familiar payment methods, allowing users to immediately benefit from their NFT purchases. This solution appropriately addressed the problems described. The idea is generally in accordance with some of the challenge's goals, which include promoting Cardano adoption by enabling new users to quickly and easily benefit from the utilities offered by Cardano NFTs. I appreciate how the author discusses this Dapp's features and explains how it will improve the Cardano ecosystem. Aside from that, I thought the idea was good and, given the necessary details, could have a positive impact on both users and our ecosystem.", "q0r": 5, "q1": "Regarding the evaluation of the feasibility, as with the core team members, there is a well-described section outlining the credentials and expertise of each team member, each of whom has extensive experience and a solid reputation in the position they engaged. A thorough development plan is included in the proposal. There are 4 sprints, each of which lasts for 2 weeks. The expected event showcase is presently listed as taking place on October 15, 2022. On the issue of carrying out the project itself, I believed they were excellent in laying out for us what will happen, when, and in what order. There are many, many different activities such as UI/UX designs, automatic wallet creation, frontend for purchase flow and more bureaucratic aspects such as legal compliance, and we can understand how this will all happen chronologically. Given the thorough roadmap and the team's dedication, there is a good chance that confidence will be established that this Dapp will be delivered within the specified time range. Regarding the budget, the team appears to have done a great job; they provide us with a breakdown of the budget into 4 separate components and a justification for the substantial amount of money requested. As nearly half of the budget is destined to the cost of Development, it is really beneficial that out of the $106,200 requested, we know exactly the payment for each role engaging in the project. How much is the hourly rate? How many people in total is included in the budget? How many developers will be assigned to each position, the number of hours they will work, etc. This makes it much easier to carry out the feasibility assessment. Moreover, I believe the hourly rates offered are reasonable when compared to the current market value of expertise. While the budget has positive aspects, the team could have provided more details so that the community can properly assess it. The proposers should explain the expense of Legal in a clear manner, as it required the second largest part of the budget with $35,000, it is crucial to split it into identifiable elements and each presented with an estimation of how much percent of $10,000 will go for. Based on the reasons stated above, I agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal's success is clearly stated, as are the many milestones that will comprise the project. To create this Dapp, the proposer has already anticipated some of the risks involved when dealing with legal issues. They provide a concise but thorough assessment of the aforementioned risk, as well as sensible mitigation suggestions in a thoughtful manner. Although it is impossible to judge them in advance, I believe they are reasonable. The success indicators are also included, which can aid in measuring the proposal's impact, as are the KPIs, which are readily trackable and relevant to the proposal scope, as well as connected with the challenge goals. Correct me if I am wrong, the team promises to post blog posts whenever they hit a milestone but does not mention where they will publish it so I assume it will be on their Youtube and Twitter as this is the friendly-user source of monitoring or auditing the proposal has presented. It is also exciting to see the video of the event at the end of the development from the link attached. All in all, the auditability of this proposal is very high in my opinion.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8715, "q0": "Be aware that a new customer will go through many touchpoints to arrive at a purchase decision, anything that makes them uncomfortable such as cumbersome payment methods can affect their final decision. The main aim of this project is to build an integrated NFT payment gateway on Cardano that allows users to choose the payment method they are most familiar with including fiat or cryptocurrency payments. It is an ideal solution to reduce the difficulty of learning how to pay for cryptocurrencies, which involves many stages and time, enabling potential customers to quickly complete their purchases. My take on this project is that it is closely aligned with the proposed development direction of this Challenge. This payment process NFT in fiat will be a very good incentive for new users to enter the NFT market on Cardano as the payment process is no longer too complicated in the first place. To help users understand how the checkout process will work, besides the description, the proponent also provides us with visual illustrations, I greatly appreciate their effort. Legal and security risks are also clarified and solutions are provided for them.", "q0r": 5, "q1": "Information about the working experience and qualifications of the members are carefully selected and presented so that we can see that their ability is suitable for the main field of this project. In particular, we can clearly know which members will be in charge of which parts of the job/task and whether their respective skills are feasible or not. The proponent also attached the Linkedin profile of members to verify the personnel descriptions. The project development plan is clear and follows the proposed description, two important pieces of information are the phases and the work for each phase has been found. The budget includes the work to be done for the development of the project and is presented as an estimate of hours worked x the current rate of remuneration, which is great for audits and evaluations appropriateness of the given budget requirement.", "q1r": 5, "q2": "Blog posts will be a way that those who love this project can track the progress of the project, the blog is a popular and convenient tool for community monitoring, and I love the proposal which tracking tool is blog. Although the definitions of project success metrics are ideal for measuring success such as the number of users that purchase an NFT using fiat and how many users are successfully able to transfer the NFT to their own wallet. But the lack of concrete estimates/figures and milestones for measuring reduces the value of the indicators given. KPIs should be expressed with specific numbers, for example, 6 months after allowing users to use this payment process, the proponent's estimate of the number of users buying NFT with fiat is x – in where x is a specific number.", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14591, "q0": "I think the solution has an impact on the Cardano ecosystem. The information is adequate and apparent. The proposal concentrates on introducing people into the Cardano ecosystem by creating a smaller barrier to entry with NFT's, events, donations, giveaways, and competitions. Also the project is expected to bring in new people and help the current members of Cardano participate in projects that they may not have known about, or not been able to afford the mint. The project’s objective is to increase the users’ adoption to the Cardano ecosystem, which is closely aligned to the challenge setting. There are two main hindrances that can prevent the project from being successful. The first one is speed due to the fickle nature of creativity. In addition, it can be difficult for the team to set up venues. The writer has had the suitable solution to tackle the problems. ", "q0r": 5, "q1": "I am not sure about the feasibility of the proposal. The plan is not detailed enough to see how and when the proposal is completed. What we have here is “Beginning in July I will look for local musicians and a venue to host, I will also continue creating more characters and NFTs to help on-board and introduce more people to Cardano ''. The proposal only mentions the startdate. There should be an apparent timeline which shows what the activities are finished and when the activities are in process or done. This will make the proposal more clear and feasible. About detailed budget breakdown, the amount of money is aligned to the kinds of activities, it is easy to understand for me. The person who will work on the project at the moment is the writer. He is an artist and project creator on the Cardano blockchain for a year. In order to help achieve this goal, he will look for volunteers to help organize and continue to create on a daily basis until the first event is complete. I think looking for volunteers is a suitable way to help complete the solution. However, until volunteers are recruited, the assessors can’t know who exactly the volunteers are, and how suitable they are, which capability the volunteers have to make the project successful. Therefore, it is better for the proposal to include information about where or how to find the volunteer. This ensures that the resource of the volunteer is qualified, which will make the proposal more convincing and more highly evaluated.", "q1r": 3, "q2": "The proposal has some measurements for the community to follow and assess. They are  the number of users that purchase an NFT using fiat and how many users are successfully able to transfer the NFT to their own wallet. The blog posts that they post will be a way that helps people follow the process easily. The definition of success they build is the more adoption of Cardano NFT by users’ purchasing Cardano NFT, company’s onboarding users to Cardano. The proposal will be more adequate if it contains the information about whether it is a continuation of a previously funded project in Catalyst or an entirely new one. That data will show how serious the team is and how apparent the objectives are. ", "q2r": 4, "assessor": "z_assessor_4073", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We want to create a system that facilitates the rapid onboarding of new users using familiar payment methods, allowing users to immediately benefit from their NFT purchases.", "experience": "The Future Fest team is composed of engineers and product managers with 30 years of combined experience working at Fortune 500 media and finance companies, as well as virtual reality and entertainment startups."}