{"id": 422444, "author": "futurefest", "title": "Metaverse Jobs & Gigs", "url": "https://cardano.ideascale.com/a/dtd/422444-48088", "category": 26595, "amount": 100000, "description": "Players lack strong connections to metaverses, as experiences are superficial and socially shallow. Globally, individuals struggle financially to make ends meet.", "f6_no_assessments": 6, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 73, "q0": "The proposer has described the issue in their Problem Statement: Players lack strong connections to metaverses, as experiences are superficial and socially shallow.\n\nThe proposer's solution is to pay people to act and interact as service providers within the metaverse, initially targeting Performers, Help desk assistants, Mascots and Bartenders.\n\nThe problem statement defines broadly a problem within the challenge which needs to be solved as it is related to building a metaverse and providing payment in crypto to these metaverse workers. Is it difficult to evaluate how big of an impact this app will have and the size of the market. It would have been good to present some numbers on the commercial value of such an app and how many people you would initially target.\n\nThe KPIs indicated in the proposal match the ones indicated in the challenge (app usage numbers, number of users).\n\nIn my opinion, this proposal somehow addresses the challenge but not very effectively, this is why I'll rate impact a 3/5.", "q0r": 3, "q1": "The proposer did not give a clear account of what skill sets will be necessary to deliver on the proposal. The proposer did not present in an identifiable manner, the type and number of team members required to implement the proposal. We know these teams are involved (Future Fest, DevBuddy, ADA Anvil and Imani Partners) and that The Future Fest team is composed of members with 30 years of combined experience working at Fortune 500 companies. This is at the end of the day obscure and not reassuring in regards to the expertise or ability for this team to bring this proposal to completion.\n\nThe budget is outlined clearly, understandable and broken down into identifiable items (dev, legal, Marketing). The budget seems to be reasonable to achieve the set goals. The roadmap and the end product description is however quite unclear. It seems the product is (1) proprietary, (2) designed for the Future Fest metaverse but is marketed here as with future potential use for other metaverses. Is it an app? Is it a smart contract? Is it a website? The proposal doesn't clearly explains technical aspects like architecture, language and technologies if they are crucial for implementation.\nGiven the experience and plan presented, it is not certain that this proposal will be implemented successfully and this is why I rate this proposal a 2 out of 5 in feasibility.", "q1r": 2, "q2": "The proposal provided a roadmap with milestones and a time horizon for achievement.\n\nThe KPIs that define the success of the proposal are presented and make sense ( how many people are using our system to work, total number of attendees and time spent in the metaverse.) This will be tracked using our analytics platform, Mixpanel.\n\nThe community can track the progress of the proposal. The information provided is therefore sufficient to audit the progress and the success of the proposal, this is why I give auditability a 5/5 rating.", "q2r": 5, "assessor": "z_assessor_2040", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 4227, "q0": "The \"Metaverse Jobs & Gigs\" proposal by FutureFest addresses the challenge Dapps, Products & Integration well by enhancing real time players experience. In contrast to their platform, the well known metaverse platforms like decentraland and sandbox are cited as lack of human touch. The proposal will enable people to work in Cardano metaverse and get paid in cryptocurrency. The proposal elevates social interactions of players and its dapp can also attract businesses to build on their platform which will increase utility and Cardano adoption. The proposal has a high potential to scale. The proposer team has considered legal issues as the greatest challenge to deployment of this Metaverse Jobs & Gigs solution. ", "q0r": 5, "q1": "The project will run in sprints (each sprint will run for 2 weeks and the team aims to complete the proposal in 6 sprints. The team has laid out very clear what relevant parties duties are within each sprint. The project's pay rate, number of hour and other breakdown costs are shared in this proposal only in the development phase. There is no breakdown budget for marketing and legal.  The team members are very experienced and some of which come from virtual reality game development and software development. The proposer has provided very detailed background on its members with their respective bio links. If the proposal is successful, they will not seek further funding from project catalyst. ", "q1r": 4, "q2": "The team will keep the community informed via its blog post. The team will publish the blog whenever a major milestone is achieved. Future Fest has set its KPIs by focusing on the social metaverse experience. They will share with the community the number of users and time spent within the metaverse (using MixPanel as the analytics platform). The team aims this Metaverse jobs & gigs service to be adopted by other metaverse projects. The proposal contains sufficient information with relevant milestones for the community to monitor project progress.", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5510, "q0": "Given the swift global adoption of the metaverse by numerous reputable organizations and nations, the demand for a consistent, high-quality consumer experience has significantly risen. Therefore, it is anticipated that applications and goods fulfill a specific standard and provide consumers with an exceptional experience in order to protect the reputation and integrity of the Cardano metaverses. By having real-time players perform mundane activities that are often performed by built-in bot characters, the author suggests that support for these concerns can be increased. As a result, the user experience would be improved and they would want to return. This would increase the general adoption of Cardano by users and businesses creating Cardano Metaverses. Additionally, the author suggests standardizing this approach so that it can be applied to different metaverses and even other chains. The only reason for reducing a point would be the concern with urgency in the need for such a solution when we require much superior issue fixes and other necessary features to be implemented over the chain.", "q0r": 4, "q1": "In their proposal, the team highlighted being very attentive to the timeframe, and it appears that they have thoughtfully planned for it. The team has briefly described the milestones they hope to achieve in the next six months and the readiness of a working prototype. Nearly all of the monies donated are going to the developers, according to the budget breakdown, and all the numbers seem reasonable and encouraging. The team lays up a solid basis going into this funding round by providing the community with all the references to their prior endeavors and how well they have developed. Although I would hesitate to award the team a perfect score due to the ambiguous nature of the milestones and the lack of technical information provided to the audience, nevertheless I have no doubts about their ability to pull this project through.", "q1r": 4, "q2": "The proposer promises the community that they will help with the audit process in any way they can, whether it is through development or deliverables. The usage of open forums and blogs lends their claim more credence and guarantees the production of regular data on their progress, user attendance, and spending that are sufficient to make the audit process painless. The success measures are a more developed subset of the challenge's main metrics and have been carefully crafted. The community may find it helpful to monitor the application and impact of the plan by having access to both quantitative and qualitative measurements. The team made sure to include all parts of their proposal because it was a new one, making it comprehensive. The aspiration to make this tool a way to earn income and also leverage other chains will surely be a success for the Cardano chain as a whole and surely a parameter indicating the project's triumph.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6516, "q0": "The proposal effectively outlines a significant challenge and drawback to \"unmanned\" metaverses as evidenced by the current state of Sandbox and Decentraland. The ability to attract and retain visitors to the metaverse space requires authentic albeit virtual interactions and engagement. The key to creating and extending engagement will be to provide interactions with actual human employees represented by avatars in the metaverse as opposed to NPCs (non-player characters).\n\nThe proposal also emphasizes that these positions must be paid positions and that wages must be fair and reflect the demands of the job. In order for metaverse jobs to be viewed and taken seriously, and in order for the idea of metaverses to take on a degree of legitimacy, efforts must be taken to ensure that those that keep the metaverse \"running\" and provide experiences are compensated fairly and appropriately for their time and skills.\n\nCreating jobs and hiring real people to work within the metaverse represented by avatars should improve engagement and retention of users but also attract those looking to work remotely and virtually from the comforts of their homes. This will open up an entire new industry and potential career path as metaverses evolve.", "q0r": 5, "q1": "Future Fest is an established project in the Cardano community and has experience bringing a big name in the music space like Kaskade into their metaverse space. It is clear that their team understands what it takes to promote their project and create engagement. ADA Anvil is also a well-known dev team in the Cardano space with plenty of experience on a variety of large projects.\n\nI believe a team with their diverse expertise and experience will be able make the right decisions when it comes to seeking proper legal advice - especially surrounding labor laws. I see the legal side of things as one of the most significant areas to focus on as the blockchain/web 3 space evolves. Legal compliancy and advice in the emerging world of web 3 will be keys to the success of not just this project but others as well.", "q1r": 5, "q2": "The proposal covers the major statistical items that should be tracked using their analytical platform Mixpanel. The broad picture is there, but more specific metrics or further details on the items outlined would have clarified things a bit more. This is an especially important factor when it comes to the question of \"what success looks like\" for the proposal. I don't doubt the reliability of the metrics collected - and I think they can be easily collected, documented and audited over time. The validity of those statistics and the meaning attached to them are more of what I'd like to know more about. For example, how many attendees and for how long must they attend to be considered \"successful\"? How many workers employed/roles filled? How would you measure engagement? Is it as simple as time invested on a platform? Are there other metrics that we should be looking at?", "q2r": 4, "assessor": "z_assessor_2820", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9149, "q0": "\"This proposal is from the creators of the first and largest NFT marketplace in the MENA. They are the only platform that offers NFT services in the native language of the region for two primary reasons: To provide a venue for local artists who are unaware of existing marketplaces or believe that existing marketplaces are not suitable for displaying and selling their work; and engage this particular cultural area, a virtually untapped market.\n\tTheir platform is currently available on the Ethereum and Polygon blockchains and now they want to include Cardano in this. This will encourage people who trust their brand to buy and use Cardano, raising knowledge of the currency in the area and boosting adoption, which expands the ecosystem. \nThey tested their MVP in the market fairly early on, gathered data and user feedback, and are now modifying and building their platform in response. People in the MENA region are seeking a solution that enables them to use Cardano in the NFT sector, in their language, and while respecting their culture, so this integration is appropriate for execution at this time. The above will contribute to creating value for Cardano and the wider ecosystem. \nThey say two possible risks:\n One, users don't know which blockchain to choose and the team solve this by framing their marketplace as a cross-platform NFT experience for the users and teaching them through the creation of written and video lessons, participation in events, exhibitions, and panel discussions, as well as through their media channel.\nTwo, customers don't know how to create an e-wallet, which reduces demand for Cardano. The team intends to mitigate this by incorporating Cardano wallets into their automatic non-custodial wallet creation at sign-up, as well as links on the homepage and tutorial videos on how to set up a Cardano wallet.\n\"", "q0r": 5, "q1": "\"They have the great advantage of not having to create the entire market from scratch. So their plan has 3 main components with timelines and specific tasks. In each component they also clearly state what positions are needed to complete these milestones. Along with that is a very clear list of costs, time, and salary for each job position in each main component.\n\nTheir team has already launched the first NFT marketplace in MENA on Polygon and Ethereum so their experience is enough to make this project possible. They also have links provided to verify the experiences described in the proposal that show their level of credibility.\n\"", "q1r": 5, "q2": "\"They will publish public blog posts whenever a milestone is reached, and users can test out the features that are introduced.\n        They will measure the success of a project based on the number of people using their system to work during an event, the number of attendees, and the time spent in the respective Metaverse.\n        In my opinion, the team can give a quantitative figure that the project wants to achieve so that the milestones can be more specific.\n\"", "q2r": 4, "assessor": "z_assessor_3023", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14869, "q0": "The team has done a pretty good job at expressing what they want to achieve through their proposal. They have given very detailed points with delicate examples to make their points clearer to the readers, along with a diagram to back up their goal. And by that, it does a good job at persuading. That being said, it is apparent that the latter two answers to the latter two questions are weaker than the first. This is a very minor comment, though, as they are still done well enough for the readers to see their vision. In general, this is a nicely done part that marks a good start.", "q0r": 5, "q1": "This part is also well done by the team. The roadmap has provided all of the milestones that covers all of the basic stages of development, while also showing careful and steady steps the team makes. It is not recommended to use abbreviations, though, as it can confuse the readers. The budget breakdown is exhaustive, and goes into detail how much goes to which particular position, although the parts are not focused evenly. The member breakdown is great. The background of each member of the team is given mostly comprehensively, and the links are put naturally without making the proposal polluted. Overall, a part that is expressed delicately, with small hiccups which the team could address to make it even better.", "q1r": 4, "q2": "Although the length is relatively short, the team is still able to show their resolve and dedication by how they expressed themselves in this part of the proposal. Even then, the team still needs to show more than just one or two methods to track their progress. But other than that, it is commendable how open they are to the public regarding their project. They could derive a more direct wording regarding their success indication part, but they did overall excellently.", "q2r": 4, "assessor": "z_assessor_4106", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Unlike NPCs, real humans can react to players in real time and enhance the overall experience. We will build the infrastructure to enable people to work in Cardano metaverses and get paid in crypto.", "experience": "The Future Fest team is composed of engineers and product managers with 30 years of combined experience working at Fortune 500 media and finance companies, as well as virtual reality and entertainment startups. "}