{"id": 422518, "author": "this.tent", "title": "Distributed Idea Management System", "url": "https://cardano.ideascale.com/a/dtd/422518-48088", "category": 26595, "amount": 12480, "description": "Finding gaps that you can fill in the Cardano idea space is a difficult process. Current methods favor competition over collaboration. Current solutions aren't Cardano-focused or free and open source.", "f6_no_assessments": 8, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 3490, "q0": "This is a simple (in terms of outcome) but a potential powerful idea that can help Cardano community to understand what is going in a idea pipeline level, increase collaboration and avoid re-work. Having a visual map of everything that is being worked on and their interaction could benefit the ecosystem a lot. Moreover, proposal is aligned with challenge as it delivers a product that will be built on Cardano ecosystem and addresses challenge kpi of \"Increase the number of integrations that bring existing solutions together for a more seamless and connected experience between different products.\"\nAs for the proposal itself, proposer does a nice job explaining the product value proposition for various stakeholders, the step by step on how the platform will be built, expected outcomes and pre-defined target audience.\nRisk management part is also well done with mitigation strategy very clearly stated and focused on community contributition and feedback and in improving UI/UX to have a bigger adoption.\nAs a further suggestions, one thing that could be added to proposal is how proposer intends to communicate the community about the tool so it can have a faster adoption.\nI'd also consider adopting an agile framework  (prorably Scrum) for this project, as it related to software /web development and feedback and quick response to change are essential.\nAll in all, it is a very well strucutred proposal and the final product does make sense to our ecosystem. My rate is 5.", "q0r": 5, "q1": "As for the plan, there's a solid timeline in place broken down by phases and months. The acitvities in each phase are avialable with a a deep level of details in the impact section and tells exactly how the work will be performed. \nBudget breakdown is fair and based solely in paying the full time work of proposer. The amount of time required is provided also with good level of detail.\nThe project will be developed mostly by one person (proposer himself). His capabilities are based on distribuited system and functional programming, which are key for this project. However, more information could be provided in relation to his past experiences and what is its current works in Cardano so far. Linkedin links could be provided also. Therefore, my rate is 4. ", "q1r": 4, "q2": "For the auditability of this project, all the code will be opensource and available in github. Moreover, the tool itself will also be avilable for the community to use it and improve.\nProposer also considers a lot here the feedback from community as a way to measure quality and success, and enhance the tool if necessary, which is excellent. \nAs metrics, it could be considered to include some kpis related to the usage of thetool. A final report telling how project was developed would also be welcomed. If an agile framework is adopted here, sprint reports and product baclkog could also be communicated.\nHowever, I think proposer suggests enough elements to evaluate project implementation and success and my rate is 5.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5960, "q0": "Distributed Idea Management System is resubmitted from Fund-8, and looks like a very promising project that has been tweaked with further improvement. It attempts to provide a collaborative tool for open source without a strict format or high data storage needs. The USP of the tool would be in the ability for collaborators to map in a tree-like structure any relationships within a project, organization etc that are important to the user.  Thereby it falls firmly under the category of open source products that will boost productivity and drive user growth, and is a good fit for Dapps, Products and Integration as it matches the ethos and \"possible directions\" of the challenge setting.\n\nThe uniqueness of the solution is that it could be used in almost any way that the users can think up, making it a fresh and unique alternative to the rigid structures provided by existing mapping and project management or collaboration tools. This idea is highly likely to be impactful for the open source ecosystem and future development, but also has high potential to benefit the dapps and user growth of Cardano positively.", "q0r": 5, "q1": "This proposal would be realized in the relatively niche Poplar language and other choices may have been better to cater to open source improvement, but I trust that the proposer had good reasons for the choice. The team seems to be very passionate about the project and have provided an extremely detailed discussion of the roadmap and possible risks to this project. The timeline has been improved greatly compared to the previous submission to Catalyst, and successful implementation looks very likely if the project is funded. The budget is realistic and modest, and the ideas that went into the proposal seem to have gone through several iterations already to arrive at the current level, which is quite mature for any proposal pre-funding.", "q1r": 5, "q2": "This proposal now has its Github link that I think was missing in Fund-8, and this is a good step to involve the community more and share the progress of the project.\nI would recommend to the team to make more use of social, like maybe a Telegram group or Twitter of the project and a website, as the proposal is quite lengthy and it could be difficult to judge how much of the progress is down to enthusiasm and how much is founded in actual, shareable content and deliverables. Definitions of success may have been more concrete than \"it works well\" but I think at the current stage of the development and given the modest budget this is acceptable.\nThe detailed discussion of risks and risk mitigation works in the proposer's favor and I agree that the progress of the proposal is likely to be communicated clearly in the spirit of open source and as a direct result of the love the team has for their project, which comes across very clearly in this proposal.\n", "q2r": 4, "assessor": "z_assessor_2761", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6489, "q0": "Project Catalyst is one of the greatest ways that Cardano community members can come together and participate in a decentralized blockchain experience. From proposers to assessors to voters. They all play a role in this process. The problem suggested in this proposal is that there are gaps in the idea space of catalyst. In the proposed plan there are specific details that describe everything that this proposal plans to accomplish. By creating the Distributed Idea Management System (DIMS), users will be able to share their unique perspective and will be able to participate in this open-source, web-based tool. Tools being built on the Cardano ecosystem are very important right now. It allows for more people to be able to participate and learn on the blockchain. Especially a tool that can improve Project Catalyst. This has the opportunity to benefit a large amount of Cardano users by allowing them to share their thoughts and to use (DIMS) to share their ideas. For these reasons, I give this section 4 out of 5 stars.", "q0r": 4, "q1": "When looking into the potential success of a proposal. It is important to include information on the individual or team behind the proposal. In this case, there is a brief explanation on the individual behind the proposal. The proposal provides the experience of the individual and also includes the github for others to monitor the open-source code. I would suggest including a LinkedIn profile or another form of verification. This is because the identity behind the proposer is important in the funding process. The community should know who they will be holding accountable. There is a detailed plan that is split up into 6 months. I would like to see more information included in this section of the proposal that gives more details on how the funds will specifically allow for the proposed idea to be completed. Although it is true that these funds will be provided to pay for the proposer. I would suggest including how these funds will allow the project to be completed. Same goes for the budget breakdown. There is information that suggests where the funds will be allocated. I do appreciate that the proposer is only asking for $12/hr. This shows that the project is more important to the user than funds. The only suggestion I would include is somewhere in the proposal to include how there will be a community behind this project and who will directly benefit from using the distributed idea management system. For these reasons, I give this section of the proposal 4 out of 5 stars. There can still be more specific details included.", "q1r": 4, "q2": "As stated above, there is a lot of information included in this proposal. There is a decent amount of specific information. There can still be more information included on the team members behind the project and also in the detailed budget breakdown. This is because there are a couple factors that are very important when auditing the potential success of a proposal. One of these principles is the idea of accountability. Every proposal should provide enough specific information that they can be held accountable for the completion of their proposed idea. Typically, this is most effective when there is a loyal community behind the project. Or in this case, a group of people that would benefit from the distributed idea management system. The proposal can include information on how they plan to do this and grow a community. This will come from the team being transparent and promoting their proposal through social media and other methods. For these reasons, I give this section of the proposal 4 out of 5 stars. I believe that this project will likely be successful if these things are implemented. I would consider improving upon the areas suggested in this assessment. It is a great idea and can bring lots of utility to the Cardano ecosystem. Just needs a strong community behind it. ", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6899, "q0": "-\tA Distributed Idea Management system, targetting the Cardano ecosystem can definitely help improve the onboarding, quality of engagement, collaboration, community spirit among Cardano enthusiasts\n-\tThe proposal may be a low cost proposal, but promises to deliver immense value to the Cardano ecosystem and is a real world application of knowledge graphs. \n-\tIt has the potential to scale as a network, community and even include AI features going forward which may include recommendation systems, automatic classification , tagging and rating systems\n-\tIt is therefore fitting for this challenge and I look forward to using it.\n", "q0r": 5, "q1": "-\tThe timeline, budget and human resources allocation to the proposal seem adequate for releasing a first beta version over 6 months, given the proposer has prior experience in the field and has deep knowledge of the Cardano ecosystem\n-\tSome suggestions that may benefit the proposal in the longer term and the kind of value that could be derived from the solution : \no\tAs an open source product, and open community consider an incentivization mechanism beyong tipping to generate community engagement and adoption. \no\tConsider including commonly used ideation techniques like mindmapping, business model canvas (https://www.strategyzer.com/canvas/business-model-canvas) , value proposition design (https://www.strategyzer.com/canvas/value-proposition-canvas), jobs to be done (https://jobs-to-be-done.com/) to help proposers build quality proposals in the ideation phase, that could be standardized using such techniques\no\tConsider using AI based recommendation systems, classification systems to help users navigate their ideas and connect them with other proposals/project in the Cardano ecosystem (this could leverage data from Cardanocube for instance )\nAs an example, the current proposal could build synergies with some other similar proposals in Fund9 and therefore benefit from each other, or create a better product by combining teams, resources. Some are listed here for reference : \no\tEcosystem Map-Community Wayfinding \n\thttps://cardano.ideascale.com/c/idea/422976\no\tDecentralized Social Intelligence\n\thttps://cardano.ideascale.com/c/idea/422219\no\tDevelopers Reward program\n\thttps://cardano.ideascale.com/c/idea/421555\no\tOpen-Source DAO Framework\n\thttps://cardano.ideascale.com/c/idea/423032\no\tDeveloper Ecosystem - The Evolution\n\thttps://cardano.ideascale.com/c/idea/422540\no\tProposals Mentors Marketplace – 2\n\thttps://cardano.ideascale.com/c/idea/421502\n", "q1r": 4, "q2": "-\tThe proposal is clear on the scope of MVP to build an idea management system for individuals and groups for managing the ideation process for Catalyst\n-\tGiven that this is an early design, having some indicators for feedback collection eg : number of users using it, number of interviews, ( groups, individuals) , feature requests using a user-voice mechanism , could be useful to gauge how well the MVP is being received and the potential for growing it into a mature product\n-\t\n", "q2r": 4, "assessor": "z_assessor_2845", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7881, "q0": "The common kind of proposals we are seeing this time around is repeated topics or augments of the previous round projects. The projects developed in the ecosystem are becoming localized more and more and we have seen multiple versions or instances of applications developed that basically solve a similar issue. The community is finding it hard to keep track of this data to allow collaborations instead of funding another copy of the already existing project. A dedicated knowledge management system is a probable solution for this issue. It is true that there are many such systems readily available, but nothing that is Cardano-oriented. So, the implementation of this proposal should quench that thirst and could drive a lot of collaborative work across the chain. This should eliminate the need for multiple localized solutions and maybe allow users to tweak the existing projects/libraries for their needs instead of creating an entirely new one. This could also result in amends to original projects in turn making them stronger and more powerful for the community to use. Hence, the repercussions of the proposal could be enriching.", "q0r": 5, "q1": "Talking about the feasibility of this proposal, one can see the extensive amount of research done by the team in accordance with the proposal and the author has beautifully laid a plan to overcome the loopholes identified in those findings. The author proposes a timeline of 6 months in total to achieve the milestones he mentions and also specifies that he would work on additional features after that. Also, the budget is very minimal considering the amount of work involved in the project and the fact that he lives in Malawi and uses that to not overstate the costs must be appreciated. However, the team looks frail considering it's just the author couple working on it and with no previous venture details, it is quite hard to estimate the capabilities of the duo and their collective expertise. Nevertheless, the budget being very small compared to the kind of tool the ecosystem would be getting at the end of the project, the community can take a shot with the proposer and fund it. Hence, I score a 4 out of 5 for feasibility.", "q1r": 4, "q2": "Coming to the auditability metrics of the proposal, the author has done a pretty good job in provisioning the community with plausible metrics. The open-source nature of the project makes it easy for the community to track the progress effectively. The regular commits to Git and the hosted working UI would be a great way to analyze the capabilities of the project along with its completion. The author also mentions hosting breakout rooms after Townhall meetings to provide an update of the proposal and also give a demo and get feedback from the attendees. This shows that the author is passionate and is ready to assist and get assisted to/from the community. The success metrics are also cautiously defined and look promising, however, they seem like an understatement considering the gravity of the proposal. The author might have to plan a little on persuading the community to use the tool and then measure the success with the number of interactions the tool has over a period of time instead of just hoping it would be used by members for personal and group use. However, the auditing metrics are commendable and hence I score a 4 out of 5 for this section.", "q2r": 4, "assessor": "z_assessor_2930", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9947, "q0": "The proposal is about facilitating knowledge contributions from individuals to form collective intelligence. Finding information quickly and decreasing unnecessary redundancies make more efficient use of time. Communities such as Catalyst may become more functional and efficient. Also, incentivizing contributions has potential to play a large role. Ultimately, a creation of any note or link could be presentable as an Action NFT and as the importance of that contribution may change, so do the value of the Action.\n\nIn the past, it has usually been companies (or some other hierarchical structure) which have organized goal oriented knowledge sharing between people. Now we have market based structures to facilitate the knowledge sharing directly between people and do it in an organic bottom up manner, from local to global. Collaboration is managed peer to peer in a decentralized way. An individual can freely participate with any knowledge one has and get compensated for the value created. \n\nI am also really excited about the possibility of being able to connect knowledge graphs of AI cognitions to personal knowledge graphs of humans. Individual humans would consciously contribute to these shared cognitive systems. \n\nAs said, there are many opportunities for individuals and communities to use this kind of system directly as well as many opportunities for existing applications and knowledge bases to integrate and evolve. The proposal addresses the challenge beautifully.\n", "q0r": 5, "q1": "There are given many visions and ideas for the product's future. The proposer clearly separates the scope of this proposal. The roadmap regarding this part is logical and detailed enough for me to understand the plan well. Work is already going on. Accordingly, the budget breakdown is detailed, the amount asked is very reasonable and follow-up funding after the six month timeline will not be needed to finish the MVP. \n\nThe proposer has been in Cardano ecosystem for a long time and he has the technical capabilities required to work successfully on this project. The only risk worth mentioning I see is the key personnel risk but because this is an open source project with an understandable vision and clear path forward, it mitigates much of the risk. I conclude this proposal to be highly feasible. \n", "q1r": 5, "q2": "This is a completely open source project. The development work is freely available on GitHub. The proposer plans to host breakout rooms, which provides opportunities for feedback and discussion. I find it very beneficial to have a lot of involvement and interest from the community to test and direct the project in the desired direction with the proposer. \n\nThe post MVP success is defined mostly as perceived use and utility (especially to Catalyst) as well as continuation of the work with new functionalities. Not direct quantitative KPIs are listed but for example the number of users (knowledge contributors) and the number of developers carrying the platform forward are quite natural observable metrics.\n", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12791, "q0": "The idea of the proposal is to create an ideamanagementtool. Basically it´s a space where ideas can be visualized, shared and creators can collaborate. \nEvery cryptoproject can only grow as far as the ideas lead the users and creators. This project is a tool to create better, more competent and more thought through projects in the future by showing the creators where they are, with whom they could collaborate and to use ideas from other people to improve their own project. \nMany ideas were refined and many founders have found new teammembers in the comment section in Project Catalyst. This project has the chance to improve this benefit by making the process easier to follow and understand. \nBy this the project matches the criteria of the challenge strongly because it could lead to the development of many and of better new applications. ", "q0r": 5, "q1": "The team consists of the developer and an administrator. There is no CV of the developer but he linked the basics of the website and a github account with the open source code. The current website is more like the bare bones but the equations and code look good, therefore I conclude that the programmer is able to implement the project. \nThe budget is very reasonable. It´s just the monthly pay of the developer. \nThe timeline describes exactly when the developer reaches another point. The developmenttime is reasonable and it looks good overall. \nThe developer has thought about several risks and found several solutions for each of them. ", "q1r": 5, "q2": "This is an open-source project so the code will be openly visible on GitHub. \nThere are several metrics that define the success of the project but you could have added some KPIs which trach the users and user interactions. Please add them next time if they match the goals. \nThe roadmap overall is clear and this is a project that can stand alone.\nAnd the proposal clearly addressed the stated problem and can help to solve it. \nI remove one star because the relevant KPIs are missing. They are in this case very important because the project lives from user interaction ", "q2r": 4, "assessor": "z_assessor_3472", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14426, "q0": "From what I understand, the proposal is promoting an idea of a space where everyone's ideas can be analyzed to find a common idea (like an idea management system). According to the benefits of the project presented by the proposer, I think this proposal aligns with the challenge in terms of improving the quality and quantity of the ideas that are contributed to the Cardano ecosystem. In addition, this idea also has a lot of other benefits such as being able to see how the community's ideas evolve over time, anyone can express a new aspect of the idea without effect others' workflow, etc. The proposer’s presentation style is very good in my opinion. He divided his ideas into many parts and writes into separate lines that are easy to read and capture information.", "q0r": 5, "q1": "\"The timeframe to complete the project was clearly defined as 6 months. And specific timelines for each phase are also mentioned. This is a one-person project (the proponent will do the main code duties and his wife will assist with the administrative tasks) so the budget is a straightforward calculation to come up with the salary cost for 26 working weeks. He described his way of work and I think it is really nice, but I think he should provide more about his project's relevant experience to gain more credit in the part. I understand that he mentioned that information above (The summary part) so it is still fine for me if he is not repeated it.\nIn short, I think this part is good. It is short but still provides enough clear information.\"", "q1r": 4, "q2": "The proponent uses Github as the source to make this project's code public. e also puts his UI example on a host, so anyone can see it. But in my opinion, in this part, the author should provide specific quantitative metrics for the project (and if the success picture is also quantified, it will be better). For example, how many users need to be attracted to the project to be considered successful? Or how is the UI considered intuitive? How much feedback is needed to evaluate the development potential of the project? If it can be pointed out, the proposal will be better", "q2r": 4, "assessor": "z_assessor_4045", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "DIMS will be a decentralized, open source, CLI and web-based tool to help people build shared knowledge graphs. Highlighting overlaps in what people are working on will make collaboration easier.", "experience": "15+ years of studying distributed systems and functional programming. A strong background in Physics and Biology, which respectively provide clues into the constraints and possibilities involved in building highly scalable, collaborative systems."}