{"id": 422542, "author": "mosiesburgina", "title": "Help The Poor Come Aboard!", "url": "https://cardano.ideascale.com/a/dtd/422542-48088", "category": 26595, "amount": 15000, "description": "There are not enough IRL and virtual cross community events for people with little to NO ADA to enter; on-boarding has become aimed at riches over showcasing Cardano.", "f6_no_assessments": 6, "f6_rating": 2.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 1321, "q0": "The problem identified by the proposer is that no so many IRL (in real life) event nor virtual event are focused on rich people and therefore he proposes a solution – that he will be on onboarding poor. Well, just from this statement I am slightly unsure if the proposer is aware that the long-term Cardano mission is to focus on Africa – actually a continent full of poor people. At the same time, there is no supporting evidence or any information that Cardano is focusing on rich people, and just checking the price itself, also NFT market, it is obvious that comparing to other blockchains, I would freely announce that cardano is for everyone. Today, tomorrow, even yesterday. At the same time – how do you onboard people who are having no to little money? Do we actually feel that bringing people who are having their life financially “ruined” is a good starting point? What will happen if you give them donation or a giveaway? Do they somehow become part of the community, or they will just cash out? I think a supporting thesis for “what will happen afterward” is required, but if considering the content of the proposal – I do not think we are able to on board poor by giving them anything for free. At the same time, the proposal is lacking a logical relation – 1. Aim is to bring new poor people into cardano, and introduce/participate in projects they might be not aware of, or were not able to afford the mint 2. Proposer asks for tablet so he can create more art….I am sorry, but there is many things that seems unrelated, or more explanation should have been provided. ", "q0r": 1, "q1": "The roadmap is missing in the proposal and the budget is too high, containing not really relevant items, such as funds for tablet, rent, travel, another rent etc. Regarding the proposer himself, he  states, that he has 10+ years in entertaining industry. To check the twitch, the last stream was 7 months ago, for 6 minutes with 38 views. So…I do not think credibility is high. The proposer is able to draw some drawings, he can stream on twitch, but I doubt he can deliver the product. There are no other links to support anything he would like to accomplish. ", "q1r": 1, "q2": "The problem solution is unclear and it will be hard to measure progress or success of the proposal. The proposer state, that he will have a public wallet to display all transactions and to perform some bi-weekly checks, until the first even occurs. It is unclear what is meant by an event, because the specifications were not provided, except that he plans to approach some artists and rent a venue. Regarding the success of the proposal, the proposer states that there will be inclusion of more people from different walks of life, to host a live musical event and creating unique NFTs, in order to spread the awareness of the Cardano. Unfortunately, success metrics do not really relate to the goal of on boarding the poor people. I would suggest to track the number of attendees in events/meetings, number of people who joined cardano and such. ", "q2r": 1, "assessor": "z_assessor_2222", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "I agree that there appears to be a lack of information. I will continue to try and provide further information as required. I appreciate the feedback and have spent the majority of my entertainment career in live events as opposed to online, so it is completely understandable to inquire about the online portion. Thank you for taking the time to assess my proposal. The suggestions are valid and tracking the number of attendees and those who join would be an appropriate way to see success metrics in general. I am aware of the long term ambitions and personally don't limit myself to just focusing on the growth of one place, but the growth of the globe in general. Will happily extend out virtually to where ever I can. With the NFTs and informational portion of things, education and opportunity can create a sustaining impact on those that it resonates with. I understand there are some who will see it as the NFT is the \"opportunity\", but the showcasing of different projects and an entrance piece, allows for a broader perspective beyond a fiscal opportunity. As someone who has experienced a poor life, I know from working and creating on the Cardano network for over a year now, there are many different functional use cases beyond just art. The request for the funding towards the tablet was based around speeding up the process of which I am currently doing, as for the rest of the breakdown, I thought it would be healthier to say what the funding was for, which is the rate I am currently making as an artist on the Cardano network. Similar to saying 3k for wages.  Thank you for taking the time to assess, I appreciate your concern and feedback. I will continue to work and try to better display my accomplishments. "}, {"id": 4130, "q0": "The problem/solution fit, from the proposal's perspective = there are not enough events in the Cardano community targeting people that either don't have or can't afford Cardano, therefore this project aims to deliver more events.\n\nThe opening statement which describes the solution in more details, \"The increase and demand for higher costs of NFTs and participation creates a barrier to entry\" is not clear.  The cost of minting an NFT at the time or writing, is equivalent to 1 transaction fee or 0.17 ADA, or approximately $0.08 USD.  I'm not sure if he is referring to the cost of acquiring NFTs, but the creating cost itself does not seem cost prohibitive for any person anywhere, and is one of the lowest reliable transaction costs in any blockchain environement.\n\nThe proposals stated solution to this problem, plainly, is to host events and give away NFTs to lower financial class people, to build more users.\n\nIt's not clear from the proposal or links provided to twitter or a website where the author is located.  In the problem statement, he comments on a problem related to virtual events, the goes on to talk about \"local\" resources, such as musicians.  Due to this lack of information, it's difficult to evaluate where this community building activity will take place, or if it can be suitably placed in a different challenge.  For the Dapps, Products, and Integrations Challenge that the proposal selected as a forum for this proposal, I'm neutral on whether or not it belongs.\n\n", "q0r": 3, "q1": "The proposal author states that he has 10+ years as an entertainer, and has collaborated with over 100 Cardano projects (list of projects not provided).\n\nThe budget details financing the proposal author's personal expenses, mostly rent, travel, food, devices, and purchase of digital assets such as NFTs - presumably to give away.\n\nThe author aims to build a more inclusive Cardano community, and states the key metrics for success as doing so through hosting events, including an upcoming music event.\n\nDue to the opaque nature of the proposal, and limited details on actual deliver plan with outcome KPIs, I could agree that the proposal may be feasible, but only insofar as it is challenging to determine what that means, therefore I'm neutral on feasibility.", "q1r": 3, "q2": "Auditability for this proposal is based on 2 metrics:\n1) That the proposal author will use and maintain a public wallet address for traceability (all wallets are public, assuming you know the address)\n2) The proposal author will \"checkin\" bi-weekly, then monthly, then reduce his participation in auditability to maintaining a Twitter feed to detail any events that do occur.\n\nMy overall feeling with this proposal is that the intention to build community and onboard new members around the theme of NFTs is decent, but being relatively new to Catalyst himself, the proposal does not offer a well developed way to define and measure the impact that it generates.", "q2r": 2, "assessor": "z_assessor_2517", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for the feedback. I understand the displayed information requires more sustenance. I will continue to elaborate and build alongside those on the Cardano ecosystem. I understand the personal expenses appear to be a negative aspect, but essentially it was a break down of hourly pay over the course of two months. I have been building on Cardano for a year and have realized that was the price point at which I am currently working at. Thank you for taking the time to assess and I appreciate the feedback. What I meant about price points, is that we are focusing our attention towards obtaining highly coveted assets comparatively to projects that are creating functions or use cases openly; which from my perspective would allow the growth and understanding of potential uses beyond expensive pieces. I can see and understand your perspective and will continue to keep trying to articulate properly."}, {"id": 4588, "q0": "While Cardano is a relatively inexpensive crypto ecosystem to enter, the proposer's critique regarding real world meetups and cross community events does have some merit. I do have some concerns about whether the proposal sufficiently addresses the stated problem. Is this a problem that can be solved with live entertainment, which typically comes with its own costs and geographic barriers to entry. That's not to say that it's impossible, but the proposer needs to make a stronger case for how their proposed solution will add value to the Cardano ecosystem.\n\nI believe this proposal can be said to adequately fall under Dapps, Products, & Integrations challenge under the \"social media\" provision even if much of the proposed activity would take place offline. \n\n", "q0r": 2, "q1": "The proposer cites collaborating with over 100 projects on Cardano but does not provide examples of which projects, or the role they had on those projects. This can be easily rectified with a link or two, but for now we're being asked to take a lot about this project on faith. \n\nLikewise, it would help to have an idea of what kind of audience the proposer has been able to attract in the past. What kinds of venues has the proposer performed at? How many people attended? And are they of the socio-economic class the proposal is targeting? \n\nRegarding the budget, more justification needs to be provided for some expenses. If the goal is to reach and onboard poor individuals into the Cardano ecosystem, why is the proposer asking for money for tablet? When can we expect delivery of the live the event?", "q1r": 1, "q2": "I would recommend the proposer revisit this section with an eye toward quantifiable metrics.\n\nAs currently laid out in this proposal, this project has few KPIs and would be difficult to audit. Since the events are key to this project, a way to track and report attendance as well as solicit feedback from attendees could potentially improve auditability. NFTs could be used as low cost admission tickets (and help justify the Wacom tablet expense at that). \n", "q2r": 2, "assessor": "z_assessor_2564", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess this proposal. I understand that the explanation for the tablet and who I have worked with over the past year requires more information, moving forward I will add a clear list of those I have worked with and will continue to build alongside the cardano ecosystem. I appreciate the feedback and your perspective as to how I would be able to help better articulate end goals through the questions asked.  "}, {"id": 4944, "q0": "Lower income group of people usually will focus on basic needs such as food, shelter, clothing, safety and health. I find it hard to relate your idea of art NFT creation and music performance to bring onboard the unfortunate with any of those basic needs. It does not solve any of problems that the poor people are facing. Unless you are talking about creating an NFT with utility that makes their life easier that is free to use by everyone, increase productivity and efficiency, solves food distribution, improving health etc. The expensive art NFT that the proposer mentioned are inflated by speculation, not because of the value it brings. There are thousands of cheap NFT, or they can even mint the art NFT themselves by just paying NFT maker fee. Bring a real world value for the NFT to the table, then you will automatically help the poor and the needy. With the argument above, I find that this proposal does not addresses the challenge. ", "q0r": 1, "q1": "Since this proposal is about entertaining and creating art NFT's, the proposer has the relevant skills and experience on implementing the project. It is noted that the proposer is planning on hiring musicians and volunteers for the event that he/she is hosting, and also devs for unspecified role. The budget requested is to buy the tools for creating more art NFT and for his/her cost of living. The timeline given is unclear. It is said that the proposer will begin looking for musicians and creating NFT in July, but does not specify when will the event take place nor when will he/she complete the NFT artwork. The plan provided does not include much details other than commencing to look for musician for the event and also producing NFT artwork. On your next proposal, you are advised to present more detailed, structured plan such as what is being done in preparation for the event, what are the backend work that will be done for the NFT ticketing system, the material preparation for distribution to the public since you are aiming to bring onboard people that has not heard of Cardano or even crypto.\nIn the risk section, the proposer notes that there might be a technical problem from the venue owner side regarding the NFT ticket verification, but there is no plan provided on how it will be mitigated. \nWith the plan presented, it is unlikely that this proposal will be implemented successfully. ", "q1r": 2, "q2": "The roadmap are vaguely presented. The proposal only mentions that work will start in July to look out for musicians and NFT artwork creation, nothing mentioned on when will the event will take place or when will the proposer start to deal with the venue owner for the event. On your next attempt on submitting the proposal, explain in details of your plan on what are the execution plan from beginning of preparation right until the day of the event. For example, on the first week of the 1st month after funded, you will begin dealing with artist and venue owner, on the 2nd week, working with technical teams on ticket verification systems, 3rd week, marketing campaign, etc.\nThe KPI presented are unrelated to success of the event. It should be how many new people that the proposer bring onboard or how many wallets created after the event. Also the sale of art NFT during the event can also be included as KPI. \nThe proposer also did not mention where the community can keep track of the progress of his/her work, but I assume that the proposer will post the updates on his/her social media and website. \nIn conclusion, the information provided is not sufficient to audit the success of the proposal.", "q2r": 2, "assessor": "z_assessor_2642", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you so much for taking the time to assess my proposal! I appreciate the feedback and constructive cristicism. Clearer articulation and more information is required. I will continue to provide the required information moving forward. Thank you"}, {"id": 6491, "q0": "I like the idea of including everyone. In this case \"Helping the poor come aboard.\" It is important to remember that lots of people don't have access to the Cardano projects and NFTs. The reason for this is because most people have no idea what it is and how they work. The proposal suggests that there will be live events and streamed events that will allow more people from the community to come on board. I think this is a unique idea because it can include more people in the Cardano community. I think it could be difficult finding a large enough community that would be interested in these events. Maybe include more information on how there will be enough people benefitting from these events. Building a community is extremely important because it allows for people to participate in these events and understand exactly what the Cardano blockchain is. The purpose of Project Catalyst is to include more people and to promote education. For these reasons, I give this section of the proposal 3 out of 5 stars. This proposal is written well and can be very beneficial. It just may be difficult in the early stages to grow a large enough community that would be interested in attending.", "q0r": 3, "q1": "The proposer seems to have experience in the community and is familiar enough with Cardano to be aware of Project Catalyst and creating a proposal. It is important that there is information on the identity behind the proposer because it allows for the community to hold this individual accountable. There is a roadmap that gives details on what the proposal will include. This section should include specific or tentative dates of completion for each topic. This will help the readers of the proposal to determine how likely this proposal will be implemented successfully. There is also a budget breakdown that describes where the requested funds would be allocated. This portion of the proposal is written well because it includes specific information. Overall, there needs to be a section of the proposal that has a detailed plan on how to grow the community in a way that will ensure that these funds are useful. We need to remember that it should benefit the Cardano ecosytem and bring more utility to members. For these reasons, I give this section 3 out of 5 stars.", "q1r": 3, "q2": "There is some good information, and it is a great start to a proposal. There is a great use case, a detailed budget breakdown, and determination. However, there are still sections that lack. My main concern is lack of a community that is aware of this project. There are typically 2 different concepts that help me to consider the potential success of a proposal. The first is transparency. This should include a team/individual who are/is completely transparent with their community and will build trusting relationships with them. However, without a community this principle doesn't have much effect because there will be no people to be open with. The second principle is accountability. This also requires a community or group that is interested in a project/idea and is there to support them. When there is a group of animated community members, it helps allow these two principles work. This typically leads to the overall success of a proposal. I think there can be a focus on building this community before it goes live. For these reasons, I give this section 2 out of 5 stars. Once again, it is a great idea. Just needs to be worked on.", "q2r": 2, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess my proposal. I understand that I need to include further information for a clearer and more concise explanation. Moving forward I will address these concerns. "}, {"id": 14846, "q0": "The goal of this project is to attract lower-income people who are not yet economically viable to participate in the Cardano ecosystem. Obviously, this will increase the number of people participating in the community as well as provide Cardano with the opportunity to discover hidden talents who lack financial resources by creating a welcoming environment with a low to no entry cost. This, however, does not satisfy the requirements of this section for a proposal. First and foremost, the proposer mentioned lowering the barrier to entry with NFTs in order to help many people who are still struggling financially, but what exactly is a lower barrier? How much will the proposer cut, and will that price apply to all classes or just the poor? In addition to the solutions provided by the author for the two risks, I have a concern for which I hope to receive an answer from the author. What does the proposer intend to do to address the user acquisition problem? It is not enough to simply invite local musicians to promote through concerts. People with low incomes rarely have deep enough knowledge to join as well as pay attention to places that require high input costs, because people prefer the cheaper when it comes to price. So if the number of users does not increase as proposed by the proposal, then the biggest loser here is the Cardano ecosystem. As a result, I am eager to see how the proposer resolves this issue.", "q0r": 3, "q1": "I would like the proposer to add quite a bit of information to this section. Initially, according to the plan, the author will create more characters and NFTs to help onboard and introduce more people to Cardano beginning in July, so what will happen in August, September, and later months. Is the proposer planning to continue lowering costs in order to attract more people? Or how long does the author intend to decrease costs? There are numerous flaws in the plan that the author addresses. Let's move on to the budget breakdown, which includes a total of 7 spending items that clearly state the purpose and the number of expenses that must be spent. It includes an item called miscellaneous, but we have no idea what it contains. If it is not possible to visualize the project's expenses, the proposer should state or provide examples of why the money is needed. This will make the budget plan for the project more straightforward. Finally, the proposer was the sole person to lead all activities on this project, and because he has collaborated with over 100 projects on Cardano alone, I am confident that the author will do a good job of what needs to be done. The author also intends to recruit additional support collaborators, but make sure to specify the selection criteria. It is possible that experience is required, or that educational qualifications are also needed. As a result, please establish specific requirements in order to find the best volunteers for the project.", "q1r": 3, "q2": "I completely agree with what is mentioned in this Auditability. We have milestones where the proposer will take a different action every two weeks to check on the progress of the project. We can also clearly see the project's success in attracting more users to the Cardano ecosystem. Overall, this section is brief, but it covers all of the essentials, and I have nothing to add.", "q2r": 5, "assessor": "z_assessor_4104", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for taking the time to assess my proposal. To answer the longevity question, I will be continuing to make the characters, and actually started releasing them in July of 2021. I released the July set for 2022 and will be continuing release new things in order to maintain a low barrier to entry. I have currently been doing low barrier to entry for a year on Cardano and plan on continuing to do so. Thank you for the perspectives and I will continue to try to elaborate in a concise manner. Low barrier to entry will remain free-10 ada. Proceeds will be split between the developers and overhead costs, remainders will be used for charitable donations. I don't take a cut (which is why the funding breakdown consists of my expenses during that time). I make my money through other work on Cardano. I appreciate your feedback and thank you for your perspective. I know I have a lot more to display and will continue to work alongside the Cardano network."}], "solution": "As a current project owner, artist, and live entertainer, I have the ability to create, display, and help those around me understand block-chain technology in layman's terms. ", "experience": "Mosie-Marks Inc. has been building and collaborating with over 100 different projects on the Cardano for the past year. I have experience in project consulting and over 10+ years of experience in entertaining. "}