{"id": 422571, "author": "jpg.store", "title": "NFTs go Mobile", "url": "https://cardano.ideascale.com/a/dtd/422571-48088", "category": 26595, "amount": 80000, "description": "Over the course of the past 6 months we have consistently seen 50-60% of our traffic coming from mobile devices who can't trade or mint on the store without the usage of a separate dApp.", "f6_no_assessments": 7, "f6_rating": 4.095238095238096, "videos": [], "media": [], "f6_assessments": [{"id": 5583, "q0": "This is probably my favorite proposal thus far because it addresses a key issue in the Cardano ecosystem, which lacks mobile ways of purchasing NFTs. It's also great to see the self-reflection evident here with JPG.STORE, which is already ahead of the curve with it's integrations with Eternl light wallet. While it's true that the integration is a huge step in the right direction, the proposal to make a mobile application sounds like the next big step. \n\nThe mobile interaction promised by this proposal will be required if Cardano is to take a step forward in the NFT game for certain. This will onboard new users, new artists, and make Cardano NFTs more accessible and influential as a whole. ", "q0r": 5, "q1": "Seeing the work that JPG.STORE has already done with their marketplace, and the plans they're laying out via Catalyst proposals gives me more confidence that their plans will come to fruition. The team has also been thorough in their breakdown of funding and what it will be used for; they are well aware of what is required to accomplish this task. \n\nI'm also glad to see the foresight presented here. Noting the challenge of creating \"a standard in communication with the major wallets on Cardano to enable such integrations\" will surely be no easy task... and their emphasis on this point is ideal. \n\n", "q1r": 5, "q2": "Auditability for this proposal seems to come at the end of the process, once the code is completed and open-sourced. There are no other metrics by which to gauge the progress of this project. However, given the role JPG.STORE plays in the community overall, it's likely that they will update the community via engagement in Twitter spaces at the very least. I would definitely suggest adding benchmarks like those to the proposal as deliverables along the way. \n\nUltimately, the only way to audit a proposal like this one really is with the end result... when the app is ready for major usage. Again, the standard that must be created will probably take the most time and there is less clarity on how that standard will be created in the first place. ", "q2r": 4, "assessor": "z_assessor_2716", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 6494, "q0": "The challenge described in this proposal is very important. It is mentioned that 50%-60% of their traffic has been coming through on mobile devices. This shows that there are people are wanting to utilize Jpg.Store on their mobile devices but don't have access yet. The proposed solution to this challenge is to create a mobile app for Jpg.store on IOS and Android. This will be a huge solution given that 50%-60% of their traffic is coming through mobile devices that currently can't do anything on them. This change will completely add value to the Cardano ecosystem given that Jpg.store is the biggest CNFT marketplace. For these reasons, I give this section 5 stars.", "q0r": 5, "q1": "The team at jpg.store currently plays a huge role in the Cardano ecosystem. The team has been able to accomplish a lot already, and they are asking funds to continue to scale the network and allow all users of interest an opportunity to participate on the Cardano blockchain. The proposal gives a brief explanation on the team and their expertise. I would suggest writing a little more in the proposal for PA's that aren't too familiar with Jpg.store yet. However, there is a detailed roadmap with a timeframe of 8 weeks. It is important to include a timeframe so the community can hold the team accountable for their proposed idea. If the team hasn't already, promoting this proposal through social media would be a good idea to start engagement in the community. If funded, it will lead to the likelihood of those loyal community members to hold the team accountable as we look forward to creating this Mobile app to support CNFTs. There are risks that have been taken into consideration, and it appears that the team is prepared for both scenarios. For these reasons, I give this section 4 out of 5 stars.", "q1r": 4, "q2": "There is a lot of information that the team has included in this proposal. One of the best ways for the team to promote auditability is through their community. Holding the team accountable and allowing the team to be open with them about the current progress of their work. This will lead to a successful proposal and will benefit the entire CNFT ecosystem. The roadmap has been defined as 8 weeks. This is very fast and shows that the team is ready to get the mobile apps out as soon as possible. It will promote all CNFT's and could lead to other ecosystems becoming interested in getting NFT's on the Cardano blockchain instead. By having these timelines, it allows for complete transparency while working on this proposed idea. The community will be extremely excited to hear about a proposal like this and will likely be successful if funded. For these reasons, I give this section 5 stars.", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7203, "q0": "The proposer plans to solve the problem that NFTs on Cardano have not been given a chance to be fully adopted by the mass public yet by developing a mobile product or Dapp that would allow for easy access and use of jpg.store creating an influx of new users. Based on the analysis that more people would/will enter the space if given the proper mobile access in order to buy cryptocurrency easy and securely while visiting the jpg.store all-in-one place right from their mobile device, this would increase volume within the Cardano ecosystem, bringing value from more investors and enthusiasts onto the blockchain. One huge step of the solution is partnering with MoonPay (a registered money service) instead of having multiple hurdles to acquire Cardano native tokens from an exchange, allowing users to purchase cryptocurrency and connecting them directly for purchasing or creation of assets via mobile onsite. The Impact of this development would be very beneficial, as stated in the proposal, to bring more mass adoption to Cardano and NFTs to users still learning and adapting to the changing era. Rationale for this proposal's Impact is a 5 for those reasons.", "q0r": 5, "q1": "When looking at Feasibility of the proposed idea, the relevant experience from the jpg.store team and MoonPay's history as a money to crypto service, it is likely this proposal will be implemented successfully. The team members are not clearly specified to whom will be working on this proposal, yet there are 3 main resources that will be needed for successfully completing the solution; 2 engineers and one UX/UI designer. Given the budget and timeline of 8 weeks for completion, this may or may not be an underestimated amount of time as there are no indications of any delays though some funds are allocated to overhead cost that may take place. The only concerns being that there is no proposed transparency or discussion towards how easily this integration will be developed or what the coordination with MoonPay would look like. These aspects would help voters have a better understanding of said partnership and feel more confident in overall approval. The rationale for feasibility is a 4 based on the lack of more detailed information from the proposer, yet still very likely the solution will be delivered having two major companies involved during the process if funded.", "q1r": 4, "q2": "The proposer states, \"we are also driven to run the project in a user-centered manner, listening to our users and various stakeholders throughout the process to ensure the end product is what the community at large desires\". This is the foremost key metric of measuring the success for jpg.store and the Cardano ecosystem as a whole due to the passionately loud nature of the community's voice. The proposer does not ensure transparency throughout the timeline showing when the milestones within the 8 week roadmap will be met, because these goals are said to be completed internally as well through a third party resource, MoonPay. Having more publicly documented accessible information available based on the timeline's proposed achievements would improve the proposal's overall stature within the Project Catalyst community. There are no considerable challenges or risks shared by the proposer involving the solution being implemented other than potential overhead costs that may occur. A rationale for Auditability with these concerns is a 3 because as jpg.store is a monument within the Cardano NFT community and it will be up to the users to voice any concerns that may arise during or after development.", "q2r": 3, "assessor": "z_assessor_2883", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8592, "q0": "The proposal is nicely written and arranged, with a clear purpose and transparent process. According to the author of this proposal, over the course of the past 6 months they have consistently seen 50-60% of their traffic coming from mobile devices who can't trade or mint on the store without the usage of a separate dApp. So as to address this, the proposer wants to build a native mobile applications (iOS and Android) for the JPG Store with deep linking technologies to allow a smoother trading and minting experience for people using mobile devices. Not only do I find the solution and problem statement to be connected, but I also believe the idea solved the problem properly and would have a significant influence on the Cardano ecosystems. If this idea is funded and implemented, there is an implied value added to the ecosystem. Because impact is typically connected to scaling a solution, the proposers did an excellent job of outlining the advantages for each aspect. They also foresee some potential dangers that might jeopardize the implementation, and they have sensible solutions in place. And, at this moment, I have no concerns about the team's ability to meet the outlined difficulties. My sole recommendation is that the proposer provide the relevant metrics to discuss that correspond to the outline challenge settings.", "q0r": 5, "q1": "The project's viability will be determined by whether or not the team can find a developer to execute the job. The good news is that there is a link which takes me to information on all of the team members and their areas of expertise. It doesn't take long for me to confirm who they are, as well as their knowledge and ability. The bad news is that they have yet to pick which team member will engage in this initiative. That is a quite disadvantage that might endanger the entire feasibility section. A clear understanding and outline for how many team members will be more beneficial for the implementation of the project. It would be much easy to establish whether the professionals involved in this project are capable of assisting it in its success if this were the case. Unfortunately, as much as I like the idea, the budget is not clearly broken down. The required funds total $80000 and are split into 2 key categories: employee costs and overheads for the duration of the implementation. Specifically, the employee cost for a weekly budget of $8000. The community deserves more than a total of $8000 each week with no indication of how they will get there. A well-explained explanation of which roles are required in this project, which experts will complete each role, and how much $/week for different roles will undoubtedly be beneficial in checking the budget's fairness. I also expected hourly development rates, as did every other plan, because it makes sense. It's odd to offer a price for development in any other way since it's difficult to ascertain that one feature is more or less expensive than another. Then there's the $5000 weekly overhead budget. As overheads include hosting, unexpected delays, marketing costs, tutorial development and more, I recommend the proposers try to estimate the expense for each element mentioned (% in a total $5000). The roadmap for this Dapp is brief yet comprehensible. Although I would recommend that the team provide more detailed descriptions of what will happen in each period and spend more time detailing the technical aspects of each step, I feel the goals are realistic and that, given the time horizon, the work should be completed as planned. Overall, it appears that this proposal has taken some attempts to explain how it would achieve its claimed objectives, but it lacks several critical components. I neither agree nor disagree that this plan is extremely likely to be executed successfully.", "q1r": 3, "q2": "Unfortunately, there is insufficient information available to assess the development of this proposal. The author provides us with some measures that make sense and clearly describe what success means in this project, however I see them as milestones rather than main metrics. There is a strategic plan with a timeframe and milestones that are reasonable but are too brief to provide a detailed step-by-step description of the proposal. There is no unique KPI accessible for auditors to assess how effective this initiative is, which is one of the campaign's major requirements. I would also recommend that the team develop direct and constant interaction with the rest of the Cardano community, as well as providing more clarity and deliverables.", "q2r": 2, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12793, "q0": "The proposer jpg store a a big NFT marketplace. They have recognized that 50 – 60 % of their traffic is from mobile devices which can´t use all the features like trading and minting. The traffic shows that there is a big demand to interact with the NFT marketplace. This probably lowers the trades and minting overall. \nThe solution from the proposal is an application from the native app store on android and iOS. This could decrease the entry barrier to interact with CNFTs vastly and thus grow the Cardano ecosystem by creating more volume of NFTs traded and bringing in new users by the lowered entry barriers. \nTherefore I strongly agree that this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The jpg store is already a well-known NFT marketplace. The current webapplication works and they should have enough expertise to create this mobile application. \nThe budget is realistic. In total 3 people will work on this and there is a budget for additional costs. \nThe app should be developed in 8 weeks. The time structure is divided into four sections and the allocated to each one is reasonable. \nThey estimate the communication with current and future wallets is the biggest risk, where the large scale could makes it more difficult. So they self-assessed the technical difficulties.\nThe team is competent, the timeline is reasonable and they have thought about the risks. I strongly agree that it is highly likely that this proposal will be implemented successfully. ", "q1r": 5, "q2": "There are general infos on how jpg store builds it´s applications what includes this one. The process of testing and betatesting the process id described but there aren’t any KPIs/ metrics. I would have liked to see some anticipated user counts, interactions from mobile devices like minting and trading NFTs…. \nThe problem was clear from the beginning and this project solves the problem by creating an application that gives users the possibility to use their mobile devices to interact with the NFT platform. \nAll in all I agree with the auditability because there mostly all relevant infos included but matching KPIs would be important. ", "q2r": 4, "assessor": "z_assessor_3472", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14141, "q0": "I rated this proposal's effectiveness to address the challenge five stars. I feel that The problem addressed is in fact relevant, and the solution could have a large and positive impact on the Cardano Ecosystem. JPG.Store is a great company and I love their idea to create an app that can be used to buy and sell NFTs. People all over the world who have access to IOS or Android would be able to easily access this new application and be able to readily use Cardano from their phones in a new way. I believe this is brilliant, and the way the proposal is carried out is very excellent. There is a clear plan on how to move forward, and what exactly will be accomplished here. I love how they mentioned how bringing new people to Cardano would be as simple as downloading this new application. This would be a great benefit to Cardano as a whole and all those who invest in this token.", "q0r": 5, "q1": "I strongly agree that if funded, this proposal will be carried out and implemented successfully. There are clear details that describe the plans of action, and what steps will be taken in order to complete the creation of a new application for NFTs on Cardano. The 8-week plan as described is a great way to follow up on the progress of this project and to hold the team accountable for completing what they have sought to do. I love how it was stated that the team will be \"tracking these milestones internally and inviting our beta testers to provide feedback on usability and functionality as soon as our project reaches a state of readiness.\" This whole idea to include the community in the progress and testing of the application is great, as it gives a chance for Cardano investors and those interested in NFTs to be a part of this project. The proposal also states how they will listen to the users to insure the \"...end product is is what the community at large desires.\" I fully trust in the success of this proposal and strongly agree that if funded, the team will carry out what they have proposed to do. \n\n", "q1r": 5, "q2": "As explained a bit above, the information provided is very sufficient to audit the progress and the success of this proposal. I appreciate the number of details included. The team explained who will be working on this, an 8-week breakdown of the steps that will be taken, where the money will go, and how the community will have the opportunity to be involved with the creation of this application to ensure the mass majority is pleased with the final outcome of this project. This proposal should be rewarded with funding, as the idea to create a mobile application for NFTs is genius. It will greatly benefit Cardano as it brings in many more curious users and people who share these interests.", "q2r": 5, "assessor": "z_assessor_3915", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14632, "q0": "The JPG project was created to allow Cardano NFT creators and traders to interact with the market via mobile devices on iOS and Android platforms. The use of mobile technology is key to increasing volume and on-chain transactions, it increases Cardano's reach and increases the amount of ADA used. This idea aligns with the goals of the challenge.\nThe proposer has a long-term vision with the goal of “Pushing Cardano to First” but does not have a specific roadmap and the key metrics are unclear. The proposer should add a technical explanation, it would be better to have a case study.\nProposer identified two major risks preventing the project's success: Cardano's primary wallets don't communicate consistently and lack of strong infrastructure. But there is no solution to the problem.", "q0r": 3, "q1": "The project is estimated to be completed in 8 weeks. The workload is divided into 4 parts, the team has divided a specific timeline, but that is not enough to monitor and ensure the progress of the project.\nIn the requested funds, the proposer suggested the number $80000. And allocate the budget into two groups: $64,000 for employee costs and $16,000 for overheads. Here will not mention the issue of such a budget is more or less. However, such a financial allocation plan is not clear. The proposer should add additional information, for example, the staffing costs will be paid for which positions, with how much is spent; or for general expenses, expenses should be listed. It's hard to imagine how the coin would operate to sustain this project with such a description. Unfortunately, I could not find any information about the professional knowledge and working experience of the members. Proposer provided a link to a list of members' names, and the only thing displayed was their names and social media accounts (Twitter or Instagram). The proposer should check this issue again and update it again to increase the reliability of the project. A listing of education or work experience will help to better understand the developer and ensure the technical success of the project in the future.", "q1r": 2, "q2": "I noticed that the proposer did not have a specific audience, in other words, it is conceivable that this project was developed for everyone. The proposal does not provide any information about the timeline, the number of users expected, or the amount of traffic entering the Cardano network through the JPG software.\nBesides, with 8 weeks of project implementation, the proposer can refer to using the Agile software development method.", "q2r": 2, "assessor": "z_assessor_4076", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We want to create native mobile applications (iOS and Android) for JPG Store with deep linking technologies to allow a smoother trading and minting experience for people using mobile devices.", "experience": "The team at JPG launched the marketplace in the second week of November 2021. Since then JPG has pushed to create a user driven marketplace servicing all NFTs on Cardano with a strong development team of 10+ engineers driven to create on Cardano."}