{"id": 422635, "author": "lendingpond", "title": "Crypto collateralized loans", "url": "https://cardano.ideascale.com/a/dtd/422635-48088", "category": 26595, "amount": 30000, "description": "Users can not borrow against there ada in a non-kyc solution.", "f6_no_assessments": 8, "f6_rating": 3.7916666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 811, "q0": "Crypto borrowing and lending platforms have become a mandatory feature in any functional Cryptosystem. The proposal is to make an order book style lending and borrowing platform for fungible tokens using smart contracts and not based on KYC thereby derisking the platform. This is the power of crypto. The utility of this system is not very apparent but on close inspection, it has very unique use cases. When such a system is available then it becomes possible for parties unknown to each other to borrow based on the Crypto (NFT) assets they own. There are such platforms available in other ecosystems and have been performing reasonably well in spite of the repeated security issues faced by them. Therefore the proposal to build such a system is very much a requirement and will add substantial value to the Cardano. ", "q0r": 5, "q1": "The proposal is from a leading lending platform operator in Cardano who has successfully operated the site for a substantial time now. The proposing team also has partnerships with leading players in the Cardano ecosystem like sundae swap. The proposal is to research and build lending and borrowing smart contracts. The major task in the proposal is to audit the smart contract to prevent any security issues in future. Cardano currently has established methodologies in audit and in certification. Therefore these are fairly simple tasks and the proposing team with their experience will be able to complete them successfully", "q1r": 5, "q2": "The proposal is for 30K USD. 10K USD for development and 20K USD for audit. They also have to onboard notable app platforms on Cardano to integrate the load services. The proposal did not have any details on the shortlisted app platforms for integration and the state of their dialogue. It is likely that the success of the project depends on these important stakeholders. However, the cost and the timeline provided is very reasonable. The proposal has a very clear aim and a well-defined deliverable. The output will also be visible to the community and the progress can be audited. ", "q2r": 4, "assessor": "z_assessor_2129", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6055, "q0": "It is proposed to build an application for users to borrow assets such as NFT based on the ADA crypto-mortgage. To do this, the proposed team will proceed to use a partnership with other projects to integrate the partner's product into the platform for lending. This will help attract users who want to own assets such as art paintings or virtual land without having to sell their ADA numbers.", "q0r": 5, "q1": "I think the feasibility of the proposal is at a low level. The proposal does not clearly state the necessary information to show that this project will be implemented successfully. For example, considering the budget breakdown. For the project, the proposed team did not specify in detail what the costs for each work item should be. For the $20,000 expenditure for audit, it did not specify what content needs to be audited inside. The same goes for the $10,000 for development and code. I suggest that we should be more detailed about these amounts so that the voter community knows if it's reasonable or not. Currently, it is very sketchy and general. The proposal states to write code within 3 weeks, 3 weeks to code, but is it full of features and security mechanisms for the platform? The proposed group should present more clearly and in more detail the work implementation plan.", "q1r": 1, "q2": "The auditability of the proposal I consider to be well achieved. The proposal provides numbers to measure what a successful project's progress will look like. What are the KPIs to be achieved. Information about each member is also displayed on the project's website. In particular, for this information, I have a small suggestion that it should be provided directly in the proposal for the community to follow instead of having to click on the page web (it takes some time)", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6769, "q0": "The proposal states there is no way for people to borrow fungible tokens with their ada yet.  There is actually an app called FluidTokens that already lets you do this along with NFTs, but that doesn’t mean more solutions aren’t necessary and healthy for the Cardano ecosystem.  The proposal also explains that their lending platform would be useful because it would allow people to de-risk themselves.  I think providing more explanation about how people can de-risk using their platform would help for voters understand the usefulness of this proposal. I believe this proposal aligns with the challenge, but I think it could use more details when describing its solution and the value it would provide to the ecosystem.", "q0r": 4, "q1": "The team behind this proposal claims they are the first and only lending protocol on mainnet Cardano.  This may have been true at the time of them writing this proposal, I’m not sure, but now there is at least one more lending protocol called FluidTokens that lets you lend ada for NFTs or fungible tokens.  Regardless, the team behind this proposal does have relevant experience for making a lending protocol for fungible tokens since they’ve already delivered one for NFTs.\n\nI believe the timeline in this proposal could’ve been organized differently to better showcase key milestones in the development process, as well as provide more details about what they plan to focus on during development.  This would help show to voters that the team is well prepared and that they have sufficiently broken down the development stage into achievable tasks.\n\nThe budget breakdown shows $20,000 for an audit, and $10,000 for the team to develop and code.  According to a quick google search, audits for smart contracts can range from $5,000 to $30,000 for small to medium projects, so $20,000 seems reasonable.  It’s harder to determine if the $10,000 for the team is reasonable because there is no clear estimation given for how many hours they plan to spend building or how many people are even on the lending pond team.  That being said, I have a hard time imagining a scenario where $10,000 would be too much to pay for something like this that is likely at least a month's work, so I think it is likely reasonable.  \n\nEven though I wish some parts like the timeline and the budget breakdown were a bit more detailed, I believe this team provides enough information to believe this proposal would be implemented successfully.", "q1r": 4, "q2": "I believe this proposal provides sufficient information for tracking its progress.  They start out by saying they plan to make certain metrics public, like daily volume lent on their platform.  They also explain they have an experienced marketer for their twitter account, so I assume we can expect updates on this project from there, at least when it is close to release. However, they don’t provide a link to this twitter account which makes it a little more difficult to find.  I know their account for lending pond is called @lendingpond_ada because I already follow them, but I’m not sure if this project will have its own twitter account or if it is planned to be combined with lending pond.  I think it would be good to explain if they plan to provide updates about this project during development on twitter as well as provide a link to the twitter account for the project.\n\nThe KPIs provided are good indicators of success, especially the daily volume in ada on their platform and the number of apps that they integrate with.", "q2r": 4, "assessor": "z_assessor_2826", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6918, "q0": "Explanation of Use Case and Clearness:\nThe use case is explained straight forward and with clearness through short and precise sentences. The proposal aims to create a order book based lending and borrowing platform for fungible tokens. They also already developed a lending protocol on Cardano.\nCompetitor:\nThere are no competitors mentioned in the proposal and for now there are no other projects on the cardano blockchain. Competitors would be protocols on other chains like compound on Etherium.\nLink to challenge setting and other challenge settings:\nThe proposal fits perfectly in the challenge setting as it will create a lending and borrowing platform and therefore adds another financial product tot he cardano portfolio.\nRisks:\nThe risks mentioned are rather general issues that can happen. To give the community more confidence and round up the proposal a more differenciated approach would be nice to have.\n", "q0r": 5, "q1": "Showing of realistic timetable:\nThe timetable is short and clearly written even though there is some structure missing as I would expect it as a voter. As already meantioned in the impact part for risks a more detailed approach would help the community to have more confidence even though there seems tob e no doubts that this proposal will be finished successfully. \nBudgetfit:\nThe budget is, as most of the proposal, short and dense but clear. 20.000$ for audit seems a lot but for a protocal that aims to get bigger should be fine to have it professionally done.\nMotivation/drivers:\nAs the team has already created a working protocol on Cardano the drivers and motivation are mainly their reputation. It shows that they can and will deliver.\nTeammembers and experience:\nThe team is not explicitly meantioned but consists of the team that also worked on the lending pond protocol. As this application is already live on cardano the experience in delivering a working protocol  is given and enough to trust the team.\n", "q1r": 5, "q2": "KPIs and goals:\nThe goals are pretty ambitous but doable. There is only one KPI (volume lended) that is quantifiable and easy to report. Some qualitative measures would be also good to ensure a good product in a save environment. Especially in the financial industry that I also work in, quality and safeness are key to success. \nCommunication channels and audits:\nThe team meantioned that there will be daily updated numbers to publicly see. Right now there is no source mentioned yet. \n", "q2r": 4, "assessor": "z_assessor_2848", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7617, "q0": "I do agree that there needs to be a robust lending system that operates on the Cardano ecosystem. With that being said, this proposal does not explain the design or system that will be utilized to bring this type of product to the ecosystem. Will the fungible tokens be used as collateral? That is my first question. I understand that Lending Pond already developed a lending system that uses NFTs as collateral so will this one be similar? Whether that is true or not there should be some sort of outline on the design / system you plan to create for this lending protocol. I would imagine that this system would have a lender and a lendee. The lendee can post the amount of ADA that they wish to receive and then there fungible token collateral that they are willing to appropriately post. Then lenders can accept the proposed transaction and lend their ADA. There would be an associated interest associated with this as well. If this is generally correct then it should be clearly explained in the solution.", "q0r": 2, "q1": "The Lending Pond team has established a working product with their NFT lending protocol. With that understanding alone, I am confident that the proposal can be executed and completed successfully. I would like the team members to be specifically stated rather than just saying the \"Lending Pond Team\". Listing out the specific people on the project along with their education and experience will give confidence to voters who may have not have heard of Lending Pond. \n\nThe plan written works as a general outline but it is not detailed enough to give a voter confidence. What coding will you be working on? Will there be front end work? Back-end work? SC work? There needs to be some more detail behind the actual work that is entailed in the timeline.", "q1r": 3, "q2": "There are some good statements made to the auditability of this proposal. Daily volume lended is an excellent KPI to report to monitor the success of this protocol. I would also suggest monitoring application traffic and GitHub repository views if you plan on making the code open source. \n\nAs far as tracking the proposal's progress I would suggest giving weekly updates on the status of the application. If you plan on performing a public test-net have a discord section for feedback to record public sentiment. Utilizing your current community will be a huge help!", "q2r": 4, "assessor": "z_assessor_2907", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7917, "q0": "Typically when you want to borrow money you need to provide proof of income .i.e a payslip to the financial institution you are requesting funds from. Sometimes the institution may also request that you put up some collateral. In the case of the Lending Pond, you have to put up your NFT as collateral. This ensures that the lender gets to keep your NFT in case you default on your loan. The title of this proposal is “Crypto collateralized loans”, but the word collateral does not appear in the entire proposal. They state they want users to “borrow against their ada in a non-kyc solution”. Does this mean that one’s own ADA is the collateral? If this is the case then this platform would only benefit members who already have ADA and would limit a certain group of the community. It would have been good to see if the proposer also provided a loan / ADA ratio. For example 1 ADA to be loaned for every 10 ADA you have. ", "q0r": 1, "q1": "The team are those that created the Lending Pond(https://lendingpond.app/lend). This product is in full flight and is so far the most prominent ADA lending platform on Cardano. The team is also active on Discord . These factors should give one confidence in their ability to deliver. The budget is simple and only contains labour and the audit which is a very important part since this app will be transferring users’ value. The risks were of bugs and audit costs were indicated and these of course can be mitigated by finding and an audit. ", "q1r": 4, "q2": "Not a lot of effort was spent on the roadmap which is not good to see. The team is experienced and should have laid out the roadmap showing milestones to be completed at certain times. The team highlighted that they will keep the community informed via Twitter and that daily volume may be public but they did not say how. The targeted problem was well described but the solution only benefits certain members of the community.", "q2r": 2, "assessor": "z_assessor_2935", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12794, "q0": "There is great demand for new DeFi applications. The proposal will create new application which allows you to lend and borrow fungible tokens. They currently have a borrowing and lending platform where NFTs are the collateral. \nBy comparing the usecase with other projects on different blockchains it´s clear that there is demand for borrowing and lending. \nThe proposal brings a new demanded DeFi and thus matches the challenge but you could have included some more information that describes your idea better. For example a non-kyc solution needs overcollateralization or no body would lend the money. It would have been better to go a bit deeper into the details, technically and economically. But the main point comes across over the context. In addition the SDG are far fetched and you have no direct plan for future sustainability. Therefore I will remove one star. ", "q0r": 4, "q1": "The team hasn´t provided any personal information but just their current protocol. The protocol is running on the mainnet and is used to create loans with NFTs as collateral. Therefore they are able to code the application and they have the right position in the market to be used fast. \nThe budget is detailed planned out. 2/3 of the funds are used for an audit which shows confidence in their code. \nThe timeline is short and describes only the most important points. There isn´t a description of the audit. It would be important to know when and with whom you want to make the audit because it´s 2/3 of the budget. \nIn conclusion your current application looks good that the implementation is likely but there isn´t any information over the audit which is a big part of your budget. Therefore I will remove one star. ", "q1r": 4, "q2": "The team has set measurable KIPs which are ambitious but from their already established position in lending and borrowing reasonable.\nThe roadmap isn´t lengthily and misses the audit which is extremely important for the users. They need to be sure about the security of their funds. Therefore I remove one star. \nThe problem of missing DeFi infrastructure is clear and they solve the problem. ", "q2r": 4, "assessor": "z_assessor_3472", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 12993, "q0": "This proposal addresses the challenge in which the users cannot borrow against there ada in non kyc-solution. To over come this the proposer will create an order book style lending and borrowing platform for fungible tokens. The proposer will make use of the Go language and smart contracts so that their will be lower risks to the people.\nThe proposal identifies the problem that must be addressed. There is no question that the proposal improves the Cardano ecosystem. After looking over the proposal The proposal's main metrics and objectives line up with the outlined challenge conditions.", "q0r": 4, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for implementing the proposal . In which the proposer have mentioned that the proposer will begin the project on august 30 and after researching on the project then starts the developing processes.\nThe development of the will be completed in a month . The developed product will be then launched on the testnet ,Then, using well-known Cardano app platforms, The proposer will combine these services to allow the apps to communicate with one another via Oracle feeds and then finally launch the project . The timescale provided by the proposal appears to be quite realistic, and the proposal's budget breakdown is described in great detail. The proposer has also provided information about the team who will be implementing the proposal as well as the expertise required to do so. The proposal has taken into account both the risks and obstacles to the project's successful implementation. After reviewing the idea, I fully agree that it is likely to be implemented successfully.", "q1r": 4, "q2": "We can track the progress of the proposal by looking at the Daily volume lent pull requests which will be made available to the public. Within the first month, The proposer want this to reach 1 million ada.  The proposer slo have seasoned marketer from Lending Pond who will assist  in increasing our Twitter interaction rates .The challenge has been described by the proposer in a way that is both clear and understandable, and the strategy for its successful implementation is also mentioned clearly .", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "The lending Pond team will make a order book style lending and borrowing platform for fungible tokens.\nIt will use smart contracts and go lang. This allows people to de-risk themselves.", "experience": "The team behind Lending Pond which is the second or third most active NFT platform on Cardano, and most active lending protocol on Cardano. Lending Pond also is the first and only lending protocol on Cardano ever."}