{"id": 422676, "author": "lendingpond", "title": "Leveraging Cardano Assets", "url": "https://cardano.ideascale.com/a/dtd/422676-48088", "category": 26595, "amount": 40000, "description": "There is no simple way to borrow against Cardano assets. To realize the value of an asset, one must permanently sell the asset. There must be a service where users can borrow against their equity.", "f6_no_assessments": 7, "f6_rating": 3.5714285714285716, "videos": [], "media": [], "f6_assessments": [{"id": 4232, "q0": "The \"Leveraging Cardano Assets\" proposal addresses the challenge of Dapps, products & integration by offering a borrowing platform against Cardano assets (NFTs & Tokens). The lender receives an interest rate from lending out ADA & stable coins while the borrower can use their tokens & NFTs as a collateral via a Pond smart contract. This proposal will benefit the NFT community in the sense that they can access the liquidity without selling their NFTs especially during the crypto market downturn. The pond smart contract is NFT contract specific. The project has a unique impact as the first lending protocol in Cardano mainnet. The team has listed the fork delays that could affect the project delivery and bugs. However, they plan to mitigate those risks by spending part of their funding on auditing their lending pond. As a DeFi protocol user with financial background, I can foresee some other possible risks in liquidity and pricing. As not all available NFT collaterals market value can be easily determined, this makes it difficult for the lender to specify their loan offer. Also the Pond Protocol should specify clearly their legal recourse in case of unfavorable market condition (whether the lenders can still retrieve their loan and what would happen to the collateral of borrowers if the platform freezes). The DeFi protocols have undergone a rough patch market condition and their clients have no legal recourse when such event occurs. This will boost user confidence in using the protocol and also not to encourage using too much leverage in accessing liquidity. Failing to provide such information, the project scaling could be quite difficult during this period.", "q0r": 5, "q1": "The pond protocol cites Vasil fork to mark the launch of V2. V2 audit will happen on 15th July and hence, the supporter of this project will have to watch out for this date and observe the Pond protocol. The project has not provided other timeline info and key milestones. Although the requested budget of $40,000 with detailed breakdown look sensible, there is no mention of number of working hours and insights into the relevant tasks like development, server hosting and front end user experience tweaks. The project has been in operation for the last 2 months and a half and process 2 mil volume(60k daily) and loan of ADA 30k. The project team twitter profile have been provided with the 2K+ discord followers. The project has official website, twitter account, gitbook and youtube mentions. It would be beneficial for voters to have timeline in carrying out this project and milestones so that they could determine easier if the project can be carried out successfully. By having close relationship among team members, there is a good synergy of groupwork. Although the Pond protocol is currently in operation and has no shown no major flaws that will create community distrusts, the lack of roadmap and timeline casts some doubt on project deliverables. It is important for the proposer team to clarify the \"purpose\" of this proposal and what they are trying to achieve and whether this is short term or long term plan.", "q1r": 3, "q2": "The proposer has clarified in the auditability section that they look for F9 funding to develop new features. However, these new features haven't been clearly mentioned earlier on. The community can track project progress relatively easy with some KPIs like discord members, daily ADA volume, audited smart contract, twitter interaction, average loan period and UX feedback from the users. As mentioned in the feasibility section that the timeline and milestones haven't also been mentioned, it will be quite a challenging  task for the community to track project progress. The proposer team could update the community with their preferred channels on project development ie. Github or after townhall presentation. The proposer does not have a precise message when it plans to perform the audit and if so, the technically experienced auditor will be necessary to perform this audit operation. The proposer should refine this proposal to thoroughly include all these details for transparency and strong auditability.   ", "q2r": 4, "assessor": "z_assessor_2525", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6257, "q0": "This proposal seeks funding for the further development of a dApp for peer to peer SC loans called Lending Pond. As a summary for the voter, trough this dapp one user could lend ADA to another user who is willing to leverage his NFT as a collateral. Only approved NFT projects participate.\nThe proposal and the website explain the idea very well and in a simple language with examples. \nThe problem is stated clearly at the moment there is no simple way to borrow against Cardano assets (NFTs). \nThe  solution is already developed and operational. The proposer needs the money for further development of the project. These developments we could find in the budget section \n20,000 USD -> Audit (Martify Labs)\n8,000 USD -> Development Costs\n2,000 USD -> Server Hosting\n5000 USD -> Front end and user experience tweaks\nThis being an improvement for already existing project does not fit very well with the Dapps, Products & Integrations challenge. However being a development of a dapp  it is within the project.\nI neither agree nor disagree that this proposal effectively addresses the challenge.\n", "q0r": 3, "q1": "The idea of the proposal is explained very well. \nThe project is working at the moment so, there is no significant risk.\nThe proposer envisions the main risk as the delay of the Vasil hard fork. However, we already know that the Vasil hardfork is already operational on test net and in 25 days it should be on main net.\nThe plan of the proposal is very clear and concise. \nThe budget is outlined clearly however it is missing hourly rates for the developers and numbers of hours for the work.\nThe team of two is presented very well and supported with active twitter accounts.\nThe project will return to Catalyst for funding of further development.\nThe proposal has clearly stated and measurable KPIs and an opwrational website and twitter where the community can follow the development. However everything will be visible on the site of the project anyway.\nThe success metric for this specific proposal are very clear, however not very measurable.\nI agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q1r": 5, "q2": "The proposal has clearly stated and measurable KPIs and an opwrational website and twitter where the community can follow the development. However everything will be visible on the site of the project anyway.\nThe success metric for this specific proposal are very clear, however not very measurable.\nI agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 4, "assessor": "z_assessor_2795", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6495, "q0": "Leveraging Cardano assets is huge in the Cardano ecosystem. Lendingpond accomplishes this through Nft lending and borrowing. The proposal is requesting funding in order to get a secure audit from martifylabs and to continue further development with their project. As stated in the proposal, they plan to create more innovative features over time. There are a few projects that are trying to leverage cardano assets. This is a challenge that is still early in the ecosystem, but with the right team and funding, it can become an important part in defi. Especially with the utility of CNFT assets. This will benefit the Cardano community by bringing more utility to CNFT holders and will likely increase demand for many CNFT projects. For these reasons. I give this section 4 out of 5 stars.", "q0r": 4, "q1": "It is a good thing that there is identification of members of the team. This comes with given experience which leads to accountability. It is a small team of 5 members that are experienced in the defi space. I would suggest including more specific information about the team and the combined skills that they have. This will increase the likelihood of being funded and gain the trust of PA's and community members. There is a detailed roadmap on what the team plans to accomplish. This is important because signifies the transparency of the team and helps suggest if the proposal will be implemented successfully or not. For these reasons. I give this section 4 out of 5 stars.", "q1r": 4, "q2": "There is a lot of information included in this project. I would include more information on each team member since there are only 5. It should be easy to include this. It will help provide sufficient information to audit the potential success of the proposal. I would suggest advising the community of this proposal so that the LendingPond community is aware of what this proposal is for. This will help them keep the team accountable and will likely excite the members for more utility coming in the future. There is a detailed budget breakdown that is very clear and shows where the potential funds will be given. This will likely improve the overall success of the proposal. The delivery dates are clearly illustrated in this proposal which is a positive sign of success. For these reasons. I give this section 3 out of 5 stars.", "q2r": 3, "assessor": "z_assessor_2817", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8086, "q0": "Cardano needs many different ecosystems, in which Lending is one of the must-have to make it easier for users to make transactions. For example, I have ADA and realize that SundaeSwap tokens will increase in the near future, what should I do if I don't want to use ADA to buy and still benefit from the price increase of SundaeSwap tokens?\nThe basic features of DeFi are: Permissionless, Trustless and Transparency; where it is always accompanied by “Non-Custodial”. However, as described here, I find that “Non-Custodial” has not been clearly described.\nLending Pond only allows users to repay with ONE option of paying full interest even if it is prepayment, in my opinion this is something they need to improve for their software. Maybe they will have more options such as paying interest only up to the time of repayment but have to pay some extra fee if paying before the contract term, etc.", "q0r": 5, "q1": "In my opinion, the allocated budget is not detailed but acceptable.\nThe proposal included project milestones with an estimated launch time. However, the launch here must depend on the Vasil hardfork, so it will reduce the feasibility.\nThe project builds on the features of Cardano after Vasil, the question is how do they ensure that Lending Pond will work stably on the features that Cardano has not released?\nThey announced that the project has 5 members but only showed pictures of 2 people and did not have any information to know the capacity of the group to assess the feasibility.", "q1r": 2, "q2": "The parameters to measure to track project progress seem acceptable. In my opinion they have to have Github updates as well as set a frequency of general progress reports that will make it easy to audit the project.\nLending Pond has also built a part of the software before coming to FUND 9 which is an advantage. However they do not provide what has built up until before FUND 9 will reduce its transparency.", "q2r": 4, "assessor": "z_assessor_2945", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10046, "q0": "We hold Cardano assets but are short of capital to invest, grow the business. It is not yet possible to take out a mortgage with digital assets, the solution has given an open direction to the market, building Dapp that allows to take advantage of NFT and the token of peer-to-peer SC loan fulfillment. The solution is in line with F9's challenging settings, developing loans and financing related to Cardano. The real way the solution is offered will make an impact on users, Pond is the NFT lending protocol built on Cardano, Blockchain. Pond facilitates us to borrow an ADA with the mortgage of cryptocurrencies and NFT in the Pond Smart Contract, without the need to sell NFT assets but to obtain the defined capital to do the job. Pond creates transactions and high liquidity, users will get the necessary capital to fulfill life needs and create development for the future. We can see Pond as a bank, a lender with interest rates, borrowers receiving capital and growing their business, which raises the development of society and the country. Pond, too, with the smart contracts created for transactions, the volume of transactions in Cardano increased, the underfunded projects being implemented, Pond really had a good impact on the development of the Cardano ecosystem. The project implementation solution shows that creating Dapp as a bank in Cardano is necessary, which helps the ecosystem to be diverse and have a reality-based development. Pond already has test products, there have been loans made (proof provided by https://lendingpond.app links). There were identified risks when implementing the project, the delay was resolved with version 2 upgraded and updated Vasil-Hard-Fork. The error that affected the distribution of the protocol was resolved by the Lending Pond audit work. The method of addressing the risks is suitable for carrying out the rest of the project at F9.\nI rated: 4\n", "q0r": 4, "q1": "We have accessed wedsite and the project application gives: https://lendingpond.app/ and https://dao-fi.gitbook.io/lending-pond, the first impression is the finishing of the product. Lendingpond has had positive activities for lending products, the liquidity of the project is implemented. The upgrade and development of the project for The Lendingpond App at F9 is appropriate. The plan does not have too many details, the implementation of Dapp integration on the Cardano platform does not have a specific plan. The technical structures that have been upgraded have no specific explanation. The plan has a timeline for the implementation of the audit on July 15, 2022. We expect the data and features of the project to be put on GitHub, the author has a commitment to the implementation plan to be made public and have cooperation with other projects. We saw that the project had 2 members working on the project, looking at their photos are quite young, the information about them we have not seen. The project's Twitter page does not have specific information about the members. The budget analysis is not detailed, the amount paid for the content of the work is still general, we have not determined the recommended amount of $ 40000 will be used in accordance with the goal.\nI rated: 2\n", "q1r": 2, "q2": "The project has not yet given a specific implementation roadmap, with the measurement indicators given not yet explained specifically. The number of Discord members or interactions on Twitter does not indicate what the project is working on. We would like to see the number of Dapp LendingPond users, the number of people wishing to apply for a loan, the number of loans illiquid, the volume of traded assets. The project measurement indicators provide do not determine whether the project is implementing according to the plan and the solution. Project KPIs are not suitable for determining project success. We have an opinion on the success of the project that needs to be determined with kpis: The number of Dapp users, the number of collateralized assets, the total number of ADA that can be provided to the borrower. There should be surveys of the community's borrowing needs. There should be a report on the activities proving the project is complete, providing new features of the application.\nI rated: 2\n", "q2r": 2, "assessor": "z_assessor_3144", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 12654, "q0": "Thank you for providing the video with all the necessary information, it helped me understand the proponent's point of view and vision. Pond works on Cardano effectively allows lending and creating liquidity for assets, it has a very positive impact on the platform and I think this project solves the challenge.\nThe loan will collateralize some NFT assets and cryptocurrencies of the borrower, the most difficult thing is the possible NFT and crypto price risks, I need a more effective solution for the case if The collateral of the loan account fell sharply or the loan asset increased sharply . This leads to the risk of debt repayment. The features listed by you are very complete and it is essential to ensure the loan process is transparent and secure. You also detail how Pond works and lay out some of the risks and how you would deal.\nAnyway, I believe this is a potential project and I should have known about the project sooner. Given the plan information you provided, I highly rate this section.", "q0r": 5, "q1": "The project has shown some remarkable successes such as obtaining a loan of 2 million ADA, 24 hour olume record reach 150k ADA... which makes me quite confident in its feasibility. But even so, I think I don't know of any way to see the specific work in the next phases of the project, I would like you to present this in terms of timelines and details of the tasks and goals to be worked on deliver. The budget section is not fully explained, for example $8000 is used for development, but what is the development, it can be foundation mechanisms, upgrading features,... One one more thing you should attach a link or proof related to the development team, the information given is quite vague, a member of my team could not find any information about any qualifications or experience.\nFinally, I hope you can redo this entire section, because the amount of information provided is incomplete, I cannot rate this item highly.", "q1r": 2, "q2": "The KPIs given are exhaustive, we'd love to see proponents collect data on what metrics they intend to achieve and communicate that progress back to the Cardano community. You also mention the project progress which can be tracked via the attached website and Twitter links. I do not ask for anything more in this section, the project audit process is satisfactory.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14633, "q0": "Lending Pond is a project that allows borrowing with Cardano assets without having to permanently sell that asset. Secure loans bring in an interest rate for the lender while allowing the borrower to keep their cryptocurrency assets without having to sell them to get cash. Currently, Pond only supports the Cardano blockchain, which increases the amount of ADA used, and also increases the number of users entering the Cardano ecosystem, this project aligns with the goals of the challenge.\nThe proposer provided a detailed solution, along with technical explanations. Additionally, the proposer describes the project's purpose by describing Pond's operation. However, I noticed that the proposer did not provide a specific roadmap to proceed with the development of this project.\nIn the risk description, the proposer outlined the challenges for Fork Delays and Bugs. However, the proposer did not provide a solution to the problem.", "q0r": 4, "q1": "The proposer provided a plan but did not provide any information about the project implementation time, except for the date of the audit. I realize that this is an incomplete plan. I recommend that the proposer add specific timelines, or estimated periods, for project activities. A detailed timeline will ensure the project stays on schedule, while also ensuring issues are fixed as quickly as possible should they occur.\nIn the Requested funds, the proposer requested $40000. However, in the budget breakdown, I see only $35000 is planned to be used for the project, and no other information about the remaining $5000 usage. Besides, the budget is not shown in detail. I recommend that the proposer describes in detail how the cash flows will work for the project, such as to whom the expenditures will be spent, for how long, and who will be responsible for those budgets. Since this is a financial and technology-intensive application, having a more detailed description of project activities and budgets will increase future credibility.\nTeam members are described as having experience working in finance and technology. However, the proposer did not provide a detailed list of the members' education and work experience. I realize this is a shortcoming that needs to be filled in, as it's hard to understand what experience the members had, and for how long, before undertaking this project.", "q1r": 2, "q2": "The proposer has specified numbers of anticipated clients, anticipated ADA usage, social media interactions, and other crucial technical metrics. However, it would be better if it comes with timelines for doing it.\nMoreover, if the proposer lacks a clear roadmap to implement the project, the team can refer to using software such as Jira or Ora software to track and manage the progress of the implementation of the plan.\nThe project's success is estimated as Lending Pond will be perceived by participants as a center for engaging in a wide range of cryptocurrency-related activities and safe to use. However, to successfully implement the above project, perhaps the proposer needs to add more important details so that the project can meet the original schedule and goals.", "q2r": 3, "assessor": "z_assessor_4076", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1}], "solution": "Imagine being able to receive liquidity for an asset without ever having to sell it. Our Dapp, Lending Pond, will allow users to leverage their NFTs and tokens through peer to peer SC loans.", "experience": "We are a team of 5, located in both Africa and Hawaii. We are founders of Pond, a lending protocol that has done over 1.5 million ada in loan volume."}