{"id": 422641, "author": "danrrodman", "title": "CH2O Africa - ADA NFT Charity 🌎", "url": "https://cardano.ideascale.com/a/dtd/422641-48088", "category": 26595, "amount": 509395, "description": "We want to help provide clean drinking water in Africa 💧.\nCharities are not transparent 💸, limited in resources, and wells aren't maintained.\n~850k deaths/year -> 1-2 lives per minute", "f6_no_assessments": 8, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 13897, "q0": "This proposal meets aspects of the Dapps, Procuts & Integrations challenge in that the proposers wish to create a non-profit organization to dig wells and create NFTs. Through sponsorship opportunities and community integration more people will be exposed to and engaged in the Cardano ecosystem. This project is heavily focused in Africa, I’m surprised it was not submitted in the Grow Africa, Grow Cardano challenge, however, the budget appears to be higher than that challenge allows.\nThe impact of supplying fresh drinking water and sanitation opportunities to a community, anywhere in the world, can be said to have a massive impact on the health and quality of life of the occupants. The problem identified by the proposal, that I have witnessed from living and traveling overland through Africa for 4 years, is that once a well is dug often the NGO or company step back, congratulate themselves and nothing else happens. Without proper maintenance, community guidance and ongoing support, water wells can become unusable, even dangerous to the community.\nUnder this proposal, to mitigate the instant solution mentality mentioned above, the proposers plan to integrate CH20 tokens tied to the well’s production that the donors 'holders’ of a transparent well would own. Once implemented, donors would have live data relaying the water flow and their contribution as ongoing data as tokens directly into their wallet.\nThe proposal goes on in detail how possible partnerships could be implemented, local artwork turned into NFTs to raise funds and the connection to the individual community. Importantly, they also detail how water quality sensors and flow data recording can report if a water source has become contaminated or the mechanics problematic, enabling local support crews to attend and maintain the well.\nThe proposers describe a list with sufficient risks acknowledged, although, with a proposal of this depth and magnitude I believe they are a little over optimistic. \nIn terms of overall impact, I rate this proposal 5 stars, due to the possible life changing benefits to thousands of people if they succeed and have a reliable fresh source of water.\n", "q0r": 5, "q1": "The proposal contains a timeline with key milestones, a fairly detailed budget breakdown spreadsheet provided as a pdf and a list of proposed staff to recruit. In terms of feasibility, there are a few key details missing in this otherwise detailed proposal.\nMy initial concern is that this proposal continually refers to building wells in Africa - it is a huge continent, which country or countries are going to be targeted? Surely this has been thought of already and should be listed in the proposal. Particular regions are easy to gain government approval to begin projects, while other areas are extremely hazardous and shouldn’t even be traveled to. Through traveling East and South Eastern Africa, I saw many of the ‘well’ based projects, in operation, deployment or in disarray. Before beginning, the proposers should gather extensive data as to where other projects are filling the market need, and where there is still a desperate need to water solutions. It's hard to assess the feasibility without this key background information.\nA second concern is the lack of information provided about the proposer and the staffing team. The proposer himself (?) identifies as a Mech Engineer with marketing, blockchain and web3 experience. Then lists his father as a civil engineer with a MS in water resources. In addition to this, detail is given for 13 or so positions needed for the project to succeed, without any names allocated to these roles. If the project is to get off the ground in the first 1-3 months as planned, with many KPIs listed, a team needs to already be in place.\nThe timeline provided is ambitious, however, achievable if they manage to hire and retain all the staff as soon as possible, and more importantly gain support from governments and communities on the ground in Africa.\nMany NGOs and organizations have proved you can build wells in Africa. This proposal is aiming to reinvent the wheel (for over $500,000), rather than work with successful partners to improve current solutions and adapt to Cardano blockchain technology. I can see their project with some degree of feasibility, however, there are so many unaccounted for variables that the chance of success within budget and this timeframe is difficult to realize. I give this project 3 stars for feasibility. \n", "q1r": 3, "q2": "In terms of auditability the proposal gives clear KPI timelines and budgets to be accounted against. They have a main measure of success, being the initial well built in summer 2023, and hopefully supplementary wells following that. They’ve stated ‘lives saved’ as one of their attributes to measure, I’m not sure this can be done, however, using the planned water quality sensors and flow rate data, they can definitely report on the other aspects listed including clean gallons pumped per well.\nThey have clear explanations how they will detail the project's successful stages, through social media, newsletters and PR. They have milestones to track within the proof of concept, technological testing, partnerships with governments phase as well as the community deployment. As stated, once the wells are functioning there will be live data available to assess the quantity and quality of water being supplied.\nIn terms of financial auditability, the pdf spreadsheet has fairly loose amounts and estimates, although they have put detailed estimates into the salaries. Without knowing which countries or areas they have targeted there is a fixed amount of $3,000 - $6,000 for each month, it would be interesting for the proposal to state who is traveling and from where?\nOverall, there is enough information to give fairly accurate auditability checks throughout the duration of the project. I rate it 4 stars for auditability.\n", "q2r": 4, "assessor": "z_assessor_3840", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Great points! \nI do have some analysis on countries, I was more looking at where existing network access is (easier tech hardware oracle integration) and also the dire need for water. \nI was sorting this need by country and then filtering by access to network. Eritrea was number 1. \n\nThis is first submission I have to Ideascale, and they mentioned to lay out the full plan. If a lower inital budget was approved, I would focus on building a proof of concept or MVP along with a team. \nIt is a very ambitious/stretch schedule. \nI do, recently, have qualified people interested in helping. As mentioned leveraging the community and attracting skilled people who align with the values will huge. \nFlights average $1500 so it was covering 2 people anywhere from 2-4 trips a month.\nThank you so much for great points and review!!\n"}, {"id": 2864, "q0": "The problem that the proposed team refers to to provide a solution, the target area is people in Africa and the problem that needs to be solved is clean water. With the literature on water resources in Africa, the proposed team has statistics and evidence leading to deaths due to lack of clean water in Africa.\nthe main aim of the solution proposed by the group is to create a well of clean water to provide to the people of Africa, with the funds required from this proposal and also to receive grants from charities , and by integrating the features of the Blockchain platform to track and also issue CH20 tokens.\n However, the proposed team still has not satisfied the issues such as African people will be able to use clean water for free, or they will have to pay for each liter of clean water used, have not seen a statement from the proposal. that people will be completely free,\n- moreover the team mentioned that issuing CH20 tokens will bring many benefits to the sponsors and apply the achievement to their brand, but the team has no plans for it yet. approach and market this model to those donors, and charities, in my opinion the group should have a plan for this as this can reduce the amount required of this proposal.\nThere are many possible risks related to water that have been mentioned and most of them have solutions to overcome.\nTherefore, based on the arguments and many issues related to marketing to charities or businesses that have not been planned, it is difficult to determine the sustainable activities of this proposal. .", "q0r": 3, "q1": "The implementation plan of this proposal will be determined by the proposed team to be completed within 12 months, and the work contents have been announced with each specified timeline.\nThe budget table to implement this idea is provided by the team with pictures, so there is no accompanying explanation and leads to many expenses that are not very clear and easy to understand, such as expenses : SC Audit in the 5th month will spend $ 50,000 for specific activities, so the team needs more specific explanations for each expense to ensure the most transparency and understanding.\nAt the same time, the information about the proposed team does not show the identity of each member and the number of core teams, for example: Haskell / Chainlink Developers, Social Media Manager will How many members are in charge of this job?\nThus, the plan is incomplete and it is difficult to determine whether the proposal will be successful or not.", "q1r": 3, "q2": "about the metrics the team proposes to provide and includes statements that will be reported on e-mails and social media and PR posts. All will be provided transparent guarantee.\nThe success of the proposal identified three that will affect our ecosystem, including: impact on community, impact on society and impact on adoption of Cardao network, in addition to this proposal Developing ideas is also the main criterion of Cardano's great desire that is to boost Africa's economy and improve people's lives,\nsuch that tracking the completed workload and verifying the success of this proposal will be easy based on the proposal's support and indicators.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 8, "ne": 2, "ng": 3, "nfo": 3, "vca_o": 1, "reply": "Impact\n- Yes, should have made clear, the charity will be providing the water for free to the African Communities. \n- The plan is to offer brands/businesses the opportunity to market that they support our project. They can show digitally what the exact number of gallons produced at any time that they as a business/brand are supporting. \n- Additional details for brand partnership are not discussed due to likely having to be extremely flexible in a growth, market awareness phase. \n\nFeasibility \nMy own personal critique regarding feasibility is whether or not Cardano is robust enough blockchain to run this project on. \nHaskell developers are broken out on the budget, please review again. \nHaskell developers are also almost twice as expensive currently due to lack of them. Other team members will work on multiple roles. Accountant is separately hired as noted, and lawyer. Social media manager will be one of the designated team members but all will help in the role. \n\nAuditability \nThis project will not be built in public and the growth and process will be mass documented across social medias, and invite people to join email list with progress reports as well. So people will be in on the progess as well as Cardano funding group. \n"}, {"id": 6375, "q0": "This is a novel idea to use Blockchain, NFTs & Oracles. The proposal wants to create a Not Profit that will dig water wells to supply clean water to the impoverished African communities. It will be a network of products such as NFTs, Oracles, and a web-based platform. First, the NFTs will be created reflecting local community traditions & values, then people donating to dig wells to supply clean water will buy these NFTs at a cost equal to digging well charges.\n\nThen well will be dug, and it will be installed with an advanced filtration system, and a hardware oracle will also be installed. With this oracle, all well-related data will be stored on-chain and utilized in the smart contract. This will ensure that the well is kept pumping and water is of good quality; if not, every party involved will be notified by the system with the help of this oracle. Apart from this, one CH20 token will be issued to the NFT holders for every one liter of pumped water. Furthermore, the proposer will create some utilities for these tokens by partnering with various brands and companies, such as raffle entries, access to special events, etc.\n\nThe proposal aligns with the challenge as it integrates Cardano NFTs, Oracles, and Smart contracts. If the proposer can execute this proposal successfully, it will add value to the Cardano ecosystem. \n\nBut the proposer has yet to hire the team and prepare the proof of concept for this new idea he conceptualized recently; I do not understand how the proposer arrived at the requested budget. Likely the required budget can vary substantially as it involves different products such as NFTs, Oracles & other developmental aspects, which may cost less or more depending upon the final evaluation. Hence I do not agree or disagree with the impact criteria.", "q0r": 3, "q1": "The proposer is a mechanical engineer and certified in Blockchain. His father is a civil engineer with MS in water resources. Unfortunately, apart from these two members, the rest of the team is yet to be hired. Hence we cannot decide on the feasibility of this project based on the teams' capability.\n\nThe proposer requested a budget of $509,395 and provided brake up based on the salaries of different designations of expected team members and the weekly hours they will work. But I am unable to how the proposer arrived at these figures without hiring the team and how he estimated how many developers or project managers would be required.  \n\nThe provided detailed plan by the proposer is separated into three stages, and the expected time of each stage is mentioned in grouped months. This is quite vague for a proposal having a considerable budget. Therefore, the proposer should narrow the timeframe to a monthly or, better, a weekly level.\n\nGiven the above points, I am skeptical about the feasibility of this proposal, and hence I am afraid I have to disagree. It would have been better if the proposer had proposed a proof of concept or a Minimum Viable Project; if he succeeds, he can build upon it and simultaneously build the community as the project's success depends on it.", "q1r": 2, "q2": "The proposer said he would show progress through newsletters, social media posts, and PR. This can be used for tracking/auditing the progress. But the project involves developmental tasks, and the regular updates on GitHub or Jira Board would have been better.\n\nThe plan only includes different milestones separated into three stages without deep technical details. Also, the timeframe mentioned besides these stages in grouped months. I suggest it be broken up further on a month or a week level. Therefore, the provided delivery dates are not clear but vague.\n\nAs mentioned above, I cannot fathom how the proposer arrived at the required amount without hiring a team and conducting a proof of concept study. Also, it is only broken up on a salary basis. The proposer should have broken it down into identifiable tasks. Because of this omission, it won't be easy to audit the progress from a budget perspective.\n\nTo conclude, I am afraid I have to disagree with the auditability criteria of this proposal as it is not easy to audit this project as the timeframe is unclear, a detailed technical plan is not provided, and the budget is not broken down into identifiable tasks.", "q2r": 2, "assessor": "z_assessor_2811", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "All three categories mention a similar point that I do not disagree with you what-so-ever! \nThis is my first proposal on Ideascale. THe instructions to me were to layout the full budget and plan for the entire project. \nI got quotes and rates and estimated timelines for the development. But the assessor is right, in that there are a ton of variable to skew the team plan and the budget. \nThe budget could skew down as more partnerships are made and less funding money is needed. \n\nIf this project is considered more of a monthly evaluation for MVP and proof of concept in exchange for a lower budget I would be happy with that. Then I could closely track the smaller tech costs and individual developer costs to build out concept. \n\nGood point on the Github/Jira Board updates. This is a unique SC and system. I would have the developers update here as well as suggested! "}, {"id": 8149, "q0": "Surely, we all know very well that Africa has a water problem. This is also the world's biggest and most complex problem. Organizations and Governments around the world have been trying to make a difference for decades now. But it seems the problem is getting worse and worse despite everyone's best efforts. One of the solutions is to dig a well and use groundwater. Charities have gone the route of building as many wells as possible, and as a result, a quarter of them stop working without their knowledge. Funding is also an indispensable issue to make that work. However, it also has limitations on transparency and whether the money is used for the right purpose. Therefore, I think that the idea of ​​this proposal is very close to reality and humane. Not only has an impact on Africa, but also has an impact on the development and practical application in the life of the Cardano ecosystem in particular, and Blockchain technology in general. In addition, this project met sustainable development goals (SDGs) such as: Ensuring the availability and sustainable management of water and sanitation for all; Ensuring healthy life and enhancing happiness for people of all ages..etc.\nThe solution of this proposal met the challenge of creating a foundation on top of the Cardano ecosystem- a non-profit organization that digs wells and generates NFTs. With potential partnerships with other charities, businesses, and major brands, this project has the potential to attract a lot of attention to the Cardano network. The author has described the solution in great detail and clarity. The method of reasoning is rigorous and reasonable. By stating the current state of water resources in Africa and the limitations of centralized charities (with the link). From there, it proves that the advantages of Blockchain technology will solve 3 problems that make it difficult for charities: efficiency, transparency and fundraising. The creation of the NFT well and how the CH2O token is valid to have also been detailed in the proposal by the author.\nEvery project is not without risks. With this project, the author has identified 4 main risks that may be encountered. Each risk has a reasonable solution to minimize those risks.", "q0r": 5, "q1": "This is a detailed plan, with specific timelines and clear goals. The roadmap is implemented within 12 months, divided into 3 phases.\nThe budget of this project accounts for 6.49% of the total budget for Challenge. The author has provided a very detailed budget. The presentation of the spreadsheet is easy to understand. The budget is allocated into sub-sections corresponding to the expenses. The basis of calculation is a monthly basis.\nThe proponent has a detailed plan for finding members who will carry out this project. The author wants to be transparent by having the community recommend people who fit the goals of the proposal. I think this project is highly community-based, so there will be a lot of talented and experienced talents in the world who want to participate. This both spreads value and attracts talent to the Cardano ecosystem.", "q1r": 4, "q2": "The project is measured and tracked progress very transparently. Show progress through newsletters to email signup forms, social media posts and PR. Measured by KPIs of partners, interested people, number of NFT buyers, email list size and open rate. When the project is active, the platform will show the water quality per day and the # of gallons/Liters pumped out. At the same time, they keep track of the project's milestones.\nThe success of the project is determined by 3 aspects: community, social impact and usage of the Cardano network. For the community, a strong Community will drive success throughout the project both on the NFT platform as well as in Africa. So success looks like a strong community that attracts, plans, creates and funds the continuation of the project. In terms of social impact, communities actually helped (wells) and people actually saved (lives). Ultimately, using the Cardano network for such a positive project would bring a lot of ADA liquidity, and this attention to the community is the right attention.", "q2r": 4, "assessor": "z_assessor_2956", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Thank you for the review! \nGreat point on attracting people to cardano through this mission. I should have mentioned that. \nI also plan to add more detail on the KPIs to include the developers to keep a Github up to date. Keep the development side of reporting up to date."}, {"id": 9596, "q0": "\"The problem of lack of clean water in Africa, charities are not transparent. I found the problem really necessary. Drinking water is an essential part.\nThe solution offered is to Build a non-profit organization to dig wells to provide clean water to the people of Africa. Proposal to Apply Blockchain platform in raising capital for charity and deploying wells. This solution is entirely workable and solves the problem. Based on the decentralization and transparency of blockchain to operate a non-profit organization.\nThe proposed product created from the solution is the Centers established in the early stages focusing on building infrastructure. The following stages are educational development and Dapp building. Establishing and maintaining new centers is necessary to continue expanding influence and impact in Africa.\nEstablished centers attract regional developers to spread knowledge and support developers building on the Cardano platform. It achieves two goals simultaneously to help develop Africa and increase the Cardano ecosystem.\nI appreciate the idea and solution to the suggestion. This proposal meets the challenge. I give 5 points.\"", "q0r": 5, "q1": "\"The proposed risks are thoroughly outlined, and there are creative and practical solutions to the problem, such as using two parallel flow meters. Make sure the input oracle data source is correct. The data will be encrypted before sending, etc. However, input data collection can be easily faked if not strictly managed. Measuring and data collection equipment should be kept safe and secure.\nThe project proponent is Dan Rodman, with knowledge of Blockchain, web3. Be the only person doing the current project. The remaining positions have been planned but have not been filled. I agree with the proponent that a nonprofit project that can help many people will attract or introduce the right people to help build the project. However, the team is an essential part of the success of a project. Good idea, but not having the right person is also a hindrance. I hope the project will be funded and find the right people to do it. I welcome what the proponent does for the community.\nThe plan table provided three time periods. Each period has specific tasks consistent with the goals of the proposal.\nThe project has a token issue. The lCH2O token is generated for each liter of water pumped up from the well, representing the project's success. Tokens that bring value to holders are benefits such as products, raffle entries, and access to exclusive events. In the future, the project may convert to the Dao model. The token will promote its value as a token in a Dao network, such as voting rights and the right to propose.\nDue to shortcomings in the team, I give 4 points.\"", "q1r": 4, "q2": "\"A proposal is asking for $509,395. The budget table is attached. I find the budget sheet very detailed. Costs include salary for each position paid per hour worked/week and fixed costs. Expenses are distributed every month. Clear breakdown. I can know what the cost will be spent on. I appreciate the clarity in the budget provided. Parameters to measure work progress results are well provided. \nThe parameters have a reasonable measure. It will be perfect if they provide more links or places to store and publish the results so that everyone can check the progress and results of the work.\"", "q2r": 4, "assessor": "z_assessor_3067", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "Great points and I agree! \nIt is a risk to not have the team fully built out. \nThis is my first submission to Ideascale and it was mentioned to submit the plans for the full idea. \nThe monthly budget approves the next run/month in the way funding is released. So the total year look is a rough estimate, knowing there is flexbility up or down in the monthly reporting. \nI already am having some promising conversations with potential great team members and yes I hope the vision and mission attracts more talent form the community. \nAlternatively, it would also be acceptable to me to have a much lower budget and focus on building out MVP / Proof of concept with a a few expenses in development and tech. "}, {"id": 10045, "q0": "many places in Africa continents do not have clean water sources, drilling wells is difficult due to resource constraints. The solution to build a non-profit organization to dig wells to help Africans have enough water resources, the proposal raises the practical problem in accordance with the situation in many parts of Africa. In accordance with the problem, the water source is exploited can be tested and measured with NFT. How is NFT from water created? Each well will have 2 flow meters that read the movement of water, with a hardware prophesy device set up to transmit pumped data directly from the well to the processor and then encrypted to the blockchain. What does this NFT do? To attract sponsors when put on the H2O Africa website and auctioned, NFT provides all the necessary information about the amount of water, quality, and well status to help donors get informed, make track of how much funding is being used for the right purposes. The idea has helped africans develop agriculture, the opportunity to fund in a transparent, anti-fraud way that charities want. The impact of the project on Africans and donors is enormous. The brand named Cardano will be known to Africans, which is also why they are learning blockchain and Cardano, which helps the development of the Cardano ecosystem. More importantly, Dapp is also made to connect donor organizations, the community will expand and can transform the charity into a DAO model. We can see all that Cardano is aiming for is being done by the activities of the project. The solution is fully in line with the challenge installed at F9. The author rightly recognized the challenge risks of the project, using the power of the community to find developer Haskell/Cardano is suitable to solve the problem of manpower shortage. Factors that can affect the technique have had timely interventions. How to minimize scientific risks and be suitable for the project.\nI rated: 5\n", "q0r": 5, "q1": "The plan for implementing the project is in line with the way the problem is solved, the time of the work is clear. Implemented in 1 year, the plan is divided into 3 important milestones. The first 3 months of PoC construction with technology to help measure water flow and quality, developing Oracle, SC and wed hardware on the Cardano platform. The plan will begin with community building and community work together. We can see with great ideas, proving that the project is for the community, proving transparency, project members are members of the Cardano community, in nonprofits, in donors. Everyone, for a goal of providing clean water, will be given jobs consistent with their capacity to contribute to the project. We agreed to join hands with the author to work together on a project that would bring common benefits to Africa. Recommended amount: $509395 accounting for 6.5% of the total budget for the F9 challenge is appropriate. True to the author's commitment to transparency in the project, the Detailed Budget Analysis Table, clear expenditures and in line with the content. We can see that the money is being used for the right purpose.\nI rated: 5\n", "q1r": 5, "q2": "With NFT we can see that the well will get specific monitoring of water flow, water quality, well location, completion time. These are the numbers that show that the project is performing as promised. Kpi author gives in line with the implementation roadmap, integrating technology with Oracle hardware is proven completed when the sample well is put into use. Donor organizations, community leaders, authorities are witnesses to the project. The reports are committed by the author to follow the schedule. We have identified the fact that the project is being implemented through a lot of authentication channels. The success of the project is determined by the number of wells completed specifically (10.100, 1000, 10000 numbers will depend on the funding community). The success of the project is the community linkage through blockchain technology, the Cardano community, the social impact on meaningful employment. The project was successful in using the Cardano network to increase ADA liquidity and increase the value of the Cardano ecosystem.\nI rated: 5\n", "q2r": 5, "assessor": "z_assessor_3144", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for review! "}, {"id": 11526, "q0": "I consider this as very impactful proposal which aligns with fundamental Cardano goals, as well as with challenge goals. Creating a non-profit with framework and NFTs to bring transparency with use of blockchain technology for charity organizations, to improve traceability of cash flow from donors to their donation usage, is a well thought idea that can bring Cardano popularity and lot of ADA liquidity. Future sustainability is achievable by creating partnerships with charities and businesses if project is successfully adopted. Project can scale and further improve its impact on globe, while delivering main Cardano to make world work better for all. This is great idea; therefore, I rate this 5 out of 5.", "q0r": 5, "q1": "Proposal clearly defines roles needed to implement every part needed and provide successful delivery of this project. What I see as big deficiency is absence of team members and their qualifications, evidence to validate proposer declared qualification and reference to some successful project deliveries from past. As stated in proposal, professional Cardano community can help with proper fill of needed roles as project mission is really tempting to join in. Budget is reasonably set for project size and provides detailed data of fund usage; every part of budget is worth the price. Timetable is defined properly and realistically. Proposal contains a lot of thoroughly though needs and reasons of what, why and how it will be done to achieve its mission. Risks and mitigations for project delivery are properly considered. With noted shortcomings I believe 4 of 5 is valid assessment.", "q1r": 4, "q2": "KPIs described in proposal are well set for tracking success of the project success. I love idea to track well’s flow of water and use of NFTs and custom CH2O tokens to track it. Progress of implementation of project can be audited as well as it contains carefully designed roadmap with 3 main milestones full of auditable items. Newsletters, social media posts and PR available to community will help public to audit progress. This is effective solution to provide transparently wells and drinking water in Africa with auditable project progress and project success.", "q2r": 5, "assessor": "z_assessor_3255", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "100% Agree in the published team deficiency. \nI am building quite the network of connections in the space and have several well-qualified people interested in helping. I do hope the vision and mission would also attract top talent to come on board and help!\nThank you for review! "}, {"id": 12653, "q0": "I very much welcome this project, it deals with transparency in philanthropy and support from benefactors and donors, As you said, the plans were abandoned and this was not approved by the sponsors support know or sometimes the organizations themselves do not know, is happening very common and has not yet been resolved satisfactorily. Therefore, the project brings a solution of transparency by Blockchain to help donors feel more secure about their contribution will be used for the right purpose.\nI love the idea of ​​allowing the local community to create NFT art like an NFT well. This is really good, it helps attract investors through display and auction activities, helps them have more sources of income and especially will bring a new community with a positive view to Blockchain Cardano.\nI think that 1 CH20 token corresponds to 1 liter of clean water, this is not only the basis for big brands, small philanthropists like me are fully capable of doing charity by buying tokens and transferring token to the object I would like to give. This is great, I will be extremely reassured that my donation is used properly and the donation process is easy.", "q0r": 5, "q1": "The proposer offers a roadmap in my opinion that is full of timelines and assignments, important tasks like conversations with government officials and community building done early. . I have no say on this part of the proposal, as I think the roadmap and budget information provided is satisfactory and fairly easy to understand. As for the team, I'm not really satisfied, you have detailed the positions that need support of the project and I know such a large amount of work will need more suitable human resources to contribute to the project, but precisely because this is a large project the information of the project leader should be provided in detail, I do not see any links or evidence regarding the experience of the proposer, you should clarify this part so that the community believes in the ability to manage projects and assign work to the team.", "q1r": 4, "q2": "I feel quite confident about the auditability of the project, the success of the project is really going to have to build a strong community, this will help the project grow and receive support, the project is doing this well when the project with high humanity and high transparency will connect people with each other. Proponents also outline how they report data collection and project progress through newsletters to email signup forms, and social media posts. But the proponent gave me a bunch of SDGs and KPIs that I don't know what would be your priority, although I know it's fine to list them in detail but you should organize them so I can understand the vision of your project.", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "Agree with comment about team! \nThe info published about the team is minimal. I do have recent \"applications\" or people reaching out to help and I hope the community also provides people who align with the vision and mission to join the team and push the project! \n\nAlso for KPIs I would like to add having the developer keep a Github up to date with the software/coding side of things that would also act as a public measure of progress\nThank you!! "}], "solution": "We are going to build a non-profit that digs wells and creates NFTs. Hardware oracles in the wells transmit a token to these NFT holders. Donors/Holders get instant validation of their contributions.", "experience": "I'm a Mech Engineer with MS in Science & Management, Certified in Blockchain (CBE) & Founder of a web3 Marketing Agency. Well connected in web3 with resources/connections. I'm a problem solver/team builder.\nMy father is a Civil Engineer with MS in Water Resources."}