{"id": 422692, "author": "despas.damien", "title": "Adaglass Platform: Deep Dives", "url": "https://cardano.ideascale.com/a/dtd/422692-48088", "category": 26595, "amount": 62475, "description": "There isn't a platform for Cardano's stakeholders to monitor and visualize the performance and growth of the ecosystem, and an investigative tool to help identify issues or opportunities.", "f6_no_assessments": 7, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1728, "q0": "Yes, the idea is very good and it is a big step forward for the Cardano community. The problem to be solved is quite clear, there is no platform that meets the needs of stakeholders in our blockchain, so that they can visualize the performance and growth of their activities within our ecosystem. As the proponents say, there is no tool that works to investigate problems and detect opportunities. And so this proposal comes in, a dApp called Adaglass would be created whose main goal is to carry out this investigative work on data. The proponents explain that the dApp will act in the part of visualization and analysis tools in relation to all doubts that say more about our blockchain. I think it is super important that this solution is developed, we are a third generation blockchain, which means that some features that already exist in other older networks on the market may not be available to our community, and if we want to act in relation to the growth of the Cardano, it is necessary that this type of investment be made. Speaking more specifically about this solution, it is based on several main points, according to the proponents, which would be promoting the community to maximize Cardano’s growth, this would be done through greater awareness and credibility of blockchain with developers. /researchers/influencers (the solution would develop more tangible material so that, for example, those who have youtube channels could understand and evaluate aspects of our ecosystem, spreading this information). There would also be more trust in our blockchain, as an investment would be made in the data, processes would all be properly correlated. This solution would also provide further expansion into new areas, as insights would be made possible through a technology called actionable decision-making intelligence - according to our proponents. Based on what was said in the detailing of the impact and also because of my understanding of what is being sought here, the proposal is directly related to the topics present in the challenge summary: “DeFi - Total value locked, the total number of users, number of active daily/weekly/monthly users + Hardware - Number of items sold, number of total users, number of interactions with hardware solution + Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases”. The proposal also fits the developers' challenge, as it will produce a more favorable environment for these people to work. The Cardano Search & Analytics service would be the heart of the proposal, according to the proponents, providing aggregated and structured data for Cardano Service Intelligence. The way the proponent explains this application to us is positive, as it is technical but not to the point that ordinary readers (like me) of the proposal do not understand well what will be developed. A paragraph that sums up well the activities to be developed is “The platform combines modern, enterprise-grade and open source telemetry, search and machine learning technologies to provide the community with unparalleled transparency of the Cardano ecosystem, helping everyone to track, learn and report on key events, actors, assets and performance indicators”. Apart from that, the proponents inform us precisely what some possible risks the project would face, including how likely they are to happen and the degree of damage they would cause to the project (rare information to be given, but very interesting); for example: heavy reliance on third-party data, applications, and interfaces. They also already provide us with possible solutions.", "q0r": 5, "q1": "The script is good, but not ideal. We know what would happen at certain time intervals within the total 5 months of project development. The problem is that we don't know when each of the actions would take place; even though we were told what the main deliverables would be (System and Application Design Documentation, CSA Backend Application, CSI Frontend Application (Enhancement with Deeper Capabilities). which are classified as in the example: CSI Application Enhancement (months 2, 3 and 4) However, among the many small actions that make up this group (\"develop high-level CSA application design, create CSA application data connectors, create surveys based on kpi of the CSA application”, etc) what would happen in month 2, and 3? more precisely what would happen in each exact month, besides also naming these months, for example what would happen in August, September, October? The second thing is that, ideally, the activities are better broken down. eg “review and iterate on initial design + develop and upload high-level product backlog”: how would design development be done? How would the interface characteristics be chosen? Speaking of usability, what would the user guide documentation documents be? What would the backlog be loaded? I wish these questions could be clarified better, so that our understanding of the development process here would be more solid. So, in my view, the script is not bad, but neither is it in the best way it should be presented. The use of the budget is also not so well explained. The total amount of USD 62475 is divided into a few parts, for example “Project Setup = USD 1,000, Product Design = USD 2,425, Stake Pool Infrastructure Execution (5 months) = USD 4,500, CSA Infrastructure Execution (5 months) = USD 9,000 (…)”. As with the script, more detail would be welcome. The construction part of the CSA infrastructure would cost 9 thousand dollars, or 1800 dollars per month. It is a fair value, but it would be even better if we knew how much time professionals in this area would dedicate to the project, so that we could calculate the value of the work hour. We know it would be 1800 for the month, but we don't know if they would work full-time or part-time for the project, for example. What content is part of “content production”? The amount requested is low in relation to the whole, but it would still be positive to understand this expense better. Finally, about the engineers who will participate in the project, we have more information about Damien than about Hugo (it would have been ideal if the two had provided approximately the same degree of detail). A lot of confidence in Damien is conveyed as he has included a short resume about himself (\"I bring a mix of management, technical and operational and expertise in areas such as business strategy, technical architecture, product design, team management, projects, software development, IT operations, user experience, and data engineering. More recently, I have specialized in technologies covering content management, e-commerce…” etc); but I still wish he had pointed out some examples of previous work and how he relates to Cardano. It is unclear whether professionals have a good involvement with our blockchain. That said, some points need improvement here.", "q1r": 4, "q2": "The auditability of progress is very good, however some things cited here are not so easily understood, for example: “we follow an agile approach that uses a combination of Kanban and DevOps practices to enable the design, development and continuous deployment of the service”. What would these Kanban and DevOps practices be? How do they work and would they contribute to the auditability of progress? In “On a day-to-day basis, all work is driven by the ongoing construction, development and management of a product backlog with work items that move through 4 delivery gates (Design, Development, QA, Live)”, again the concept of backlog is mentioned, but it would need to be better defined. When searching, I found the following definition - it refers to a log of accumulation of work in a certain time interval. Backlog is a kind of inventory of requisition/order sheets related to products not yet produced. It would be important to have this clarity, as mentioned in a previous topic. However, as auditability progresses, the proponents explain that they will keep the community updated through monthly reports, which will include (as I understand it) news on both progress (\"delivery plan, activities completed, key risks, issues and decisions the team made or encountered and a few words about the next steps”); as about some partial results. The way in which the script is built in this proposal contributes to an easier auditability, as many activities that will have to be completed are scored - for our understanding to be better, in this case, it would also be important to understand beyond what would happen and in which intervals, when they would happen - what I mentioned in the script about having more specificity in relation to the temporality of things. Overall, luckily, it's a lot of understanding about what would be delivered and where it would be delivered (\"to manage, plan, track, and report on progress, we use Jira; to help us create, collaborate, and organize information and knowledge, we use Jira.\" Confluence; to help us optimize the build-test-release cycle for reliable and continuous service delivery, we use the Go CD”). Moving on to our last topic of analysis, which is the auditability of the final success, I believe that we also have a lot of information about this, the proponents state what the results would be to watch (” page to list, search and open CSI Deep Dives, set of 11 CSI system deep dives, set of CSA APIs to give, Deep Dives data delivery support, updated Adaglass website (subscribe, catalog pages), set of project completion reports (governance) and etc) ; and also states several communication channels that would be used (medium, telegram, twitter and etc). So my only suggestion is that, in addition to these more specific data, the proponents also carry out a broader survey to understand how users would be making use of the minimum viable product in question and how this would have improved their relationship with Cardano. However, the topic is great.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1337, "q0": "The problem statement refers to the problem that there is no particular platform or environment to monitor and visualize the performance and growth of the ecosystem for the major Stake holders of cardano ecosystem. Such a platfor is required to find the issues with the same and also investigate it to discover opportunities and conclude decisions accordingly. The solution proposed is to create an analytics tool to bring data, views whic can hepl monitor and visualize to speed up the process of analysis and decision making. They have provided detailed information regarding how \"Adaglass\" project will be driven and the tech stack planning following it. They have quoted \"The platform combines modern, enterprise-grade and open source telemetry, search and machine-learning technologies\" and these technologies will help provide tranceparency and the users can track and learn from reports generated wrt key events, assests and performance indicators.The team in this proposal is planning to build over their MVP to bring in investigative tool(Deep dive). This way the proposed solution effectively addresses the challenge.", "q0r": 5, "q1": "The proposal mentions that the proposers are a team of 2 engineers with combined experience of around 2 decades in IT industry and have provided multiple end-to-end solutions and services accross different domains such as Cloud, Data etc for public and private sector clients. They are planning to grow the teaam with additional frontend and backend developers to effectively complete the project. The team lead Damien Despas is working as CTO in cunsulting and digital marketing and has blend of management, technical and operational expertise in multiple areas, along with Hugo Allamel who is working as Engineer to operate infrastructure in domains of cloud and security. The team according to me however \"IMHO\" would definitely benefit including someone from with background in Blockchain specifically cardano into the team which can help them aechitecture the solution in better way with his./her exposure and root level requirement and expertise required to go beyond MVP and reduce dependency of CSA which the team has recognised as risk. The proposal how ever is a continuation of previously funded proposal where they have successfully built MVP for the same without a blockchain resource so this is proposal is likely to be implemented successfully based on the detailed plan of action and risks mitigated.", "q1r": 4, "q2": "The proposer have put up and neat proposal addressing the problem statement recognised by the team and the solution that they are planning to implement. They have provided detailed timeline and respective plan and deliverables such as \"System and Application Design Documentation\",\"CSA Backend and Frontend application enchancement\" etc and the details on month wise process help inaddition to track the progress.The team has also provided detailed budget break down for each of the phases of solution implementation of 5 months along with payment for 2 additional resources. They have also mentioned details about the deliverables and key metrics such as number of CSA systems, different page lists and application features. These set of details are sufficient to audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2228", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1}, {"id": 6258, "q0": "The proposal seeks funding for bringing their Operationalization Phase to the next level by building the next iteration on top of our MVP, developing further the Adaglass operations and team, and increasing overall value to end-users with additional free features. Primarily, they will focus on bringing to market an innovative investigative tool (Deep Dive) and enriching their catalog of metrics with additional Tier 1 indicators.\nThe voter needs some background to understand that. Adaglass, where funded in F8 with a proposal “Adaglass Data Intelligence Platform” the funding was $74K. https://cardano.ideascale.com/c/idea/397768\nThe proposal then outlined the deliverables: The MVP is composed of the following deliverables:\n\n\n\nSystem and Application Design Documentation\nADAG Stake Pool\nCSA Platform (Staging and Production)\nCSA Back-end Application\nCSI Front-end Application\nUser Guide Documentation\nAdaglass Front-door Site\nCSI Application Overview Video\nEarly Adopter Marketing Campaign\n\nThe current proposal deliverables are: System and Application Design Documentation\nCSA Back-end Application (Enhancement with more metrics)\nCSI Front-end Application (Enhancement with deep dives capabilities)\nUser Guide Documentation (Enhancement)\nAdaglass Front-door Site (Enhancement)  \nAs the voter can see, this proposal is for the enhancement of the features previously developed, or not yet developed( we don’t know I could not find a report for that).\nTherefore, the only line where we could see that this proposal is maybe in line with the challenge is in key metrics to measure of the challenge brief “Increased quality of existing products & integrations through suggested improvements that is supported by customer feedback or increased usage by the community.” However, since the MVP is not released to the public and there is no feedback that improvement is needed, I do not believe that this proposal matches even this line of the challenge brief.\nDear proposer, maybe next fund there will be a challenge more suitable for your project, please read carefully the challenge brief of the challenge you are going to apply in and just to be certain contact the Challenge Team and ask them directly if your proposal is in line with the challenge.\nI disagree that this proposal effectively addresses the challenge.\n", "q0r": 2, "q1": "This proposal considers several very specific risks for this project and provides meaningfull mitigation solutions.\nThe plan presented is exemplary, lacks specific dates for a given tasks, however this could be due to the parallel development of several tasks at the same time. \nThe budget of the proposal is well broken down, the only thing missing is hours of work and hourly wage for the developers.\nAs a part of this proposal the team will grow with 2 new devs, front end and back end. \nIn the PA Guide is specifically said that “Proposers are now being prompted to give info on how they are working out their pay rates.” We don’t see such clarifications here.\nThe core team is presented very well and the presentation is supported by active linkedin accounts.\nRegarding the further funding from Catalyst here is what the proposer has to say:” Phase 2 focuses on monetizing the platform by offering new plans and starting to propose premium features to more active stakers. Our first paid plan will take benefit of existing features and building blocks offering custom capabilities for our Homeview (F8 proposal) and Deep Dives' (F9 proposal) capabilities. From that point onwards, we anticipate reaching our break-even point to be self-sufficient for future development and growth.”\nI agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "The proposer has a system of monitoring the progress of the project and issues a monthly progress reports to the public. The proposer states that he publishes all reports trough social media but does not provide handle where the community could find them. On the proposers website we see the proposer does not have public channels on social media and an email is the only way for contact.  The proposer says they will open the channels once they are in a position to actively maintain them. At the present moment Username @AdaglassAnnoucements not found. https://adaglass.medium.com/ Adaglass hasn't written any stories yet.\nThat means the proposer did not provide public access to the reports for the progress of the F8 funded proposal and this proposal will be without progress reports until these channels open. \nOther than that the proposal has good project success metrics that are concrete and it will be easy to audit by.\nI neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 3, "assessor": "z_assessor_2795", "no_vca": 6, "ne": 3, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "We would like to thank the assessor on the review provided. The feedback shows a real interest in understanding where Adaglass stands to date. Two main concerns were raised.\n\nFirst the assessor outlines that this proposal might not align with the challenge, due to both (1) a lack of clarity between what our funded F8 poposal will deliver in comparison to this new F9 proposal, and (2) missing customer feedback to justify the integration of additional metrics into the platform.\n\nSecondly, the assessor highlights the poor amount of public content available to date on social channels regarding the progress of our Fund 8 proposal scope, this causing confidence issues.\n\nWith regards to point 1: we strongly believe that the proposal meets the scope of the challenge, which is broad in this round, from both a product development and data integration standpoints.\n\nRe product, this proposal aims to build a new and isolated analytical tool on top of our in development MVP. The MVP funded as part of Fund 8 solely focuses on building the Stake-To-Subscribe user journey, 50+ tracked metrics and our bluechip Homeview dashboard; whereas the scope of Fund 9 is to build the Deep Dive product into the platform (defined in details in the proposal).\n\nRe integration, this round proposes to add another and small set of Tier 1 metrics that was identified but not prioritized as part of our Fund 8 design work that happened in June 2022. Metrics are the heart of the platform. Tier 1 metrics are readily available and not resource heavy metrics to process, available for free. Supporting as many as possible metrics intrinsically brings more value to end users. We see this as continuous improvement based on team inputs and not user inputs just yet based on the state of the project. Adding metrics requires integration with new data sources.\n\nWith regards to point 2: we would like to highlight that our focus has been to date (since beginning of June) to progress the design work and start the build of the back-end components over the management of the social channels. We take on board the assessor feedback and understand the importance in priority that pushing our updates is as critical as the development of the platform to reach success. We will make our reports available shortly. For information, reports are sent monthly through the Catalyst internal process, and one progress report has been sent out so far.\n\nWe hope the above helps clarifying the concerns raised. You can contact us on https://t.me/AdaglassChat if you have more questions."}, {"id": 6629, "q0": "The proposal intends to extend their previously founded project Adaglass with deep dives, an investigative tool that probably would be useful to a number of stakeholders in the community as it will provide detailed data and visualizations. What kind of metrics and Tier 1 indicators they are going to add to their investigative tool, and what makes it unique, is unfortunately not mentioned. There are already community-driven analytics tools and sites for our ecosystem; cardanoscan.io, pooltool.io, Cardano Blockchain Insights (datastudio.google.com), to name a few. The proposers have addressed this in a slide, noting that there are a lot of (fragmented) tools and that their goal is to bring everything together in one analytics platform. The identified risks and mitigations are well described.", "q0r": 4, "q1": "The small team seems to have the qualifications necessary to make this project successful, based on their descriptions and what is verifiable on their LinkedIn profiles. In addition, and budgeted for, they intend to grow the team with an additional front-end and back-end developer. The timeline and key milestones are clearly and extensively described and seems achievable if tackled full-time. The team is following standard agile practices and the matching budget allocation aligns with each aspect of the build. When this plan is followed, there is high chance this project will meet its goals.", "q1r": 4, "q2": "The proposers are following an agile approach with the usual Kanban practices. A monthly report will be made based on completed stories, and key achievements and published to the public as a blog post, medium article and notifications on social media. Since the Adaglass project has already started after previous funding rounds, I would have expected some audit reports on the telegram group and medium site they created before. Unfortunately, nothing has appeared on both the mentioned communication channels since they were created, with no posts whatsoever. Also the adaglass.io website is basically empty and contains placeholders to a future app, API, and analytics tools. There is no indication where they are in the previously published roadmaps, which lowers the confidence in the success of this proposal in my opinion.", "q2r": 2, "assessor": "z_assessor_2823", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "We would like to thank the assessor on the review provided, who pointed out the poor amount of public content available to date on social channels regarding the progress of our Fund 8 proposal scope, this lowering confidence in future success.\n\nWe would like to highlight that our focus has been to date (since beginning of June) to progress the design work of our Fund 8 scope and start the build of the back-end components over the management of the social channels and publication of content. We are new to the Cardano way of doing but we take onboard the assessor feedback and understand the importance in priority that pushing our updates is as critical as the development of the platform to reach success. We will make our reports available shortly. For information, reports are sent monthly through the Catalyst internal process, and one progress report has been sent out so far.\n\nWe hope the above helps clarifying the concerns raised. You can contact us on https://t.me/AdaglassChat if you have more questions."}, {"id": 8596, "q0": "According to the author of this proposal, there isn't a platform for Cardano's stakeholders to monitor and visualize the performance and growth of the ecosystem, and an investigative tool to help identify issues or opportunities. And I agree with the notion, yeah. However, I would want this kind of proposal to offer pertinent information to back up their statements. As a solution to this problem, the team introduced an Adaglass platform: Deep Dives, a unique investigative tool, users can speed up analysis to achieve faster decisions. I find that the proposed project addresses the challenge in many different ways, and there is no need for me to rephrase the major benefits this proposal would bring to the community since the author of this already goes into detail describing all of them. I also believe that the problem statement and solution quite match the content of the roadmap of this proposal. This proposal surely will add something to the ecosystem, thus there are no similar solutions already to compete with this one, making it more unique. Overall, the proposal will have an influence on the community if it is implemented.", "q0r": 5, "q1": "The fact that the team has already identified its intended future main deliverables is extremely optimistic for the project's viability and long-term growth. It's wonderful to see that the team has already considered the technical approach and how they will go about putting this proposal into practice. The plan makes it very clear what is intended to be accomplished and what is required to do so within a specific time frame. The team should produce a timeline table, which will provide a better overview of when each task is completed and in what order. That is the only recommendation I offer. Budgetarily, $62,475 is the proposed amount of the fund, which will last for 5 months. The budget is defined in detail, divided into distinct sections, and appears appropriate. In my opinion it could have been split further, rather than giving up a big $13,750 number as salary for each front-end and back-end developer, the team could offer more info, for instance : what is their rate per hour/month, and how many working hours a month? The reason why I expect an hourly rate is because it is the most suitable way to determine the salary’s fairness in comparison to today’s market value. This proposer doesn't allow any room for doubt in regards to the team in charge of this project. They provide crucial components in a subtle way, I mean. Regarding the team members, two individuals have already committed to the project with management, technical, operational expertise and a level of understanding of IT operations, engineering and cybersecurity. They have been able to bring together a very diverse mix of skills and knowledge from many different sectors. Referrals were given via LinkedIn, so experience can be supported by that. The team is also thinking about adding 1 front-end developer and 1 back-end developer to the team. They also provide a general summary of what the new members should do. That is a significant plus. They undoubtedly possess the technological know-how to get the desired outcome, in my opinion. Overall, a really well prepared proposal, and I wholeheartedly believe that with the experience and strategy provided, there is a very good chance this proposal will be carried out successfully.", "q1r": 4, "q2": "There is a clear simple problem described that has a clear, so straightforward solution. The main deliverables and the success metrics are all included here, and they are all reasonable and in line with the project's goals and the objectives of the challenge. The plan implementation timeline has been laid out, and everything will be simple to audit thanks to the precise financial breakdown. Four delivery channels are mentioned that help with communication and updating the community on progress, such as the site blog, Telegram, Twitter, etc., but no direct links have yet been supplied. Since it won't take me long to discover the link myself, I don't think this is a big deal. Additionally, a section detailing the risks is presented. This enables the community to keep the concerns in mind while they audit the challenge's progress. I must congratulate the team for their efforts in determining the probability and impact of each risk, as well as for coming up with comprehensive mitigating solutions.", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9152, "q0": "\"This proposal has the idea of wanting to develop the Cardano ecosystem better by creating a platform called Adaglass. It brings data, views, and analytics tools in a user interface that is both intuitive and engaging, allowing Cardano stakeholders to gain end-to-end visibility, instant insights, and actionable intelligence. Everyone can track, learn from, and report on important events, actors, assets, and performance indicators thanks to this platform.\n\nThe Cardano Search & Analytics (CSA) service, a fast and scalable search, and analytics engine, is the heart of the Adaglass platform, assisting in the collection, normalization, enrichment, aggregate, and sharing of data and metrics originating from a wide range of data sources. They will first concentrate on bringing an innovative investigative tool called Deep Dive to the market. \n\tAdaglass is a one-of-a-kind platform and suite of products designed for the Cardano community and ecosystem.  The project tackles the challenge in a variety of ways. It connects to a wide range of data sources including on-chain and off-chain data, providing the Cardano community with valuable data. Through the above information, I feel that the team is very enthusiastic and dedicated to growing the strong Cardano community, increasing trust, and discovering new opportunities with greater transparency and accurate data, unbiased and correlated.\nI find it very interesting that the team makes predictions about how the risk will affect the project and they also have specific methods for dealing with it.\n\"", "q0r": 5, "q1": "\"The defined plan for implementing this proposal is clear including key tasks and timelines for implementation of these tasks. The budget is covered for up to 5 months for the first phase of new feature development and operational needs post their MVP effort. \nCurrently, their team consists of 2 engineers combining 20+ years of experience in providing end-to-end IT and digital services. They are still the key to the project's success with their proven experience through the attached LinkedIn link.\nIn addition, they have a long road map in 4 phases to deliver their vision and objective to provide a one-stop-shop that helps answer any Cardano questions.\n\"", "q1r": 5, "q2": "\"The team specifically describes the delivery services that help them manage the project effectively and the channels that facilitate communication, keeping the community informed about the progress of the project.\nThey will create a set of deliverables that will demonstrate project success and completion of key milestones in the delivery plan. Some of those deliverables will easily be accessible by everyone browsing the site, but some others will be made available on dedicated channels such as medium, telegram, Twitter, and the Adaglass blog.\nIn addition, they will validate their delivery test meets at least the high-level acceptance criteria they outlined in the proposal. \nThey also provide a proposal related to the project and people can refer to it.\"", "q2r": 5, "assessor": "z_assessor_3023", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12655, "q0": "The project solves the challenge. As you said, it is difficult to get to the knowledge of Cardano in the beginning, a platform that is capable of continuously updating Cardano related data and responding to demand. user research. So I very much welcome this project.\nI think the process of connecting to a large amount of project data sources is great. You should have different update methods for each type of data. For example, some data can be automatically updated via Bot or AI, this will be very easy when your team has a lot of experience. But some data can only be manually updated, I think the solution to this problem is to hire a full-time person to handle this.\nI have no questions about this part, as the information on its features and the evidence of its impact provided is satisfactory.", "q0r": 5, "q1": "Based on the information presented in the proposal, I am quite confident in the feasibility of the project. The project roadmap is quite complete and detailed with timelines I consider reasonable. You help me understand the amount of work that the team undertakes through each stage. The development of the team is absolutely right, the team of 2 people is provided with full information and education background, they are very years of experience in related fields, but a large workload can put pressure on your team, so I agree that you will spend your budget on additional staff.\nI understood your long-term vision of the project, and it has great potential. Returning to later rounds of funding is essential for such a project because the quite important issue of the project is the budget part. I propose the project will develop a number of Cardano educational paid courses on the platform to meet the needs of newbies.", "q1r": 5, "q2": "I was quite impressed when the proponent tried to detail the plans for updating the project progress and related survey data. This shows that the working group is willing to publicize the work information so that the community can easily check the results and the team is really serious when implementing this project. The conditions and facilities provided make me convinced of the success the project. In the end, I found the audit process to be excellent, I couldn't ask for more.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Adaglass uniquely brings data, views and analytics' tools to help answer any Cardano questions. With Deep Dives, our unique investigative tool, users can speed up analysis to achieve faster decision.", "experience": "We are a team of 2 engineers combining 20+ years of experience in providing end-to-end IT and digital services across CX, Cloud, Cyber, Data for public and private sector organizations worldwide, working in companies operating across UK, France and Switzerland."}