{"id": 422745, "author": "mushroommobnft", "title": "Cardano for Self-Care", "url": "https://cardano.ideascale.com/a/dtd/422745-48088", "category": 26595, "amount": 24500, "description": "The Cardano community often struggle to prioritise their wellbeing. Many want to improve their health, but don’t know where to start.", "f6_no_assessments": 9, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 7204, "q0": "The problem presented in this proposal is that there is not enough promotion to health and wellness within the Cardano NFT space, I would disagree that the space overall is unhealthy, but the solution to that is developing a dApp that encourages self care and well being. Being active and physically and mentally healthy is a chore for the average person, who goes to work and comes home in a cyclical manner. Routine is key to a healthy lifestyle and the proposer aims to promote healthy living through the use of a Cardano based dApp that will complete activities in accordance to their mood. As the user performs more tasks, they'll be able to earn rewards which can then later be converted into non fungible tokens. The user's profile will be tracked on a monthly basis by how many challenges they've successfully done. Those challenges are geared towards mental, physical, spiritual and social categories in which the dApp will assign once the user rates their mood. If the proposer could solve the problem by using the dapp's functions to get users engaged in a more healthy lifestyle, and increase happiness or at the least have them do something positive, it would be a win win. Using the Cardano ecosystem and it's thriving NFT community as a starting point, this creation and development of said dApp could have a great positive impact on those users and NFT enthusiast who are most likely fine without it, but be given a little encouragement, could gain rewards while feeling better externally and internally. The impact of this proposal is given a 3 based on the probability of this reaching a wider audience.", "q0r": 3, "q1": "The proposer has outlined a solid and sensible budget to be accomplished within a 3 month period. It may very well take longer than that, though with an already working design, it might be doable. Having a team already in place, the proposal shows a core team being experienced with Cardano NFTs and in the health and wellbeing. The team consists of core members capable of web development and blockchain smart contracts along with the most important aspect of the solution to the problem being healthy living. Audrey and Scorchill sited in the proposal are mental health professionals with the education credentials to certify themselves as team members focused on the community's well being. LinkedIn profiles can be found for all members within the proposal. There's a clear understanding that developing the dApp and managing an existing community that's being built and growing will take time but with the use of online project management, the team is confident it can stay on task and deliver a working product if funded. The budget is well defined and breaks down the cost efficiently for the tasks involved for implementing the solution proposed. The feasibility of this proposal is scored a 5 as the team is more than capable of promoting healthy choices while making it fun with the existing NFT community members by adding rewards through a dApp that seems challenging and fun all while staying healthier.", "q1r": 5, "q2": "The auditability of the project and it's team are not well defined in regards to keeping Project Catalyst up to date on the dApp development progress as well as the community growth which is hoped to grow by 10%. It is more so after the completion of the roadmap and milestones are met, that the rate of success will be achieved by looking at the number of downloads and interactions with the dApp itself. This proposal would be best if those milestones were recorded in a transparent way to ensure publicly that all funds are being allocated and the tasks needed to be finished to implement the solution are being completed on time. Using GoogleDocs or Github services could be a better solution for sharing the progress of the team and the development that's taking place if and after being funded. The short to long-term goals is the overall promotion of well being within the Cardano community and the biggest challenge may be using the roadmap's Advertising Campaign to accomplish a larger user base once the dApp is available. For Auditability rationale, this proposal is given a 2 based on the lack of transparency with the information provided.", "q2r": 2, "assessor": "z_assessor_2883", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 4900, "q0": "The proposers want to create a dApp to incentivise users maintaining regular health care activities. \n\nThe proposal talks about health care and the importance of maintaining regular activities. It also talks about various aspects of health: mental / emotional, physical, spiritual and social.  Through this, the proposers display their expertise and knowledge that tends to gain the reader's confidence in the proposal.\n\nThe dApp has the function of recommending the kind of activity based on the inputs by the user about his mood, level of energy and how much time and effort the user wishes to expend on. It prompts the user upon completion of the exercise to share his experience. Users  will be given incentives, NFT as rewards, for their efforts and sharing through the Discord community. The dApp's discord will run a wellbeing challenge every month.\n\nThe creation of dApp and integration with other platforms do meet the challenge criteria and the campaign in that it increases value and uses to the Cardano community.\n\nI therefore strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposal has a three-month plan to complete and launch the product. The stages involve product design, technical design, and product development. Accordingly the budget requested is 24500 USD with the highest amount allocated to the coder. Budget is also allocated to advertising and campaigning. In addition an amount is reserved for incentives for users.  I don't quite understand though the budget item 'Focus Group' which is USD 2000 for 2 months. I wonder whether this refers to the community engagement, resources/ content development as stated under the heading \" ….. details of the people who will work on the project\" related to graphic, game and experience designers who will give advice during the development stage.\n\nThe team consists of a project manager who is a registered clinician with a Master of Health Science, software developer, and clinical advisor who is a registered mental health clinician. Also, brought in a group who will provide advice at the product development stage.\n\nLooking at the plan,  the credentials of the team members and the budget asked for,  the team should have the quality to get the plan through. Therefore I strongly agree that it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal does not provide information about the project progress and how to measure.  \n\nIt does expect success of the project. It states that in the short term, the discord community would increase by 10%. At the mid term, the dApp is expected to reach 20 downloads, discord community would increase by another 10%, establish a 3 partnership and more with other projects for the rewards system. In the longer term, there is an improvement within the community, the mental and overall well-being as determined by the qualitative and quantitative data (no goal set), more partnerships (by how many?) are established.  \n\nI am not clear in which channel the progress and success will be reported.\n\nDue to the absence of some information, I therefore settle not higher than 4 rating, to agree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2631", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5288, "q0": "The Cardano for Self-care dApp proposal is to promote self-care by creating a dApp that suggests activities based on user mental, physical, spiritual, social healths (holistic health model). Users can share their completed tasks, and get rewards as points. There will be monthly wellbeing challenges for users to complete. It is likely to be the first dApp on Cardano focusing on Self-care and well being. This self-care is one effective way for mental health promotion and reduce suicide risk and improve overall health of the ecosystem. The mushroom mob team has launched an NFT project and they are active in promoting art and mind medicine. The team will manage their workload and convert ADA to Fiat currency to manage risk of project. This proposal effectively addresses the Dapp, Products & Integration very well as the Dapp will bring impactful use case and increase Cardano adoption. ", "q0r": 5, "q1": "Although the artwork will be sourced directly from Mushroom NFT, I would like the proposer to consider using arts from other creators as well as variety always a good signal to the healthy platform. The project will take around 20 weeks in total (working hours should be added on the proposal). The total requested budget of $24000 is reasonable for the design, development and test launch although the proposal could do more with budget breakdown, roadmap and milestone as they provide task overview. The Mushroom Mob team has been working closely and they are advocates of health and wellbeing. It is likely that the proposal will be implemented succcessfully. They will be in touch with game & graphic designers upon funding. ", "q1r": 4, "q2": "The mushroom mob team success is well structure into short term, medium term and long term and they have set the target of Dapp downloads, discord community members, member interactions (when they organize well being challenge) as well as partnership for their reward systems. They should consider using twitter, medium or discord to update the public on the project progress regularly. This will make the project easier to audit. ", "q2r": 4, "assessor": "z_assessor_2684", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6260, "q0": "This proposal seeks funding for the development of a simple self-care dApp that incentivizes people to maintain a good baseline of wellbeing.\nThe problem is clearly explained, Cardano community struggles to prioritize wellbeing over work.\nThe proposer says that to his knowledge Cardano at the moment does not have a dapp focusing on self-care.\nThe project being a dApp development is completely in line with the Dapps, Products & Integrations challenge.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer presents a website for their developed NFT project on Cardano. \nThe proposer foresees rather common risks that most proposers on Catalyst face and provides mitigation strategies. However there are no project specific risks discussed.\nThe plan that the proposer presents is with sufficient detail although not excessive. The whole span of the project is 3 months.\nThe budget is presented by position-monthly remuneration, number of months, the proposer does not specify if this is a full time job.\n In the PA Guide is specifically said that “Proposers are now being prompted to give info on how they are working out their pay rates.” We don’t see such clarifications here.\nThe team of the project is presented by 3 people, two of them, the founders with linkedin profile, the third person – Clinical Advisor does not have a CV or linkedin account presented.\nThe proposer will return to Catalyst for further funding for future ideas.\nThe proposer does not have other proposals in fund 9.\nI agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "The proposer has very well defined milestones with vague timeline and measurable, concrete numbers against which the project progress/success could be measured.\nThe proposer does net clarify where these numbers could be found from the community and does not provide many milestones that can be used to track the progress of development of the dApp.\nI agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 4, "assessor": "z_assessor_2795", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6497, "q0": "I would completely agree that there is a problem in the Cardano community where people are working too hard and don't focus enough on their health. Especially lots of these projects that are working tirelessly each day to ensure that they meet the requirements and wants of their community. Creating a Dapp that can promotes the idea of self-care can be important. In the proposal it suggests that it will be a Dapp that helps monitor your self-care and will reward you when you accomplish certain steps. You can then trade in points to receive rewards such as nfts. This can be a really cool project. It would be interesting to see implementation of other nft projects that could partner with this project in promotion of self-care. The proposal does a good job on addressing the challenge. I would suggest looking into other partnerships that would help support the idea of self-care in the community. For these reasons. I give this section 4 out of 5 stars.", "q0r": 4, "q1": "The proposer has experience in web development and smart contracts. This will be important to help suggest a good proposal. They have a section on the team that talks about each of the members on the team. It is great to see names with linkedin accounts. This helps promote the idea of accountability because people will know who you are. This suggests that the project will more likely implement their proposal successfully. The plan gives a detailed roadmap on what they expect to see happen in the future and how it can benefit many users in the Cardano community. There is an obvious use-case for this proposal and will likely be successful if there is a specific way to hold the team accountable. Maybe consider thinking about how the principle of accountability can be implemented into this proposal to help show the community that it will actually be implemented successfully. For these reasons. I give this section 4 out of 5 stars.", "q1r": 4, "q2": "The information provided in this proposal is written very well. There is a clear approach to their ideas as a team and how they will implement their proposed idea. The detailed budget breakdown is a great indicator on the likelihood of the success of the proposal. The proposal includes an exact timeframe of when things will be finished, and it shows exactly what the potential funds will be used for. This is important because it shows what the team plans on working on throughout the process. The only question that should be considered is how will the team ensure that this proposal will be implemented if granted funds? Who will be holding the team accountable to accomplish this Self-care Dapp? Maybe include something that will help other proposers to believe that this proposal will likely be successful. Think about how the community can audit the projects progress. Even the discord idea could be a start for this implementation. For these reasons. I give this section 4 out of 5 stars.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8597, "q0": "It is a fact that the Cardano community often struggles to prioritize their wellbeing, not to mention that many want to improve their health, but don’t know where to start. So as to address this problem, the author proposes to create a dApp that encourages regular self-care activities with incentives, social feedback and monitoring to maintain a good baseline of wellbeing. I liked the overall idea, the appropriate solution, and the general stated activities and milestones, which seemed like a reasonable idea to me, not only for the required investment value but also for the whole proposal. Similarly, I felt this proposal to be highly relevant and in accordance with the goals of the challenge. Also, I like how the proposers give well-designed project constructions so that we have a clear image of how this Dapp will work as well as demonstrations of its value. Such a project would have a positive influence on the Cardano ecosystem, and if implemented efficiently, this solution may easily scale up. I wish it had included more information aside from the actual growth process. Consider marketing. How do they plan to advertise the dApp? This might have been stated more clearly. If the proposal included more of those features, it would become increasingly important to the Cardano ecosystem owing to outreach.", "q0r": 5, "q1": "There is indeed a dedicated team working on this. It is really encouraging that the team has already established connections with our community and other Cardano NFT communities, as well as a reputation as health and wellness advocates. The core team's knowledge includes a diverse set of talents, which may justify their capacity to carry out this project. The team resumes are verified using linkedin connections, making it simple to assess their expertise and skill, as well as previous work. I've noticed that the proposers mention advisors who will give guidance during the development stage, but I can't discover any information about them. I would advise the team to provide their names and also a brief summary of their backgrounds. As for the total amount of $24,500 requested for 3 months of design, development and a test launch, the budget mentioned seems reasonable given the time and tasks that will be put into the project. The team clarifies how it would be distributed, which greatly enhances the proposal. That is a reasonable financial breakdown, however the cost of launch could be more specific. What, for example, is included in \"Advertising Campaigns\" and \"User Incentives\"? Perhaps a brief breakdown here would be beneficial and more accurately reflect the budget's fairness. The roadmap and milestones for the accomplished plan are practical, transparent, and objective. The proposers outlined what needed to be done in order to implement the Dapp and then split it into detail with a clear timeframe and activities to be completed. But it is usually better to know more, such as which expert will participate in which activity and if these activities will be accomplished sequentially or simultaneously.", "q1r": 4, "q2": "I firmly believe that the information provided is adequate to audit the proposal's development and success. The proposal clearly defines success criteria and key metrics to be monitored. There are various KPIs displayed in a structured and chronological manner. The author clearly goes out of his way to describe the definition of success in the form of a short-term, mid-term, and long-term roadmap. There is a high level of detail in each KPI. These KPIs are added in conjunction with the roadmap and can be used by the community to get a sense of how short-term and long-term success will appear. The team improved the proposal's clarity by adding a few statistics and quantifying the KPIs. Furthermore, I appreciate how the proposal precisely defines how the community may stay up to date with the project via the Discord server. The executed plan is understandable, and the milestones provided make it simple for voters to follow progress. There is already mention of potential risks such as workload and currency exchange volatility, but if the proposal also included a short text on some potential challenges that could arise during the development of this project, it would increase the community's trust in the team's credibility and competence in completing this project. For example, what happens if they run into challenges during the technical design stage, and how does the team plan to deal with unexpected events?", "q2r": 5, "assessor": "z_assessor_2992", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12049, "q0": "The proposer stated the problem very well and clear. Wellbeing should be a priority for human beings and more over for Cardano community but everyday obstacles make it difficult and most of us we don't know where to start. The team will encourage self-care activities through dApp with incentives, social feedback and monitoring to maintain a good baseline of wellbeing. Wellbeing is a huge subject in life and concerns almost everybody.  Since, on proposers' information, there is no such dApp in Cardano community focusing on wellbeing and mental health, they anticipate that Cardano community will engage with the dApp and participate in self-care activities. This proposal can encourage new proposal creations about self-caring and prioritizing wellbeing.", "q0r": 5, "q1": "The team has already launched an NFT project focusing on improving mental health. This team are experienced working together. They have the necessary skills and experience to complete this project. A short resume, links and references are provided for all the members of the team.  Budget is realistic and reasonable to achieve the set goal. It is broken down and understandable. No additional funding is required to implement the proposal. A detailed plan with actionable tasks is given by the proposer. Although the team has indicated the risk of existing workload they will be using open communication and online project management software (e.g. Trello). The timetable given is doable.", "q1r": 5, "q2": "The proposer gives a detailed roadmap, timetable and key milestones. The team seems well organized and the members of the team have the skills and experience to complete the project in time. They have also engaged with Graphic, Game and Experience Designers for advice during the Development stage if they get the funding.   The KPI's for the success of this project are measurable in short term, mid term and long term and Cardano community can track its progress.\n", "q2r": 5, "assessor": "z_assessor_3338", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14744, "q0": "\"It was an interesting idea that the proposers linked the crypto world with the promotion of health and well-being. The demand for promoting well-being is urgent, since the arises of modern technology and economy has led to sedentary lifestyles among people. \nThe app is not too complicated and quite user-friendly. The users input their mood, energy, and efforts level they want to spend. The output of the app will be the recommended activities as well as their descriptions. This app will tackle into four main health areas: mental/emotional, physical, spiritual, and social. After finishing the activities, users have opportunities to reflect, share with the community, and receive awarded points that can be converted to rewards such as NFTs. \nApart from the risks mentioned, I just wonder how to verify that the users actually complete the physical tasks? Because from my experiences, for current health care mobile apps, even the users do not complete the tasks, they just tick “finish” button and tasks are done. \nStill, I think this is a meaningful project to promote human well-being. If this project is successful, a great deal of healthcare-oriented people will join to the Cardano ecosystem. This solution is aligned with the challenge. \n\"", "q0r": 4, "q1": "\"A road map was provided, as well as an estimated completion time. However, in my view, the roadmap should be divided into a number of smaller sub task processes each with a specific due date and, if at all possible, a method of implementation. For example, the graphic and UX design may consist of several subtasks, and proposers may have clearer explanation on the platform design. \nThe budget breakdown was provided. But in my opinion, the budget should be in accordance with the roadmap, and the proposers should attach the explanations for the costs. For example, why does the “Advertising Campaigns” cost $1000 per month? The core team comprises of several experienced professionals in terms of health and blockchain, so I think the human resources were sufficient for the feasibility. \"", "q1r": 3, "q2": "The provided KPIs/metrics were sufficient, and the target goals, which depend on the short-term, mid-term, and long-term periods, were attainable, in my opinion. Since the project was related to health thus the Sustainable Development Goals Rating was used here. However, I would like to recommend the proposers to have some form of progress announcements to the community, for example via social media to increase the auditability of the project.", "q2r": 4, "assessor": "z_assessor_4098", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14884, "q0": "This project proposes to create a Dapp that can support and encourage users to go simple self-care activities with rewards as NFTs. The team expects that with this completely new self-care App in Cardano ecosystem, i will help users have a better physical and mental health. The app also can integrate with other applications to bring monthly task completion rewards to users. However, the impact of this application is still ambiguous, for example, the team expects the number of app downloads in the mid-term to be 20 downloads, which is a small number compared to the budget spent. In addition, the increase in Discord Community size does not correspond to the number of App downloads. In the short term the community increases by 10% while in the medium term the number of App downloads is expected to be only 20 times. The team needs to reconsider and present a better impact list.", "q0r": 3, "q1": "The first thing I noticed is the detailed plan has provided tasks to make an App technically, but miss the steps of creating the content (exercises, activities...) which is an extremely important part, the factor that attracts users. The second thing is the budget for engineer salary was calculated only for 3 months, the team should add the salary of launch test phase also. Despite of these issues, this is a strong team with experiensed members since these 3 members has created an NFT project (Mushroom Mob) before. Afterall, from my point of view, they will need a realy good marketing plan to spread the idea and raise the awareness of people about this app, and the team should emphasize this in the proposal to make it more feasible.", "q1r": 3, "q2": "In short term this project is implemented, it will be very easy to check the progress by looking at the numbers: number of downloads, number of user interaction, other apps integrated... However the targets set by the team are humble, the community would expect to have a more impressive results. The plan needs more specific deadlines for each tasks, that will help the team and cardano community to keep up with the project procedure easier.", "q2r": 3, "assessor": "z_assessor_4107", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create a dApp that encourages regular self-care activities with incentives, social feedback and monitoring to maintain a good baseline of wellbeing.", "experience": "We have launched an NFT project (Mushroom Mob) which focuses on improving mental health.\nRegistered Clinicians:\nskilled with psychotherapy, behaviour change and lifestyle interventions\nHaskell Software Developer:\nskilled with web development, wallet integration, smart contracts"}