{"id": 422724, "author": "newmindflow", "title": "Trybbles NFT AR Pets Development", "url": "https://cardano.ideascale.com/a/dtd/422724-48088", "category": 26595, "amount": 86860, "description": "Most blockchain games in development:\n\ntarget hardcore gamers ignoring the fact that the majority of the audience are casual players\nfail to convey the advantages of digital ownership to users\n", "f6_no_assessments": 5, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 5816, "q0": "This is really a good, well written and interesting project. The idea is to have a pet owning AR type of game. While the game itself will be free to play, to make additional changes on the pet you will have to register to Cardano wallet and it will be done via NFTs. But the plan is to have it as simple as possible so it would be available for all age groups, which makes this game more interesting. There will no limitations as to who can play it, which broadens the market.\nComplete project is nicely structured, all important check-boxes are checked. ", "q0r": 5, "q1": "It is highly likely that this proposal will be implemented successfully. The game itself is already in development from 2021, and all the steps from then to today are mentioned. What is done and how it was achieved. The webpage is available and already there have been more than 4000 NFTs minted by the community since the launch of the project. \nThe team is really experienced, not only to make a quality game but also in Cardano community. With loads of projects that they are already working and have a lot to show so far and are core members of the NFT guild. They appear as a great team to support the development of this project, I see no roadblocks for this project. Except as they mentioned, current job market and availability to hire new people.\n", "q1r": 5, "q2": "It is easy to monitor current state of the project, we can even go back and see the inception of the project and what was done so far, I expect the same approach going forward. \nRoadmap for further development is clear, what is their target and when they want to achieve it, KPIs are well explained and are not unrealistic. As mentioned there have already been 4000 NFT minted, so this is also good indication of potential success of the project, and it can be used to monitor the current state/success of the project. ", "q2r": 5, "assessor": "z_assessor_2752", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6517, "q0": "The impact and purpose behind this proposal is its strongest aspect. It is clear that much more discussion and advancements in gaming should be addressed in the Cardano and NFT communities. The opening problems proposed express the need to target casual gamers - which makes up the majority of the global gaming market. In addition, the advantages of digital ownership should be one of the first things addressed in promotions of NFT integrated or blockchain gaming.\n\nTraditional gamers and gaming communities have very little knowledge of how NFTs can improve gaming experiences. There has been noticeable resistance of traditional gaming companies and gamers to NFTs - but it's likely largely due to the misconceptions around crypto and blockchain tech. In order for adoption and onboarding to occur, addressing the concerns and appealing to casual gamers will be keys going forward.\n\nIn addition, the focus on AR vs. VR is an interesting one - and I am in strong support of AR as an interaction medium for this NFT project. Being able to view and interact with one's Trybble NFT in AR will be resonate much more with the casual gamer vs. VR may appeal to more \"hardcore\" gamers.", "q0r": 5, "q1": "The core team of New Mindflow is experienced and has been involved with the Cardano community based on the information provided. It is also very clear that they've been envisioning this project for a significant amount of time - that considerable thought and planning has gone into this project. The Trybbles themselves are high quality yet adorable art that definitely has potential commercial appeal.\n\nWhile I can see the experience and Cardano-centric focus of the team and I really understand their vision, the question marks would have to be the individuals they would be bringing in to round out the rest of their team. The proposal is a necessary and ambitious one - so the selection of competent team members to deliver a strong product will be integral to the proposal and project's success.", "q1r": 5, "q2": "KPIs are easily laid out and quantifiably measured. Having an \"auditing portal\" for the community also goes a long way in the auditability of the project.\n\nAs for the \"Success of the Project\" portion, items are clear although I would've liked to see a bit more detail. I understand that these are early stages, but more concrete numbers - such as looking at a specific number of individuals to round out the team or some more details about what a tokenomics model concept would look like would've clarified things for me a little more. Overall, however, I feel that the transparency and auditability of this proposal is strong.", "q2r": 5, "assessor": "z_assessor_2820", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11995, "q0": "The proposers addressed a two fold problem that of most blockchain games are developed for hardcore gamers but they neglect that most of their clients are casual gamers, and that games fail to convey the advantages of digital ownership to users.  The solution they propose is to develop an AR virtual pet app by using unexplored game mechanisms.  The app will be free to download and will be available on all major platforms at no cost.  The proposers will build the AR on to of Cardano blockchain which means that Cardano ecosystem will be enriched and the number of dapps and products available for the community will increase as the challenge addresses including the KPIs.  The proposal could scale future challenges related to gaming.  ", "q0r": 5, "q1": "The team is composed of different professionals each one with the expertise required to implement the project.  They have added links of their profiles, links to previous works they have undertaken as well as videos.  The budget is presented in detail for each person that will undertake a task including number of hours and duration. \n The budget is quite reasonable to complete the task.  This is not a small project, it is a project that will take some time to implement completely and the proposes are aware of that.  They are down to earth with costs and timeline.  The tasks and clearly stated and simply explained. The proposers clearly explain technical tasks and how the project will be implemented.  There is no doubt they know their whereabouts. The proposers mention that they may return for further funding if required, but for the time been they will use the NFT sales to sustain the project.  The proposers are confident that they will find the right people to work with them on the project although they see this as a risk.  But even this is not a major problem, as it may only delay implementation of the project.", "q1r": 5, "q2": "The proposal has a clear roadmap and monthly timeline for which KPIs have been connected.  They proposers use numbers to show progress of their project such as number of successful iterations of the AR experience,\nnumber of Github commits, number of bugs found and eliminated during testing and more so that the community can track the progress.", "q2r": 5, "assessor": "z_assessor_3325", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12305, "q0": "They intend to develop an interesting AR pets entertainment experience that can be accessed by audiences outside of the traditional, hard-core gaming market or blockchain gaming in order to onboard a sizable number of users to Cardano and NFTs.\nCreate a process that is so easy to use and hassle-free that even those who aren't aware they are using blockchain technology will find it appealing.\nThe focus of the initial phase of development is on designing and prototyping the world and putting together the greatest team of elite experts.", "q0r": 5, "q1": "The technological staff working on the project is exceptionally skilled. They have already made the Trybbles Club based on NFT Key, a Cardano NFT authenticator service that grants holders of Trybbles NFTs special access, available to their community. Numerous community events, like the Trybbles Claim Event most recently, have already been planned based on NFT certification, as well as the Rewards Collection (October 2021–January 2022). There are further ways in which this might alter in the future. The project is detailed in great detail and includes a precise strategy for each quarter. They have been successful, and they have plans for 2009 to 2010. This is a really viable plan that will advance in the near future.", "q1r": 5, "q2": "Utilizing the Catalyst Monthly Reporting form, all deliverables (just as previously mentioned in detail) will be documented and submitted. As previously funded proposers, they are familiar with the process.\nIn addition to the monthly reporting form, they will make a special area on the project website https://www.trybbles.com/ where they will post the data from the form along with extra information and visual aids to keep the community informed and up to speed with the project's progress.\nBoth our monthly reports and our upcoming auditing platform will place a strong emphasis on tracking the KPIs.\nThis will provide access to a community auditing portal.", "q2r": 5, "assessor": "z_assessor_3395", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 14980, "q0": "This professionally organized and presented proposal is part of a much, much bigger picture that describes a deep game experience built around mobile/casual gaming markets, where the player manages a classic \"tamagotchi\" style asset in a rich, adventure based storyline suspended in an AR environment.  This casual sector is the fastest growing area in gaming right now, with most gamers preferring mobile experiences and PC over console, in both cases highlighting accessibility (https://www.prnewswire.com/news-releases/gaming-market-recorded-a-10-41-y-o-y-growth-rate-in-2021casual-gaming-segment-to-be-significant-for-revenue-generation17000-technavio-reports-301557843.html#:~:text=The%20gaming%20market%20share%20growth,easy%20access%20to%20the%20games.)\n\nWhere blockchain and DLT feature is in the development of NFT based assets to represent one of the main game features (though the developer is quick to point out that NFTs here are in a supporting role to the UX/UI, rather than the reverse, which is a welcome evolution of the space).  This proposal specifically is for the development leg of what they describe here as a three-legged stool, with prototyping/mechanics, and art/environment being the other legs, which are in separate proposals.\n\nThis development proposal covers the recruitment of the development team, the delivery of core AR code (more development will be needed to MVP the game), the integration with Unreal Engine (a great choice as it is opensource, allows for side by side development of iOS and Android, and has excellent portability to PC and console if needed in the future), and a functioning smart contract (with a side of NFT minting logic).\n\nAll in all this proposal lines out the seedfunding for a massive project, with years of effort already poured into it, with the potential to onboard millions of users and multiple CNT usecases to the Cardano ecosystem.  I believe it merits a full 5 stars for Impact.", "q0r": 5, "q1": "To start with, the proposal's presentation is very reassuring.  This is a well-organized and structure proposal that naturally asked and answered a lot of key questions through its natural flow.  In game development, organization and choreographed chaos is critical, so seeing the project management already underway is fantastic.  To that end, this is a management team that has come together over more than a decade to stand up this plan, having created many of the core assets already needed, and formed many key partnerships, with significant community outreach in Cardano.  This is especially clear in the gaming and NFT communities, a critical bridge they have helped to build.\n\nThe budget at first seems strikingly small, but then it becomes understood that the scope of the project is best understood in concert with the other 2 proposals in fund 9, which at once makes it much more reasonable, but also introduces two issues.  The first is the idea of conflicting projects, overlapping commitments, etc.  I found there to be no problems here, as they produced an excellent roadmap and timeline (that goes back 2 years!) that shows all three proposals, not just this one.  The project manager and recruiter are really the only overlapping roles described here (as they should be), and the hours presented leave plenty of room for agility.  \n\nThe second issue is the idea of interdependent proposals, i.e. what happens if one proposal is funded but the others are not?  The challenge here is that the ultimate deliverable (an awesome game on Cardano) is imperiled by a lack of funding, even if the specifics of each proposal are well delineated.  They have done what they could to address this:  as a multi-year project their commitment is apparent, and they indicate that commitment is not dependent on Catalyst funding.  Additionally, they have structured this proposal to not require any inputs from the other two in order to present its deliverables.  While I feel there may be some dependency by the other two proposals on this one, that is an issue to be addressed in those assessments, not this one.  The deliverables here stand on their own two feet.\n\nBecause the team has presented a robust description in their timeline and milestones of a well-designed and manageable project, as well as provided detailed descriptions of the characteristics and skills (via architecture descriptions) needed for their development teams, with a reasonable budget, I feel that this proposal deserves full marks for Feasibility.  5 stars.", "q1r": 5, "q2": "Despite a small issue in the auditability section (metrics for all 3 proposals are included here, but aren't necessary and may actually confuse the issue...the KPIs should probably be presented in the same way the proposer handled the budget, as a \"proposal specific\" area.  Not a downgrade, just a suggestion) what has been presented here is adequate (description of the 3 deliverables mentioned in Impact, along with repos, etc for tracking them) and in some ways, excellent (I'm noting here the dedication of a portion of their site to JUST maintaining a space and archive of their reporting and auditability efforts.)\n\nThey maintain a few different profiles in the community, particularly as project managers, game developers and NFT-ecosystem designers, which is to say that you will see them around, pretty much everywhere.  They are accessible, and in my interactions with them, thoughtful and considerate.  Taken alongside their Catalyst experience dating back multiple funds, which are all popular projects that are up to date, I believe they will be accountable to the community.  I rate this a full 5 stars for Auditability.", "q2r": 5, "assessor": "z_assessor_2436", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Make clear the value of digital ownership enabled by NFTs and blockchain through a concept anyone can understand and connect with: owning, interacting and caring for a digital pet in a fun, unique way", "experience": "30 years of combined experience in film, TV, apps & games production\nCreators of 2 successful CNFT projects: Trybbles & Icons\nCore members of the Cardano NFT-Guild.\nGenesis artist of the Emurgo marketplace, Fibo.\nVery active in the Cardano NFT space since February 2021."}