{"id": 422854, "author": "mariapapadakh", "title": "Cardano Virtual Experiences Toolbox", "url": "https://cardano.ideascale.com/a/dtd/422854-48088", "category": 26595, "amount": 149700, "description": "Existing Cardano NFT marketplaces are static in terms of exhibiting NFTs - simple listings. Users are unable to create 3D virtual experiences within the marketplace and share with the world.", "f6_no_assessments": 5, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3491, "q0": "Proposal is about creating a toolkit so artist and general public can create more 3D complete experience in NFT to address the problem that nowadays, NFT marketplaces are static and not very interactive. This is a fair and existing problem and solution will address, potentially also increase NFT adoption, as this feature my engage new artists and traders. This also fits very well in challenge as  a new product built on top of Cardano will be developed and it can potentially increase challenge kpi of \"Increasing the number of dapps and products available for the community to use that help to enrich the ecosystem with new use cases.\"\n\nAs for the proposal itself, it presents a very rich description on how the solution will work and what are steps necessary to get to it. it also does an excellente job on showing the value proposition for each stakeholder just as what are features and functionality that totally helps to understand the project.\n\nI liked that an agile life-cycle will be used for this project. As it is realted to a software development, this framework helps to collect feedback,validate the increments made and adjust the requirement backlogs after each 2 weeks (sprints), delivering value with a higher cadency.\nRisk management part is well done, identying accurately the main challenge (engaging artists on NFT) and providing an ellaborated mitigation plan. This mitigation plan also seems to be intrinsically related to the communication/marketing strategy that will be adopted in this project.\n\nIn concludion, it is a great proposal, based on a solid solution for an existing problem. My rate is 5.\n", "q0r": 5, "q1": "The plan provided is sensible and time-framed, divided into months and contains good deliverables, the duration of each step and the involved stakeholders. There's also a good level of detailing on the acitvities to be performed.\nBudget breakdown matches the plan and is transparent, as it also shows the number of months required for each budget line and the number of people allocated for each task, when applicable.\nAs for the team, they have experience in computer science, blockchain, project management and marketing, all very relevant for the project. The team is also already fully committed to the project (apparently they dont need to hire anyone else), a very complete description on their background and linkedin links are provided and the roles of each person is also stated.\n\nAll in all, they have here a really robust feasibility section and I dont see any issue on regard to it. My rate is 5.", "q1r": 5, "q2": "The way to audit this project seems really complete. Proposer provides several metrics, most of them with targets and some related to the growth of the platform after its launch, which makes a lot of sense to assess usability and quality. There are also marketing goals predefined.\nMoreover, as mentioned, the agile framework makes it really easy to communicate about the project, which could include sprint reports and product backlog updates. He also mentions where the information to track progress will be available (github). Fianlly, several deliverables and miletones can be captured from project timeline.\nAll in all, its really easy to verify project progress and validate its sucess after implemented, with the elements provided. My rate is 5.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4862, "q0": "As we know, existing NFT marketplaces lack the potential of exposing NFTs in 3D spaces which limit the interaction among users, creators, or artists. The proposer would like solve this problem by developing an easy-to-use, open-source toolkit that enables individuals, users, or communities to create 3D virtual spaces - known as Virtual Experiences (VES), and publish them directly within the marketplace. The toolkit will be integrated in their existing NFT marketplace -Galaxy of Art (GoA); MVP at galaxyof.art; and it will be open-source. I appreciate the proposer's effort for explaining in detail about 4 categories of VES and its general functionality so that community could visualize how it works, what users could do which differentiate their idea from other proposals. I think, this is a very good idea and fits well with the Challenge. Because this toolkit will provide an immersive experience to users, creators, or artists, enhance social interactions on further expanding the NFT ecosystem on Cardano. Besides, this proposal will also deliver a set of standards and best practices that can be used by Cardano community and marketplaces and speed up Cardano adoption and usability in the Web3 and the Metaverse space, as a result, attract users to the platform and significantly increase the number of ADA holders. The big challenge is how to convince artists, collectors, and users to adopt this toolkit solution, and ensure the implementation time and budget for the long-term development of the project. The proposer suggests some ways on mitigating these risks that I think, it is reasonable. In general, I am very interested and fully support their idea. ", "q0r": 5, "q1": "I think, the feasibility part is quite good, but some parts need a little more explanation. In terms of the roadmap, they plan to launch VES after 6 months, in which tasks will run in parallel and be carried out on a monthly basis. The proposer lists out their main focus, key tasks need to be done. These tasks include VES design, backend, frontend development, integration the toolkit into their current NFT marketplace (Galaxy of Art), testing, and awareness & community building. I think, this plan is good, because in addition to focusing on the technical development, the proposer also plan to educate community and prepare marketing materials regarding this toolkit. However, I would like the proposer to be more specific about the timeline for each task, I mean, estimating the starting date and finishing date of each task, and the tasks should be planned weekly. Next, reading the project's expense, in my opinion, it is not clear enough, and somehow does not match with their plan. For example, the proposer states the cost for Marketing, awareness and community building is (1,4 x $4000 x 6 months), but I do not understand how it is calculated? What does \"1,4\" number here mean?. Moreover, in their plan, the proposer states the duration of Awareness & Community Building is 1 month, so I just wonder why the proposer multiplies it by 6 months here? I think, other items of the budget part is not detailed enough for me too. My suggestion is that the proposer should clarify how many people involve in each task? How many hours they could dedicate and what is the hourly rate? So I think, the total required budget of $149,700 here is not clearly explained. Finally, speaking of their team, the proposer clarify their project' roles, and confidently introduce some key members in their team. Via their detailed profile information, personally, they are qualified and experienced enough to carry out this project, with provided Linkedin link for community to learn more about them. After all, with all of the above analysis, I think, the feasibility script would be better, if the budget part is given in a more detailed manner. ", "q1r": 4, "q2": "I think the auditability of this proposal is possible. The proposer would keep track of the project' progress regarding: toolkit technical development; and marketing & community building. Firstly, for the toolkit development, they will measure based on the given roadmap. The proposer will use Agile methodology to monitor, and hold weekly meetings to review progress and take additional actions if needed. However, the proposer should clearly tell Will this meeting be recorded, or meeting summary be shared public to community? How community could access this weekly meeting reports? on which ways, website, youtube or social media channels?. Even though the proposer gives some key metrics (the total number of pull requests in Github, Github commits, errors fixed, the total lines of code for the toolkit, the number of transactions, users joining the test phase), they do not provide the link or show how and where community could track these indicators? Secondly, for the checking of the marketing & community building, the proposer committed to have 2 posts per day on their social media (Twitter, Discord, Tiktok), 1 Youtube video per week summarizing the progress, 2 articles per week to their Newsletter, daily posts to Cardano and GoA community; therefore, these quantitative numbers make it easier for community to monitor the project. Additionally, by checking the number of daily visitors to their website, likes, comments, feedbacks, we could see how engaged the community to this project. In general, some mentioned above methods are sufficient for community to track the project's progress. ", "q2r": 4, "assessor": "z_assessor_2622", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5932, "q0": "This is a very interesting and refreshing proposition. The Cardano NFT markets are currently static in terms of NFT display - simple listing. This proposal would create an open source toolkit that would serve as a standardized base layer for rendering NFTs in 3D virtual space. It brings many benefits to the stakeholders. This will create alternative revenue and growth opportunities for GoA itself. In addition, thanks to its open-source nature, which will allow a wide variety of ideas and unforeseen use cases to be deployed, Cardano NFT marketplaces will be reusable. In other words, the proposed toolkit aims to enhance user experience and interaction in further expanding the NFT ecosystem on Cardano. It is for these great reasons that I believe this project completely solves the challenge.", "q0r": 5, "q1": "Team information has been provided. I am very impressed with your team, this is a large team. Based on the information provided, they have sufficient knowledge, experience and skills to carry out this project. Each of them has their own strengths and strengths, each of them undertakes a separate job, they combine to create a perfect and strong team. In addition, links to Linkedin profiles of key members have also been provided. This will be a clear demonstration, helping the above information become more transparent. As you know, having a strong team will be a great advantage, it makes the project can be done easily. You did a great job! However, I think it would be even better if the Linkedin link of Irene, George and Panayiotis.However, I think it would be even better if the Linkedin links of Irene, George and Panayiotis were provided. They also play an important role in the project so it is also necessary to provide their records. \nOne of the links you provided (https://linktr.ee/galaxyofarts) is not working, the time of my visit was 07/13/2022, \"The page you're looking for doesn't exist\" \"..\". I apologize if this is my fault !\nA detailed roadmap (6 months) has been provided, you have identified the to-dos and distributed them into appropriate timelines. The commendable point of this project is that the works will be done in parallel, which will help reduce the project implementation time. Thanks to a detailed roadmap, budget allocation just got a whole lot easier. You have calculated the budget very carefully, based on the number of people involved in each job, the number of months worked, the amount per month. The budget is presented very clearly and transparently, it gives people more confidence in the project. Besides that, you also did a great job in identifying the risk, the challenge, and how to mitigate it. This will be a solid basis for the project to be developed sustainably over time.", "q1r": 4, "q2": "Criteria for assessing project progress and success have been provided. They are very complete and detailed. In terms of progress assessment, you've covered almost all the processes that need to be checked. There are specific numbers to measure and evaluate the success of the project. Having specific data will make it easier for people to compare and evaluate. However, after each progress review meeting, how do you plan to make the project progress report available to everyone? Are there any channels to keep everyone updated on progress? The information provided is complete, based on which people can easily judge the success of this project. This is a very potential proposal, it creates a new dapp that has a huge impact on the community. If implemented successfully, it will surely give users a great experience, attract them to participate more in Cardano, and promote the extensive development of the Cardano ecosystem. I myself completely believe in this project, I hope in the future it will be implemented successfully, I will definitely vote for you!", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9730, "q0": "I find that the proposer has raised an important issue and the scale of impact is relatively large. Web3 and Metaverse are growing stronger and stronger. Non-Fungible Tokens (NFTs) are a term that has been mentioned a lot in the past few years. The NFTs market is growing rapidly, especially with the participation of many celebrities and artists. However, for now, it still displays static information about digital creations, lacks 3D rendering potential, and limits interaction between users.\nThe proposed solution solved that problem. It's building a toolkit for creating 3D virtual spaces (VES), which is open source, easy to use, and users can publish their own 3D models that can be shown to other users through information. through the market. The toolkit's management will allow communities to collaborate to jointly create VES. The solution has been described in detail by the author and the method is rigorously argued. The first is to provide a video via a Youtube link to make it easier for readers to visualize. The author has provided data and evidence to describe the current situation of the NFTs market and presented his own solution. The features, functions and implementation process have also been detailed by the author. Besides the solution, the team also anticipated some risks and had solutions to minimize those risks.\nI found that this proposal met the \"Dapps, Products & Integrations\" challenge. The creation of the EVS toolkit will serve as the primary layer upon which to build 3D virtual spaces in the Web3 space for the Cardano NFT marketplaces. It will increase the utility and adoption of Cardano, helping to attract more users.", "q0r": 5, "q1": "The proposal has a clear roadmap and a specific timeline. The author presented a detailed plan. The duration of the project is 6 months. As for the technical part, the team's plan is to develop a toolkit based on the open-source WebGL and JavaScript libraries. They aim to launch the toolkit as a module within their existing GoA NFT marketplace.\nThe project's budget accounted for 1.9% of the total budget for Challenge. This amount has been calculated and divided by expenses. The author also gave a calculation basis that is calculated according to the average cost of 1 month, to explain the budget division.\nThe project implementation team are all experienced and competent people in blockchain, crypto-asset and Metaverse projects. The author has provided very detailed and complete information about the members. The author has also provided Linkedin profiles of some members for readers to easily verify their identities. However, there are still some people who do not have a profile link.", "q1r": 4, "q2": "Through the presentation of the author's audit, I see that this proposal demonstrates transparency. The author has provided many measurement indexes to track the project roadmap. Also, the community building & marketing section is detailed. Such as 2 posts per day per social media used (e.g. Twitter, Discord, TikTok); 1 YouTube video per week summarizing the progress of the project; 2 articles for our newsletter per week..etc. This will help the project increase interaction with the community and the community can also contribute ideas to make the project more successful.\nThe success of the project is clearly defined and easily verifiable through the four KPIs that the author has outlined.", "q2r": 5, "assessor": "z_assessor_3087", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12510, "q0": "The proposal first provided a detailed, specific problem in the Problem Statement, the problem posed and clearly defined the challenge to be solved. The new experience in the NFT world that the proposal provides when the proposal is implemented is a great prospect, I am sure it will bring value to the Cardano ecosystem. I appreciate the detail of the proposal and the positive impact the solution can have on the community. Besides, the potential for development and expansion of the proposal is also a bright spot, although it is a new proposal, the development potential of NFT and metaverse is undeniable.", "q0r": 5, "q1": "In the proposal, the necessary experience to carry out the project is provided in detail, similarly, the relevant skills are also presented. Based on the information and evidence provided, I believe the skills presented by the team are appropriate. This is the basis for the proponent to find suitable personnel and effectively implement the project. The project provides a detailed, controllable and actionable plan on a weekly basis. The team had a clear budget, and the budget was broken down into identifiable subsections. The expenses provided by the writer are also reasonable. In addition, the proposal clearly indicates the risks that the project may face, which are also barriers to the implementation process, they have reasonable solutions to minimize the impact of those risks. To make the proposal more complete, the writer can provide further details of the proposed implementation plan by providing specific timelines.", "q1r": 5, "q2": "The proposal provided a specific implementation roadmap with timelines and a daily timeline. The metrics and KPIs they use as a measure of the project's success are completely relevant. However, the proposal does not provide a method for the community to track the progress of the project. The team can refer to and build a website with a real-time road map update, besides adding a portal public information on the expenditures of the proposal to improve the transparency of the project to the community.", "q2r": 4, "assessor": "z_assessor_3425", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We aim to build an easy to use, open-source toolkit that enables individual users or communities to create virtual experiences that are captured in 3D spaces.", "experience": "We are a team of 15 experts with experience in projects ranging from blockchain, to crypto-assets and the Metaverse. Our NFT marketplace www.galaxyof.art has been launched and we are seeking to enhance its functionality and improve users’ experience and community interaction."}