{"id": 422984, "author": "muesliswap", "title": "Market making bots on Cardano", "url": "https://cardano.ideascale.com/a/dtd/422984-48088", "category": 26595, "amount": 44250, "description": "Market making bots are one of the most widely used methods to bring more liquidity to exchanges.\nExisting frameworks for trading bots do not interface with decentralized exchanges on Cardano. ", "f6_no_assessments": 6, "f6_rating": 3.944444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 6501, "q0": "There is a clear description of what the challenge is and how this proposal will address it. In other ecosystems, market making bots play a big role. Especially during a bear market. This proposal is intended for the team at Muesliswap to implement bots that focus on market-making, arbitrage, and liquidity mining on Cardano. This will be huge for the ecosystem because there are a lot of experienced traders that would love to come onto the Cardano network if there are bots as well to help mitigate loss. I find this proposal to effectively address the challenge by a trusted team in the Cardano ecosystem. For this reason, I give this proposal 5 out of 5 stars.", "q0r": 5, "q1": "In terms of feasibility. The team has accomplished a lot with their decentralized exchange. There is a lot of experience and they have grown a large following. In the proposal, they give a detailed roadmap that explains what they have accomplished already and how they plan to implement the market making bots. They explained that the progress will be shown through github and they will update their community when they finish each step. Because of their large community, it will be easy for them to be held accountable to this proposal. They will want to know when they plan on finishing. This will lead the team to ensure that they are finishing their product and release it for the community. For these reasons, I give this section 5 stars.", "q1r": 5, "q2": "This proposal is very informative and concise. There is a lot of information that helps support the idea of success with this proposal. There is a detailed budget breakdown that shows where the requested funds would go if funded. It is nice to see exactly where the funds will be going and helps ensure that these funds will be used properly. It is important to realize that the success of this proposal can have a huge effect on the Cardano ecosystem and can be the start of projects working on market making bots for their projects. With a loyal following and the accountability measures that come with it. I believe that this project will benefit Cardano as a project and act as an example for other upcoming Cardano projects. For these reasons. I give this section of the proposal 5 out of 5 stars. ", "q2r": 5, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14124, "q0": "The main purpose of this proposal is increasing trading volume and liquidity for the exchange by creating market bots. This will help increase traffic to decentralized exchanges on the Cardano ecosystem. The proposal will solve the posed challenge: Existing frameworks for trading bots can communicate with decentralized exchanges on Cardano. In addition, they can connect with other decentralized exchanges to create a market between peer-to-peer exchanges. however, I don’t think it's right time to put the control of trading bots on the community during the downtrend of crypto market. Does it affect the decentralization of the DEX? And this solution of creating bots will bring many disadvantages to single traders.", "q0r": 4, "q1": "We accustomed to the Mueliswap team, who created the first Dex exchange on Cardano. They used to be the leader in Defi and their exchange used to hit of $100 million per day. The liquidity on their exchange is high, and traders can place limit orders. Along with that is a team of 9 experienced developers in different fields, most of them are longtime Cardano community members. Their plan is very clearly. With presented experience, resources and plans, I highly appreciate the possibility of this proposal succeeding", "q1r": 5, "q2": "The provided information to assess the progress and success of the proposal is too little and unclearly. In their answer: \"The progress will be visible in a publicly available repository on GitHub\". I have not seen them mention any specific metrics or milestones. They don't need to raise fund and can do it by themselves from their own resources. The success of this project is equipment for the community a framework to efficiently use trading bots on Cardano and also extend the framework with custom strategies or any other types of functions. I don't appreciate it, because the benefits are more for the exchanges than for the community", "q2r": 3, "assessor": "z_assessor_3906", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 14988, "q0": "Availability of trading bots would help Cardano app ecosystem gain traction within advanced traders; a niche group of users, but with the capacity of bringing significant capital and credibility. \nThe team presenting  this proposal has already showed they know how to market Dapps (operating top-3 DEX), and are willing and capable of working with other protocols (they operate a multi-protocol swap router)\nThat being said, I’d expect a more detailed proposal from such an experienced proposer.  ", "q0r": 4, "q1": "The proposer team is known to deliver, and they mention if Catalyst funds are not enough, they would step in to complete the proposal. Successful project completion  would seem to be almost guaranteed. Feasibility section of the proposal is not very detailed, with just a barebones roadmap and budget breakdown, but I think it’s enough in this case.", "q1r": 5, "q2": "The project progress will be accessible in a GitHub repository, which in my opinion is the ideal option to track development efforts. No KPIs are identified for the completed product, altough there are many obvious ones ( number of bot templates, bots in use, DEXes supported…). This rounds up the impression of this being a low effort proposal.", "q2r": 4, "assessor": "z_assessor_2100", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15048, "q0": "The MuesliSwap team intends to create an open source framework for market making bots for both their own DEX and the whole Cardano ecosystem. Their proposed project aligns perfectly with the “Dapp…” challenge setting by addressing the first bullet point in the challenge setting “DeFi - Stable coins, DEXs, borrow & lending, synthetic assets, etc.”.\nFurthermore, their solution will not only bring more liquidity to their own DEX, the framework will help all DEX:es that adopt their framework to increase their liquidity. This project has potential to impact the whole Cardano ecospace and help Cardano to grow among its competitors within the blockchain space. \nThe proposal will receive a strong 5 points since they address the challenge setting perfectly and it will provide a framework that is both impactful, open sourced and scalable.", "q0r": 5, "q1": "The MuesliSwap team is among the top within the Cardano community when it comes to credibility. They have already developed and delivered a highly regarded and highly used DEX. In other words, they are experienced and have the skill set required to implement their framework. Furthermore, they explicitly mention that they have a history of making bots on Cardano. \nThe detailed plan and budget are simple, but the listed 4 phases seem realistic and feasible given their prior experience. Their hourly rate for development is 75 USD/h, this too is realistic and a quite common rate for developers and consultants within IT projects today. Both the detailed plan and the budget could be further refined and broken down, but given the rather “simple” nature of the project and the developers great experience, no points will be deducted, but they are highly recommended to consider this in future proposals.\nThe project is regarded highly feasible and they will receive 5 points.", "q1r": 5, "q2": "From the proposal it is clear that the MuesliSwap team wants to build open sourced market making bots. However, from an auditability perspective it is unclear what the definition of done is, and there is a lack of measurables in the proposal. The team is experienced as mentioned, so there is no doubt that the solution is feasible but this is not sufficient enough to omit any form of KPI or clear definition of done. Unfortunately I have limited experience regarding relevant KPI’s but a guiding example could be “X Dapps using your framework after Y months” etc. \nOn the positive side of things, the project will be available and auditable on Github, this is a big plus when it comes to auditability. All in all, the auditability is high in the sense that the project will be developed and fully transparent on Github. But it is hard to evaluate the project since there is a lack of clear KPI’s or measurables. One point will be deducted as a result and the score in terms of auditability will be 4 points.", "q2r": 4, "assessor": "z_assessor_2290", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15228, "q0": "Regarding the impact, the proposal is 100%. It would be developed with extremely useful use case for our blockchain. One of the ways in which exchanges obtain more liquidity, according to the proponent, is through the use of creation bots. However, this has not yet been developed thinking exactly about the characteristics of our ecosystem; the project then is to provide an open source framework and model so that trades can be done through the bots on our blockchain. I believe it is a very profitable utility for the members of our community that contains exchanges, and as Cardano is a third generation blockchain, it is natural that some features present in older and consolidated blockchains (such as bitcoin and ethereum for example) are not available at Cardano (for now). Therefore, I believe that using bots for arbitrage and liquidity mining can generate significant profits for our ecosystem.", "q0r": 5, "q1": "The steps are explained very thinly. In two months, all we are given is: the basic infrastructure and market making bots would be done on MuesliSwap. How would this be developed? What would happen in month 1 and month 2? As in the first quarter, the others are poorly explained in detail. This makes it difficult for us to have a good understanding of the development process in practice. The budget part also lacks the necessary explanations to argue the real need for such an investment. The first part of development costs $18,750, but why? How much would go to each for each professional involved? The value is very high, it needs to be properly explained, argued and justified. Finally, the presentation of the team leaves a lot to be desired. The MuesliSwap team is made up of 9 developers: information would have to be attached about each one individually. Resumes, linkedin, experiences with Cardano and etc.", "q1r": 1, "q2": "Progress will be visible through the GitHub repository. However, 1: what would be posted there? And 2: how often? Even because we have a very superficial roadmap, there is no way to trace a detailed and adequate monitoring of progress. It would be necessary to understand the accomplishment of each phase, individually. Success is defined very briefly as a way to enable the community to efficiently utilize trading bots on the Cardano blockchain. How can we see this in practice? It would be necessary for the team responsible for the idea to carry out some research after the technology was launched, so that we would have a real understanding of how this tool impacted its target audience.", "q2r": 1, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15367, "q0": "Lack of liquidity is a problem in the financial market as a whole, market maekrs are instruments to ensure liquidity so that traders can make purchases and sales more quickly and efficiently. As a user of Muesliswap I have already witnessed the lack of depth in the order book and this sometimes makes a buy or sell order take hours to execute and slippages become high, which discourages the use of a DEX.\n\nThe creation of an open-source framework and templates for trading bots on Cardano can benefit Muesliswap, other projects that need to improve liquidity conditions and this consequently ends up benefiting the Cardano community, with more more functional products. This proposal is within what is expected in this challenge.\n\nAlthough the deliverable of this open source framework is already an indication of impact, KPIs that can allow projecting the impact of the proposal are lacking. e.g.\n\nIt is assumed that the implementation of trading bots increases liquidity and attracts more users so the team could measure the volume pre and post implementation in order to identify the impact caused by this proposal. The team could project a percentual increase in volume and number of users as KPIs with targets for this proposal. \n\nThe MuesliSwap team is already financially sustainable, this proposal only aims to create an open source framework and is a punctual effort. The team indicated that it will not request funding again for activities related to this implementation, but it may create proposals to implement different types of solution.", "q0r": 4, "q1": "Muesliswap was the first DEX to be deployed on Cardano (about 9 months ago) after the Goguen update. The team has been developing and updating DEX features since then, recently the team announced the implementation of Muesliswap on Milkomeda. To date, there have been no financial losses to Muesliswap users, at least losses that have been publicly reported.\n\nThe proposal included links to the Muesliswap website and Github where it is possible to check the development of the project.\n\nAs an addendum, I would recommend that the team provide more details about the expertise of the team members on the website, as there I could only find the names and a brief description of the members' roles. I will not discount points for the proposer's ability to develop the solution because the repository and the history of Muesliswap are enough to indicate full aptitude.\n\nThe plan was divided into 4 stages and there is only a high-level description of what the team intends to develop on each stage, there is no detailed description or technical details of how the market maker will work.\n\nAs there are no details of the development stages, it is difficult to say if the budget is adequate. The hourly rate used was $75 USD per hour, a value that I believe is adequate considering the salaries paid to Haskell developers (best analogy to Plutus) on average. I would recommend more detail in the development stages so that it is possible to better understand the development time defined in the budget.\n\nOne aspect that was important to mention is that MuesliSwap is a DEX that uses orderbook instead of AMM (automated market maker) this should have been mentioned in order to make it clear that the market maker to be developed here is intended for DEXs that also develop products with order books, which are a minority among the DEXs in development on Cardano today.\n\nThe team indicated that there will be no financial risks because if the budget is not sufficient to develop the stages of this proposal, the team will bear the additional costs.\nTechnical and implementation risks were not identified by the team.", "q1r": 3, "q2": "The work developed will be verifiable on Github, which is positive for transparency and auditing.\n\nThe definition of success is associated with the delivery of the proposal and the trading bots framework, however the proposal did not define any metrics or KPIs, which compromises the verification of results As I mentioned in the impact rationale, it would be important to have indicators of how DEX has improved with this implementation.\n\nThere is a roadmap with some high-level deliverables that allow some verification of the project's progress, but it is not ideal, there could be more details and clearer development milestones.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Develop an open-source framework and templates to use trading bots like market-making, arbitrage, and liquidity mining on Cardano. ", "experience": "We are the team behind MuesliSwap, one of the biggest decentralized apps on Cardano. As developers of DeFi infrastructure, we have experience with all relevant aspects of Cardano."}