{"id": 423007, "author": "albert.feghaly", "title": "PubWeave: Academic Publishing", "url": "https://cardano.ideascale.com/a/dtd/423007-48088", "category": 26595, "amount": 214800, "description": "The academic publishing industry suffers from a centralization problem. Few journals benefit from the work of millions of scientists who provide their services for free and even pay to publish.", "f6_no_assessments": 12, "f6_rating": 4.944444444444445, "videos": [], "media": [], "f6_assessments": [{"id": 9699, "q0": "This proposal addresses one of the most challenging problems in academic publishing. As the team describes, the current system is rigged in a way that prevents the ownership of the scientists’ own work. What comes on top of it, is that citizens who actually paid for the research (with their tax money) are often prevented to read the work due to enormously high subscription costs of the journal. Additionally, the peer-review system creates no costs for the journals as scientists are currently doing it on a voluntary basis and are not getting paid for the work they are doing for the journal. The team is fully aware of these problems and outlines them clearly in the beginning. With their proposal, they want to break this unfair publishing cycle and instead make it more transparent, fair and accessible. The proposers want to develop a decentralized academic publishing platform which will use a treasury system to cover costs for editing and publishing. As decentralized science (DeSci) is becoming more and more popular, this proposal really hits the nerve of time and tries to solve one of the biggest issues in academic publishing. The team seems to have thought through the treasury system, nonetheless the proposers are aware of potential challenges (e.g. required social traction) that could impede the implementation of their dApp. What is currently missing is information on the peer-review process (are reviewers rewarded? If so, how much? Is this already accounted for in the treasury system), as this will be an important aspect of a peer-reviewed academic publishing platform. Overall, this proposal aligns well with the challenge. It not only brings a novel dApp to the Cardano blockchain but rather introduces a new ecosystem that, if successful, would attract thousands of people to Cardano and make scientific publishing more accessible to tax payers and give scientists back their ownership rights.", "q0r": 5, "q1": "The proposal highlights a link to their website, where one can find additional information on the team and consultants. The team has knowledge in various fields including blockchain development, software engineering, science communication and several advisors who have experience as CEOs. Most of the team members have worked in science and are therefore aware of the publishing issues. Importantly, it is stated that external partners will do the “heavy lifting”.  Due to privacy reasons the team did not state who these external collaborators will be, thereby making it difficult to assess their respective competencies.\nThe team has outlined a detailed plan for executing their proposal. Their plan, which is separated into 3 phases, describes the milestones and deliverables. A timeframe is indicated for the first three phases. The amount of work specified for each phase is feasible, if experienced teams/companies can be hired. The requested budget is reasonable given the workload that will be necessary (within the first 9-12 months), although I am certain that the requested funds won’t be sufficient. First, the budget required for blockchain integration should be increased given the scarcity of good blockchain developers. Additionally, more funds should be allocated for marketing and educational purposes as the success of this dApp will strongly depend on the social traction and number of users. \nOverall, the team provides a detailed breakdown of their plan and requested budget. In additional, the experience the team has, provides them with a solid foundation to tackle the challenges. Unfortunately, it is not clear which company or companies will perform the heavy lifting (as stated so by the team), making it difficult to determine whether this plan is feasible. However, I am confident that with the right collaborators, the execution of this proposal is doable.\n", "q1r": 4, "q2": "As described in the proposal, the work of this project can be split into four phases. The first three phases will be covered in this proposal. Every phase has an allocated time of three months. For each phase, the team has provided several indicators based on which the progress will be measured. Indicators in phase 1 are github commits, number of blog articles, the catalyst progress report and public presentations. For each category, the team has provided clear aims. The range of github commits is quite wide (which the team has stated as well), but reasonable and a good indicator for the technical progress of the project. Number of blog articles on Medium are important due raise awareness for the project and increase social traction. Depending on how well this goes, the team might consider increase the number of articles per months (e.g 2-3) and providing a thorough FAQ. Public presentations will also be a decisive indicator and potentially even a success metric. This is because in the scientific world, knowledge is often shared and presented during talks and presentation (seomtimes even at large conferences (> 500 people)). Following these presentations will be useful to audit the progress in a non-technical manner (in contrast to Github commits). In phase 2, a new indicator is introduced which are the number of academics/institutions expressing interest. While in principle this is a good metric to assess the overall progress and success of the project, the aims stated here is quite vague. What does it mean “1 new institution in talks with our team”? This could imply so many different things, starting from general interest up to really interested in using PubWeave. It would have been good if the team had provided a more precise aim for this indicator. In phase 3 emphasis is put on new researchers signing up and the number of preprints uploaded. While both metrics are useful to assess the success of the project, the latter is the decisive one, as this will determine whether researcher actually want to use PubWeave or not. Without any preprints uploaded in that phase, PubWeave will most likely fail.", "q2r": 5, "assessor": "z_assessor_3084", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1338, "q0": "The problem statement chosen recognizes the fact that academic publishing industry is affected by its centralized nature because of which only a few number of journal which publish these academic research works are solely beniifited for works of millions of scientists who provide insights of all their work for free sometimes even pay inplace of actually getting the fruits of it. The solution proposed is to create an ecosystem which can host a platform for publishing scholary research paper in a democratized decentralized way with provision for peer-review and funding by treasury  in a democratic way for long term sustainability. The platform \"PubWeave\"that will bedeveloped through this proposal will help bring one of the key paerts of  \"DeSci\" movement and help cardano become a go to blockchain as such a platform will bring n number of academias onboard as it becomes a portal which is decentraized, permissionless and censorshi resistant in nature and boost cardano in the related communities. This proposed solution definitely solves the chosen problem statement hence effectively addressing the challenge.", "q0r": 5, "q1": "The proposal team is a very well exposed team in Blockchain domain and also are part of well known academic platforms and publications in multiple domains which are key parts on the imlementation of this proposal. The team has already been funded in Funds 6 and 7 and is ready with their MVP The core team is led by Albert Feghaly who is a blockchain developer with expertise in plutus smart contracts alogn with team members who have expertise in other blockchain and web based technology including advisors and members with years of academic background and entrepreneurial experience. Along with these experience they have provided detailed plan for execution of implementation of the proposal successfully. They have provded details of each phase of the development of the solution for which they have requested funds such as Building, Deployment Expansion(scaling) and maintainance, and \"PubWeave\" will be then integrated with PanDAO and Vertheum and they have also mentioned details regarding how this platform will be further incentivising by introducing token by which the token holders will then promote/work towards filling the treasury in a loop which is filled by Veritheum(Their Openscience NFT market place details provided in proposal). Considering the detailed plan and future vision along with sustainability ad apt experince and exposure of the team is is highly likely that the proposal will be implemented successfully.", "q1r": 5, "q2": "The team has layed out a beautiful proposal considering all the the sections of the proposal giving detailed insight behind the motive for the problem statement chosen and the proposed solution. They team has layed out details regarding each phase of their solution implementation (3 + 1) and how they will work beyond solution implementation. They have provided clear details regarding timeline for each of the phases which can be key point in measuring the progress of the proposal as they advance from one phase to the next (3 months a phase). The team has also provided details regarding a descent fund breakdown based on hourly charges for the resources and also the timeframe for which the resources are used based on timeline of their phases (prices quoted seems a little high but justification provided for the same). They have also listed down the risks they have identified in the process and have adrressed regarding how they will be mitigated. They have covered a very detailed list of KPI metrics especially such a git-commits, public representations, cademic institution intreset tracking, end users(researches) onboarding distributed accross each of the phases which can be clear indicators to measure the progress  of the project along with vision into success of the project. Provided these details the proposed solution implementation is quiet transparent and is pretty sufficient the audit the progress and success of the proposal/", "q2r": 5, "assessor": "z_assessor_2228", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 3805, "q0": "I have been following the progression of this ecosystem proposal since its inception on Fund 6. Albert’s idea and writing is always impressive, enjoyable and easy to understand. He often makes relevant analogy to open our mind. This kind of project with serious impact to world through resolving tough and real issues on a grand scale is still rare in Cardano ecosystem and community. Albert is always thinking forward and holistically and it is evident in the highly integrated but decentralized ecosystem he is trying to build through the series of proposal he has written in Catalyst Funds.\n\nHis proposal is educating and exciting readers’ thought through the variety of information he provided about the academic publishing industry. This proposal explains clearly how the advantages and benefits of blockchain and cryptocurrency could empower weaker-positioned stakeholders over the exploitative actors and middlemen. This idea can be a multi-billion-dollar worth when we realize that global publishing market size is roughly a hundred billion USD. Project Catalyst must take part in this grand initiative, sending the message to the world that Cardano blockchain technology is transforming the world into a much better place slowly but surely. If this proposal is not rated five starts, I am not sure what kind of proposal is worthy of it or if I even assessing correctly all this time.", "q0r": 5, "q1": "The timeline is rational enough to me. Concrete action plans and deliverables are well-stated and quantified and divided into proper key milestones every 3 months. Budget is very informative and transparent while also being reasonable and within market rate along with contingencies included. The people in the team also looks respectable with solid and essential background and verifiable track records. The assigned roles are also matching each member’s capacity. I have very minimal concern of unsuccessful outcomes.\n\nRisk is also address transparently and explained well that every disruptive technology will be in a higher spectrum. I believe community is happy to extend some help if there are any technical and business difficulties during the execution, implementation, integration of the total solutions from the ecosystem Albert has made.", "q1r": 5, "q2": "Since this proposal also has cross-chain (with ARWeave) and open-source property, both putting them in a very good position in auditability aspect. Attention and traction of the project are high and maintained through its life cycle since the expectation will be absolutely high. The team is really living the value of crypto and blockchain. Metrics are also really detailed and open while also being quantifiable. A testament to their devotion to this proposal and dedication to the Cardano ecosystem. Although the one or two-liner weekly updates in their website is concise we may want to see more solid updates such as Twitter or Medium blog posts and open AMA sessions so we have more conviction about the team and project. Lastly, I must also attest that this Fund 9 proposal is much more developed compared to the Fund 8 version and the Intellart team is showing some real and promising progresses and result with their funded proposals, especially through the Github repo and commits they made. To conclude, I believe Intellart deserves further funding to fuel their final grand pursuit here.", "q2r": 5, "assessor": "z_assessor_2482", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Dear assessor, I simply wanted to thank you for your support and for believing in our project since its early inception! We will be making sure to prove that your trust and the community's ongoing support is well-placed. Appreciate the kind words."}, {"id": 4863, "q0": "This is a very good proposal. As we know, the content creation industry might face a sad truth when the benefits or profits created always belongs to a groups of people at the top because of the centralized control system. One of the industry we might rarely think of is the scientific publishing industry, in which big journals take most of the profits generated from scientists' work. Currently, there is no mechanism that scientists can claim their ownership and profits from their published research. Therefore, the proposer would like to create PubWeave, a full-stack decentralized peer-review academic publishing platform on Cardano blockchain. Their ecosystem is comprised of 3 main components: Veritheum, PanDao and PubWeave which will be run parallel. PubWeave is the subject of this proposal and contains parts that will have to be integrated with the other 2. The core technology is OpenScienceNFT Marketplace that allows the author to associate an NFT to their published academic article. In fact, this is an on-going project, it means they are successful in Fund 6 and 7, and the MVP is being deployed (link provided for community checking). This somehow shows the proposer's seriousness and ability in implementing this project. If successfully, their solution could bring a lot of positive benefits for scientists, publishers, the academic publishing industry, as a result, help onboard new people and increase the adoption of Cardano blockchain. I highly appreciate the proposer's effort for giving more information about the background of the academic publishing process for those unfamiliar, and clearly explain their idea and identify some risks and giving solution for mitigating these risks. In a nutshell, I would like to give a full mark for this park because of the details it provides. ", "q0r": 5, "q1": "The feasibility of this proposal is very high. As we know, this project is is built upon the previous funded proposals, so I am more convinced about the implementing ability of this proposal with some proof of works shown by the author. Regarding their roadmap, the plan will last for beyond 9 months, divided into 4 phrases, with 3 months for each phrase, except Phrase 4 is not clear about the timeline. I think, it is quite detailed about what activities would be done in each phrase, in which I could have a better understanding of the flow of works. For example, their main focus for Phrase 1 is building: UI, backkend, Plutus development, constant creation of educational content as a form of marketing and outreach. My only suggestion is that the proposer should add information of who will be in charge of which tasks. Next, considering their budget, I think, the required cost is reasonable for professionals. These costs will cover Plutus smart contract engineering, Cardano blockchain integration, SmartWeave smart contract engineering, DevOps, UI/UX development, Backkend development, Blog/Education/Marketing/Meetings. I know exactly how many weeks, how many hours per week they could spend on each task, and it is calculated based on hourly rate, ranging from $40 to $80 for technical and non-technical works, so the total required project's expense is $214,800 is correctly calculated. Finally, speaking of their team, I am impressed about the team members for variety of experience in Bioinformatics, Python, JS, Big Data, ML, AI, Blockchain, Plutus Pioneers, fluent language spoken with Linkedin link for community reference. Moreover, many of those members have published peer-reviewed scientific articles, with some examples via provided link, showing their deep understanding and capacity to execute this project. Besides, they also consult other advisors and outsource some parts of the work from software development companies, and recruit more Haskell and Plutus progammers for the future project development that shows their seriousness and broad vision. In short, I believe in the feasibility of this project, and I am looking forward to how this project turns out in reality. ", "q1r": 5, "q2": "Auditability part is very well detailed. Following their roadmap, the proposer provides a very detailed KPIs for each phrase, so community could base on these quantificable indicators to follow the project's progress. For example, for Phrase 1, the proposer aims to have 20-60 Github commits per week, 1 new article person, 10 new subcribers per month on Medium, 1 publicly viewable report per month, 2 new presentations by the end of this phase to increase awareness of the project. Additionally, in their official website, they have a separate part for weekly updates of the project in a succinct manner ( intellart.ca/#/weeklyUpdate), so community could track what they have finished, when they have finished it. Moreover, they will have a official member whose focus in writing blog articles (blog.intellart.ca) ranging from project updates to education content and community engagement. Besides, their team is public on Twitter, Youtube channel, deeply connected with Arweave community with detaily provided contact. In short, I am very pleased with this auditability part from the proposer. ", "q2r": 5, "assessor": "z_assessor_2622", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5204, "q0": "The project tries to create a full-stack peer-review academic ecosystem where funding is secured by a treasury optimized for long-term sustainability. Using DAO based on Cardano blockchain and Arweave for decentralized storage. The proposal is one of the most well-written in my experience as a Proposal Assessor. On top of that they also already have an MVP. If successfully implemented the project will add immense value to the Cardano ecosystem by bringing a very huge user class to the space. The proposal explains in comprehensive three main risks of the project. Technological risk, cross-chain risk, and traction. On each of those risks, the proposal provides a very detailed mitigation plan to overcome those risks.", "q0r": 5, "q1": "There are various measurable milestones provided, each tied to specific timelines. Those timelines are divided into 4 phases. The proposed budget is divided into the main tasks needed for the project. I like the parts where the proposers provide the total hours needed to complete each task and the cost per hour. The cost per hour is very useful to determine if the proposed budget is reasonable or not. The proposal give concise but informative on the background and the relevant skills of the core team member. On top of that, they also provide LinkedIn profiles and other relevant links, that make the community easily verify their credibility.", "q1r": 5, "q2": "The proposal provides comprehensive and detailed metrics used to track the project progress, mainly consisting of Github commits, number of institutions interested, number of blog posts and followers, monthly reports, and public presentations. Each has different goals depending on which phases. The defined success is divided into short, medium, and long term. With the long-term goals as the platform has funds in its treasury to finance all scientific publications for the next 10 years, and academic institutions are starting to collaborate.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 8217, "q0": "\"There is a clear alignment between the key metrics of the challenge and the proposed solution, which is to apply Cardano blockchain technology to common use cases and expand the network by getting new people on board. The key features, functionalities, and benefits of the project have been clearly described, there are 3 scenarios mentioned: grants, a pay-per-view model, and a treasury. The team also provided an explanation of the publishing process, helping the community to fully understand their solution. There are reference links to other projects (funded in Funds 7,8 ), Pubweave’s UI code, and a blog concerning the process of publishing in academia. This will allow the catalyst community to have a broad overview of their project and better assess its expected outcomes. \nThe main risks during the operation process are well foreseen. To deal with each risk, the team has carefully analyzed its causes, and impacts on the plan, thus offering corresponding solutions. The information is detailed and adequate for the community to review the risk management of the team. \n\"", "q0r": 5, "q1": "\"The action plan has been split into 4 phases with the main tasks and follow-up activities. The timeline and key deliverables are clear, enabling the community to follow the plan. The team also explains the interaction between 3 main components of their ecosystem, ensuring clarity in the process of operation. The budget has been properly broken down according to the delivery plan. As presented, most of the costs will be given to the wages of personnel, which is logical and reasonable. \nThe team’s information is well portrayed, including the core team, advisors,...I believe they are a strong team will huge capability since they are already funded in previous funds. All the necessary materials (LinkedIn accounts, example works) for the verification process have been provided in the proposal. \n\"", "q1r": 5, "q2": "The auditing process has been made easy and transparent since the description of this part is very complete, the community can base on specific KPIs provided to understand if the project is achieving what it intends. In each phase, there are solid goals and particular numbers which clearly indicate the progress and development of the project. These numbers are realistic and achievable, keeping the team stay on track and ensuring operational efficiency. All the platforms and tools (e.g. intellart) supporting the measurement of the project’s performance are provided, allowing the community to keep track of and interact with the results. ", "q2r": 5, "assessor": "z_assessor_2966", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11856, "q0": "The proposer wants to create a full-stack peer-review academic ecosystem for a democratized open publishing platform, using Cardano ecosystem and Arweave for decentralized storage. The proposal aligns with the challenge settings which is to provide a product that supports Cardano ecosystem growth and subsidizing Open Access, that lowers the scientific process barrier. This proposal has a complete and well-writen description of the solution product, and provides information about product’s introduction complete with its benefit and background on publishing process. The proposer knows about the project’s risks, stating three major risks, including technological component, security, and traction, and describes about how the team’s approaches to mitigate those risks. Overall, this is a comprehensive, well-written proposal.", "q0r": 5, "q1": "The proposer provides a comprehensive timetable, divided into 4 phases, each with the project progress goals. The team proposed a budget breakdown, complete with workload list and the estimated work duration with specified cost per hour rate. They adjusted the cost per hour rate and the estimated work duration from their other project in Fund 6 and 7. The proposer also mentions the core team, with a brief summary of their skill and experience, LinkedIn profile, and their previous works (including relevant links). Overall, this proposal provides complete information about their core team, development timetable and their estimated budget.", "q1r": 5, "q2": "The proposer provides details about how they will provide regular updates through their blog article and GitHub page. The team also provides measurable indicators to track progress of each development phase, including GitHub commits, number of articles, new followers, and many others. The proposer mentions their success vision in not only their product improvement, but also the impact in scientific publication world and interaction with Cardano ecosystem, divided into short, medium, and long term, which is great to prove that this project can last for a long period of time.", "q2r": 5, "assessor": "z_assessor_3296", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11950, "q0": "The proposal is the most detailed and reasonable proposal I’ve ever read as assessor, providing a very logical baseline of reason the project exist and a very detailed plan and background supporting the idea. The project wanted to develop a open publishing platform for scholars, supported on Cardano blockchain to make the publication decentralized, accessible, and tamperproof, making it great in purpose of tackling the problem of lucrative business monetization from publishing industry towards researchers, by lowering the cost of publication while maintaining publicity of the document. They also already had an MVP close enough to the fully working product. Implemented successfully, this project would create a new possibility of users from scholar and academic industries, providing monetization and decentralization of academic publication that will be liked by the scholars, along with increasing the number of users and transaction in the network. Risk has also been comprehensively described and mitigated.", "q0r": 5, "q1": "Specific timelines and milestone has been provided by dividing the 9 months initial run including the future plan beyond those, with each single of them has a specific target actions that provisioned to be done. Budgeting has also done very concise and easy to understand, mentioning the cost per hour and the total working time for every development aspect in the project. To further support the feasibility of the project, they provided the related background and contact (Linkedin mostly) reference to the team, holding their credibility, which then I would infer that the project could be done flawlessly by measuring their experiences.", "q1r": 5, "q2": "A very detailed and comprehensive targets defined on each platform for each phases, making everything should be auditable easily. They also mentioned several quantifiable number of targets, such as Github commits, interested institutions, 2 new presentation, 1 publicly viewable report per month, etc. New enrollment also accounted as their target. The success points are quite much also outstanding, defining a short to long term plan as the project being implemented and how the users will make use of it. I myself this project will be very auditable in many point of time as it progresses, and by how large the world of impact it would bring, I’m looking forward for the project implementation if it is funded. Kudos!", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12800, "q0": "The Idea of this proposal is to decentralize the scientific research space because their main problem is that the academic journals have too much control. In the current system the scientist loose the right to profit from their research. I am currently in an academic space and see that this problem is real. The solution of this proposal is to decentralize the space with blockchain technology. This seems reasonable and creates new usecases for the Cardano blockchain. This project could bring many new highly educated users for many different academic fields Therefore it matches the goals of the challenge clearly. \nIt is clearly defined articulated how the project can add value to the Cardano blockchain and the project is clearly scalable after the technology is developed. And the project makes the academic research space fairer and incentivizes the scientists to create more and better research because they earn money from their research. Therefore it makes the academic research space more sustainable. ", "q0r": 5, "q1": "The team has provided their LinkedIn accounts. They have an academic background so the project goal seems natural. From their CV they should have the skills and experience needed to create this project. In addition they have alredy made some progress in this project and related parts of this project which look competently made. \nThe budget is clearly broken down, easily understandable and the hourly pay seems reasonable. \nThey clearly described that they need additional funding from later rounds but they aim for economic self-sufficiency.\nThe timetable is detailed and it is easily understandable and realistic. \nOverall the team has relevant skills, the project is well planned and it the proposal gives the reader a clear impression. \n", "q1r": 5, "q2": "They have set clearly measurable KPIs like 1 new article per month in the first three months. So everybody can check for their success. \nThe roadmap is clear, understandable and reasonable. \nThey have set their success goals as an example 2 years into the future. They clearly address the stated problem and solve a real problem. ", "q2r": 5, "assessor": "z_assessor_3472", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 14038, "q0": "PubWeave is the third independent part of a puzzle also composed by PanDAO and Veritheum (these last ones are the base for the first one). The aim with PubWeave is to have an independent and decentralized scientific publishing tool, where the articles will be peer reviewed, stored and published with reduced costs when compared to the current industry. That is indeed a project with huge impact for the scientific environment and also for Cardano ecosystem with potential to completely change the paradigm of scientific publishing industry, giving the chance for everybody to have access to state-of-the-art papers for very small value compared to the very expensive industry we have today, facilitating the access for the ones with less resources. Knowledge sharing would be equally shared through the academic public.\nIn terms of risks, the team has raised some important topics to be monitoring closely, such as the technological component as this is a very complex project, however the team has splitted it into independent smaller parts, what was really clever, so if the totality does not succeed they would still have some good contributions to the community; the cross-chain risk as they use Arweave for storage as Cardano does not have a decentralized storage layer, being this risk addressed by using PanDAO (one of the independent parts of the puzzle); and traction where they expect to bring people to the platform through awareness and marketing campaigns. \nImpact section sounds completely logic and meaningful to me. Nothing to add here, just the necessity to be closely monitoring the risks raised by the team.  \n", "q0r": 5, "q1": "The team has provided a well detailed work plan, which comprises not only the macro tasks but also the inner ones, giving a better idea about the work to be done, providing a reasonable timeline and the key milestones. It is clear the care they had on thinking this proposal what is translated into this well written proposal, it is not a coincidence they are building a scientific tool! \nOn the budget breakdown side, they have described their spends by area, which is ok, however it would be good if the budget was linked to the tasks described into their detailed plan, so we could have a better idea on the costs of each task.\nOn the team background section, it is clear the team’s level of experience, having the necessary knowledge to keep building this robust tool they are proposing to.\n", "q1r": 5, "q2": "The team is committed with auditability, and they will keep all their coding open, available for audit as they evolve, also providing frequent reports on their developing. Besides that, they will be tracking a wide range of indicators (number of commits, number of articles, number of subscribers, new institutions gathering, and so on) that will help check and audit their evolution.\nThe way they see the success of the platform is having enough treasury in middle term to finance all scientific publications for the next 10 years, getting more and more audience with time, becoming a reference in the scientific publishing industry. Way to go!\n", "q2r": 5, "assessor": "z_assessor_3872", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14081, "q0": "This is a very interesting proposal which aligns well with the challenge because it offers a “ full-stack decentralized peer-review academic publishing platform” as an alternative  over the centralized system of academic publishing. This is a field which can be overlooked despite being crucial to long-term development in all fields, so it presents a unique opportunity to get more people onto Cardano. It would make Cardano the blockchain of choice and the only alternative to existing practices.  \n\nThe type of audience the projects is aimed at also presents an opportunity in itself. In addition to increasing the number of people using Cardano, it would bring on board more scientists, which is surely the type of audience that, in time, are even more likely to bring added value to the ecosystem. \n\nThe solution perfectly aligns with Cardano values: it will ensure transparency, it will let authors keep the rights to their work and ease worldwide access, thus benefiting researches who would otherwise have a harder time trying to publish their work and enabling peer-to-peer review and progress.  Last, but not least, ‘ the project will make “open-access a priority through a smart-contract enabled treasury management system”.\n\nThe proposal is very thorough and clearly sets out potential risks and options to mitigate them, with details on how each option could work. The focus is on what I consider to be the most creative and interesting solution of the proposal: the treasury that fills automatically via an external system – the OpenScienceNFT Market Place (another project funded in Fund 6 and which is already functional).\n \nThis proposal is part of a triad which, initially, I saw as a slight inconvenient, especially since it appears that the parts need each other to function, though they are not dependent on one another. However, the solution is very cleaver in the sense that the parts are independent from each other and, should one fail, it will not affect the functionality of the others. And if they all succeed, which I believe the will, they will create a strong and self-sustaining ecosystem which can grow in time.\n \nIt seems that the team has managed to solve all technical issues and has thought seriously about potential challenges that might occur and set up a plan that would allow them time to fix any bugs. \n\nOne final point on impact – the team is multilingual and already plans to expand their blog and comms activities to French and Spanish which are native languages for some of the members, which is an absolute plus, as between English, French and Spanish, they will target markets of millions of native speakers. \n", "q0r": 5, "q1": "The team is very experienced and part of the academic world, which gives them an advantage, as they understand how this works. They are also most likely to have the networks needed to promote the solution and attract new people to Cardano. Thirdly, they have part of the technical skills to create and maintain the infrastructure of the system.\nAs mentioned before, this solution is part of a triad and the other pieces of the puzzle are already in place, one up and running, and the other one close to. So the team have already demonstrated that they can implement their solutions. \nThe project has a 4 phase implementation plan which is very detailed. It is clear what actions will be taken at each phase and how feedback will be gathered. It is my understanding, however, that a significant part of the implementation, especially UI/UX and Haskell development, will be externalized. I think this poses a risk which might not be completely under the control of the core team. So they will have to be very careful that they reach their milestones. \nThe budget is also clearly divided based on the implementation plan and seems to have taken into account increases in prices for software development. \nIt is at this point that I would like to raise 2 issues and give some constructive feedback, which will also explain the score I have given for this criterion. \nThe first one relates to the budget. I am slightly concerned by one of the statements in the proposal, i.e ‘additional funding will be scaling linearly with the work. The amounts we ask for are not enough to saturate the workforce of our collaborators’. Despite having identified a potential challenge which can have implications on the feasibility of the project, I have not understood how the proposer might prepare for this. I would have welcomed more clarity on this or perhaps, they could have increased their initial ask? I am not sure from the proposal how this issue would be solved, should it arise. They do mention wanting to attract software developers to the project, but it is not very clear if this is part of the solution. \nThe second one relates to social traction for the project, which the proposer very well identifies from the beginning, as a potential challenge. I liked the fact that that they have added a comms person to the team, who already has a blog and that they started Twitter accounts. They have also hired a person to write articles and deal with community engagement. However, I would have liked to see a bit more on their comms plan and how they would consider to attract people. The idea is very good, but it needs audience in order to work (like all ideas, but this even more so) and I would encourage a bit more detail on that.\nIt can seem a bit harsh to take on point off because of these 2 issues, but I believe that this can be an incentive to the team to think about how to plan for total success. \n", "q1r": 4, "q2": "The roadmap is very clear and the proposer used specific  KPIs at each phase to track success. They have and will continue to publish weekly updates and offer monthly reports on their progress, making is extremely easy and timely for anyone to check the implementation.  \nI really see no issues in this category, which is I believe they deserve a full score. \n", "q2r": 5, "assessor": "z_assessor_3891", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 14746, "q0": "\"As a person working in academic fields, I understand that the process of publishing journal articles is the cumbersome, time-consuming, costing and suffering process. I agree with the proposers that we urgently need a decentralized scientific platform. As I understand, the project was about associate the NFT to the already published peer-reviewed article. The articles are published in PubWeave, a full-stack decentralized peer-review academic publishing platform. \nIn the proposal, the proposers explained clearly the mechanisms of publishing. The greatest benefits by using the blockchain technology were cost reduction for both the researchers and readers, transparent copyrights, and higher incomes for the researchers. In terms of the risks, the proposers already addressed well and had the in-detail strategic plan to mitigate the risks. \nThe success of this project could gain great attraction in the scientific community, and I firmly believe a great number of researchers would use this platform instead of the traditional platform. This solution is well aligned with the challenge setting.\n\"", "q0r": 5, "q1": "\"The project's detailed roadmap was presented, along with the amount of time required for each job procedure. From my perspective, it would be more satisfying if the proposers were given an actual due date. It was really detailed and precise in terms of the budget. I just have one bit of feedback: the budget should be in line with the task procedure/phase for easy following. The more easy-to-follow the proposal, the higher feasibility of the project. \nThe human resources comprised of several experienced professionals in terms of blockchain and academic fields, these are people with “skin in the game”, having essential skills & knowledge for Cardano project implementation. I believe that this project could be done in a given time.\"", "q1r": 5, "q2": "It was good that the project progress was updated weekly. Moreover, blog articles were provided for updates and educational purposes. The provided KPIs/metrics were sufficient. One more good point was that the KPIs/metrics are specific, in-line with the roadmap set above and have a clear timeline to accomplish. Overall, I think it was very easy for community to audit the project. ", "q2r": 5, "assessor": "z_assessor_4098", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "A full-stack peer-review academic ecosystem where funding is secured by a treasury optimized for long-term sustainability. A democratized open publishing platform can make scholarly publishing thrive.", "experience": "Bioinformatics, Python, JS, Big Data, ML, AI, Blockchain, Plutus Pioneers.\nPhD and Post-doc-level team members and advisors -> https://intellart.ca/#/team\nCombined:\n\nAcademic articles: 40.\nOpen-source projects: 10.\nExperience in academia: A century.\nFluent languages spoken: 6.\n"}