{"id": 423055, "author": "victormundi", "title": "Following & Social Discovery Tool", "url": "https://cardano.ideascale.com/a/dtd/423055-48088", "category": 26595, "amount": 72000, "description": "Almost anyone investing actively in the Cardano ecosystem has experienced a rugpull or scam. And as Cardano grows, it will be even harder to find legit projects to invest in.", "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 4012, "q0": "From what I understand of the proposal, the goal is to create a space where Cardano users will be able to track and validate anything that is happening on the Cardano blockchain (and translate this information to information that is more easily understandable for people without technical expertise). \nThe underlying purpose of this proposal is simply to make information on Cardano  transparent and understandable, hopefully lowering the barrier of entry and attracting (also educating more pedagogically) more participants into using Cardano. \u2028\u2028I am one of those with limited technical knowledge (my expertise lie in education, quantitative research, arts and social behaviour), so a I’m putting a disclaimer here if I have misunderstood any technical explanations or concepts. I do believe that there is some value in me still assessing this proposal, because it might provide an indication of how understandable this project is to the general voter. \n\u2028The idea of combating scams, corruption and non-transparency (and making it understandable) is definitely targeting a problem within the ecosystem, with a sensible proposed solution. If done correctly, it has the possibility of being a go-to-place for both new participants of Cardano, and old. \u2028\u2028I would have liked to see some discussions clarifying the potential risks connected to the development of this project. The proposer explains why and what they want to achieve, but (in my opinion as a PA), it would be nice to see more information on how. For example, the proposer states that it will be easy to verify if a person is a non-scammer, and that a wallet is created in order to follow other users. (Potentially stupid) Question: What will stop a scammer from creating its own ecosystem of fake accounts, connect the wallet and have a decently looking profile? Does this project plan to make use of DiDs, etc? Explanations like this would further strengthen the clarity of the project (at least for the average user). \n\nThe KPIs seem to be very ambitious, targeting 100 000 wallets registered at the end of the year. I’m wondering if there are smaller steps on the way that could represent the proposals success? And will the future of the project after release only focus on outreach and management of the platform? What potential improvements could be made in the future? How will the project be marketed in order to reach stated 100k wallet users?\n\u2028Overall, I agree that this proposal effectively addresses the challenge. ", "q0r": 4, "q1": "We are provided with a roadmap with milestones divided into 4 phases (Following/outreach, translation, Sync, Discovery), the complete project estimated to be ready for delivery after 3-4 months. I have no doubts that the team will be able to release the product within the set timeframe, especially since the work was started before this proposal was submitted. Since the project is already underway, it would have been nice to see an update of the progress included in this proposal, but more on that under ‘auditability’. Here, it would be nice to have some more information on each phase. What does ‘discovery ’mean, and what is the reason for it having 280 estimated working hours in comparison to the ’sync’-phase? Will the whole team be working on all of the areas, or will they be divided between responsibilities? \n\nThe budget is divided between the 4 phases from the roadmap, and includes an estimation on working hours for each responsibility area and a calculation for the estimated costs. The hourly rate is estimated at 60/hour, which seems reasonable in comparison to other projects.  \n\nWe are provided with official links to two projects (only one of the websites working), and a GitHub link, and LinkedIn-profiles to the lead proposer, and team members of the two partnering companies. Further details on who will do what part of development could beneficially be included in the proposal. \nThe proposer has 2 other projects submitted in Fund 9, so it would be nice to have seen a discussion on the potential workload management that would be needed if all 3 proposals were to be funded. \n\u2028Due to the reasons listed above, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.", "q1r": 3, "q2": "The team aims to communicate with the participants via their Discord server, a widely used platform by many. I love the fact that the proposer intends to involve the community by letting them vote on platform design, features etc. Weekly updates are also always appreciated. I would suggest to add links to the official website and social media channels (if any) that are solely linked to this particular project, this way the community doesn’t have to navigate between the other projects created by the same team (it might be a bit confusing). \n\nAs mentioned previously, the KPI-factor of reaching 100 000 users at the end of the year is (from my experience as a recurring PA since Fund 6) might be a bit too ambitious. If I were to trust that information, I would have liked to see a lot more details that focus on outreach and communicating with participants from the Cardano ecosystem. Also, how far has the project progressed between start of development, and submission of this proposal? And if that information was shared, where was it shared?\n\nAs mentioned under feasibility, the few KPIs designed to measure the success of this proposal is more designed to the completion of the project, and since the outreach plays such a big part I would see more details on that reflected in the measurements of success (apart from planning to reach 100k wallets before EoY). Maybe each phase could feature its own KPIs, so that the community could follow development even more easily? \u2028\u2028Conclusively, I neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 3, "assessor": "z_assessor_2504", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 4255, "q0": "The cryptocurrency market has experienced tremendous growth in recent years.\nHowever, this growth has attracted numerous scammers, who take advantage of the low level of regulation and limited technical knowledge of the newcomers. In particular, the eUTXO model (used by Cardano) is not easy to understand for a last-minute arrival, I myself was struggling to read the blockchain at first. Many times it is precisely the latest arrivals to be scammed which leads them to move away from the blockchain space, perhaps talking about it to friends as an environment of scammers.\nThe purpose of the proposal is to create an application that allows you to intuitively and graphically show the history of the transitions of an address / project or NFT, (translated into) activities, network and follow-up.\nThe user connects his decentralized wallet to follow others. This will help users avoid scams and increase the adoption and growth of the Cardano blockchain as it will be much easier to navigate based on social discovery.\nIn this sense, I find that it would be really interesting if you evaluated a copytrading mechanism on the model of Etoro for the future.\nI agree that the proposal falls into the category of the challenge, being able to make an impact use case for the Cardano ecosystem.", "q0r": 5, "q1": "The team behind the Internet companies Ratecard and WebFeedback will work on this project, led by founder and developer Jeroen Sakkers whose linkedin (victormundi) references are signed and who followed the Plutus Pioneer program. The team as a whole has many years of experience in the media and software industry and has already released a public beta of their initial product. The development plan has four defined phases and a lead time of 3-4 months is provided for the realization of the platform, which seems more than reasonable considering the size of the team and the total number of hours. The hours of work for each phase are clearly delineated as well as the hourly cost ($ 60 per hour) which is in line with what is required by other proposals financed in the previous funds. Once the platform is built, the team will focus on gathering a large user base before evaluating any requests for funds in subsequent rounds to develop additional features.", "q1r": 5, "q2": "The proposer provides a detailed plan including timelines and milestones. The community will have the opportunity to measure the progress of the proposal (Github is provided) and at the same time will be able to vote on the implementation of features, design and more within the project's Discord server. The success of the project is defined as the development of a fully functional platform with 100,000 registered wallets (with at least 10 followers per account) within one year, in addition to the number of registered wallets and the number of profiles followed per account, there are no other kpi metrics for the definition of success, but these should suffice.", "q2r": 4, "assessor": "z_assessor_2531", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 5292, "q0": "Following & social discovery tool proposal offers the solution to follow any address, project, or NFT on Cardano blockchain, and track its activities and network (Social discovery). From using his solution, the user will know the interaction between address (network) and their activities, who follow them and whom they are following. This acts as a crypto graph and user will need to connect his/her wallet before following others. The solution wants to prevent ones from being a victim of rug pulls and scams. The proposer doesn't really explain technically how this could be done although the solution will be very beneficial for the users to be able to tell the project apart if they are real VS. rugpull. Also one wallet can generate many addresses in an instant. How could it be possible to keep tracking if the rug pull project also changes their addresses or create multiple addresses to prey the users. The proposer will have to explain more technically and provide answers to these questions for the proposal to effectively address the Dapps, products and integration challenge. Also the apeproof.io link doesn't work and the link might contain more information on the proposal but it can't be sure. The proposal lists the risk of this project as keeping up with the pace of the blockchain and the competitor on Ethereum and might want to give more information and how he plans to mitigate each risk.", "q0r": 4, "q1": "The proposal lists the timeline of this project to be in 3-4 months (June-Sept) - Following, translation, sync and discovery but has no detail on what to be done exactly. The project takes 1200 hours of development and budget of $72000 with the rate of $60 per hour. The proposal should list the team members other than only the team lead. In summary, the proposal needs to provide the working detail and team members. If the project gets funded, the budget is enough to build the platform and gain the traction. More information on roadmap and milestones is needed for the project to be fully feasible. ", "q1r": 4, "q2": "The project progress and update will be shared on discord and published weekly. It is great that the project will allow the community to vote on features implementation and design. By keeping the close interaction with the community, they can track project progress and updates easily. The project once completed will allow people to connect their wallet and following addresses, projects, and NFT. The metric for this project is 100,000 registered wallets and following at least 10 addresses per account. The proposal still needs to address more on technical implementation, roadmap and milestone. Without this information, it would be quite a challenge to determine the possible traction of the platform. ", "q2r": 4, "assessor": "z_assessor_2684", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6505, "q0": "The Following and Discovery Tool can be very beneficial to new Cardano users. As we expect more projects being built on Cardano. We need to make sure that these users are protected from any form of malicious behavior or rug-pool project. This will protect individuals in the community and prevent more positive experiences in the early Cardano ecosystem. I think that this idea to create a discovery tool can be very effective in helping the current challenge of finding new and secure projects. For these reasons. I give this section 4 out of 5 stars. ", "q0r": 4, "q1": "The proposer seems to have a good understanding on how this proposal could be implemented and how it would benefit the Cardano ecosystem. My main focus as a PA is to help find proposals that I believe will impact the Cardano community. This dApp has the potential to help benefit the community and provide and application that can keep users safe. There is a detailed roadmap that explains what the team plans on accomplishing. I find it to be extremely positive that the team has already started on building. This shows that the project isn't just waiting to be funded before starting, but have already started working on their project. For these reasons, I give this section 4 out of 5 stars. ", "q1r": 4, "q2": "There is a lot of information provided that explains how the success of this project will benefit the community. In the detailed budget breakdown, there is a list of the funds that will be given to the programmer of the dApp. I think that it could be slightly more specific on where those funds will go. I realize that it is a form of wage for the programmer, but a part of the funds could be allocated to something else as well. For these reasons. I give this section 4 out of 5 stars. ", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11870, "q0": "The petitioner wants to address the problem of making it more difficult to find legitimate projects to invest in. The goal is to develop a tool with which you can deduce whether a project is legitimate or not. This project can have a positive impact on the Cardano ecosystem as it can help people regain confidence in projects. This protects people. The main goals correspond to the outlined challenges setting. The future challenges are included. Improving the algorithm that automatically \"translates\" transactions into activities while being fast enough to keep up with the increasing pace of the Cardano blockchain. Another risk would be mutual competition, but there is no such thing at the moment.", "q0r": 5, "q1": "The proposer indicates who will be working on this project. The team that will work on this is behind Ratecard and WebFeedback. You can find the relevant experience on Jeroen Sakkers' Linkedin. It also says there may be collaborations with experts on contracts and beating Cardano. It would be useful if these experts were already listed in the proposal. The submitter is transparent that the team is relatively young. The points where the team excels are also included. The budget will be used to pay for the development hours. The hourly wage is chosen fairly. ($60 per hour) The budget should be sufficient to meet the proposed goals. A timetable has been included to complete the work. It would be helpful to go into more detail about what will happen next. It would also be useful to include the technical aspects in the proposal. The plan states that the money will be used to fund the various phases. Some future challenges are included. (keeping up with increasing pace of Cardano blockchain and mutual competition with similar projects) For the time being, the proposal does not foresee any competition.", "q1r": 4, "q2": "A road map is included with associated milestones. The project is divided into 4 phases and should be completed after 3-4 months. I find the roadmap very abstract. It would be better to include various KPIs in the phases in order to get a clear picture of whether the project is being developed successfully. It's good that the community will be kept up to date through their discord server. A weekly update will be posted on the progress of the project. The community also gets a say in the functions to be implemented. The submitter provides a clear description of how difficult it is to find a legitimate project to invest in. The solution that is offered can again provide transparency and reduce the chance of fraud.", "q2r": 4, "assessor": "z_assessor_3308", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Follow any address, project, or NFT on the Cardano blockchain, and track its activities and network. Activities are transactions that are translated into a (more) human-readable format.", "experience": "The team behind this project is relatively young but has a combined 30+ years of entrepreneurial experience in both the media and software industry (Ratecard, WebFeedback, FOTY Awards).\nThe team excels at:\n\nSoftware Development\nUser Experience\nViral Growth\nPR & Media Coverage\n"}