{"id": 423114, "author": "adaku", "title": "Well-being in Web3", "url": "https://cardano.ideascale.com/a/dtd/423114-48088", "category": 26595, "amount": 94000, "description": "We’re not speaking about well-being in web3 enough, and we need to. As exciting as everything is, we need to establish clear boundaries for well-being + actively seek to ensure mental/physical health.", "f6_no_assessments": 4, "f6_rating": 3.0833333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 1735, "q0": "The proposal meets the requirements of the challenge and is quite average. It is about creating a support network in which beauty salons and wellness centers would be interconnected and would make use of Cardano's technologies to promote the goal of making people feel good. The problem I identify here is the lack of more detailed explanations about how our blockchain technologies would be used. Thinking specifically about the specific objectives of the challenge, as the proponent explains, the topic addressed most directly is “physical products - Housing tokenized as a native Cardano asset, international cryptocurrency headquarters and liaison office on all continents, etc”. However, the way in which Ada and CNFTs would be involved with these products is still quite abstract. Speaking about the problem raised, the proponent comments that it is necessary to establish limits that seek to guarantee the physical and mental health of the members of our community, which is a totally valid statement. So to solve this problem she suggests that a research be done, identifying stress factors, first. Then Cardano would be integrated with “interesting use cases like the beauty/wellness industry to educate more people and further improve the representation of women and ethnic minorities on the web3. We will achieve this with physical spaces/events, physical products and more.” The proponent states that it will collaborate with existing physical spaces - how? How would this partnership be established? What benefits would these wellness centers gain from associating with the project, and what kind of responsibilities would they have in this regard? She also states that in the future the physical spaces specific to the project will be created: where? What would these spaces be and how would they directly meet the needs of our community? The proponent also explains that web3 member clubs would be created where events in real life would be held, as she exemplifies: retreats and breaks with technology. What would those events be like, what retreats, how does that relate to Cardano? How can we ensure that the project is successful enough to expand to other continents (by the way, what would the host continent be, the country where everything would start?). The use of cNFTs part is also quite abstract, it is said that “the association will be in the form of cNFTs that have additional advantages such as access to physical spaces, physical communities and physical products. Payments for everything will be in ADA.” It is not very clear what these active tokens would be, what their holders would be able to access and how this would all contribute to the expansion and further affirmation of the Cardano blockchain. It is also said that the issue of vulnerability will be worked out, so that safe spaces would be guaranteed (how would this security be guaranteed, and what kind of danger are we talking about - robberies and etc?). For these reasons, as much as the idea in theory is very interesting and can be beneficial for Cardano and aligned with the challenge of dApps, it is not clear how the initiatives will be put into practice, so improvements are needed in this topic.", "q0r": 3, "q1": "Unfortunately this topic is not suitable and the proposal does not seem very viable to me. The script is not very precise, the timeline is divided according to very long intervals (eg quarters and bimesters); it would be better if we had shorter intervals to understand more precisely what would happen when. The activities are also not very detailed. For example in the first quarter, the focus would be on research, it is said that there would be “a literature review of any wellness-related research available on the web3” – how would this literature be sought? How would the interview be created, which target audience would be interviewed? How would we recruit members of our community to help bring interviews to other countries and languages? How would the research be publicized, starting in month 4? It is said that work would be done with designers, cameramen and editors, but we don't know how they would act here (perhaps turning research results into illustrated, recorded content, etc?). In 3 months, all we know is that it would be 'partnerships + work with existing locations and 'pop-up' locations to establish a database of locations our members can access as part of their 'Welfare at Home' membership. Web3 Member Club”. But it is not clear 1) how the existing sites would be selected 2) how this bridge would be drawn 3) what activities would be jointly developed from there. Overall, the roadmap doesn't allow us to have a solid understanding of the development process that will be done. Same thing for funding. We don't know why the research activities would cost 44 thousand dollars, why the dissemination and work with other professionals would cost 20 thousand dollars, why the establishment of partnerships would cost 10 thousand dollars... and that they were duly justified and argued, that we could understand which professionals would be working here and performing which roles, being paid in which way, what would be the value of each working hour, and so on. For all this, funding would need to be very detailed, which unfortunately does not happen here. And finally, talking about team presentation, we actually only have one professional involved here, who will be the proponent: Dr. Adaku Jennifer Agwunobi. It is not clear if she has any direct relationship with Cardano, how this relationship takes place, what role she plays within our community, if she understands blockchain and how the technical parts of the project could be successfully executed. Despite being a highly educated person, he doesn't seem like someone with experience in Cardano's technologies, and it would be extremely necessary to have that peace of mind (that the technical parts would be well assured). That said, it would be necessary for a developer to be contracted to work on the CNFTs, we would also need to know about the other professionals involved in the total journey (for example, designers, audiovisual professionals, etc., who are mentioned in the script). All team members should be properly presented, with their names, CVs, linkedins and a detail on whether they have any kind of relationship with Cardano and what it would be. For these reasons, the topic has a lot to improve.", "q1r": 2, "q2": "The proposal is not easily auditable. Despite the proponent claiming to have experience in the research part, it is not clear how small advances would be communicated to our community members. How could we know about the research methods, how it was being developed behind the scenes, its pre-production, how the contact with the target audience was made, how the interviews were, how the information collected was studied, organized and stored? Regarding the database and local partnerships, the bidder further explains that she has experience with this activity (“I worked previously at Uber's London headquarters in Marketing and Partnerships, so I'm also very experienced in that”); but, again, how can the partial achievements and development process of this be monitored by us? Regarding the process, it would first be necessary to have a more detailed script, so that our community knew exactly what to expect: what would have to happen, how, when, who would do it, with what objectives and in what way each small action would relate to the whole. At the end of each month, the proponent should make an overview of information and make it accessible to the members of our community. It is essential that it establish some communicative bridge with our community, since the project is complex, extensive and expensive, we need a place to communicate frequently, it can be a discord channel, youtube... that allows us to make that connection. About the final success, little information is also given. It is said that “during the research phase, the main sources of stress will be identified and we will disseminate the results with an action plan and evidence-based targets to correct the identified problems that exist. The features will be elaborated and included as part of the initial custom box that is offered.” How can we understand what the consequences of this project would be, both in terms of research, as well as in the resources developed, in the database, in the partnerships signed, in the creation of active tokens, on the physical spaces... How could we verify that the main objective , which is to promote well-being on Web3, has it been achieved? And how did this contribute to the popularization of Cardano? How can we understand that if the objectives of the challenge were achieved, such as: creating some dApp, greater number of active members in the community, greater number of CNFTs in our network, more digital wallets, payments in Ada and etc? It would be necessary for this whole scenario to be analyzed, understood and presented to our community. As in the case of the auditability of progress, some communicative bridge needs to be established here, so that the final analysis is accessible to all of us. That said, I think the bidder should delve deeper into how their project would be monitored, and establish solid direct contact with our community.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 8, "ne": 4, "ng": 1, "nfo": 3, "vca_o": 1, "reply": "There are some inaccuracies in this review. I'm grateful for the amount of time taken to make comments however it seems like more of a personal opinion as opposed to thinking about inclusivity in the Cardano ecosystem. \n\nAnother point is that I'm an experienced researcher with a Postdoc at Oxford University, PhD in well-being, MSc Marketing, BSc Economics and finishing off PGDip Health Research at Oxford University. This PA made comments about the amount for research not knowing that similar projects can even cost hundreds of thousands for something similar."}, {"id": 9721, "q0": "The problem described in this proposal is clearly identified and it is clear how the project intends to solve this. The project is also aligned with the challenge as it intends is to add value to the Cardano ecosystem through physical spaces, beauty wellness products and education. Information is also provided on why their proposal fits the Dapps, Products & Integration challenge as the proposal supports physical products that intersect with Cardano. The proposal clearly describes how they will support their outlined challenge settings by onboarding memberships through cNFTs and payments being made by ADA which increases the quality of their existing products and this integration will increase the utility and adoption of Cardano. They also clearly describe how they will bring existing solutions together for a more seamless and connected experience with their physical spaces, physical communities and products. By onboarding their members though cNFTs they increase the number of products available for the community to use which enriches the ecosystem with new use cases. The proposer outlines a future challenge and how it is going to solve it. Although it would be important to describe how their ‘safe space’ will solve ‘vulnerability with regards to wellbeing’. An example could be providing knowledge and awareness-raising or taking preparedness measures within the safe spaces. Technical requirements in their physical spaces could also be a challenge to consider as the proposer aims to use cNFTs to onboard their members with access to products, spaces and additional perks – This will carry some level of technical complexity. It would have been beneficial if the proposer provided more information on the project’s foreseeable risks and challenges to give more reassurance that they are well prepared. The proposal clearly articulates a plan to have their own spaces and to have headquarters be established on every continent - giving acknowledgment to future sustainability.", "q0r": 5, "q1": "The proposer presents relevant skills and experience of the team to implement the proposal. The links provided on the proposer profile show that they are competent in delivering the tasks required. Also, the fact that this project is already tied to a business that is already in motion suggests that they are productive and innovative. Information on the roadmap is sufficient. Each phase is detailed and well thought about – I believe they have a realistic timeframe to complete the work. The roadmap also gives information that they understand the type of team members needed to successfully implement the proposal. Information is also given on a conductible plan for team members that are brought to the project and what they will be doing to achieve the goals of each phase of the roadmap.  The budget is clear, closely relates to their roadmap and the amount requested to achieve their goals appears to be reasonable. The proposal clearly articulates how they plan to implement their milestones, the resources needed and the research that is required. The challenges and risks that they foresee have been briefly mentioned. Though it would give me more reassurance of their ability to scale if they provided more information on minimizing future risks and their strategies to resolve future challenges.", "q1r": 4, "q2": "The description of the problem is clear and concise. Auditing the proposal was a smooth process as the solution is closely aligned with the challenge and is represented well through clear information on their background, previous experience, roadmap and budget. There is clarity in the roadmap with a realistic time horizon for achievement. The proposer has well-thought-out research-based metrics used to define the success of the proposal. It may be beneficial if the proposer explored more KPIs as a measure to define success in different phases of the roadmap. For example, to measure the number of social media followers in months 3 & 4 or the number of partnerships made with venues in months 5 to 8. These types of KPIs measures will also allow for sufficient information to assess the progress in attaining the project’s stated goals Overall, the proposal provided sufficient information and was easy to audit.", "q2r": 3, "assessor": "z_assessor_3086", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12657, "q0": "The proposal meets the challenge setting. Projects targeting health and beauty issues integrate with Cardano, Cardano is lacking health applications like this, projects that care about human health and the environment are quite rare, so I Welcome to this project.\nI'm a bit confuse about how the project will support health, beauty, and education through Cardano as the proposer is prioritizing the presentation of its potential. For example, casting functional products to support health or beauty, health improvement methods into NFT comes with detailed information, which is easier for the audience to access and use. So i hope you clarify what features or mechanisms by which your products will be distributed through Cardano.. Membership will be in the form of cNFT, this is a great idea, it will make project management easier.", "q0r": 4, "q1": "Thank you for the detailed information of the project owner. To the point of satisfying me. The evidence link of this person's experience is also very clear. This helps the community feel more secure when the fund will be given to qualified people. The project roadmap is quite full of assignments, but I am a little concerned that the project workload is a bit excessive for one person. I know that the member's rich experience is likely to do, but I think you should add more staff or if you already have, I'd love to see their details. It will give me more peace of mind about the feasibility of the project.", "q1r": 4, "q2": "Thank you for helping me understand your vision for a project like this. I hope you will try to update the project progress and related reports continuously and clearly for the community to follow. This will bring the project closer and if there are difficulties, it will be easier to receive advice and support. One request in this section is that I ask that you provide specific metrics that you would like to include in future surveys, such as responses, number of customers, etc., so that I can compare them with those reports to see if it is satisfactory.", "q2r": 4, "assessor": "z_assessor_3445", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 15103, "q0": "The premise of the proposal is about well-being on the web 3. The proposer intends to carry out research for well-being. There is no significant relationship between this proposal and the challenge. The proposal does not adequately articulate how the research will impact this challenge. The idea of ​​using a membership program that would be accessed by NFTs and payments made by ADA was mentioned, but if we consider the plan described, the proposal focuses only on research, not adequately addressing the only parts that could be related to this challenge.\n\nIn addition, the use of NFTs in the program and member will be optional, which diminishes the relevance of the proposal in this challenge.\n\nI would recommend that the proposer focus on how this proposal will use the blockchain, what the membership system will look like.\n\nThere are no metrics/KPIs that indicate tangible targets related to this challenge.\n\nThere is no mention of a plan for the financial sustainability of the project in the future, and the proposer must request funding again from Catalyst.", "q0r": 1, "q1": "The proposer mentioned relevant experience in the research area, on LinkedIn I was able to attest to the proposer's qualifications and link to the research related to well-being in digital entrepreneurs conducted in 2020, so there is expertise to conduct the research, but the part of this proposal that is related to this challenge would be the use of the membership program, NFTs and cryptocurrency payments and in this part of the proposal there are no details on what or who will develop, which brings uncertainty about feasibility.\n\nIt is unclear whether there will be a team, as the proposal only mentions Adaku as part of the team and at the same time mentions \"The funding will enable us to make deposits and payments for events which we will curate too.\" \nUs? Who else would be part of the proposal? What expertise do the other team members have?\n\nWithout knowing how many people will be part of the team, the budget evaluation is also compromised.\n\nDespite the budget being divided into parts corresponding to the stages of the roadmap, there is no clarity on how the money will be used. Most of the money will be allocated to research, but there is no estimate of how many hours will be needed at this stage and how many people will conduct the research, which makes the budget evaluation unfeasible.\n\nThere is mention of $20,000 USD for distribution of 400 \"personalized box of hairgoals products\". What's in these kits?Shampoos?Hair creams? There is no way to tell if the value is appropriate without knowing the contents of these boxes. Another point is that the proposer also seems to be responsible for the sale of these products, so we need to know if the treasury will be paying for the production cost or for the selling price to customers, as this will define whether the proposer will or will not make a profit, which would be an undeclared conflict of interest.\n\nThere is a realistic timeline for the development of the proposal, but the plan focuses on research and fails to address how the membership program will work and how the proposal will actually be integrated with the Cardano blockchain.", "q1r": 2, "q2": "There is a multi-step roadmap that allows for an acceptable audit of the proposal development.\n\nThe definition of success is understandable, increasing the participants' well-being and the suggested metric can help to identify success through surveys to measure well-being, but there is a conflict of interest in which the person responsible for the research manipulates the data to signal a more favorable outcome, how would this conflict be resolved? Perhaps additional metrics can mitigate this risk. There are no targeted KPIs.\n\nThere are no metrics to indicate the impact of the proposal on the challenge and as the proposal uses the argument that there will be a membership program, NFTs and use of ADA for payments, it is essential to create metrics/KPIs, in order to capture performance in these aspects.", "q2r": 3, "assessor": "z_assessor_2048", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Research. Cardano cares, and this is clear. Let us integrate Cardano with use cases like the beauty/wellness space to educate more people + make them feel good! With physical spaces, products, & more.", "experience": "PhD in the area of entrepreneurial health and well-being in the digital economy with core considerations of diversity too. Passionate about improving wellbeing and representation in web3. Founder of hairgoals: natural hair care, wellness and (c)NFT communities."}