{"id": 423227, "author": "thehiddenorder", "title": "CNFT CON KickOff Party", "url": "https://cardano.ideascale.com/a/dtd/423227-48088", "category": 26595, "amount": 180000, "description": "Cardano has the stigma of being the \"lesser of the fun\" blockchain versus Ethereum and Solana when it comes to events and parties on social media such as Twitter.", "f6_no_assessments": 8, "f6_rating": 2.708333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 477, "q0": "The proposal's core is the marketing and promotion of the CNFT to a wider audience to increase adoption. However, the point of the challenge is more focused on dapps and integrations and less on marketing activity. Although the proposal is sound, I believe this is not the correct challenge for it. Therefore, the low score.\nThe proposal describes the KPYs, but there are no estimates or values to evaluate the success. The goal is to bring notice and showcase a strong community in order to attract artists and celebrities. Although a lofty goal, it is left unclear how it will be measured or valued.", "q0r": 2, "q1": "The proposer has provided a link to a webpage presenting past work as well as described personal experience. No links or proofs of the experience has been shown except the general statement. Given the size and nature of the proposal, more verifiable info would be needed such as Linkedin or some other public profile. The link did not provide more insight into the proposer and/or the team behind it.\nThe team does consist of two persons, one who was responsible for Consesus Austin Afterparty and the other a founding member of the South Florida Meetup group.\nThe budget is presented in general form with general statements and would be great to see more details on it such as: who are the headliners, which notable musicians/DJs/rappers. Is there any work already done on it? Personal connections? Overall, the plan, budget and milestones can be improved given the size of the requested amount.", "q1r": 3, "q2": "Evidently, the hardest part is the audibility of similar events and their impact. The proposer mentions Account Engagement as a metric to measure, but there are no estimates or any guiding values.\nI found it hard to judge from the proposal what is the expected impact of such event.\nThe proposal can be improved by choosing a more appropriate challenge, well-thought out metrics/KPIs as well as some milestones of the progress.", "q2r": 2, "assessor": "z_assessor_2093", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 699, "q0": "If we consider the \"about\" challenge indications, this proposal should not be really relevant, given that they're not developing any product, dapp or integration within the Cardano ecosystem, but rather asking funding for throwing a physical event in US, which I don't see how it's impactful in terms of dapp development (you can create awareness and pay celebrities, but at the end you're making a party about NFT/CNFT, not really developing a product). However, in the \"about\" description, there's a section where it says proposal may include \"social media\" (although it's not well specified if it's talking about creating social media engagement or developing social media dapps/product), so in this case the proposal may partially apply, since it'll host some hashtags in twitter, although it's not sufficiently impactful for the amount of funding required IMO, since it's not a dApp or product, but a party to present Cardano'ecosystem as a \"cool community\" to the public.", "q0r": 3, "q1": "There's only 2 numbers regarding proposer's team, which is good. However, they're planning to give 100K to an event production company, and they don't even mention which company it'll be, so it's hard to know how they can be successful or not, and we don't know if it makes sense to give them +50% of proposal.\nRegarding roadmap/milestones, they have a schedule date for 7 oct (to confirm, after 2 months upon proposal confirmation). They mention they're planning to pitch celebrities, although we don't know who they'll be and how this/those celebrity/celebrities will impact into community engagement. \nThey have a somewhat detailed plan, however, I don't like the idea of giving 100k to an event team from who we know abolustely nothing, that's why I give this proposal a 3, since it doesn't seem that assessable the team in my opinion.\n", "q1r": 3, "q2": "Since the main objective of the funding will be about throwing a physical event in US, I'd like to see some KPIs and metric goals regarding physical number of assistants, rather than only measure the twitter activity through hashtags. \nWhen it comes to how the success looks like,  they've stated \"Success for us looks like when Ethereum and Solana Twitter users start to interact with the Cardano Twitter pictures during CNFT CON Kickoff Party to create cross chain talk attracting them to Cardano.\"\nIn my opinion, I don't agree that the main focus or success of the project should be to attract cross-chain interaction with Eth/Sol comm. members; but rather focus on generating a valuable experience for the Cardano community, with meaningful speakers and thoughtful talks, networking between projects, etc. I think something like \"Achieving X number of assistants to our physical event, with a thriving exchange of ideas and projects between participants, and knowledgeable presentations of Cardano's true potential\" or something similar.\nSince they've presented that the problem is Cardano's reputation or image from outsiders , they should try to present this in the \"Cross-chain collaboration\" challenge, with a twist of idea that can generate meaningful collaboration within communities, not only a Cardano NFT focused party, with no interaction with other crypto communities whatsoever, but expecting big results in terms of raising awareness or changing Cardano's image or status in the crypto industry.\n", "q2r": 3, "assessor": "z_assessor_2121", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2660, "q0": "This seems like a great idea to promote ecosystem adoption for Cardano, however it may be suited for a better category? Maybe the \"cross chain collaboration\" or \"the great ETH migration\"? Either way we need more ideas like this to drive engagement and branding.\n\n180,000 seems steep for a community event? I'd consider lowering this for a better chance at getting voted on.\n\nYou mention a risk of \"not getting approved\" by catalyst, and your backup plan is \"throwing a smaller one\". Any details on that? Or a breakdown of why you are requesting 180,000? Given your extensive experience with events and Catalyst, I would try and leverage that to provide a better budget. Do you have more info on your backup plan incase you dont get approved? ", "q0r": 3, "q1": "Have you confirmed the below approximate amount needed? \"Use $100K to rent and pay Event Production Company to set up for CNFT Con\".    I'd suggest doing some research and/or breaking down your budget more.\n\nI like this idea \"Pitch $70K to get 3 notable Musicians, DJs, and Rappers.\", however you can cut 70K easily off your budget by just making a sweet playlist and pressing play!!!   I've got a lot of event experience too and I find people enjoy this method just as much or more! Maybe take requests or something to get the crowd involved. Play some Cardano music NFTs!!\n\nActually, given the additional below, you can save 90K from the budget with a good playlist.\n\"$20K for Hotels, Airfare and Buses for Headliners\"\n\nGreat amount of relevant experience for your members which is good to see and gives confidence in your teams ability to execute on plans. Just need more info on that plan.\n\n\nHave you already been approved for catalyst funding before in the past? Looks like you may have. Maybe look back to the budget breakdown of that one?", "q1r": 3, "q2": "Lots of good mention of social media plans for auditability, but doesn't seem like much thought was put into this. Any specific metrics? Any baseline from previous projects you can reference?  Maybe track attendees with NFTs? Then run a campaign after to engage and keep them coming back. Need to make a frictionless and sticky experience.", "q2r": 2, "assessor": "z_assessor_2329", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3653, "q0": "The problem statement and solution presented by this proposal is not closely related to the challenge it has been presented on. Dapps, Products & Integrations challenge aims to fund projects which will build products to expand Cardano ecosystem such as DeFi, marketplaces, gaming, etc. Instead this proposal is about funding audio and visual production for a private NFT party in Las Vegas. As relevant as having Cardano presence in a NFT event where other blockchain projects will be assisting as well, this project doesn’t aim to develop any tool, product or integration therefore should not have been presented in this challenge.", "q0r": 1, "q1": "The team is described as being experienced and knowledgeable regarding the organization of large events, although there are no links or third-party verifiable information provided to backup their claims. \nThey used the same information for the detailed plan including timeline and key milestones as in the detailed budget breakdown. If this event will take place on October 7th then the timeline should be the most important part of the proposal. If funded this proposal would have only one month to accomplish all that is described. Time management would play a crucial part in the success which is not reflected here. Regarding the budget allocation, $100K will be used to rent and pay Event Production Company, is this the name of the company that has already been identified as been able to provide the equipment needed? It would be wise to request a budget to at least three different companies that could rent the equipment needed for the date and location of the event. More information regarding the allocation of these 100k would also be needed to properly evaluate the proposal. The total amount mentioned in this section sums up to $190k while the requested funds in General is $180k, this discrepancy gives further evidence that the amount requested was not analyzed in detail.\nThe proposal answered No to the question of “are you or any member of your team working on any other proposals in this Fund9?” when in fact the user Timothy Vang, the author, has a second proposal called “Create YOUR RPG Character with NFTs” in the same challenge.", "q1r": 2, "q2": "While Twitter interactions and engagements are beneficial and a positive tool for adoption, a project with requesting six figures in funding should have additional and more robust metrics to measure the project’s progress. One of the team members is attributed as founding the biggest Meetup with eight thousand members, this expertise should also be bootstrap for this event and it provides an additional tool to measure the impact of organizing this event. Regarding how success looks like for this project, the answer provided is too vague. How will you identify Ethereum and Solana Twitter users? What about users from other blockchains? How will you quantify these interactions? Against which other metric will you measure it? These are crucial points for a proposal asking a considerable amount of money to be spent on one day, therefore is important to have a robust methodology in place to justify the investment.", "q2r": 2, "assessor": "z_assessor_2465", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4500, "q0": "Although I am planning to attend cNFTcon in Las Vegas myself, I struggle to see how holding a huge Kick Off party that is trending on Twitter and attracts celebrity and improves Cardano's \"fun\" image supports the goals and objectives set out in the Challenge setting. Publicity and marketing are without doubt important to every community and business, and benefiting the entire cNFT space would be a big boost to Dapps and Products relying on demand for and value in Cardano NFTs. I just think that by purely focusing on buzz, celebrities and press, the long term vision and image of Cardano as the more secure, more robust, more scalable solution for NFT minting and integration is not served with too much impact. If we were to highlight a new product launch or hardfork crucial to cNFTs I could see the point how this might justify 4 stars for Impact given the clear directions, however broad, of this challenge category. But by focusing solely on hashtags and the period during cNFTcon, the funds requested might be better deployed elsewhere creating new user experiences, features and integrations. To qualify: this is in light of the defined brief, I have no doubt that social media traction is highly important in a more general context or if it had been proposed in a challenge setting specifically to that end.", "q0r": 3, "q1": "This proposal by a previously funded proposer with highly relevant experience, online presence and network of collaborators should be highly likely to be implemented successfully. The budget is sufficient to make a real impact on the ground, and the planned roadmap is credible to lead to that success.\nIt would have been nice to see some more detail on the proposed budget, as $20k for hotels and items in this granularity seems a little unfair to proposers in more modest funding categories - i.e. how much do these rooms cost per night exactly, are there discounts available or cashbacks from loyalty programs etc? I am not taking this into account as a negative, just suggesting that sharing more research and details may have been of interest to voters and other community members proposing similar events or smaller versions thereof.", "q1r": 5, "q2": "The auditability of the proposal for success are very clear, with hashtags and social media metrics provided that could be tracked with the Twitter API. I would have liked to see some goals and metrics not only for the post-event success evaluation, but also to safeguard the impact of the funding in the event the targets are not met. How could we maintain relationships with the celebrities enlisted, how could the long-term Twitter following of Cardano NFT related content providers benefit from this kind of investment and event? Project Catalyst gives us a unique opportunity to plug the community into the implementation and audit of this kind of proposal, so I would have loved to see more of the proposal deal with updating the community not only about the party/event itself, but the process of organizing it and the possible benefits that could be had from spending $180k in Vegas. I understand that in the world of celebrities and big ticket marketing this is not a huge sum, but a few funds ago this may have funded entire protocols or dexes, and markets are down and people are tightening their (crypto) belts.", "q2r": 4, "assessor": "z_assessor_2554", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5599, "q0": "I consider that the intention of this proposal adheres to the challenge in a vague way, since what is sought is to have a vibrant ecosystem full of dapps and integrations, the most that could be achieved with the final deliverable is to attract attention in a somewhat ephemeral way to the ecosystem.\nI believe that the part of the event or party proposed here, should be only one component of a larger and more comprehensive event that promotes more effectively the benefits of developing in Cardano.", "q0r": 2, "q1": "It is clear that organizing an event with celebrities and great production values can attract the attention of CNFTcon attendees as well as social networks, generating a span of attention through effects such as becoming a trend on twitter.\nHowever, even though the proponents have the necessary experience on paper to organize an event of these proportions, it seems that any promotion generated by the event will be ephemeral, as it will not be connected in any way to IOHK or even to some of Cardano's projects, making it just a fireworks-like event with little substance.\nI recommend the team to take advantage of the experience in this area and make an effort to create an event that better integrates the benefits of developing and consuming Cardano, as well as serve as a platform for many projects to generate conversation around it.\nA good example is what Geoff Keighley is doing with the video game industry. ", "q1r": 2, "q2": "The proposed measurement factors are very vague and I believe that there is no way to really measure impact as there are no clear parameters. \nIt is mentioned that they want to reach a higher number of Hashtags than in other community events, but there is no floor on which to start measuring, and it is also unclear what is the level of exposure that really generates a positive impact for a product like Cardano and its network of projects, so the KPI's seem more like subjective criteria.\nI believe there is value in this initiative but i would suggest the team to reevaluate and regroup, seeking synergies to generate an event with greater impact.", "q2r": 1, "assessor": "z_assessor_2719", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 6837, "q0": "We cannot do away with the fact that Cardano is badmouthed unfairly by people who are ignorant of it's potentials or competitors although it is gradually regaining it's stand recently.  These proposer intends to change that narrative in a fun and social setting. \nThe proposed solution seeks to organize a party powered by Cardano. A party will definitely bring about people/crowd, but the question is are they a crowd that will serve our (Cardano) purpose? However, i don't think these problem address these challenge.", "q0r": 2, "q1": "The proposer provides a detailed implementation plan for the event with timelines and a well defined budget. However my concerns is how effective the impact of a party will be. Agreed a party will create the buzz and be the talk on twitter and other social media outlets, but the impact will not be sustainable longterm. I will however suggest that the proposer put these same energy into creating a DAO with the musicians and artists and then through the DAO, they can discuss a more resilient way to impact and create a more structured method of creating awareness within their (Musicians) respective communities. Afterwards, they can plan a party. With these approach, the people coming for the party will make informed noise and buzz on social media which will have more weight and value. This is in my understanding, the Cardano way. Education first and then fun.", "q1r": 3, "q2": "The major metric to track progress as mentioned by the proposer is the rate of twitter engagement regarding the event and the factor to evaluate success is the rate at which other blockchain users react to the event. A positive reaction/engagement is expected for a satisfactory implementation of the project which i agree, because such an event is to command the media towards your direction which imo, is a good tool to measure progress and evaluate success.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9562, "q0": "For providing an understandable rationale in what the impact benefit would be of this proposal, I rank this section a 4. For a $180k proposal, there is not enough information here to assure voters of the quantifiable impact that makes this proposal worth that much. Since funding for round 9 would start being distributed just before CNFTcon on Oct 8th-9th, there is not a great possibility that this proposal would attempt another Catalyst proposal for the 2022 event. If I were to suggest improvements for future proposals, I would suggest putting a lot more work into providing market research into quantifying the impact based on modeling evidence from other events of a similar nature, impact of previous year’s events, and a disclosure of how many people have purchased tickets for this event. I vote positively because there are very few Cardano based events in the status quo, so the project behind this proposal is unique in this space. Still, voters will be deciding based on what this proposal tangibly proves will come out from it. ", "q0r": 4, "q1": "I rank this section a neutral 3 because, while this proposal cites involvement with previously successful events, this section does not provide enough detail to assure voters that $180k of requested funds are being efficiently spent for a worthwhile ROI. While I’m grateful that we got some information on relevant experience with event organizing for these team members, I would’ve liked to see more detail on professional/work experience. At the very least, I wanted to see links to LinkedIn profiles for background information (if voters should feel the need to access that information). Then, while the roadmap makes sense, I don’t think there’s enough information here to demonstrate that there is a thorough plan to successfully carryout this kickoff party. I think voters could benefit from a timeframe for each task and a link to this “event production company” to get a better understanding of their services. Copy & Pasting the roadmap to the budget breakdown is not necessary. I think this proposal warrants a further breakdown of the budget as well. While it may be entirely possible that all labor and resources are to be outsourced from other companies, voters want to know why this money is worth what it is being spent on. A further breakdown of the budget alone would have bumped this section up from a 3 to a 4. With what we’re given, I’m left with a bit of uncertainty. ", "q1r": 3, "q2": "I rank this section a 3 because “success” for this type of proposal should be relatively simple but this proposal does not do the extra work for readers to clearly target success. It’s pretty clear throughout the proposal that the aim is increased social media activity for awareness and interest purposes. This section is an opportunity for the proposer to show exactly what they would like to see so that voters know that there is a clear target for success. Especially since this is the whole point of the proposal, these metrics are what is going to determine if approving this proposal would be a waste of Catalyst funding (that could fund up to 6 average costing proposals) or if the aim is worth it. The best catalyst proposals clearly define target numbers for their KPIs and the subjectivity of social media demands further definition to understand. I think this section of the proposal lists the right categories for KPIs to pay attention to, they just needed to further define what is intended. ", "q2r": 3, "assessor": "z_assessor_3063", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Our solution is to make the CNFT Con KickOff Party on Friday a BLAST in Las Vegas by using Catalyst to help us fund the audio and visual production to a professional level.", "experience": "My relevant experience is a Event's Coordinator for the US Embassy and countless music festivals and events in Japan, Miami, Austin, New York and Houston. We threw the biggest Cardano Community Afterparty at Consensus Austin and at NFT NYC 2022."}