{"id": 382500, "author": "pia.c.andrews", "title": "Regulation/legislation as code repo", "url": "https://cardano.ideascale.com/a/dtd/382500-48088", "category": 26249, "amount": 90000, "description": "Atualmente, o acesso aberto às regras não é universal. Acreditamos que isto impede a construção de uma nação democrática, a transparência do governo e o acesso à justiça.", "funded": 1, "upvotes": 55815538, "downvotes": 25435893, "votes_result": 30379645, "votes_cast": 164, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "A declaração de solução é sensata à luz da declaração do problema e ambas estão claramente escritas. O desafio procura acelerar o desenvolvimento de dApps que \"cobrem soluções de registros fundacionais\", com ênfase no armazenamento/recuperação de registros vitais na cadeia de bloqueios. A aplicação de código aberto proposta não é uma aplicação descentralizada em si, mas é projetada para extrair dados legais e regulamentares de uma cadeia de bloqueio (ou seja, \"legislação como código\") e determinar a conformidade regulamentar ou a elegibilidade do usuário. Como economista de desenvolvimento, concordo que existe uma necessidade muito real de tais sistemas globalmente, pois eles acelerariam o acesso a serviços críticos e atenuariam o impacto da corrupção (especialmente em nações em desenvolvimento). Tais sistemas também podem ser usados para alavancar o valor dos registros de propriedade porque as regulamentações de zoneamento/construção poderiam ser aplicadas contra parcelas de terra específicas armazenadas em uma cadeia de bloqueio. Minha principal preocupação é o tamanho do orçamento da proposta em relação à alocação total de fundos para este desafio ($90.000 dos $600.000 disponíveis). Dito isto, a divisão do projeto em duas fases distintas (desenvolvimento do MVP e testes subseqüentes) pode não ser viável. De modo geral, concordo plenamente que esta proposta trata efetivamente do desafio.", "q0r": 5, "q1": "A equipe é bastante ampla e os membros possuem vasta experiência nas áreas de direito, regulamentos, padrões governamentais abertos e desenvolvimento de software. O plano fornecido pela equipe é muito detalhado e claro, e dada minha experiência trabalhando com várias startups, o orçamento (embora grande) parece razoável dado o tempo e outros recursos necessários para completar este projeto com sucesso. Teria sido bom se a equipe tivesse fornecido uma estimativa do total de horas necessárias para completar as duas fases do projeto (junto com a taxa de pagamento por hora implícita), mas dado o escopo do trabalho envolvido, isso seria compreensivelmente difícil de estimar com precisão. Em geral, é altamente provável que esta equipe desenvolva com sucesso os resultados propostos para o projeto.", "q1r": 5, "q2": "Os resultados propostos são muito claros, assim como os KPIs fornecidos pela equipe. A equipe não trata de riscos potenciais, mas dada a construção prévia do banco de dados legal da Nova Zelândia e a experiência da equipe trabalhando com esses dados e o projeto BetterRules, é improvável que não se consiga entregar um produto que funcione. Dito isto, há maior incerteza quanto à realização dos KPIs, para os quais os riscos de desvantagem não são tratados. Em geral, concordo que esta proposta fornece informações suficientes para avaliar seu progresso.", "q2r": 4, "assessor": "z_assessor_914", "no_vca": 21, "ne": 14, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of lack of open access to government regulations and legislation by coding government rules into an open platform which partially aligns with the challenge goals but is not a foundational registry solution listed in the challenge.   \r\nThe proposal does a good job of articulating the value to Cardano ecosystem, and articulating how the solution scales to address future challenges.\r\nThe proposal could be improved by providing key metrics and goals that closely align with the challenge, and either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.\r\n", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of team composition, budget is broken down and reasonable (more detail would improve), realistic timetable and plan, and detailed technical explanation of the solution.\r\n\r\nThe proposal's feasibility could be improved by evidence of experience (twitter accounts and proposal blurbs are insufficient), and a challenges and risks section.\r\n", "q1r": 4, "q2": "The proposal includes a roadmap, milestones, time horizon (very rough), a clear understandable description of the targeted problem and a detailed description of the solution that addresses the problem.\r\nTo improve the proposal include metrics/KPIs to measure proposal success.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is precisely the kind of thing we need, not just on Cardano but in this whole space. The more public goods, the better. Making regulation and legislation clear to those that wish to integrate their Dapps into the world and making the rules clear and open for all is a must-have to take advantage of our existing legal systems. ", "q0r": 5, "q1": "The team has in-depth experience and understanding of the problem and current systems we have in place; with that in mind, I have high confidence that we will see this implemented successfully.", "q1r": 5, "q2": "There is a clear description of the problem and solution here with identifiable measures of success based on the milestones. Key performance indicator's and what needs to be done is laid out clearly and on understandable grounds.", "q2r": 5, "assessor": "z_assessor_903", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}], "solution": "Uma plataforma de código aberto gerenciada pela comunidade para leg/reg como código para qualquer pessoa contribuir e construir sobre + uma ferramenta de elegibilidade legal para ajudar a ppl.", "experience": "Uma equipe de 8 pessoas com mais de 5 anos de experiência com regras como código, design, dev, plataformas gov, leg/reg & práticas interculturais"}