{"id": 382622, "author": "cooton", "title": "Informal sector asset tracker", "url": "https://cardano.ideascale.com/a/dtd/382622-48088", "category": 26249, "amount": 85000, "description": "Os agricultores de subsistência e os operadores do setor informal precisam de prova de transferência de bens ou mercadorias e posterior prova de propriedade de bens (PoAO)", "funded": 0, "upvotes": 23471265, "downvotes": 23818994, "votes_result": 347729, "votes_cast": 97, "f6_no_assessments": 4, "f6_rating": 2.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal seeks to solve the problem of proving assets or goods are transferred and owned in informal sectors by an informal sector asset tracker dApp which partially aligns with the challenge goals but is not a foundational registry solution listed in the challenge. Note the solution is potentially similar to a foundational property registration (depending upon interpretation) however the proposed solution is for personal use instead of government adoption and the property referred to in the challenge presumably means land property.\r\nThe proposal could be improved by articulating the value to Cardano ecosystem, articulating how the solution scales to address future challenges, providing key metrics and goals that more closely align with the challenge and either selecting another challenge (dApps and Integrations) or more closely aligning with this challenge's goals.", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of evidence of experience (linkedin profile). \r\nThe proposal's feasibility could be improved by including team composition, budget is broken down and reasonable (not enough details to determine), realistic timetable and plan, resources required, detailed technical explanation of the solution and a challenges and risks section.\r\n", "q1r": 2, "q2": "The proposal includes a clear understandable description of the targeted problem\r\nTo improve the proposal include a roadmap, milestones, time horizon, metrics/KPIs to measure proposal success and a more detailed description of the solution that addresses the problem.\r\n", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 21, "ne": 3, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "The proposal is addressing a core problem of the informal sector that is a poof of ownership of the physical asset and transfer of value. There is a need to drive the adoption of this system, to realize the intended effect. However, I believe that this dApp is addressing the challenge really well. ", "q0r": 5, "q1": "The proposer has extensive and almost 30 years of experience in management. He should be capable enough of putting together a team that can produce this dApp. The proposal is practical and based on the idea presented as workable. There are bound to have implementation roadblocks however all national building dApps will have this issue and the community should be ready to invest in these innovative endovenous. We should be also satisfied with the ability to get such experienced people to propose such innovative solutions.  ", "q1r": 5, "q2": "The proposal has brought the user story in a clear manner. The dApp is envisaged to have applications in many scenarios. Technical details need to be evolved. However, based on the initial analysis it looks as if the tasks are measurable and there is a need to have a deep study to be out a clear task list. To expect solid project reports for nation Building dApps will be counterproductive to the challenge. With this perspective, I believe this project is auditable. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 19, "ne": 3, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "This proposal focuses on PoAO for farmers by developing a phone, Dapp. This idea is great and very useful in the agricultural sector nowadays. but it seems that this proposal is incomplete. The idea is understandable, however, developing a dapp requires more in detail. Theoretically, I think it has a certain fit for the challenge and the argicultural sector [especially in africa]. In case this proposal needs to be completed in the future, the proposer should pay attention to (1) Hardware requirements for farmers; and (2) Software that is easy to use for farmers. Based on the given information, I can not agree with this proposal's impact and would give it a score of 2.", "q0r": 2, "q1": "I am convinced by the idea description, proposer's profile [for certain aspects] but not convinced by the plan [because it is empty]. It's difficult to evaluate how feasible an incomplete proposal would be. Therefore, definitely, based on the given information, I disagree with this proposal's feasibility and would give it a score of 2.", "q1r": 2, "q2": "Since this proposal is incomplete, auditability can not be guaranteed. Therefore, I don't have much advice, except that: the proposer needs to pay attention to the principle: judgment, information must be correctly associated with evidence and documents. As a result, I strongly disagree with this proposal's auditability and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "If the proposal is successful, this solution would represent a blockchain solution of a fundamental activity, that goes toward property rights and recording value. ", "q0r": 4, "q1": "There is not a detailed roadmap, milestones or KPI to measure progression twoard. It is unclear the professional or personal skill the proposer brings to bear on this project. It is entirely unclear how asset value will be determined and that is the fundamental valued activity of the proposed solution. ", "q1r": 2, "q2": "The proposal does not contain a measurable description of success, therefore the information is not sufficient to audit success or progress toward it. ", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "Um telefone Dapp usando uma imagem fotográfica do item com valor associado.  Transferência de ativos telefone a telefone com opção para PoAO em uma cadeia de bloqueios.", "experience": "Empresário aposentado tendo vivido 46 anos na África Austral até 2001 e depois na Austrália.\nwww.linkedin.com/in/rhett-hook-34607331"}