{"id": 384579, "author": "chila.kasonde", "title": "Digital Document Signatures", "url": "https://cardano.ideascale.com/a/dtd/384579-48088", "category": 26249, "amount": 150000, "description": "Vivemos em um mundo onde a falta de integridade digital é um problema crescente com documentos digitais que são facilmente adulterados.", "funded": 0, "upvotes": 18339487, "downvotes": 26759747, "votes_result": 8420260, "votes_cast": 123, "f6_no_assessments": 6, "f6_rating": 1.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is for a digital document signature solution that does not fall within the scope of the challenge which is, \"Dapp proposals should cover foundational Registry solutions, namely:\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"\r\n\r\nThe proposal adds value to the Cardano ecosystem, in the form of increased number of users.\r\n\r\nThe goals of the project are defined but do not align with the challenge, specifically targeting Learning Institutions instead of governments. There are no key metrics defining success.\r\n\r\nHow scalability will be achieved is not addressed in the proposal.\r\n\r\nTo improve the proposal: select a more appropriate challenge (Dapps & Integrations), ensure goals align with the challenge, include key metrics of success, address how the solution scales in the proposal.", "q0r": 2, "q1": "The proposer does not provide evidence of relevant skills and experience needed to implement the proposal.\r\nThe proposer does not identify the type and number of team members required to implement the proposal.\r\nThe budget is not clearly broken down into identifiable items. \r\nThe budget seems high to achieve the set goals however impossible to determine without a budget breakdown.\r\nThe proposal has no timetable to complete the work.\r\nThe proposal does not explain technical aspects of the implementation.\r\nThe proposal does not include challenges and risks relevant to a successful implementation.\r\nTo improve the proposal: provide specific evidence of relevant experience needed to implement the proposal or partner with developer(s) who can demonstrate the experience in the proposal, identify team members with skill sets required, breakdown the budget request, include a timetable, explain technical aspects of solution, include a challenges and risks section.", "q1r": 2, "q2": "The proposal does not include a roadmap with milestones and a time horizon for achievement. \r\nThe proposal does not provide metrics/KPIs that define the success of the proposal. \r\nThe proposal provides a clear understandable description of the targeted problem.\r\nThe proposal provides a vague but understandable solution that addresses the problem.\r\nTo improve the proposal: include a roadmap, include metrics/KPIs for success, provide more detail about the solution", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The proposal seems to match the challenge problem. You need to describe more how cardano will be implemented in your solution. I think you also have to:\r\n•\tdescribe more how your solution can be technicaly develop\r\n•\twhich type of governments entities you can onboard and also what major learning institution can help you (and how you can seduce them)\r\n•\thow you will market your solution to be known by governments entities and learning institutions\r\n", "q0r": 2, "q1": "Your solution need to be more specific in describing\r\n•\tthe team needed (experience, number of people, cost etc…) that will work on it. I understand that you want partner with learning institutions but how you will seduce them, how will you pay them? What type of learning institutions do you want to deal with?\r\n•\tThe description of the budget and what it will use for…\r\n•\tA planning of the development of your project with key milestone\r\n•\tThe technical description of your solution\r\n", "q1r": 1, "q2": "I understand that if in the first 7 months 3 majors learning institutions joined you, you consider as successful your project. I think you need to had other KPI as number of users, number of documents used ….", "q2r": 2, "assessor": "z_assessor_602", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "I like this idea! The proposal points out the problem and offers an excellent solution. If this idea were realized, it would have a positive impact on people and the Cardano ecosystem. The proposal does not provide information on how this idea will add value to the Cardano ecosystem. Proposer omits KPIs so it's hard to compare KPIs with challenge setting and proposal is not able to scale and address future challenges.", "q0r": 3, "q1": "The proposal does not present the team and who is behind this idea, nor does it present the knowledge, skills and experience needed to realize this idea. Maybe to present the team via LinkIn or a website would be great. We do not have a clear insight into the number of people in the team. The budget is outlined clearly but it is not specified how the money will be distributed. The requested amount is not realistically presented. Unfortunately proposer does not provide a detailed implementable plan or details of actionable tasks and order of execution and the offer a realistic timetable to complete the work has been left out. We have no information on possible risks and resources needed nor information on technical aspect needed to realize this idea.", "q1r": 1, "q2": "Certainly the proposal which has (roadmap with milestones and KPIs + time frame in which the work would be completed) would have a much greater possibility of obtaining funds. The community cannot monitor the progress of this proposal.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 20, "ne": 3, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is about creating an easy-to-use Dapp where users can upload any pdf document and attach a digital signature that will be verifiable. It seems that this proposal is incomplete [lack of a lot of information]. However, I am convinced by this idea, not the plan. In theory, I think it has a certain fit for the challenge, and has a satisfactory and has potential impact if completed. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1.", "q0r": 1, "q1": " It is hard to assess an incomplete proposal [with limited team information, no roadmap or KPIs, and of course the risk is not defined]. Therefore, I strongly disagree with this proposal's feasibility, and would give it a score of 1.", "q1r": 1, "q2": "For better auditability, (1) the proposer's profile [described as \"6-year software developer, Introduction Cryptocurrencies Certificate , Computer Science Degree\"] should be explained in detail with a link for the verification; (2) Road map with measurable KPIs should be added; (3) Risk management should be provided. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 19, "ne": 1, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "It is a proposal that deals with an interesting topic about the signing of digital documents, however, a problem is not identified within the challenge. It is not known what the part would be in the framework of nation-building. In this way, the proposal does not identify how to add value to the cardano ecosystem, because although it can be useful in the framework of the signing of smart contracts, the development of the proposal does not allow inferring it. No metrics are identified and the objectives are not aligned with the described challenge setup. What core Dapp solutions can be provided for widespread governments adoption in the developing world?", "q0r": 1, "q1": "It is unlikely that this interesting proposal will be implemented successfully, unless it is reformulated and provides evidence that allows you to identify, for example, the team with which you will work. Likewise, the budget does not have any development, which does not allow the reader to determine its reasonableness. Likewise, there is an absence of the calendar, given that some times linked to the possible identification of institutions are worked, without clarity. Single objectives are mentioned but without any support.", "q1r": 1, "q2": "There is no clear roadmap or horizon for achievement. In this way, the proposal in its current state must work on its essential contents.", "q2r": 1, "assessor": "z_assessor_778", "no_vca": 16, "ne": 0, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "Currently, there are many dapps that do the storage of personal documents to the blockchain. I don't see this proposal as anything special compared to similar dapps I know of. Also, I don't see the proposer pointing out how these dapps will be national and help the governments of poor countries.", "q0r": 1, "q1": "The proposer did not provide any evidence to prove their capacity and experience to implement the proposal. The proposal also does not provide a roadmap or specific numerical goals. In addition, the amount of requested funds is too large for the implementation of a proposal and its impact is very low. I assess this proposal as unfeasible.", "q1r": 1, "q2": "There is no roadmap, specific numerical goals or\r\n requested fund breakdown. Can not audit", "q2r": 1, "assessor": "z_assessor_783", "no_vca": 19, "ne": 1, "ng": 12, "nfo": 6, "vca_o": 1}], "solution": "Pretendemos criar um Dapp fácil de usar onde os usuários podem carregar qualquer documento pdf e anexar uma assinatura digital que será verificável.", "experience": "Sou desenvolvedor de software há 6 anos, Introdução Certificado de Criptocurrência, Licenciatura em Ciência da Computação"}