{"id": 384773, "author": "dcspark", "title": "Nation-ready scalability research", "url": "https://cardano.ideascale.com/a/dtd/384773-48088", "category": 26249, "amount": 75000, "description": "Para que as nações adotem a cadeia de bloqueio, precisamos alcançar a escalabilidade em escala nacional", "funded": 2, "upvotes": 179605121, "downvotes": 15430995, "votes_result": 164174126, "votes_cast": 360, "f6_no_assessments": 6, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Eu sou a favor de soluções oportunas para grandes problemas. O Catalyst tem tido muitos projetos e soluções pequenas e fragmentadas - mas também precisamos de algumas soluções de longo prazo para grandes problemas que estão se aproximando no horizonte. A questão da escalabilidade está no desafio chave da cadeia de bloqueio e a equipe do dcSpark tem espalhado a mensagem de forma consistente e clara sobre os desafios que estão surgindo para a cadeia de bloqueio Cardano, em termos do número de transcauções que a cadeia de bloqueio pode processar. Estamos nos aproximando dos limites atuais (é claro, os ajustes de parâmetros podem melhorar isso temporariamente) - no entanto, a adoção nacional significa que não há possibilidade de colocar nações inteiras em \"espera\" até que encontremos soluções que abordem um número muito maior de transações. Vejo esta proposta como totalmente alinhada com o desafio Dapps de construção da nação, pois as soluções Dapp não podem funcionar sem uma rede que possa apoiá-las. Uma rede que possa escalar para um número muito maior de trnasações permitirá automaticamente o desenvolvimento suave e desimpedido de múltiplas Dapps que levará a um aumento no número de usuários Dapp, contas de registro, volumes de transações. Alguém pode olhar para o desafio e questionar se esta proposta se encaixa. Eu não - como temos que ver a floresta para as árvores. Não há mundo em que possamos desenvolver 100 novas Dapps para as nações, mas a cadeia de bloqueio subjacente não é capaz de processar essas transações de modo smotthly. Como dizem os proponentes: Para que as nações adotem a cadeia de bloqueio, precisamos alcançar a escalabilidade em escala nacional. Isto é o que esta proposta quer oferecer através da solução de escalabilidade proposta chamada \"rollups ingênuos\" ou às vezes chamados de \"rollups preguiçosos\". A Hydra ainda está a algum tempo e não será capaz de lidar sozinha com toda a questão da escalabilidade. Além disso, uma nova solução de escalabilidade ajudará na descentralização da pesquisa fundamental necessária para o ecossistema Cardano. Vejo esta proposta como uma solução win-win-win para o sistema.\r\n", "q0r": 5, "q1": "Penso que a equipe do dcSpark poderia se beneficiar de seguir mais de perto as instruções precisas para a apresentação de propostas em Ideascale. Pode ser uma dor no pescoço, mas a atenção aos detalhes é a marca de um bom trabalho. Os desafios exigem uma definição de sucesso após 3, 6 e 12 meses, e eu não vejo isso nesta proposta. Talvez a equipe pudesse ter incluído como resultados uma atualização mensal (post no blog, atualização em vídeo, etc... ) sobre como a pesquisa está indo. A idéia é ótima e eu gosto que os resultados tenham sido definidos (1). Viabilidade dos rollups em cadeias baseadas em UTXO (Cardano) e cadeias de estilo contábil (como o sidechain de Cardano chamado Milkomeda)). Entretanto, parece-me que mais algum esforço poderia ter sido feito para manter a comunidade atualizada sobre a pesquisa e os resultados - à medida que a pesquisa avança. Acho que toda a comunidade está entusiasmada com os avanços da escalabilidade e o dcSpark - se necessário - poderia até mesmo aumentar o orçamento para incluir uma pessoa de marketing para vídeos regulares planejados sobre os resultados ... à medida que a pesquisa avança. Na situação atual, o orçamento não está claramente delineado e não está dividido em itens identificáveis (essas são as regras Catalyst para AC). De qualquer forma, a inclusão do vídeo do Youtube na proposta Ideascale é surpreendente e as credenciais da equipe do dcSpark são estelares e suas contribuições para Cardano - durante seus dias de Emurgo e pós-Emurgo têm sido claras e singelas. Penso que a viabilidade da pesquisa é inquestionável, graças às credenciais da equipe. A equipe declarou: \"Acreditamos que os rollups também podem fazer parte da estratégia de escala de Cardano\". Eu preferiria declarações que utilizassem a palavra \"acreditar\" - para serem mais bem fundamentadas com mais análise do \"por quê?\". Minha pergunta é - e se os resultados mostrarem que não podem ser utilizados - teremos uma estratégia alternativa? De qualquer forma, no balanço de tudo, especialmente a competência da equipe, eu avalio que a proposta é de fato extremamente provável que seja implementada com sucesso.", "q1r": 4, "q2": "Como esta é uma proposta baseada em pesquisa, seus produtos são claramente um produto completamente diferente da construção de um website. Os resultados precisos são sempre menos visíveis antes do início do trabalho e a equipe declarou cuidadosamente que acredita que os dois resultados serão uma análise mais rigorosa dos rollups ingênuos e a viabilidade dos rollups em cadeias baseadas em UTXO (Cardano) e cadeias de estilo contábil (como a cadeia lateral de Cardano chamada Milkomeda). Estas são grandes contribuições e não há muitas equipes envolvidas neste tipo de pesquisa aprofundada com conseqüências práticas para Cardano. A equipe - no vídeo anexo - e outros vídeos que podem ser vistos no Youtube pela equipe do dcSpark - mostra que seu entendimento sobre estas questões é realmente profundo. Portanto, penso que seria mais fácil para o dcSpark considerar incluir em seu trabalho algo na linha das atualizações do Roadmap Cardano - para todas as suas propostas [https://roadmap.cardano.org/en/status-updates/] Se o dcSpark já está trabalhando em contribuições importantes, então os marcos que ajudarão a auditabilidade poderiam tomar a forma de atualizações regulares (mensais) sobre o que está acontecendo em cada ramo do trabalho. Sem isso, a auditabilidade de uma proposta pode sofrer e as pessoas de fora não conseguem obter nenhuma visão significativa sobre o que está acontecendo até um dia (seis meses depois?) o dcSpark reaparece repentinamente e nos conta o que aconteceu. O proponente afirma que \"acreditamos que podemos ter estes resultados disponíveis na primeira metade de 2022\". Para o Catalyst, este é o mínimo necessário - então tente incorporar mais atualizações/relatórios obrigatórios ao longo do caminho que ajudarão a pontuação de todas as suas propostas (se elas merecerem, é claro). O dcSpark Roadmap atualiza mensalmente qualquer um? Já vi propostas de outras equipes líderes que também contribuem de primeira linha para o ecossistema, mas elas incluem passos detalhados, cronogramas mensais, uma discriminação das exigências orçamentárias, incluindo elementos como, por exemplo: \"Número mínimo estimado de dias-pessoa\" \"Número máximo estimado de dias-pessoa\", assim como taxas e variáveis que influenciam o orçamento e a distribuição da carga de trabalho - e, portanto, a capacidade de auditar o trabalho. O progresso da auditoria, tal como está, será relativamente difícil - embora este seja um tipo diferente de projeto.  Ainda assim, é possível ser criativo mesmo neste tipo de cenário com atualizações regulares. Por favor, inclua mais informações sobre marcos em seu trabalho no futuro, para facilitar o monitoramento.", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 17, "ne": 10, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "A great proposal worth investing for Cardano ecosystem as a whole! One key property that differentiates rollup from Hydra is that rollup does not require trust on the parties that runs it, while Hydra does. This is due to the fact that rollup will write data sufficient to verify computations happened in rollup back to L1, while Hydra does not. This trustless property of rollup brings more possibilities for large scale use cases. For the case of nation-wide applications, any third party can run L2 rollup without acquiring any trust from the nations. The trustlessness and scalability of rollup is going to be a strong reason for nations to adopt blockchain technology.", "q0r": 5, "q1": "DcSpark has demonstrated its experience and ability to deliver high quality product. Besides being the former employers of Emurgo and IOG, they recently launched Milkomeda testnet and Flint wallet which seamlessly connects the EVM side-chain with Cardano. I have no doubt in the team's ability to deliver fruitful research results for this proposal.", "q1r": 5, "q2": "As stated in the proposal, the deliverable is a writeup of analysis on rollup for Cardano in terms of feasibility. This should be fairly straightforward to audit, although I would argue that some quantitative measurements will make it more auditable. For example, providing what exactly will be presented in the analysis (e.g. list pros and cons of rollup, works need to be done). Regardless, research is ambiguous in its nature. Therefore, I don't think lack of quantitative measurements is a big issue overall.", "q2r": 4, "assessor": "z_assessor_315", "no_vca": 20, "ne": 6, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is for a scalability solution that does not fall within the scope of the challenge which explicitly calls for \"Dapp proposals should cover foundational Registry solutions, namely:\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"\r\n\r\nThe proposal adds value to the Cardano ecosystem, in the form of increased scalability.\r\n\r\nThe goals of the project are defined but do not align with the challenge. There are no key metrics defining success.\r\n\r\nHow scalability will be achieved is addressed in the proposal.\r\n\r\nTo improve the proposal: choose an appropriate Challenge (Miscellaneous), ensure goals align with the challenge, provide key metrics for success.", "q0r": 2, "q1": "The proposer relies on reputation to provide evidence of relevant skills and experience needed to implement the proposal, which is not ideal given new CAs and voters may not be aware of them.\r\nThe proposer does not identify the type and number of team members required to implement the proposal.\r\nThe budget is not clearly broken down into identifiable items. \r\nThe budget seems reasonable to achieve the set goals.\r\nThe proposal has no timetable to complete the work other than a nebulous \"first half of 2022\".\r\nThe proposal does explain technical aspects of the implementation.\r\nThe proposal does not include challenges and risks relevant to a successful implementation.\r\nTo improve the proposal: provide specific evidence of experience instead of presumed name recognition, identify the team and skill sets required to implement the proposal, breakdown the budget into specific items, provide a timetable, include a challenges and risks section", "q1r": 3, "q2": "The proposal does not include a roadmap with milestones and a time horizon for achievement. \r\nThe proposal does not provide metrics/KPIs that define the success of the proposal. \r\nThe proposal provides a clear understandable description of the targeted problem.\r\nThe proposal provides a clear understandable solution that addresses the problem.\r\nTo improve the proposal: include a roadmap with milestones and a time horizon for achievement, provide metrics/KPIs that measure progress", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 18, "ne": 6, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "While it is not a direct and immediate attempt at building a dApp on a national level, the impact of research on scaling is undoubtable and dcSpark team is positioned very well to execute on that research.", "q0r": 4, "q1": "The team is highly experienced and well known in the community. However, no clear timeline and milestones are set in the proposal and budget is set as an arbitrary number not really explaining how it will be used. I am pretty sure that the team is capable of providing these basic information and I would love to give them 5 stars if these information was here. For example: by the end of Q1 we will publish X scientific papers, we will put X people full time on the job for that, pay them X amount of money. ", "q1r": 3, "q2": "Unfortunately, no budget breakdown or real metrics were proposed that can be used for auditing the proposal. Team is extremely professional and they have a wonderful track record in and around Cardano and I can not understand why this information was not provided.", "q2r": 2, "assessor": "z_assessor_65", "no_vca": 16, "ne": 0, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "I found the solution to be too general and not specifically focused on any particular problem. We all understand that in order to scale up blockchain, we have to make it applicable so that countries can see the benefits it brings. Your ideas are very good but nothing is expressed clearly. In addition, we should take specific actions to make Cardano's ecosystem highly influential", "q0r": 2, "q1": "I need to see your team's profile. Besides working at Emurgo, IOHK, what is your position? What have you experienced or done? I have not seen how long your rollups plan will last and what specific time period. What are detailed project KPIs? And how long will it take you to achieve the KPI?", "q1r": 1, "q2": "For the $75000 request, how would you guys allocate this money to the project? If it is only for research, it can be highly effective in a short period of time. Or you will use this money to build a large community. From there this community will be able to rollups. And how can the community know that you are using $75k effectively?", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The problem state of achieving scalability at a nation scale I believe is very relevant considering we are only weeks/months away from a massive spike in L1 usage on Cardano due to dapps being released. It fits the challenge of building \"nation dapps\" very well. By researching rollups in this case \"lazy rollups\" we are providing an alternate route besides \"hydra\"- the main scaling solution being built on Cardano today. Although Hydra is promising, it will not be relevant for all dapps and by diversifying research into multiple scaling solutions we are not putting all our eggs into one basket as to speak. I feel this research has the potential to bring great benefit to multiple aspects of the Cardano ecosystem.", "q0r": 5, "q1": "The team at dcSpark is well known in the community and is made up of ex Emurgo and IOHK employees. Taking this into account I believe that there is a high likelihood of a positive outcome when considering the impact this research on rollups could have on Cardano. Although there is no information currently on how this area of research will be conducted eg)- how many people will be researching and a breakdown of how the funds will be distributed. There is also a rough idea of when the research is expected to bear results, but a more detailed roadmap would be ideal in giving the community a more concrete idea of when to expect results.\r\nThe budget of 75k seems extremely reasonable considering \"Polygon\" a Ethereum sidechain solution just acquired a start-up company specializing in rollups for $400m.  ", "q1r": 3, "q2": "Currently there is no real detailed roadmap or KPI's to speak of, I feel that if this proposal had these it would be an excellent all-round proposal. With the above mentioned it is also very hard for the community to track/audit the progress other than the dcSpark social accounts. ", "q2r": 2, "assessor": "z_assessor_858", "no_vca": 14, "ne": 5, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Realizaremos uma nova pesquisa sobre uma solução de escalabilidade chamada \"rollups ingênuos\" ou às vezes chamados de \"rollups preguiçosos\".", "experience": "Nossa equipe é composta por ex-emergüenses e ex-funcionários conhecidos que vêm construindo o ecossistema Cardano há vários anos"}