{"id": 383421, "author": "jtrube", "title": "Tokyo Cardano Summit", "url": "https://cardano.ideascale.com/a/dtd/383421-48088", "category": 26238, "amount": 25000, "description": "日本では、暗号やブロックチェーン技術への関心が高まっていますが、多くの人はまだ積極的に投資したり、どのコミュニティにも参加していません。", "funded": 2, "upvotes": 141788746, "downvotes": 5284717, "votes_result": 136504029, "votes_cast": 535, "f6_no_assessments": 11, "f6_rating": 3.575757575757576, "videos": [], "media": [], "f6_assessments": [{"q0": "今回の提案は、チャレンジの目的に直結していると思います。オンラインフェアを通じて、暗号の世界についての情報を、勝利と教育の形で提供します。すでにビジュアル・アイデンティティを伴ったアイデアを持ってきているのがとてもよかったです。ターゲットは、これらの事柄についてすでに何か聞いたことがあるが、十分な説明を受けていない日本人で、これらの技術を信頼し、そのためにCardanoを採用したり、Catalystのようなプロジェクトに積極的に参加したりするところまでを想定しています。この提案の著者は、自分の主張を証明するためにいくつかの調査を行っており、非常に好感が持てました。つまり、このようなキャンペーンを推進するためには、ブロックチェーンや暗号の「種」がすでに日本に植えられており（例えば、一部の商人や企業がすでに技術として採用している）、あとはこの波を推進する必要があると願っているのです。実際、日本は技術的に突出している国であり、そこで我々の暗号通貨やブロックチェーンの導入が習慣化されれば、カルダノは指数関数的に成長し、その上で今回の提案はうまく機能します。つまり、この提案がもたらすインパクトについては、非常にポジティブなものであることは間違いなく、このチャレンジが求めるものと完全に一致しています。資金面では、今回のチャレンジに割り当てられた資金の半分を1つの提案に求めるのは、著者にとって複雑です。残念ながら、この提案は、アイデア自体は素晴らしく、可能性のある結果がこの課題に期待されるものであるにもかかわらず、資金調達が非常に難しいものとなっています。もしこの値が再調整されれば、より適したものになるでしょう。", "q0r": 3, "q1": "このチームは、関連性のある興味深い経歴を持つ二人組ですが、彼らがこのプロジェクトを率いる準備ができているかどうかはわかりません。彼らの説明には、カルダノの世界との何らかのつながりが示されていませんでした。彼らは、自分たちが何者であるかについての短い説明（この説明はもっと詳しくてもいいと思います）と、すでにいくつかの仕事を紹介しているウェブサイト、そして彼らが手がけたいくつかのブランドの例を提供してくれています。このプロジェクトを実行するためのステップバイステップの手順については、非常に表面的なものだと感じました。3ヶ月後、6ヶ月後、12ヶ月後に何が起こるのかという情報はほとんどなく、どのようなプロセスになるのかというアイデアを得ることはできましたが、詳細がなければ到達できないような深い理解は得られませんでした。また、お金の分け方も比較的表面的なもので、総額をいくつかに分けていますが、「プロジェクトマネジメント」というテーマだけはしっかりと説明されています。今回の提案テーマでは、残念ながらいくつかの点で不満が残ったと思います。暗号の世界、特に私たちのブロックチェーンとの関係を明確にし、スクリプトの部分とお金の分割の部分の両方で、より詳細な説明をしてほしかったと思います。", "q1r": 2, "q2": "この提案の監査可能性は不十分である。このプロジェクトの進捗状況を監視するために著者が提供するものは、イベントの参加者数/視聴者数だけでしょう。しかし、さらに踏み込むことが必要です。東京に住んでいるコミュニティのメンバーがいて、その人がフェアに参加して、どうなったかのレポートを作成して、後でコミュニティに発表することを提案します。著者自身も、イベント参加者と何らかのつながりを持ち、イベント後に彼らがどのようにして暗号コミュニティに関わるようになったのかを理解することができる。このプロジェクトが、彼らの興味や好奇心を喚起し、これらの技術について勉強したり、暗号に投資したり、NFTの使用を採用したり、Catalystに参加したりしたかどうか。著者は、グラフィックデザインの部分ですでに多くの熟練した技術を示しているので、プロジェクトの目標が達成されたかどうかを理解するのに役立つ情報を伝えるインフォグラフィックを作成することもできると思います。このプロジェクトは非常に高価な提案であり、正確かつ頻繁にモニターされることの緊急性をさらに強めていると思います。", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 22, "ne": 14, "ng": 6, "nfo": 2, "vca_o": 2}, {"q0": "これは、将来のための必須の提案です。提案者はカルダノをすべての栄光の中に展示したいと考えていますが、私たちはまだその準備ができていません。この提案が将来のためのものである理由は、Cardanoから表示されるものがまだあまりないからである。Cardano上でオンラインになっているDAppsは限られており、著名なNFTコンテンツクリエーターも限られていますが、実際には成長しており、爆発を待っている鬱積したポットのようなものなのです。確かに提案者は自分でNFTを作るつもりだが、コミュニティを構築しなければ、そのNFTはただのNFTに過ぎない。そこには社会的な価値はありません。カルダノのマーケティングのためだけに作られたもので、その背後には何の道筋もありません。ただNFTを作るのではなく、カルダノのコミュニティと連携してください。ここにはアーティストがいて、語られるのを待っている美しい苦しみの物語があり、夢を実現するために日々戦っている情熱的なコミュニティがあります。この提案は、少なくとも顧客にカルダノを紹介するものではあるが、それ以外の提案者が意図していた大きな効果は得られないのではないだろうか。提案者には、どうか忍耐強く、既存の日本のカルダノコミュニティや一般的なコミュニティとのつながりを持つことを強くお勧めする。辛抱して、待って、そしてその殺人的なケジメをつけてください。あなたの時代が来ます。", "q0r": 3, "q1": "彼らのLinkedInのリンク、Instagramのソーシャルメディアの投稿、ウェブサイトの大部分を見てみると、これはCardanoエコシステムの外にいる、価値の高い、スキルの高い個人のチームであることがわかります。これは、カルダノのエコシステムがますます注目されていることを示しています。彼らは、特にYFエージェンシーなど、多くの著名なブランドと仕事をしています。Eggwormも同様に著名かもしれませんが、ソーシャルメディアの指標を見る限りでは、YF Agencyの後塵を拝しています。とはいえ、どちらの企業もしっかりとしたチームとポートフォリオを持っています。将来の提案を実現してくれると確信しています。提示された予算は明確に分割されていますが、添え書きがあるだけで、詳細なアクションプランはありません。提示された1年というタイムラインは理にかなっており、彼らが自由に使える人的資源を考えれば、論理的に実行可能である。しかし、この種のイベントを開催する際に直面するであろうリスクや課題を考慮していないのは少し意外です。おそらく、この2つの企業はターゲットとなる顧客を十分に調査していないのでしょう。IOHKのYouTubeチャンネルにあるタウンホールの大量のビデオコンテンツや、同じくIOHKのYouTubeチャンネルにあるカルダノサミットのビデオコンテンツに目を通し、Project CatalystのDiscordチャンネルに参加して、カルダノのエコシステムがどれだけ活発に活動しているかを把握することをお勧めします。繰り返しになりますが、提案者は忍耐強く、まず関係を築いてください。", "q1r": 5, "q2": "ロードマップには2つのセクションがあります。1つはイベントを段階的に分解して伝えるもので、もう1つはマイルストーンを伴う一般的な実施計画です。KPIも2つのセクションに分かれており、1つは指標がないため測定できないKPIセクションで、もう1つはロードマップに埋め込まれています。彼らの提案は、全体的にヒットアンドアウェイの繰り返しだ。強い提案書を作成して提出する方法を学ぶために、Catalyst Schoolにもアプローチすべきだと思う。忙しければ、YouTubeにアップされているCatalyst Schoolの様々なワークショップを見ることもできる。問題提起と解決策はよく考えられていて、結果的には相互によくつながっています。提案者は、コミュニティにもっと溶け込めば、提案もあなた自身もその恩恵を受けることができる。", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 22, "ne": 12, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "The team proposes to set up a virtual summit for the japanese market/ community. The proposal states that the intended audience is beginners and the summit wants to display a variety of usecases for blockchain/crypto/ Cardano and show things that are \"cool\". The term \"cany popup\" sounds interesting and this might be interesting for other projects to find out about this concept and to also use \"visually appealing\" ways to display information and maybe educational content.", "q0r": 5, "q1": "Behind this proposal is an agency that is specialized in brand-marketing. This makes it very likely, that the team will be able to set up a summit and connect it with Cardano and blockchain. However, the information provided in the proposal is lacking clarity and content. The word \"cool\" is used too often and should be substituted with examples to demonstrate that the team has a wide knowledge-base of the Cardano ecosystem and the blockchain technology. The team gives a broad overview that it intends to focus on merchandise, NFTs, but also about blockchain technology, developers and futurism. While this might be a good starting point, the team did not provide relevant information on the content of the summit at this moment. The roadmap is a good example, as the first sentence reads \"complete planning, preparation and launch within 3 months\" but it does not give any indication on what content they are planning on doing. I think, mostly, that the team has a strong marketing background and so it points towards a fun branding event that they might be planning, which could attract and onboard new users for sure. ", "q1r": 3, "q2": "The roadmap is relatively broad and does not include some necessary information about possible contributers and how to make the process transparent and auditable for the community through github or discord or statistical tools that would be able to audit the program. I´m not sure and the proposal does not mention if the team is already active in the Catalyst/ Cardano/ crypto space and has a following that would be the targeted audience for their summit, or if they have to plan for outreach and marketing from scratch which would make the intended KPIs more difficult to achieve. It would have been a good information to add to the proposal. The budget is broken down well and would be able to cover all parts of setting up a summit. ", "q2r": 4, "assessor": "z_assessor_19", "no_vca": 24, "ne": 9, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "This proposal meets the challenges very well. It clearly addresses a possible issue in the challenge. By creating a hybrid event, this establishes awareness of the Cardano ecosystem in Japan. By including talks of developers and gaming this event can address a large group of people who can mean a lot for the ecosystem.", "q0r": 4, "q1": "The proposers give some information about themselves. We know that they are the creator of Eggworm, which has a website that is included in the proposal, and a brand designer as background who is now a director. Business wises this proposal has solid team members. However, we are missing information about their other team members. I think a bit more exposure to this network was necessary. The budget breakdown is missing information. A clear breakdown is mentioned for what they need the funding for but there are no numbers and statistics given. How much do you need for the design, ART, management? These are all clear budget-consuming parts of the proposal but the proposer does not explain the amounts needed for these.", "q1r": 4, "q2": "For auditability, we are provided with the essential details. The proposers have a clear understanding of what they plan to do and how they will manage this. The roadmap gives insight into what they are going to do after funding is secured. The roadmap also gives a good baseline for follow-ups. KPI's that are offered are relevant to the proposal and critical to address after the summit is done to see if the goals are reached and where refinement is needed.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 20, "ne": 4, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "This proposal aligns with the challenge as it'll be an opportunity for people who are interested with Cardano to talk about, but also a way of attracting new one's, since interest to crypto currencies in growing in that country as mentioned by the Proposer.", "q0r": 5, "q1": "The proposal has a highly chance to be successful, sine it's focusing on promoting the crypto currencies, the blockchain, and the Cardano ecosystem in Japan through an online tools & information, but also a live event.\r\nHowever am questioning  myself about the budget amount, which is half of the challenge proposed budget. Being 11 proposals in this challenge, it may seem unreasonable to allocate half on that amount on one .\r\nAlso, I would like to see the input form current Cardano & Catalyst community members to support this proposal and take on some tasks as volunteers to reduce the budget cost.\r\nAn idea like this will really help promote the cardano. Touch on the budget may allow the vote for this proposal, and for that think on implementing this by phases on different Funding cycle. \r\n", "q1r": 5, "q2": "The community may follow the progress through what will be realized : online presence: produced, youtube video, and the live event.\r\nThe KPI and a realistic road map are presented. ", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The Tokyo cardano summit will increase exposure to Japanese community by introducing an online trade fair event suitable for beginners under the theme of Candy pop up. It fits within the challenge of connecting to Japan community well. While the pop art culture theme is very creative but to dispel the opacity of blockchain and crypto currency some other themes should be considered. The execution of the proposal should adapt to the local sentiment.", "q0r": 4, "q1": "The proposer team is very well experienced as event organizers and brand PRs (eggworms). While the number of attendees and views are good KPIs, there should be additional measures that quantify local adoption. Also the cost of equipment is a fixed cost, it would be a good idea to elaborate more in term of what they are, what is their usage in this event and the future usage for the event.", "q1r": 4, "q2": "To audit this project, more information is needed as some costs are not fully elaborated. The Japan cardano summit is a great idea for the Japanese community but the proposal needs to be delivered with clarity as it supposed to deliver the full impact and promote Cardano in Japanese perception. ", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "There is clarity in the problem description and the proposed solution. Developed and produced an online tradeshow in Japanese, showcasing the most exciting things Cardano has to offer, appealing to beginners.\r\nThe proposal is geared towards helping the Japanese community to interest and adopt Cardano. Proposals fit the challenge.", "q0r": 4, "q1": "Despite the foregoing information about the team's experience, there are no sources to attest to the team's qualifications. The team is described as having experience in various fields, but not related to Blockchain technology. In order to increase the credibility of people, I suggest that the proposal needs to provide more information to check\r\nIt would be better if the proponent thought of a list of potential risks and challenges. To increase the probability of success of this proposal.\r\nConsidering these things, I do not think this proposal will be successfully implemented, I believe it requires more work, a clearer roadmap, a more detailed budget as well as a team. Team of experienced people", "q1r": 2, "q2": "A roadmap with discrete steps is given, there is a proposal to give a roadmap with timelines of 3, 6,9 months but also general, not divided into phases.\r\nRecommendations that mention KPIs will be based on the number of attendees and the number of visitors to the events. Can be easily checked because of KPI with timeline\r\nIt is a relatively high cost and without a clear and detailed plan it is difficult to see how feasible it is. The proposal requires half of this challenge, as the budget requires quite a bit, I need to know more about how to allocate capital", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about developing and producing an online trade fair in Japanese, showcasing the coolest things Cardano has to offer, appealing to absolute beginners. This is an interesting idea. The problem is clearly described, and explained in detail. The solution is clearly defined, supporting with convincing arguments and external links. As a result, a clear impact on the Cardano ecosystem can be seen. Therefore, based on the given information, I strongly agree that this proposal effectively addresses the challenge, I can give it with a score of 5", "q0r": 5, "q1": "Team profile is fully and clearly described [in attachment] that shows suitable ability, experiences for developing and producing such an online trade fair, however, each member's profile should to be provided [be external links,...] for verifying. The budget is given with structure but without explanations of calculation base [ex: how \"Project management\" costs  $6,500,...]. Risk (and mitigation) is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal is written in a scientific way [in some aspects], at least in the way that research links are provided along the way. Team profile is fully and clearly described [in attachment] that shows suitable ability, experiences, however, each member's profile should to be provided [be external links,...] for verifying. Besides, the information provided in the attachment does not look like KPI/metric. Instead of KPIs which are specific numbers, some kind of direction is provided, the proposer should reconsider this. The budget explanations of calculation base and Risk (as well as mitigation) should be provided.\r\nTherefore, based on the given information, I can agree with this proposal's auditability, I can rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 19, "ne": 5, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to have more online trade fair in Japanese language to develop and grow their interest in crypto and blockchain technology. They want to take advantage of the increasingly positive climate in Japan, and produce a campaign of hybrid events that will inform, entertain and motivate. The challenge is well addressed.", "q0r": 4, "q1": "The team is made up of experts who are designers, developers, marketers and over 10 years event production and content creation in Japanese markets such as Google, Porche, Ralph Lauren, etc. and they are capable of implementing the proposal successfully. The plan outlined, among others, online events; talks by developers; Art and NFT exhibitions, etc. to make implementation successful.", "q1r": 4, "q2": "The road map is clear for 9 months work schedule detailed in the proposal. The budget is well broken down and comprehensive. for effective auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "As my reading, the proposal states that it aims to organize a virtual event which is a intro to Cardano and Catalyst. However, I cannot find any Cardano contents in the KPIs, roadmap, as well as in the cost. I highly recommend the team should re-consider the success of the proposal (and milestone as well), it needs to show how to add value for Cardano community more clearly, rather than (just) number of attendees the live event and number of views. For example:\r\n-\tNumber of attendees\r\n-\tNumber of feedback from attendees\r\n-\tNumber of attendees that become active community advisors\r\n-\tNumber of attendees that become proposers.\r\n-...", "q0r": 2, "q1": "The team describes clearly their experience of creation content in the Japanese market and provides link as evidence. However, I expect the team's experience and skills which engages in Cardano ecosystem for a successful Cardano event implementation.\r\nI would recommend the team should add more details about Cardano contents (in details) in the plan. \r\nBudget is outlined clearly and broken down into identifiable items. However, $25000  (=1/2 total budget of the challenge) is not reasonable since the impact of the proposal is limited.", "q1r": 2, "q2": "As the roadmap and milestone focus on the number of attendees and number of viewers, the proposal is easy to be audited. However, (again) I highly recommend the proposers should make it more 'Cardano' because of the Cardano community development.", "q2r": 3, "assessor": "z_assessor_714", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "I think it is effective. There are many ADA holders in Japan, but many of them have little involvement in the community. Therefore, it is necessary to hold an event to activate their involvement. However, I don't think it is an issue that needs to be resolved immediately. In conclusion, I give a rating of 4.", "q0r": 4, "q1": "The feasibility is high. They have excellent team members, which can be understood from their work. Also, they are foreigners but have a good understanding of the situation in Japan. But I don't think there are enough issues to solve to demand half the budget for the category. In conclusion, I give a rating of 3.", "q1r": 3, "q2": "The auditability is high. Roadmaps and KPIs are also clearly set. However, the general approach is not sufficient to attract the Japanese community and Japanese ADA holders. If you write it more concretely, it will be easier to get approval in the next Fund. In conclusion, I give a rating of 4.", "q2r": 4, "assessor": "z_assessor_867", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "日本語のオンライントレードフェアを開発・制作し、カルダノが提供する最もクールなものを紹介し、全くの初心者にもアピールする。", "experience": "10年以上にわたり、Google、Porsche、Ralph Laurenなどのクライアントのために、日本市場でイベント制作やコンテンツ制作を行ってきました。"}