{"id": 381404, "author": "dwayne", "title": "DAO-NET: Auditor DAO", "url": "https://cardano.ideascale.com/a/dtd/381404-48088", "category": 26253, "amount": 19000, "description": "Making the audit process efficient distributed and transparent requires sustained funding however Catalyst funding is for specific projects.", "funded": 2, "upvotes": 123247980, "downvotes": 1769307, "votes_result": 121478673, "votes_cast": 540, "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "Such a proposal can have a great impact in the relation to the challenge of serving to auditors as a source of information and guidance and providing funding to auditors. Having funds for auditors specifically can definitely increase the motivation and therefore improve and grow auditability, which is in accordance with the challenge. Rating given 5.", "q0r": 5, "q1": "A  detailed roadmap is provided with an outlook of 6 months, the requested budget is 19 000. The team bio is provided and seems reasonable, also their experience in the area seems sufficient. LinkedIn profiles are posted, which increases the idea that they can deliver the output. ", "q1r": 5, "q2": "A very detailed key metrics are provided, and these are sufficient for auditing.\r\n\r\nA roadmap is well designed into subtasks that can be used to audit the progress of a proposal.\r\n\r\nA very well-designed proposal, answering all the points appropriately. \r\n", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is a DAO deployment using the DAO-NET infrastructure and treasury system. Its main distinguishing feature from previously funded auditing standards proposals is that it has an mechanism that would allow the members of this DAO to receive funding for auditing idea improvement, or even auditing work more generally. The development of auditing templates is the second aspect in which they adress the challenge. \r\n\r\nFeedback: much more clarity could be provided in terms of exactly what the DAO does and what its benefits are. After studying the universe of DAO-NET proposals, this is my interpretation of what the Audit DAO would do, but it is not desirable that CAs have to do that much reading in order to fully appreciate what you propose here. ", "q0r": 5, "q1": "There is ample evidence that the two main proposers have experience in development, a total of 29 years in IT consulting/software development. They include LinkedIn profiles. They also write extensively about various challenges that generally face the DAO ecosystem and touch upon various aspects of this. However, there is very little written about the actual Audit DAO itself but rather general risks of DAOs. Given that it is an audit DAO, there is not much specific expertise indicating that the team has the skills or relevant expertise to develop these templates mentioned. \r\n\r\nFeedback: there were proposals in fund6 with a very strong legal background and auditing expertise. Some indication that you are aware of these teams and how you could work with them would be desirable. The community should aim to work together to find solutions rather than doing double work.", "q1r": 5, "q2": "\"There are monthyl milestones clearly laid out. They also include contingency details in case some of the DAO-NET proposals are not funded whilst others are not. Specifically, they say that \"\"if the DAO Deployment Platform proposal is funded then this budget will be used to cover additional contractor expenses if required including for smart contract audits otherwise it will be added to the DAO Token / ADA reserve pool mentioned in the DAO Token Market proposal.\"\" or that it will be used for auditing expenses. This is very transparent and good practice for the community overall.\r\n\r\nFeedback: public links to websites or discord servers that would allow the community to be updated on the progress continuously would be desirable! Especially since the DAO-NET is such a multi-faceted project. \"", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 16, "ne": 5, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This proposal aims to improve on the auditability of funded proposals which will lead to less wasted resources, and will have a positive impact on the Catalyst Ecosystem. The proposal set outs clearly how it will add value, the KPI's are set out clearly and addresses future scalability. It is a very well set-out proposal. Everything is in line with the Challenge brief.", "q0r": 5, "q1": "The proposer sets out the team required and their skills needed. He then sets out the team available to fill these positions, with one open to be filled still. There is Links provided to the current team members' LinkedIn accounts, and they have an impressive line of experience and skill sets. The budget is set out nicely and is very reasonable. Additional funding is discussed and they have a plan in place for it. A Roadmap, KPI's and Success Definition has been set out clearly. Challenges and Risks are discussed in detail and how to possibly handle it.", "q1r": 5, "q2": "The proposal is set out very well with a clear road map, timeline, Budget, KPi's all within the Challenge brief, and makes the proposal auditable. I am not sure how the community will track the progress of the proposal.\r\n", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "Create a DAO, with sustained funding for auditors, to audit Project Catalyst or DAO Net funded projects as directed by the community.", "experience": "An experienced team of Blockchain developers, Plutus pioneers, SPO operators, Community Advisors and Solutions Analysts."}