{"id": 383038, "author": "rodolfo.miranda", "title": "Project Audits by Challenge Teams", "url": "https://cardano.ideascale.com/a/dtd/383038-48088", "category": 26253, "amount": 45000, "description": "How can we audit funded projects after finalization?", "funded": 1, "upvotes": 23195808, "downvotes": 17796301, "votes_result": 5399507, "votes_cast": 137, "f6_no_assessments": 6, "f6_rating": 3.611111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "The purpose of this proposal is to address the absence of an independent and reliable source that permits members of a community to assess in detail the impact of proposals after implementation. In addition, new proposals are added each cycle and, as a result, the manual effort involved in following up on all these proposals becomes overwhelming for IOG. In order to accomplish this, the author suggests leveraging the resources in the \"challenge teams\" already established in the community for the purpose of auditing the proposals that have already been implemented. However, the idea of allocating a fixed amount of funds for auditing a proposal without a clear structure, without the possibility of taking advantage of tools that are available or even exploring a collaborative effort between the auditor and the proposing entity, I am concerned that the allocation of these funds will not be as effective and therefore will not have the desired impact.\r\n", "q0r": 3, "q1": "The author gives an excellent description of his skills and experience, as well as the necessary references for verification. However, in this case it would not be relevant since he would not be in charge of implementing the proposal. Here the relevant experience would be the members of the \"challenge teams\", although this does not seem to me to be a big issue either, since they are people who are voluntarily working for the benefit of the community. In terms of feasibility, I have two major concerns. It is assumed here that the members of these teams will have the necessary skills, experience, and importantly, the time to conduct these audits thoroughly. Additionally, no mention is made of the time it will take for these reports to become available to the community. While it is difficult to estimate this time, it is nonetheless a factor that influences this feasibility criterion.\r\n", "q1r": 3, "q2": "Based on the characteristics of the project, auditability does not appear to be a significant issue; however, from my perspective, there is a possibility for improvement in the criteria used to define success. I quote \"If it is funded and gives us good results it can be extended in the future\". What is meant by \"good results\" in the author's statement?\r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 20, "ne": 10, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "I really think that this is an idea and not a project since the proposer is not developing anything or, at least, it is not clear. I do think that having an external audition is crucial in several situations, however, I did not understand who will do the audition – an enterprise or some other catalyst members.\r\nIf it is external, it is not clear about the choosing method, how the proposer is going to help, e.g..\r\n\r\nIt does addresses the challenge in a certain way, however, it's lacking information and explanations. \r\n", "q0r": 3, "q1": "The proposer did not address clearly how he is going to lead/help the external audit or the teams. It does not describe a conductible plan to follow, explaining how everything is going to be done.", "q1r": 3, "q2": "No KPI, metrics or milestones. Since it's an idea to be implemented, it's hard to have actual numbers to follow and measure the progress or the impact in the community. Obviously if the idea get funded and we believe that with 300$ we'll be able to hire an external audition we will start to have some numbers. However, a metric to this actual proposal was not given.", "q2r": 2, "assessor": "z_assessor_25", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "The idea is good as external and indepedent audits are essential to validate that any process was followed and projects deliverables were delivered.\r\nHowever, it is not clear how the proposal team (or the proposer solo) would help challenges team to establish this external audit (or, its role). They way it is written, it seems to be more of a delegated responsability than a project to be developed and lead by proposer.\r\n\r\nIts nice to have this in place but the process still need to be devloped, validated and rolled out/standarized.\r\n\r\nIn order to make it look more like a project I would make a more clear process implementation schedule and a scope statement. This would help all to understand the role of the proposer in implementing it and how he would interact with challenges team. As example, I'd include in the scope the development of a standarized external audit process, in partnership with challenges team, the creation of standards templates, the selection of a single tool to do so, and so on.\r\n\r\n", "q0r": 4, "q1": "As the role of the proposer is not clear in proposal, its hard to assess his capabilities for the project. Assuming the main objective is to lead the external audit process implementation, one single person seems to be enough and the proposer seems to have enough expertise in this matter. This is easily verifiable by linkedin bio and other links put available.\r\nThe budget breakdown is clear is fair. \r\n\r\nThe main point of attention in the feasibility is the lack of a implementation plan. its not clear how this process will be rolled out or its completition date (process fully establhished and running).", "q1r": 4, "q2": "There are some metrics to track the project but some of them are bit vague of subjective (for instance, how the \"Quality of audit reports\" will be measured?). These matrics could also have some time-related targets.\r\n\r\nNo milestone as theres no implementation plan. As suggestions, I'd consider milestones as having a standarized process defined, having stadarize templates and tools established, having a pilot with selected funded proposals, done, etc. ", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 17, "ne": 6, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "It would be a great idea to have teams focused specifically on the auditing of funded proposals. A detailed description of the progress of a challenge team is provided, which I find very well designed. A motivation of reward per proposal with metrics to audit is a good point. Having such results then finalized in a form of a standardized report can definitely increase the audibility. Yet a more detail on how these teams would be created, who will be eligible to be in - is missing, who will govern them or what will be requirements? Is not 300 too much per project? How to secure future funding? \r\n\r\nRating given 4.", "q0r": 4, "q1": "A linked profile is provided, and his experience is relevant and sufficient. He was also funded in F6, so it increases the creditability. The budget of 45 000 is questionable from a long-term perspective and also overextended for just one funding. \r\n\r\nNevertheless, the experience and plan provided are considered reasonable. \r\n\r\nRating given 5. ", "q1r": 5, "q2": "it is very likely to audit the progress and the outcome based on the provided tracking metrics.\r\n\r\nYet a roadmap with a time frame e.g. how many teams and how long it takes to assemble them is missing. \r\n\r\nRating given 4.", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This is a great proposal idea. Communities and the ecosystem can benefit from it, whether those Catalyst-funded projects can really deliver or not. It isn't an easy job \"guarding\" all projects day by day with detailed attention. Therefore, this incentive system can energize the challenge teams in making independent audit reports to deliver them to the communities. ", "q0r": 5, "q1": "Success likelihood is very positive. Hopefully, the challenge teams can work it out well. The budget size makes sense. Risks that could happen are not all the projects can be audited properly due to some external issues, such as failing to get extended funding, failing to get user traction, facing legal issues, etc.  ", "q1r": 5, "q2": "As an experiment for this current fund, expect to see the results not immediately. The proposer should mention in which channels the audit results will be announced. But, considering this proposal gets funded, I believe this will be announced shortly in the Town Hall, and communities can keep track of the audit processes. ", "q2r": 5, "assessor": "z_assessor_647", "no_vca": 19, "ne": 1, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "Clear benefits provided from the proposal and however, the challenge team is awarding an intensive of US$2500 for an entire challenge team. In terms of US$300 per proposal fix, in case of a challenge that comprises many proposals, then your proposal would be great. I also believe \"after finalization\", you meant after obtaining the fund, and the team start to work on the proposal or not after the proposed have been funded and completed.", "q0r": 4, "q1": "I believe with your experience in software design and Academic background, you should develop a methodology for all the platforms where on order challenge team members can use to report and follow up the funded project. For instance, the website or collection point can handle all the reports coming on regular-based (weekly, fortnightly, monthly and final reports) just research, a tool, a workshop, or a GitHub Open-source packages. I believe the proposal has some decree or some element the conflict with the current Challenge team.\r\nWith 45,000 K requested for this proposal, I believe that it would be best for a software or a website or a system where is the proposer enter the data on a regular basis, as I mentioned earlier and then the challenge team monitoring based on the original proposal and IOG or Project Catalyst make final statistic.\r\n", "q1r": 2, "q2": "You should provide a precise breakdown on how you're going to use 45,000K in the next 12 weeks after the proposed has been funded. There is not much detail or work breakdown structure (WBS) or the milestone on what you will do for each month and how to achieve the targets.", "q2r": 2, "assessor": "z_assessor_726", "no_vca": 14, "ne": 5, "ng": 6, "nfo": 3, "vca_o": 1}], "solution": "Letting the Challenge Team perform an external and independent audit process of projects achievements", "experience": "Strong academics and 25+ years of proven experience in architecting and developing software solutions. Got a project funded on F6."}