{"id": 381955, "author": "shifu.brian666", "title": "Focus on MiCA regulation in the EU", "url": "https://cardano.ideascale.com/a/dtd/381955-48088", "category": 26235, "amount": 35000, "description": "Obter uma legislação favorável enquanto não há uma visão clara de Cardano sobre qual legislação ela quer na UE.", "funded": 1, "upvotes": 41073008, "downvotes": 28589074, "votes_result": 12483934, "votes_cast": 339, "f6_no_assessments": 4, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Sim, esta proposta enfrenta efetivamente o desafio. Um rápido exame das fontes internacionais mostra que os legisladores e formuladores de políticas não compreendem totalmente a oportunidade apresentada pelo espaço criptográfico, portanto, elogio o proponente pela idéia de desenvolver uma estrutura dentro da UE para ajudar a preencher esta lacuna. O desenvolvimento de tal estrutura neste contexto poderia ter um impacto significativo dependendo de quão abrangente ela é e através de quais caminhos ela chega à mesa legislativa. Eu aprecio que o proponente tenha identificado uma localização geográfica específica para fundamentar a proposta e a estrutura legal resultante. Fazê-lo desta forma ajuda os eleitores a compreender melhor as expectativas e também as limitações da proposta. A identificação de peças específicas de legislação (MiCA e DORA) que serão comparadas com a estrutura também ajuda a concentrar a atenção em vez de ser muito ampla e exagerada. Se a proposta for bem sucedida, e o proponente for capaz de levá-la às mesas e representantes adequados, este projeto provavelmente terá um impacto significativo.", "q0r": 5, "q1": "Dada a experiência e o plano apresentado, não está claro se a proposta será implementada com sucesso. Embora eu dê crédito ao proponente por um plano bem delineado, a viabilidade da realização do plano não é facilmente identificável. O Componente A (elaboração) parece suficientemente simples e, dada a experiência listada, provavelmente viável. O Componente B (obter apoio político e legislativo), entretanto, é um passo significativo, mas há poucos ou nenhuns detalhes sobre como essas pessoas seriam engajadas, em que intervalos, em que nível e por quanto tempo. Os governos são freqüentemente entidades monolíticas que são opacas e lentas para mudar, portanto, para avaliar a viabilidade, identificar os principais atores dentro destas instituições no início daria aos eleitores mais confiança de que é de fato viável. Isto é ainda mais importante porque nem todos os representantes do governo estão em posição de fazer avançar tal projeto, mesmo que estejam dentro do governo. Além disso, no componente B, o proponente observa que será necessária uma iteração constante, mas não há indicação de como isso será sustentado, por quem, e por quanto tempo. Eu gostaria que o proponente também tivesse fornecido mais informações sobre seus antecedentes, incluindo links para suas credenciais; na situação atual, nos é deixado \"confiar\" na palavra do proponente, mas isso provavelmente dissuadirá muitos eleitores. O orçamento também deixa algo a desejar e torna difícil para os eleitores entenderem como o proponente atingiu o valor específico. Por estas razões, não concordo nem discordo que esta proposta seja viável, mas se não for bem sucedida, abordar estas questões em uma futura rodada de financiamento certamente aumentaria a pontuação.", "q1r": 3, "q2": "Infelizmente, não acredito que as informações sejam suficientes para auditar o progresso e o sucesso da proposta. Não está claro como a comunidade seria capaz de auditar o sucesso da proposta para determinar se valeu a pena o investimento. Não há KPIs reais, cronograma ou roteiro para como a proposta seria implementada. Dado o ambiente muito obscuro da redação de regulamentos e legislação, não está claro como o sucesso do projeto poderia, de fato, ser medido. Se o documento for escrito e fornecido aos legisladores/criadores de políticas, será que o sucesso é esse? E se ele for aceito mas não utilizado? Como a comunidade acompanharia para descobrir qual o impacto que teve sobre os resultados de qualquer legislação? Além disso, não há uma linha de tempo fornecida, deixando os eleitores se perguntando quanto tempo um projeto desse tipo levaria. Como conselheiro político, sei que estes prazos muitas vezes se estendem por anos e incluem muitas iterações além dos olhos do público, no entanto, isto não é abordado aqui. Isso me deixa pensando se o proponente, ou a comunidade, poderia até mesmo participar da forma explicada ao longo de todo o projeto. Finalmente, uma quantia significativa do dinheiro é para completar o trabalho, mas não há nenhuma falha para as atividades dentro de cada componente, deixando os eleitores essencialmente a passar um cheque em branco, mas sem uma maneira de rastreá-lo. Embora eu realmente apoie a idéia por trás da proposta, não há informações suficientes para ter a confiança de que a comunidade poderia auditar adequadamente a proposta.", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Documenting the Cardano vision in terms of legislation would provide the ecosystem with a common goal to work towards and guidance for lobbyists deployed at governments. It will also create a legal basis to research and refine so potential options and paths will become clear. You could look at it like a form of legal planning. This is of great importance because if there is no legal framework to operate in, there cannot be large scale adoption. This proposal could be extended in the future to other economic powerhouses in the world and create a global legal framework with subsections for each powerhouse. ", "q0r": 4, "q1": "Given that a legal framework has been brought up a couple times in the recent past and has created  doubt for certain project's abilities to be executed, there is a need for this as soon as possible. The relevant experience of the proposer is excluding the legal support that is needed, but the proposer intends to assemble a team of experts which is bound to gain some traction. Collaborating with other proposing groups in this challenge could improve chances of getting this done. ", "q1r": 4, "q2": "The main plan is explained in the proposal and the author has defined the goal of this proposal, but it does not have a clear plan of action (roadmap) in place for the community to be able to check the progress in case of funding. Nor does it specify when the documents would be ready for use, although I am convinced that as legislations change all the time, there will be a need for constant updates. ", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 24, "ne": 4, "ng": 20, "nfo": 0, "vca_o": 1}, {"q0": "It is logically consistent that to lobby for favorable legislation, it is necessary to understand strategic goals and direction.", "q0r": 5, "q1": "Will the outcome of Goal A be the creation of a Global Cardano regulatory vision document, with EU-specific components? If so, the proposal does not lay out a progressive detailed plan to achieve this document, therefore confidence in achieving Goal A and B are lower than highly likely.", "q1r": 2, "q2": "Operating from the perspective that this proposal exists to deliver Goal A and Goal A is achieved by the delivery of a Cardano regulatory vision document, the specific, measurable, time-fenced, auditable plan is not in this proposal and therefore cannot be audited by the community in order to determine progress or likely success.", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "Great idea. I buy into the vision of global Cardano vision on regulation. I share in the principle of making clear what regulation on regulation we want for the Cardano ecosystem rather than waiting on politicians to impose one on us. This is brilliant and it is very focused and gives confidence at the lobbying table since it proposal clear what we want. Also, try building cooperation with Crypto 4 EU since both are aiming to work in the same region. I would like to see this proposal get support it needs. ", "q0r": 5, "q1": "The team has great lobbying experience. Having skin on the table is great to have a starting point in the regulatory space and demonstrate commitment to compliance. \r\n\r\nI think the plan is achievable with clear and practical outcomes. ", "q1r": 5, "q2": "Gaol and A and B are focused and transparent which would be easy to track and audit. The activity is precise and clear. I think the proposal should be given the support it needs. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "Documentar primeiro uma clara visão Cardano global sobre regulamentação e segundo uma visão regulatória da UE, levando em conta a MICA, DORA e outros", "experience": "Estou há 15 anos em Risco e Conformidade para instituições financeiras, incluindo muitos anos como líder em Risco e Conformidade para a Fintechs."}