{"id": 384085, "author": "adamrusch", "title": "The Immutable Research Institute", "url": "https://cardano.ideascale.com/a/dtd/384085-48088", "category": 26235, "amount": 15000, "description": "A comunidade da cadeia de bloqueio precisa de mais organizações que possam apoiar os esforços para educar e advogar por uma legislação favorável", "funded": 1, "upvotes": 66505100, "downvotes": 26278040, "votes_result": 40227060, "votes_cast": 409, "f6_no_assessments": 9, "f6_rating": 3.814814814814815, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=14960"], "media": [], "f6_assessments": [{"q0": "A partir do meu entendimento, esta proposta visa criar uma organização sem fins lucrativos que servirá como especialista especializado em lidar com questões sobre Cryptocurrency, tecnologia Blockchain e Cardano, mas enfocando o aspecto da legislação/regulamentação em políticas de nível estadual. A declaração do problema é apresentada de uma forma que é fácil de entender e conectada ao desafio, e a solução para o problema é clara. Em termos básicos, a proposta visa divulgar informações em locais onde há muita desinformação, mesmo que sejam tomadas muitas decisões que impactam todo o ecossistema. É um projeto que precisaria de tempo para crescer até seu potencial máximo, mas que pode se revelar incrivelmente valioso a longo prazo. (Do qual a equipe parece ter um entendimento). O crescimento dos colaboradores com a organização através de universidades e através de lobbying cobrirá dois ambientes muito importantes no futuro: Os que fazem parte da tomada de decisões, e os que farão parte do futuro. Se o projeto puder crescer até o potencial pretendido, será um investimento muito valioso para a comunidade e o ecossistema como um todo, tanto em nível micro como macro. Concordo plenamente que esta proposta enfrenta efetivamente o desafio.", "q0r": 5, "q1": "A experiência da equipe principal apresenta uma ampla gama de habilidades: Educação (em nível universitário), experiência de trabalho no setor financeiro, e engenharia eletrônica. Com este conjunto de competências, ela fala bem para um amplo entendimento do que é necessário para desenvolver e manter este projeto ainda mais. Seria benéfico se a proposta apresentasse links para fortalecer ainda mais a prova de competência de cada membro da equipe, como por exemplo um perfil LinkedIn. Embora isto possa ser encontrado por alguns minutos de pesquisa no google. Há muita perícia, mas seria bom ter mais provas disso para tornar essas habilidades mais verificáveis. O fato de que a equipe pretende continuar desenvolvendo a organização mesmo que não sejam financiados, fala pelo bom comprometimento das pessoas envolvidas. O plano de desenvolvimento é fornecido no roteiro e é explicado em detalhes, passo a passo. A maior parte da alocação orçamentária será destinada ao retentor legal, o que faz sentido devido à complexidade da criação de uma organização sem fins lucrativos dentro dos EUA, e considerando o período de um ano do roteiro. O que tornaria esta proposta ainda mais clara é a inclusão de um prazo maior, o que acontece além do primeiro ano? A proposta diz onde pretende estar naquele momento, mas quais são alguns marcos possíveis a longo prazo? A seção de comentários nos fornece um pouco de informação onde o proponente pretende expandir suas conexões a um grande número de universidades, mas mantendo-a em nível nacional. Além disso, seria preferível que houvesse mais detalhes em um detalhamento do orçamento, a fim de compreender a alocação do orçamento. Quantas horas de trabalho devem ser divididas em quantas pessoas contratadas, etc.\r\nNo total, concordo que esta proposta será implementada com sucesso.", "q1r": 4, "q2": "O roteiro fornecido na proposta é claro e de fácil compreensão, com uma subdivisão em marcos de 3, 6 e 12 meses. O que seria bom incluir no roteiro são algumas medidas de sucesso, ou KPIs. Com quantas universidades a equipe pretende estar em colaboração, durante que período de tempo? A proposta descreve o planejamento para estar em contato com vários defensores da cadeia de bloqueio em um determinado momento, mas quem são eles e quantos são? Onde eles estão baseados? A fim de medir o crescimento e desenvolvimento das organizações, seria benéfico propor a inclusão de alguns vínculos comunitários. Onde podemos acompanhar o desenvolvimento, ou entrar em contato com a organização? Mesmo que tal plataforma ainda não tenha sido lançada, seria bom ver o que a equipe está planejando em relação a como a comunidade pode acompanhar seu progresso, a fim de aumentar a transparência. Além disso, algumas reflexões no texto sobre a compreensão dos riscos ou desafios potenciais ligados ao projeto beneficiariam muito a proposta. Se eu, como membro da comunidade, ler que a equipe entende os obstáculos do que pode acontecer e está disposta a compartilhar esse plano comigo como membro da comunidade, isso aumentaria a confiança, transparência e comunicação entre a comunidade e a organização. Dito isto, concordo que esta proposta me fornece informações suficientes para avaliar o progresso na realização de seus objetivos declarados.", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Para qualquer pessoa que assistiu à audiência do Congresso dos EUA sobre a cadeia de bloqueio, ficou muito evidente que existe um amplo vácuo de conhecimento por parte dos legisladores e legisladores sobre o que é a tecnologia da cadeia de bloqueio. Esta ignorância só pode levar a desinformações e regulamentações errôneas que poderiam prejudicar e não promover o desenvolvimento tecnológico. Embora esta proposta de estabelecer o Instituto Rsch Imutável seja mais centrada no estado, é o tipo de organização que ainda poderia fornecer informações para qualquer pessoa (mesmo Feds) aprender com elas. Atualmente sou membro de um grande partido político em Aust em nível estadual e já ajudei anteriormente na preparação de pesquisas da oposição para que o membro local informe sobre seu voto e posso atestar que todas as informações são consideradas (local, estadual, federal) se você quiser fornecer o melhor para seus eleitores. Esta proposta visa estabelecer uma organização que possa ajudar a informar os poderes e a qualidade dos proponentes e a maneira como eles estão olhando para um futuro a longo prazo para apoiar nosso ecossistema é louvável. Concordo que esta proposta se enquadra nos objetivos deste desafio e desejo boa sorte a vocês.", "q0r": 5, "q1": "A lógica dos proponentes para o estabelecimento do IRI é lógica e as etapas elaboradas para a criação de uma organização credenciada estão alinhadas com tais instituições. As qualificações dos proponentes no ensino superior, finanças e fin-tech também os tornam embaixadores adequados e instruídos para a indústria criptográfica. O plano ao longo dos 12 meses, dividido em trimestres, é o que se espera e onde eu sugeriria uma melhoria nesta proposta está em saber se o IRI será ou solicitará ser oficialmente associado à Universidade de Illinois, o que seria o ideal. Os fundos solicitados para estabelecer o instituto são muito razoáveis e os proponentes admitem que seus planos irão prosseguir se os fundos Catalyst são garantidos ou não, fala muito sobre sua intenção de sucesso. Concordo que há o suficiente nesta apresentação para alcançar o sucesso e desejo à equipe o melhor.", "q1r": 4, "q2": "É altamente improvável que as atividades dos estágios de 3 e 6 meses possam ser compartilhadas publicamente devido à privacidade e isto é muito compreensível, especialmente a participação do IRS. O que poderia ser compartilhado como parte da auditoria é o resultado de tal aplicação e seu eventual estabelecimento como uma organização sem fins lucrativos. Em termos dos objetivos de 12 meses, deveria tornar mais evidente e pública sua contribuição para a discussão mais ampla e criptográfica. O proponente já utilizou anteriormente o Meetups e tenho a sensação de que este também pode ser um ponto auditável sobre seu progresso, se necessário. Ao examinar o vídeo anexo, posso atestar a intenção honesta e a boa-fé dos participantes e isto proporciona grande confiança de que este projeto deve ser bom de ser rastreado. Como uma pessoa que trabalhou para um partido político e como eleitor, desejo-lhe felicidades ao estabelecer tal instituto que só pode progredir em nossa indústria.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is not aimed at creating a lobbying organisation to sway legislative policies. It is aimed at the creation of an informing entity for mainly academic campuses. In this particular proposal the project requests funding to cover for the legal aspects of setting up a non-profit organisation. The organisation itsself is a superb idea and given the competencies in the team and professionality that it holds, it could be one with great future impact. It is just not a great fit for this niche challenge and would fit better in a challenge to scale-up informational hubs. ", "q0r": 2, "q1": "The proposing team has ties to academic institutions and the banking sector and legal policy making. The latter should be clearer mentioned in the proposal as it only became apparent about 20 minutes in the video. The lectures that are already performed are quite professionally executed and could realise a demand by universities to explain this technology to their students. There is no funding breakdown to explain the requested 15K USD. Not that it seems to be too much, just that a detail in spending reinforces confidence in terms of feasibility. Adding this to the proposal would improve it. ", "q1r": 4, "q2": "There is a difference between KPIs and a roadmap. In this proposal, both have been combined in one format, creating difficulties to determine what is intended to do and what is considered a success after each quarterly period. As the project is dependent on lectures, it is also dependent on the institutions hiring the lecture. To ensure confidence in this, the proposal would be improved with a risk assessment ensuring constant hires so the lectures get heard. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 22, "ne": 5, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "The proposal asks for funding the initial administration costs of opening up a non-profit organization in the US to advocate for favorable legislation in the US. The project wants to provide templates for filing non-profit organizations in the US after consulting with their lawyers. Long-term it is the plan to build a network of blockchain advocates.  ", "q0r": 3, "q1": "There are legit people behind the project that can be found on LinkedIn (although not provided by them). They are 3 people that have backgrounds in policy education, banking and IT which seems suitable for their endavour. However, the roles and their current political relations are not clear. I think it is likely they will successfully build the non-profit, but  the success of the Research Institue remains unclear. Only future and more information about their networking etc. will tell. Regarding their budgeting: they request 15k dollars for the initial set up costs. It would be useful to break down the costs more (how much are lawyers etc. costing). This is currently not provided. ", "q1r": 3, "q2": "The poblem statement and solution don't become entirely clear. It is stated that more organizations are needed to advocate for crypto legislation. Although that might be true, no further explanations on the current situation and the amount of crypto advocating organizations are given. As a non-US citizen it doesn't become clear why the Immutable Research Institute would solve the \"problem\". The project team provides a basic roadmap that outlines their plan to set up the organization and file for non-profit. But a clear metrirc of success is not given. Especially the benefits for the Catalyst Community are not outlined enough (like the templates). Furthermore, risks like not gaining political momentum and failing to build a successful network of advocates are not addressed.", "q2r": 3, "assessor": "z_assessor_380", "no_vca": 14, "ne": 6, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal brings a clear explanation of the problem vs. solution and brings aspects of their uniqueness (although more evidence of their quality control could be given for the community to assess it). It correctly addresses the challenge and the problem. ", "q0r": 4, "q1": "The proposal brings enough evidence ou the team's experience, but it lacks information about the budget plan (no detailing was given, no specific items were described). Therefore, the plan can be better explained so the community can better assess if they will be successful.", "q1r": 3, "q2": "At the same time that the proposal is clear on its goals and roadmap, it's not easily auditable because it does not bring much information of their concrete actions, outcomes or products. One could extract them from their roadmap, however, they are still too abstract to be auditable. Ex:\r\n\"we will be part of a robust network\"\r\n\"we will be ready answer any questions\"\r\n\r\nSuggestion for improvement: bring concrete and auditable information for the community to follow if the project succeed in each step. ", "q2r": 2, "assessor": "z_assessor_386", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The goal of the organization in the proposal is clearly much broader than current challenge. However, it is clearly an important initiative and sufficiently addressing the specific challenge as well.", "q0r": 4, "q1": "The team behind the proposal in very interesting, bringing together academia, finance, and tech. Therefore the team clearly has the experience to implement this project successfully.", "q1r": 5, "q2": "The idea is very well outlined and categorized into the 3-month, 6-month, and 12-month timeline, which supports auditing the progress. However, the proposal itself is more towards supporting the (future) organization, not so much a specific (action) plan, therefore making it harder to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_685", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "Awesome proposal and a great long-term initiative. I think the organization's mission is a solution to gaining influence in the public policy space for blockchain. This is fantastic and effectively addresses the challenge. ", "q0r": 5, "q1": "The proposal has a detailed plan of activities. My concern is that the proposal does not define success. Also the strategy should have focus-driven programs that would enable the yet-to-set-up organization to achieve its mission. Excellence team experience.", "q1r": 4, "q2": "It would be great to detail a breakdown of activities the requested fund would be used. Also, the proposal did not show how its activities would be documented. This is necessary for tracking and auditing. ", "q2r": 3, "assessor": "z_assessor_727", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "Proposal outlines a great place to start with a research institute to provide the information needed by public servants and politicians. Links with all the other education institutions  investing resource in DLT research and building a network of networks would be a great next step to build mass and share big workload of lobbying.", "q0r": 4, "q1": "Missing some key people, advocacy, policy, lobbying skills. Not for profit entity will most likely be stood-up. What's missing is what then... what are the first education initiatives? Who will they be targeting to participate? How inclusive and accessible will they be?", "q1r": 3, "q2": "More information on what the research institute plans to do (tangible and intangible) needed to audit its contribution to the challenge. For example; \"We will be a resource to anyone who wishes to learn more about favorable blockchain policies and put them into action.\" What is the resource? Have the team drafted or curated favourable policies as a reference? What work is available from the proposers around what the blockers, incentives, disincentives, etc. are to favourable legislation and ways to work them using all the lobbying tools and tricks (which usually means having something to trade!)", "q2r": 2, "assessor": "z_assessor_850", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This projects approaches the challenge from an educational angle. Their purpose is to be an educational resource and advocate for favorable legislation. I think that starting by focusing on state legislation is a smart move, as federal policy often takes note from what has been done at the state level.", "q0r": 5, "q1": "It's clear that this team brings a lot of experience in education and finance--which are two pivotal skillsets for this education/lobbying effort. The team also offers a project roadmap and clear set of goals.", "q1r": 5, "q2": "While it would be nice to see a budget breakdown for the $15,000 in funding, I think that their outlined goals and goals will make it possible to audit their progress.", "q2r": 4, "assessor": "z_assessor_859", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}], "solution": "Estamos no processo de criação de uma entidade sem fins lucrativos que irá educar sobre a cadeia de bloqueio e defender uma legislação favorável.", "experience": "Os membros fundadores incluem um PhD em Política Educacional, um Gerente de Ativos para o Deutsche Bank e uma SysAdmin para Empresas de Comércio de Alta Freqüência."}