{"id": 384987, "author": "cargofe2", "title": "Study and Pilot in Colombia", "url": "https://cardano.ideascale.com/a/dtd/384987-48088", "category": 26235, "amount": 5000, "description": "Colômbia em moedas criptográficas, está desenvolvendo um piloto da autoridade financeira que irá influenciar o futuro de Cardano neste país", "funded": 1, "upvotes": 40137061, "downvotes": 19022659, "votes_result": 21114402, "votes_cast": 276, "f6_no_assessments": 4, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta proposta de realizar uma análise completa dos resultados da caixa de areia regulamentar de 1 ano promulgada pela autoridade de supervisão financeira da Colômbia em relação à implementação da moeda criptográfica é interessante e altamente viável. Entretanto, considerando que os objetivos do desafio apontam para a criação de um ambiente de leis mais favoráveis ou menos prejudiciais ao espaço criptográfico, com foco no PdS e nas particularidades do Cardano, acredito que uma futura iteração desta proposta deve focar no aspecto de lobby e rede de contatos do desafio, Ao invés de apenas parar na análise dos experimentos regulatórios, dos quais meses após o lançamento dos testes, pode-se entender que o resultado mais significativo é que as instituições financeiras e as plataformas de moeda criptográfica podem sustentar alianças e operar sem conflitos, ao contrário do que aconteceu na Colômbia no passado. Deve-se ressaltar também que, de acordo com as informações disponíveis em espanhol, o SFC aprovou apenas 4 moedas criptográficas a serem emparelhadas com o peso colombiano durante este projeto piloto/caixa de areia regulamentar: bitcoin, ethereum, litecoin e bitcoin cash, o que significa que nem Cardano nem uma moeda criptográfica do PdS participarão do piloto, com a concomitante ausência de provas derivadas do piloto para as conseqüências regulamentares que as especificações do PdS necessariamente acarretariam, ao contrário do PdW.", "q0r": 2, "q1": "A equipe é claramente muito competente e tem a experiência necessária no setor público da Colômbia, com uma empresa de consultoria já instalada para desenvolver a análise descrita, e o orçamento é claramente declarado e dividido. Dito isto, seu foco principal parece ser o registro territorial/territorial, sem experiência verificável no setor de criptografia, nem na comunidade Cardano antes do Fundo7; eu recomendaria fortemente a incorporação desta informação em uma futura iteração do projeto. Embora o documento final proposto seja certamente viável para a equipe, não há KPIs claros que justifiquem lobby ou networking; eu sugeriria como métricas potenciais o número de entrevistas a serem realizadas, especificação dos órgãos governamentais a serem abordados (como aqueles que compreenderão o Comitê de Avaliação, como a Presidência da República, o SFC, a Superintendência de Sociedades e a Unidad de Información y Análisis Financiero, entre outros), etc.", "q1r": 3, "q2": "As informações fornecidas mostram que haverá um produto conciso no final do período de 3 meses estipulado, o que mostrará o sucesso da proposta. Entretanto, como dito acima, não há KPIs claros que possam medir ou auditar o progresso da análise e do relatório. Neste caso, eu recomendaria que a análise fosse dividida em resultados que podem ser usados como uma indicação mensal do progresso feito, seja como capítulos independentes (por exemplo, em relação à regulamentação anterior ou posições do SFC em relação à criptoeconomia, alianças participando da caixa de areia reguladora e o histórico de seus membros em relação à criptocracia, etc.) ou como indicado acima, como número de entrevistas realizadas, sendo suas gravações/conclusões um possível resultado para fins de auditoria.", "q2r": 2, "assessor": "z_assessor_787", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposing team has filed 2 proposals that are complementary. By performing analytic research on what the Colombian government is intending to impose as legislation, the informational chart from the other proposal can be updated to conformity. By doing this, the chances of successfully influencing legislative decisions rises significanlty. Such an analytical documenbt could hold great value for future ventures in the cryptographic sphere on Colombian territory. ", "q0r": 5, "q1": "The proposal authors have relevant experience in the fields of law and government in Colombia and have provided evidence of this experience. By intending on making their research open-source, they are in a position of potentially helping a lot of projects. This increases feasibility significantly as cooperations will be desirable. ", "q1r": 5, "q2": "The proposal has a complete set of auditables. There is a clear roadmap with funding breakdown, definition of succes after 3/6/12 months, risk analysis and concrete prospected release date in place along with measurable KPIs. Very good work. ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 25, "ne": 4, "ng": 18, "nfo": 3, "vca_o": 1}, {"q0": "This is a proposal on researching and piloting the application of electronic money in real life to see how it is received by citizens in Colombia. The proponent has legal experience in Colombia. The project is needed at the present time, raising public awareness about blockchain technology and cryptocurrencies in the countries.", "q0r": 4, "q1": "Researching the community response as well as building a legal framework, a technology foundation for bringing cryptocurrency to life is absolutely necessary, and completely feasible at this stage of blockchain's development.", "q1r": 4, "q2": "After the process is completed, the results of the research will be made public, and recommendations for next steps to raise awareness and practical application of cryptocurrencies will be made. This is a necessary stepping stone, supporting the serious implementation of cryptocurrencies into life.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "Great idea. However, the proposal does not give a clear indication of the campaign that would enable favorable regulation. I would be glad if the team create a framework to serve as a reference point for favorable legislation in Columbia.", "q0r": 4, "q1": "This team has experience lawyers and individuals in the public sector to achieve their goals. After reading the proposal, I am not getting a detailed plan and focus outcome for the project. I think the team should make their strategy clearer. What kind of specific benefit is the proposal aiming to measure.", "q1r": 3, "q2": "There should be detailed activities for which the budget would be used. Also, the proposal should show how activities would be documented. This would be helpful for tracking and auditing.", "q2r": 3, "assessor": "z_assessor_727", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Estudaremos o piloto em andamento e obteremos as informações necessárias para determinar as possíveis conseqüências.", "experience": "Quinze anos de experiência no setor público colombiano em entidades como o Departamento Nacional de Planejamento."}