{"id": 381885, "author": "gwendal.ledivechen", "title": "African Blockchain Centre for Devs", "url": "https://cardano.ideascale.com/a/dtd/381885-48088", "category": 26244, "amount": 30000, "description": "\nManque de développeurs Cardano formés dans le monde entier\nReconnaissance/crédibilité des développeurs africains\nLes cerveaux africains se dirigent vers les pays occidentaux\n", "funded": 0, "upvotes": 18619246, "downvotes": 17974111, "votes_result": 645135, "votes_cast": 109, "f6_no_assessments": 3, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "Je suis toujours surpris par l'impact que Cardano a sur tant de personnes lorsque je lis ce type de propositions. Cette fois-ci, l'équipe chargée de la proposition soulève la question de la pénurie de développeurs compétents pour développer pour Cardano. En outre, d'autres aspects du contexte africain sont présentés, qui renforcent la nécessité de résoudre ce problème. La mission d'ABCD est de devenir le principal fournisseur de solutions blockchain en Afrique, comme l'explique en détail son plan stratégique quinquennal. Ils demandent un financement en particulier pour ce cycle Catalyseur afin de pouvoir lancer la première cohorte pour que le format, le contenu, le niveau de participation, etc, puissent être testés. Ce qui est complètement aligné avec les paramètres du défi. En ce qui concerne les paramètres de réussite, ils sont très bien définis. Cependant, il serait intéressant de définir les objectifs pour chaque métrique afin de pouvoir faire une estimation de l'impact.\r\n", "q0r": 4, "q1": "Joshua et Gwendal sont les fondateurs d'ABCD, qui est né avec Cardano et Catalyst, et partage donc beaucoup des mêmes valeurs et visions. D'après ce que j'ai compris en lisant la proposition, ils ont déjà libéré la première cohorte de 14 développeurs blockchain, on s'attend donc à ce qu'ils puissent le faire à nouveau. La proposition est beaucoup plus solide cette fois-ci, avec une vision à court, moyen et long terme, et je les en félicite. L'équipe identifie de manière excellente ses principaux objectifs, sa portée, ses parties prenantes, ses obstacles et les résultats attendus. Ce faisant, la communauté peut prendre une décision éclairée quant à la faisabilité. Si je peux me permettre d'apporter une amélioration, ce serait la manière dont le budget est défini. Bien qu'il y ait une justification des éléments envisagés pour atteindre le chiffre final, je pense que plus d'efforts devraient être mis dans ce processus. A titre d'exemple, il est indiqué que le coût de la formation d'un développeur serait d'environ 1500 $, cependant, il est indiqué qu'il est prévu de former 25 développeurs pour un total de 37500 $. Par conséquent, j'aimerais vous demander d'où proviendront les fonds restants ? Le coût des questions administratives telles que les suivis, les réunions et les licences n'est pas clair non plus.\r\n", "q1r": 3, "q2": "Bien que je vous félicite d'avoir une vision à long terme avec des plans annuels, il y a un manque d'informations concernant les aspects d'auditabilité de cette proposition. D'autant plus que, selon la section budgétaire, le cycle de formation dure généralement entre quatre et cinq mois. Que se passera-t-il pendant les mois restants de votre plan annuel ? En ce qui concerne les résultats attendus, la mesure clé est l'inclusion de 25 personnes dans cette cohorte. En examinant de plus près les paramètres, bien qu'ils soient très clairement définis, aucun objectif n'est fourni pour chacun d'entre eux, ce qui rend impossible l'évaluation de la proposition du point de vue de l'auditabilité.\r\n", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Developing developers in Africa is a great idea to develop blockchain and Cardano in Africa to solve current problems there. But I really haven't seen the proposal's difference in developing developers in Africa since developers in Africa can totally take Cardano courses for free. I'm a native of Southeast Asia but I can still learn Haskell and Plutus through Cardano's free courses. Meanwhile, the proposal needs funding for developers to learn. I still don't know if the purpose of developer funding is incentive money or course money.", "q0r": 2, "q1": "\"The experience of the team behind this proposal goes well with organizing events, building community, and making a website well suited to creating programs and courses. But this is a program and course for developers so I think they need someone with IT and blockchain skills.\r\n\r\nChắc sẽ thêm phần detailed plan sau\"", "q1r": 2, "q2": "\"Proposal still doesn't have a specific plan for how to attract developers to take courses, I only see the proposalr mentioning using money to teach developer courses. In my opinion, what attracts developers to develop careers with blockchain and Cardano is their own career opportunities and financial development. If the proposal focuses on telling them about these things, it would be better than just creating courses without giving them a reason why they have to become blockchain developers.\r\n\r\nBesides, the proposal also does not set a target of the number of developers who complete the course and are tested enough to be able to execute projects, it will be difficult to know if the project will be successfully implemented after being funded.\"", "q2r": 2, "assessor": "z_assessor_645", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "One of the key objectives of this challenge is to bring new developers into the Cardano ecosystem. This proposal meets this perfectly by training and supporting devs in Africa.\nThe initial cohort is visible on their website with bio's (https://www.abcdevs.com/hire-blockchain-developers). This should provide the voter with confidence that the proposer has proven capability. This proposal is to put another 24 devs through the programme.", "q0r": 5, "q1": "The people running ABCD and their role in delivering this proposal is made clear as is the role of their training parter, EMURGO.  Although LinkedIn profiles are not provided they are relatively simple to find so the claims in the proposal can be verified.\nThe costs involved are clearly set out and the course costs can be validated on the emurgo website (https://emurgo.io/education). A small overhead (c$5k) is retained for supporting devs over 5 months of training.\nA clear (multi-year) roadmap has been provided showing the ambition of this organisation.\nOverall a very transparent and honest proposal.", "q1r": 5, "q2": "The metrics have been well thought through. Not only does the proposer look at the short term metrics , ie how many developers have been training but they are also delivering additional value to the community by tracking post training activities ie employment of the devs, salaries, projects and partnerships initiated. This will allow the community to track the growth of ABCD aswell as the devs they are helping.", "q2r": 5, "assessor": "z_assessor_45", "no_vca": 20, "ne": 3, "ng": 17, "nfo": 0, "vca_o": 1}], "solution": "\nFormer des développeurs Cardano d'élite en Afrique\nÉtablir le meilleur fournisseur de solutions Cardano en Afrique\nFormer l'élite technique de l'Afrique de demain\n", "experience": "Joshua, Gwen et les équipes d'ABCD gèrent l'initiative pendant un an et ont déjà réuni une première cohorte de 14 développeurs de blockchain prometteurs."}