{"id": 382324, "author": "swhitenstall", "title": "Catalyst-Coordinator Hub", "url": "https://cardano.ideascale.com/a/dtd/382324-48088", "category": 26244, "amount": 4350, "description": "Les proposants financés par Catalyst ne disposent pas d'une couche collaborative pour répondre aux questions de la FAQ, laisser des commentaires et soulever des problèmes.", "funded": 2, "upvotes": 91428158, "downvotes": 2849964, "votes_result": 88578194, "votes_cast": 274, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal discusses a simple issue that, if it is resolved, could have a significant impact on the community. Proposers are a crucial Catalyst stakeholder, and this proposal attempts to address a concern mentioned in Catalyst Circle. It is designed to address this demand by establishing a \"Community Hub\" on Gitbook where users may leave feedback and report issues. However, I must admit that I am having difficulty finding a direct link between this proposal and the goal of this challenge. There is a partial alignment for me because because it attempts to strengthen Catalyst's relationship with this vital community. The metrics appear to be relevant to what the author is looking for and Cardano's mission\r\n", "q0r": 4, "q1": "Stephen, who is well-known in the community and always a person who offers a lot of value from his expertise, also includes a portion where his experience is detailed, so this aspect of skills and experience looks to be satisfied to me. The budget segment is fully described with the necessary breakdown to precisely understand the logic behind the amount asked, the activities to be carried out are discussed, and the potential risks and mitigation measures are defined.\r\n", "q1r": 5, "q2": "There is a simple roadmap provided, but suited for the type of proposal. In addition, presents a total of five success metrics based on the objectives of the proposal. Due to the nature of this project, the community will be able to audit the project during and after its implementation. \r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 23, "ne": 2, "ng": 20, "nfo": 1, "vca_o": 1}, {"q0": "The premise of this proposal is to provide support and a dedicated online hub for funded proposers to discuss their projects, collaborate and support each other. In terms of growing and scaling up community hubs, this is very much about providing a plenery style platform for the funded projects of each round to collaborate and support eachother - so in the sense that this group could value-add to eachothers' work it does align with this challenge. \r\n\r\nThe impact is very much focused on the catalyst community, it will grow over time as newly funded projects expand the group. \r\n\r\n\r\nThis project was suggested and recommended by the community itself. ", "q0r": 5, "q1": "Stephen is an elected representative for funded proposers in the catalyst circle v2. The project is likely to succeed because of his established skill set, the scope is very clear and the proposer has provided a really clear budget to outline what the funds will be spent on, how many hours he will work on it etc. \r\n", "q1r": 5, "q2": "The community can audit this process through being engaged with and involved in the creation of the hub. The KPI's are outlined but there is no metric goals included in them, still there's an assumption that something of this nature would be readily adopted by the whole group of funded projects. \r\n\r\nThe delivery timeframe is fairly clear although this does look like an ongoing service that would need continual support, and doesn't have embedded incentivisation processes so how does it sustain in the long run beyond pure volunteerism?", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 14, "ne": 6, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal meets the challenge and gives funded proposers what they may need a social support network or community hub to get feedback and help where needed. Aggregating information and making it available to those that need it. It is unclear whether multi-lingual resources will also be included to adopt people who don't speak English as their 1st language.", "q0r": 4, "q1": "The team is small and consists of one person, but the task is relatively easy to get off the ground. As said in the proposal, it mainly consists of maintenance and engagement, something the proposer is more than qualified to do.", "q1r": 5, "q2": "The ask is small and the KPI and milestones short. Given the tasks of the proposal, auditing/tracking success should be relatively straightforward.", "q2r": 5, "assessor": "z_assessor_903", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "Mettre en place une couche collaborative, un hub communautaire, pour accueillir les proposants financés sur Catalyst et leur apporter un soutien.", "experience": "Stephen Whitenstall. QA-DAO. Représentant du cercle V2 pour les proposants financés. Proposant financé dans F6 : Améliorer et accroître l'auditabilité."}