{"id": 382485, "author": "kareemb", "title": "A Second-Chance Cardano Hub", "url": "https://cardano.ideascale.com/a/dtd/382485-48088", "category": 26244, "amount": 90000, "description": "Les ex-détenus sont privés de nombreux moyens de gagner leur vie. ~77% des anciens détenus sont réarrêtés dans les cinq ans.", "funded": 0, "upvotes": 15744838, "downvotes": 20411014, "votes_result": 4666176, "votes_cast": 108, "f6_no_assessments": 3, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Tout le monde est conscient de ce problème de réincidence, et c'est formidable que quelqu'un (en l'occurrence Weld Settle) s'occupe de cette communauté souvent oubliée. Je suppose que les statistiques mentionnées dans l'énoncé du problème se rapportent aux États-Unis, cela aurait pu être inclus. La solution est innovante et rafraîchissante, et je vois le potentiel de l'introduction de la blockchain dans cette communauté, car beaucoup de ces personnes sont à la recherche de nouveaux objectifs dans leur vie. Cela s'inscrit bien dans le cadre de ce défi et si Cardano (et la blockchain en général) pouvait être responsable de la transformation de la vie d'une seule personne, alors cela représenterait déjà un impact positif massif pour la communauté ADA. C'est formidable que la proposition ait l'intention d'utiliser Cardano comme véhicule d'introduction à la blockchain.", "q0r": 5, "q1": "Nous savons que cette proposition sera présentée à Weld Seattle, et le proposant mentionne une certaine expérience, mais il n'y a aucun moyen de la vérifier. Une page LinkedIn ou le profil sur le site Web de l'entreprise suffirait. Je n'ai pas non plus trouvé de mention de cette proposition sur le site Web fourni. En général, il est bon d'ajouter ce type d'information, car cela permet de rassurer les électeurs. Il semble également que l'équipe actuelle manque d'expérience en Blockchain/Cardano, et vous mentionnez que vous recherchez des fonds pour couvrir le salaire d'un personnel compétent/expérimenté ? s'agit-il du personnel existant ou avez-vous l'intention d'embaucher quelqu'un de nouveau ? un peu de clarté ici serait utile. Si je comprends bien, la proposition vise à construire un centre communautaire Cardano au sein du Multimedia Tech Hub, et le proposant mentionne un certain nombre de termes qu'il a l'intention de couvrir (NFTSs, smart contracts, DeFi, etc.) qui semblent tous appropriés. La mise en place d'un SPO en tant que projet d'apprentissage est une excellente idée. Un calendrier est fourni, mais il inclut des étapes liées à la construction du nouveau centre de ressources, ce qui détourne un peu l'attention de l'objectif de cette proposition. Vous avez indiqué où vous avez l'intention de dépenser le budget (salaire partiel du personnel + infrastructure cardano), mais l'idéal serait de fournir une sorte de ventilation du budget, même s'il ne s'agit que d'estimations approximatives. Par exemple, quel est le salaire du personnel compétent/expérimenté ?", "q1r": 3, "q2": "Comme mentionné précédemment, un calendrier/feuille de route est fourni, mais il comprend de nombreuses étapes non pertinentes pour cette proposition spécifique. Je comprends que certaines des étapes mentionnées sont des prérequis, mais elles auraient dû être mentionnées comme telles. Les étapes importantes ici seraient l'affectation (l'embauche ?) de personnel pour ce projet, le développement du programme spécifique pour le hub Cardano/Blockchain (déjà mentionné) et la mise en place du hub de la communauté Cardano. Accompagnées d'échéances, ces étapes auraient été faciles à suivre pour la communauté. Il n'y a pas non plus d'indicateurs clés de performance ou de mesure du succès. Des exemples de KPI pourraient être X étudiants intégrés au Cardano Community Hub 3 mois après le déjeuner ; SPO mis en place avec succès 6 mois après le déjeuner. Des exemples de mesures de succès à mesurer pourraient être le nombre d'étudiants qui sont devenus des développeurs de blockchain grâce au Hub, les étudiants qui ont rejoint le projet Catalyst, etc.\nIl s'agit d'une proposition formidable et unique, et avec quelques ajustements et clarifications, les scores de faisabilité et d'auditabilité pourraient être grandement améliorés. Si vous n'êtes pas financé cette fois-ci, veuillez contacter la communauté Catalyst pour obtenir des conseils sur la façon d'améliorer votre proposition.\n", "q2r": 2, "assessor": "z_assessor_125", "no_vca": 22, "ne": 13, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Il s'agit d'une approche intéressante - marier les opportunités de gains émergentes de la blockchain Cardano avec l'offre d'une seconde chance aux ex-détenus. L'auteur du projet a donné un aperçu très perspicace du problème auquel sont confrontés les prisonniers libérés dans la société et du manque d'opportunités auquel ils sont confrontés, ainsi que des avantages pour la société de les réengager dans des activités productives. En effet, le défi appelle à la mise en œuvre de centres communautaires locaux afin d'approcher la proverbiale \"personne moyenne\" pour qu'elle participe - et cette proposition identifie un échantillon de la société qui pourrait bénéficier d'un saut dans les voies traditionnelles de retour dans la société. Cette proposition, à mon avis, ne se concentre pas assez sur la façon dont le programme peut combler le fossé entre la personne moyenne et Cardano. Oui, un programme de développement spécifique à Cardano sera élaboré en trois mois. Par qui et qui sera le juge ? Peut-être serait-il plus facile d'utiliser les ressources disponibles du programme pionnier Plutus ou de Marlow ? Il est indiqué que les auteurs de la proposition considèrent le développement de Cardano comme une voie viable vers la création de revenus et l'inclusion communautaire pour les personnes touchées par le système. Cependant, il est difficile de se lancer directement dans la programmation Plutus si l'on ne connaît pas Haskell, tandis que le fait de ne pas connaître Linux rend difficile l'entrée dans le monde Haskell de la programmation fonctionnelle. Développer sur Cardano pourrait être plus facile si l'on utilise l'EVM et Solidity - mais ces questions ne sont pas abordées dans la proposition. L'idée est peut-être de former d'anciens détenus pour qu'ils jouent le rôle d'AC (barrière d'entrée faible et qui peut sembler plus réaliste pour la majorité des étrangers à Cardano au départ), mais cela n'est pas expliqué. Le hub Cardano proposé est proposé par un bénévole de Weld (mentor, leader de la chaîne d'approvisionnement de Fortune 50 pendant 15 ans), mais la proposition ne parvient pas à articuler un moment clé - comment il ajoutera spécifiquement de la valeur à l'écosystème Cardano. Je suggérerais, si l'auteur de la proposition échoue cette fois-ci, de la soumettre à nouveau au prochain tour, mais en apportant la même rigueur à l'aspect Cardano. Pour l'instant, le désir d'aider les anciens détenus transparaît, mais la proposition pourrait bénéficier d'un impact bénéfique plus important pour Cardano.\n", "q0r": 3, "q1": "L'auteur de la proposition (en tant que bénévole) semble avoir - ou donne l'impression d'avoir - les compétences et l'expérience de Weld pour aider à réaliser les aspects non cardaniques du projet. Par exemple, il s'agit d'apporter des améliorations structurelles au bâtiment, de rechercher des organisations partenaires, d'achever la construction, etc. Cependant, je ne vois pas de plan aussi solide et réalisable pour développer un programme spécifique pour le développement spécifique à Cardano pour le centre communautaire Cardano proposé. Le proposant suggère que la proposition \"offrirait des cours de Cardano dans toutes nos langues de service\", mais il pourrait être difficile de faire le lien entre les cours de Cardano et ... la solution proposée de développement sur les blockchains - comme un nouveau départ pour gagner de l'argent et contribuer. La proposition aurait bénéficié de l'inclusion d'informations vérifiables sur le proposant et son statut avec Weld Seattle et s'il est en mesure, en tant que bénévole, de rechercher des financements pour réaliser des améliorations structurelles du bâtiment et des activités connexes. Une proposition conjointe rédigée avec Weld Seattle pourrait donner plus de crédibilité à la proposition lors du prochain cycle de financement, si la proposition n'est pas approuvée cette fois-ci. Le budget de 90 000 $ peut convenir au plan qui implique beaucoup d'activités de construction et de réparation, mais il n'y a pas de ventilation du budget qui permettrait aux électeurs de voir comment la somme forfaitaire sera précisément répartie entre toutes les activités prévues. Si des fonds supplémentaires sont utilisés pour mener à bien ces projets pour le centre de ressources de réinsertion 1426, il serait utile de dresser la liste de toutes ces autres sources de financement qui seront utilisées pour le projet ... et d'envisager les risques si ces fonds supplémentaires ne sont pas obtenus. La proposition n'explique pas les compétences techniques et l'expérience des personnes qui développeront les programmes pour le centre Cardano, ce qui est une occasion manquée.", "q1r": 3, "q2": "Bien que nous disposions d'une feuille de route (calendrier à 3, 6 et 12 mois), je ne vois pas clairement si l'ensemble de la feuille de route sera entièrement financé par le budget forfaitaire de 90 000 dollars demandé ou si des aspects tels que \"la construction achevée qui inclura, au minimum : Des espaces créatifs, un café, des espaces multi-usages/multimédias, un centre technique, des salles de réunion, un garde-manger\" seront financés par d'autres sources. Je me hasarderais à penser que ces activités de construction sont cofinancées, mais comme il n'y a pas de ventilation du budget, cela nuit à l'auditabilité et je ne vois pas comment cette proposition peut être auditée de manière réaliste - avec succès. En outre, nous ne voyons pas certains paramètres/indicateurs de performance clés (KPI) qui sont alignés avec le défi. Par exemple, comme le proposant déclare dans sa solution que \"le développement sur les blockchains offre un nouveau départ pour gagner de l'argent et contribuer\", il serait logique d'inclure une mesure et un objectif pour un certain nombre de développeurs que ce nouveau centre formerait pour l'écosystème Cardano ? Ou un certain nombre de proposants réussis dans le cadre du projet Catalyst. Des mesures encore plus simples auraient pu être incluses, comme le nombre attendu de nouveaux utilisateurs de Cardano qui ont été intégrés, comme le suggère le défi. Sans mesures et résultats spécifiques, il sera difficile de vérifier le succès. Peut-être le nombre d'ex-détenus qui ont réussi à gagner un revenu supplémentaire grâce à Cardano après 12 mois ?\n", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 24, "ne": 14, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "This idea will open a new life for miserable prisoners that is just returned to normal life, and if it is successful and being spread wider it can inspire a lot of people about the Cardano communities. \r\nThe proposal is lacking key metric to help identify that is it align with the challenge setting or not. ", "q0r": 3, "q1": "The proposal doesn't have basic info that can help to assess its feasibility, it should provide some of these infos: \r\n- Detail roadmap - that will help everyone assess its implementation plan that is fittable with what it explains above about the activities or not. Their phases in the proposal are what they expect, so I assume that they're not a roadmap. \r\n- A budget breakdown that should reasonable with the roadmap it provides. \r\n- People that hold executive positions and better is the detail which task they will do\r\n- Some risks that can be met and how it can solve them. With this project, I think there is a lot of risk that relevant to government, society, event organization... \r\nThe proposal includes a good idea, good vision, good expectation, and motivation but for being funded, it should have the above detail. ", "q1r": 1, "q2": "For auditing the proposal, we need:\r\n- Detail roadmap and realistic timeline for running the project. It doesn't have any roadmap in the proposal - as I explain in the feasibility comment it is like their desired goals than a roadmap. \r\n- Key metrics that align with the challenge, will help Catalyst community know where you want to go. \r\nThe good thing this proposal has is the solution detail that includes the context and activities that will help and with a lot of successful images that the team expects. \r\nIt also includes some ways that can help to audit but I think it is additional, at least it must provide some basic above first. ", "q2r": 2, "assessor": "z_assessor_670", "no_vca": 15, "ne": 2, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Le développement sur les blockchains offre un nouveau départ pour gagner de l'argent et contribuer. Nous hébergerons un hub Cardano au sein de notre programme @ 1426.", "experience": "Entrepreneur, mentor, leader de la chaîne d'approvisionnement depuis 15 ans dans le classement Fortune 50.\nJe suis bénévole à Weld. Nous avons l'espace et nous aurons l'infrastructure."}