{"id": 383154, "author": "secretdecks", "title": "Catalyst Swarm & City Hub Playbooks", "url": "https://cardano.ideascale.com/a/dtd/383154-48088", "category": 26244, "amount": 45000, "description": "Catalyst Swarm vit dans l'espace virtuel, mais a besoin de premières expériences pour mettre en œuvre son réseau et son expérience dans des environnements réels.", "funded": 1, "upvotes": 37396300, "downvotes": 23264205, "votes_result": 14132095, "votes_cast": 115, "f6_no_assessments": 5, "f6_rating": 3.8666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": "Ce projet vise à faire d'une communauté existante, déjà virtuelle, une première communauté pilote dans le monde \"réel\". Ce faisant, des modèles et des manuels de jeu seront ensuite élaborés et pourront être utilisés pour déployer des communautés similaires dans différentes villes. L'impact en soi de cette proposition peut ne pas être important, simplement parce qu'elle est basée sur l'établissement d'une communauté avec relativement peu de personnes, mais elle servira de pilote et posera les bases pour commencer à construire une base de connaissances pour l'avenir. L'équipe déclare qu'elle devra soumettre une nouvelle proposition pour les défis futurs afin de donner de l'élan au projet. Dans l'ensemble, je suis d'accord avec l'affectation des fonds.\r\n", "q0r": 5, "q1": "L'équipe décrit les qualifications et l'expérience de chaque membre de l'équipe, chacun d'entre eux ayant une expérience considérable et une réputation au sein de la communauté Catalyst. Le plan de mise en œuvre est simple, et toutes les étapes que l'équipe entend franchir sont bien comprises. Cependant, en ce qui concerne le budget, bien qu'il existe une ventilation très précise des éléments qui le composent, le coût n'est pas associé à chaque élément. Par conséquent, il n'est pas possible d'évaluer avec précision la justification du montant demandé. Malgré l'absence d'une section sur les risques potentiels pour le succès de cette proposition, l'expérience accumulée par l'équipe me donne confiance dans la réussite de cette première phase.\r\n", "q1r": 4, "q2": "La feuille de route est très bien expliquée ; elle a été structurée pour trois mois, et il y aura des explications détaillées sur ce qui se passera dans chaque mois. Malgré le fait que les critères de réussite ne sont pas complètement décrits dans la proposition, sur la base de ma lecture de la proposition, je détecte deux livrables principaux, (1) former un groupe de 20 à 30 personnes à Berlin, et (2) créer un livre de jeu pour consolider toutes les bonnes pratiques pour la construction de communautés locales.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 25, "ne": 13, "ng": 11, "nfo": 1, "vca_o": 2}, {"q0": "Catalyst swarm est un concept réussi, le transposer dans le monde réel aurait vraiment de merveilleuses ramifications. L'essaim de catalyseurs avec des expériences réelles pourrait vraiment soutenir de nombreuses contributions faisant des merveilles pour l'écosystème Cardano. Avec le plan détaillé proposé ci-dessus, l'équipe a une confiance totale dans la proposition. Berlin étant le principal public cible, l'essaim pourrait facilement étendre son influence dans toutes les directions en Europe et finalement dans le monde entier. Grâce aux collaborations potentielles mentionnées dans la dernière partie de la proposition, il ne fait aucun doute que les nouveaux visages de l'écosystème recevront des conseils de qualité et seront soutenus dans leurs contributions au réseau. Les ateliers et les événements, en plus de la mise à disposition des playbooks à tous, vont sans aucun doute générer beaucoup de trafic confiant et talentueux dans le réseau.", "q0r": 5, "q1": "Avec un plan d'action bien présenté et des résultats raisonnables, les chances de succès de la proposition sont très élevées. De plus, avec les visages familiers de Felix et Dan, la communauté a très peu de doutes quant à l'expertise de l'équipe. Le plan budgétaire détaillé et le fonds très pratique rendent justice à la proposition. L'allusion de l'équipe à la possibilité de demander des fonds supplémentaires lors de tours ultérieurs montre la détermination et la passion à long terme de l'équipe. Après avoir fourni les justifications ci-dessus, je crois fermement que cette proposition est l'une des idées les plus remarquables du défi.", "q1r": 5, "q2": "Avec un manifeste aussi élaboré en main, il y a très peu de doutes sur la proposition. Il existe des indicateurs clairs que les auditeurs pourraient utiliser pour mesurer l'avancement du projet. La nature open-source des playbooks, les rencontres et événements communautaires constants, les discussions, l'augmentation du trafic réseau et les contributions, en particulier celles des partenaires de collaboration. Cependant, l'absence d'indicateurs quantitatifs de performance pour comprendre le nombre de nouveaux arrivants, le nombre d'utilisateurs actifs des services pourrait apporter un éclairage supplémentaire. Il est tout à fait compréhensible qu'étant toujours dans ses phases préliminaires et étant une proposition très centrée sur les personnes, de tels paramètres sont assez difficiles à définir. Mais un peu plus d'informations sur les mesures ferait de cette proposition une proposition complète à mon avis.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 19, "ne": 11, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "This idea in this proposal is a good one. Creating a local community  hub in Berlin is in complete sync with the challenge problem. The proposer has properly articulated how this proposal will add value to the cardano ecosystem. In fact the local community hub will attract people with different profiles who can join the cardano community and help build the ecosystem up. The proposer has mentioned eventual additional funding in fund 8. Based on all the information provided in this proposal, it can have a pretty good impact.\r\n", "q0r": 5, "q1": "This proposal has some pretty notorious names known in the cardano  community who are part of the team. Although I would suggest to the proposer to add linkedin profiles or other resources to back his claims, I can give them a pass given that Victor corcino who is a member of the team is very credible in the cardano community, specially for those involved as CA and VCA. I would also suggest to the proposer the add a budget breakdown of the 45000 requested. The proposer planned to add a budget breakdown in fund 8, but my question is how did they calculate the actual budget. Apart from that, the proposer has provided a timetable until april 2022 with all the details and expectations. The plan is laid out with as many details about the proposal. The only thing remaining is a successful execution which is likely to happen based on the information given in this proposal.", "q1r": 5, "q2": "This project is auditable for me as there is all the information necessary to track its progress. The roadmap provided in the proposal is filled with as many details as it needs to be. The milestones are also clearly stated and the desired results are outlined as well. Metrics and KPIs are also in place. The problem has been described clearly and the solution as well. Based on this information, I think that this project will be easily auditable.\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 16, "ne": 6, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "It was a pleasure to read your proposal. I think that your suggestion is not yet a bit of evidence or validation for your statements in this summary. will you be targeting individuals? like during the seminar, you just gave the main ideas in theory, but in reality, you haven't mentioned. Any problem has an idea to solve, but what I think you are What is missing is how do you prove to the community how your proposal has a strong impact on the community in the region and the world. Hope next time you will pay attention and add more.", "q0r": 2, "q1": "I believe the team makes claims without any specific evidence and documents to back up what you say in this proposal. about experience or any links to back up the experience claims. How about your strict? above all the concern is that you are requesting a capital of 45000 USD without showing us a clear funding sheet is it reasonable?. also you are missing the documents for community verification about your statements and the proposed team. You need to explain more clearly about the budget, the experience of the team clearly, the proposal will bring higher feasibility.", "q1r": 2, "q2": "The proposed team has come up with a specific roadmap in real time. But it has not provided enough information on how to use the specific capital, how much money to go to which item to implement this proposal. Whether the KPI is determined. The success of the project depends on what criteria? Hope you reply soon next time, as well as review the proposal and provide enough information and accompanying spirit to be appreciated by the community for the transparency of the proposal.", "q2r": 1, "assessor": "z_assessor_644", "no_vca": 18, "ne": 2, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This is a very helpful proposal, it builds up a Catalyst Swarm Community in Berlin, build bridges and presence of Cardano and Berlin entrepreneurs and startups, initiatives and movements. Simultaneously releasing a Playbook, it documents the ways that proposers maintain and grow the community.", "q0r": 4, "q1": "The team includes many members with extensive experience and knowledge, but how to verify that information, it is necessary to add the personal profiles of the people involved (linked in,... ). It is also necessary to provide links to previous projects (here the proponent mentioned Eastern Town Hall, Catalyst School but did not give a specific link).\r\nThe proponent only provides a short-term roadmap (3 months), but it is analyzed in detail. It defines specifically what to do in the first 3 months.\r\nAsking for a budget of $45,000, should make it more clear what book this money was used for. I see a description of the budget allocation in the proposal, but no specific value has been provided.", "q1r": 3, "q2": "The information provided is certainly not enough, but we can still judge its success. In addition to the content I mentioned in the previous section, the proponent also needs to have a success evaluation criterion (playbook hits,...), clearly defining difficulties-challenges as well as solutions. overcome.", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 19, "ne": 3, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "La création d'une communauté Catalyst Swarm à Berlin est une première étape pour générer des plans et des manuels de jeu sur la façon de créer des communautés urbaines.", "experience": "Proposants financés, conseillers communautaires et anciens conseillers communautaires, mentors et référents pour les propositions, membres de l'équipe du défi et ambassadeurs."}