{"id": 383417, "author": "carlhenryglobal", "title": "Cardano Worldwide Community Hubs", "url": "https://cardano.ideascale.com/a/dtd/383417-48088", "category": 26244, "amount": 9636, "description": "De nombreuses personnes dans le monde ont demandé des informations détaillées sur Cardano et Catalyst dans des langues autres que l'anglais...,", "funded": 2, "upvotes": 67721768, "downvotes": 3358357, "votes_result": 64363411, "votes_cast": 154, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=14046"], "media": [], "f6_assessments": [{"q0": "La proposition a une perspective mondiale par rapport à beaucoup d'autres idées soumises dans le cadre du défi. La population anglophone dans le monde ne représente qu'environ 20 % de la population mondiale. Exploiter les 80 % restants, qui ont certainement un grand potentiel, serait une tâche gigantesque. Cet énoncé de problème trouve une belle solution dans la proposition ci-dessus, où une plateforme multilingue est fournie en plusieurs langues pour que les personnes non anglophones puissent se familiariser avec Cardano et la blockchain. L'existence d'une version \"Beta\" de la même offre à la communauté une plus grande confiance. Cette proposition pourrait conduire à un plus grand nombre de contributions à la chaîne Cardano et, par conséquent, à son extension dans le monde entier. L'infusion de membres non-anglophones dans le réseau nécessite une attention immédiate et cette proposition semble faire l'affaire dans une large mesure. Cette plateforme pourrait réunir des entreprises et des développeurs, ce qui favoriserait un grand nombre de nouvelles collaborations et relations dans le monde entier.", "q0r": 5, "q1": "La proposition est accompagnée d'un plan d'action détaillé et la mise à disposition de la version \"Beta\" déjà disponible pourrait permettre à l'équipe d'obtenir la confiance nécessaire de la communauté. Les jalons et la définition de la réussite au bout de 3 et 6 mois ne semblent pas être surestimés, et l'on peut considérer que l'équipe réunie possède les compétences essentielles pour faire avancer cette proposition vers une destination fructueuse. Le fonds demandé semble également être juste et ne consomme pas une grande partie des fonds totaux, ce qui permet de financer beaucoup plus de propositions. La mention du besoin de fonds supplémentaires pendant le F8 montre que la proposition a des plans à long terme et qu'elle veut franchir des étapes, ce qui doit être salué.", "q1r": 5, "q2": "Aussi merveilleuse que soit cette initiative, les paramètres bien définis la rendent encore plus intrigante. L'auteur de la proposition mentionne clairement les indicateurs clés de performance mesurables tels que l'augmentation du nombre d'entreprises embarquées, l'augmentation du nombre de personnes ouvrant leur portefeuille ADA, le nombre de développeurs introduits dans l'écosystème. Ces mesures sont des indicateurs essentiels pour suivre l'acceptation de la plateforme et son impact. En outre, les indicateurs clés de performance à 6 mois, qui visent à intégrer plus de 1000 membres, plus de 60 hubs et bien d'autres encore, seront des indicateurs de succès clairs que les auditeurs devront prendre en compte. L'introduction d'un nouveau jeton 'GERO' scelle l'affaire. Par conséquent, les indicateurs clés de performance fournis sont nombreux et appropriés pour un suivi facile de la mise en œuvre et du succès global.", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 19, "ne": 13, "ng": 5, "nfo": 1, "vca_o": 2, "reply": "Dear CA 751, Thank you for reviewing our proposal, much appreciate. Best regards, Carl, Lisa & Dave"}, {"q0": "I agree that this proposal effectively addresses the challenge because it aims to build a huge hub with 60 languages translated for non-speaking English users. Its goal is to be the single resource for Cardano and Catalyst information delivered in a multilingual interface. ", "q0r": 5, "q1": "- Since the solution was written using AI to translate 60 languages, I can't find any specific AI technology will be used in the proposal. \r\n- $2000 for hiring people translate the website into 60 languages is practically low. \r\n- The proposal should give some more exposure of sources to collect information about Cardano/ Catalyst to translate from.\r\n", "q1r": 3, "q2": "Roadmap with milestones is the best part of this proposal since it's clear and detailed.\r\nKey metrics to measure success haven't been filled. \r\nKPIs after 6 months launching 60 language-hub with just 4 members/ hub is a humble figures. \r\nTherefore, I think the team should work more on the proposal. ", "q2r": 3, "assessor": "z_assessor_836", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1, "reply": "Hello CA 836, Thank you for reviewing our proposal, may I explain that the \"AI\" (Automatic Translations) work thoughout the website/platform. So the entire platform can be accessed by 60+ Language Speakers. The 60 human translated pages, will be single landing pages for each language, in the first phase we will only human translate 60 pages only. The sources of information are being published on the platform. Regarding the 6 month target, we believe it is better \"to under promise & over deliver\", best regards, Carl Henry"}, {"q0": "This proposal is extremely well presented and align with multiple aspects of the challenge: Increased participation from Technical, non-technical people individuals aswell as  companies/organised groups. The Beta version of the platform should be a great confidence builder for voters. Demonstrating a truly global platform with translation in multiple languages. The proposer has gone above an beyond what one would normally see from a prototype. ", "q0r": 5, "q1": "A relative modest budget ($9636) has been requested taken in context of the overall challenge fund ($350k) & compared to other proposals in this challenge. The commitment shown by the proposer to date develops trust and the very detailed budget breakdown look reasonable (I validated the translator costs and timelines against fiverr.com). Named resources have been identified although these are not verifiable, ideally the proposer could have added linkedin profiles to the budget lines. The proposal also provides a vision of the future , ie a DAO, supported by it own native token. This will be part of a Fund 8 proposal.\nI can see the hub becoming a great resource for non-technical individual and business. My only feedback to the proposer would be to put some focus on onboarding developers and understanding what they actually want or need from this service.", "q1r": 4, "q2": "The timelines provided are sensible (as described in feasibility note) therefore the auditability of the deliverables is straightforward, ie build the website with translation and pathways for the 3 target groups.\nMeasuring the value this service adds to the ecosystem could do with some further work. The proposal has a target of onboarding 1000+ new members in 6 months. This should be achievable based on the outreach the proposer seems to have. Breaking this down and providing targets for each of the 3 target groups would have made the metric more specific and the proposer could then have explained how they will market to each of these groups.    ", "q2r": 4, "assessor": "z_assessor_45", "no_vca": 22, "ne": 10, "ng": 12, "nfo": 0, "vca_o": 1}], "solution": "Nous avons construit une plateforme multilingue \"Beta\" dotée de multiples fonctionnalités avec IA et traductions en direct pour relier tous les hubs communautaires et Cardano.", "experience": "Le cadre est construit, & 20+ années de construction de sites Web d'entreprise en utilisant PHP, CSS, HTML, multimédia, AI, Diriger des équipes de jusqu'à 50 développeurs."}