{"id": 383730, "author": "danov.optela", "title": "Cardano Community Hub Bulgaria", "url": "https://cardano.ideascale.com/a/dtd/383730-48088", "category": 26244, "amount": 75000, "description": "Les communautés blockchain bulgares sont en phase initiale de développement et Cardano n'est pas encore très connu.\nconnu, pour l'instant.", "funded": 0, "upvotes": 17026975, "downvotes": 19849075, "votes_result": 2822100, "votes_cast": 100, "f6_no_assessments": 3, "f6_rating": 2.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "L'auteur de la proposition présente ses arguments en faveur de l'ouverture d'un nouveau hub en Bulgarie, l'un des principaux étant l'estimation du nombre de personnes activement impliquées, allant de 2500 qui assistent aux réunions à 180000 qui sont des observateurs (lorsque vous faites des déclarations de cette nature, je recommande d'inclure des liens vers des références pour les étayer). La proposition énumère plusieurs activités qui pourraient être menées au centre. Bien que je sois généralement d'accord avec l'alignement de cette proposition sur les objectifs du défi, aucune mesure d'impact n'est fournie. Bien que je sois généralement d'accord avec l'alignement de cette proposition sur l'objectif du défi, aucune mesure d'impact n'est malheureusement fournie qui me permettrait de faire une évaluation précise. Les aspects associés aux défis de mise à l'échelle que le projet pourrait rencontrer à l'avenir ne sont pas abordés.\r\n", "q0r": 4, "q1": "De manière positive, l'auteur identifie 8 types d'initiatives qui peuvent être mises en œuvre dans le hub, allant des cours au lobbying pour une législation favorable. Il ne fournit cependant pas suffisamment d'informations pour permettre une évaluation complète de la faisabilité du projet. Les recommandations suivantes devraient être prises en compte par l'auteur pour les prochains cycles de Catalyst. (1) Dresser la liste des membres de l'équipe de mise en œuvre de la proposition, en incluant une description de leurs compétences et de leur expérience, ainsi que des références permettant de vérifier les affirmations faites dans la proposition. (2) Identifiez et décrivez les dépenses spécifiques qui doivent être ventilées en postes identifiables, par exemple, les coûts de location du site, les coûts d'entretien du site, les salaires horaires estimés pour les personnes qui effectueront les tâches clés, le montant réservé aux professionnels de l'éducation, les conférenciers principaux, etc. (3) Incluez une section sur les risques qui identifie les risques potentiels pour le succès de la proposition et les contre-mesures pour éliminer ou réduire ces risques.\r\n", "q1r": 2, "q2": "Enfin, il n'a pas été possible d'identifier les données nécessaires pour évaluer l'auditabilité. Voici quelques recommandations que l'auteur devrait prendre en compte pour les futurs cycles Catalyst : créer une feuille de route expliquant les étapes à suivre pour que cette proposition soit un succès. Un calendrier devrait être fourni au moins tous les trois mois. En outre, il est essentiel d'établir des mesures de réussite et, idéalement, de les lier à des dates, par exemple, XX conférences seront organisées sur une période de XX mois ; XX nouveaux membres rejoindront la communauté grâce à leur participation aux événements du hub, etc. Ces informations sont essentielles pour que la communauté comprenne l'état d'avancement du projet et puisse comparer les informations réelles avec les informations prévues.\r\n", "q2r": 2, "assessor": "z_assessor_130", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The idea of this proposal is good and it identifies the problem within the challenge. The proposer wants to create a community hub in Bulgaria which will introduce many people to the cardano ecosystem. This will add value to the cardano ecosystem as many developers, entrepreneurs and other profiles enter the space and help build the community up. But although the idea is good, a lot of information is missing in this challenge. For instance, I think that this proposal doesn't include key metrics that the proposer should add to improve this proposal. I feel, nevertheless, that the proposer has made the effort with this proposal. I think that the proposer can greatly improve this proposal by providing informations such as a roadmap, milestones, and KPIs.\r\n", "q0r": 3, "q1": "This proposal doesn't include enough information to be audited successfully. It will be very difficult to track the progress of this project overtime as the proposer didn't include clear milestones nor a roadmap. There is also no evidence of the skills and experience stated by the proposer as the proposal doesn't contain a profile link or any other material about this. Furthermore, the proposal is missing a timetable which can be used to measure the completion of the work. By adding the missing informations, I think that this proposal can do really good in the future as it has successfully identified the problem in the challenge.\r\n", "q1r": 2, "q2": "The proposal doesn't contain a roadmap nor milestones. KPIs are also missing, which make the project hard to audit as there is no reference that helps track its progress. Although the description of the problem in this proposal is understandable, the execution of it is the missing part. I suggest to the proposer to add these missing pieces and better structure the proposal in order to increase  its chances of being funded in the future.\r\n", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 17, "ne": 3, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The idea is good. The team point out the opportunity to bring Cardano enter a new and promising market. However the idea is still in high-level stage, which not include any detail break-down that ensure their action in transform the good idea into realistic project.", "q0r": 4, "q1": "The proposal says the team has wide experience with IT education, development of blockchain applications, online platforms and tourism but it's just saying, not detailed explain who are they, what they did that bring experience on the table. The plan need to have detail timeline/ milestone and KPI to measure the success. The proposal  doesn't include explaination for what 75000 ADA will be used for.\r\n", "q1r": 1, "q2": "There is no metric to measure is mentioned or milestone/ phases to audit the progress.", "q2r": 1, "assessor": "z_assessor_809", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}], "solution": "Création d'un Hub communautaire local en Bulgarie pour la diffusion et l'éducation de l'écosystème Cardano,\nen collaboration avec des nomades numériques.", "experience": "Notre équipe a une grande expérience de l'enseignement informatique, du développement d'applications blockchain, de plateformes en ligne.\nen ligne et le tourisme."}