{"id": 383975, "author": "profd2004", "title": "Cardano Blockchain Lab in Kenya", "url": "https://cardano.ideascale.com/a/dtd/383975-48088", "category": 26244, "amount": 38255, "description": "Bien que le Kenya soit à la pointe des innovations technologiques dans la région, Cardano est encore peu connu du public et des développeurs.", "funded": 2, "upvotes": 106120920, "downvotes": 2583699, "votes_result": 103537221, "votes_cast": 247, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Le problème identifié dans cette proposition est conforme aux attentes du défi. Keyan est un pays d'Afrique où l'adoption globale de la technologie blockchain doit se produire afin d'aider la communauté locale à résoudre certains des problèmes majeurs auxquels elle est confrontée. La création d'un hub pour encadrer les développeurs ajoutera beaucoup de valeur à la communauté locale ainsi qu'à l'écosystème Cardano. L'objectif final devrait être que ces développeurs soient en mesure de créer des dapps dans l'écosystème cardano, qui résoudront les problèmes auxquels les Africains sont actuellement confrontés. En outre, le proposant a ajouté des mesures clés qui correspondent parfaitement au défi. Je n'ai pas identifié de plan de mise à l'échelle pour les défis futurs, mais à mon avis, il peut y avoir au moins 2 façons de mettre à l'échelle cette proposition - l'une étant de reproduire le même hub dans d'autres parties du pays, l'autre étant d'agrandir le hub existant. (Note 5)", "q0r": 5, "q1": "Le proposant a mentionné avoir de l'expérience dans le développement et dans la technologie blockchain, mais n'a pas fourni de preuves telles qu'un profil linkedin ou même un travail précédent à cet égard. Je suggère au proposant d'ajouter ces informations car elles sont vraiment importantes pour juger de la faisabilité du projet. En dehors de cela, le budget a été ventilé en éléments identifiables. Tous les éléments nécessaires à la réalisation de ce projet ont été décrits, mais je ne suis pas en mesure de savoir si les prix indiqués sont corrects. Mais, sur la base de ma seule intuition, je pense que les prix sont corrects. En outre, un calendrier a été fourni par le proposant. Mais je n'ai pas identifié, dans cette proposition, un plan au cas où un financement supplémentaire serait nécessaire. Je suggère au proposant de garder cela à l'esprit car il est plus que probable que le budget ne sera jamais exactement précis. Dans l'ensemble, je suis convaincu, sur la base des informations décrites dans cette proposition, que le projet peut être mis en œuvre avec succès (note 4).\r\n", "q1r": 4, "q2": "Cette proposition a une forte probabilité d'être auditée sur la base des informations fournies par le proposant. La proposition comprend une feuille de route et des étapes raisonnables. Les étapes peuvent être suivies dans 3 mois, 6 mois et 9 mois. La communauté a reçu tous les détails, y compris les indicateurs clés de performance, afin de suivre l'évolution de cette proposition. Dans l'ensemble, je peux dire que le problème exposé dans cette proposition a été décrit clairement et la solution également. (Note 5)\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 19, "ne": 10, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "Impact :\r\n\r\nL'énoncé du problème :\r\nLe Kenya est à la pointe de l'innovation technologique, mais Cardano reste largement inconnu du public et des développeurs de la région.\r\nPour résoudre ce problème, le proposant a élaboré un plan visant à introduire un Cardano Blockchain Lab au Kenya.  Cette initiative vise à remédier à la méconnaissance de Cardano au Kenya et permettra à notre écosystème d'être à l'avant-garde de la reconnaissance technologique dans la région.\r\nLe plan prévoit de travailler avec des organisations non gouvernementales performantes pour former des équipes de jeunes professionnels kényans axées sur l'écosystème Cardano.  \r\nInformations démographiques :\r\nLe projet vise à accueillir de nouveaux développeurs, à traduire le contenu de Cardano en swahili et à mener des travaux de développement de blockchain hébergés par lidonation.com, un pool de parties prenantes basé sur Cardano (LIDO) et un site Web d'introduction.\r\nCe projet vise à favoriser l'adoption au niveau de la base grâce à un plan solide de sensibilisation de la communauté et à l'intégration active et bénéfique de plusieurs diplômés récents.\r\nUn plan d'action :\r\nLe plan des proposants commence par l'acquisition d'ordinateurs utilisés exclusivement pour exécuter Cardano et faciliter le mentorat, le travail des développeurs et la formation.  Avec le lancement du programme de mentorat, l'équipe prévoit ensuite de mettre en place des réunions mensuelles dirigées par deux responsables de la sensibilisation de la communauté, qui organiseront également des heures de bureau et participeront à la création de canaux Cardano en swahili sur les plateformes de médias sociaux.\r\nUne partie du plan consiste à faire en sorte que le laboratoire devienne autonome en trouvant des moyens d'exploiter l'écosystème Cardano et ses opportunités.  Les pistes explorées sont les suivantes\r\n1. les dons des anciens élèves\r\n2. la mise en place d'un pool d'actionnaires\r\nCette proposition relève le défi de la mise à l'échelle des centres communautaires de Cardano en utilisant une innovation audacieuse combinée à une planification concrète pour atteindre la mission qu'elle s'est fixée. Je suis tout à fait d'accord que cette proposition relève efficacement le défi :  SCORE D'ÉVALUATION 5.\r\n", "q0r": 5, "q1": "Faisabilité :\r\nLe proposant de cette évaluation utilise un plan solide et une connaissance régionale experte pour communiquer une vision de la réussite de ce projet.  \r\nIndicateurs clés de performance (ICP) :\r\nLe projet est déjà en cours et en cas de succès.  Le lancement du Hub dans les 6 prochains mois sera le premier de son genre au Kenya. 5 développeurs sont déjà prêts à faire partie du programme de mentorat.  Une fois que les développeurs actuels seront formés, ils passeront à la gestion du laboratoire.\r\nCe projet bénéficie du soutien de Friends of Ngong Road (FONR), un organisme américain à but non lucratif qui collecte des fonds pour le NRCF et la Ngong Road Children's Foundation.  NCRF est une ONG basée au Kenya qui offre des possibilités d'éducation de qualité aux enfants touchés par le VIH/SIDA qui vivent dans les bidonvilles de Dangoretti à Nairobi, au Kenya.  \r\nKaribu Techmates est un programme parrainé par la NRCF pour aider les récents diplômés de l'université ayant des compétences techniques à accéder à des formations et à des opportunités d'emploi. Le nouveau centre d'études Elimu Hub offre des possibilités d'apprentissage et d'emploi dans l'économie en ligne.  Ce projet s'efforce de devenir un partenaire stratégique dans cette entreprise en développant une forte activité de sensibilisation et de développement de la communauté Cardano.\r\nCette proposition pourrait bénéficier d'une exposition à l'importante base de donateurs du FONR/NCRF, augmentant ainsi la portée globale du projet.  Ces ONG bien établies apportent la crédibilité nécessaire à ce projet.\r\nUne feuille de route :\r\nL'objectif à 3 mois est de disposer de 5 postes de travail dédiés, de 2 développeurs stagiaires et de 2 responsables de la sensibilisation de la communauté qui auront organisé leur premier événement communautaire et qui sont prêts à continuer avec des événements mensuels.\r\nL'objectif à 6 mois est que la première cohorte de développeurs obtienne son diplôme et que la deuxième cohorte commence à organiser des événements communautaires chaque mois et à rendre compte à la communauté Catalyst de la participation et des réactions aux événements.\r\nL'objectif à 9 mois prévoit que les anciens mentorés dirigent des programmes de mentorat de développeurs en cours avec le laboratoire engagé dans la communauté Catalyst.  Cela permettrait également de créer des opportunités de nouveaux partenariats et de financement pour la maintenance continue à ce stade.   \r\nCompétences requises pour mener à bien le projet :\r\nLes principales personnes derrière ce projet sont :\r\nDarlington Wleh - un ingénieur Dev/Ops avec 3 ans d'expérience qui est décrit comme ayant une compréhension approfondie des technologies cloud, des langages de programmation informatique et des technologies blockchain. Son profil est vérifiable via LinkedIn.\r\n\r\nStephanie King n'a pas de profil professionnel, il est donc difficile de savoir si elle possède les compétences, l'expertise ou les antécédents nécessaires pour atteindre l'objectif de l'État.\r\nLa ventilation du budget :\r\nLa ventilation du budget pour ce projet est détaillée et très bien expliquée. Il décrit les coûts pour :\r\n1. les mentorés développeurs\r\n2. les postes informatiques\r\n3. le site Web du laboratoire\r\n4. le directeur du mentorat\r\n5. la sensibilisation de la communauté\r\n6. espace de bureau, fournitures, marketing, organisation d'événements. 7.\r\nCoordinateur et administration du Cardano Hub\r\n8. utilisation d'Internet\r\n9. électricité.\r\nCette ventilation des coûts est complète et se prête très bien à l'établissement de la transparence et de la crédibilité auprès de la communauté Cardano. Je conviens qu'étant donné l'expérience et le plan présentés, il est très probable que cette proposition soit mise en œuvre.  SCORE D'ÉVALUATION 5\r\n", "q1r": 5, "q2": "Auditabilité :\r\nComme ce projet en est encore à ses débuts, les indicateurs clés de performance n'ont pas encore été entièrement développés. Cependant, il y a suffisamment d'informations entre la feuille de route et la ventilation détaillée du budget pour suivre le succès de ce projet en utilisant ces deux documents pour suivre avec précision la progression du programme. Le programme utilise :\r\n- Des développeurs mentorés - 4 500 $ Les stagiaires du programme de mentorat des développeurs sont payés 250 $/mois pour un engagement de 30 heures/semaine.\r\n- Stations informatiques - 11 000 $ 3 nouvelles stations de travail de développeur avec la capacité d'exécuter toutes les pièces architecturales de cardano : db-sync, un nœud, un serveur graphQL, ogmios, hasura, un backend de portefeuille et le backend d'application plutus.\r\n- Site Web pour le laboratoire - 360 $ Cette somme couvrira les frais de création d'un nouveau site Web pour le Ngong Road Cardano Lab à Nairobi, au Kenya, et l'hébergement du site pendant un an.\r\n- Directeur du mentorat - 6 000 $ Darlington dirige le programme de mentorat et consacre 5 heures par semaine à l'encadrement des mentorés dans le cadre du programme, y compris une session de programmation en binôme de 3 heures. Darlington est déjà le mentor de deux jeunes diplômés. Il a également permis à trois étudiants d'obtenir des postes d'ingénieur logiciel à plein temps chez Yelp, electricbikereview.com et le Colorado Department of Game and Fishing (ils sont tous toujours employés par ces organisations).\r\nÉvénements communautaires et sensibilisation\r\n- Sensibilisation de la communauté - 6 000 $ Permet de payer 2 agents de sensibilisation de la communauté au Kenya, plus le soutien du coordinateur de l'équipe de la nation Lido. Nous planifierons et accueillerons des réunions mensuelles, des heures de bureau avec les membres de la communauté qui s'intéressent à Cardano, et participerons à des plateformes sociales pour aider à créer et à développer des canaux de contenu kenyan/swahili pour Cardano.\r\n- Fournitures de bureau, location d'espace, facilitation du marketing, hébergement d'événements - 2750 $ couvrent les abonnements à Zoom et MailChimp, le mobilier et les fournitures de bureau, et les rafraîchissements pour les événements mensuels.\r\nServices publics et administration\r\n- Coordinateur et administration du Cardano HUB - 3 200 $ Permet au personnel du Lido Nation et du Elimu Hub d'embaucher du personnel, de coordonner les objectifs, de planifier les futures sources de revenus pour soutenir le laboratoire au-delà des 9 mois de lancement.\r\n- Internet - $4033.00 Ce montant couvre 60% du coût de l'internet pour l'installation pendant 9 mois. Obtenir un bon Internet au Kenya est un défi et coûteux ; être en mesure d'aider NRCF à ce sujet est essentiel pour atteindre cette région avec des outils blockchain !\r\n- Électricité - 412,00 $ Ce montant couvrirait 50 % de la facture d'électricité de l'installation pendant 9 mois. Le nouveau centre Elimu est construit pour fonctionner à l'énergie solaire !\r\n- Je conviens que les informations fournies sont suffisantes pour vérifier les progrès et le succès de la proposition. SCORE D'ÉVALUATION 4\r\n", "q2r": 4, "assessor": "z_assessor_479", "no_vca": 15, "ne": 9, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Il s'agit d'un projet vraiment incroyable qui vise à renforcer la communauté locale au Kenya grâce à un partenariat avec un centre communautaire bien établi - Elimu Hub. Le principe de ce projet est de fournir les ressources physiques et l'éducation nécessaires pour enseigner Cardano à la communauté locale et la sensibiliser à Cardano dans un environnement sûr et stimulant.\r\n\r\n\r\nL'équipe a une grande expérience et est déjà engagée dans la traduction en swahili de Cardano. Elle encadrera 5 nouveaux développeurs Cardano et présentera l'écosystème Cardano à de nombreuses personnes par le biais d'événements et d'ateliers communautaires. Le projet se concentre localement dans une zone pauvre du Kenya, l'extensibilité de ce projet pourrait être possible par la mise en œuvre de modèles et de partenariats similaires dans d'autres espaces communautaires de bidonvilles à travers le monde. Pour ce faire, il faudrait disposer d'une excellente documentation pour réaliser une étude de cas sur l'impact de ce projet.", "q0r": 5, "q1": "Le centre communautaire avec lequel l'équipe du projet est en partenariat est basé dans cette zone depuis 2003 et a développé une vision à long terme de la manière dont il pourrait bénéficier aux enfants et aux jeunes de cette zone par le biais de l'éducation et, en fait, en leur donnant de l'espoir pour l'avenir.\r\n\r\nL'équipe a un plan détaillé pour compléter le centre éducatif existant et bénéficiera du soutien d'une équipe spécialisée ayant une expérience de Cardano. Le plan d'exécution de ce projet est également très solide, avec un budget pour payer la participation du mentorat, ce qui éliminera des obstacles importants pour les jeunes participants dans ce domaine et, en outre, les motivera et les éduquera pour qu'ils contribuent autant qu'ils le peuvent au programme en termes de temps et d'énergie.\r\n\r\nLe calendrier, le budget et l'ensemble du programme sont très clairement exposés et ont beaucoup de sens compte tenu du contexte dans lequel l'équipe travaille. Il prévoit des ressources physiques, un accès stable à Internet et un soutien pour la sensibilisation de la communauté et les fournitures de base.", "q1r": 5, "q2": "Il s'agit sans aucun doute d'un projet qui pourrait être amélioré par un profilage continu dans le cadre des réunions de l'hôtel de ville afin d'aider à la livraison et de s'assurer que le projet reste sur la bonne voie. A ce stade, il y a très peu d'indications dans la proposition concernant la façon dont ils rendraient compte, cependant il semble y avoir un grand intérêt pour Cardano et cela présenterait des opportunités pour échanger des idées et inspirer plus de projets changeant la vie comme celui-ci à travers le monde. Les indicateurs clés de performance et les jalons sont clairs et mesurables. Les dates de livraison ne sont pas spécifiques, mais il s'agit de jalons temporels pour permettre le démarrage du projet en fonction du résultat du financement et probablement d'une myriade d'autres considérations pour l'exécution d'un projet de cette nature.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 14, "ne": 11, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "I think this proposal effectively addresses the challenge since it wants to create a hub/ lab in a NGO (Ngong Road) in Kenya to introduces and educate graduated students of this NGO about Cardano/ blockchain. Target community is good since fresh graduates are sensitive about technology. They can form a hub and sharing information with others.  ", "q0r": 5, "q1": "Timeline, budget, team, resources are all fine.\r\nThe only thing that makes me concern is the sustainability of the lab since it asks to be invested facilities ($11k for computer stations) but I don't see how to generate the lab's own money to continue operating after 9 months being funded. ", "q1r": 4, "q2": "Roadmap with milestones is clear. I advice team to add KPIs to the proposal, for example: number of people joining offline meet-ups, numbers of engagement Swahili social channels, people attracted to Cardano via the lab, etc.", "q2r": 4, "assessor": "z_assessor_836", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "Extension du centre étudiant de la communauté des ONG pour ajouter un laboratoire Cardano Blockchain avec des ordinateurs dédiés, un mentorat pour les développeurs et une formation communautaire.", "experience": "14+ Yrs Software & Cloud Engring, Blockchain développement, conseil en affaires, les langues du monde, la rédaction technique, l'enseignement, mentorat 3 ft ."}