{"id": 384796, "author": "gelila", "title": "Growing Cardano in Ethiopia", "url": "https://cardano.ideascale.com/a/dtd/384796-48088", "category": 26244, "amount": 33780, "description": "Cardano est encore largement inconnu parmi les plus de 110 millions d'habitants de l'Éthiopie ; un marché important et non pénétré a le potentiel de développer l'écosystème de Cardano.", "funded": 1, "upvotes": 33378197, "downvotes": 15723305, "votes_result": 17654892, "votes_cast": 149, "f6_no_assessments": 5, "f6_rating": 4.200000000000001, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem stated in this proposal is common to most of the African countries. There is a lack of awareness of blockchain technology. The proposer has identified the problem clearly and the solution proposed can have a positive impact on the cardano ecosystem, if executed properly. The cardano ecosystem has a lot to gain from the African countries (Ethiopia in this case), where the majority of the population is young and looking for opportunities. I would suggest to the proposer to be clear from the start about what they are trying to build. This can help improve the proposal. Furthermore, I would advise them to focus on one thing at the time as wanting to create a website plus a youtube channel at the same time can be a load of work too heavy if the team is not big enough. Apart from that, the key metrics and goal of this proposal align perfectly with the challenge. And if they manage to pull this off, I don't see any issue with scaling, as it is just a matter of adding more content to the website and youtube channel. (Rating 4)\r\n", "q0r": 4, "q1": "The team has provided links to their linkedin profiles. After a brief study, I can identify that they have all the tools needed to carry out the project successfully. Being in the digital marketing field myself for a decade, I've learnt to identify profiles in that space. From my understanding, the core team is formed by 2 people. The majority of the workload, meaning writing articles, editing videos and more are going to be outsourced. I think that this is a great model as there are many talents out there working as freelancers who can do the work. Also, it's a model that allows small teams with limited budgets to not have to hire workers for full time positions, which can end up being too expensive. The budget has been broken down, but I have to admit that it is not easy to understand. I will suggest to the proposer to make a better breakdown of the budget. For instance, instead of the hourly rate, I would go for a task completion rate instead. For example I would calculate the price of an article or video production, and go from there. The other missing piece that I've identified is that the proposer didn't mention any challenge or risks upon a successful implementation. Apart from that, the proposers have clearly stated what is being built and how they will achieve it. (Rating 5)", "q1r": 5, "q2": "The proposers have managed to provide a detailed roadmap with reasonable milestones. My concern is that most of these milestones are not measured in users' acquisition terms. For instance I would want to know how much traffic they expect to receive on the website and on the youtube channel. The only fact of publishing content doesn't guarantee traffic. However, I have noticed that the social media milestones are measured in the number of users they will acquire. That is a positive sign to me. Besides, I think that, from the informations provided by the proposers, the project is very auditable. The description of the problem is clear and the description of the solution is clear as well. (Rating 5)\r\n", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 15, "ne": 6, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "I strongly adgree because having multimedia platform which will bridge a cultural understanding/awareness of Cardano in Ethiopia adresses the above challenge and falling in scope of the problem.\r\n key metrics of the proposer is stated clearly and goals of the proposal falls in scope of the challenge..\r\n\r\nproposer is also scale up to address future challengies in ethiopia because there is an immense potential for cardano to grow in Ethiopia,", "q0r": 5, "q1": "Strongly agree because \r\n1. the proposer has provided much and good details, links,references etc of relevant skills and experiences needed to implement the proposal.\r\n\r\n2. Budget are been laid down on how to carry on the project if funded and breaken down into identifiable items and reasonable to achieve the set goals .\r\n \r\n The proposal has also describe the necessary resource to implement the proposal if funded..", "q1r": 5, "q2": "Strongly agreed bacause...\r\n  there are laid down road maps and accurate detailed enought to audit every single step of the proposal if funded.\r\n\r\nThere is clearly understanderble describtion of the targeted problem and clearly understanderble solution to address the problem on helping ethiopia as a country to have enought knowledge about blockchain and have contency plan in place for various outcomes\r\n ", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 23, "ne": 1, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": "With the passage of time and experiences of its application in different countries with different cultures, different languages, engaging local communities through the simple dissemination of information has proven to be of low effectiveness.  Mainly because there is no specific social problem that it is helping to solve (education through internet access, microfinance through feature phones, etc).  There is no community on center stage fighting a problem while right behind the scenes (not elsewhere) Cardano may be offering its firepower (technical, economic, human) in support of that community and its battle. \r\n\r\nThis proposal, being based on the simple dissemination of information, I consider that it does not present a solid strategy for engaging local communities.  In other words: not my opinion.  This dissemination exercise has already been done repeatedly and the results are less and less attractive.  ", "q0r": 2, "q1": "Items in the budget are still discriminated in a very general way, for a proposal seeking about 10% of the total campaign budget. ", "q1r": 3, "q2": "There are no KPIs to measure the development of the proposal.", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 18, "ne": 0, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "This proposal could explain what the problem in this challenge are and how to address it. They explain how the potential of unpenetrated market of 110 million in Ethiopia is huge, considering 75% of the population is under the age of 30 year old and the increasingly widespread availability and use of internet and technology. They propose a solution to create a media platform namely Spotlight Ethio to help people onboard and bring awareness to Ethiopian people about the Cardano ecosystem. Since there aren't any other multimedia platform in Ethiopia that intersects Cardano and widespread media content delivery, this will bring huge impact towards adoption rate in the country.", "q0r": 5, "q1": "Having an already well established Instagram account with just under 5000 followers, we can see that they have the capability and resource needed to continue and work for this proposal. Their team also have the experience needed for this proposal to succeed. The budget also clearly well explained and broken down into more details, from salary for each role, hours worked, target articles / content / media, etc.  They also have a realistic timetable and achievable set of goals for each months, such as the number of podcast episode, interviews, articles, etc. However, they didn't elaborate further on how to do these things in detail. For example: where will the podcast be uploaded? Youtube? Spotify? (Although it will likely on Youtube, but still it would be more helpful if they could specify and explain it). Since they have magazine, newsletter, and interviews, what are the platform used to share these? They have a website but as I'm writing this it is not yet available. For magazine, is it a form of hard-copy, or a digital one? (Because the technology adoption is still in progress, and not all Ethiopian have laptops or computer). All in all, this is a feasible and achievable proposal to be implemented successfully. Just a shy away from 5 star because the lack of implementation details like I've mentioned.", "q1r": 4, "q2": "This is a straight forward proposal that will utilize social media platform to engage with its community. The audit process will be easy and transparent, as the result will be publicly available. The metrics and KPIs are well defined, and further prove that the proposer understand the solution's goal. Therefore, regarding auditability, the progress can be tracked easily and transparent.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 18, "ne": 8, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The proposal accurately addresses the challenge through the creation of both a physical and Digital community hub in Ethiopia. The KPIs and goals allign well with the selected challenge.", "q0r": 5, "q1": "The team is listed with external links and appears to have the requisite knowledge to perform the tasks and see the success of the proposal. The funds requested are concisely broken down. The time frame is realistic and actionable therefore I strongly agree with the feasibility of the proposal.", "q1r": 5, "q2": "The roadmap is well defined for the next 6 months with measurable targets. As a large amount of the budget is allocated towards video content it would be nice to see specific KPIs that reference how succesfull these videos are eg, views.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Construire une plateforme multimédia qui permettra une compréhension culturelle de Cardano en Éthiopie.", "experience": "Une plateforme médiatique établie qui met en avant la technologie, les start-ups/entrepreneurship, la politique économique et les opportunités d'investissement en Éthiopie."}