{"id": 384301, "author": "njsteele", "title": "Corruption discovery + remediation", "url": "https://cardano.ideascale.com/a/dtd/384301-48088", "category": 26249, "amount": 62046, "description": "Corruption is the most destructive force in government. It can break new and developing governments despite all other efforts.", "funded": 1, "upvotes": 59968851, "downvotes": 4928753, "votes_result": 55040098, "votes_cast": 152, "f6_no_assessments": 5, "f6_rating": 3.8, "videos": [], "media": [], "f6_assessments": [{"q0": "The submitted proposal is directed towards eradicating one of the biggest problems that hinder the prosperity of any country which is corruption. The proposed solution of developing a decentralized platform for anonymous flagging on corruption is one of a kind. Also, the team proposes to involve a lot of local entities and volunteers through campaigns and events which will certainly make the Cardano popular amongst the crowd and also increase the resilience of the ecosystem. However, the manifesto makes no mention of the demographics it plans to target or how the team proposes to mitigate the corruption on successful flagging by the users. Since the plan includes the fact to make the application independent of government authorities, the credibility of the application increases amongst the people. Thus, I would score the impact 4 out of 5 as some finer details of how effective the application can be and how the team plans to leverage the Cardano chain are missing. ", "q0r": 4, "q1": "The team has already done a fair amount of work in the direction of the proposed solution and also provides the community with their detailed budget breakdown and also their definition of success. However, the proposal lacks information in other sections. The proposal fails to provide the flavour of the team which would work on this and the experience they would bring along. In spite of mentioning that the application will be developed, the proposal includes no technical details about the same. The milestones even though looks practical in nature, the proposer has failed to mention the challenges that lie in their path and how they plan to mitigate them.\r\nApart from the quarterly success definition, there is no other step-by-step detailed game plan available for the readers. With all these facts, I believe a moderate amount of detailing is required to gain the trust of the community to fund their venture.", "q1r": 3, "q2": "I believe that there is not enough information available for the auditors to make conclusive derivations regarding the success of the proposal. The proposer initially plans to develop the application without leveraging the Cardano chain and has plans of moving to the ecosystem only after 6 months. The missing target audience details and metrics make the proposal even more incomplete in nature. The proposer even though has extensive expertise in the idea he proposes, the missing team details make the proposal less credible. No distinct KPI is available for the auditors to track how many users register on the Dapp and transaction volumes and how effectively the application is received and utilized which is one of the primary criteria of the campaign. Even though it's quite understandable that the idea is still in its preliminary stages, a little more specifications about the proposed application and the figures to track its usage and success will help the audit easily and also help the community to track its effectiveness.", "q2r": 3, "assessor": "z_assessor_751", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of discovering corruption in organizations and governments by an application facilitating anonymous crowd-source organized campaigns which partially aligns with the challenge goal but is not a foundational registry solution listed in the challenge.\r\nThe proposal does a good job of articulating the value to Cardano and articulating how the solution scales to address future challenges.\r\nThe proposal could be improved by providing key metrics and goals that more closely align with the challenge and either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of experience (linkedin profile in the comments section), team composition, budget is broken down and reasonable, additional funding plan, realistic timetable and plan, resources required, \r\nThe proposal's feasibility could be improved by a more detailed technical explanation of the solution and including a challenges and risks section. The $9K budget to have grant writers submit a grant request seems like it might be a potentially questionable use of Cardano funds for some community voters.", "q1r": 4, "q2": "The proposal includes a roadmap, milestones, time horizon,, clear understandable description of the targeted problem, and a clear understandable solution that addresses the problem.\r\nTo improve the proposal include metrics/KPIs to measure proposal success.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "The proposal does not effectively address the challenge, while coordinating anti-corruption activities are laudable and important, they are not the stated goal and intent of the Brief: \"Dapp proposals should cover foundational Registry solutions, namely:\r\n\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"", "q0r": 2, "q1": "The proposer is competent and has a good handle on the material. The proposer is affiliated with a top US university. Go Owls!", "q1r": 4, "q2": "Success is described, KPIs, milestones, action plans, roadmap are aligned, \r\nspecific, measurable, auditable, and time fenced, therefore the information is sufficient to audit success and progress towards it.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 16, "ne": 0, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "Great idea and detailed proposal. I did love to see that the proposal commences from a specific region. I think this is great and addresses the challenge. This would generate more community engagement and the name and shame component would tackle corruption.", "q0r": 5, "q1": "Excellent to experience. I like the commitment of the team lead. This Dapp is practical and the NGOs set up to secure funding would help the longevity of the idea. ", "q1r": 5, "q2": "Detailed but breakdown. The proposal has shown commitment to transparency and openness. The Dapp and its campaigns are people-driven. This is great.", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "735 / 5000\r\nResultados de traducción\r\nThis proposal impacts the center of the challenge, working on the most complex problem that exists in the construction of nations. The thing that destroys them: Corruption. One of the clearest reasons to explain the problem of poverty. In this way it raises a problem that clearly must be solved. It is also clearly observed how this proposal would add value to the Cardano ecosystem, since it is an instrument in all aspects of the proposal. Work, smart contracts, identity secrecy, protection among other relevant aspects. I have the feeling that you could have given us more information. Perhaps more work needs to be done on the challenge metrics to ensure its total adequacy. ", "q0r": 4, "q1": "The proposal is interesting and important, however the most difficult thing is its implementation. I am Latin American and I know first-hand the problems of corruption. In this regard, I consider that the proponent did not provide sufficient evidence of his abilities to implement the proposal, apart from being a very relevant academic project at a prestigious university. Iguylamente is not clear the team that will develop the proposal, because there are some external payments that are not clear in its development. Although there are identifiable elements in the budget, this aspect could be improved. The budget is reasonable to complete the work, however it would be good to have the best-developed profiles that allow them to be supported. The timetable is a bit optimistic, however it is achievable if properly incorporated into the university's programs. By the way, it is not clear what role university students will play. I think the proponent could have shown more about the project and maybe reserved. The technical processes must be explained more thoroughly, especially because of their cost.", "q1r": 3, "q2": "This is a roadmap for achievement, but for a technical process it is necessary to strengthen it. The metrics could have been strengthened to more clearly define the success of the proposal. On the other hand, if there is a clear and understandable description of the objective problem and it is adequately addressed, perhaps we expect more information given the academic origin of the proposal.", "q2r": 3, "assessor": "z_assessor_778", "no_vca": 14, "ne": 5, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Allow anonymous flagging, electing, organizing and directing of campaigns to root out corruption through crowd-sourced organized tasks.", "experience": "Director of technology at Temple U's Ctr. for public health and law research, working with UN and other universities on policy & corruption."}