{"id": 384773, "author": "dcspark", "title": "Nation-ready scalability research", "url": "https://cardano.ideascale.com/a/dtd/384773-48088", "category": 26249, "amount": 75000, "description": "For nations to adopt blockchain, we need to achieve scalability at a nation scale", "funded": 2, "upvotes": 179605121, "downvotes": 15430995, "votes_result": 164174126, "votes_cast": 360, "f6_no_assessments": 6, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "I am all for timely solutions to big problems. Catalyst has had a lot of small, piecemeal projects and solutions - but we also need some heavy-duty long-term solutions for big issues that are looming on the horizon. The issue of scalability is on eof the key blockchain challenge and the dcSpark team has been spreading the message consistently and clearly about the challenges that are coming around the corner for Cardano blockchain in terms of the number of transcations that the blockchain can process. We are approaching current limits (of course, parameter tweaks can improve this temporarily) - however, nation-wide adoption means that there is no possibility to put entire nations on \"hold\" until we find solutions that will address a much higher number of transactions. I see this proposal as fully aligned with the challenge Nation-building Dapps as Dapp solutions cannot function without a network that can support them. A network that can scale to a much higher number of trnasactions will automatically allow for the smooth and unimpeded development of multiple Dapps that will lead to an increase in the number of Dapp users, registry accounts, transaction volumes. Someone might look at the Challenge and question whether this proposal fits. I don't - as we have to see the forest for the trees. There is no world in which we can develop 100 new Dapps for nations, but the underlying blockchain is not able to process smotthly those transactions. As the proposers state: For nations to adopt blockchain, we need to achieve scalability at a nation scale. This is what this proposal want to deliver through the proposed scalability solution called \"naive rollups\" or sometimes called \"lazy rollups\". Hydra is some time away still and will not be able to singlehandedly deal with the entire issue of scaleability. Furthermore, a new scaleability solution will help with the decentralization of fundamental research needed for the Cardano ecosystem. I see this proposal as a win-win-win for the system. \r\n", "q0r": 5, "q1": "I think that the dcSpark team could benefit from following more closely the precise instructions for submitting proposals in Ideascale. It might be a pain in the neck, but attention to detail is the hallmark of good work. The challenges require a definition of success after 3, 6 and 12 months, and I do not see it in this proposal. Maybe the team could have included as deliverables a monthly update (blog post, video update, etc... ) on how the research is going. The idea is great and I like that the deliverables have been defined (1. Writeup of a more rigorous analysis of naive rollups and 2. Feasibility of rollups on UTXO-based chains (Cardano) and accounting-style chains (such as the sidechain of Cardano called Milkomeda)). However, it seems to me that some more effort could have been put into making commitments to keep the community updated about the research and the findings - as the research progresses. I think that the entire community is excited about scalability breakthroughs and dcSpark - if necessary - could even increase the budget to include a marketing person for planned regular videos about the findings ... as the research goes forward. As it stands now, the budget is not outlined clearly and not broken down into identifiable items (those are Catalyst rules for CAs). Anyhow, the inclusion of the Youtube video in the Ideascale proposal is amazing and the dcSpark team's credentials are stellar and their contributions to Cardano - during their Emurgo days and post-Emurgo days have been clear and singificant. I think that the feasibility of the research is unquestionable thanks to the credentials of the team. The team stated \"We believe rollups can also be part of Cardano's scaling strategy\". I would prefer statements that use the word \"believe\" - to be better substantiated with more analysis of \"why?\". My question is - what if the findings show that they cannot be used - will we have an alternative strategy? Anyhow, on the balance of everything, especially the competency of the team, I assess that the proposal is indeed extremely likely to be successfully implemented. ", "q1r": 4, "q2": "As this is a research-based proposal, its deliverables are clearly a completely different product from building a website. The precise deliverables are always less visible before the work starts and the team has carefully stated that it believes the two deliverables will be a . writeup of a more rigorous analysis of naive rollups and the feasibility of rollups on UTXO-based chains (Cardano) and accounting-style chains (such as the sidechain of Cardano called Milkomeda).. These are great contributions and not many teams are involved in this type of in-depth research with practical consequences for Cardano. The team - in the attached video - and other videos that can be seen on Youtube from the dcSpark team - shows that their understanding of these issues is really in-depth. Hence, I think that it would be easier for dcSpark to considering including in its work something along the line of the Cardano Roadmap updates - for all of its proposals [https://roadmap.cardano.org/en/status-updates/] If dcSpark is already working on important contributions, then the milestones that will help auditability could take the form of regular (monthly updates) on what is going on in each branch of the work. Without this, the auditability of a proposal can suffer and outsiders are unable to gain any meaningful insight on what is going on until one day (six months later?) dcSpark suddenly reappears and tells us what happened. The proposer states that \"We believe we can have this deliverables available in the first half of 2022.\" For Catalyst, this is the bare minimum - so try to incorporate more mandatory along-the-way updates/reports that will help the scores of all your proposals (if they merit it, of course). dcSpark Roadmap monthly updates anyone? I've seen proposals from other leading teams that also top-notch contributors to the ecosystem, but they do include detailed steps, monthly timelines, a breakdown of budgetary requirements including elements such as: \"Min estimated number of person-days\" \"Max estimated number of person-days\", as well as dayrates and variables that influence the budget and the distribution of the workload - and hence the ability to audit the work. Auditing progress as it stands will be relatively difficult - although this is a different type of project.  Still, one can be creative even in this type of scenario with regular updates. Please include more information about milestones in your work in the future, to make it easier to monitor. ", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 17, "ne": 10, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "A great proposal worth investing for Cardano ecosystem as a whole! One key property that differentiates rollup from Hydra is that rollup does not require trust on the parties that runs it, while Hydra does. This is due to the fact that rollup will write data sufficient to verify computations happened in rollup back to L1, while Hydra does not. This trustless property of rollup brings more possibilities for large scale use cases. For the case of nation-wide applications, any third party can run L2 rollup without acquiring any trust from the nations. The trustlessness and scalability of rollup is going to be a strong reason for nations to adopt blockchain technology.", "q0r": 5, "q1": "DcSpark has demonstrated its experience and ability to deliver high quality product. Besides being the former employers of Emurgo and IOG, they recently launched Milkomeda testnet and Flint wallet which seamlessly connects the EVM side-chain with Cardano. I have no doubt in the team's ability to deliver fruitful research results for this proposal.", "q1r": 5, "q2": "As stated in the proposal, the deliverable is a writeup of analysis on rollup for Cardano in terms of feasibility. This should be fairly straightforward to audit, although I would argue that some quantitative measurements will make it more auditable. For example, providing what exactly will be presented in the analysis (e.g. list pros and cons of rollup, works need to be done). Regardless, research is ambiguous in its nature. Therefore, I don't think lack of quantitative measurements is a big issue overall.", "q2r": 4, "assessor": "z_assessor_315", "no_vca": 20, "ne": 6, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is for a scalability solution that does not fall within the scope of the challenge which explicitly calls for \"Dapp proposals should cover foundational Registry solutions, namely:\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"\r\n\r\nThe proposal adds value to the Cardano ecosystem, in the form of increased scalability.\r\n\r\nThe goals of the project are defined but do not align with the challenge. There are no key metrics defining success.\r\n\r\nHow scalability will be achieved is addressed in the proposal.\r\n\r\nTo improve the proposal: choose an appropriate Challenge (Miscellaneous), ensure goals align with the challenge, provide key metrics for success.", "q0r": 2, "q1": "The proposer relies on reputation to provide evidence of relevant skills and experience needed to implement the proposal, which is not ideal given new CAs and voters may not be aware of them.\r\nThe proposer does not identify the type and number of team members required to implement the proposal.\r\nThe budget is not clearly broken down into identifiable items. \r\nThe budget seems reasonable to achieve the set goals.\r\nThe proposal has no timetable to complete the work other than a nebulous \"first half of 2022\".\r\nThe proposal does explain technical aspects of the implementation.\r\nThe proposal does not include challenges and risks relevant to a successful implementation.\r\nTo improve the proposal: provide specific evidence of experience instead of presumed name recognition, identify the team and skill sets required to implement the proposal, breakdown the budget into specific items, provide a timetable, include a challenges and risks section", "q1r": 3, "q2": "The proposal does not include a roadmap with milestones and a time horizon for achievement. \r\nThe proposal does not provide metrics/KPIs that define the success of the proposal. \r\nThe proposal provides a clear understandable description of the targeted problem.\r\nThe proposal provides a clear understandable solution that addresses the problem.\r\nTo improve the proposal: include a roadmap with milestones and a time horizon for achievement, provide metrics/KPIs that measure progress", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 18, "ne": 6, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "While it is not a direct and immediate attempt at building a dApp on a national level, the impact of research on scaling is undoubtable and dcSpark team is positioned very well to execute on that research.", "q0r": 4, "q1": "The team is highly experienced and well known in the community. However, no clear timeline and milestones are set in the proposal and budget is set as an arbitrary number not really explaining how it will be used. I am pretty sure that the team is capable of providing these basic information and I would love to give them 5 stars if these information was here. For example: by the end of Q1 we will publish X scientific papers, we will put X people full time on the job for that, pay them X amount of money. ", "q1r": 3, "q2": "Unfortunately, no budget breakdown or real metrics were proposed that can be used for auditing the proposal. Team is extremely professional and they have a wonderful track record in and around Cardano and I can not understand why this information was not provided.", "q2r": 2, "assessor": "z_assessor_65", "no_vca": 16, "ne": 0, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "I found the solution to be too general and not specifically focused on any particular problem. We all understand that in order to scale up blockchain, we have to make it applicable so that countries can see the benefits it brings. Your ideas are very good but nothing is expressed clearly. In addition, we should take specific actions to make Cardano's ecosystem highly influential", "q0r": 2, "q1": "I need to see your team's profile. Besides working at Emurgo, IOHK, what is your position? What have you experienced or done? I have not seen how long your rollups plan will last and what specific time period. What are detailed project KPIs? And how long will it take you to achieve the KPI?", "q1r": 1, "q2": "For the $75000 request, how would you guys allocate this money to the project? If it is only for research, it can be highly effective in a short period of time. Or you will use this money to build a large community. From there this community will be able to rollups. And how can the community know that you are using $75k effectively?", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The problem state of achieving scalability at a nation scale I believe is very relevant considering we are only weeks/months away from a massive spike in L1 usage on Cardano due to dapps being released. It fits the challenge of building \"nation dapps\" very well. By researching rollups in this case \"lazy rollups\" we are providing an alternate route besides \"hydra\"- the main scaling solution being built on Cardano today. Although Hydra is promising, it will not be relevant for all dapps and by diversifying research into multiple scaling solutions we are not putting all our eggs into one basket as to speak. I feel this research has the potential to bring great benefit to multiple aspects of the Cardano ecosystem.", "q0r": 5, "q1": "The team at dcSpark is well known in the community and is made up of ex Emurgo and IOHK employees. Taking this into account I believe that there is a high likelihood of a positive outcome when considering the impact this research on rollups could have on Cardano. Although there is no information currently on how this area of research will be conducted eg)- how many people will be researching and a breakdown of how the funds will be distributed. There is also a rough idea of when the research is expected to bear results, but a more detailed roadmap would be ideal in giving the community a more concrete idea of when to expect results.\r\nThe budget of 75k seems extremely reasonable considering \"Polygon\" a Ethereum sidechain solution just acquired a start-up company specializing in rollups for $400m.  ", "q1r": 3, "q2": "Currently there is no real detailed roadmap or KPI's to speak of, I feel that if this proposal had these it would be an excellent all-round proposal. With the above mentioned it is also very hard for the community to track/audit the progress other than the dcSpark social accounts. ", "q2r": 2, "assessor": "z_assessor_858", "no_vca": 14, "ne": 5, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "We will perform novel research on a scalability solution called \"naive rollups\" or sometimes called \"lazy rollups\"", "experience": "Our team is composed of well known ex-Emurgo and ex-IOHK employees who have been building the Cardano ecosystem for the past several years"}