{"id": 413964, "author": "konmaorg", "title": "No Code Smart Contract Indexer", "url": "https://cardano.ideascale.com/a/dtd/413964-48088", "category": 26597, "amount": 250000, "description": "To visualize real time data on a Smart Contract it is not quite easy. It requires Tech Knowledge on how to fetch data, store them and keep getting them updated and costs a lot for the business.", "f6_no_assessments": 7, "f6_rating": 3.5238095238095233, "videos": [], "media": [], "f6_assessments": [{"id": 946, "q0": "Because this proposal aims to create a no-code solution for parsing Smart Contact data I see it more as a solution aimed at consumers and not necessarily developers.\nIt’s not exactly explained how the proposal fits in with the goals of the Developer Ecosystem challenge, and the answer that is given to that particular question, seems to support the fact that this would be more of an end-user-oriented product, as opposed to something aimed at bettering the developer experience.\n\nBut what I found upsetting about this proposal is the fact the proposers didn’t even seem to bother adapting their pitch for EVM-based blockchain to Cardano. They only inserted a sentence at the end of the pitch that referenced Cardano. It seems like they had not actually yet tried to account for how they will implement their product on our blockchain and its completely different eUTxO architecture. I get that part of the project could be to try to figure out how to accomplish the port of the parser from an EVM blockchain, and I appreciate the fact that this is identified as a risk by the team, but still, I would have like to see a greater emphasis placed on this in the proposal. Perhaps not referring to Cardano as “other EVM chain chain” would have helped.\n\nIt’s also not exactly detailed in the proposal how Cardano specifically would benefit from smart contract indexers/parsers. The smart contracts on Cardano have a completely different structure and functionality than those on EVM blockchains\n\nHaving said that, the solution could still be beneficial and impactful to the ecosystem of our blockchain if implemented. But in its current form, the proposal doesn’t make sufficiently clear why this proposal fits in the developer ecosystem challenge or if the proposers have adequately considered all the technical implications of the project. \n\nI am reviewing this proposal with my experience as a mobile app studio manager for over 5 years and my involvement in the Cardano developer community since March of 2021. I have also been actively project-managing Cardano developers since July of 2021.", "q0r": 3, "q1": "The implementation plan is written in a clear, detailed fashion and broken down into number of days, which is very helpful for understanding the process. The plan includes descriptions of the work to be done, milestones, a timeline and the \"number of resources” to be allocated to each step.\n\nThe budget breakdown is in-depth and the amount requested seems reasonable given the scope of the project and the 8 month timeframe. While I would have preferred to see hourly rates presented in the proposal, the fact that we are dealing with a larger organisation that will employ quite of few people for this project seems to justify the requested amount of $250K.\n\nThe proposal includes a full list of the persons who will be working on this project along with links to their LinkedIn profiles. After checking the data provided, the team seems to poses all the needed qualifications to successfully deliver on the scope of the project.\n\nNot only does the team comprise more than 15 qualified engineers, but I really appreciate the fact that they had the foresight to include a Haskell advisor on their team.\n\nBoth the new Fund 9 questions related to workload on previously funded proposals and planned projects, submitted as proposals in Fund 9 are answered with “Yes”.  Despite this, no additional details are provided in the main feasibility section as now requested when submitting the proposal. I won't take points off of my rating for this, as the questions are new to Fund 9 and the proposers may have not fully understood what is being requested of them, but, I do recommend that the team include full answers on future submissions.\n\nHowever I could not find any data about the specific team at Unmarshal (which are presented as the main developers of this project) having been funded previously, perhaps the “yes” refers to their co-proposers Konma, which do indeed have proposals funded in previous rounds, 27 submitted in total, 15 of which in Fund 9*.  \n*source: https://www.lidonation.com/en/project-catalyst/users/941?proposals=1 ", "q1r": 4, "q2": "Personally, I think that one of the goals of any Catalyst funded proposal is to make it as easy as possible for stakeholders and the community to audit the deliverables of the project and this proposal falls a bit short on that. There is a list of KPIs given by the proposal, but they feel a bit overly generic and it’s not clear how the team plans to present progress on them and other aspects of the proposal to the community.\n\nThe roadmap presented in the feasibility section does offer some verifiable milestones and perhaps presenting a plan on how these will be recorded and made accessible to the community would have been a good first step towards a more complete auditability section.\n\nOne thing that I would like to point out is that the target number of users given in the definitions of success seems very low, especially for a project that is requesting a quarter of a million dollars in funding from the Cardano Treasury. ", "q2r": 3, "assessor": "z_assessor_2169", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3516, "q0": "The proposers want to generate an easy to use dashboard, taking information directly from the chain and following interesting key metrics that the smart contract creators might want to trace. This is a great idea and it would benefit the ecosystem if it gets implemented. I don't know of any such solution already existing in the ecosystem so it would be a great addition. The challenge settings are met and aligned with this proposal although on some points, more detail could have been provided, but I'll expand on that comment in the feasibility section. I don't suppose scaling would be an issue for this team, since there are quite a lot of experienced team members. Currently the proposal is missing a more detailed explanation on the path to success and the budget breakdown. As a developer I don't have any concerns regarding the impact, and quite the opposite, I'd really enjoy using and integratin this tool in my Dapps. Overall I think this is a good proposal (impact wise) and it would deffinetely bring a positive outcome for all participants.", "q0r": 5, "q1": "There are plenty of links with linkedin profiles and I respect people that stand behind their work with their names. This brings the credibility of the project up for me as a developer. Having said that there aren't any specific technical skills listed as necessary in the proposal that match with the provided linkedin profiles, only mentors that do have the skills necessary. The fact there aren't any developers that are knowledgable about cardano smart contracts worries me as a developer, because such a complicated project might take a while to be done, and I wouldn't match it with the given roadmap. The budget breakdown could have been more detailed because after passing through it I was left with a lot of questions about where exactly the funds will be going. It's good there's a major separation of funds like 50k for indexing the node, but no mention of what does indexings would be, because there are a lot of ways to create an index of a data structure. On the point of decoding the data, I don't know what that means exactly because all data that could be a part of the proposal is not ecrypted, so there would be no need for any decoding and there's no mention of why this would take 50k as well. The part that seems legit to me is the 3rd milestone which is building parser services. Another thing that I find wierd as a developer is the enabling of the software before having any time for any kind of testing and audit. I find it irresponsible, because a lot of people will rely on data validity. The sum of all milestones in days is aproximately 184 which is ok, but my suggestion would be to breakdown this proposal into several smaller ones. I don't understand the notion of resources numbers given. I don't understand if those are people of days or hours or something else. I see what they're trying to make, but I don't see the HOW. IMHO as an assessor that has been though 5 funds already, I'd suggest to the authors to have a look at other excellent proposals in the past funds and see what information is provided and try to improve this one. A lot of details are missing and I'm not sure about the validity of their claim as things stand now. Overall I think this proposal needs more work and more breakdown of the milestones and budget. I hope you come back the next fund with an improved proposal. ", "q1r": 2, "q2": "I read the mentioned KPIs and they are adequate, but I don't see any KPIs that would be easy to follow by a supported of their proposal. A progress report of some kind or a blog post would have been nice to keep your supporters up to date. If you have plans to do that already, I'm sorry, but there's no mention of that in the proposal. I see the site has a blog and some updates are happening there. The proposal has a good targeted problem, but could use a more detailed explantion of the solution, because it left me with more questions than answers. The roadmap needs more work, as it's a birdseye view of the idea, and not an actual business plan. I don't think having a number of dashboards is a good success metric, since any random dashboard without any effor or meaning put behind it wouldn't be valuable for the people you're targeting and since there's no concrete mention of the value the said dashboards would bring only a number, I don't like this metric. Putting yourselves in the shoes of the voter could help you write a better proposal for the next round.", "q2r": 2, "assessor": "z_assessor_2463", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3595, "q0": "Huge transaction data is generated every minute of every day. How to track, record and store them quickly and securely.\nAbout the proposal made is very interesting and really necessary for Smart Contracts.\nNot only is the time and cost minimized as much as possible, the proposal also offers an optimal, simple and fast solution (with a few clicks on the Cardano chain)\nIt's great, isn't it?\nThe solution is: the old parser solution.\nI don't quite understand this term. But the proposal says that, since they have developed it to be linked with smart contracts on Ethereum, BNB, Polygon and 8 other chains, the expansion and development on the Cardano chain will give Cardano an additional advantage to collect. community attraction.\nI don't see any potential harm to the project. You will definitely develop this project on Cardano", "q0r": 5, "q1": "I found a detailed job breakdown that was quite brief but showed the top of the work to be done. All jobs related to engineering. I'm not a technical person so it's hard to judge.\n  Each timeline is allocated with an estimated budget.\nBecause the project is specialized in engineering, the majority of the team members are technical. The identity is attached with a link that is easy to verify.\nThe project has been developed by the team on Ethereum, BNB, Polygon and 8 other chains, developing on Cardano is just a step to expand the ecosystem, so I think the proposal is feasible.", "q1r": 3, "q2": "As someone who is not a blockchain technician, I have no idea about the specific goals listed in the detailed plan. But I will wait for the detailed work report to be sent to Catalyst or the public reports sent to the community to review the project's transparency.\nGood luck", "q2r": 3, "assessor": "z_assessor_2464", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 7457, "q0": "This is something the ecosystem could potentially benefit from greatly. I am pretty sure that pool.pm can do a lot of this natively anyways, however. The thing I am worried about is your proposal is not very detailed. The funding section gives very basic allotments of very well-rounded numbers, which worries me that funds may not be spend in the best way possible. The fact that you are coming to Cardano is absolutely amazing, but as a company, you should have the fund to build out into our ecosystem and leverage your in-house talent or hire more in order to focus on building this tool out. If you cannot afford to self-fund a venture like this as a company already working in 9 other blockchains, how can we justify giving you a huge amount of funding? I just feel like more could be done to elaborate on what you plan to do with the funding, and give us a better idea of where you intend to go with your project.", "q0r": 4, "q1": "I don't think you have your metrics broken down far enough for us to assess the plan being successfully implemented. You claim to have 9 other blockchains covered by your tool, but you do not have any funding to put behind to at least match the huge number you came up to fund this project? I would like to see more information and maybe even a whitepaper on what you plan to achieve in our ecosystem, with each catagory broken down on how you plan on funding and what it will cost to fund. This proposal lacks a lot of details that are needed in order for me to feel safe granting you what you are asking for. If you come back with all these details filled in, I would more than gladly vote for a project like this!", "q1r": 2, "q2": "I would like to see more engagement with the Cardano community overall. Maybe through social media of some kind. Having a website kind of disconnects you from a community without some sort of social media engagement. If your company were to participate more in the ecosystem first, you would also gain real-time exposure to this technology. The thing about Cardano is that it is already constantly changing and involving. As a current employee of a Cardano project myself, I have learned more being an active participant in places like catalyst and the forums then I have anywhere else. I think your team could benefit greatly from just dipping your toes in the water over here first before asking for this kind of funding through catalyst. I think your idea is absolutely brilliant, and would love to see you guys come back for a successful funding round! Please, don't be discouraged, I just only want success for you guys and Cardano as a whole.", "q2r": 2, "assessor": "z_assessor_2895", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9598, "q0": "The project aims to index the on-chain data of smart contracts on Cardano and provide it in the form of services such as API/webhooks/dashboard so that dApps developers, wallet builders can easily query and use it. This helps a lot for developers as they can monitor the performance of smart contracts without having to spend a lot of resources to design a system to fetch on-chain data, store them and keep them up to date. The insight this project can provide to its users has been specifically listed in the proposal, including smart contract transaction history, staked/unstaked value, and transaction volume. One of the use cases I can think of is that DeFi apps will get a notification when unusually large transactions occur on their smart contract address so they can check for vulnerabilities before their smart contract getting more exploited. This proposal effectively addresses the written challenge by providing a utility on the Cardano ecosystem that makes developers' lives easier.", "q0r": 5, "q1": "The team already has similar products on other blockchains so I believe the team is qualified to do this project. Team members are people with relevant experience and skills relevant to the project. Team members all have LinkedIn links so I can learn more about each person's abilities and capabilities.\n\nThe requested budget is not broken down into definable items. For example, if they spend $60,000 to enable analytics framework, they can clearly state how many people do this job, what each person's work is, how many hours each person works in a week, pay rate of each person, how many computers / cloud servers to use, and what is the cost for each server\n\nAbout the timetable, in my opinion, it is realistic and suitable to be able to complete the project. However, in terms of the implementation plan, the proposal has only suggested what needs to be implemented without specifying how it will be implemented.\n\nOverall, based on the members of the team and the products that Unmarshal already has, I assess that the team can implement this project, but still need to add more information about the budget and implementation plan to make the project more detailed.", "q1r": 4, "q2": "The project provides KPIs that can be used to evaluate the success of a project but has not yet provided the ways used to measure the project's progress. The proposer may consider adding metrics such as the amount of data indexed and stored in the database, and the number of parser services built to audit the progress. The KPIs used to evaluate the project's success, such as the number of smart contracts indexed or the number of users also need to be more specific, for example, how many users the project is considered successful. In addition, the project should also provide an accessible public channel to regularly update the progress of the project for the community to monitor and verify, it can be a Discord channel or Youtube videos, or Twitter.", "q2r": 3, "assessor": "z_assessor_3068", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11172, "q0": "The problem described in this proposal is closely aligned with the challenge, nevertheless, the risked outlined aren't enough and the mitigation plan aren't too clear. The team could have envisioned more risks and try as much as possible to find solutions for those risks.\nThe team nonetheless, demonstrate experience, knowledge, and interest in the issue at hand.\nThe budget is clear just that I think the amount is a bit too much.\n\n\nThe roadmap is nicely prepared just that a bit of clarity with the timelines could have helped greatly.\n\nThey have a chance of getting the proposal achieve its goals successfully.\n", "q0r": 4, "q1": "The information about the team described in the proposal is detailed, the experiences described and the work already performed indicate the team is competent enough of developing this work. \nThe roadmap as I said earlier is clear but a bit of clarity could have been added to the timelines etc \nThe team had enough team members from different fields working together to achieve its goals.\nThey have enough experiences to get the work done ", "q1r": 4, "q2": "There's clarity in the description of the problem, the solutions and how the proposal is aligned with the challenge just that the risks were too few without enough mitigations of the risks.\nThe roadmap is well designed.\nThe milestones provided makes the auditing of the proposal easier.\nThe metrics and KPIs were well chosen and I believe they are good indicators for evaluating success of this proposal.", "q2r": 4, "assessor": "z_assessor_3229", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 12325, "q0": "The proposal provides a solution to the problem that is line with challenge settings. This will provide any DAPPS, staking platforms/ lending/ borrowing protocols will want to visualize the performance of their contracts. The concept is more far technical than in practice. This points to the fact that Unmarshal\nseeks to use parser to provide real time solutions. The proposal has provided information on how the project will be used to solve real time solutions in the challenge setting. However, I'm not sure how this project can be part of the cardano ecosystem. If the process of developing a contract indexer is difficult to do. And how can this work on the cardano ecosystem. If the project is going to be built on another. I believe the solution addresses the problem.", "q0r": 4, "q1": "The team provided is a well experienced team with references and links provided to view more on their experiences and the number of years spent in working in their area of expertise. The budget gives brief details on what the budget entails. However, with the kind of proposal in question. I will advice if more details are provided in the budget. There is a clear plan with milestones on how the plan is to be carried out. The project have given 4 milestones and number of days in the execution of this project. I believe if the project receives the needed funding it could be implementation.", "q1r": 4, "q2": "There is clarity of information provided in tackling the problem. There is a clear roadmap showing how the project will be carried out to achieve its objectives. The project if implemented will address the problem by providing a smart contract indexer. The proposal provides key metrics and key performance indicators (KPI's). Examples are number of dashboards created, number of contract adresses indexed, number of users, number of request and number of Applications and DAOs using data.", "q2r": 4, "assessor": "z_assessor_3401", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Imagine, if the above problem can be solved by yourself at low-cost with just basic computer knowledge & without any infra costs. Reimagine data in your own way with few mouse clicks on Cardano chain", "experience": "Unmarshal has been in the DeFi space for over 15 months and successfully supports more than 15 chains. Unmarshal is building useful products around On Chain Data and the Parser is a game changing tool that would help business create their own Dashboards using our framework."}