{"id": 414065, "author": "lpmaho", "title": "MLabs - Plutarch v2", "url": "https://cardano.ideascale.com/a/dtd/414065-48088", "category": 26597, "amount": 73040, "description": "Plutarch v1 greatly reduces the requirements of implementing stateful dApps (DeFi). Yet, expanded functionality is needed for Cardano devs/auditors to fully leverage the dramatic gains of this eDSL.", "f6_no_assessments": 10, "f6_rating": 4.7, "videos": [], "media": [], "f6_assessments": [{"id": 663, "q0": "The MLabs team is now working upon various enhancements and optimizations for Plutarch (Version 1 was funded in Fund 8, where it allowed significant improvements over CPU and memory requirements for plutus code) and needs to incorporate the latest CIPs to accommodate/adapt to the Vasil hard fork. Additionally, the new features will improve code auditability, avoid code duplicacy via Haskell backend/Purescript backend by sharing the code depending upon whether code is to run on browser or backend.\n\nThe proposal therefore is improving the development infrastructure by providing open source tooling, and reusable solutions for dApp developers who could reuse these functionalities and get performance optimizations benefits by using Plutarch validators instead of Plutus core validators. \n\nThe proposal gives a good explanation of impact, current work, and future plans for this project. These sections align perfectly with the guiding questions such as “tool prioritization”, “developer attraction”, “technical prerequisites for building enterprise projects”, “Improved tooling, scripts automation”, “APIs”. \n\nNevertheless, what would be also interesting to see, who remains to be the Github repository owners, and who will maintain this repository. As a senior developer myself, I have often faced this issue with open source projects that PRs take a long time to get merged, just because the maintainer does not have any time. It would also be interesting therefore, to include such details in the writeup, so that sustainability of this project is taken into account. \n\nTherefore, I agree that this proposal fits in quite well with the Developer ecosystem and fulfills the challenge settings brief and hence effectively addresses the challenge.\n", "q0r": 4, "q1": "The proposal provides verifiable links to the main developers who are working on this project and are part of the MLabs team. The budget is split into hours needed and total engineering hours required to fully implement features that are part of this proposal. As a developer myself, I can say that these are quite realistic. The proposal quite elaborately explains the technical work that was done so far and what is left and will be done as part of this proposal. \n\nThe risk section mentions that from an implementation perspective it is quite low risk as Plutarch is quite extensively used in production and already well developed, Nevertheless, What would also be a great addition to risk sections would be the workforce backup. If there are 3 core developers and for some reason he is unable to work on this project, then does MLabs have other free developers that can quickly onboard and start implementation ? People management is often overlooked in such situations and can lead to some unwanted risks, affecting the timelines. Nevertheless, I strongly agree that this proposal is highly likely that it will be implemented successfully.\n", "q1r": 5, "q2": "I strongly agree that the information provided is sufficient to audit the progress of this proposal.  The 1, 4, 8 months timeline splits the work needed to be done into smaller milestones, explaining what feature sets are planned to be implemented when. \n\nThe KPIs section talks about the results of the implementation work that would be done as part of this proposal. For instance, general reduction in script execution size ( can be tracked by Github Issues as teams who would start incorporating this repository in their source code), number of projects benefiting from Plutarch optimizations (stars/follow/issues) can be used to track this.\n\nThe project impact is provided with the set of features and how they will impact the developer community building on Cardano. These can then be further measured against the KPIs and hence fulfill an overall improvement on the Developer's experience on Cardano.\n", "q2r": 5, "assessor": "z_assessor_2114", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2741, "q0": "\"this is a continuation of the project that was funded in round 8 and it upgraded from Plutarch v1 in the previous round of funding Plutarch v2, a lot of ancillary features will be upgraded in this proposal. which will have a significant impact on the technical limitations for developers especially in the Defi segment, the proposed solutions have solved most of the challenging problems required.\n  The proposal's solution presentations are very convincing explaining the features of Plutarch v1 and the features that will be enhanced in this proposal. Plutarch v2 is reasonably easy to understand, and the team also has plans for The Consolidation of Vasil HFC's latest CIPs is coming soon. With the experience of the group, which are all developers, engineers and large Defi development organizations such as: Liqwid Labs, Genius Yield, this shows that the team can fully implement and develop this idea in the best way. .\n  commitment proposal will always be ready to wait for possible risks such as feedback from developers or any difficulties raised from developers propose to fix them to ensure features are always easy to use. \"", "q0r": 5, "q1": "\"These are all upgraded features of the project from the previous round, so almost all the steps and specifications are well understood by the team, so the roadmap proposed by the team is suitable to complete the tasks. target has been determined.\n   already have a contingency budget for arising if any, but the team needs to get a benchmark for how many dollars an hour so it will be easy to calculate, the rest I have no further opinion on the budget table. book.\n   I am very familiar with this proposed group because they are the developers of decentralized exchanges in general, Defi. and I have invested in tokens of those institutions. With their influence and experience I highly appreciate the feasibility of this proposal.\"", "q1r": 4, "q2": "\"All progress metrics for this project are suggested to be made available on GitHub, however that's not enough to get a maximum score for transparency I recommend monthly reports to make it easier for the monitoring community to know your work progress.\n   Talking about the success of this proposal, it is easy to test that it will affect useful features for smart contracts that anyone can use for free, and another typical example is the success. of the previous project Plutarch v1. However, because there is a little need to supplement and support checking the metrics with reports, I can only give this group 4 points for transparency. \"", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 2873, "q0": "Plutarch 2.0 the following version of itself (Plutarch 1.0) in fund 9 is another interesting feature extension for smart-contracts engineering features for Cardano Plutus programming language. While it’s true that the current problem right now in Cardano smart contracts are size-hardware-scripts limitation and compile tools which will highly become a burden for future needs.The team has carefully considered all shortcomings of the current model in Plutus Tx library and therefore classifying out the solvability of those. It’s impactful for the project as the fact that they resolve developers’ problems by optimizing code efficiency, this equally means they’ve been innovated to resolve potential directions of “Support structure” , “Developer productivity” and as the project meant to be open-source, there will be collaboration for the sake of Cardano enhancement. Moreover, there are similarities between the proposal and the challenge for their continuation from fund 8 to 9. The project has crucially reduced the impact of resource consumption when stated “... ~75% decrease in CPU, memory, and script size is commonly achievable…”, this is believed to be important when it comes to the SDG goal of “12. Responsible consumption and production”. The project also included up-to-date features with its listed remainder of “Incorporating the latest CIPs of the upcoming Vasil HFC” which highly depicted the efforts of the project’s doers when weighing the integration of their product into the ecosystem. The descriptive solution of the proposal tends to improve the technical scalability (in languages, data and optimization), backend, and systematic factors. Besides the fact that the work could academically be proven into a risk-free stage,  however with such complexity in the program there ought to be a strategy to simplify and open to developers to improve the comprehension rate in quality and quantity. ", "q0r": 5, "q1": "The total timeline for the project is 13 months with specified tasks and engineered hours along with the time breakdown. With MLabs, reliability towards their team profiles is appreciated for the feasibility in terms of engineering background and work experiences towards big projects in the Cardano ecosystem (Liqwid, SundaeSwap, Minswap, Optim, etc…). The identified chances of the project coming back to get funded for future upgrades showed the determination of the project to further bring the community spirit for the challenge hence the Developer Ecosystem will always be active and simultaneously developed by the community power. It’d be more realistic for the project when their work is linked to further organizations such as business organizations who are extremely in need for smart contracts involvement of their company. Knowing the fact that the project is made to be open-source but the team can also extend the commercial usages by creating use cases or collaborating with business partners to train their technical department towards smart contracts. By that the project expanded the network of users. \n", "q1r": 5, "q2": "Speaking of auditability for the project it’s numerically measurable that the project is defined with its success towards usability, Open Source Tooling and Cost-effective development terms. Compliments for the KPIs is that it's auditability access on platforms like github, however for features like “general reduction size in script execution size achievable” should be identified by a measurable unit, like the total average percentage of the reduction size compared to the original. ", "q2r": 5, "assessor": "z_assessor_2356", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3521, "q0": "The TL;DR of this proposal: It's providing an easyer and a more robust and extensive way of developing statefull dapps using plytarch featyre set. This project is a continuation of a previous fund that was funded, which I had the privilage of reviewing and it was good enough in my oppinion and got funded, so I have no doubt this projectt will be funded as well. To non developers reading this, I can say this project is worth it.\nThis project will have an enormous impact over every cardano developer taking advantage of this tooling building all kinds of apps. There are plenty of big names like miniswap using this solution already. The proposers have a deep understanding of the current state of things and tooling, and have all the necessary experience to speed up the environment development. as a developer I don't see anything missing in this proposal and can say this would be a great improvement and a missing puzzle piece in the comming dev ecosystem. The proposal is clearly in line with the challenge setting.\nOverall a great impactfull proposal that will bring benefit to all using it.\n", "q0r": 5, "q1": "There are plenty of proven people working on the team, and these are developers that have linked not only their linkedin profiles but github accounts as well, and as a developer I prefer looking at the code, because the code doesn't lie. These team members really do have all the skills necessary to keep this proposal running and developing it to the highest standard so that everyone can keep using it and making better and most of all safer apps. Because when it comes to contract validation and development especially when dealing with money, such tooling is essential.\nThe team has already done several project, and their tooling is used by other projects and companies, so they've proven themselves already as realiable participants of the ecosystem.\nI like their plans for the future and the detailed time breakdown of their milestones and budget. This is how all project should do their estimations in my oppinion having seen north of 130 proposals over the last 4 funds.\nThe proposers have layed out a detailed plan for growth and work already done, as well as work that need doing right now. The project is in sync with what's already been done and augments, without wasting effort and duplicating effort like many other projects unfortunately. Overall a feasible proposal.", "q1r": 5, "q2": "Relative KPIs that would layout a path of tracking all progress made on the development and growth of the project. There's a clear problem statement as well a complimentary solution statement that's understandable and reasonable. \nThe roadmap and milestones span accros a whole year and althrough it's a birds eye view, I think it's relevant and good enough to track. The proposers have linked a github repository with much of the work already been done, so that's a proof of work.\nI have no suggestions for the proposers as this is obviously not their first rodeo. Good luck to them!\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 12, "ne": 2, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 5121, "q0": "The proposal wants to enhance the Plutarch feature set. Adding a multi-backend solution for off-chain and on-chain use. Plutarch is successful and used by various prominent projects. Expanding the scope of the Plutarch project will provide greater benefits to dApps building in the space. The proposal is well written and the chance of project failure is low as the team has successfully delivered previous Plutarch and other widely used tools. The proposers outline the main risk of the Plutarch project as needs specific training for developers to become fluent in its use. However, the team can mitigate this by focusing on usability and practical improvements to streamline the process for developers.", "q0r": 5, "q1": "The timelines are simple, in the 1st month, 4th month, and 8th months. The budget breakdown is presented in the total hours needed to complete a milestone. The cost per hour for the development is around 80$/hour. Quite expensive, but considering the experience of the core team member, the cost is reasonable. The proposal explains a concise background on the MLabs team. They also give comprehensive information on the experience, past projects, and relevant skill of each core team. On top of that, the proposers also attached a Github account, thus making the community easily verify their credibility.", "q1r": 5, "q2": "There are various KPIs used to measure the project's progress, and all of them are quantifiable. The auditability of the project is also easy as the project is open source through Github public repository. The project defined success is straightforward and measurable with more projects incorporating the eDSL. Also, the project uses KPIs in the metric section to determine if the project is a success or not.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 6288, "q0": "The proposal is aligned with the Challenge as it is improving the (Plutarch) compiling tool to smoothen the code writing for the newcomers. This will enhance the Developer Ecosystem in Cardano.\nIt will positively impact Cardano as this compiler tool facilitates code writing because there is a scarcity of Haskell developers who can quickly learn Plutus for 'smart contract programming' on Cardano. So we can appreciate any help to attract the software developers to Cardano. \n \nThis is the second round of funding for this 'Plutarch' tool. Many big names are already using the tool in Cardano Ecosystem, such as Ardana, Liqwid, Minswap, etc. Hence we can see the impact of this tool funded in Fund 8. \n \nThe Github repository link has been provided in the proposal.\nThis compiling tool should be maintained and improved to scale the number of developers coming to Cardano. Thus this improvement and update proposal is entitled to be funded in Fund 9.", "q0r": 5, "q1": "The MLab team, who is developing and maintaining Plutarch (compiling tool), is a well-known team to Cardano enthusiasts as they have contributed to many Cardano projects and helped build many running Decentralized Applications such as Sundaeswap, Cardax, etc. They have already created this compiling tool currently used by many in Cardano Ecosystem.\n \nThe required work is broken down into identifiable tasks and the hours needed to complete those tasks. Anybody more familiar with the programming can attest to the clarity of these tasks. Given the required work and the required hours, the budget is reasonable. \n \nAs the team has already developed the Plutarch compiler tool, the likelihood of success of this proposal is very high. However, the team is also aware of the risks and challenges against this proposal.\n \nBecause of the above facts, this feasibility study proposal is likely to be completed.", "q1r": 5, "q2": "The progress of the proposal execution can be tracked or audited on GitHub, where the team will update the project's commits and status. \n \nThe proposer also clearly laid out the key deliverables that can be measured to see the proposal's success. The KPIs are the number of projects benefitting from the Plutarch, reduction in script execution size, number of commits, etc. \n \nThe delivery dates are mentioned in months, i.e., one month, four months & eight months. \nThe budget is reasonable considering the volume of work required by this proposal, and it is broken down into identifiable tasks along with the hours needed.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 7966, "q0": "The intent is to reduce the requirements for deploying stateful dApps. For this, they will further expand the Plutarch project to allow Cardano developers to fully exploit the benefits of this eDSL. The Cardano developers will benefit from extending these features. The creators of the proposal already have a large number of feature updates planned ( Plutus IR backend, Purescript backend,... ). The team already has a long list of improvements for Plutarch 2.0. Because Plutarch has already been extensively developed and is already widely used in production, the risks will be greatly reduced. The main challenge will be to provide training for developers to learn how to work with Plutarch. Thus, it will be easier to use to facilitate the process for developers.", "q0r": 5, "q1": "MLabs hall to participate in this project; Mlabs is a major development company in the cardano ecosystem. Mlabs employs over 100 developers to help build community projects. The core team consists of different people with relevant experience. Chase Maity has been a major contributor to Plutarch 1.0. He has used the first Plutarch validator in production. A clear budget plan has been included that states how the funding will be used. The financing will mainly be used to pay for the engineering hours. You can clearly see that the budget is being spent correctly. The budget certainly seems sufficient to me. The advantage of this project is that a good foundation has already been laid to continue working on it. This project has already been funded in fund 8 and additional funding is requested in order to continue working. There is a timetable available with associated milestones. The technical aspects that are important for a good implementation are also included. The petitioner has also taken into account the challenges. The main challenge to using Plutach well is specific training to work well with it. The developers of this proposal want to make usability and practical improvements to streamline the process for developers.", "q1r": 5, "q2": "A clear roadmap and milestones are included in the proposal. The intention is to release the extra features within 8 months. The chosen milestones are certainly achievable. There is a large team that will be working on this project. Clear KPIs are included in the proposal such as number of PRs and problems solved, number of projects that work with Plutarch,... Successfully releasing Plutarch 2.0 can ensure that more projects are integrated into eDSL. The intent is also to get public input through their GitHub repo. The risks for this project are less great because Plutarch 1.0 already exists and can be built on with additional functions.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8651, "q0": "This proposal is a call for funding to further expand the functionality of a product that is in development and has successfully received funding in Fund8. The main product of the Plutarch engine project will assist Plutus developers to take advantage of the beneficial features of Haskell without sacrificing compilability to build smart contracts on Cardano. The author has clear technical explanations on how it works, the main functional nodes, the outstanding advantages of Plutarch that will optimally support the smart contract building work for dApps developers such as how. The author also analyzes the operation process and shortcomings of the Plutus Tx compiler library to highlight the minimal possibility of these shortcomings of the Plutarch tool. Overall, this solution addresses the needs of the developers and the requirement of this challenge effectively is to reduce the barriers to work in order to provide a great experience for the developers, further boost their productivity and contribution on the blockchain.", "q0r": 5, "q1": "First of all, Plutarch is already a project in development and has completed the tasks set out in the Fund before calling for funding in this Fund. In addition, Mlabs is a team that always has outstanding initiatives and contributions to Cardano in many Funds, we can easily conclude this is a reliable and effective team. The development plan for this proposal is to continue the expansion of Plutarch's functions, the work of which can be easily tracked thanks to a clear presentation of timelines - the tasks of the proponent. The detailed calculations of the number of hours worked for the work in the project are very good for the experts to be able to assess the feasibility and fit between the team's work effort and the required remuneration. The members selected from Mlaps to lead this project all have solid working skills and professional knowledge to ensure the good implementation of this project.", "q1r": 5, "q2": "The success of this project is predictable, but proponents still need to put their KPIs on a clear audit roadmap that includes timelines – targets for KPIs to achieve success. You can get an overview of its positive impact on developers and Cardano. The ability to track the progress of this project's development is easy thanks to the tools and the proponent's commitment to providing community reporting.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 10113, "q0": "I greatly appreciate the impact of this project. This will be a significant step forward that will have a huge impact on making it easier for Cardano developers to write apps on cardano, engaging developers, and growing the cardano community.\nproposer has provided a very clear and concise description an issue that is adding extensive functionality to Plutarch v1 - which has shown to be optimal and is being used by many projects and organizations (to help developers) Cardano developers/auditors can take full advantage of the benefits of this eDSL\nThe idea of ​​a Plutarch eDSL was born to overcome Haskell's limitations, allowing Plutus developers to take advantage of Haskell's beneficial features without sacrificing compilability=> so continuing to expand, development of this project is necessary.\nproduct of this proposal to assist Cardano developers and auditors who are building the Cardano ecosystem and verifying the security of dApps\n", "q0r": 5, "q1": "proposer has listed in detail the new features that will be updated in this V2 version. Of the new updated features, I think the most important update is on the Plutus IR backend, which improves code auditability for auditors' automated audit tools.\nTechnologically, Plutarch is an eDSL imported into Haskell, so I don't think it's technologically limited. Moreover, the newly updated features make the old version more optimal, so I have not found any technological inconsistencies in this project, which is completely possible.\nAs a simple understanding of myself, the product of this project will create an upgrade, expansion and improvement of the feature set for Plutarch V1, becoming Plutarch 2.0, optimizing the technical process and time. made for Cardano developers/auditors. I find that this is the only product to date that deals with this problem (as far as I know).", "q1r": 4, "q2": "The proposer presented is not detailed in the AUDITABILITY section. However, summarizing from the information in other items, I have some comments as follows:\n- The project's KPIs are listed in detail, but do not come with a specific implementation time. The team needs to include more KPIs on the execution time in this section\n- The progress of the project can be checked through their websites and social networks, the information about the project is updated quite continuously.", "q2r": 4, "assessor": "z_assessor_3158", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10328, "q0": "This proposal comes after Plutarch v1 received initial funding from Catalyst in Fund8. Plutarch V1 also had the issue of significantly reducing the requirements for deploying stateful (DeFi) dApps. With Plutarch 2.0 being released Enhanced with extensive functionality for developers, Cardano reviewers take full advantage of the significant benefits of this eDSL.\nThe proposal presents the advantages and disadvantages of the earlier Plutus Tx (Plutus Tx is the tool for compiling Haskell to Plutus). To overcome this drawback, an optimization solution from Plutarch has been proposed. Plutarch is an eDSL imported in Haskell for writing efficient Plutus Core validators.\nThis proposal aligns with the goals of our Foundation 9 Developer Ecosystem project. The proof is that right from the first round of funding, the team has been constantly improving and developing to bring the optimal application to the community to use and receive a large response from the community.\nSome outstanding projects used from V1 can be referenced:\n• Ardana Labs - Decentralized stablecoin hub: https://ardana.org/#/\n• Cardax BV - Cardano Decentralized Exchange: https://cardax.io/about-us/\n• Minswap Group - Multi-group decentralized exchange: https://minswap.org/\n• Liqwid Labs - Interest Rate Protocol: https://www.liqwid.finance/\n• Platonic.Systems - Consulting of Haskell and Plutus: https://platonic.systems/\n• MLabs - Haskell/Plutus, Cardano, and blockchain consultant: https://mlabs.city/\n• Genius Yield - All-in-one DeFi Platform: https://www.geniusyield.co/\n\nWith features beyond V1, the enhanced Plutarch 2.0 will bring even greater benefits to dApps and organizations building in the space. We can check out one of the app's improvements here: https://github.com/tweag/pirouette.\n\nThe proposal points out the current risks and also offers specific solutions. Aware of this, the proposal has focused on usability as well as practical improvements to streamline the process for Developers.\nThis is a good proposition. I agree with this suggestion.", "q0r": 5, "q1": "The planning process is divided into 3 phases, 1 Month, 4 Months, and 8 Months. There is no specific timeline and metrics for the plan.\nThe budget is calculated as the total time taken multiplied by the amount in one hour. The total estimated time is 913 hours, 1 hour is calculated as 80$. The total proposed request amount is $73,040. The proposal is detailed in terms of how many hours each item would take. However, that is only an estimated number of hours. This budget sheet needs further explanation.\n\n\"This proposal is a follow-up to Fund 8 that previously received funding. With the project \"Plutarch: typed eDSL in Haskell\" Fund 8, received a grant of $75,000. Also in the Open Source Development Ecosystem challenge, the team was successfully funded with the \"Plutus-extra: Plutus helper library\" project with a grant amount of $ 75,000. We refer to these two projects here:\nPlutarch: typed eDSL in Haskell: https://cardano.ideascale.com/c/idea/384807\nPlutus-extra: Plutus helper library: https://cardano.ideascale.com/c/idea/397436\n\nThe implementation team, including the core team, makes an important contribution to the construction and development of Plutarch 2.0. View details:\n+ Las Safin (Compilers and Formal Methods)\nPlutarch: https://github.com/Plutonomicon/plutarch\nGitHub: https://github.com/L-as\n+ Chase Maity (Performance Optimization and Type systems): GitHub: https://github.com/TotallyNotChase\n+ Mario Blažević (Senior Haskell Developer): GitHub: https://github.com/blamario\n+ Peter Diviánszky (Compilers and Formal Methods): https://divip.hu/ \nWith a team of professional, skilled, and experienced engineers. Trust that they will complete the proposal well.", "q1r": 3, "q2": "The proposal has specific metrics and KPIs. Regular project updates through articles on Media as well as social channels.\nIt is recommended to add more links for the community to follow.\n\nThe success of the project is determined that there are many projects incorporating eDSL. At the same time, the number of members and contributors is increasing on the GitHub repo.\n\nThis proposal is a continuation of the Fund 8 funded proposal - Plutarch: typed eDSL in Haskell: https://cardano.ideascale.com/c/idea/398609", "q2r": 4, "assessor": "z_assessor_3181", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We will greatly expand the Plutarch feature set to improve efficiency and capability. There will be more powerful abstractions than before and a multi-backend solution for off-chain and on-chain use.", "experience": "Plutarch developers and other advanced Haskell/Plutus engineers.\nMoreover, our engineers are committed to open-source tooling for the Cardano ecosystem. See our work on the Cardano Transaction Library (Fund8 successful proposal) and the Plutonomicon GitHub repo."}