{"id": 414088, "author": "fimi.vn", "title": "Marlowe Course for Vietnam Devs", "url": "https://cardano.ideascale.com/a/dtd/414088-48088", "category": 26597, "amount": 26900, "description": "Developers in Vietnam are difficulty with Haskell, and Plutus programming languages, so it is challenging to start with building an application that integrates with Blockchain Cardano.", "f6_no_assessments": 16, "f6_rating": 4.541666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 2748, "q0": "with the uneven development in terms of awareness and proper knowledge of Blockchain, the programming languages ​​​​to be able to use Cardano's smart contracts, because of this limitation, the proposed team decided to apply for funding to, open free classes for knowledge related to the Cardano blockchain, create a premise for the community to be technically savvy and become a developer on the Cardano blockchain in the future, like so this proposal has completely solved the requirement of the challenge on a certain area.\n\nThe layout of the proposed group's solution is very convincing, stating why the course is needed, and what is the benefit of the course being organized, moreover the group has stated that, at present, classes are being held on a regular basis and there will normally be a fee for each student. all have specific explanations and evidence for those claims of the proposal.\nThe content in the lessons is carefully planned, the place to hold the sessions is predetermined, and the target group has the needs already in place, no need for marketing or communication,\n* this is in line with the analysis and direction of the topic that the community's assets are these lessons, the preparation for them to step into the big wave of \"Blockchain technology\", I envisioned for the future of how this proposal will provide valuable intellectual property to the community, it's really cool.\n \n Since this is an educational proposal, and it is also being operated normally, there is very little serious risk that can occur, but the proposal team also mentions the possible case of Covid 19. came back, and the very reasonable solution to completely eliminate that risk, by organizing an online lesson through the YouTube channel of the proposed group, so everything was planned, just waiting for the votes. and communities can begin to gather invaluable knowledge for themselves.", "q0r": 5, "q1": "there are 4 courses to be taken across multiple locations when this proposal is voted on for this funding round, each course has been identified with a specific location and scheduled time to hold, all planned Very clearly planned and announced.\n\n the sessions are held over two weekends, and the expenses for the trainers, the venue and the materials...etc are all clearly and transparently disclosed, in addition to the group's proposal for explanation. More about the $2,500 reservation cost, what will it be used for?, and if not where it will be stored, and for what purpose in the future, a footnote is required to avoid confusion. misunderstanding is not transparent.\n\nWith a core team of 1 main lecturer and 3 teaching assistants, all of whom are specifically assigned and provide personal information, with experience in previous lessons and long-term knowledge in the Blockchain industry, I believes that the lecturers of this proposed group will bring accurate and extensive knowledge to the community.", "q1r": 4, "q2": "The number of new developers signed up for the course, Number of developers able to practice with the Marlowe language, the above are metrics that measure the progress of the proposal for the community to track and verify, in addition to The proposal maker also claims that after the lessons, statistics will be aggregated, and tested by testing exercises to see how many developers can practice the Malowe language on their own. then write a public release report using the proposal's website links or social media platforms.\n  \nThe proposal has clearly defined goals for success, the number of developers able to program in the Marlowe language, along with measuring the number of developers participating in the Cardano ecosystem all increased through this proposal, it is the success of this proposal. In addition, it may be possible to create a platform for the growth of free classes like this in the future, as a result of the sessions that offer back to the community.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"id": 3083, "q0": "Knowledge and experience of programming languages, especially Haskell and Plutus Programming languages. It is a difficulty for application developers in the Cardano Ecosystem in the world and in Vietnam, building applications integrated with Blockchain Cardano is a challenge.\nProposed Marlowe Course for Vietnamese Devs to teach for free to make the Cardano blockchain easier for new developers, giving inexperienced developers a head start in the blockchain world. They can then build their own careers by designing applications that use Smart-contracts through the Marlowe programming language, or they can also look for work on other projects. Therefore, this proposal has effectively solved the challenge.", "q0r": 5, "q1": "The writer proposed in this project has many years of research on the Cardano blockchain, successfully organized many Blockchain and Crypto courses in Vietnam. There is evidence that many individual investors who attend the courses have solid background knowledge, high value investments, and a large and united individual investor community.\nThe budget request for this proposal is very reasonable and clear. The proposal will be to organize 4 courses within 6 months directly in Hanoi and Ho Chi Minh City. The budget for the proposal is $26,900 which is very reasonable, clear, and achieve the goal of the proposal.", "q1r": 5, "q2": "The information provided is sufficient for the assessment to assess the progress and success of the proposal over the 6-month period. The course schedule is very reasonable, organized in 2 big cities in Vietnam, Hanoi and Ho Chi Minh.\nThe content of the course is all basic knowledge such as Marlowe's core principles, Haskell, Plutus and Glow programming languages, how to write smart contracts.\nThe proposal gives a lot of evidence of current groups in action such as the FimiDev group for application developers with 55 members, the Blockchain and Crypto course that has been opened in Hanoi and Ho Chi Minh City since 2017. So it adds to the confidence of the proposal's success.", "q2r": 5, "assessor": "z_assessor_2397", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 3219, "q0": "The problem is clearly defined in the proposal. Match this challenge item. Due to some language problems, or the lack of tuition fees, it is difficult for most new developers in Vietnam to access and understand the Marlowe programming language. This is the first step for developers to dive deeper into the world of programming on the Cardano blockchain\n\nThe problem here meets one of the important requirements of the challenge. It is to attract and train Developers and developers to study and use Marlowe financial contract programming.\nThe scope of influence on the 1-language community. Scope of influence and development in Vietnam.\n Participants are new programmers developing on the Cardano platform who want to actively build for development on Cardano.\nIn line with the sustainable goal of attracting and increasing developers actively building on Cardano.\n\nRegarding the product of the project, it is proposed to create courses using the Marlowe programming language (Haskell, Plutus, and Glow) for new programmers on Cardano.\nProposal to add value to the Cardano ecosystem. With an increase in new developers joining development on Cardano.", "q0r": 5, "q1": "This proposal identifies several issues of the challenge and offers solutions and logical arguments. Specifics: Host free Marlowe courses with new developer Catalyst funding requirement.\nClear, reasonable timelines with specific goals. The average organization timeline is 2 months to organize 1 course at 2 locations at locations: Ha Noi, and Ho Chi Minh City in Vietnam.\n\nThe team has assigned work to each team member. They have the relevant experience for the position in this project. Team members are public and easily authenticate their identities. The team includes Mr. Do Manh Hung, founder of Fimi, a Plutus Pioneer, and a leader in learning and using the Marlowe programming language with many years of experience. Along with a team of teaching assistants are 4 supports in the course including San San, Tram Anh, and Hai Hung.\nThe group has assigned tasks to each member clearly per each person's skills and experience. The main teacher is Mr. Do Manh Hung. In addition, there are 3 teaching assistants, namely San San, Tram Anh, and Hai Hung.\n\nIn this proposal, some of the risks are outlined and there are solutions for some of them. For example, due to the Covid 19 pandemic, it is not possible to organize offline lessons. The proposal also offers a solution to organize those courses online through an online platform such as Zoom, etc. After the pandemic is under control, all students in the online course will be re-learned in other courses. next training course. Very good, because programming courses are often difficult to understand in terms of short-term acquisition and need to be supported and re-learned many times to increase interaction and absorption of knowledge.\nIn terms of revenue, in addition to Catalyst budget funding, there is also revenue from specialized consulting fees and one-on-one consultations for students/developers of project owners in need.\nThe proposal has a trial product and has positive feedback from the community. The product of this proposal has been successfully tested from paid courses.", "q1r": 4, "q2": "Expenses are explained and properly allocated.\nMetrics are clearly stated with specific numbers. Regarding the transparency of the measurement indicators, the community can check the indicators, and update the team's work progress through the statistics of the number of attendees, and the number of courses held (out of the total number of courses). for this budget application is 4 courses). A number of video views on the Youtube channel. The indexes are updated on a shared Google Sheet file for the community to view.\nThe success of the project is described in detail, and easy to understand. With increasing numbers of programmers, new developers in Vietnam can use the Marlowe programming language. Addressing the challenge of reducing the human resource supply of Cardano development projects in general.\nKPIs are easy to measure and easy to check. Specifically, through the number of new developers who have signed up / attended the course and the number of developers who can practice with the Marlowe language.\n\" This is a follow-up to the Fund 7 funded proposal that is \"Reward for Community Translators\" with an already Funded $18,000. I appreciate your Fund 7 proposal. So far That project, you guys still continue and develop well, with good reception and feedback from the community.\nIn addition, this is one of two proposals for funding to organize a free course. Another proposal is \"Blockchain Course for Vietnam Devs\" with the required amount of $22,400 also in this Fund 9.\"\nThe community can check the measurement indicators and the team's work progress through a Google Sheet file that everyone has access to easily update the progress and weekly data.\n The Marlowe course will take place immediately after being funded by Catalyst.", "q2r": 5, "assessor": "z_assessor_2412", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 3523, "q0": "The proposers want to build a marlowe vietnamese specific course to create more cardano blockchain specific devs into the fold. This is a great idea just like their other proposal that is a bit more general relating to blockchain devs. I belive both proposals have a place and would have a great impact in the ecosystem.\nThe proposers are aligned with the challene setting and woudln't require much funds to realize their idea and create a viatnamese specific course. The course programe is pretty straightforward covering the marlowe basics.\nThe end result will be more generated financial smartcontracts using marlowe so that's a good and most of all measurable KPI. The proposers have done some risk assessment, and I agree the biggest threat they could face is a second pandemic, because these courses will be live. On that note, I could suggest recording their sessions, because it might be usefull for other devs later on and would mitigate the risks.\nOverall this is a good proposal, targeting vietnam specifically, which I think is good, because some parts of the world can't be reached with english only mentality so it's great to see inclusion of other non-english-speaking countries as well. IMHO this is a worthy project that is sure to have an impact in the limited global space.", "q0r": 5, "q1": "The teachers leading the programme have regular and more than enough skills to carry out their mission and create a course. They do have previous experience teaching and one more course wouldn't be an issue. Both the teachers bring great credability to the project and it shows by the described course idea and rough milestones.\nThe budget is detailed enough to make me happy, and having seen quite a few proposals that's a rare occurance unfortunately. I think the prices are reasonable, although I'm not aware of the lifesile requirements in vietnam, but nonetheless it seems reasonable. There's a plan for 4 courses which should be enough with the timespan mentioned in the proposal. All the links and credentials are listed and I can always appreciate standing behind your work with your resume and face out front. I think this is a really important quality of each proposal that is often overlooked.\nFor future funding, I'd recommend to the proposers to think of a subscription model for their services, once they get a name for themselves and get things going, because every good business plan and long term solution to a problem needs to have a payment plan sooner or later. I'm not saying relying on project catalyst funding is bad, but rather that it's unreliable.\nOverall a feasible proposal. I wish the authors good luck in their quest to educate more of their fellow countrymen.", "q1r": 5, "q2": "Auditability is be greatly improved with a youtube account or any other social platform. My suggestion for the proposers would be to have as much presence and channels in the platforms as possible, because simply having a video of you teaching your course brings more trust to this and following projects you do. \nAs I've said for the other proposal as well, the definition of success needs work, because it quite vague. That makes it hard to measure progress and optimize later on. Also I'm almost sure this project could be a candidate for SDG funding, so I urge the authors to take a look and educate themselves on the SDG possibilities besides project catalyst, because it could be an alternative source of funding for them.\nOverall an auditable project with a few mentioned caveats, but worth doing.", "q2r": 4, "assessor": "z_assessor_2463", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 3713, "q0": "Vietnam is one of the countries with a very large number of people participating in the blockchain field. However, the number of people who understand and participate in the development of the Cardano system is not much. A major barrier for the development team is that learning the programming languages ​​Haskell and Plutus is relatively difficult for them in terms of language and cost. The cost of blockchain courses in Vietnam is relatively high compared to the general income level, and it is especially difficult for students to pay. Recommend Marlowe Course for Vietnam Devs is a good idea to help students, students and enthusiasts with blockchain technology easily access Cardano programming languages. Thereby, it is possible to attract them to participate in the development of the Cardano ecosystem and start a business with proposals on Catalyst.", "q0r": 5, "q1": "With more than 20 years of teaching experience of Do Manh Hung, along with an enthusiastic and energetic support team. Members' in-depth understanding of the Cardano ecosystem and the Haskell, Plutus programming languages. Information about the members participating in the proposal is also very clear and complete. I believe the team will successfully implement this proposal. The risk of epidemics that can affect the success of the proposal is also proposed by the group to be solved by organizing a very flexible zoom meeting. I appreciate this very much.", "q1r": 5, "q2": "The 4-course route given by the group is very specific and clear in terms of time and place. I believe the team has prepared very well for the success of this proposal. In addition, the use of the amount of $26,900 is also very transparent and clear. With the experience of using finance to successfully implement proposals in previous Catalyst funds, I believe this time the team will also make good use of the $26,900. What is missing is that you need to be more clear about the KPIs so that the community can easily measure and evaluate the success of the proposal. For example: Through the proposal, how many new members will be able to use Haskell and Plutus languages ​​through which to develop products on the Cardano ecosystem. I believe that if you have all these things, the community will appreciate you more.", "q2r": 4, "assessor": "z_assessor_2476", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 4615, "q0": "The proposal addresses the practical issue that IT students and developer resources now lack the practice environment and expertise needed to construct dApps on the blockchain platform. The proposal presents convincing arguments for the Challenge since blockchain is a new and less accessible industry, particularly for students who are future developers who lack access and expertise. The purpose of the Marlowe course, which intends to satisfy a challenge requirement, is to offer possibilities and entice developers to engage in the blockchain industry in general, and the Cardano ecosystem in particular. This is a great idea for IT students who are building a real environment and dApp development experience on the blockchain platform, so that the proposal may be developed and scaled up in the future. Students who complete the course will become competent and honest developers, therefore enhancing the Cardano community's quality. \nThe course assists and provides inexperienced programmers with a suitable and advantageous start in the blockchain area, bringing essential information and thinking about Crypto to make the right decisions in investing and practicing, avoiding being scammed. Because the proponent of this course is experienced, they have previously organized courses for 1000 students over a 5-year period. Submit a proposal to provide adequate explanations and reasons. The proposed group also addressed the possibility of not being able to carry out the training as planned due to the pandemic. The proponent's proposal eliminates this risk by organizing the online course using the Zoom platform. \nPersonally, I see another risk that the proponent should consider: as the world's top fuel prices rise, so will inflation in Vietnam, forcing the cost of services to employ human resources and locations to rise appropriately. As a result, the proponent may plan for this risk. This is a great concept for Cardano ecosystem developers who propose the course as experienced experts with strong arguments, thus I give this piece 5 points.\n", "q0r": 5, "q1": "The proposal provides for four courses to be held over the period of five to six months. The proponent plans to offer a course within the next 5-6 months. This is a feasible timetable. The first class was held in September or October 2022 in Hanoi, while the second class was held on 11 or December 2022 in Ho Chi Minh City. The third session will be conducted in Hanoi in January or February 2023, while the fourth session will be held in Ho Chi Minh City in February or March 2023. Because Hanoi and Ho Chi Minh City are two major cities in Vietnam with numerous technological centers and universities, this is a particular and viable approach that will attract more students and developers to enroll in the course.\n The proposal has not yet provided channels of communication to monitor the project's progress. The project's financing budget is $26,900, which is less than 5% of the Challenge budget. The budget blueprint offered by the proposal is generally reasonable, however there are two parts that require clarification: advisory and contingency. When organizing the course, the proponent should describe what the responsibility of choosing a counselor involves. In terms of contingency budgets, as I mentioned in the efficiency section, this is the part of the budget that should be accessible for this plan; the proponent only has to indicate that this cost is sufficient for those expenses that can be increased further due to inflation.\n The proposed group consists of four members who have been allocated certain responsibilities that are appropriate for them. Do Manh Hung is the proposal's leader, and he is a person who has many positive activities for the Cardano Community in Vietnam, such as a Telegram group with nearly 3000 members who exchange and actively discuss Cardano's developments, or the Fimi Youtube channel, which has 15k followers and provides up-to-date Cardano translations; as far as I know, this is another proposal sponsored by Catalyst.\nIn addition, the proponent has 13 other proposals that will benefit the community. This is a fresh proposal, and the proposing team has no test product yet. There are a few aspects in the plan that need to be addressed, but nothing major enough that the project's feasibility is affected. As a result, I assigned myself 4 points.\n", "q1r": 4, "q2": "The proposal provides project success metrics such as the number of new developers that have signed up for the course. Another indicator is the amount of developers who are familiar with the Marlowe programming language. These measurement indicators are simple to verify. Furthermore, the proposal clearly illustrates the course's success, since hundreds of new developers in Vietnam can now use the Marlowe programming language. This creates a new generation of brilliant developers in Vietnam who can work on other understaffed projects. One of Cardano's requirements for the Challenge success is to attract more new developers to the ecosystem, which is tied to the Challenge. This is a brand-new idea with no existing test product. As a result, the project's transparency weakens. In this part, I give 4 points.", "q2r": 4, "assessor": "z_assessor_2576", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 5941, "q0": "The proposal is well aligned with the challenge setting of the Dev Ecosystem because it provides the Marlowe/Haskell Course for Vietnamese Devs in the Vietnamese language. This is very important for the Devs community especially after Cardano has deployed Smart Contract since the 'Alonzo' hark fork since September 2021 and going into the Goguen era.  It is very promising as the proposal also mentioned covering related topics of Haskell, Plutus scripts, and Glow. This is a step back to slow down and very healthy for the Devs to back to the basics and build their knowledge in an official and foundational way. The solution is very to the point as the proposer state out the outcome is that \"thousands of Vietnamese trainees would have the opportunity to study with zero tuition fees about Cardano Smart Contract. Therefore, more and more talented and honest developers will participate in Cardano Community. This is foundational as the ecosystem will very soon go into Varsil's hard fork with more capabilities' requirements. The risk is also very well articulated as the class mostly in the face-to-face traditional manner. The team also prepare the Zoom platform as a backup yet less preferable option because of the less interaction. It is a recommendation that the team would be more reliable and trustworthy if they can share the original source of the document/material pieces of training or similar agenda of the coursework.", "q0r": 5, "q1": "Although the core team who will work directly on the project is a lean team with 5 members, the team has shown a track record of more than 5 years of course work with more than 1000 trainees across Vietnam and the trainees' testimonials were very positive. The milestones were clearly mapped out in terms of four 2-day courses in 4 periods until March 2023, in which the courses will be held offline in two locations Ho Chi Minh city and Ha Noi Vietnam. Regarding the budget, it is broken down by the key tasks for the preparation of the classes. What could have been improved is the breaking down of the budget by month in regards to the budget allocation of Catalyst will be monthly on the 24th day in ADA, this would make it more feasible for the committed deployment of the proposal given the market fluctuation of ADA price. Moreover, it is encouraged that there should be a more detailed plan in the digital marketing part to ensure the number of attendants as an Input for the courses as the numbers of Devs community is very different and harder to approach compared to the mass public learners.", "q1r": 5, "q2": "The KPI/OKR indicators are the number of new Devs who register for the course and the number of Devs who can apply the Marlowe language. It is somewhat vague from the PA point of view for the 'ability to practice the Marlowe languages\", what should have been improved is the final test and the quantitative to see the post-test results of the course. As mentioned in feasibility, it is also needed an entrance survey/course so that the team can get a grasp understanding of the Devs' needs before joining the Marlowe course. The report channels should be more transparent and updated more frequently instead of one report at the end of the proposal in March 2023, the PA already entered the Telegram group of the current pools of Devs, it is just more than 50 users at the time of the PA entering the group. There should be much more marketing world to attract the Dev into the course. The end success is inspiring, and it could have been more quantitative as the output of the tracked KPI, hundreds of Vietnamese Devs who can practice the Marlowe programming languages. All in all, the auditability part should be improved as per PA's suggestion, in overall it is a very promising and encouraging proposal.", "q2r": 4, "assessor": "z_assessor_2759", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5992, "q0": "The idea of ​​the proposal is to organize free courses on Marlowe. More about Marlowe, Marlowe is a DSL domain-specific language embedded in Haskell. They provide financial contracts for the blockchain, helping people writing can be easily programmed without requiring too much expertise. The funding funded for this proposal will be used entirely to organize FREE courses. This will attract a large number of people, a large number of participants, especially interns in Vietnam to accumulate this useful source of knowledge. Adding more programming engineers for companies building products on the Cardano blockchain.\nI completely agree with the project's impact on the goals that the \"Developer Ecosystem\" challenge offers. The proposal has a great meaning, continuing the spirit of IOG that turns all intellectual property into assets for society.", "q0r": 5, "q1": "We will have 4 courses organized alternately in 2 locations in Vietnam, Hanoi and Ho Chi Minh City. The expected implementation time is about 5-6 months from the time of funding. Such a time division is to accommodate 2 geographical locations located far apart in Vietnam, helping the preparation for the course be carried out in the most successful way.\nThe cost of conducting the courses has been specified in detail, including hard costs such as air tickets, materials, room rental fees and lecturer costs. They are very reasonable and I have no opinion on the matter.\n\nThe team behind this proposal has a wealth of experience and skills to carry out the project. Mr.Do Manh Hung is the leader of the Fimi community group with more than 2700 members, and he is also a Plutus pioneer, pool operator (SPO) and has 11 years of programming experience. Therefore, the professionalism of the team is guaranteed.", "q1r": 5, "q2": "The information to track and check for the project is presented in a fairly complete and detailed way. We can check the team members. We have the data to measure the success of the project (though we have to wait until the end of the course to have the data) like the number of new developers, the number of developers who can use Marlowe. I would like to add one more criterion to increase the count measure project success by the number of Dapp build proposals submitted to Catalyst.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 8242, "q0": "\"As the course is one of the next steps of former project, which create chances for Vietnamese developers to get familiar with Haskell and Plutus Programming languages. This proposal has a meaning when it aims to popularize the courses for Vietnamese trainees who tends to work professionally in the Blockchain platform and increase a number of talented and honest developers for Cardano community. As the project inherited from former success, the proposer can add more case-studies to prove the effectiveness of the solutions. \nKey metrics of the project are currently similar to the expectations after completing the course. Expectation ideas are aligned with what the project tends to do to solve the challenge. However, it still lacks quantitative and qualitative indicators, which help them track the progress easier. So, it will be better to put concrete indicators in the proposal. \nRisk management already brainstormed and included by proposal’s team. Mostly, they challenged with the social distancing if happened due to outbreak of pandemic, however, solutions were mentioned clearly and feasibly. Intention of expansion was mentioned in general manner. So, the proposer can add more detailed information about the future. \n\"", "q0r": 4, "q1": "\"In proposal, the timeline is clarified with tentative organizing date and venue. It will help readers believe in the intention, and feel easy when tracking the progress. By the way, it is insufficient when the plan is mentioned only by what is going to be done. The proposer need to include how they are going to visualize their plan. \nBudget is broken down by the proposer. Instead of preparing budget on timeline, they choose the way of breaking down budget into categories such as trainer fee, logistics, supporters’ fee, and so on.. This way is helpful in confirming the feasible rate of budget allocation. It is suggested that the proposer can add more detailed information on each category.\nHuman resource will be the key success factor for the course. However, the detailed information is still very limited, including both lecturer and support team. The profile put in the proposal is inaccessible. The proposer need to check it once again and update it. In addition, it is better to add more information about how the team will work together. And one strong point is those team already participated in another round of Cardano so, they might work seriously for this project implementation. \n\"", "q1r": 3, "q2": "\"Proposer mentioned about how they measure the project’s success in terms of checking the number of course’s participants and the number of application by using Marlowe language. It will be better if they can add expected number and percentage to make all metrics be measurable. At the same time, the way of explaining the success is a part of others project which already implemented in the past and tend to continue in future. \nThis proposal is the first entry of series of courses which might be organized with budget funded by Catalyst. There will be a careful process to consider again about the courses with potential expansion.\n\"", "q2r": 3, "assessor": "z_assessor_2969", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8446, "q0": "I admire the goals of this project, which is to organize Marlowe and Haskell training classes for developers in Vietnam. Marlowe is a utility tool created by Cardano to facilitate the development of smart contracts with its intelligent drag-and-drop interface.\nHowever, it is not yet fully developed and widely implemented. If the community approves this proposal, hundreds of trainees in Vietnam will be able to learn the programming language for free, giving them a head start in building apps that use Smart-contracts. The proposer has also outlined how the initiative will assist the Cardano ecosystem by encouraging more Vietnamese developers to join in Catalyst. Therefore, I am confident that this idea meets the requirements of the challenge.", "q0r": 5, "q1": "The proposal's team has proved they have the necessary knowledge and experience to complete the project according to its goals. The budget is appropriate for the project's scope, but I think the team should give more information about marketing strategy to better assess the marketing cost, as well as the utilization of renting cost in case of covid 19 outbreak. \nThere will be four courses in six months and will be held on the weekend . I believe this is an appropriate time table since many people might have to work on weekdays.", "q1r": 4, "q2": "The proposal presents the key performance indicators related to the work outcomes in a way that is straightforward to grasp. The group has compiled list of methods for maintaining student records in order to evaluate class effectiveness. I think it would be helpful if the team provided more information about where they plan to post tracking report so that the community can readily follow them.\nEventually, I'm confident that the team will be able to complete this project successfully. If this is the case, it will encourage more programmers to join the Cardano community, which will benefit the entire network.", "q2r": 5, "assessor": "z_assessor_2985", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8654, "q0": "The purpose and audience of this project are clear and strongly linked to the requirements of this Challenge. The proponent's prospect is through the Haskell and Plutus programming language courses for new developers in Vietnam to give them a good start in joining and contributing on the Cardano blockchain. Having implemented Blockchain courses before and owning a fairly solid student base (1000 people) shows the proposer's ability to well implement the project according to the proposed plan as well as the right approach target audience from the outset. The content of the course is also clearly presented and the learning path is designed to suit the target audience and their need to learn from basic to advance. The risk of the covid 19 epidemic affecting the organization of the course has also been thoroughly studied by the proponent and offered flexible alternatives.", "q0r": 5, "q1": "I have no doubts about the proposer's ability to execute this project because the successful implementation of previous similar courses and building a sustainable community of students has proven his ability to work. I was just wondering as mentioned, the proponent is also requesting funding for another Blockchain learning program in this Challenge, and the two courses are held almost at the same time (I've looked through the development plan that proposal). So the question is, if both projects receive funding, how will the proponents balance the organizing time for the two courses. The cost allocation plan is pretty clear about which work/resource items will be divided. However, the author still needs to clarify the number of working hours of the working positions/the number of days where the teaching will take place for each course in order to be able to better assess the reasonableness of expenses such as costs of lecturers/support groups, room rental fees.", "q1r": 4, "q2": "The proponent needs to go a step further in clarifying the success metrics/audit roadmap for the project, with a foundation of KPIs that are relevant to the project's inputs and outputs, the author needs to build addition the milestones for the audit, the targets for the KPIs. The plus point is that the proponent has made commitments on reporting progress and project results to the community.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8820, "q0": "The project presented as free course is great deal where students get to learn languages from basic form , As we Plutus and Haskell languages are even difficult for expert developers sometimes, and hence directly leaping into such projects/languages will no way keep students steady , it will still create more chaos and uneasiness in learning , hence by teaching Marlowe which is used for modeling financial instruments as smart contracts on a blockchain. where it is used to designed for people who are business engineers or subject experts can be a better option which can help the students to make the carrier out of it Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Teaching any new course related to development of cardano eco system dApps is never an easy task, where most of the students loose interest on the way due to difficulties of technicality present in the language, the only challenge that the team might encounter is that students might be careless or doesn't show much of the interest towards project as it available for free.\nOther than that the proposer himself has Hands-on experience with the Marlowe language, and even has more than 20 years of teaching experience. Hence, With given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer could have introduced his team in much more efficient way where it could have added boost to the audit , other than that the audit contains proposed solution in very detailed manner, The proposal has displayed us the content which will be the team covering and has displayed how they are making students to get in touch with Plutus and Haskell without creating any uneasiness while learning with Q&A session held at last via telegram poling ,this shows that audit has every predetermined data ready .With decent budget breaking and timeline provided the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9582, "q0": "The problem is that it is difficult for developers to build applications using Haskell and Plutus.\nThe solution to the problem is to organize a free course on Blockchain Cardano. The course is held in two of Vietnam's largest centers, Hanoi capital, and Ho Chi Minh City.\nThe proposal is aimed at Vietnamese programmers who need to improve their knowledge of Blockchain, especially about the Marlowe language, to apply to programming work.\nThe project is also in line with the goal of catalyst in fund 9. The project helps to develop the community, building a community that is willing and able to contribute to the development of Cardano\nI give 5 points.", "q0r": 5, "q1": "The main risk affecting the implementation of the proposal is the risk of an outbreak. The solution offered to solve the risk is to organize an online course. This solution solves the risk well.\n The team consists of Mr. Do Manh Hung with experience in Finance, Community Management, Plutus Pioneer, Influencing and Inspiring Coaches, and Fimi Course Lead Instructor. Especially the team includes Fimi Community: Established for more than five years with 120 videos, more than 15 thousand subscribers, 554,000 views, and more than 138 thousand watch hours. The three carefully selected Fimi Core-teams to have Cardano expertise.\nEnthusiastic team, vibrant community, with a lot of content posted daily. The work is divided and appropriate for the members. The members are clearly divided into tasks by each person's experience. Everyone can check the information quickly through the attached link.\nPlan to organize a total of 4 courses. an average of two months a class is held. Mr. Do Manh Hung has organized many Cardano courses before. I once took a lesson. The courses have quality content, easy-to-understand communication, and professional organization. I believe that with this experience and knowledge, the project will achieve success.", "q1r": 5, "q2": "The proposal requires a total amount of $26,900 to organize four training sessions in Vietnam. The items are complete and detailed. The budget sheet helps me visualize the spending items of the proposal. All expenditures have a good reason and sufficient explanation. Expense is divided into eight categories, each providing a corresponding cost calculation.\nIndicators measuring work progress are clearly stated, explaining the indicator's meaning and measurement. There are two metrics to measure. The first is the number of students enrolled in the course. The second is the number of developers who can practice with the Marlowe language. Measure those indicators by tracking through the list of participants and reviewing the results of the exercises. The way of measurement is capable of accurate and easy measurement.\nIt will be perfect if they provide more links or places to store and publish the results so that everyone can check the progress and results of the work.", "q2r": 5, "assessor": "z_assessor_3067", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10552, "q0": "“Marlowe Course for Vietnam Devs” is a good idea, oriented and in my opinion, it meets the challenge “Developer Ecosystem”. The beginning of the proposal emphasized an important and quite interesting issue today, that is: “Developers in Vietnam are difficulty with Haskell, and Plutus programming languages, so it is challenging to start with building an application that integrates with Blockchain Cardano.” I completely agree with this issue because Blockchain technology is still a relatively new concept for many people. I just started to know and learn about Blockchain not long ago. However, through the process of researching, I realized that Blockchain technology, Cardano is a very potential ecosystem and has more and more practical applications in life. Currently, many newcomers are still vague in finding direction, but because they do not have enough knowledge and conditions to make them lose their direction, or fall into scam traps, this makes them even more distant from leaving the community, this is quite a pity. Therefore, providing free Marlowe courses, and helping many Vietnamese people to learn and write smart contracts on the Cardano platform by themselves is very necessary and suitable for this challenge. The proponent stated the fact that 5 years ago there were more than 1000 students registered for the course and I believe that by now this number has increased a lot. Thereby, it can be seen that the impact of the problem is relatively large. The course is held regularly every 2 months and is held in big cities such as Hanoi and Ho Chi Minh, where many students and workers gather. Moreover, the time to organize the course on the weekend will be very convenient for students who register to participate. The content of the course is also prepared and planned in detail by the proponent, in a logical sequence. The solution proposed by the proponent I found identified most of the problems of this challenge. By showing the actual situation, the impact of the problem has been shown. The course will give inexperienced programmers a good start in the Blockchain world, then when they have enough knowledge and practical experience, they will be able to build and develop their careers or they can form and join other project groups. I think that, when they have individual successes of their own, it is also the overall success of the Cardano Blockchain community. In order to successfully implement the project, the proponent also anticipated the risks. The potential risk mentioned here is that the outbreak of the Covid 19 pandemic will prevent the course from being held on schedule. However, along with those risks, the proposed team also has solutions and solutions to overcome that difficulty by opening online courses. In this part, my personal opinion is that currently, we are mainly organizing offline courses in places like Hanoi and Ho Chi Minh, only opening online classes when there is an outbreak of disease. However, in other provinces, when there are not enough conditions and opportunities to organize an offline course, if possible, the group will also organize an online course so that those who are not present in Hanoi and Ho Chi Minh can also register to attend. I think it's also an option to expand Cardano's popularity and influence on the community.\n", "q0r": 5, "q1": "This proposal has a relatively specific and clear roadmap and action plan. The proponent has divided it into 4 courses, with an estimated start time and specific venue so that students can easily track and schedule their registration. However, as I said above, if possible, the group should plan to open online courses not only during the epidemic period to attract more students in these other provinces, although the similarities, the interaction between students and teachers is limited, making it less effective than face-to-face learning, but still ensuring the necessary background knowledge for students. Regarding the project's budget, the Proposer also gave a clear and reasonable allocation plan and the purpose of using that budget. In addition, the team also has a provision of $2,500, which will help the team deal more quickly and flexibly in unexpected situations or also cost to expand the training scale and training method when necessary. I am very supportive of this way of organizing and planning. About the participating team including Mr. Do Manh Hung and the FIMI support team. The information is presented and the identity is easily verified through the media such as Telegram or Youtube channel. Recently, I am also learning more about his training courses and the FIMI community is also the one who led me to the Cardano ecosystem because of FIMI's influence in the financial sector in general and in the Blockchain field very big. I think that the experience and capacity of Mr. Do Manh Hung and the FIMI community who have had many proposals from previous Funds, it will be a great advantage to implement this project.\n", "q1r": 4, "q2": "In order to measure the progress and success of the project, the proponent has provided criteria that are easy to measure and easy to check. That is, the number of new developers signed up for the course and the number of developers who can practice with the Marlowe language. This is a new proposal, the first time FIMI requires a Marlow course, but with the capabilities and experience that have done other proposals before, I think the probability of the project's success will be high. The success of the project is very clearly defined, that is: hundreds of new developers in Vietnam can practice with the Marlowe programming language to help them develop their careers, and the team creates a team of talented developers. New talented developers in Vietnam can work with other projects that are lacking in human resources. Thereby, the information provided by the group is very clear, transparent, and has high auditability.\n", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 12386, "q0": "The aim of this proposal is to give more education to developers in Vietnam regarding the technical aspect of the Cardano blockchain, such as Haskell, Plutus, and Marlowe programming language. This gap in skills make it hard for developers to start building products that are integrated in Cardano. The proposed solution is to conduct courses explaining the Marlowe language to Vietnam developers to raise their technical knowledge of the Cardano blockchain. Like the blockchain course that has also been proposed in this Fund, the purpose of this proposal is to ask for a funding so that these courses can be given out for free (usually participants pay a fee of 400 USD). Each course will be held in 2 weekend days and the proposer has also provided a syllabus that will be discussed in the courses, which includes introduction to Marlowe and smart contracts, using basic Marlowe CLI, how to write smart contracts, case studies and practical exercises (loan, monthly payment, auction, swaps, simple lock ADA), as well as other topics (Haskell, Plutus, Glow). From the syllabus given, it seems that the purpose of this project is to give basic knowledge and skills of using the Marlowe programming language as an introductory course for Vietnam developers to get into the Cardano blockchain. Overall, I think this proposal is aligned with the challenge setting objective of getting “a bigger talent pool of developers that Catalyst projects can collaborate with and turn project concepts/Proof of concept into successful protocols which would enhance the growth of Cardano” by providing fundamental techincal knowledge and practical exercises for developers interested in the Cardano blockchain.", "q0r": 4, "q1": "The team consists of a main lecturer who has experience with Cardano, such as the Plutus Pioneer program as well as experience as a trainer. In the proposal, there was an attached website showing the proposer’s experience conducting courses regarding blockchain and crypto. This shows that the proposer has the relevant skills that are needed to implement this project. \n\n(Note: A lot of the assessment in this feasibility section will be very similar to other proposal by the same proposer during this fund, “Blockchain Course for Vietnam Devs”, since the breakdown points are very similar)\n\nThe proposer provided a roadmap of this project going over the timeline and key milestones. There will be 4 courses that will be done in Hanoi and Ho Chi Minh (2 courses in each city). The 1st course will be in Sep or Oct 2022, the 2nd course in Nov or Dec 2022, the 3rd course in Jan or Feb 2023, and the 4th course in Feb or Mar 2023. Considering the courses will be done in 2 weekend days, the schedule for each event seems feasible to be completed since it’s apart by around 1 month for logistics and planning. However, I’d have liked if the proposer provided more details regarding the logistic and planning stages, such as reserving the room, preparing equipment, etc. especially since the timeline of this proposal is the same as the other proposal submitted so more details regarding how these two projects timeline will line up would have been appreciated. Overall, the timeline provided is adequate and seems feasible to be completed in a vacuum.    \n\nThe budget of 26900 USD has been requested for this project and has been broken down into several items. This includes the lecturers fee (3000 USD per course), flight and accommodation (500 USD per course), documents (100 USD per course), room reservation fee (1200 USD per course), digital marketing (500 USD per course), and 2000 USD each for advisor and backup budget. The budget has been broken down into identifiable items however I’d prefer if there were more details for some of the items. For example, the budget for digital marketing could have been expanded more regarding what type of digital marketing (i.e. short videos, digital poster, social media page, etc.) will be done so the cost can be judged more clearly.    \n\nThe main risk to be considered is the covid pandemic which would hinder the events since it will be an offline course and the proposer has identified this and proposed that the course will be held online at first on the set date in this proposal and will be held again later for the same students offline once it is possible again. This shows that the proposer knows the risk of running an offline event and has come up with the solution to hold the event while still ensuring that students can still participate fully in the course at a later date.  \n\nBased on the points above, I’m in agreement over the feasibility aspect of this project.", "q1r": 4, "q2": "The KPIs chosen as a way to measure the success of this project include metrics such as the “number of new registered participants” and the “number of developers able to practice Marlowe language”. The metrics chosen by the proposer were well defined and relevant to measure the success of this project regarding the outreach the project has through the number of new developer participants and the success rate of this project via the Marlowe exercise evaluation. Overall, I think the KPIs are adequate enough to measure the project performance. ", "q2r": 5, "assessor": "z_assessor_3408", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14640, "q0": "In general, the proposal meets the objectives of the challenge settings of this round and it makes the Cardano easy and attracts a lot of talented developers to dive deeper into the Cardano Blockchain world.\nOn the one hand, The solution provided the Haskell and Plutus course to the developers community in Vietnam and brings a wide range of benefits for The Cardano ecosystem. Firstly, The team gives knowledge and the right mindset to the community of crypto investors in Vietnam to avoid scam blockchain projects. There are over 1000 trainees who have joined other courses in the last 5 years. And now, they want a free course instead of trainees having to pay a tuition fee of 10,000,000 VND (~400 USD) as an IOG company and they also said that if this proposal is funded, thousands of Vietnamese trainees will learn free. The course will be held on 2 weekend days in Ha Noi and Ho Chi Minh City. They transfer the contents of the program and check student capacity through case study and practical exercises. At the same time, the team members support new trainees by organizing questions and asking talk shows based on the Telegram Online platform. Likewise, the proposal also shows relevant links, media and videos on GitHub and YouTube websites to provide to detail information. However, I do not see the team mentioning the number of trainees per course, lesson duration, number of lessons, how many students maximum or what is the minimum number of students before the course starts?\nIn terms of addressing the challenge, It is a great idea because the course addresses the challenge. To be more specific, the course not only provides knowledge, skills, but also creates a good background to seek more job opportunities in the blockchain world. \nAs for the main risk, the project shows the outbreak of the Covid-19 pandemic is one of the main reasons affecting the development of the program. Nevertheless, the team solved this problem by online teaching through Zoom platform, which leads to ensure the schedule of the proposal. Besides, if the pandemic controlled, the trainees come back class to join in face-to-face course.", "q0r": 4, "q1": "It can be seen that from the ideas mentioned above, I believe that the proposal can achieve what they aimed before.\nFirst of all, the plan designed detailed information, clearly and timeline of the project. To be more specific, the team orgazini 4 courses within 6 month in two big cities of Vietnam( Ha Noi and Ho Chi Minh) and to be held in March 2023, then, report to the Catalyst as a closed proposal. However, the team does not hold how many trainees per course, the number of lessons, how many hours per lesson,… I think that if the proposal can explain or provide detailed information for this problem, the feasibility will increase and improve the persuasiveness of the plan.\nAs for the proposal budget, which is reasonable for the money that they call the total amount $26.900 for investment in the plan. In addition, they also listed spending activities in a clearly, detailed and suitable way. In terms of Human Resources of the team, the proposal identity is allocation positioned, the number of staff and who is in the team now. Meanwhile, Do Manh Hung- a team member with the understanding of deep knowledge in Cardano blockchain, Marlowe language and over 20 years experience teaching. At the same time, with the support of the Fimi team, namely three members: San san, Tram Anh and Hai Hung with responsibilities for ensuring the course to run and perfect. The proposal said that they will come back in the next round to find a new investment to expand the market and attract more and more the developers to take part in Marlowe language. Besides, the team also funded from the previous fund of catalyst and in this round, they have submitted a lot of proposals to call for investment. This leads to the fact that they are serious with the project and target that they aimed for. In conclusion, the ideas are designed easily to understand, transparent and Coinciding with the plan. ", "q1r": 4, "q2": "It can be seen that the project provided measured methods to follow the development of the proposal. The plan focuses on managing information and analysis based on the platform. For example, the number of developers registered and saved in a file or check homework to know how many developers can practice Marlowe language. It allows audibility of the proposal easily. Besides, the writer also mentioned the milestones or timeline to reach their goal after doing 4 courses. Proposals not only add more Marlowe knowledge and improve level, but also provide potential Vietnam developers to work and effort to the project of the cardano ecosystem. However, this proposal is not rated in Sustainable Development Goals.", "q2r": 4, "assessor": "z_assessor_4077", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Introducing a free course to make the Cardano blockchain easy for new developers. This is the first step for talented developers to dive deeper into the Cardano blockchain world.", "experience": "There are many years of research on the Cardano blockchain\nHands-on experience with the Marlowe language.\nHas more than 20 years of teaching experience."}