{"id": 414144, "author": "michele.nuzzi", "title": "(plu-ts) full Typescript off-chain", "url": "https://cardano.ideascale.com/a/dtd/414144-48088", "category": 26597, "amount": 68160, "description": "at the moment few options are available to write off-chain code, all with important drawbacks, and none supporting ts (or js) directly, which in many cases higher the learning curve.", "f6_no_assessments": 6, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1424, "q0": "This proposal seeks to solve the problem of writing offchain code in typescript, postulating that no such solution currently exists. The proposer offers a video explaining that this solution will allow dapps to run entirely client side and goes over some current solutions and contrasts their shortcomings; A very specific example of what the library code would look like is provided, showing how the API would create a delegation transaction - but, this does not really illustrate how an end-user developing a Dapp would be able to use this to do some kind of interaction with their smart contracts. The example looks like it queries the blockfrost API which is confusing to the decentralization argument previously provided. It would be useful to show a use case of the problem this solves for Dapp developers by describing at a high level how they would go about implementing off-chain code using another method (like PAB) and contrasting it with how they would go about doing it with the proposed method. ", "q0r": 3, "q1": "The proposer is the lead developer on another project, Cardano-Trace which was funded in Fund 8.The proposer seems to be knowledgeable on the topic and showcases some technical competance as a maintainer for cardano-wallet-interface. The proposal itself however, while providing a pretty detailed breakdown of the work to be done, presents the work to be done as straightforward and does not address any risks or challenges; This is a bit worrying as it may indicate a lack of deeper understanding of the problem at hand - i.e. if this problem was so straightforward, and the result so useful, why has it not been implemented yet? The proposer breaks down the budget into an hourly wage; since the proposer has other proposals in Fund 8 and 9 it would be good to show how the overlap between these projects would be handled and perhaps modify the timeline and budget to reflect this.", "q1r": 3, "q2": "The proposer is a single Pool node Operator and is active on several social media channels where they provide updates on their projects including twitter and youtube. The videos seem to be of good quality and provide useful information. If the proposer continues to do that for this project, it would help audit the progress of the project. ", "q2r": 5, "assessor": "z_assessor_2242", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for your assessment, it's rare seeing someone who actually reads the proposal before assessing it these days!\r\n\r\nI would like to make some clarifications.\r\n\r\nthe provided examples are not intended as documentation of the final product, those are useful in order to give an idea of what is meant by \"high-level functions\" and \"low-level interface\", that is why no practical example is included on how it would be possible to deploy a dApp.\r\n\r\nregarding querying blockfrost, the library wants to make life easier for Cardano developers, and for this reason, it will ship with some predefined \"BlockchainQuerier\" instances since it is often useful to query the blockchain while writing off-chain code.\r\n\r\nAny developer will be able to create their own instances of the `BlockchainQuerier` but they won't need to write a BlockchainQuerier instance for well-known services such as Blockfrost or Koios.\r\n\r\nTo clarify then the \"BlockfrostBlockchainQuerier\" is provided as an **OPTION** in order to make the development process easier, but it will be encouraged to set up decentralized backends in order to query the Cardano  Blockchain.\r\n\r\nregarding the Cardano-trace found 8 proposals, the development phase is almost completed, the smart contract are ready and the UI is not intensive;\r\n"}, {"id": 2754, "q0": "\"Understanding and seeing the disadvantages of writing smart contracts off-chain, to meet the requirements of the challenge and overcome the limitations of writing Off-chain code,\n  proposed provided a Typescript library, for writing off-chain code, minimizing dependencies.\n  The proposal's statement about the limitations of writing code off-chain at the moment is: it requires a lot of additional work and can also be difficult to integrate for new projects that aren't yet mastered.\n The proposed solution is to create a library that instructs how to use it, for example: a high-level function can optionally be used to get data as transaction parameters, a lower-level transaction generator will remains available for personalized transactions, making things possible\n   *The explanation of the proposed solution is very honest and easy to understand with examples including video explanations with pictures with practical explanations. however in the explanation of this proposal the team did not do as well as the (plu-ts) Typescript Smart Contract\"\" proposal did, in the proposed risk section it is mentioned that the idea remains the same. nothing new, that's not enough, it's very important to explain if you changed any methods, or keep the same and better explain how this solution will solve it as described in the section above. The problem is, if there is a change, the group needs to compare specific methods and explain in detail about them. Therefore, it is necessary for the group to explain more in this part, if only keeping the status quo of those methods, the team should emphasize more on creating video tutorials, not changing any new methods for more specificity. and the methods are the same, the risk they have all seen and experienced to overcome it. \"\"\"", "q0r": 3, "q1": "I don't have any comments on the team and roadmap sections of this proposal, but have a few compliments on the detailed budget proposal and ideas I've shared with the team on your other proposal. Along with this challenge, it is great to have a backup plan for Cardano's network upgrades, which will reduce the undue risk of a lack of budget when new updates arise. upgrade. However, if possible, you should combine or consult with the Cardano developers in charge of engineering for upcoming upgrades, so you will know in advance what new features are about to be updated.", "q1r": 5, "q2": "very proactive from the proposal team, I very much applaud this initiative's self-discipline as it claims to support all of the project's progress and success metrics on the website platform. social media, Youtube, and committed to open source so anyone can access and verify, the great thing is that the team has committed to having weekly updated videos on Youtube. The success of this proposal is the acceptance of this library by Dapp developers.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 12, "ne": 2, "ng": 5, "nfo": 5, "vca_o": 1, "reply": "I really appreciated your feedback in the Impact/Alignment section\r\n\r\nI'll definitely pay more attention to the method documentation and changes over the development phase!\r\n\r\nI'm in touch with many great Cardano developers using channels like Twitter and Discord, but I'll try to further increase this presence as you suggested.\r\n\r\na sincere Thank you for your assessment"}, {"id": 3526, "q0": "The proposer want so create a typescript library to enable off-chain. Off-chain meaning that the smart-contract validations would still be written in plutus (haskell). That means the library would have limited usage and impact, because it wouldn't consern itself with onchain data which will probably be set as bytecode directly. It's a good idea, because it will provide some perks like not needing a Plutus Application Backend for some of the operations but not all of them relating to the meat of the applications using smart contracts which is most if not all of the dapps.\nNevertheless I think this is a brave effort and a great idea, because it would have some benefits for the cardano dev community, but they will be limited. I do remember seeing this proposal in the last fund 8 (https://cardano.ideascale.com/c/idea/396949), and unfortunately I don't see the necessary improvement to the proposal. The short of it is, that it's too technical limiting the voters ability to make their choice. I still don't think the problem is elaborated good enough, because a regular non-tech person, wouldn't understand the problem or the need for a solution, limiting the range of reach for this proposal.\nThe proposal could do a better job explaining the terms used, and the expected benefit after it's implementation, because otherwise the KPIs lack context. The proposal is in line with the challenge settings and I do believe this is the right place for it after some polishing is done.\nI suggest to the proposer to think about making the proposal more understandable and explaining the problem and solution in simpler terms with non-code examples. Overall I'm left unsure about this proposals impact over the community.\n", "q0r": 3, "q1": "The project shows a detailed roadmap including many of the technical details necessary for the final implementation, which is great, and as a developer I do appreciate the effort. Considering the work that needs to be done as described in the roadmap IMHO it seems difficult for one person alone as it's stated in the proposal. I didn't like the fact no links or skillset is provided in both of the proposals I've seen so far, (this one and https://cardano.ideascale.com/c/idea/414103). I wasn't able to verify the proposer has the necerssary skillset to implement all the things mentioned in this proposal. I looked through the github repositories and I watched quite a few of the youtube videos but there was not much coding or showing of technical skills involved.\nThe goal of integration with browsers is great, but a more detailed explanation is missing. I see a description of the problem but not of the benefits the cardano devs would get by using this library once it's finished. With no other work, I do see a posibility for implementing the work that needs doing given you have the necessary skillset, but lacking any information about the skillset it is difficult for me to make an estimation or an educated guess if the projects timeframe is reasonable or not.\nI would suggest to the author to look through the eyes of a non-technical voter and try and make the proposal appealing for this kind of audiance, because this is the main body of voters. The proposer hasn't listed any plan of marketing or making people aware of his efforts, besides listing an open source github repository, which makes it less discoverable which lowers the chances of an organic community growing around this idea IMHO as someone that has open source experience developing a project for near 4 years.\nOverall I couldn't say if this is a feasible proposal or not, because of the arguments listed above. Even so I do urge the author to polish this proposal because I do like the idea, and come back for the next funding round.\n", "q1r": 3, "q2": "I don't have any concerns regarding the auditability of the project, because as the author states: there's a github repository and anyone with an online connection can audit the progress of the project. Even so I do believe it's a good idea to start growing a community and passionate people about this idea to be able to grow longterm as an opensource project.\nThe problem statement can use some better wording to be more understandable for non-tech people and the solution should list the benefits if this proposal is funded and successfully implemented.\nSome better KPIs could be listed as npm installs per week, or some other metric that shows adoption which is the leading characteristic of any opensource project. Overall I don't have a problem with the auditability with the exception of the small caveat in the KPIs.\n", "q2r": 4, "assessor": "z_assessor_2463", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "I agree with most of the points of the assessment.\r\n\r\nI'd like to argue over some of the points raised:\r\n\r\n- \"Considering the work that needs to be done as described in the roadmap IMHO it seems difficult for one person alone as it's stated in the proposal.\"\r\nI disagree with this statement since the timeline is thought to be adapted for one person of which the team is composed; in the case of a higher number of members the timeline would have looked different\r\n\r\n-\"I would suggest to the author to look through the eyes of a non-technical voter and try and make the proposal appealing for this kind of audiance, because this is the main body of voters.\"\r\nIn the previous proposal (the found 8 one) I tried to keep a more high-level approach to explain the project and the proposal got criticized for \"not being technical enough\"; at this point, I find myself between two opposite feedbacks.\r\n\r\n-\"The proposer hasn't listed any plan of marketing or making people aware of his efforts\"\r\nI thought the provided channel and social media presence would have covered this aspect, on the other side I'd be very happy to receive any further idea on how to market properly such a project.\r\n\r\nI'd also like to make clear one point;\r\nThe assessor stated: \r\n\r\n\"Off-chain meaning that the smart-contract validations would still be written in plutus (haskell)\"\r\n\r\nplu-ts as a project aims to provide all the tools in order to set up a dApp on Cardano using only typescript; there is an entire proposal dedicated to the on-chain side of plu-ts  so the smart contract validation will be able to be written in typescript-.\r\n\r\nstrictly regarding the offchain side, plu-ts/offchain will be agnostic to the provenience of the smart contract to allow also older projects to migrate to plu-ts as off-chain solution.\r\n\r\nEven If some of the points of the assessment are incorrect I think it is still a valid assessment showing the potential of the project and I don't see any reason on why it should be flagged."}, {"id": 8802, "q0": "Caradano does not have support for writing charge smart contracts in the JavaScript based language today. The proposal intends to implement a 100% typescript library for writing off chain code. Typescript is a widely adopted typed syntax version for Javascript. So this can definitely help improve developer adoption and bring new developers into the system. In my opinion this is the kind of initiative that suits the developer ecosystem challenge and can benefit the growth of the developer community. I feel initiatives to build tools and examples to help developers write smart contracts in Cardano should be encouraged. ", "q0r": 5, "q1": "Propose calls out the paint points that exist today for developing on Cardano. The video included in the details makes a good comparison about the different toolchain available today for writing smart contracts off chain code . The proposer has articulated well the need for and the benefits of having a typescript based library. The detailed plan includes a timeline and list of milestones. The experience of the proposer ascertained based on the link supplied appears sufficient for undertaking this task. However, I would have liked to see that the deliverables were presented with more clarity. I would have liked to be assured that the typescript library proposed will be sufficient for a developer to write off chain code at par with what is possible with Haskell based Plutus. The timeline has a line item for smart contract interaction which I hope will provide that guarantee. I would have also liked to see how the proposer plans to incorporate updates to Plutus like the Plutus V2 and further changes down the line. Nevertheless, I see potential for a successful implementation. ", "q1r": 4, "q2": "I reckon that the auditability of this project to be excellent given this library will be open sourced. Further the proposer has said that updates will be shared via YouTube channel and as well as on Twitter. This open approach would allow for the community to audit the progress. As for the security and accuracy of the library, ample amount of testing as mentioned in the proposal has to be relied upon.", "q2r": 5, "assessor": "z_assessor_3007", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for your assessment, I feel encouraged by your enthusiasm for the project.\r\n\r\nI appreciated the feedback present in the assessment and I'd like to spend a couple of words about them.\r\n\r\n\"I would have liked to see that the deliverables were presented with more clarity\"\r\nIt would be great if you could point to me the parts you'd expect the deliverables to be presented and provide me with some examples to have an idea no how you'd like to see them explained.\r\n\r\nregarding the updates to Plutus like the Plutus V2 one, Cardano is developed in a way so that the least amount of breaking changes is delivered, so it usually means that when something new comes out we are talking about **adding** some feature and not modifying old ones (usually); as for the example of the  Plutus V2, regarding the off-chain part just a few more options do need to be added but most of the options were already present in the \"standard\" Plutus V1!\r\n\r\nFor the rest, I really appreciated the assessment and the support it shows!"}, {"id": 15072, "q0": "The (plu-ts) full Typescript off-chain proposal addresses the Developer Ecosystem challenge by building a typescript library to write off-chain code that allow both high-level and lower-level usage. The proposer has mentioned the project risk in code correctness and security but this can be solved by testing. Once successfully built, the library should help developers to create smart contracts along client side efficiently. Hence, the proposal fits the challenge very well as the solution plu-ts will boost the productivity of developers and encourage developer adoption and migration. Please note that this proposal is for off-chain code only. The proposer has submitted another proposal for on-chain code (same library and same timeframe). ", "q0r": 5, "q1": "The plan for this project is very detailed including task lists. Each of which includes estimated timeline to complete the tasks along with the examples. The transaction-rated datatypes implementation is one of the core activities for this project which will take 6 weeks -2 months out of the total estimated 6-7 months (entire project length). Also “BlockchainQueryier” for querying against the Cardano blockchain will take 2 weeks but is worth mentioning as a great option for dApp developers. The proposer is a Cardano-Trace lead developer, single pool node operator (Harmonic[ARMN]), and a builder of “Cardano-wallet-interface” npm package. The hourly pay rate is based on salary.com stat for the 7 months ($53,760 is for 7 months although slightly typo to 8 months in the proposal). It makes sense that the distinction between this proposal and the on-chain proposal is the critical code audit cost. The proposer possesses technical strength and very much involved within Cardano ecosystem. He is also reachable in twitter, youtube, GitHub (both personal and the HarmonicPool). I have personally come across his work via Charles Hoskinson’s tweet  on 25th July. (https://twitter.com/IOHK_Charles/status/1551525003107225600?t=gquXMXmjAC1GDM1UmKzTWA&s=19)  This gives me a certain level of confidence that he is skillful in his work and should be able to complete this project successfully. ", "q1r": 5, "q2": "The proposer considers this (plu-ts) full typescript proposal a success when 2 or 3 projects use this library for dApp integration. The project will be open source and verifiable. The proposer will also update on Youtube and Twitter. The proposer clearly understands the need to write off-chain code that supports typescript (or JavaScript directly) that will facilitate dApp integration for new projects. The project can be easily monitored by following his Youtube channel which he will go through any project updates. The proposal is not a continuation of previously funded project. The proposer understands the learning curve of dApp developers and his solution plu-ts full typescript off-chain will make the life of developers easier with measurable degree of success. It would be great to explicitly state the metrics such as number of projects using this library, number of users, or any other metrics which show clearer user adoption in future proposals.", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15382, "q0": "The problem is very much related to the potentially inefficient learning curve for the off-chain code. And the solution is very straightforward developing a 100% Typescript library to write off-chain code, minimizing dependencies. The risk is very vague and how much is the extensive testing, this would be more detailed in terms of how is the plan for testing and mitigation plan", "q0r": 4, "q1": "This project is an off-chain library, and there is another project working simultaneously with the online Smart Contract. The team is the most concerned about this proposal with the same leader. And workload again is 30day continuous working without any off day in 7 months. This would create a risk for project management and completion. the cost will be also more assumption based on the rate in the US developer. However, there is no doubt this work will be managed on a remote level.", "q1r": 4, "q2": "Similar to the other proposal of the same proposer, the project is very briefly on an opensource link and the (possibly) update weekly videos create uncertainty for the community regarding the completion. The community has to take a leap of faith on one man show with the Twitter and Youtube profile. The success picture also very much relies on the community to use and upon luck with no concrete plan for promoting or creating awareness. The PA suggested the proposer more actions in place to ensure Dapp integration or 2-3 project with an average userbase adoption as mentioned. ", "q2r": 4, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Implement a 100% Typescript library to write off-chain code, minimizing dependencies", "experience": "\nCardano-Trace lead developer\nbuilding and maintaining the \"cardano-wallet-interface\" npm package\nSingle Pool node Operator(Harmonic [ARMN])\na youtube channel to see with your eyes\n"}