{"id": 414103, "author": "michele.nuzzi", "title": "plu-ts Typescript smart-contracts", "url": "https://cardano.ideascale.com/a/dtd/414103-48088", "category": 26597, "amount": 105840, "description": "Currently smart contract creation is limited to the haskell programming language; limiting potential of smart contracts that do need to be created on-the-fly by a PAB", "f6_no_assessments": 6, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 665, "q0": "I strongly agree that this proposal effectively addresses the challenge. The problem statement and solution targets to provide a typescript based library, name plu-ts, which can then be integrated by client side dApps (entirely running on browser) and Node Js backend dApps. Being a typescript developer myself, I see this as a big  contribution towards making Cardano development easier and available for web/JS/TS developers, who happen to be the most percentage of total developers in the world today.\n\nClearly, this will help to onboard Typescript/Javascript developers and hence fulfilling the multiple criterion of this challenge, such as attract more developers from outside of current community, make it easier to create a dApp, enterprise dev managers to build enterprise projects (as a very high percentage of them are familiar with typescript/javascript frameworks).\n\nThis library project is not about scalability (so we can ignore that metrics from challenge brief) as the scalability comes from the dApps that will use this library, and since this library is open source and in typescript, for which the developer community is quite huge, there will not be a lack of developers contributing to this repository and hence making it sustainable.\n", "q0r": 5, "q1": "The proposer has no LinkedIn profile and has mentioned that it is because he is not active there. Nevertheless, the github profile links, twitter, youtube channel and the GitHub repository links with proof of concept of this proposal and timelines are provided. \n\nThe proposer is the lead developer and the only developer who will be working on this project, with a possibility of expansion in the next fund.The developer has provided a good youtube video explaining the technical details and how he wants to fulfill this proposal solution, and a detailed features based estimation of 8 month is given\n\nBeing a typescript developer myself, I feel that he has the capability to finish this proposal. Additionally the budget requirements for a full 8 months development are justifiable. A separate amount of $30k is devoted to critical code audit. This is important and should cover the vulnerabilities present in the code. However, it would have been great if details were given of what all would be covered as part of the audit ? Since you are a single developer, what are the code quality measures ? Who will do the code review on your library code, that will potentially be used by many developers in the future.\n\nFinally, The risks and challenges (with potential solutions) are discussed on github ReadMe. Therefore, I agree that this proposal is likely to be implemented, but because I see some room for improvement in the writeup of the proposal, I give it 4 ratings. Good luck to you for this proposal.\n", "q1r": 4, "q2": "I agree that the information provided is sufficient to audit the progress and success of this proposal. The milestones for 8 months are well split into features, and timeline for on chain and off chain specific parts are well described on github.\n\nThe verifiability and progress of the proposal will be posted on the youtube/twitter and clearly on the github. The KPIs/metrics are not available on the proposal, however, how success of the project looks like is defined, but there could be better write up in this section. The KPIs/Metrics can be defined as github stars/forks/issues and link them to success of the project, and make it more detailed. Hence, I see some room for improvement in the write up, and go for 4 ratings.\n\n", "q2r": 4, "assessor": "z_assessor_2114", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "The assessment is really appreciated, it shows the proposal has been read and understood,\n\nthe assessment also contains suggestions on how to improve the informations included in the proposal.\n\nRegarding the amount chosen for the audit of critical code it was taken as reference based on a breif e-mail exchange with the \"runtime verification\" company, at the moment of audit requerst I'll personally reach various companies and make clear the aviable budget; based on their responses I'll choose between teh offers and let the comunity know about the choice.\n\nI found the assessment really useful and I'd like to thank you for that."}, {"id": 2750, "q0": "\"The proposal raised the limitations of programming smart contracts in haskell language, and the idea offered a solution that would enable client-side smart contract creation. this opened the market. extensive for our smart contract, moreover will optimize the conditions allowed to use the smart contract will be many client-side objects are eligible to use.\n   The presentation of the solution of the proposal is very convincing, detailed, clear with specific evidence and easy to understand, but please allow me to have a question a bit out of the way with the suggestion: if programming contracts through Verify on such a client's computer whether the transaction conditions or security features are guaranteed to be the same as the old way or not, please understand and explain more.\n   The summary does mention possible risks but also offers two solutions to overcome those risks, so I support the impact of the proposal. \"", "q0r": 5, "q1": "\"Proposed delivery timelines are in weeks and months, are very detailed for each of the goals listed, and also reasonable to accomplish them.\n   There are salary statistics with linked evidence, the amounts to be spent are listed in specific calculations, easy to understand them immediately, in addition, the team also has calculations for the backup budget when there are New update from the Cardano home network, there may be changes to new features for Dapps so this is necessary for the additions to catch up with the upcoming upgrades. The project team is very visionary and calculating in the future when proposing this I agree.\n  Proposal Topics has provided four social networking platforms for the Proposal for the community to interact with. With experience and knowledge from this evidence I believe and appreciate the feasibility of this proposal https://twitter.com/CardanoTrace . \"", "q1r": 5, "q2": "\"this is an open source powered project so tracking the project's roadmaps is completely easy as the proposed topic already provides specific paths in the progress metrics section. That's still not enough if it can be suggested that there will be reports with live streams for the community to interact directly and critique the technological aspects, thus increasing community interaction. and approve this solution when they realize it makes sense on your live stream.\n  the success of this proposal will be an increase in the number of developers using this tool which means expansion to developers on other platforms that can easily use the tool to make a contract smart on the Cardano platform. \"", "q2r": 4, "assessor": "z_assessor_2352", "no_vca": 14, "ne": 3, "ng": 7, "nfo": 4, "vca_o": 1, "reply": "I'm glad you were able to read through the proposal and understand the problem that tries to solve.\n\nI personally love the idea of live streams you cited in your assessment and I think it would be an awesome way to collect the feedback of the community during the development process; will definitely consider to set up a recurring livestream.\n\nmuch appreciated"}, {"id": 3524, "q0": "It's very hard for me as a developer to write a succinct non-technical resume of this proposal, but I'll try it anyway. As far as I understand, the proposal wants to flatten the level of transformations between the smart contracts human readable code to the actual execution code. This has it's benefits, like verifying the contract locally, which really is a big deal. Imagine the human readable code passes through a translator or two, to be understandable for the execution environment, this brings more dependencies, which is more risky in general. What the proposer wants to do is create a more direct path for everyone when writing a dapp and a smart contract to be specific.\nI do belive that this is a really ambicious idea, and it would have an impact over the community. I also think it's going to be challenging work, that has a possibility of not being good enough if only a partial subset of functionality is implemented, but there's no way of knowing if it's good enough or not before releasing the solution into the real world. There's no other way around it, but having said that, I do believe it's a worthy effort that needs to be tried out. It's in line with the challenge settings and does provide a solution to a very basic problem, that people just take for granted, but development could be better if this solution is implemented. \nOverall I think this is a great idea and would add a missing piece to the development flow. The impact has a really big potential. I don't have any concerns for this proposal besides the few small things I already mentioned. Good luck to the author.\n", "q0r": 5, "q1": "The budgeting scheme is sound and I do like the project would be opensource. One thing that I found difficult to confirm were the skills of the proposer. I looked through the code in the github repositories, but there isn't anything implemented that would give any assertion for the level of skill. It's mostly documentation updates and nothing logic heavy that could verify the skills. The youtube channel did have some explanations of haskell tutorials and run through of some specifications, but no actual practical (not-examples) code written, which makes it hard for me to verify the skillset necessary for the implementation of the described proposal. That's not to say, the proposer doesn't have the necessary skills, It's just that I couldn't verify them with the resources and information given.\nI do like the idea of expanding the team, once the MVP passes, because such a project would need years to mature and actually be mass adopted and usable in production code. The budget has a good breakdown, although I don't see any reasoning behind the 30k for critical code audit, and how this number came to be. This project is really complex and I find it difficult to believe that 1 person can manage the whole development. As a developer myself I know what's in the relm of possibilities and this would be near impossible, no matter how skilled you are, because it's a time problem not a skill problem. The heuristics are simply too big.\nI can appreciete the idea, but overall I'm left uncertain if this is a feasible project or not. I tend to be on the sceptical side, but I choose to give the benefic of the doubt, and say I'm just unsure, giving it a score of 3 for that reason.\n", "q1r": 3, "q2": "I don't have anything to say about the projects' auditability since if it's an open source project, anyone interested in the progress will be able to follow along using the github repository linked in the proposal. The roadmap is present and anyone can try to follow the milestones set by the author. There's a clear problem and a solution so that's good, butt I think more people should be involved in order to get this project to it's fruition.\nOverall an auditable project, but I'd suggest to the author to put themselves in the shoes of the voter and read through the proposal again and polishing it in order to be more understandable for the everyday reader and make it more accessible. I wish good luck.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "thank you sincerely for your assesment; \n\nI totally understand the concerns expressed in the feasibility section and I'll try to explain my points of view in regard to those here.\n\nI'm sorry you weren't able  to find more information regarding my skill so I understand the overall concerns, I admit that there's in fact not much to build an option on based on what's currently online an publicly available.\n\nregarding the amount chosen for the critical code audit it was the result of breif market research. the amount is an estimation took by a brief exchange of emails with the runtime verification copmpany.\n\nat the time the audit will have to be performed a more in depth research will be done and the company that will perform the audit will be advised about the budget in advance.\n\nOverall glad you see the potential that this proposal has."}, {"id": 7973, "q0": "The problem described here is that currently making smart contracts is limited to the haskell programming language.\nThe proposal aims to implement a library capable of constructing and then realizing an AST of Untyped Plutus Core so that it can be submitted with a transaction and processed on-chain. This proposal will have a positive impact on the cardano ecosystem because all developers can use it. The tool that will be created will also be useful for existing dApp developers. This app makes it possible to generate smart contracts on the client side (decentralized applications). The aims of the proposal correspond to the challenges outlined. A number of risks are included in the proposal. It's good that the creator of the proposal has offered a few possible solutions.", "q0r": 5, "q1": "The team that will work on this project is 1 person. The performer has demonstrated his relevant experience by including his twitter, youtube channel and GitHub account. The creator of the proposal has chosen a fair salary. The petitioner has also stated that the team could be expanded if it can get funding in later rounds. The budget is clearly defined and is sufficient to complete the project. The time span to complete this project seems sufficient to me. A timetable is in place to complete the work. The time spans are certainly sufficient to properly implement the interim milestones. There is a clear implementation plan in place to make the product usable. The plan describes the means to carry out the project. The technical aspects are included in the detailed plan with the milestones. The risks and challenges are included along with a possible solution for a successful implementation.", "q1r": 5, "q2": "A roadmap has been included with milestones for a successful realization. A few KPIs are included to measure the success of the proposal. It's good that the updates will be shown on the creator's youtube channel and Twitter profile. The description of the target problem is clearly described. An extensive explanation is provided. This application will be a good solution to solve the problem. It's good that this project is open source. The project is therefore clearly verifiable by all people with an internet connection.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thank you for your assessment.\n\nit seems to me you went through the proposal and highlighted the points relevant to it.\n\nI personally would have liked some feedback on the idea itself but I assume you were ok with that"}, {"id": 15071, "q0": "The Plu-ts Typescript smart contracts proposal addresses the Developer Ecosystem Challenge by building an Untyped Plutus Core program (UPLC) using Typescript. The current smart contract creation is limited to Haskell programming language and run on a PAB (centralized server). Plu-ts allows the process to run on a browser. Not only Plu-ts would be a great tool for developers to generate smart contract client side seamlessly but the Plu-ts solution would also result in true decentralized applications. The proposer has also mentioned project risks that there is no flat serialization library for Typescript/Javascript and has suggested ways to mitigate this risk by using a specialized subset of flat. The Plu-ts solution fits the Developer Ecosystem challenge goal and will lead to increased Cardano adoption among developers.", "q0r": 5, "q1": "The roadmap has detailed tasks along with the reasonable timeline. The total duration for this project is 8 months. The UPLC Abstract Syntax Free (AST) serialization will take approximately 5-8 weeks and is one of the core activities for this project. The proposer has also another proposal for the same library (also with similar timeline) and he would either expand the team or alternate to complete another proposal if both proposals are funded. The hourly wage is based from salary.com stats and tallying up each cost items matches the total requested budget ($105840). The proposer is a Cardano-Trace lead developer, single pool node operator (Harmonic[ARMN]), and a builder of “Cardano-wallet-interface” npm package. I personally came across the proposer work (Untyped Plutus Core Program entirely generated and serialized using only Typescript) from Charles Hoskinson tweet on 25th July. (https://twitter.com/IOHK_Charles/status/1551525003107225600?t=gquXMXmjAC1GDM1UmKzTWA&s=19) This gives me a certain level of confidence that the proposer will be able to carry out this project successfully. He has provided twitter, youtube, GitHub links for reference. There could be following proposals in next funding round for team expansion and code auditing and verification. ", "q1r": 5, "q2": "The proposer considers project as a success when 1-2 projects using this client-side smart contract creation, more developer adoption and migration. The project progress can be tracked from GitHub as it will be open source.  Community can follow his updates on Youtube channel with weekly videos and on his twitter profile. If possible, it might be good idea for proposer to write Medium articles regarding his project so it is easy for later reference and compilation. The proposer could also detail metrics in each milestone for community to keep updated how his project gets going and asks for feedback. The proposer clearly understands the limitation of smart contract creation using Haskell and facilitate smart contract creation by building an AST of Untyped Plutus Core. I have already followed your project and wish you the very best for this mission.", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15376, "q0": "Typerscript is aim to construct an SC automated script to help the developers automate and deploy more efficiently with the Haskell programming language. The problems are very much paint points for the proposer himself and then the solution also is written in a very ```Untyped Plutus Core``` language. The risks are also mentioned of lacking of```flat``` serialization library for Typescript or Javascript. And the proposer has provided 2 potential solutions. ", "q0r": 5, "q1": "The milestones are phasing out in the  5 phases within an 8-month estimation. The budget is mostly based on a very contentious intensive work plan with 30day working a month without a single off day. The team is based on the working hour rate in the US with the hype link https://www.salary.com/research/salary/listing/programmer-hourly-wages. There are concerns from the PA point of view for such an always project management. The team is very much centralized with the https://twitter.com/MicheleHarmonic and we don't see the team size or task allocations. It is highly recommended the Proposer consider elaborating this. More concerns come from the planning of the more team expansion as explained there might be other following proposals to improve the project, the proposer also highlighted the potential to ask for more fund for team expansion", "q1r": 4, "q2": "The auditability is very much open source without any concrete KPIs/OKRs to be tracked and measured instead of an open source link. The success picture is also very risky for the community dev adoption and dev migrations with no quantified metrics and gives the leap of faith. The biggest concern is the waste of effort from the proposer and also the catalyst resource if the developers do not need this after being completed. There should be very much recommended for the proposer to convey a survey or pre-assessment for this proposal before in action. ", "q2r": 3, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "implement a library able to construct an AST of Untyped Plutus Core and then serialize it, so that it can be submitted with a transaction and processed on-chain", "experience": "\nCardano-Trace lead developer\nbuilding and maintaining the \"cardano-wallet-interface\" npm package\nSingle Pool node Operator(Harmonic [ARMN])\na youtube channel to see with your eyes: https://www.youtube.com/channel/UCirs7UT6W4cQFNb8FS4bNjw\n"}