{"id": 414258, "author": "alexis.hernandez", "title": "Enable any webapps to use PRISM", "url": "https://cardano.ideascale.com/a/dtd/414258-48088", "category": 26597, "amount": 80500, "description": "There is a lot of interest in Atala PRISM becoming mainstream, but there is no simple way to use PRISM on the web\nA lot of work is required for any web app to integrate PRISM, discouraging most devs", "f6_no_assessments": 8, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 84, "q0": "Many proposals are niche proposals, that might have an impact on a subset of users via a platform or two – if they make it. Some proposals go for it – and identify important problems while offering practical solutions that can be used by the whole community. This is one of the latter ones. The proposing team – greatly qualified based on the submitted information – intends to bring Atala Prism one more step forward. Effectively the aim is to bring self-sovereign identity (specifically Cardano’s decentralized identity technology - Prism) to web 2.0. Yes, this is a proposal for an decentralized identity-based marriage of web 2.0 and web 3.0 – which could propel Cardano’s use for secure identification while respecting sovereign identity management. The proposal should allow web apps to easily interact with PRISM – which is essentially a fabulous tool for developers all across Cardano’s ecosystem and beyond. This is in line with the challenge and will clearly add value to the Cardano ecosystem. The proposers state that exposing an API through a browser extension allows developers to access the PRISM ecosystem in a couple of hours. A browser wallet for identity could unlock thousands upon thousands of new users who will be able to manage and control their own access and control their identity and data sharing. Furthermore, the team states that they will release a browser extension that people can install from the Chrome/Firefox web stores and the project will be completely open source. Bingo.", "q0r": 5, "q1": "I was very impressed reading through the qualifications of the team that is behind this proposal. Alexis Hernandez is a former IOHK/IOG technical architect for … drumroll… Atala PRISM. He has been on that task since the beginning by designing “most of the components”. Has a browser wallet extension already been developed for the Atala PRISM is our self-sovereign identity and verification solution? Yes, but what has been done was a product solution for in-house enterprise use. The crux of this proposal is to bring a similar solution – functionality to end users – a solution that is similar to the internal Atala Prism browser wallet. The work will be backed up (if needed) with developer replacements from the Wiringbits company that focuses on web and blockchain development (wiringbits.net). The second key person in this proposal is a former IOHK contractor Cesar Gurrion, now working for Wiringbits. Cesar was a pioneer of the PRISM SDK, using it for building the Atala PRISM Credentials Verification Portal, according to the proposa;. Competencies check out! Github repo links have been provided, as well as LinkedIn profile links and company website. The proposed budget of $80500 for a cutting edge solution from a team with these competencies seems realistic. Challenges and risks have been addressed in-depth (with solutions to the risks offered – bravo). We have been given a very detailed 23-week plan for implementation. The budget has been broken down according to the compensation rates (also given) for the two main developers. The plan provides info on the resources necessary to implement the proposal. Seems like a low-risk, high value proposition for Catalyst funding. ", "q1r": 5, "q2": "This team has an innate advantage – they are very deeply familiar with the subject matter, having being involved with the development of the Atala Prism solution at IOHK. Not surprisingly, the weekly roadmap in very detailed with a clear pathway to completion and we are provided with a specific time frame full development. The very detailed (and specific) metrics have been incorporated inside the project timeline – in  a very intuitive way, allowing for an exemplary auditability of the project – simply by monitoring the development timeline. The responsibilities of the technical architect/lead include “Communicate the progress to the community. Prepare demos.”… It would have been good if the team had specified the precise channels that will be used for regular communication with the community. The team has stated that they have prepared “a detailed timeline” which they intend to put into a Kanban board – but it remains unclear whether the Kanban board will be made in a way to allow public access (view only, of course). I think the team has given a very clear description of what is trying to be resolved and how they intend to do it. What is more, the proposed solution seems super clear, very feasible with very well addressed risks – seems very auditable and clear to me. ", "q2r": 5, "assessor": "z_assessor_2047", "no_vca": 25, "ne": 15, "ng": 10, "nfo": 0, "vca_o": 2}, {"id": 200, "q0": "The author proposes to build a fully open-sourced browser extension for Chrome and Firefox which will enable WebApps to make use of the already existing API offered by the digital identity solution Atala Prism.\nUsage is comparable with a wallet extension just instead of Token and NFTs personal data is being managed.\n\nWide availability and acceptance of such a solution is crucial for the adoption of digital identity and its incorporation into existing and newly developed DApps. As opposed to the crowded market of Cardano light wallets there is no competitor yet. That elevates the impact of this proposal and underlines its significance for this challenge because successful completion will act as an multiplier for adoption in the entire ecosystem. Thus the benefit will be both on user and developer side.", "q0r": 5, "q1": "The proposal plans to pay two applicants 3500$/week for 50hrs of work. Given their background payment seems appropriate.\nBoth devs used to work for IOHK on the Atala PRISM team and thus could not be better suited especially because their previous work involved the implementation of a private DID browser wallet extension for institutional usage of Atala PRISM.\n\nThe project roadmap is very detailed and IMO very ambitious but this can be explained by many of the tasks will be a repetition of the previous project work.\n\nThe author states a couple of risks which may threaten the success and provides reasonable remedies for each of them.\n", "q1r": 5, "q2": "A detailed feature list of the product for users and devs is provided. This in combination with the weekly tasks described in the roadmap should be sufficient to ensure that the development is on track thanks to a public backlog and milestone releases.\n\nFinally, the author makes the public release in the app store for browsers and at least one external commit per month a condition for success.", "q2r": 5, "assessor": "z_assessor_2057", "no_vca": 14, "ne": 0, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 667, "q0": "Atala Prism is the DID solution built by IOG and which is already used in the education sector by the Ethiopian government. This proposal plans to expose Atala Prism to the web developers who currently have no straightforward access to integrate Atala prism with web applications. The proposal proposes to build a metamask equivalent web browser extension that then can be used both by users and developers. Thereby, providing an increased adoption by new users and developers, and hence fulfilling the main goals of this challenge settings.\n\nHowever, it would have been a lot better if the proposal also addressed the ideas around sustainability (code maintenance as this is going to be open source) and scalability (APIs scalability, how many requests/responses API can handle should the usage explode). Therefore, I can only agree that this proposal effectively addresses the challenge.\n", "q0r": 4, "q1": "The main team details, consisting of two members (one developer and one architect), is verifiable by the public GitHub profile links. The main technical architect is also a former IOHK employee and had been a member of the Atala PRISM team since the project's inception. Being a technical architect and experienced developer, he has a significant amount of experience with both guiding and implementing the project. His Github profile link is available and he has been a very active committer, as is visible by many repositories where he is constantly contributing.\n\nThe timeline for this project is on a biweekly basis explained, and technical details including feature sets are detailed out. This is quite good, and gives the community a lot of confidence that this implementation is highly likely to succeed. \n\nAs a senior developer myself, given the experience of the team and work hours needed to finish this project, the budget (of $80500) is reasonable and justifiable. Additionally, I really like that along with many other risks, they considered the main developer not being available during the implementation phase, and they gave heads up on what could go wrong that could cause delays. Therefore, a very well detailed feasibility plan, and hence I strongly agree.\n", "q1r": 5, "q2": "\nI strongly agree that the information provided is sufficient to audit the progress and success of the proposal. This proposal is going to be open source, and biweekly feature sets prepared on a Kanban board, which the community can keep track of where we stand at what point of time in deliverables. \n\nThe success metrics is also easily trackable, as the web browser extension must be available on the browsers, hence publicly available to be used by the users, thereby, application being used by individuals once Prism is on mainnet.\n", "q2r": 5, "assessor": "z_assessor_2114", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 3250, "q0": "This is an almost criminally underrated approach to the DID space in the Cardano ecosystem.  A lot of attention is given to institutional adoption of DIDs and VCs because of the idea of who has the scope to create the trust registries necessary for the governance layer of a \"credible\" credential, i.e., one with validity obtained through the authority of the issuer.  This paradigm misses a tremendous opportunity to discover the roots of \"peer-validation\" and true decentralization in SSI.  So what is the main tool we need in order to start getting data on this concept?  *Any tool that is in the end users hands!*\n\nThis user-centric wallet, modeled as a browser extension and webapp, is just such a tool.  Before I dig into this, I need to remind the reader that an Identity wallet, even one built around Atala, is NOT a Cardano wallet.  A Cardano wallet points to the blockchain:  the tokens that are \"in\" the wallet are not actually there, they are secure on the blockchain.  For an Identity wallet like this the credentials that are \"in\" it are actually there--and ONLY there.  What goes on the blockchain is the immutable fact of the DID's issuance, verification or evocation, not the DID itself.\n\nWith that out of the way, lets talk about impact.  The idea here is that you would have an identity wallet from which you could issue unlimited credentials.  The validity of these credentials does not come from an on-high institution verifying your ID or skills, but from you saying \"This credential suits MY purposes\".  Obviously, this limits its utility to people who are willing to agree with you on this point.  From here, this proposal suggests creating a developer side to the webapp where he can basically create a module on any webpage that is designed to agree with the user that the credential is valid.  To think about this, who tells you whether your password you choose for a login on some website is valid?  Within the limits of basic security best practices or limitations of the login system, YOU decide what is valid in almost every instance.  And it is that choice that is revalidated every time you reuse the password to login.  This is the same kind of protocol:  a website or app may require knowing it is you, and this plugin would allow that website to see not a password, but your DID.  You could create one for every website, you could add metadata to pre-populate fields such as name and address, or use another one to have all anonymous data.  This type of control is one of the promises of SSI, delayed because of the need for robust governance for the most important validation standards.  But for everyday, simple use, why can't users start to use the technology and in the process discover their OWN standards and uses?\n\nBecause this project addresses a current, critical gap in the Cardano ecosystem's ability to deliver to its users a user-defined UX/UI, and because of its alignment to the challenge goals of getting tools into the hands of developers (and at this stage of SSI, users are a core part of the development team as well) to help bridge gaps such as this, I give this proposal highest marks for Impact.  5 Stars.", "q0r": 5, "q1": "The breakdown of the roadmap/timeline was incredibly useful for also understanding the stack/architecture for this buildout.  In particular, it highlighted for me how this project really is trying to integrate the developer backend for the webapps to a UI/UX that is basically a developer frontend for \"users\".  While the technical implementation and architecture seems straightforward enough, with Atala there will continue to be concern from the community about teams leaning into needing the SDK on mainnet.\n\nTo that point in particular, I think this team is ideally suited, having been technical architects specifically for the wallet side of the PRISM effort at IOG.  As a PRISMPioneer and with access to the SDK myself, I can say that this isn't personally an area where I have any concern.  There is PLENTY for developers to be doing with the current SDKs and especially for the interface envisioned for this wallet structure, almost everything is already available and stable in testnet.  This technical implementation is NOT pushing any sort of boundaries or limits of the technology, it is, in fact, what I would describe as the most basic usecase for DIDs you could really imagine (issue, verify, revoke).  The innovation here is defraying the institutional gravity and momentum while giving only a cursory nod to the deep issues of governance in an effort to get tools into the hands of the users, which I applaud.\n\nThe budget, unfortunately, is not without flaws.  I can tell you it seems reasonable to me ($60 an hour for developers and technical architecture) and that the bottom line total is a steal for what the scope of the project entails and the number of deliverables that will come off of this, but there is little breakdown in the proposal to give evidence of these beliefs.  It would have been nice to see cost estimates added to the milestones at a minimum, and, more importantly, it would have been advisable to get an explicit statement about the funding period and how it aligns with the budget (this will come back to haunt in auditability).\n\nThough the team seems ideally suited to be tackling this project, and while the work to be done is well laid out and explained, the lack of budgetary detail forces me to lower the score by one star, for a 4 star rating. ", "q1r": 4, "q2": "Similar to the budget in Feasibility, the lack of detail is hurting the proposal here.  While they aren't included here, from the milestones you can pull around 14 key metrics, from delivery of the wrapped SDK, and wallet API, to testing and documentation phases.  They do note that they will be using an agile Kanban setup, into which they will put their timeline, and while this will be opensource, the repo itself was not specified (they have two personal repos, so I'm sure we will be able to eventually find, it, but like several other things, including it would significantly strengthen the proposal).\n\nThe project, based on the timeline looks to be 23 weeks, right around 6 months, and I see lots of deliverables that should allow them to easily populate their monthly progress forms.  Their project success metrics are concrete as well, and are realistic, especially in the realm of developers from outside the project pulling on the repo (they mention one such issue or pull per month, but is should probably be viewed more like 6-10 total, as there will likely be a delay between the start of the project and that kind of collaboration).\n\nBecause the project has a very strong description of its build and objectives, and because it is committed to being opensource, I believe it has a strong auditability component.  However, because that component is either buried in the proposal or reliant on assumptions about things like the opensource reps, I am downgrading a star.  More details in this section would have made the difference.  4 Stars.", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6796, "q0": "Digital Identities are becoming a crucial aspect in the Web3 realm. People are beginning to understand the power and importance of having a unique verifiable presence in the blockchain. Atala PRISM provides such robust open source framework for DIDs solution but there is the difficulty of integrating/using Atala on the web/webApps to directly manage their Identities and or digital credentials. The proposer however intends to profer a solution that will aid developers to easily integrate Atala Prism into their regular applications and implement solutions that require identities easily.\nThe solution will be in form of a browser extension that will enable developers to build webApps that will interact with Prism using a simple API. These will authorized interaction with the prism wallet, prove you own the identity, request and submit credentials. These simple API will make it possible for developers to effectively and easily build Apps with Digital Identities. The idea however address these challenge.\n", "q0r": 4, "q1": "The brain and team behind the project are verifiably involved with building the Atala PRISM app/wallet alongside IOHK. These instill a whole lot of confidence in the team that they are capable of delivering the project. Furthermore, i was provided with a well defined timeline, KPIs and an implementation plan that clearly identifies the relevant resources that are needed and relevant to the project. Resources like Continous Integration (CI) workflows, display tasks using kanban board,Atala prism SDK and Prism Node, wallet API, among others are are all outlined.\nThe requested budget amount seems fairly reasonable ($2500/week for Senior Software Engineers and $1k per week for Technical/architect lead) considering the technical hurdle that will be encountered in accomplishing the task because the solution must be refined to it's simplest terms to enable a more basic integration for even a regular developer. However, the budget is estimated based on a certain number of teams (two mentioned as Senior Software Engineer and the second is Technical Architect/lead) but there's not much details about how many people each of those teams is made up of as the proposer provide information of just two team members working on the project (I suppose those are team leads in the two teams mentioned in budget) but knowing how many people are working in each respective team will help the catalyst community justify the requested sum and how it adds up.", "q1r": 4, "q2": "The timeline and milestones provided is enough metric/KPI to ttack and measure progress. Team further articulate that they will work in synergy with the public from backlog and to milestone releases and clearly stated that a successful implementation of these project will feature a shipped well packed application to webstores (chrome, firefox) and that the application starts to be used by developers once Atala Prism goes mainnet.", "q2r": 5, "assessor": "z_assessor_2831", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 9918, "q0": "The number of dapps requiring self-sovereign identity integration grows rapidly as new industries introduce blockchain components to their businesses. These include reputation building, access control, credential verification or compliance confirmation. Being able to have a verifiable track record of your history is very useful as the real value of it may become apparent only much later. No matter what the application or domain area is, it is beneficial to own a proof of what you have done. For example, emerging AI solutions are going to make it possible to utilize all types of data and contributions about created value. This is why I consider an opportunity to connect an identity to a dapp, highly valuable and worth prioritizing. \n \nThe proposal is about building a browser extension to be used by both developers and users. Currently it is not trivial to integrate Prism to a new dapp. Developers would get an API which lets seamlessly embed the Atala Prism identity wallet functionalities to their dapp. There is an existing Atala Prism mobile app for users to verify and receive credentials as well as create and recover identity wallets. I think it is important to have equally functional web based solutions too. This completely open source solution would significantly enhance the identity space of the developer ecosystem. \n", "q0r": 5, "q1": "The proposer and team members of Wiringbits have been designing the key components of Atala Prism at IOHK. They do understand, probably better than anyone, how the system works and can integrate with Cardano. Information about key personnel is freely available.  \n\nMore than six month implementation period has been divided into weekly extremely detailed steps. The budget has been adjusted accordingly and a reasonable hourly pay is applied. This specific project does not require additional follow-up funding. However, it becomes possible at all only when IOG makes Prism a public product. This should happen sometime in the near future. With this team, the proposal is highly likely to become implemented successfully. \n", "q1r": 5, "q2": "The roadmap is exceptionally detailed and the implementation of it can be publically followed. Much more cannot be asked. The project can be seen as successful if the product is found from the main web stores, becomes as widely adopted as possible and finds a way to keep evolving over time. ", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 10876, "q0": "Atala Prism is built to be inherently extensible, allowing profiles and DIDs to be added through 3rd party extensions. This proposal, when combined with other related profiles and DID providers will expand the ecosystem to web applications and allow a growth spurt that all open source projects want at the outset. A browser extension gives developers an entry point that can ramp up quickly, provided in the API implementations for connecting users who desire multi-sourcing of their credentials or logs from different sources around their identity. This proposal fits perfectly with the campaign guidelines.", "q0r": 5, "q1": "The team is capable of implementing the proposal. It is indicated that the proposer was part of Atala Prism’s technical team during its creation phase. Such a statement suggests that he has in-depth knowledge on the tool and its relevant components, which would ensure safety and success of the proposal implementation. In addition, it can be proven that he has experience developing browser extensions. Reprehensive links to relevant LinkedIn profiles as well as GitHub contributions were provided.\n\nThe script presented is quite good. I think the proponent already set out quite well what activities would be developed over time.  I think what is important is to clearly understand what we are going to do and with great specificity, so that we have the complete notion of the development process. Therefore, this part scored a good grade in my opinion.\n\nThe budget is based on the weekly work of two workers at rates of:  $2500 USD/week by working full time (40h/week) and $1000 USD/week by working 10h/week. They may seem high salaries but they are professionals in the sector. I miss some mention of what happens if development times are delayed.\n\n\n", "q1r": 5, "q2": "I am missing some additional metrics to track the progress of the project. The team provides us with a roadmap, which gives us an idea of ​​what will be done and how. As mentioned previously, the details of the tasks that would be performed are not very detailed, so it is difficult to understand what needs to be done in order to complete such activities. I hope that with the help of Kanban it will be easier to know the status of the project.", "q2r": 4, "assessor": "z_assessor_3205", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11730, "q0": "Currently, there is a lot of interest in Atala PRISM going mainstream, but there is no simple way to use PRISM on the web then this project for any web application using Prism, this allows people to manage their identities/credentials and enables web applications to easily interact with PRISM. So this proposal is very effective to carry out the challenge of ecosystem development. The proposal was made that when Metamask was released it unlocked the Ethereum ecosystem for any developer there is no chance that the Prism browser wallet could not.\nThe team that matched this challenge was to enable developers to interact with Atala PRISM instantly, boosting their confidence in integrating Atala PRISM with their web application. The team has not shown the community the solutions to solve this challenge, we need to come up with solutions how to reach many users and they can safely use to create personal information, create their own identities, provide authentic information without worrying about the security of their recipients' information.\nThe team has shown the risk of the problem but I think this is not necessarily a big risk because later publicizing the project will be more complete and more complete than other tools that go public first. As the team has confirmed the technical capacity of this project is not without any risk, has solved the technical challenges but has not specifically stated it to the online community. Regarding potential risks, the team has raised and has solutions and examples for each specific case, so we completely agree with the group.", "q0r": 4, "q1": "This proposal took a long time, though. However, the team has researched and built a process of performing specific and detailed jobs by week, each week is also divided into each job. Not only that but the application is also built in many iterations. In this part of each implementation phase, I saw solutions that the team added in more detail to the previous part.\nThe budget has been broken down by the team and it's very transparent where those expenses are spent. The team has come up with exactly who does the work for this project. The amount of budget spent on this project is quite large, so when the group identifies those people, the community will have information and evaluate whether they are capable of implementing the project or not. As for the people the team recommends, there's no reason why we shouldn't trust them and spend that amount of money on them.\nIf funded I will come back to Catalyst in the next round because I feel like this project will be very important to gain acceptance for Atala PRISM.", "q1r": 5, "q2": "The proposal has not yet provided an accurate measure of the success of this project. Although the project implementation plan has been shown in the previous section, the team seems to be showing the community that the project is working in secret and the time will come when it will be made public and everyone just has to wait and see. the successful outcome of the project. If the success of the project is measured through the Kanban board, the team should show it in this section to convince the community more.\nThe team has shown the project's success is very clearly defined, this success we can see the reality that is: we control whether the application is used by many people or not.\nThis is a new proposal that has not been mentioned in previous funds", "q2r": 4, "assessor": "z_assessor_3273", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Let's build a Browser Extension (like MetaMask) that will allow people to manage their identities/credentials and allow web apps to easily interact with PRISM.", "experience": "I was involved in developing Atala PRISM from the beginning, designing many of its existing components. I also run a development company (https://wiringbits.net) where we have been involved in multiple crypto-related projects, including the IOHK's PRISM Browser Wallet."}