{"id": 414321, "author": "tadatek", "title": "Rewards for Community Contributors", "url": "https://cardano.ideascale.com/a/dtd/414321-48088", "category": 26597, "amount": 29600, "description": "There are a lot of people who are producing Cardano content in Vietnam. Why not merge ideas to have an official page contributed by the community", "f6_no_assessments": 8, "f6_rating": 4.541666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 191, "q0": "This proposal fits the challenge of growing and expanding the Cardano ecosystem. We all know the community is a great value that not every project can own. Cardano Community is something that cannot be copied. Everyone is building together with an ecosystem that focuses ​​on knowledge and people. We share knowledge and raise awareness in this crazy market. Members can contribute useful content about the Cardano ecosystem. Based on that, they can receive rewards for their contributions. This motivates members, encouraging them to create more shared, more diverse content. Most people sharing about Cardano are not too focused on money. But, if we have a mechanism for this, we can spread value to a larger community, faster, and more. I am an active member of the community and I find this proposal suitable for the challenge.", "q0r": 5, "q1": "This is a 12-month project and is a continuation of a project that was funded in the previous round. I have reviewed the before-funded proposal and saw that it is an information website. The progress and content of the articles are updated regularly and varied. I assume that the team is capable of implementing the requirements of this proposal. In my opinion, if members can contribute content to the website, it is a decentralized website in the true sense of the word. The information provided shows that most of the budget is paid to content contributors  (nearly 90% of the budget). This really makes sense as the proposal is distributing well-deserved rewards to content creators. They are great ambassadors of the Cardano network that are working day and night to build useful content for the community", "q1r": 5, "q2": "The number of active contributors and the number of articles contributed by the community is the main criteria for evaluating the success of the proposal. I assume that more criteria should be added to check which contributions are valuable. In other words, measure the impact of content contributors using specific criteria. In short, this proposal design a playground where everyone can contribute their content. I quite appreciate this idea", "q2r": 4, "assessor": "z_assessor_2054", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 3429, "q0": "Proposal aims generete more content and news for Cardano vietnamese community using an interesting decentralized approach, by anyone being able to contribute and being reward accoring to the quality of the content produced. This indeed can incetivize people to share their knowledge and even learn more for sharing aftewards. Other good thing is that content would be consolidated in one place so community would know where to look for. Hence, solution proposed here does seem to solve, even if partially, the problem statement. The parameters they chose to calculate the distribution are also appropriate.\nIn regard to challenge aligment, it does fit well here, as it goes into some potential directions provided in challenge description such as \"Support and Incentivization structures\" and \"Knowledge base & Documentation\" and addressing metrics as \"Reduce wait time of unanswered communications with developers to 24 hours\" and \" sense of community and conversations\".\n\nAs suggestion, proposer could bring here how he intends to commuunicate this site/opportunity to the comunity both to attract more content and to have more engagement from those who want to learn more. Some example of contents could also be given, to make it more tangible for voters. Other thing that could be added is some statitcs related to the usage of their site (as the number of visits/month) so its easier to understand its reach.\n\nAll in all, it's project has a good and a quite simple approach on solving problem statement and is aligned with challenge. Some smaller information could be added to make the proposal richer but it doesnt compromise its quality. my rate is 5", "q0r": 5, "q1": "There's a solid time-framed plan in place with good milestones. However, a bit more details could be provided on how the recruiting and training would happen. \nBudget breakdown is well done and costs are mostly related to payment for each content, which ios the goal of this proposal. The only thing that is not so clear is what is this consultant fee as this was not mentioned anywhere before in the proposal. The role of this consultant could be better ellaborated.\nThe project team composition is mostly related to the marketing as the people in the community will be the ones who will generate the content, which makes sense. For this marketing team, there are 3 people committed and their roles are stated but there's not much information on their previous experience or background. Linkedin or reference links could also be provided.\n", "q1r": 4, "q2": "Proposer suggests good metrics to track project. It's excellent that they are time-framed (distribuited along project plan) and they all have a goal/target per each period. This certanly helps a lot to assess project success. Its just imporant that these numbers are properly communicated to the community,. They could be displayed in their blog/website, for example.\nMoreover, as all content will be available online for anyone to read, its possible to check in real time if project is advancing.\n", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 8833, "q0": "As we know rewarding is the best way of encouraging to any developers with respect to any field hence to build a portal where community contributors gets rewarded for their contribution is definitely a great idea.\nThis will encourage more people to work and contribute towards cardano development which will definitely strengthen the cardano ecosystem in the future, hence by making more contributors work towards this proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposed plan doesn't involve much of a risk involved in it where, Recruiting and training contributors from the community can be achieved easily and rewarding based on their contribution is also a achievable task.\nThe proposer even wants to add more members as the phases passes and which in turn creates more contents from the added contributors. however the team members have experience in Consultant & Training, have contributed in Funded Project, has been Community Manager. With minimum risk involved and with provided experience and plan presented it is highly likely this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The audit should have still elaborated on their contribution in previous projects which would be definitely given boost in the proposal , The  audit should have even displayed on their previous phase results and its progress stage currently.\nExcluding the above points the proposed plan has decent solution to the problem , the presented plan even contains decent timeline to complete the project and has simple idea of budget breaking  , the proposal contains well planned key indicators which involves to measure the content contributed, active contributors and number of people who are willing to read these contribution. Hence, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 9122, "q0": "The proposal's basic idea is sound: they want to create a compensation scheme to encourage Cardano content producers in Vietnam to supply quality content to the website. Furthermore, it adds significant value to the Carnado ecosystem. This approach, however, still falls short of a few crucial indicators, as well as the synchronization and consistency of several data that have not been adequately stated. For example, I'm not sure how this challenge will affect the amount of repositories on Github that use the tooling (month over month increase). I would simply ask if I could see some specific figures in the key metrics section, however I understand that this may be tough. Although it is still early, it would have been useful to include some estimates, such as how many developers the app will have at each stage.", "q0r": 4, "q1": "From the Link provided, it looks like the business is up and running, so I applaud the team on that front. However, no connections were supplied for confirming the proponent's and team's skills and expertise, and there is no evidence of the team's abilities. The funding is divided into three portions, one of which is designated for dapp development, but it is unclear how many developers they want to recruit or when the development would take place. This makes carrying out the feasibility analysis challenging. For future catalyst cycles, I urge that the team present a phased project in a way that allows the community to appropriately assess the viability.", "q1r": 3, "q2": "The success criteria for the next round of funding are suitable and relevant; nonetheless, I find the suggested metrics challenging to measure.\" To avoid confusion among future proposers, I recommend, if possible, examining the metrics prior to the launch. I agree that the success criteria and suggested metrics for measuring progress in tackling the challenge are appropriate.", "q2r": 4, "assessor": "z_assessor_3022", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13070, "q0": "I completely agree with 5 points for this recommendation\nThe reason is that the proposal is suitable for the challenges presented\nProposal to directly impact the development and expansion of the Cardano ecosystem\nI am really impressed with the way in which knowledge sharing is proposed. We all know knowledge is a very important thing for those involved in the cryptocurrency market. That knowledge comes from the old people who have been in the market for a long time but not everyone is willing to share and the proposal has introduced a reward mechanism based on the knowledge that users share this really motivates everyone. People tend to share what they know more. Sharing knowledge and earning money at the same time brings a lot of excitement\nHaving more people share their knowledge will help promote the network to expand, and new people getting useful information from experienced people will also help them avoid mistakes and scams.\nPeople in the community will also think more positively and be willing to share their own knowledge this will help build a positive and strong community over time.", "q0r": 5, "q1": "The proposal is a continuation of an already funded proposal from Fun8 which shows that the project has been noticed and appreciated by the community before.\nWith a specific 12-month roadmap and specific goals\nSpecifically, the roadmap offers mostly goals in terms of the number of knowledge-sharing articles and the number of members, which is really great if achieved specifically as follows:\n(1. In the next 3 months after approved\nRecruiting and training contributors from the community: 20 people\nAchieve 300+ contents\n2. In the next 6 months after approved\nRecruiting more members of the contributor team\nAchieve 700+ contents\n3. In the next 12 months after approved\nAchieve 1200+ contents)\nI completely agree with the budget proposed by the project, it can be seen that 90% of the budget is for developers to share knowledge, this shows that the project is very focused on community development.\nI checked the website that the suggestion gives. The site is dedicated to sharing content that is true to what the proposal states. The number of members, as well as the number of views, is steadily increasing, which shows that the proposal is on the right track and the shared content attracts many people to read and learn.\nPromoting content creation is also continuing to build a stronger and stronger Cardano network\nThe proposal also introduces the same project development members as the previous round", "q1r": 5, "q2": "This proposal With the goal of building a dynamic and active community network: members actively exchange and help each other improve their professional knowledge and skills in the blockchain field in general. as well as the entire Cardano ecosystem in particular.\nThe proposal has established specific KPI metrics over time. The project salary indicator is through the number of readers and shared articles\nThese metrics can be easily viewed by users and easily assessed the progress and results of the project\nBecause of the foregoing, I agree that this proposal provides me with sufficient information to gauge progress toward the stated goals.", "q2r": 4, "assessor": "z_assessor_3575", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13497, "q0": "This proposal is aimed at giving rewards to collaborators. This is a recommendation that should have been on the Cardano ecosystem for a long time. A very practical proposal, it helps collaborators have more motivation to contribute to the development of the ecosystem. In the crypto world, where knowledge and content are ambiguous, we should have reward schemes for contributors who create and contribute useful content. The Funded Proposal in Fun8 has achieved remarkable results, and the developer is calling for more funds to help it grow even stronger. I agree with the developer's point that \"Community is Cardano's most valuable asset.\" The mechanism the developer offers is quite reasonable; they are based on three main criteria: relevance, immediacy and spread. These three criteria are always the leading criteria in content creation, so the reward mechanism according to these three criteria is the policy in the crypto community. Thereby helping the Cardano ecosystem to have more and more useful knowledge and information for people to learn research and development. This will make a difference in the crypto world.", "q0r": 5, "q1": "In Fun8, they have grown and achieved results that prove it is possible to continue with the proposals to develop stronger. They give three milestones, three months, six months and twelve months which are essential schedules. The developer has a program in the first three months that will train 20 collaborators and achieve 300 assets so that each member will create 15 pieces of content in 3 months. This is an initial challenge for them. Meanwhile, they only have three people. The developer needs to hire more people to train and guide the collaborators in the initial steps. The reward budget for each piece of content that mentions 20$ for each piece of content with at least 1000 words; what about collaborators who create more than 1000 words? Developers who need to pay attention to this issue should increase the reward for articles with more than 1000 words to strongly promote the creativity of collaborators. For example, $10 for the next 500 words…", "q1r": 4, "q2": "This recommendation is mainly measured by the content that is created and produced, so it is easy to reward contributors' writing. But after some time, when the community grows more substantial and more and more contributors contribute positive content, it becomes challenging to reward. Developers should provide a transparent reward solution for future development. A project for the Cardano community I've always supported. Wish, the developer and team will overcome difficulties to help the ecosystem grow stronger and stronger.", "q2r": 5, "assessor": "z_assessor_3658", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13865, "q0": "The development team has given a specific budget analysis, along with reasonable evaluation criteria such as the number of videos, the number of responses, and the number of projects using the document to develop. Setting up a one-stop guide public on the website is necessary. The goal of supporting at least 50 new people and 1-3 project customers will be a good stepping stone for the development of this project.", "q0r": 5, "q1": "This is a phase 2 project from a proposal funded in fund 8. Thereby, it shows part of the capacity of the development team as well as the value of the project to the Cardano community. Regarding the development plan, I agree with focusing my time on training collaborators and moderating content ideas. This will help the development team to access many ideas as well as accurately evaluate the usefulness of the idea that will receive the reward. Besides, spending most of the budget on awarding, it can be seen that this is a completely community-oriented project, ensuring that good ideas will receive a worthy reward. For the difficulty that can be encountered if the price of ADA drops, a specific solution has been given by the development team, and I appreciate that.", "q1r": 5, "q2": "The quantity and quality of ideas contributed are crucial to the success of this project. The rate of increase in audience, and new readers every month will also gauge the community's interest in the project. To have accurate evaluations that determine the awarding of rewards, I hope the development team will develop a set of quality, objective, and public evaluation criteria", "q2r": 4, "assessor": "z_assessor_3837", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 14116, "q0": "The Cardano community is different from the others crypto is its focus on human knowledge. Therefore, it is necessary to reward to active members in the community. I fully support this proposal. The purpose of this proposal to increase qualitative contributions and stimulate the spread of contributions to the community. It's necessary to equip with knowledge and sharing community experiences in this volatile cryptocurrency market for all members. Because the members have been actively participating, building and contributing to the community so it brings constant growth. As the group wrote \"Most people create content about Cardano because of their interest and passion\". They don't care much about the value of the Ada coin going up or down. But they focus on the development of the community. Their reward is well deserved. This is a way for the Cardano community to become more civilized.", "q0r": 5, "q1": "The deployment team include 3 main members: Nhan Tran; Hoang Nguyen and Hung Nhu. They had experience in implementing community projects before. Typically, they already have a proposal funded in Fund 8. And this could be phase 2 of that proposal. After researching their information website, I found that most of the information is updated constanly, presented in a clearly way. This is a positive point for this proposal. An average cost of $ 24.6 for an 1000-word article is an appropriate price. That is enough to ensure the qualitve required. Realizing that service costs only accounted for 6.7% of the total initial fund, it proves the great effort of proposed team. Most of these costs are paid to community contributors, it's such a wonderful thing. With a 3-phase roadmap, the first 2 phases last 3 months after being approved. And the final stage lasts 6 months. Their ultimate goal gets +1200 content. I see that the number of requests increase 100 assets after each stage. I think they can accomplish their goals faster by increasing the number of recruiting and training contributors from community. Therefore, the team can significantly shorten the project completion time despite of using the same budget.", "q1r": 4, "q2": "I don't have many reviews for this part. Because almost everything has a clear schedule of progress. Specific and appropriate progress evaluation factors: Number of contents that have been produced by contributors; number of Active Contributors and rate of increase in audience, new readers every month indispensably. Goal of the proposal  the growth of the Cardano ecosystem with an active community of contributors with an attractive reward mechanism. By which, the community can develop and expand on its own. I have a small suggestion: they can create a leaderboard and extra rewards for the most active community contributors. Budget this reward will be extracted by deducting 0.5%(0.11$) of the rewards that collaborators receive after contributing. That will stimulate the contributors create more, faster and more efficient contents. Because, time is an important factor in the race between blockchain systems.", "q2r": 5, "assessor": "z_assessor_3906", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "It is necessary to design a reward mechanism that aims to encourage community members to contribute quality content to the website", "experience": "Our team has experienced:\n\nCopywriter\nContent Creator\nTranslator\nCommunity Manager\n"}