{"id": 414720, "author": "welshie", "title": "Developer Portal - Built on Cardano", "url": "https://cardano.ideascale.com/a/dtd/414720-48088", "category": 26597, "amount": 6300, "description": "There is no comprehensive library of the tools and educational resources available for developers looking to join Cardano.", "f6_no_assessments": 14, "f6_rating": 4.214285714285714, "videos": [], "media": [], "f6_assessments": [{"id": 1197, "q0": "This project wants to develop a website that collects all the projects, tools, and websites around the cardano ecosystem; and organized into an easily accessible and searchable library for developers and the community. After quite a long time after cardano got smartcontract, there are more and more projects and tools, so a tool like this is necessary for us. According to their description, after the project is completed, the user community can also contribute and add information to the website through the user interface. So this tool will be a complete, useful and objective library for the community over time. Although this is a small project, I am very supportive of this project.", "q0r": 4, "q1": "Roadmap of this project only took 6 weeks - saving time than many other catalyst projects. They will use github and the catalyst community to collect information and gather all projects and tools on the cardano platform. Then organize this information into a library that's easy to look up. And then there's the easy-to-communicate UI organization. The budget is quite suitable for this project (7700$) because there is not much work. They have 2 team members, they are both experienced people suitable for the project, with clear personal profiles. These are the positive factors that make me believe in the project and give it a good score in this piece of content.", "q1r": 5, "q2": "They already have a website where the community can track the progress of the project. (https://builtoncardano.com/search?q=dev%20tools) This is a commendable thing. However, they need to specify more clearly the parameters to show the success and progress of their project. In addition, in addition to the number of developers (as they suggested), there are many parameters that we need statistics to verify this project. It can be the number of tools, websites around the cardano ecosystem, the number of users...\nIn addition to their website, github can also be a good tool for making reports.\nTo sum up, this presentation is not clear enough to be able to reach my full score.", "q2r": 4, "assessor": "z_assessor_2217", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2779, "q0": "\"the problem that ideas give us is that the resources on protocols, languages, etc. and synthesize it in a certain library, this will affect the limited and difficult knowledge gathered by developers, and the proposal has proposed a solution to optimize them by: synthesis list and arrange them in a large library to make it easier to find and absorb that knowledge for developers and not spend a lot of time searching for them, which will have a great impact on the development of New developers as challenging requirements set forth.\n   by collecting and categorizing the features, and all the resources available or being created by the development community then tagging them so that it can be easily understood by new developers and in no time at all. time to find them the old-fashioned way on social networking sites, and the proposed team is also committed to open source code for adding knowledge or a feature that is not yet in the library that the community or the developers add them to the library.\n  *The proposal states that it will connect with experienced or ongoing developers to provide them with more features they are using, in this way I would like to add a little bit that is: team You might consider inviting them to interpret during the library's live streams the proposal generates, which will have surprising results as those engineers will interpret and respond to all requests directly. commenting on the workings of the protocols, it would be more attractive to do that and moreover as far as I know there would be no cost for those engineers' willingness to share because They will be introduced to the community about their project, which is mutually beneficial.\n   * and the risk part I also have a small suggestion: the vision of the library you are creating is very large so this can affect the world community if the team proposes to do this, the language Language will no longer be a barrier for developers around the world, let's try to connect and collaborate more with community-oriented developer experts in developing countries. strong Blockchain developers, when working with them will optimize the language barrier because they will have a follow-up proposal to this proposal is a library compiler in their native language, like their Catalyst doing this will scale the library more than . \"", "q0r": 4, "q1": "\"With my comments on this proposal in terms of impact, the proposed team could completely request additional funding, and as well as the team roadmap, it will take time to set up the foundation and should initially take some time. maintain meetings of the library community consisting of novice developers and developer engineers working on their potential solutions and ideas.\n   I will not comment on the team presentation of the proposal because the team has satisfied the requirements of experience as well as the work assignments to complete this idea to each member in detail and specificity. \"", "q1r": 4, "q2": "\"I logged into the proposal team's website where there were already 508 proposals put together by the team which proves that all the project progress metrics will be easily followed by the community. monitor and check,\n    The success of this proposal is always adding new knowledge from the community and many new developers will come to the Cardano ecosystem from the knowledge in this library. \"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"id": 3440, "q0": "This proposal addresses challenge in a very simple and effective way. By creating a place to consolidate (libraries) general information, such as tools and educational contents, about cardano and makint orgnized,tagged and searchable, more creators/developers will join Cardano and the existing ones will have its productive increased. This can increase challenge kpis such as \"Number of developers actively building on top of Cardano\" and fit some of the potential directions in challenge description (example,  Support structures). It's good that the community will be able to contribuite and add their own tools and resourcess, which may accelrate the speed the content is concentrated there.\nOne thing that is important and is not mentioned is how this portal will be communicated in the community so developers get to know it, can leverage what is in it and contribuite with their own tool. This is key for an evergrowing library.", "q0r": 5, "q1": "There's a time-framed plan with the main deliverables but more details on the acitivites necessary to develop this deliverables could be ellaborated (for instance, explan step by step how proposers will gather the information and what their timing is). It's also imporant to keep in mind that some time should be spent on communicating the platform, after its launch, so it can reach its full potential and this should be included in the timeline.\nBudget breakdown is very clear, divided by the 2 main work packages (information gatehring and UI development) and the total hours required for each one. It matches well project scope and plan.\nAs for the team, there are 2 people already committed, with experience in  UI development and Cardano, which should be enoigh for this project. Links are provided as reference and there are good descriptions on each one's background. It's possible to notice they have a good Cardano contact network which will help here.\nAll in all, this is a simple (but powerful) project, that doesnt present many risks or hurdles, and with the information provided, its enogh to say they'll very likely be succesful (even though project plan is not much detailed). My rate is 5", "q1r": 5, "q2": "The auditability on this project relies on the creation of the portal, available to everyone to check, and the number of tools listed in it, which will be displayed in the same website, which is very good. However, even though its is na ever growing portal, there could be some target on, for instance, first 3 months and year 1 on the total amount of tools proposers intend to have listed. This would help assess if one of the work packages was properly done (gathering information) and if website is being correctly adversited (so community keeps contribuiting). In addition, there could be a metric also to verify feedback from the community on the portal (whether they are liking or not). This would assess success in the other work package (UI development).", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 5129, "q0": "Cardano’s developer tools and educational resources are growing at a fast rate but are scattered and hard to find. The proposal wants to tackle the issues by creating a portal that collects tools and resources so the community can easily find what they searching for. Due to the low-risk nature of the project and the team has already collected 70+ tools, I have confidence the proposal can be implemented successfully according to the plan.", "q0r": 5, "q1": "Milestones that must be finished are clearly defined on a specific timetable. Proposers provide budget information but are not broken down enough. 50 hours used for locating tools and resources can be written on each milestone rather than summing up them, such as searching through the GitHub repo for 10 hours, contacting developers for 10 hours, etc. The same thing applies to platform development. The proposal gives detailed information about the proposer's background, experience, and relevant skills. Not to mention, they also provide relevant links such as LinkedIn profiles and personal websites.", "q1r": 4, "q2": "Metrics used for tracking the progress are daily visits, however, it can be better if proposers state where the portal link/Github repository is so it will be easier for the community to track. The success of the project is not clearly defined. It will be better if proposers define success with something specific and measurable. For example, more than 100 daily sites, or conducting a survey for users, with more than 75% of them citing the portal as useful.", "q2r": 3, "assessor": "z_assessor_2675", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 5473, "q0": "The manifesto in hand is unique and intriguing, considering the impact it could have on the community and Cardano chain on the whole. While we see a lot of proposals working on bringing more value into the chain, this proposal is trying to solidify those efforts in the right way. The proposer plans to implement a one-stop platform to access all kinds of resources and apps built on Cardano. This could help newbies and want-to-be Cardano developers who spend a lot of time looking for these materials elsewhere. The centralized browser over the de-centralized network of Cardano is surely eye-catching. This could draw a lot of new traffic into the chain and also enhance the quality of new works in turn improving the stronghold of Cardano in the Blockchain world. A comprehensive database for the extensive and still-growing library of our Cardano is surely a requirement, and this proposal is a sight for the sore eyes. Nevertheless, I feel the team has to be warier about the challenges and it feels that they have underestimated it a little.", "q0r": 5, "q1": "The proposal is a bit off when it comes to feasibility criteria. There is a conflict with respect to the funds requested, different values are provided in the GENERAL section and FEASIBILITY section. The budget breakdown is also sparse with no clear breakdown of roles and pays. The team mentioned in the manifesto comprises 2 members who have a collective of 10+ years of experience in the field of Cardano and application development and this seems the only bit of a dependable aspect from the feasibility perspective.  The proposer only provides a brief description of their plan without much detail and it is quite hard to assess the technical aspects and also understand the approach the team is planning to employ in bringing the entire project to closure. Thus, I would recommend the team provides a more detailed plan of action going forward.", "q1r": 3, "q2": "The proposition contains the metrics such as site visits, content count, and developers' feedback as usable KPIs to track the success of the proposal. These metrics also line up with the challenge's requirements. Nonetheless, the draft lacks in providing the progress metrics that the audit team can look into to track the development phase of the project. Without these metrics, I assume the audit process would be tedious. But considering that the success metrics are clearly defined to monitor the usage and impact, the team has understood the problem at hand, especially being a new team with a new proposal. But with respect to the progress metrics, there is still a lot of room for improvement and I assume the team is competent enough to work on them and assist the auditors in every aspect. Thus, I would grade 4 for the auditability aspect of the proposal.", "q2r": 4, "assessor": "z_assessor_2704", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 6316, "q0": "This proposal is about collecting and organizing all the developer tools and educational resources created to build on Cardano and making them available to developers through the searchable portal.\n \nIt is well-aligned with the Challenge statement as it will create a good experience for the developers who are coming first to build on Cardano by making it easier for developers to build DApps or other products on Cardano.\n \nIt will surely add value to Cardano Ecosystem as it will help to onboard the Developers who otherwise would not have started building on Cardano due to the frustration of not being able to find everything required in one place.\n \nThe proposer is aware of the risk in carrying out this proposal, and it seems he will be able to overcome it, considering his experience.", "q0r": 5, "q1": "The proposer and his team are well qualified to do the tasks laid out in the proposal. The team's brief introduction is provided along with one member's LinkedIn profile. Moreover, one team member worked on other projects on Cardano, such as NFT Maker and Gimbalabs.\n \nThe team has also built a beautiful website, 'www.builtoncardano.com,' which is the easy-to-navigate hub of many projects and tools of the Cardano Ecosystem. The portal discussed in the proposal is already live with seventy-plus tools & resources and can be seen on this same website at this link https://builtoncardano.com/search?q=dev%20tools. As stated by the proposer, it is a work in progress, and the team will add more tools and resources. \n \nThe asked budget of $6,300 is decent, and it has been broken down into identifiable categories of locating tools and resources $3,500 and platform development $2,800.\n \nThe mentioned timeline is a maximum of six weeks which is incredible. Six weeks are required as follows four weeks for tools and resources gathering etc., and two weeks for database finalization and audit of the user interface. \n\nBecause of all the above positive facts, the proposal seems to be implemented if funded.", "q1r": 5, "q2": "The proposal's progress can be monitored or tracked on the link mentioned above, in which all the required tools and resources will be listed. This list will be growing as the work progresses. \n \nAs per the fact mentioned already, the timeframe is simply clear. It is six weeks, after which the final product will be ready.\nAs stated by the proposer, the proposal's success can be measured by the number of developers coming into the Cardano Ecosystem due to this portal. Another metric can be the number of DApps/products developed by the same onboarded developers. ", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6970, "q0": "    -  Surely we all know that with today's rapidly developing technology, the electronic portals are also developing equally. But developing a Developer Portal - Built on top of Cardano is quite a new idea and I think the idea is pretty cool. here i see the problem raised that there is no comprehensive library of educational tools and resources for developers who want to join Cardano. and the solution is also presented quite fully and clearly by the group. There is a library that is large enough, but incomplete and not scalable. will find and list all the developer tools and developer education resources available on Cardano. will go through our existing library and reorganize and re-tag the tools and resources we've listed with more comprehensive tags, including the language tags mentioned earlier. I find solutions like the ones outlined above to be very reasonable and well-suited to the challenge. In addition, the team also raised the risks that the project may face, in which the main risk is that the team does not fulfill the promise. For that theme the project was trying deep into Cardano. however, the group has not yet outlined how to reduce those risks.", "q0r": 4, "q1": "    -  Section that provides a blueprint, including progress and milestones for the proposal. I see the proposal team has defined a specific timeline that will complete all work within a 6-week period. I think the above timeline is perfectly reasonable to complete the set tasks. have a clear goal in that timeline. on budget. with funding as requested and has been divided into two main phases as stated. I think it makes perfect sense to divide by two stages as shown in the given diagram. when asked for details about who will work on the project. The project topic has increased to 2 members. Assign specific tasks to each member. Through research, I found that the two members above have very good experience and have many years of experience in this field. This will help the project to be developed better.", "q1r": 4, "q2": "    -  When asked for a description of what you will measure to track project progress. The group has listed a few indicators, but the indicators are only stated in general and the measurement indicators are not easy for the community to check and track without a link to authenticate. about the successful presentation of the project. I found the group to have successfully raised it. a larger number of developers come and stay in the Cardano ecosystem thanks to this portal. I see this success as closely related to the challenge. However, the project is currently only at the Idea, but has not been tested. on funding. This is a new project so it has not been funded yet. However, I think this is a very potential project. I hope the project will be successful soon.", "q2r": 3, "assessor": "z_assessor_2856", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 7093, "q0": "The proposer wants to expand the specificy of projects tagging and adds a better UI flow to search for tools & education resources on the BuiltOnCardano site. I appreciate the initiative to keep improving the site allowing an easier way to search for anything built on Cardano. By providing these resources, newcomers could see how diverse our ecosystem is, and people who are already into Cardano could easily find new projects. Therefore I strongly agree this proposal would add a massive value as it facilitates further collaboration in the community.", "q0r": 5, "q1": "There is no obstacle that I see that would hinder the implementation of this proposal. The proposer does have relevant experience needed for what they are planning to achieve based on their profile. The budget is already broken down based on the hours multiplied by their rate. I think 60 hours in the span of 6 weeks is also doable because the developer that takes care of building new UI flow have a long experience as a front end engineer and the member who is responsible collecting more tools have done the exact tasks before.  Thus, I am strongly confident the project could be carried out.", "q1r": 5, "q2": "The milestone is pretty evident; a new UI flow and new projects are listed in 6 weeks. Though, I wonder if it's possible to measure the results. For the former, perhaps we could do a survey to capture user feedback on what they would like to improve. Meanwhile, for the latter, maybe it's better if there is an arbitrary target on how many new projects they would add and how many older projects they retagged. That would help us justify the amount of budget the proposer asked for the second milestone. But in the end, I agree that the project could be tracked, and we could see improvement in the next six weeks.", "q2r": 4, "assessor": "z_assessor_2878", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 8837, "q0": "As there are many tools available in the market related to learn about cardano ,but they are not organized way and even those data or not collaborated over single platform , the newcomer has to reach different website to get different data which will discourage new onboarded members , hence to counter that the proposer's team wants to build a developer portal where he wants to organize all the developer tools and educational resources that have been created for building on Cardano, Hence it can help the new onboarded members where they can get all the data , Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed task is not difficult to achieve as it needs to collect the tools that are created to help the cardano ecosystem and add them in single portal, the main challenge here is gathering all the tools because there are many websites built by cardano community members how will the proposer's team will be knowing each and every websites, other than that building portal and setting up directory like feature can be achieved as Gabriel has great experience in UI development and Ben can tweak the data so that it can make the website easy to access, Hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clearly mentioned its goal to build a portal so that it can help the new developers in accessing the tools build by community members to make cardano ecosystem still stronger, audit even contains how it can counter the challenges faced by youngsters during fresh onboarding and build confidence in them to develop a new project.\naudit has assigned the role to member of building a tool and other to tweak the content so that it can help in easy access, audit contains detailed budget breaking idea and simple timeline to complete the project, Hence with moderate risk involved the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 9304, "q0": "Your suggestions are relevant to the problem. I found that building developer portal is necessary as you guys have given. Because these software are solutions to integrate system information, providing many different types of system integration with strong applicability and extensibility, rich features, suitable for application needs. Useful for developers who need to learn information on cardano. This is consistent with your solution as it will not only be good for integrators but it will provide existing developers with an easily searchable database of tools. tools, libraries, and other resources created by other members of the Cardano community. Therefore, the ability to apply and expand the portal is deployed, operating in a powerful and effective way. So I think this project of yours has a good influence.", "q0r": 5, "q1": "\"The proposal is quite general in terms of what it is intended to achieve and how it is to be achieved. The blueprint you have given that this project will take 6 weeks to complete this needs to be given more detail on what the plan needs to be done. In the budget analysis it is mentioned that the cost requirement will be broken down by task and by time. The proponent also specified the members of the group, but I see a few people.\n The proponent has provided a link to his resume, searching by his name returns a page of links matching his name and general overview of his work as an avid writer and nimble, experienced in many different fields and writing styles, creative mind and keen professional eye (Benjamin Beddow) ...Gabriel - engineer and user interface developer for Be build on Cardano - With over 5 years of experience. Team members are experienced but need to be more specific about the more detailed implementation plans.\"", "q1r": 4, "q2": "I see no suggested KPIs. I suggest that the proponent include KPIs and measurable outcomes that can be expected at the end and during the project. The real success I think is not just the greater number of developers coming and staying in the Cardano ecosystem thanks to this portal and looking back they think it was a positive influence on why at why do they stay in Cardano but also the percentage of people participating is increasing. The number of tools listed in the portal will be displayed on the portal as a target, so give a target number to strive for. Become a reputable portal with high hits, useful for everyone.", "q2r": 3, "assessor": "z_assessor_3046", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10132, "q0": "The idea is about creating a Collection and organising all the developer tools and educational resources that have been created to build on Cardano into an easily searchable portal More specifically, an online library of network information for Cardano developers is a good idea.\n\n      But I think the team should consider adding more content browsing standards when it comes to your library. clearly state the rules as well as ask people to follow to contribute content in the most selective way. to help the library not contain unnecessary content. and the team need to consider more about library security risks and restricting content to the community. In my opinion, this is something that really needs to be added. this is why I put 3 stars on the idea. and good luck.", "q0r": 4, "q1": "According to the author's statement, this proposal includes two operators, it's great that you attach LinkedIn / GitHub links / individual web pages of each team member. The library is open-minded.\n\n   The idea is to provide a visual, visual view of how content decision-makers are the community we provide. This reinforces the excitement of the proposal and also provides a practical step-by-step roadmap. present enough. The proposal provided a budget table that clearly divided the funds to be mobilized, explaining the expenditure items needed to implement the idea. However, I think there should be a small note in the steps. It is recommended, if possible, that you clearly assign tasks to each person. to help us better understand the workload.", "q1r": 4, "q2": "What the proposed team is trying to do is a good idea. The real success will be the greater number of developers coming and staying in the Cardano ecosystem. help people have a reference database and better understand this ecosystem. The team also provides a clear and transparent index score. But with this, I think the team needs to add a measure of \"library visitors, contribution statistics\" to the media coverage of ideas. Only then can we help defenders clearly gauge the success of our ideas.", "q2r": 3, "assessor": "z_assessor_3160", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 10369, "q0": "The proposer would like to create a library of the tools and educational resources for developers. We all know if a team wants to build a project on Cardano, this team must be equipped with knowledge of Cardano blockchain. Except to having knowledge of blockchain, smart contract, design…, developers need understand tools and how to use them. Currently, there are a lot of projects building on Cardano but one of the biggest risks that those projects face is using tools on Cardano. Creating a comprehensive library will help developers master the tools easier. it’s really helpful for developers and Cardano.", "q0r": 5, "q1": "The proposal’s team have already had an extensive library of tools and resources for Cardano. However, they expect to improve and expand this library. They suggest the budget $6300 and have a plan for using this budget. They also explain ways they use the budget for collecting developer tools and resources. For example, they will search through Github, previously funded Catalyst proposals or even contacting developer organizations on Cardano. I think that they are very active and responsible for their project. Their team has two people. Although both of them have experience about searching the tools and resources, they also need more human resources about communication or marketing. Furthermore, they have just collected over 70+ developer tools, it’s quite small. They should have a target how many tools they will collect and milestones to gain this target.", "q1r": 4, "q2": "The community can measure the effectiveness of the project by following platforms the Cardano Forum and Cardano Stack Exchange. The team will share their tools and resources in these platforms. The team also provides the website \"https://benjaminbeddow.com\" for everybody to check their work.  But, I think they should develop social media such as Twitter, Discord, or Telegram. These channels are very useful for everyone to follow.", "q2r": 4, "assessor": "z_assessor_3183", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 10483, "q0": "\"   - As we all know with a developed society like today, opening an electronic portal built on Cardano is a very new issue for people. With an idea to open a developer portal - Built on Cardano I found this to be a much needed idea.\n\n   - The proposed topic has very clearly defined what the problem is. There is no comprehensive library of educational tools and resources available to developers looking to join Cardano. The problem that the group raised was very relevant, able to solve the questions of the challenge.\n  - Thereby the group also proposed solutions to solve the above problem. Bring together and organize all the developer tools and educational resources that were created to build on Cardano into one easily searchable, portal for developers to use. With the solution presentation, I found that the group made clear and logical arguments to solve the problems of the challenge.\n\n   - In the group risk management section, the main risks of this proposal have been outlined. The team did not deliver on their promises. At the same time, the group has also come up with a specific plan to deal with that risk as stated in the proposal. I hope your project will be successful.\"", "q0r": 4, "q1": "\"  - By providing detailed plan including project progress and time. The team specified a specific time that would take 6 weeks to complete the project. I find such divided timelines reasonable to complete the set tasks. In addition, the objectives of the project have not been determined by the group. The progress of the project is not yet easily tracked by the community.\n\n   - With a requested budget of $ 7,700 and has been divided equally between 2 different expenses by the team. I find the budget to be divided like that to be reasonable. However, the group also needs to have a contingency plan in case it needs to supplement the budget.\n \n  - In terms of providing detailed information about the people who will work on the project, the team has listed 2 members and each member is responsible for a suitable job. As introduced in the proposal, the members are all experienced in building Cardano, the sense of responsibility for the work of the 2 members is very good. The identities of the members are easily verified and documents are attached below the links for the community to follow.\n \"", "q1r": 3, "q2": "\" - In the description of the measurement progress of the project, the team has not given specific indicators to measure the progress of the completed work, but the group only stated in general. The indicators are not easily checked and monitored by the community.  \n\n  - The success of the project described the outcome to be achieved that is. A greater number of developers come and stay in the Cardano ecosystem thanks to this portal, and looking back, they consider it a positive influence on why they stayed at Cardano. I consider success The success of the project is related to the challenge of the campaign.\n\n  - The proposal that the team made is a new one, so it has not been tested and funded. However, I think this project is quite good and I hope this project will be approved soon, wish you success.\"", "q2r": 3, "assessor": "z_assessor_3188", "no_vca": 11, "ne": 2, "ng": 4, "nfo": 5, "vca_o": 1}, {"id": 12481, "q0": "The proposal wants to create a portal consisting of all developer tools and developer education resources that are available on Cardano as we know it's hard to find. The proposers state the main potential risk that will face the project is the non-fulfillment of promises by the team. However, they do not give a mitigation plan but they have already collected over 70+ developer tools so the risk is a very small one. I have confidence the project will be implemented successfully regarding the high demand for Cardano dev tools and education.", "q0r": 5, "q1": "The proposal provides milestones with temporal timelines divided into 2 big parts such as resource tool gathering (4 weeks) and UI audit (2 weeks). However, it can be better if the proposers break down the timeline for each part. For example, the resource tool gathering consists of a searching tool that will take 2 weeks,  seeking developer permission will take 1 week, etc. The proposal outlined the breakdown of the budget in 2 parts such as Location tools and platform development but not detailed enough (they only state the cost ratio per hour for each part which is not broken down). The proposal provides information on each member's background, experience, and relevant skills. In addition, they also attached a LinkedIn profile and personal websites so the community can easily verify their credibility,", "q1r": 4, "q2": "The proposal use site visit and the number of tools listed in the portal as a metric to track their project progress. I think it will be better if they also provide their repository to track their progress also documentation. The defined success is stated by proposers only when many users use the portal. I think it is not enough to define the success metric and also It will be better if they state the exact number. For example, the total number of users using the portal is more than 5000 in 1 month.", "q2r": 3, "assessor": "z_assessor_3422", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Gather and organize all the developer tools and educational resources that have been created for building on Cardano into an easily searchable portal for developers to use.", "experience": "Creators of Built on Cardano, the resource for exploring and learning about projects and tools on Cardano through an intuitive tagging system.\nBen - 4 years technical writing experience.\nGabriel - 5 years developing and engineering experience."}