{"id": 414896, "author": "quangtran", "title": "Haskell Course For Developers", "url": "https://cardano.ideascale.com/a/dtd/414896-48088", "category": 26597, "amount": 16080, "description": "There are many developers who really want to write smart contracts and build projects on Cardano. But Haskell is a big barrier for developers from comparative programming languages.", "f6_no_assessments": 18, "f6_rating": 4.851851851851851, "videos": [], "media": [], "f6_assessments": [{"id": 1099, "q0": "   This project is about providing Haskell and plutus courses. The competition towards my great migration of solidity developers the cardano ecosystem is lacking educational resources.  The more the better.   Therefore this proposal will indeed participate and facilitate the growth of the developer community on the Cardano ecosystem.\n", "q0r": 4, "q1": "   The team is talented and experienced (more than 20 years in all in Haskell industry) and it has already done several courses online.   This can be checked with the online.\n   \n    The curriculum and progression are well detailed and realist.  For each topic a set of task are expressed in terms of hours:  making content,  recording video,  editing.\n     There's really no question that this course will be made available online.\n\n    It has already been done for other communities.\n\n    The team exposed concern about the difficulty of learning online and proposed to set up a website of questions and answers which is a good way of keeping their learners engaged.  This is supported by the socio-constructivisme theory of learning, that is the main one actually.", "q1r": 5, "q2": "   Since the curriculum is well detailed it will be easy to see if the course  was built as announced.\n\n   What is lacking is a way of tracking the number of new students taking in completing the course.\n", "q2r": 5, "assessor": "z_assessor_2194", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 14755, "q0": "The team realizes that the potential from developers is huge as more people want to write smart contracts and build projects on Cardano. However, the Haskell programming language prevented them from implementing their ideas. Realizing that Haskell was a major barrier for developers, the team came up with the idea to create a Haskell course for developers from other programming languages. This course will give developers easier access to the programming language used in Cardano's smart contracts. This is a great idea to increase the number of developers for Cardano.\nIn this section, the proposal writer presented their product functions and features or the main components and main activities of the project. The team chooses social media platforms to popularize the course. This makes the course accessible to many people which in turn will attract more members to the Cardano community. The target audience of the project is programmers. The course will positively impact these audiences and make it easier for them to execute their projects on Cardano. We can see that the proposal perfectly fits and supports the goal that Challenge is aiming for.\nThe results that the project promises are also presented very specifically, and clearly in each part. These results are completely consistent with the Key metrics of the Challenge, which simplifies the programming language approach for programmers and attracts community participation.\nThe difficulties that the project will encounter are also anticipated by the proposers. They are aware that learning programming languages ​​are not easy, especially self-study through YouTube videos. Understanding the difficulties of learners, the team has worked hard to find a solution to this problem and will fix it soon.", "q0r": 5, "q1": "The project implementation plan lasts for 6 months. In general, the plan set out for the project is quite reasonable. The roadmap clearly outlines the tasks to be performed. Each work item has detailed requirements that set standards for completion. The proposal also provides a reasonable timeline for completing the proposed work. The proposal has details on the technical and technological aspects required to execute the plan. The proposer provides information (evidence, witnesses, or links…) about the skills and experience needed to carry out the activities mentioned in the proposal. Based on the information provided, the community can have an overview of the project implementation progress. This also helps the project receive a good assessment of its potential to achieve the expected results. However, to be more appreciated, the team should Proposer clearly define the positions and the number of people needed to carry out the proposed project.\nAs for the budget plan, I think the team should provide a more specific plan. In order for the community to consider whether the budget is reasonable compared to the plan outlined in the proposal, the team needs to provide details about the costs that they will use the budget to spend on it. It can be personnel by monthly salary, hourly salary, weekly salary, or per job. Or pay for necessary assets that are specified in the plan. The budget plan should be broken down and presented in a clear bulleted format to be used for each item.\nThe proposal should include a section that provides information about the people implementing the project. The proposers should add their profiles to the proposal. Based on the knowledge and experience of the project implementers, this project will be appreciated for its potential for future success.", "q1r": 4, "q2": "Project success is measured by the number of video viewers, likes, comments, and subscribers. These numbers will reflect the scope of the project. Specific quantitative indicators have been provided by the team. Based on these numbers, the community can track each step from the time the project starts to launch until the end of the project and evaluate the success that the project has achieved. Providing a clear picture of the project's success as well as specific numbers shows that the team is taking the project seriously and pursuing the set goals. The team promises to bring the successes from the previous project to this project.", "q2r": 5, "assessor": "z_assessor_4099", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 14001, "q0": "Nowadays, the demand for studying Haskell - programming language has been raised rapidly. Since Haskell is a type of programming language based on the module type, and completely different from Solidity or Python as well. It may be difficult for developers to study/access it in their programming work. Therefore, the proposal is to provide a study course about this language, but they would focus mostly on the advanced knowledge aspect. As it is easy to figure out a basic video tutorial about Haskell but rare for advanced level because of the specification of this language that is not many people that are confident to deliver the lectures in advanced level or in-depth. Therefore, this proposal is a perfect solution for that obstacle. Thereby developing the creativity and productivity of those developers in producing more novel products on blockchain Cardano. I think it is a quite helpful idea because there are not many courses now that are available on social media platforms and if they have, it will contain the easier or for beginner level, so that there might be developers who want to know in-depth that language are unable or trouble with finding a reliable course for advanced knowledge.", "q0r": 5, "q1": "When looking at the feasibility, I cannot agree more with such a specific and well-done proposal. The proposal as I said that they would create a studying course about Haskell by providing videos which contain a variety of lessons and the content comes from advanced Haskell books such as Real-World Haskell, Practical Haskell, Production Haskell, etc. Definitely, in each uploaded video, lessons, then exercises and practical projects are included fully. The proposer describes there would be a 6-month plan in which listed in detail how many videos for each stage in each month and the expected duration for them. The number of hours for conducting those videos are included as well so that comes up with the total cost $16,080 for the project. Those participants and teammates all have experience in studying Haskell language up to 5 years and above so that I appreciate the success level of this proposal. I just have a little suggestion that there should be a description about the marketing strategy that how the proposal will be introduced or attracted developers so that the team can be sure about the achievement of their proposal.", "q1r": 5, "q2": "In the auditability, all the provided information is clear and transparent. The readers can keep track or evaluate the process whether it is successful or failed based on those targeted numbers after 6 months for example the proposal gains on 500 subscribers or not as they set at beginning, or each video can reach to 100 views or not, etc. Anyway, since the estimating number is not very large, I believe the proposal can gain success in this Fund.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 13811, "q0": "Creating a Haskell course for developers is the kind of project we need to expand the Cardano Community. Haskell can be a real hurdle for lots of developers who are really interested in building smart contracts and different projects within the Cardano Community. This advanced course is the next step in this team's efforts for drawing in new developers into the Cardano Community. The Beginners course they have already launched may not be enough to build real projects and smart contracts. New developers still need this advanced course for real and actual work. The sharing of the produced audiovisual content will be a key milestone in drawing in new developers into our community. It might be interesting for the team to make an effective linkage between the course students and the Cardano Catalyst, introducing them into our community and its wide opportunities of creative and aspirational ideas and values. So yes, this proposal does effectively address the challenge. ", "q0r": 5, "q1": "Given the “Haskell course for Beginners” already launched and funded in previous funds, this team and its very well presented plan are highly likely to successfully implement their proposal. The timeline and key milestones are consistent and guaranteed success especially considering the audiovisual content that will be produced and the Practical Projects that will be designed and can be really interesting educational material for our community for future courses. It might be also interesting to add that a strong communication strategy can help create a wider audience for the course. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. Key milestones in a clear timeline sets up a consistent panorama for the community to audit their progress easily and effectively. Nevertheless, it might be interesting to take into account, besides the amount of views the Youtube audiovisual content and subscribers will have on how many course students join the Cardano Catalyst and produce their own or apply in different projects into Haskell code. Auditability should also take in regards the quality of the results of the project and not only the amount numbers, as our challenge is to widen our Developer Ecosystem and produce real and profitable projects within our Cardano community. ", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 9608, "q0": "This proposal is aligned with the challenge setting. By creating a Haskell course, it will make it easier for programmers to learn smart contract programming and then create more dApps. Haskell is a programming language that probably every Cardano smart contract programmer needs to know, having more Haskell courses always creates positive experiences for programmers on the journey to becoming a Cardano developer. However, Haskell is a programming language that has been around for a long time, although not as widely used as other programming languages, there are still some very good Haskell courses taught by professors and PhD in the field. I suggest that the proposer should clearly state the difference between his course and other existing courses. For example, the proposer's course will give more examples related to smart contracts. So that Voter can clearly see the core value that the course brings to the programmers of the Cardano ecosystem.", "q0r": 4, "q1": "The proposal provided information on the experience and skills of each team member, skills that are necessary to bring the project to success. However, the proposal does not specify the role of each person, who will be the teacher of the course, who will prepare the exercises, who will edit the video, etc. The budget is also broken down into specific items, but in my opinion, the video editor's $60/hour salary (equal to the person preparing the course content) is not reasonable, because editing video does not require much experience, effort and does not bring much value to the success of the project. In addition, the proposer should also explain more about how to present the solution of the exercises, is it saved as code files or is it a video explaining the solution in detail?\n\nThe proposed timeline is suitable for building a Haskell course with 10 lessons and 200 exercises in 268 hours. Overall, in my opinion, the team is qualified to carry out the project, the proposer needs to add more information to make the proposal more detailed.", "q1r": 3, "q2": "The proposal provided a full range of metrics and KPIs so that the community could check the progress and success of the project. Lessons will be posted on Youtube and in public mode so everyone can watch and keep track. The targeted problem and the solution are described clearly and understandably.", "q2r": 5, "assessor": "z_assessor_3068", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 9310, "q0": "I found that the recommended Haskell Course For Developers is a course that can make it simpler for developers from other programming languages ​​to access Haskell. This can help a large number of developers from other programming languages ​​move to build projects on Cardano. The idea of ​​this project was really necessary because I think Haskell might not be as popular as Python or JavaScript, but it still has a pretty good database of packages called Hackage. It's not as extensive as Python but usually includes pretty rare things. Haskell allows code reuse. Patterns are abstracted into reusable components and components, and later high-level interfaces are integrated into libraries. This reduces code duplication and developers can focus on building systems and designing algorithms instead of debuging over and over. So need courses for developers like you suggested. ", "q0r": 5, "q1": "I totally see your thoroughness when reading your detailed plan. After reviewing the team's proposal, I found the group's plan to give a very specific work plan for each month. The team's recommendations detail what to do, hourly and monthly in great detail. The budget provides public details of labor costs. The members of the project are all talented and experienced people. You also have an illustrated video in English, not your mother tongue. This makes it easier for people to follow your suggestions. Therefore, I think this project has a lot of potential in the Cardano ecosystem.", "q1r": 5, "q2": "Recommended reading is easy to understand, simple. There should be numbers to measure for example how many views a video posted to youtube gets. The success of the project can also be attributed to the positive feedback of the learners. After 6 months, I think the number of people participating in the Plutus pioneer program should be increased to 100 or more instead of 50. I think 50 people is a bit small for such a good project.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 9137, "q0": "\"Currently, the number of people who want to learn about programming languages in a methodical way to become blockchain developers is increasing. The Haskell programming language is one of them.\n\t The Haskell programming language is polymorphic, statically typed, purely functional, and lazy with type inference language. It’s quite difficult for developers from other programming languages and beginners to approach and learn Haskell. This proposal talks about the idea of creating a Haskell course for developers to make it easier for them to access Haskell. They also have a fund proposal for a beginner course in the previous Fund 8 and this course helps newcomers get a background in Haskell.\n\tTheir course will be built on the content of advanced Haskell books such as Real World Haskell, Practical Haskell, Production Haskell,.. Once the course is completed, the team will share these videos with developers in other blockchain communities and blockchain enthusiasts to attract more participants. Since then there will be many people who know how to use Haskell to create projects for Cardano.\n\tPlutus smart contracts are built by efficient Haskell programs. However, Haskell is an uncommon language like JavaScript, C++, C#,... .So there are few developers who can use this language for programming. So this course can help developers understand the Haskell language better and thereby achieve the key metrics of the challenge of increasing the number of developers for Cardano.\n\tLearning a new programming language is difficult for many developers, so the team came up with a solution to create Zoom Q&A sessions to answer everyone's questions.\n\"", "q0r": 5, "q1": "\"In the feasibility part, the team gives a specific plan of building the course within 6 months with the amount of time working like creating video lessons and exercises for each video. They also offer an hourly rate of $60 and a six-month total of a little over $16,000.\n\tThey also give the number of people they will help after 6 months, at least 50 people taking the Plutus Pioneer Program course and 10 proposals submitted on Catalyst through the Haskell Developer Course.\n\tThe key people on the project mostly have experience in Haskell programming which suggests that this project will produce the best possible course.\n\"", "q1r": 5, "q2": "\"The team will measure the success of the project through the number of video viewers, likes, comments, and subscribers. That will help the team see if the videos are well-reviewed and impact developers well.\n\tThe group set the desired targets such as 50 people participating in the Plutus Pioneer Program, the Youtube channel got 500 subscribers, and videos reaching more than 100 views, likes and interactions. Since these videos are highly educational, I have high hopes that the team can create the best quality course and videos with the best care possible. From there, we can expect more people to share them with each other.\n\"", "q2r": 5, "assessor": "z_assessor_3023", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 9103, "q0": "The proposal raises the issue that many developers actually want to write smart contracts and build projects on Cardano, which requires the Haskell programming language, but haskell is an uncommon functional programming language. Haskell's programming style is very different from today's popular programming languages. This creates barriers for developers who want to access and build products on Cardano. This project will create a Haskell course with lessons in advanced Haskell knowledge that can help Developers build projects using Haskell. The course content will be based on advanced Haskell books such as: Real World Haskell, Real Haskell, Production Haskell, ... Video content will include lessons, exercises and real projects. Videos will be uploaded to Youtube and exercises will be uploaded to Github. In addition, they will share these videos with developer communities of other blockchain platforms and developers interested in blockchain. As such, this proposal will help increase the number of developers for Cardano, which is consistent with the goal of the challenge.\n \nThe proposal also introduces the risk that programmers who only learn Haskell from Youtube videos and assignments will be very difficult, so they will create Zoom Q&A sessions to answer learners' questions. This solution is reasonable.\n", "q0r": 5, "q1": "The project will be implemented in 6 months, with specific jobs, working hours for each month such as: the first month (working time 38 hours) will be a video lesson about Functors, Applicative, Monads and Monoids, GUI Programming; the second month (37 hours of work) will be a video lesson on Interpreters, Adding functions to Interpreters…Once each video is completed, they will share it with 5 groups of developers interested in blockchain, smart contract programming and dapp building and 5 groups interested in Cardano. Thus, the project's roadmap is clear and specific, so it is easy to succeed.\n\nThe proposal requires a budget of $16,080, unit cost of $60/hour and total working hours of 268 hours/6 months. I find the cost to be reasonable.\n\nThe project implementation staff consists of 4 people, they are Haskell developers, Haskell teachers with many years of Haskell programming experience, founders of Cardano Vietnam community…so they fit the project's requirements.\n", "q1r": 5, "q2": "The proposal will post on Youtube all the lesson videos in public mode for everyone to see and follow. The assignment will be uploaded to Github. Therefore, the community can check the progress and results of the project easily. They also set a goal of helping at least 50 people join the Plutus Pioneer Program after 6 months.", "q2r": 5, "assessor": "z_assessor_3021", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 8671, "q0": "Creating in-depth teaching materials on programming languages ​​on Cardano is always encouraged in this Challenge. So the proposal's idea of ​​creating a course on Haskell for developers from other programming languages ​​fits perfectly with Challenge's key metric. As the proponent explained, Haskell is the fundamental programming language for entering and building smart contracts on Cardano but is also a major barrier for developers looking to get involved and build a product on Cardano. Therefore, this solution will reduce the learning curve of developers, save time in searching for in-depth documents, thereby accelerating the participation and active contribution to the Cardano blockchain by the developers.", "q0r": 5, "q1": "The form of learning and exchange, duration, and content of learning are mentioned in full and in detail in the course development and provided plan. I see the intention of translating the learning materials into Vietnamese in the project development master plan, as someone who has not been exposed to your proposals before, I am looking for a better understanding of why documents will be translated into Vietnamese and not any other language, and what impact this will have on your user metrics goals. Estimates of time worked for each task will help facilitate the audit and determine whether the work effort is appropriate with the corresponding remuneration for each hour worked. Most of the people leading and working on this project are experts in the Haskell programming language, who built a similar proposal in previous Funds and successfully raised funding. Therefore, I believe that their working skills and professional qualifications have been clearly assessed.", "q1r": 5, "q2": "No important information has been left out in this proposal and neither is it in this section. The audit roadmap has been clearly designed, the success metrics are carefully selected and ideally, the milestones are properly established for the implementation of the measurement. Youtube is a place to post lessons and is also an ideal platform for monitoring, providing quality feedback, and evaluating the effectiveness of people interested in this project. In addition, GitHub will also be provided as a tool to update the latest reports on the project.", "q2r": 5, "assessor": "z_assessor_2996", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 8452, "q0": "This proposal intends to accomplish its goal by creating a Haskell tutorial for programmers experienced in other languages. Decentralized app development on Cardano relies heavily on developers, who are also crucial to the success of modern Blockchain platforms. It's possible that  Haskell Course For Developers may enable programmers fluent in other languages learn Haskell in order to more easily construct projects using Cardano. The group has been successful in raising funds via fund8 and in the first month they have completed 60 percent of the Haskell Course for Beginners and translated a book (650 pages). I thus have faith in their ability to design new courses.", "q0r": 5, "q1": "According to the road map, the lessons are to be built in a span of 6 months, with monthly tasks and results being outlined in great detail.\nMembers of the proposal team have the necessary knowledge and expertise in the related fields to successfully carry out the project as outlined in the proposal. When compared to the overall scale of the project at hand, the budget is reasonable and well specified.\nThe only thing that could be done to make things better is to break down the entire cost of creating the videos into its component parts (creating, editing, exercises), so I would understand it better.", "q1r": 4, "q2": "The key performance indicators associated with the work results are presented in an easily understandable way in the proposal. It is simple to examine the timeframes for the work that has been completed and the quantity of video courses that have been uploaded on YouTube.\nIts a plus for pointing out the possible risks, difficulties, and solutions to such problems. This will serve as a sturdy base, which will ultimately make the project feasible.", "q2r": 5, "assessor": "z_assessor_2985", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 6003, "q0": "The content of this proposal presents the idea of ​​​​building a course on Haskell programming for developers. The Haskell language is a basic programming language for Cardano's smart contracts. Programming in Haskell is completely different from other popular languages ​​like Solidity or JavaScript, because Haskell is modular functional programming, not imperative programming. Therefore, it creates a barrier to entry for developers who want to build products on the Haskell language. Therefore, the proposal will help developers gain basic and advanced knowledge of Haskell language, helping them develop many products on the Cardano blockchain. At the same time, through the proposal, the number of developers will increase, increasing human resources for the whole ecosystem.", "q0r": 5, "q1": "The feasibility of the proposal is very high. Aspects to consider when assessing feasibility include:\n- Implementation roadmap: the proposer has specifically divided each milestone for each job to be performed. We have specific hours of video recording, video editing, and hours of content creation. The lesson content is evenly distributed over the months of implementation (we have a total of 6 months here)\n- Work experience: the proposal is a continuation of the \"Haskell Course for Beginner\" proposal that was funded in Fund8. This shows that the proposer has experience implementing these courses. In addition, the other members of the team are all Haskell programmers with more than 5 years of experience. Therefore, I have quite a lot of confidence in their expertise.\n- Budget breakdown: the cost for one hour of video production (including recording + editing + posting) is $60/hour. I consider it quite reasonable with the effort that the whole team put in.\nOverall, I have no objections to the project's performance.", "q1r": 5, "q2": "At 6 months after the end of the course, we have milestones to measure the success of this project including: the number of people participating in the Plutus Pioneer Program, the number of Youtube channel subscribers increased, the number of views of the course's videos. These metrics are easy to track. The proposed team is also responsible for the information of the members, they have provided us with full references to each person's profile page. Make this information as transparent as possible.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 5640, "q0": "This proposal is quite good since the proposer would like to create advanced Haskell courses for people who previously knew the basics of Haskell programming languages. It's an excellent way to improve their knowledge and skills to become superb developers on Cardano whistle all of us strongly agree that we need the actual projects to run smoothly on Cardano. Beyond the video tutorial on youtube, you also have a Q&A session to gather people who are eagle to learn and explore the new challenge with Haskell. It's effective in creating active conversations to exchange knowledge. In short, I think your solution will positively influence the Cardano community once we have good developers.", "q0r": 5, "q1": "Once again, your proposal shows a clear roadmap with step-by-step to hit the KPIs. Additionally, the team behind it has deep insight into Haskell languages with more than 5 years. Mr. Edward Kmett has been working as a Haskell teacher for 11 years; it's impressive. The to-do list that you outlined is clear enough for us to understand. With the previous fund you've done making the video for beginners, I believe this one cannot prevent you from spreading the active energy to the community.", "q1r": 5, "q2": "In terms of Auditability, this solution uses public platforms such as YouTube and Github so that we can easily and quickly access to track the performance. As I see your work after being funded in Fund 8, both projects are ongoing and well in production. Hence, within 6 months, I believe you can deliver all the assets you offer in this proposal. However, in the \"What does success for this project look like?\" question, in my view, I think it's better if you add the action plan you do to hit these KPIs: \"got 500 subscribers\" and \"Each video has more than 100 views, 20 likes\". So if the proposal is funded, you should have a marketing plan to promote your channel to reach more target audiences (developers) so that we ensure the KPIs are completed.", "q2r": 4, "assessor": "z_assessor_2732", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 4349, "q0": "You have a proposal to solve the goal set in the Challenge \"Developer Ecosystem\". In Vietnam, many developers want to write smart contracts and build projects on Cardano, but they face the barrier of Haskell. I know well that many people in the Vietnamese community have had such cases. Everyone knows, that Cardano uses a programming language called Haskell which is considered a difficult programming language, therefore, making a programming course in Haskell for developers from other programming languages ​​will increase the number of developers in the Cardano ecosystem. I have commented that this proposal of the team has a good impact (adding value to the Cardano ecosystem) because when implemented in practice, the course will facilitate the development of Haskell and These developers may come from other blockchain ecosystems, etc..., enriching the quality personnel aspect for Cardano. That is the basis for ideas to be born and create opportunities for many people to contribute to the Cardano ecosystem. In my opinion, this proposal is fully scalable to solve future challenges. For me, this proposal has a great impact on the Cardano Vietnam community, a community that is highly interactive and has a lot of enthusiasts with the Cardano blockchain, Catalyst. I strongly agree with the impact of the proposal. I vote 5 stars.", "q0r": 5, "q1": "The team has favorable experience in implementing the proposal by members being Haskell developers, a Haskell teacher, and a Cardano community administrator. The team wrote proposals related to the Haskell language topic at Fund 8. Not only that, but the team also presented documents related to proposal writing and the Haskell language. Most of the team members have shown links to social networking sites to publicize their identities to the community. This is very good. My advice is that you should add links to Linkedin, and Facebook to build more trust for the community in the team, and at the same time increase the feasibility of the proposal. The budget of the proposal is presented quite simply when calculated according to the hours worked by the implementer. I think this is reasonable because most of the calculation methods in the world today are based on actual working hours. If Catalyst has not funded the proposal, will the team continue to work on the proposal? Does the team currently have any other funding sources? I understand that budget clarification is beneficial to demonstrate the feasibility of the proposal. The plan and implementation method were presented quite specifically by the team. The team seems to have all the resources to implement the proposal (except for the financial resources that are pending funding). In terms of technical and technological aspects, the ability of team members to translate English plays an important role in the success of the proposal, in addition, there are clear marks of Haskell experts and teachers. . I understand the team is trying to bring to the Vietnamese community the highest quality video lessons and games that support the most effective lessons. I am very pleased that the team has raised the risk in the proposal and the solution to overcome it if the risk occurs (Q&A about the lesson via Zoom). I believe the proposal will help many developers switch to the Cardano ecosystem to work Cardano is one of the best blockchains available today. From there, they contribute their programmability to smart contracts on the Cardano platform and create useful applications on the Cardano ecosystem. In short, the team can add more social network links to make their identity more public (increasing transparency in front of the community) according to my reference advice. I always want to contribute ideas to the team for further reference. I agree with the feasibility of this proposal. I vote 5 stars.", "q1r": 5, "q2": "The roadmap and milestones outlined by the team are very clear with the work spread over 6 months. I would like to comment: The team can attach milestones and roadmaps to specific months of the year (January, February, etc…this is just an example), it will be very convenient for the audit community and assess the transparency and auditability of the proposal. The problem is clearly described in the proposal, with the solution included of course. I was very impressed with the way the team presented the proposal, it showed the professionalism and focus the team put on this proposal. In the proposal, I do not see the key metrics (KPI) and key metrics. Surely the team knows that these are two important indicators to evaluate the auditability and transparency of the proposal? I advise the team to add quickly and accurately so that the community can see it more clearly. In return, the team has very specific definitions of what success looks like through actual estimates, which are considered the result of Haskell videos implemented. The team did a great job with this. I find this to be a realistic proposal that meets the community's needs and expectations for its success. When it is successfully implemented, I believe the Cardano ecosystem will have more good developers. I vote 4 stars.", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 11, "ne": 4, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 3441, "q0": "Idea starts off with a valid problem statement, highlighting the problems regular programmers when learning/programming in Haskell and the possible barrier it imposes for more smart contracts and Dapps to be developed. To solve that, it proposes an advanced Haskell course, to complement the Haskell for begginners that was funded in last fund. Overall, proposal is solid as it shows well the course value proposition, presents how the course will be structured (videos, exercices and practical projects) and is aligned with challenge as it can potentially increase challenge kpi of \"Number of developers actively building on top of Cardano\".\nAs suggestions of improvements, it could be better explored here how the follow up with students will happen in the project practical part. For instance, pointing out if it's going to be a one-to -one support session, if it will be in telegram groups, etc. The Q&A zoom sessions for the exercise part is a good idea but it's nice also to incentivize debate amongst them so having a dedicated channel to it can help also. Other thing to consider here is explaining how this Haskell course will differentiate and be better than others that already exist. Even though it's a hard programming language to learn, there are some courses already available. this should be taken into account when advertising the course.", "q0r": 5, "q1": "There's a plan based on the course syllabus (this is imporant), that considers the number of hours to create, record and edit the videos plus the exercicises, for each lesson. This is fairly done but other activities could be considered in timeline such as the time for sharing and advertising about the course, collecting feedback, aswering questions (or is it embeded in the 10h for exercise already?). Budget breakdown is done, based basically on the total number of hours stated in the timeline, which works well.\nAs for the team, it has 4 people committed with good Haskell, teaching and community management experience which is enough to execute this course. the descriptions  for each person are good and links for references are also provided.", "q1r": 5, "q2": "The videos of the course will be uploaded and the exercises will be avalable in github, so all of the content generated will be auditable by anyone. One kpi is provided by user (50 attendees after 6 months), which is good, but it could have other kpis such as a way to measure course quality/effectiveness based on feedback from users (it could be via a survey, creating a NPS, for example) or number of engagement (number of likes and comments). The practical projects the students will develop could also be made avilable, in a didatic format, so new students can learn with it as well.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 16, "ne": 1, "ng": 15, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 2783, "q0": "\" this is a continuation of a project that has been funded since the 8th funding round, the main goal is to create content video tutorials for knowledge related to the Haskell programming language, so This proposed group has a foundation to fully implement the requirements of the proposed challenge.\n  The content of the project funded from the previous round is to provide the basics for new developers who want to program on the Haskell language of the Cardano ecosystem, and it follows that this proposal will begin to provide provide documentation for in-depth knowledge to meet the requirements, knowledge for development on our ecosystem in Haskell language. The course content that the proposal provides includes: \"\" Real-world Haskell, Real-world Haskell, Production Haskell, ... through video learning and examples of putting real-world projects into exercises,\n   *generally these are simple solutions and quite common but give great results. since there are part-time developers they can learn and acquire knowledge anytime and anywhere, the solution of this proposal and the presentation of this summary is very convincing logical arguments and As an example, I completely agree with the impact of this proposal.\n   This is a proposal to develop learning materials, so the most important risk is that the students' acquisition and perception problems are not effective. We applaud the proposed team for having a plan to overcome it. To overcome these problems is to create a zoom to serve questions and answers and explain to students the issues that have not been absorbed in the content of the lesson plan. \"", "q0r": 5, "q1": "\"great for the details of the roadmap proposed by the team it is perfect from the presentation and the internal goals are all suitable for execution, also provides path data of previous and subsequent recommendations, and provide evidence for the success of that proposal, the proposed way to reach the target audience is to transfer the documentary videos to 5 organizations or groups that are interested in them, in this way find it very clever to scale up this proposed learning material.\n  I agree and disagree with the detailed budget of the proposal, as for the team I have also seen the details of the proposal as well as the relevant experience for document development, along with that. All positions have been specifically assigned, suitable for each member. \"", "q1r": 5, "q2": "\"The work of this proposal will mainly be demonstrated on videos and the proposal has committed to posting them on popular social networking platforms such as Youtube or Github, so that the community can easily follow Monitor the progress of the proposed team's video updates to determine if the team's work is still active.\n   the success of this proposal is the uptake and acceptance that comes from the developer community further seeing that new developers can program in the Haskell language, from the knowledge this proposal provides . \"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 1199, "q0": "Haskell, blockchain have not received formal training with degrees at universities in Vietnam. This is the reason why we have a shortage of high-quality human resources, and it is also a barrier that makes many projects writing applications on the cardano blockchain. This proposal wants to create online courses on youtube for intensive training in Haskell. This is a highly practical idea, easy to implement and brings long-term effects to the community. Because these videos are public, and saved on youtube that anyone can watch. I also support this project as it is a continuation of the previous project on the course and translation of basic Haskell documents from English to Vietnamese. They have shared that they have done 60% of the work of the previously funded proposal.", "q0r": 5, "q1": "In the plan they gave, they completed the videos and uploaded them to youtube within 6 months. The course content takes in-depth Haskell book references and turns it into better visual courses with attached exercises. This is a plus for this project.\nIn terms of funding, the total number of working hours is 268 hours and the total application amount is 16080 USD, mainly for the creation of intensive Haskell course content. This content is quite clear and easy to understand for me.\nRegarding personnel, they currently have 4 people, each person's profile is through github, but I have not seen the personal photos of all members. This is a point I am not really satisfied with. After all, this piece of content also deserves my 4 stars.", "q1r": 4, "q2": "For this project, KPIs have work progress according to the number of Haskell training videos that can be easily tracked on youtube, they have also carefully calculated the number of working hours their team needs to perform. Therefore, this project can completely verify the work progress quite easily according to the weekly/monthly/quarterly schedule.\nThe reach of code developers and students can also be easily seen through the number of video views on youtube.\nIn addition, project content is publicly available and follows the learning curve as they refer to in-depth Haskell books. So the quality of the project can also be guaranteed after the videos are published on youtube. That's why I'm giving it the maximum score in this section. Hopefully then they can better communicate these useful videos and help more project developers in Vietnam.", "q2r": 5, "assessor": "z_assessor_2217", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 14781, "q0": "Haskell is really an uncommon programming language nowadays among developers. I have asked many developers in many communities about Haskell. Most of them don't know about Haskell. Java, C++, C# are comparative languages. But Haskell is a functional language. Haskell is the foundation language of Plutus. Plutus is the language used to build smart contracts for Cardano\nTherefore, to grow the number of developers for Cardano, Haskell courses are essential.\nProposal's team create Zoom Q&A sessions to answer learners' questions is a great way to solve the problems developers have when learning online courses on youtube.\nThis is the next proposal of a Haskell course for beginners in fund 8. This can make for a very complete Haskell learning path for everyone not just developers.\nI love the idea of ​​creating a Haskell course from beginner to advanced like this", "q0r": 5, "q1": "The detailed plan of the proposal is very specific about the number of videos that the proposal's team will make (15 videos). The content of the videos is also very reasonable. Developers need to take 10 video lessons, after which they will practice with specific projects.\nProposal's videos also feature exercises and their solutions are a great way for developers to both learn the lesson but also get a chance to practice with it.\nThe length of the video is also specified. The tasks that perform the video are also listed specifically with the time to complete each task.\nProposal's team has 3 proposals in fund 9, but the total time to complete 3 proposals in 1 month only accounts for no more than 100 hours/month (no more than 4 hours/day for one person working). Proposal's stamp has 3 people making this proposal, so this proposal is completely feasible.\nBudget breakdown is also very specific with specific costs calculated by working hours as stated on the detailed plan", "q1r": 5, "q2": "The lesson videos of the proposal are all posted on youtube in public mode, so everyone can check the team's proposal implementation process.\nHaskell Course For Developers exercises are also uploaded to Github. So everyone can completely check and measure the proposal implementation process.\nThe goal that the proposal wants to achieve is also stated in a very specific way about the number of people who will participate in the Plutus Pioneer Program, the number of views, likes, comments, and subscribers.\nTherefore, this proposal is completely auditable", "q2r": 5, "assessor": "z_assessor_4100", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 14796, "q0": "- Cardano Smart Contracts and dapps are all written in Plutus (we can build projects on Cardano with solidity or other programming languages ​​thanks to EVM. But these programming languages ​​don't work as good as Plutus.)\n- Plutus is built on top of Haskell, so programming in Plutus is not much different from Haskell (they are almost 95% similar). In addition, there is not much document or course about Plutus because Plutus is still in the development stage. Therefore, Haskell developer courses like these are essential for developers who want to build projects on Cardano.\n- In the fund 8 proposal's team has been funded for 1 proposal about Haskell Course for Beginner. This Proposal is the next advanced course of a beginner's course. This is a great thing because people who want to learn Haskell will learn Haskell systematically from easy to difficult. Learners can choose courses based on level.\n- This course focuses on advanced knowledge and application of Haskell to real-life projects, so it can completely help developers develop the ability to execute their projects using Haskell.\n- Proposal's team is also the admin of a few communities interested in Cardano. With this resource the team can market this Haskell course to a large number of people and make a huge impact on the number of Haskell developers.\n- I also really like how the proposal's team responds to learners' problems and questions through Zoom Q&A sessions. This is a great way to engage with learners and turn this course into an interactive course rather than just youtube videos.\n- In the next funds, the proposal's team should build Plutus related Haskell courses and how to build Smart contracts on Cardano using Haskell will be able to help developers gain first-hand knowledge of building projects on Cardano", "q0r": 5, "q1": "- The detailed plan of the proposal is very specific about the timeline for making videos and exercises in Haskell Course.\n- The lesson videos of the proposal have also given the duration of the videos. The time to perform each task of the videos and exercises is also listed in great detail.\n- The content of the course is based on advanced Haskell books such as: Real World Haskell, Practical Haskell, Production Haskell, etc., which can completely guarantee the accuracy of the knowledge in the course.\n- The total time to implement this proposal by month is also shown in detail in the detailed plan.\n- The lesson content is arranged with 10 lessons followed by 5 actual project construction lessons, which are very suitable for developers to learn and then apply that knowledge to projects.\n- The team is also the admin of 2 facebook groups with more than 50,000 members and 1 telegram group with more than 1,000 members, so the team's marketing plan is workable.\n- Proposal's team has 2 funded proposals in fund 8 and 2 other proposals submitted in fund 9. The team has come up with how the team will implement all these proposals and this is possible.\n- All team members have relevant experience for the task in this proposal.", "q1r": 5, "q2": "- The process of implementing this proposal can be completely measured by video lessons uploaded to youtube and exercises uploaded to Github.\n- After the lesson videos are uploaded to youtube, we can completely measure the marketing process and effectiveness of these videos through metrics such as: viewers, likes, comments and subscribers to understand the impact these videos have on viewers.\n- The team has also shown the very specific goals of this proposal such as:\n\"6 months after we finished the video lessons\nWe will help at least 50 people join the Plutus Pioneer Program\nOur Youtube channel got 500 subscribers\nEach video has more than 100 views, 20 likes and comments\"\n- All of these goals are completely measurable.", "q2r": 5, "assessor": "z_assessor_4101", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}], "solution": "We created a Haskell course for developers from other programming languages. Haskell is the base programming language of Cardano's Smart Contracts. We can grow the number of developers for Cardano", "experience": "\n2 Haskell Developers with 5 years of Haskell programming experience\n1 Haskell Teacher with 11 years of Haskell programming experience\nAn admin of Cardano Community (40,000 followers)\n2 funded proposals about Haskell in fund 8\n"}