{"id": 414825, "author": "megan.dit", "title": "Katiopa women: The pioneers of DeFi", "url": "https://cardano.ideascale.com/a/dtd/414825-48088", "category": 26597, "amount": 21000, "description": "Women are the designers & implementers of local community-run DeFi solutions in the African context. There is a need to provide them with tools to translate all that knowledge onto the Blockchain.", "f6_no_assessments": 6, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"id": 947, "q0": "The self-set goal of this proposal is that of creating a “developer ecosystem geared toward women”. Specifically African women in Cameroon. Starting at the grass-root level and demonstrating the strengths of blockchain one use case and one person at a time is probably the best way for us as Cardano and for DLT in general to gain adoption. This proposal is very promising in that direction and as such has the potential to be very impactful.\n\nThe proposal is looking to attract more women into the Haskell, and specifically Plutus developer base, incentives participation through challenges with prizes and organise hackathons. Thus it clearly fits within the scope of the Developer Ecosystem challenge.\n\nI appreciate very much the extra background provided by this proposal about the “tontine groups” and the networks women create in Africa to enable a financial system outside of the official banks. The resemblance to blockchain-enabled DeFi is indeed very evident, but I do wish the proposal would have explained this analogy more to a blockchain-focused audience instead of simply proceeding to call it DeFi without first explaining it. This of course not a fault of the proposal or project, it’s just a recommendation that I think would help more people connect better with the project and better understand the context.\n\nMy review of this Developer Ecosystem proposal rests on my background as a project manager collaborating directly with Cardano developers since July 2021. I have participated in almost all roles in Catalyst since February 2021 and my involvement with the Cardano development communities started more than a year ago.", "q0r": 5, "q1": "The implementation plan is broken down into 3 main steps to be achieved over the course of one year and seems a solid way to achieve the project's stated goals of promoting DLT and Cardano specifically and attracting women to Haskell & Plutus.\n\nThe budget breakdown is appropriate and seems to account for everything that the project would need to be successfully implemented. Mirroring the project plan, it also covers 12 months of operations. Some of the amounts mentioned in the budget are low compared to Western standards, but given the project will be implemented in Cameroon, I assume they're reasonable estimates.\n\nThe team is clearly described and easy to verify given the provided links. DITC Cameroon and WADA have been long collaborators of Catalyst and Cardano who have successfully delivered on numerous projects in the past, and I have no reason to assume that this project is going to be any different.\n\nThis is one of those rare proposals that cover the feasibility section almost perfectly so there’s little for me to add except to enumerate everything they’ve done well and agree with each element in particular. \n\n“Yes” is selected as the answer to both multi-project workload questions, but no additional details are provided in the detailed plan part of the Feasibility section as specified in the detailed description of the questions on the proposal submission form. I will not be changing my rating because of this as the questions are new to Fund 9, so the questions and the proposers might have not clearly understood that a detailed presentation of all the proposals they are currently working on is requested as well as a plan for how they will manage the workload required by each of them. But I recommend that the team includes a detailed answer in future submissions.\n\nFor those interested in getting a full overview of the proposers that the submitter of this proposal Megan Hess and WADA in general are working on and have submitted in Fund9 visit the community-created tool on Lido Nation: \n\nMegan Hess: https://www.lidonation.com/en/project-catalyst/users/264 \nWADA: https://www.lidonation.com/en/project-catalyst/group/wada ", "q1r": 5, "q2": "I have found that the auditability section is very much in sync with the rest of the proposal and tracks well the details that would need to be evaluated to determine the progress of the project towards its stated goal of attracting women to Cardano and DLT and promoting the ways in which these could directly improve the lives of their communities.\n\nThe metrics described in the proposal are clear, presented in a logical way and would be easy to monitor. I especially appreciate that each metric is followed by a self-set goal, as this demonstrates foresight and motivation.\n\nThe definitions of success are on point and again they are a very good reflection of the mission of empowering local women through knowledge of the possibilities that blockchain and specifically Cardano can enable.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3527, "q0": "The proposal wants to enroll more women in africa and teach them haskell and plutus so they can drive progress forward. I love the idea about the web of trust formed in small communities that you need an elders endoursment to get in. The concrete plan is to equip and train 120+ leader women with the right tools so they can teach DeFi practices into real design and implementation solutions. I think this is an amazing proposal that would bring more developers in the future. Providing more developers is what the challenge is all about so I think it's perfectly aligned with the challenge settings and would definitely impact the cardano development community.\nThe proposal clearly states how it's going to provide future value to the community. There is an idea for mini hackathons that would incres the adoption of cardano and the way of learning plutus and haskel. As a developer I can concur that practical examples and work is always a great resource for learning. With a little push in the right direction from a mentor or just group effort I believe there can be great many developers in the near future working for the cardano good.\nI am familiar with WADA and their efforts since fund 4 if I remember corectly and I can verify their solutions and effors have greatly improved peoples lives. They have a lot of great proposals like this one and are continuously doing local hubs and forming small communities with teaching purposes. I really like this proposal I think it's impact will be imminent.\n", "q0r": 5, "q1": "The proposals won me over with the youtube channel and their previous work for the past 4-5 funds. They have more than enough credibility in my book. There are several simple and distinct steps described in the proposal starting with promoting awareness through marketing in Cameroon with a bi-yearly PROMOTE event. This will be followed by technical learning on different topics regarding Blockchain and haskell and plutus specific lessons and finally enrolling the woken in the plutus training program then integrate content into the Wada Academy so it's more accessible for future students. This seems like a simple, yet effective plan of action.\nThere's a good budget breakdown, spanning from a cardano stand PROMOTE conferance to project oversight and coordination. I like the overall breakdown although as a developer I don't have any specific knowledge about how to organize events.\nI manged to verify the skills and requirements listed in the proposal and matched them with what I found online alongside the provided linkedin links so that brings the feasibility of the whole project higher for me as a side viewer and voter.\nI would encourage the proposers to come back in future funds and continue with the \"one time pushes\" if this one is successful. Overall a feasible proposal. Good luck to the proposers and I can encourage voters to give a thumbs up.\n", "q1r": 5, "q2": "There are reasonable end goals and I believe they are reachable. The metrics are good as well and 120+ women to be trained seems like an ambicious goal, but totally reachable. I like the success definition of the proposal which would make teachers from previous students, which is the way to evolve and make the system self sustainable with enough iterations ofcourse. \nThe proposers have stated a clear and relevant problem and have provided an understandable, reasonable amd detailed solution to it making plans on creating more haskell and plutus devs. \nOverall I think this proposal is auditable and there are plenty of ways to track the progress of this any all other already funded proposals from WADA.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 4850, "q0": "I think this is a good and practical proposal. Their idea is to recruit and train 120+ leader women in Africa for Haskell and Plutus training program, introduce them to the Cardano Ecosystem and spread the word to other women in their communities. A good point is that the proposer has deep understanding of Africa women context, some proof of work on Github, and training course video link which shows that the proposer have done some market research and execute this proposal to some extent before raising fund. In my opinion, this proposal is suitable for the challenge because it would create a developer ecosystem geared toward women who will serve as catalyst to spread words, educate about Cardano blockchain and bring real impact to Africans and women. In addition, I agree with the proposer's strategy: Marketing, Training, Spreading. For Marketing, they will recruit women into program via workshops, bi-yearly Devs and Enterprises Conference called PROMOTE, extends to schools, university and technical institutions,..in which they have already executed advertising campaign on local TV and radio stations as well as displaying at strategic locations billboards and posters. For Training, they will funnel pre-selected women into ongoing Plutus education initiative and provide them with the necessary support to first learn Haskell, Software Architecture, Distributed Ledger Technologies, Plutus for smart contracts development. In reality, they already onboarded one brave women from ISTDI within program which shows real demand from the market. For Spreading, they will extend Plutus Program for women to other countries. In general, I think this is reasonable approach to attract interested women for education field and suitable for the challenge. Finally, the proposer doesn't forget to mention about some real challenges such as lack of interest due to time or financial constraint which could be solved by offering training for free and also motivating participants through hackathon prizes to mitigate this risk. My suggestion, the team could tell participants about Catalyst like PAs opportunities so that they could earn some money while persuing training course. After all, I think this is promising project, especially with good will for educating women about technology and bring some positive changes to women in Africa, and Cardano blockchain. However, their impact has geographical limitation within Africa, so I could not give them full mark for this part. ", "q0r": 4, "q1": "This part of the project is not good. For the plan, I think it is not detailed and clear. The roadmap is broken down into 3 steps. For step 1, the proposer said they will focus in on increase program awareness via marketing by organizing bi-yearly PROMOTE event; but does not provide enough information: When will they start this? How long does it takes for this event? Who will involve in carrying out? What is their targeted customers or goals?. And, they already partnered with 2 local technical institutes without mention exactly what are these 2 institutes? For step 2 also, they plan to contact and visit one school, or one university per month to bring awareness about their Haskell and Plutus education program. Personally, it is quite modest goal. I do not understand about Africa context, but in my country, it is not easy to persuade the head of schools or universities to let you organize seminars without reputation. My question is, you guys are start-ups, so how could your team make school or university let organize workshops; who will be in charge of this step? What is exactly their goal in the number of onboarding new women? What is the timeline? For step 3, they will funnel women into program, my concern is: How is this training be organized? offline or online? in groups/class, or Will they organize training whenever they have new member?. My recommendation is that the team should have a general criteria, general steps of onboarding new members so that the newbies will know exactly what is expected from them? (might be in documentation/ Youtube training courses). In general, I think this plan is quite superficial. For project expenses, the cost is requested to mostly cover for 3 trainers motivation cost for 12 months and marketing the program. But I am not sure about how long will their marketing last? The required budget is quite small in which I wonder whether this program could create great impact on your local area? Finally, about the team, as I know, there are 3 people and 5 interns, but I only know their name, tasks without knowing detail about their expertise, education background, experience,..which I am not convinced about the feasibility of this project. ", "q1r": 3, "q2": "\nThe auditability of this project is average. The proposer gives some key following metrics: the number of partnerships with schools and institutes, the number of chosen women at events, the number of women enrolling tin 12-month course, the number of dApps these women implemented,..I think these indicators are okay for managing the project developement. I think, this part could be more detailed and persuasive. There should be more effective ways of tracking this project for community. My recommendation is that the proposer should put some efforts on digital marketing such as some social media channels Twitter, Linkedin, Facebook, Telegram,..to increase community access and engagement in your program; or providing online courses via zoom, Youtube,..From building strong community channels, it is easier and more effective for them to follow and register to your program without expenses. Moreover, social media platform or mini games/challenges could be a way of checking the program progress and increase community engagement. After all, this part is ok but still lacking to some extent.", "q2r": 4, "assessor": "z_assessor_2622", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9922, "q0": "The proposal is about organizing education and hackathons, primarily to women, in areas where the need as well as immediate applicability are the highest. Distributed ledger and especially DeFi solutions to serve already existing local community dynamics. Thus, these tools would be in the hands of developers who have first-hand understanding about the details of end-users' needs. \n\nIn addition to free education, the proposal attempts to alleviate the problem of resource constraints and de-risk the participation by providing financial and non-financial support to attendees. Now we get these tools also to those people who would otherwise have least access to them. Not leaving talents from this group of people out is a great advantage to Cardano ecosystem. \n", "q0r": 5, "q1": "The educational work is already ongoing and there is content available on YouTube. The proposal provides a logical roadmap to find and onboard people in the training program. The budget breakdown is very detailed and the amounts used make sense.  \n\nWada is a well known player in Cardano space and they have another proposal in Fund 9 for the educational platform. Information on the personnel, participating in this project, is available and the roles are defined clearly. \n", "q1r": 5, "q2": "Measurable KPIs go all the way from the beginning of the process to long term success metrics well after the completion of this specific work. Each metric has also the preset goals to be pursued. Github pages for the training courses are freely available and video content is posted on YouTube. It would be great to see one source which would put together all the essential information, links and regular updates regarding the project. \n", "q2r": 5, "assessor": "z_assessor_3138", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 11443, "q0": "The proposer wants to enroll more women in Africa for Haskell and Plutus training program. I think this proposal is suitable for the challenge as this proposal aims to train Africa women to be future leaders and become developers. As a result, this project will bring positive impact on women and Cardano ecosystem. After reading their solution carefully, I think, their approach is quite right as it focus on 3 activities: Marketing, Training and Spreading, but it would be better if the proposer could build online marketing strategy too, together with offline marketing event in which I think it could increase the number of registered women to program and community engagement. After all, I think this proposal is ok. I could not give them full mark on this part because the impact of project might be limited within local African area and there are not so much unique points in their solutions.  ", "q0r": 4, "q1": "I am not convinced about the success of this part. The proposer only provide some steps for the plan but not detailed plan in delivering this project. The project lacks detailed information about the timeline, Who will in charge of which tasks? After all, I think their plan is quite simple. As their plan is not clear, so the budget required is a little confused me as I do not know which tasks belong to which steps in plan? A good point is that the expense is quite reasonable for each task. In addition, about the team, I know their name, what job will they do, and Linkedin link. However, I suggest the proposer to give introduction summary of each member for community. In conclusion, only basic information is provide, in which I wonder about the implementing ability of the proposer. ", "q1r": 3, "q2": "The proposer will use some metrics to manage the project: the number of schools and institues, the number of women pre-selected at events, the number of women study the course, the number of Dapps they could develop in the future,..in which, I think, these indicatiors is okay for community to follow and engage in the project. The proposer should suggest other methods by which community could easily go to your course, and interact with your team. My recommendations is creating your own channels: website, Youtube, social media, Discord, Github,...for more effective communication between interested women and the team. In short, it is possible to follow the project development.  ", "q2r": 4, "assessor": "z_assessor_3246", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "Feasibility: The assesor clairly misses the fact that we mentioned that the proposal was more of a marketing effort and an extention of a previously funded proposal that we do reference. If he had read i it would hve giving him the information he is seeking. "}, {"id": 14754, "q0": "The team recognizes that in the local African context, a large number of people designing & implementing Defi solutions are women. They are the owners of local contextual Defi algorithms and solutions. They create a highly reputable community. This social organization serves as the basis for a reputation system. For those reasons, the team considers it essential to get these women enrolled in the Plutus training program to give them access to Haskell and to give them exposure to the Cardano Ecosystem. Personally, I think this is a good idea and should be supported.\nThe functions and features of the project are outlined in great detail by the proposal. The team has come up with a plan to expand the project. The team also gives the community an overview of the strategy including Marketing, Training, and Spreading activities. Activities are clearly explained. The team also explained more about the technical side of the project. The potential audience of the project is also determined from the beginning. Those are female programmers in Africa. The proposal also shows the impact of the project on these subjects.\nThe outcome of the project is to attract female developers from different communities to the Cardano ecosystem. The goals of the project are not outside the key metrics that Challenge sets. The team also determined what to do for the project to be successful in the market. Based on the content presented in the proposal, the community can see the impact that the project creates. The project promises to create a partnership between the Cardano ecosystem and other blockchain communities.\nThe team identified a difficulty the project might face during implementation as a lack of interest due to time and/or financial constraints. The team has also come up with a remedy for this situation and created confidence that the project will work well.", "q0r": 5, "q1": "The project has been launched since May and attracted a certain number of members. To expand the scale of the project, the team came up with a specific plan. The project implementation plan consists of 3 steps and is divided by milestones. Each milestone outlines the tasks that need to be done. The plan that the team gives is evaluated as reasonable from the tasks to be completed at each step to the required criteria to be achieved for each work item. The proposal detailed the technical and technological aspects required to implement the plan. However, for further appreciation, the proposal should provide a realistic timeline for doing the work properly. In addition, the proposers should also clearly define the positions and the number of people needed to implement the proposed project. These details will help the project appreciate in terms of its potential to achieve its stated goals.\nThe budget that the team offers is quite reasonable compared to the plan set out in the proposal. Budgets are broken down and presented in an easy-to-grasp bulleted format. The investment items are also stated very specifically, including activities and assets to be spent during the project implementation.\nProfiles of the founding teams are provided in the proposal. Based on their profile, we can see that they are people with many years of experience in the field. Their knowledge and skills greatly help in running the project. This project is also believed to be successful and develop in the future under the leadership of the founding team.", "q1r": 5, "q2": "Detailed information on milestones in the roadmap and the time to achieve the goal has been confirmed again in the proposal together with the specific results that the project is aiming for. The team has provided specific numbers to evaluate the success of the project. The evaluation criteria include the number of schools or technical institutes that the project will agree to cooperate with each month, the number of female programmers attracted to the Cardano community, the number of course registrations, and the number of dApps created in the community. These criteria are all accompanied by specific quantitative indicators that the community can rely on to evaluate the project implementation progress and the level of success when the project is completed.\nThe image of the project when successful was clearly seen through the parts of the completed project. From there, the community has a comprehensive view of the success of the project as well as the benefits that the project brings to the community.", "q2r": 5, "assessor": "z_assessor_4099", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}], "solution": "Launch a multidimensional marketing campaign to enroll more WOMEN for our Plutus training program, teaching them Haskell and Plutus and introduce them to the Cardano Ecosystem.", "experience": "\nCameroonian female family members deeply ingrained in local context DeFi solutions already taking place (w/o blockchain)\nCameroon Wada Team: skilled Haskell + Plutus developers & Distributed Ledger Technologies trainers currently running our Plutus Program Initiative\n"}