{"id": 414899, "author": "quangtran", "title": "Vietnamese Haskell Course", "url": "https://cardano.ideascale.com/a/dtd/414899-48088", "category": 26597, "amount": 11580, "description": "Haskell is the base programing language of Cardano's Smart Contracts. A lot of developers are very interested in building projects on Cardano but there are not any Haskell courses in Vietnamese", "f6_no_assessments": 12, "f6_rating": 4.861111111111112, "videos": [], "media": [], "f6_assessments": [{"id": 4350, "q0": "The proposal to solve the goal set in the Challenge is \"Developer Ecosystem\". The problem raised is that currently in Vietnam, many developers are interested in building projects on Cardano but do not have any Haskell courses in Vietnamese. This issue is currently a hot topic in the Vietnamese Cardano community. Everyone knows, that Cardano uses the Programming language, Haskell. This is a programming language that is considered difficult by the community, therefore, creating a programming course in Haskell in Vietnamese is essential because the Vietnamese Cardano community can thus access and learn this kind of programming language. The proposal has indirectly added value to the Cardano ecosystem because when implemented in practice it makes more people aware of Cardano, easier to access the programming language used in Cardano. From there will arise ideas and create opportunities for many people to contribute to the Cardano ecosystem. This proposal is fully scalable to address future challenges. I am very excited because this proposal has had a great impact on the Cardano Vietnam community, a community with many members who are eager to learn and have a passion for Cardano. I strongly agree with the strong impact of the proposal. I vote 5 stars.", "q0r": 5, "q1": "The team has a favorable experience in proposal writing as two members are Haskell developers with 5 years of Haskell programming experience, a Haskell teacher with 11 years of Haskell programming experience, and a community administrator Cardano. What's even more amazing is that the team presented documents related to writing proposals and related to the Haskell language. Most of the team members have a public link on social networks (if you add more about Linkedin, Facebook is great). This makes the community more confidence in the team and increases the feasibility of the proposal. The budget of the proposal is mainly allocated to making videos and doing Haskell exercises. This is reasonable given that the required level in chemistry is basic Haskell - for beginners. The team has outlined the plan and how to implement it in detail. However, I have a question regarding the budget, if it is not funded by Catalyst in Fund 9, does the team intend to continue with this proposal? Or is there another source of funding besides waiting for funds from Catalyst? The reason I ask this is that I want to confirm the feasibility of the proposal, which is also the question of many PAs and many people in the Cardano Vietnam community. In terms of technology, it bears the imprint of Haskell experts and the English translation ability of team members - how to bring to the Vietnamese community meaningful videos. most accurate and easiest to understand. I am very pleased with the risk that the team has raised in the proposal because Haskell is one of the most difficult programming languages ​​today, but with such a solution (making Zoom discussions) plus with the unanimity of the Cardano Vietnamese community. I believe, Haskell will become less difficult and more and more Vietnamese people are proficient in Haskell programming language and can program useful applications in the Cardano ecosystem. In short, the team can add social networking links to further reveal the identity (increasing transparency in front of the community) and make it more clear to the community about the human resources needed to implement the proposal. I always like to give positive feedback to the team and I agree with the feasibility of this proposal. I vote 5 stars.", "q1r": 5, "q2": "To be clear about transparency and auditability, first, we need to look at the roadmap and milestones the team has outlined to get the job done. The roadmap is very clear with the work spread over 6 months, if the team can tie the milestones and roadmaps to specific months of the year, it will be great for the community to easily audit. and evaluate the transparency of the proposal. The team has a very specific definition of what success looks like in terms of numbers that are considered after-effects of the Haskell course implemented. I very much agree with this opinion. However, it's a pity that I can't see the KPIs and key metrics. These are two quite important indicators to evaluate the auditability and transparency of the proposal. I hope the team will make specific additions so that the community can see it more clearly. Throughout the proposal, the problem is clearly and concisely described with the solution. I was very impressed with the way the team presented the proposal, it showed the professionalism and focus the team put on this proposal. This is a highly practical proposal, meeting the needs of the community in practice. I am extremely hopeful about the success of the proposal. Because when it is implemented, it will be a big turning point for members who want to learn the Haskell programming language in Vietnam. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 9, "ne": 5, "ng": 3, "nfo": 1, "vca_o": 2, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 2784, "q0": "\"This proposal is developed to educate the developers of our ecosystem to have knowledge of the Haskell programming language, and the target group is the developer community in Vietnam. so this is all aimed at the knowledge experience equips the new developer and it is also suitable for this challenge and will also be suitable for the east asia development challenge, developing Cardano.\n   With the number of developers participating in the Cardano blockchain, in Vietnam is growing rapidly, but there are many barriers in terms of Haskell knowledge, which is still limited, and not proficient in the common language English is not fluent , realizing that these are major barriers that directly affect the development of the Cardano platform in Vietnam,\n  by taking the knowledge source from the book Learn You a Haskell for Great Good and then compiling them into Vietnamese videos to provide to the community as well as other Blockchain platforms in Vietnam. The video content will contain standing steps to programming the Haskell language from the most basic step,\n   * Thus, this solution will promote developers to have the knowledge to apply and develop their own ideas into the ecosystem and also remove the barriers of this target group to the system. Our ecosystem, in addition to the proposal to make this knowledge video material available to other platforms, will further attract an increase in developers participating in the Cardano ecosystem, from other Blockchain platforms.\n   * However, this is a local development factor, so the impact for the expansion scale will be limited, not fully promoting the requirements of this challenge.\n   Since this is an educational development idea, the biggest risk is still the acquisition of knowledge and feedback from the developer community so the proposed team has committed to providing zoom for Q&A and explain what the community asks\"", "q0r": 4, "q1": "\"The proposed roadmap is planned and presented very specifically and in detail suitable for the implementation time. In addition, the proposal also commits to support a large number of developers participating in the Advanced Program. pioneer of Plutus, and support at least 10 proposals to join the Catalyst ecosystem through this course.\n   very reasonable and detailed for the budget table that the proposal has presented as well as the perfect team section, for the experience and layout of job assignment for each member in charge to carry out the work. shows, and easy links to verify the community's identity and interactions with them for any questions or suggestions. \"", "q1r": 5, "q2": "\"committed to making all videos for educational content on public Youtube channel for anyone to access, as this is a recommendation to only develop knowledge in videos so following the roadmap the work will be very easy for the community just go to their Youtube channel and check by the quantity and quality of videos in it.\n   Developers and participants in the Plutus Pioneer Program course, will gain a basic knowledge of Haskell, creating a knowledge base for them to thrive in the Cardano ecosystem, which is the success of the theme. this output. \"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 6005, "q0": "The content of this proposal is to build a course on the Haskell programming language. Haskell is the underlying programming language for Cardano's smart contracts. However, because of the nature of programming on Haskell language, it is in a form, module with a completely different type of inference compared to other popular languages ​​such as Solidity or JavaScript. So it creates an obstacle for programmers who want to start learning Haskell. So this proposal will solve this problem by publishing Haskell video tutorials. The content in the video will be based on the book \"Learn You a Haskell for Great Good!\" This proposal I think will make a huge impact on the Cardano ecosystem in general and on the developer community in Vietnam in particular. Helps to remove barriers to using the Haskell language, making the use of Haskell more common. Increase the number of developers actively building on Cardanno.\nSo I completely agree with the suitability of the challenge presented.", "q0r": 5, "q1": "In terms of project feasibility, I fully agree with the possibility of this proposal being implemented successfully.\n- This proposal is a continuation of the successful proposals funded by Fund8 recently: \"Haskell Course For Beginner\" and \"Haskell Book Vietnamese Translation\" The quality of feedback from the community through these two proposals is very good. Thereby, it shows that the proposer has both ability and experience when continuing the idea of ​​this Haskell course in Fund9.\n- Budget breakdown: the proposer has provided a full range of related costs including: cost of making videos + cost of doing exercises, they are about 60$/hour. I think that's reasonable considering the effort involved in video recording and editing.\n- Implementation roadmap: the proposer provides a very specific timeline. The proposal will be implemented within 6 months, each month is a different lesson content about Haskell.\nOverall, I don't have any problems considering the feasibility of this proposal.", "q1r": 5, "q2": "The information provided in the proposal is sufficient to review the auditability of the project. We have milestones to measure the success of this project. Success is that after 6 months of completing the video lessons, we get a certain number of people to participate in the Plutus Pioneer Program, success is a certain number of proposals are sent to Catalyst, the views of each lesson on Youtube increase. And I think it will be interesting if in the not too distant future, most of the proposals on Catalyst are to build Dapps that integrate smart contracts using Haskell language.\nInformation about each member of the proposal is provided in full and with references to their Github and Telegram pages.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 14, "ne": 1, "ng": 13, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 8454, "q0": "This is a wonderful idea since the haskell training in Vietnamese will assist to know more about functional programming language and ultimately recruit more developers to the Cardano ecosystem. This proposal's influence on the community should be undeniably good. The 6-month course is extremely knowledge-rich, with 23 videos and 11 exercises. Because the learners would progress from basic to advanced and then do exercises, I am certain that this proposal is within the scope of the challenge. The proposer has also stated how it will benefit the Cardano ecosystem. I believe that Cardano requires more developers capable of creating dapps, and initiatives like these can assist attract additional developers who might otherwise be unable to obtain this information.", "q0r": 5, "q1": "The plan provides a detailed roadmap for activities that will take place over the next six months. They will generate two lessons, two tutorial videos, and two exercises each month. The use of the money is clearly stated in terms of how it will be utilized. Core team members have more than 5 years of research and teaching expertise in the cryptocurrency business. Personal information about team members, including connections to Facebook groups and Telegram accounts, is easily available. \nA small note I would like to know more about is the marketing strategy that the team will execute to attract new learners. \nOverall, I believe that this proposal is possible given the group members' Haskell development and academic experience.", "q1r": 4, "q2": "The plan lays out a clear approach for measuring progress and determining success. They determine the total amount of tasks that must be completed and verified on a monthly basis.  These tutorial clips will be shared on their social media platforms. The proposal's core staff are capable of teaching, researching, and translating, so I'm convinced that they will meet these completion dates.", "q2r": 5, "assessor": "z_assessor_2985", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 8840, "q0": "Haskell is one of the difficult languages to learn since it has terse syntax, abstractness, purity, and its community's love of one letter identifier names. and haskell don't have proper libraries currently ,so people  quit learning haskell most of the times.\nAs proposer here wants to teach the haskell in Vietnamese which  will definitely boost Vietnam people to learn haskell ,and he wants to teach haskell to the people from the basics, since there is lack of resources available to learn haskell , the presented plan is a big boost to people who wants to contribute to cardano in the future hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "There are team members who have been working in haskell for more than 10 years and other 2 members have experience in haskell development for more than 5 years with the provided experienced team the task might be achievable .\nThe biggest concern of this project is translation , translation of programming language will never be an easy task, and at last the students have to use English as proficiency language for continuing their code for bigger projects, as there is lack of availability of materials related to haskell, developing materials in Vietnamese language will definitely be a challenging one hence with Given experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 4, "q2": "The proposer could have elaborated on how the team is going to translate the programing aspects in Vietnamese , since haskell has key indicators available in English converting them to native language is a difficult task.\nExcluding the above points the proposal has displayed which are the basic topics that'll be taught to the students in early stages  , the teaching team contains members where each of them have experience of more than 5 years in haskell.\nThe presented audit has very detailed timeline of the project and it also has structured budget breaking , where charges are calculated on hourly bases , with decent key indicators provided the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 9610, "q0": "This proposal is in line with what the challenge presents. It creates a course on youtube in Vietnamese to teach programmers from other imperative programming languages ​​to approach and familiarize themselves with Haskell. That will help Vietnamese programmers who are interested in Cardano and want to build dApps on Cardano can easily learn Haskell through their native language. Vietnam has a force of highly skilled programmers and is also one of the countries with the highest percentage of people interested in blockchain in the world. The goal of the proposal is to provide Haskell-related resources so that Vietnamese programmers can easily learn the Haskell language, thereby having a foundation to join the Plutus Pioneer Program course and start the journey to becoming Cardano developers. This effectively solves the challenges in the Challenge Setting.", "q0r": 5, "q1": "The team has experienced Haskell programmers, and there is also a Vietnamese who teaches English to take on the task of translating courses from English to Vietnamese. In addition, they have also translated the book Real World Haskell into Vietnamese and are making Haskell teaching videos in English on youtube. That proves they have the ability to make the proposal a success. The budget they propose is also clear and reasonable, divided by the number of videos and exercises, the construction time for each video is 6 hours and the exercise construction time is 5 hours, the cost per hour is $ 60. The proposal also offers solutions to solve course-related problems through zoom meetings, but the proposer should be more specific about the frequency of these meetings. For example, how long each meeting lasts, and how often the meetings are held, weekly or on-demand so that voters can understand in more detail how the team supports their students. Overall, in my opinion, the team is capable enough to carry out the project, especially since the content of the course is already available (based on the famous book Learn You a Haskell for Great Good!)", "q1r": 5, "q2": "Since this project is aimed at building online courses with videos on Youtube, the community can fully track the progress of the proposal easily. The course videos are posted on Youtube and the exercises are publicly hosted on GitHub making it possible for anyone to audit the success of the proposal. They have provided KPIs to help 50 Vietnamese programmers participate in the Plutus Pioneer Program course, more than 100 views and 20 comments for each videos.", "q2r": 5, "assessor": "z_assessor_3068", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 13813, "q0": "Developing Haskell learning in the Vietnamese Developer Ecosystem can be really fertile for the Cardano Community in the long and short term. This basic course in simple language might help de Vietnamense Developer Ecosystem grow and draw in new developers into the Cardano Community. This proposal effectively addresses the challenge and to be founded can enhance deeply our opportunities of creating new dapps, transactions and developing dynamics. It might be interesting to find out an effective way to help these new Haskell developers into the Cardano Catalyst Community. Sharing with them, at the end of the course, the great opportunities they have within working in developing our Community.  It is also interesting taking into account that the audiovisual content created can be used for several proposals and projects in future Cardano Community events. \n", "q0r": 5, "q1": "Given they have already been funded in Fund 8 and successfully implemented their roadmap, we can see the link of the Youtube Haskell Course for Beginners. Taking in account the experienced team and the continuation they show in their interest for Haskell programming and into our Community, it is highly likely this proposal will be implemented successfully. It is really interesting for the Cardano Community to have projects like this which invest their time and creativity continuously and persist in achieving their goals. This is a certain path in order to enhance our Developer Ecosystem. ", "q1r": 5, "q2": "The information provided is sufficient to audit the progress and the success of the proposal and it would be easy for the Community to track the presented milestones. Although it might be interesting, instead of focusing on the numbers, such as the amount of Youtube subscribers or views numbers, it might also be interesting to measure or track the quality behind the numbers, people watching and their impressions. It may be interesting having an open channel of opinion and comment exchanging. Also, we can never ignore as a Community the importance and strength of social media in this kind of project. A good communication and circulation campaign can be the perfect complement for this kind of educational project, always trying to inspire and draw in new developers and students into our Community. ", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 14003, "q0": "I appreciate this proposal. The proposer is really clever and intelligent when he can take advantage of the situation that most developers are stuck in accessing Haskell - a programming language which is completely different from Solidity or C++, python, JavaScript. Due to this specification of Haskell, although it is a basic programming language for the intelligent contract of Cardano, most developers are coping with hard barriers when they want to explore Haskell. “Vietnamese Haskell Course” aims to assist the developers as well as all participants who tend to study Haskell to eliminate the barriers by providing a studying course in which will provide the simplest video tutorials to the most advanced content. All of them are based on the book Learn You a Haskell for Great Good and A Beginner’s Guide from IOHK in the Plutus Pioneer Program. The proposer also mentions how many sections will be delivered via those videos and encourages creating practice exercises. This proposal’s success will contribute a lot to Cardano's development since it can raise the number of developers positively and attract them to Cardano’s platform.", "q0r": 5, "q1": "In feasibility, the proposer has provided a detailed plan about the chronology of posting tutorial videos in 6 months. He also includes the title for each video and number of posted videos in each month. The proposal is successful in persuading me (I believe there would be more other people who will be persuaded like me to) to support it based on those explanations under each question and the attached videos for us to imagine how the course is organized visibly. The teammates are really amazing. All of them have more than 5 - year experience in studying Haskell programming language and currently work in Haskell programming fields and also have experience in creating tutorial videos via YouTube. Therefore, I think they would gain another success in Fund9 after those successes from the previous Fund. On the other hand, in the budgeted plan, the proposer focused on delivering the amount of expenditure on video making and exercise making. These sections are described in detail, and I don’t have any questions or recommendations for them. However, I think there should be an estimation for the advertising or marketing costs. At the beginning, not many people can find the course information easily, so it is necessary to include the estimation cost in the budgeted costs. At least, it is essential to deliver how the team can attract a number of developers or participants to join the course. Anyway, the proposer really performs impressively in this feasibility.", "q1r": 5, "q2": "In auditability, the proposer provided a full data that is essential to evaluate the successful level of the process as well as the proposal. I think the future with most proposals that appear on Catalyst about constructing Dapp and integrating almost intelligent contracts that Haskell programming is taken advantage of are highly possible to occur. I do strongly expect it and this proposal. The proposal is expected to attract more Plutus Pioneer Program participants towards Cardano and also the number of Vietnamese developers who are curious about Haskell and want to learn it will be increased through the course. We can verify how successful the proposal is by looking at the targeted numbers via the description and making comparison to the reality numbers later on, after 6 months.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 14756, "q0": "According to the proposal, there are quite a few programmers who are interested in building projects on Cardano. Programming software uses Haskell as a base language for building smart contracts. However, currently, there are not any Haskell programming language courses in Vietnamese. The project wishes to create a Haskell course in Vietnamese to serve Vietnamese programmers building projects on Cardano. This is a highly appreciated project for bringing the opportunity to interact with the Cardano community for Vietnamese people.\nThe idea of ​​implementing the project to solve the problem is presented very clearly in the proposal. The team showed the importance of the project to the popularity of the Cardano community to Vietnamese people and encouraged creators to contribute projects to the community. The functions and features of the program are mentioned very specifically. The team also explains in detail how the project works. The proposal also outlines the contents of the project. The target audience of the project is also stated in the proposal as well as the impact of this project on these objects is also clarified. However, to be more appreciated, the proposal should have an in-depth mention of the technical aspects of the project implementation.\nThe goal of the project is set based on the key metrics of the Challenge. The results are completely in line with the orientation of the Challenge. This project fully meets the requirements for KPIs. The results when the project is completed are also clearly stated in each part and each stage in the proposal.\nThe team understands that it will be difficult for programmers to learn programming languages ​​only through youtube videos. However, the team also tries to overcome that difficulty and come up with solutions to increase the efficiency of the project.", "q0r": 5, "q1": "In this section, the proposal clearly shows the roadmap of the plan. The project divides each milestone and the products that the project will deliver at the time of the roadmap. The project implementation plan focuses heavily on the division of lessons. The plan is carefully calculated for each lesson to bring the most effective. In addition, the proposal also provides a realistic and logical timeline for building each lesson. In addition to providing an outline of the curriculum, the team also sets standards for that knowledge. However, there should be more details on technical aspects such as architecture, language, and technology required to execute the plan. The proposer should also clearly define the positions and number of people needed to carry out the proposed project. This detail will help the community appreciate the team's project implementation plan.\nThe budget that the proposal proposes is generally quite reasonable. The budget plan is broken down and presented in a bulleted format. The costs are transparent for each investment item.\nThe project is carried out by experts with many years of experience in the field. With their knowledge and skills, this project is believed to be successful and bring the expected results.", "q1r": 5, "q2": "The success of the project is measured by the number of viewers on youtube and the likes and comments. These quantitative indicators are based on the details of the milestones in the roadmap and the time period to achieve the goal. Specific numbers are provided for the community based on which to evaluate the success of the project. At the same time, the image of the project's success described in the proposal also helps the community to evaluate the progress of the project. Those are the results that the project has achieved in each phase. These results are completely consistent with the detailed plan outlined above. This shows that the team has seriously implemented the proposed project and completed it with constant effort.", "q2r": 5, "assessor": "z_assessor_4099", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 14783, "q0": "\"The number of developers in Vietnam today is very large. But most developers can only code with languages like C++, JavaScript, C#. Haskell is a very strange language in Vietnam. There are very few documents and courses on Haskell available in Vietnamese.\nBut Haskell is Cardano's foundational programming language for building Smart Contracts.\nTherefore, creating Haskell courses in Vietnamese is very helpful for growing the number of Vietnamese developers for Cardano.\nThe course content provided by the proposal's team is also very close and accessible to those who do not know about Haskell or even programming. Because, \"Learn You a Haskell for Great Good! A Beginner's Guide\" is a book for those just starting out in programming.\"", "q0r": 5, "q1": "\"Proposal's team has been funded at fund 8 which is a good proof that this proposal is feasible.\nTeam members are all people with many years of experience in Haskell programming and Haskell teaching\nThe team also has an English teacher with 7 years of experience in teaching English, which is also a suitable experience to implement this proposal.\nMs. Hannah is an admin of the Cardano community in Vietnam with over 40,000 members, it's a good experience to share these videos with the community who are interested in building projects on Cardano.\"", "q1r": 5, "q2": "\"The number of videos and exercises is clearly listed in the detailed plan. So the process of implementing this proposal is completely measurable through Youtube and Github.\nMeasuring views, likes, comments, and subscribers are very clear indicators to know the interest and effectiveness of videos for learners.\nProposal had specific goals to be achieved such as the number of subscribers, views, likes, comments.\nIn addition, the number of people participating in the Plutus Pioneer Program and becoming a proposal for Catalyst is a clear indicator of the impact of the proposal to Cardano.\"", "q2r": 5, "assessor": "z_assessor_4100", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 14798, "q0": "- I participated in the Plutus Pioneer Program organized by IOHK to develop developers capable of writing Smart Contracts on Cardano in Plutus language. This course is not for coding beginners. Some prior knowledge of Haskell or functional programming is recommended, as Plutus is heavily based on Haskell and includes advanced features like Template Haskell, type-level programming, and effect systems. IOHK recommend that you read the book \"\"Learn You a Haskell for Great Good! A Beginner's Guide\"\" before taking the course. Therefore, Haskell courses like these are extremely important for developer development for Cardano.\n- In Vietnam, Haskell is an uncommon programming language. When I search Google and Youtube for Haskell courses and resources in Vietnamese, there are few results. This shows that Haskell courses like this for Vietnamese developers are essential.\n- Besides, English is a huge barrier for developers in Vietnam. Most developers in Vietnam can only work in the country with popular programming languages ​​(there are many Vietnamese documents). So, learning materials and videos about Haskell in Vietnamese is a necessity for developers in Vietnam to be able to participate in Cardano.\n- The Haskell course in this proposal builds on the book \"\"Learn You a Haskell for Great Good! A Beginner's Guide\"\" which makes sense because it is the book recommended by IOHK in the Plutus Pioneer Program. This is a very basic book about Haskell so most people even those who don't know anything about programming can learn it.\n- I really like the idea of ​​the team with appropriate exercises for each video lesson so developers can practice what they've learned. This will help developers to learn deeply and be able to put the lessons into practice.\n- The team is the admin of 2 Cardano facebook groups (in Vietnamese) with more than 50,000 members and a telegram group with more than 1,000 members. These groups can help make this course accessible to a large number of people interested in Cardano and can help them become developers for Cardano.\n- Creating Zoom Q&A sessions is a great way to answer learners' questions through their comments on lesson videos.\n\n- To make an even bigger and longer lasting impact on Cardano's developer development through this Haskell course, the team can think about collaborating with universities to make this course a subject in university. It can help grow the developer force for Cardano a lot.\n- In the future, the team should build this course in more languages. This will make it possible for more non-English speaking communities to access Haskell and become a developer for Cardano.", "q0r": 5, "q1": "- Proposer has shown very clearly the content of the videos that the team will make in this proposal. Each video lesson will cover a chapter of the book \"Learn You a Haskell for Great Good! A Beginner's Guide\". The content in this book is very specific about the necessary knowledge for learners. Therefore, it is not difficult for the team to take the content of the book to make the videos.\n- On average, the team will make 2 video lessons, 1 exercise and 2 solution videos every month. Total implementation time is 34 hours per month (just one person to do it with an average time of more than 1 hour per day). With such working time, the team is fully capable of implementing this proposal successfully without any problem of workload.\n- The team has 2 funded proposals at fund 8 and is still in the process of being implemented. But the team has also demonstrated the ability to implement this proposal through the first month report that the team has completed 60% of the work of a proposal and completed a translation of a 650-page book in fund 8.\n- In addition, the team also submitted 2 other proposals in fund 9 about the Haskell course for developers (total working time in a month: about 40 hours) and translated Haskell books into Vietnamese (400 pages).\n- The total working time of the whole team if all 3 proposals of the team in fund 9 are funded is about 150 hours/month (5 hours/day). The team has 4 members with Haskell experience performing these tasks. So the ability to implement all of the team's proposals according to the detailed plan is completely feasible.\n- Because the team has shown the proposal implementation plan in a very detailed way about the time to perform specific tasks. So the budget breakdown of the proposal is also very clear with the cost calculated by the hour.\n- All team members have many years of experience in programming and teaching Haskell (5 - 11 years).\n- The experiences of team members are clearly shown in Github and their youtube channel.\n- To develop the course in Vietnamese, Mr. Quang Daniel has 7 experiences in teaching and translating English. So there is no problem with building the course in Vietnamese.\n- Ms. Hannah is an admin of Cardano communities in Vietnam, so marketing this course is not difficult.\n\n- Monad and Monoid are two quite difficult knowledge for those who are new to Haskell. The team may consider creating a more advanced course to teach these subjects more in depth. I'm also looking forward to the team's advanced course to help learners deepen their understanding of Haskell.\n- In the team's future advanced courses, I think the team should have lessons related to Plutus and Cardano's Smart Contract. This will help developers see the Haskell application in Plutus and Cardano's Smart Contract", "q1r": 5, "q2": "- Measuring the process and results of implementing this proposal is easy to do through video lessons and solution videos on Youtube. We can completely check through metrics such as view, like, share, comment, subscriber, ...\n- The proposed exercises can also be easily measured through the team's Github\n- The team also showed the success of the proposal very clearly with the following goals:\nAt least 50 people join the Plutus Pioneer Program course and 10 proposals submitted on Catalyst through Vietnamese Haskell Course\nYoutube channel got 500 subscribers\nEach video has more than 100 views, 20 likes and comments\n- Metrics of subscriber, like, share, comment, ... can show how learners feel about the course (satisfied or not).\n- Views can show the effectiveness of marketing and how many people get value from these lessons\n- The number of people participating in the Plutus Pioneer Program and the number of proposals submitted on Catalyst are indicators of the impact on developer development on Cardano.\n\n- The team should design a competency test of learners after completing the course and issue certificates to them. This certificate can also be a good metric to measure the effectiveness of a course. In addition, this certification also gives learners an extra proof of their Haskell programming experience. The reliability of this certificate may not be high and it is not valid for use by other individuals and organizations. But it's also a pretty interesting goal for learners motivated to complete this course. This is my idea that the team can refer to and develop in the future. But in this proposal, for me, the metrics that the team gave are very complete and meet all the necessary requirements for the auditability of the proposal.", "q2r": 5, "assessor": "z_assessor_4101", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}, {"id": 14825, "q0": "As a Vietnamese who is having to learn about blockchain, this project completely meets the needs of a customer. Currently, the Cardano ecosystem has not really been noticed by many users in Vietnam, because most of the content is in English, providing a Haskell course is an excellent choice. We can see the content that will appear in videos on YouTube, such as Type in Haskell, Modules or Monoids, and on and on. The majority of the content is essential knowledge for customers who want to join the Haskell community, and the proposer even allows participants to participate in practice exercises on Github - a feature that is fully aligned with the Challenge's Key Metrics. Furthermore, I like the idea of using Zoom Q&A sessions to answer learners' questions in order to help users understand Haskell thoroughly. A clever way to tackle the challenge. Overall, the project performed admirably in this area.", "q0r": 5, "q1": "Within 6 months, the project will complete a large amount of work, and instead of remaining constant, the difficulty level of knowledge and topics will be increased and changed over time to ensure that people's knowledge is not limited, as well as to motivate learners to participate from the beginning if they do not want to lose basic knowledge. I especially like how the author will release video tutorials, exercises, and exercise solutions every month to help users learn more easily. The staff even has Haskell Book Vietnamese Translation to help students stay on track with the course. I'm also completely satisfied with the budget and the team of this proposal. The amount of sponsorship will be calculated based on the number of videos produced during the exercise and the number of working hours. Furthermore, the staff consists of individuals with the appropriate experience, knowledge, and skills for the project. However, I see that there is currently only one Vietnamese person in the team in charge of translation, so the work will be quite difficult in general, especially since that person does not have experience translating in the technology industry. As a result, try to hire one more person to assist and ensure that the quality of knowledge is conveyed in the most literal sense.", "q1r": 4, "q2": "Congratulations to the entire team for preparing so thoroughly for this section. We have detailed metrics demonstrating the benefits to Cardano and users. All the successes that the project expects, I believe, will be realized. However, it would be favorable if the author could provide specific timelines for each activity when measuring project progress. How long, for example, will it take to begin tracking views, likes, and comments under each video? This is critical because it will greatly assist investors in closely monitoring and evaluating the project's outcomes.", "q2r": 5, "assessor": "z_assessor_4104", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal."}], "solution": "We created a Haskell course in Vietnamese to help Vietnamese developers build projects on Cardano. This course will give developers understand how to code by Haskell basically", "experience": "\n2 Haskell Developers with 5 years of Haskell programming experience\n1 Haskell Teacher with 11 years of Haskell programming experience\nAn admin of Cardano Community (40,000 followers)\n2 funded proposals about Haskell in fund 8\n"}