{"id": 415632, "author": "tienna", "title": "Cardano developer club in Uni", "url": "https://cardano.ideascale.com/a/dtd/415632-48088", "category": 26597, "amount": 44550, "description": "IT students - developer resources are currently lacking an environment (Lab, exercise, reference document, hackathon..) to practice and experience building dApps on the blockchain platform", "f6_no_assessments": 23, "f6_rating": 4.724637681159422, "videos": [], "media": [], "f6_assessments": [{"id": 204, "q0": "It focuses exactly on educating university level CS students to develop on Cardano.\nThis is exactly the way to secure growth, by making development Cardano as natural as something you learned in university, and you tend to keep up with the changes in the ecosystem from there onward, which is not easy to start with. \nAlthough many of the other proposals are very good, this particular case is something that has been overlooked in general and may add a lot, not only in terms of new developers entering the ecosystem, but also in terms of synergies from freshly trained graduate students who are in tune with up-to-date research and have ties with many aspects of CS, before being siloed in a particular area when starting their working life.", "q0r": 5, "q1": "All participants have strong ties to university, the interest in Cardano in Vietnam exists and the proposal is well thought out. \nFurthermore, the proposers are SPO´s, Town Hall moderators and are, in general, well involved in the ecosystem.\nI don´t think it can, realistically, get much better than this for this kind of proposal.", "q1r": 5, "q2": "Yes. The proposers will report through their website grpahical media, they will also update their github repo and, hopefully, they will share classes on some video platform too.\nAdditionally, the number of students joining the club, participating in classes and hackathons and the number of new proposals presented by them is a real world metric on both the effort of the proposers to fulfill their duty, and the effectiveness of their effort in training new developers who will contribute to the ecosystem.", "q2r": 5, "assessor": "z_assessor_2060", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"id": 13747, "q0": "The challenge the proposal presents with IT students who are lacking a practice environment and dApp building experience to address this issue proposes building a Cardano development club at the university. The proposal is in line with the Challenge Developer Ecosystem to set aside a learning environment, organizing hackathons is something that students should have. A club that will create exchanges, learn, compete for achievement, improve knowledge for IT students (who are the future developers of Cardano) The club's activities have a strong impact on the Cardano and Blockchain communities, providing good quality developers, increases the number of IT students participating in Cardano, Blockchain. The proposal is scalable, creating more clubs at universities, attracting more IT students to participate in research activities on Plutus/Haskell, Smartcontract, building Dapps, etc. The goal of the proposal is to bring potential development to IT students (future developers) to help build more applications for the Cardano ecosystem. The proposed challenge creates a club featuring cardano laboratories, developing test-net testing environments, Plutus/Haskell, etc. Addressing the challenge of the proposal makes sense when it comes to facilitating IT students, blockchain event organizers, and hackathon competitions. the risks of the proposal put forward in terms of facilities conditions have an impact on the development of the club. The way to reduce risk is the help of the University in terms of funding, facilitating the study time. The risks associated with the research of IT students have been proposed to provide a reasonable solution.\nRating: 5\n", "q0r": 5, "q1": "The proposal gives a realistic timetable for completing the given challenge, the implementation time in 06 months. The implementation plan is developed month by month, the design of the laboratory, the preparation of facilities is prioritized. The content preparation work is completed by lectures, knowledge of Dapp development, Blockchain. Plan the introduction of the programming language, organize a Hackathon, all the work content is carefully prepared. A good implementation plan will create a good environment for IT students to develop their thinking abilities about blockchain. To assess the success of the proposal I wish the author's plan had specific goals such as: The number of IT students actively participating? Quality of it students' internships? How many projects can they carry out are high performance? Implement the proposal by the group of 8 members with full information about the professional competence of each member (information provided on Linkendin, Twitter, Telegram). The team implementing the proposal has all the necessary elements: Capacity to work in cardano field, Plutus. Faculty in the IT field is an important factor in the success of the proposal. The proposal shows that the resources are adequate for the assignment of tasks related to the professional qualifications of each individual. The budget analysis is very clear, divided by month, spending on each item is detailed. We can see the proposed $44550 request amount being used in a reasonable way.\nRating: 4\n", "q1r": 4, "q2": "Evaluating the success of the proposal is the final result of implementation in 6 months of implementation. During the implementation of the audit to take place the proposed implementation team will provide figures on the development of the club. Can we see how many club members, is it working? seminars, hackathon competitions. Kpis, photos, and videos are all clearly shown on the group's Wedsite, which has monthly reports written on Github. The index/KPI has shown the success of the proposal and can perform an audit. The successful proposal is the result that 30 research developers make up 10 quality dapps and stable operation of the club. The proposal is part of a long-distance project for the development of the Cardano ecosystem. I look forward to the proposal being able to show us that the club's operations will be extended and developed to provide more developers in the future.\nRating: 5\n", "q2r": 5, "assessor": "z_assessor_3777", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13013, "q0": "The project was created to build an open club for Cardano developers at the University such as students and faculty. They can participate in building basic, advanced labs, organize hackathons and other activities. The project fits the subsection of the challenge.\nThe project is founded on the right reasons. First, there is a lack of a test environment in the University for developers to write blockchain applications. Second, lack of encouragement, encouraging students to pursue their passions. Third, students often learn about ETH / Polkadot / Near / Solana / Cosmos because these platforms have great promotions. Besides, students who are interested in blockchain lack friends to share ideas and work together on big projects. Finally, students do not know much about Catalyst and often apply for funding according to the traditional model\nFor the above reasons, Cardano developer club in Uni will create Cardano labs. It is a place where blockchain enthusiasts can find friends with similar passions and interests. In addition, this project not only regularly organizes seminars to share knowledge, but also organizes hackathon events to encourage the students to continue to grow.\t\nRegarding the risks of the project, they have come up with appropriate solutions. For example, equipment will become obsolete over time and they need maintenance and upgrades so they will ask for a reciprocal fee from the university for this.\nFor the above reasons, I think the project will motivate developers and allow them to focus on creating successful applications. Besides, it contributes to the development of Cardano in Vietnam.\n", "q0r": 4, "q1": "The project will run for 6 months. In the first two months, the team will prepare necessary things for the following months: preparing rooms, recruiting people, planning the program, building exercises, etc. From the 3rd month onwards, the group will Starting to carry out plans such as seminars, sharing sessions .....Cardano developer club in Uni prepared carefully and had a specific roadmap.\nThe total cost of Cardano developer club in Uni is $44550. The cost of this project is based on the set schedule. The first two months, the group needs $ 12520 to prepare exercises, recruit members, etc. From the third month onwards, the group needs $ 27450 to organize events and purchase necessary equipment. The cost of the project is carefully calculated and specific.\nRegarding personnel, the project has 9 members. They are all experienced and professional. Information about the members clearly in the specific specific project. I see that they have enough ability to complete the project well.\n", "q1r": 4, "q2": "Cardano developer club in Uni audits based on 5 metrics: Total number of developers participating in clubs, using labs, participating in workshops, participating in hackathons and total number of proposals on the concept scale. Besides, the project gives clear and achievable KPIs. In addition, we can also track progress monitoring through their web and github. Especially, they have successfully implemented the project “ Catalyst Events 4 Vietnam Students ”.", "q2r": 4, "assessor": "z_assessor_3533", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 12922, "q0": "Identify problemsthat currently lack the environment (laboratories, exercises, references, hackathons..) to practice and experience dApp building for IT students. The solution of building Cardano clubs at universities is appropriate. The solution implemented increases the number - quality of professional developers on the Cardano blockchain platform, expanding the Cardano ecosystem. The proposal brings more developers to the community at a university that expands the Cardano ecosystem in the community and is more stable. More dApps will be developed in the Cardano ecosystem. Increase the number of Cardano blockchain developers. Realize startup ideas on the Catalyst platform. The team has successfully implemented the project \"Catalyst 4 Vietnamese Students\" project, creating an open space for teachers and students to exchange, practice, experiment, hackathon races. Risks that the team posed: The device became obsolete over time, location limits, Coincidentally with other faculty activities, Difficult-to-learn programming languages. Group-specific risk side carving solution: Ask for reciprocal costs from the university for outdated equipment, Enhance reputation to easily exchange location negotiations. Discussing and adjusting to suit the school calendar, creating a team so that individuals with good achievements can support other team members, the team has come up with a reasonable solution.\nI'm judging: 5", "q0r": 5, "q1": "The project takes place within 6 months ofreasonable timelines for implementation. During the 6 months of implementation, the team has broken down the detailed plan for each month corresponding to each task and detailed goals to be achieved (in terms of document preparation, personnel, laboratories, workshops, etc.) the plan is very clearly attached in the proposal file. It is possible to check the project progress at the web: https://cardano2vn.io. The project raised $44,550 out of a total of $1 million, or 4,455 percent of the challenge's budget. The budget has a reasonable, detailed, clear and transparent spending plan. The implementation team consists of 9 members. Each member's task is specifically divided. The experience is appropriate. Identity authentication at Linkedin, Twitter, Facebook, Telegram. The implementation plan is complete, the budget is appropriate, the implementation team has good capacity to make the proposal highly feasible.\nI'm judging: 5. ", "q1r": 5, "q2": "Check the project implementation roadmap throughthe index to measure the success that the team gives is: The total number of developers participating in the club, the total number of developers who will use the lab, the total number of proposals is not limited to the scope of the idea in the first round, Total number of developers participating in workshops, sharing sessions, Total number of developers participating in hackathons. Specific indicators are easy to check. The success of the project is that the club operates effectively. 30 research developers make up 10 quality dapps and the stable operation of the club. If the proposed funding is related to the proposal \"Catalyst 4 Vietnamese Students Event\" at F7. The continued implementation at universities is appropriate to implement. The proposal has come up with appropriate KPIs to determine the long-term success of the project.\nI rated: 5", "q2r": 5, "assessor": "z_assessor_3514", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 12878, "q0": "Students and professors at universities that teach information technology typically have a deep understanding of blockchain technology. They frequently study ecosystems such as ETH, NEAR, and POKADOT... usually because each of these platforms possesses a particular set of capabilities. important promotion Building a library or a club in an IT university is a good idea because it not only helps students and lecturers learn about Cardano, but it is also a place where you can deploy, expand your ideas, and create custom DApps. It is also a place where students and faculty can be considered developers, and it is a place where you can find people who share the same level of enthusiasm as you. And I also hope that in the not too distant future, when the club is formed and developed, there will be more new Dapps, with superior features, and much use by the community by students and lecturers at a domestic IT university. I hope that this will happen sooner rather than later. In my opinion, the proposal is adequate for the task at hand as it will contribute to an increase in the number of decentralized applications (Dapps) available on the Cardano platform, thereby contributing to the ecosystem's continued expansion and diversification.\n\nWe believe that it is quite detailed and covers all of the bases given that it includes the four primary threats that the team identified along with the solutions to those threats. Nevertheless, in this potentially hazardous section, I have one modest proposal to make: The fact that students and teachers are involved in, and sometimes overly involved in, the investigation and development of Dapps can have a negative impact, not only on their capacity to learn, but also on their ability to advance. The teaching ability of the teachers is reduced (because learning in school will include a lot of subjects and teachers will have to teach different classes), which means that the issue with your school is still the primary problem, and the research and development of the Cardano ecosystem in general and the development of Dapps is just a side issue. It is not possible to study with one hundred percent of one's attention. But I also hope that during the time when you are not in class, such as during the summer break or the holidays, you will be able to do research on the Cardano Blockchain, develop it further, and spread awareness of it. Therefore, I will award this impact four points.", "q0r": 4, "q1": "The construction road map for your project extends over a period of six months and includes specific work for each month. Concerning the fee, you provide a fairly comprehensive Excel spreadsheet in addition to an explanation for each month, detailing how much each period costs, as well as what must be spent during each month. The key performance indicators (KPIs) and documents regarding the progression of the project will be made public by the team on the website of the group as well as on GitHub for the community to follow; this is a matter of great transparency, and you did it. I get it. But I do have a question because I don't really understand it: in the final stage of expenses (i.e., the third to the fifth month), you mentioned two items: \"Organize 03 seminars $4,320\" and \"Introducing Catalyst to Developers $640.\" Could you please explain this to me? To ensure that I have a complete understanding of this aspect of the cost, I require that you either be more specific or provide additional explanation. Concerning your team, here is a familiar group from Fund 6 that has received funding for eight proposals through Fund 8. A score that is high enough to indicate that each member of your team is exceptional in their own right. great. So I will still give you a score of 5 for your feasibility.", "q1r": 5, "q2": "Your team has provided a measurement of the project's progress with specific numbers and lucid key performance indicators (KPIs) for a period of six months following the successful completion of the project. In light of the impressive statistics provided by the team, \"30 developers make use of the lab in the first six months; 1800 hours of lab time are used in the first six months; 100 developers join the club; and 10 projects are completed in the first six months.\" The project was advanced to the idea level, and there was attendance from 150 students at seminars and sharing sessions, as well as hackathon participation from 15 developers. \"My expectations for the future with regard to both the students and the faculty at our university are quite high. You are able to disseminate the important messages that Cardano has to offer, which will help the ecosystem develop and flourish. This auditability receives five points from me.", "q2r": 5, "assessor": "z_assessor_3497", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 12466, "q0": "I completely agree with this suggestion. Blockchain technology and crypto money are becoming more and more popular in Vietnam after the breakthrough of Bitcoin in recent years. The need to learn and learn about becoming a blockchain developer like a professional Cardano developer is increasing in Vietnam. According to statistics, Vietnam has 460 universities and colleges and each year the number of information technology graduates is up to 55,000 students. The demand is great and the supply is very rare. About specialized training institutions or clubs for blockchain enthusiasts, especially Cardano, there are almost no or very few in Vietnam. Almost all blockchain developers in Vietnam today self-study, research, and knowledge through the internet and self-study with English documents. That leads to many consequences that cause many knowledge gaps, consumes a lot of time and effort, and is invisible in general, making the Cardano developer community in Vietnam in particular and the Cardano developer community take longer to complete development. Because of all the above reasons, creating a Cardano developer club in universities in Vietnam is extremely practical and necessary. It not only helps students who are passionate about blockchain programming, specifically Cardano but has a professional environment fully equipped to easily learn, improve knowledge, and practice a practical application. but also helps to expand and develop the Developer Ecosystem effectively, long term, and sustainably. Under the guidance of those who have many years of experience in training and teaching, high expertise in blockchain technology, especially Cardano, and direct support from universities will help students have a where you can discuss, share and practice programming skills in the most comprehensive and effective way.\n\nThis proposal is really good, practical, and meaningful, has a great impact on Cardano Developer Ecosystem in Vietnam, contributes to the common development of the community, and helps all students who are passionate about Cardano have a good environment for perfect training, and learning. It will really explode if successful", "q0r": 5, "q1": "The proposed project solution is extremely reasonable and has a certain positive impact on Cardano Developer Ecosystem. The need to learn to become a blockchain developer like Cardano developer among university students is increasing day by day. Opening a club dedicated to that need is very reasonable in terms of solution and feasibility, it is in line with the law of supply and demand we often hear. The team members are all qualified and highly specialized in training including blockchain like ADA. In addition, some members are still in the school administration (Mr. Thong: Dean of Faculty of Information Technology (since 2020), University of Transportation and Communications), so the organization and licensing of the club goes into operation. School activities can even be proposed as a major, which is not difficult to do. Some members are even founders of stake pools (Mr. Tien, the founder of the VILAI stake pool, and Mr. Hieu, founder of the HADA stake pool) so we really don't mind their knowledge and vision. All members have very clear and detailed information (Linkedin, Twitter, email, telegram, and Facebook). The breakdown budget is very clear and specific for each item each period for all infrastructure, furniture, fans, computers, Internet connection, VPS and etc. It shows that the team has prepared very carefully for their project.\nIn summary, the feasibility of the project is very reliable.", "q1r": 5, "q2": "The project roadmap is provided very clearly and in detail so that voters and the community can very easily follow the progress of the project. Each activity, each infrastructure device, and each expense has been calculated and listed in a specific way in each stage, making it easy to track. With this project, whether we can examine it is successful or not by checking the KPIs through each stage that the project team has provided us. Around 30 developers use the lab regularly in the first 6 months, the total expected usage time is 1800 hours.at least 10 dApps will be released in the first 6 months. That's a very cool number. We can access their website to see all videos, photos, and documents which will be publicly posted on the web (cardano2vn.io) and monthly reports on Github. Therefore, this proposal is completely auditable.\n\nI hope the project will be successful\nGood luck!", "q2r": 5, "assessor": "z_assessor_3420", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 12396, "q0": "The problem that has been brought up in this proposal is the lack of learning environment for developers (primarily targeted at IT students in uni) to gain hands-on experience of writing blockchain applications and collaborating with other developers on big projects, as well as the limited amount of human resources in the IT and blockchain sectors (which is backed by the imbalance between the number of yearly IT graduates and the expected shortage of IT human resources in Vietnam), which is a relevant challenge because giving a proper learning environment to nurture new talents, is an important mission to be achieved to further drive the development of the Cardano ecosystem in the future. The proposer addresses this challenge by providing a learning environment for students via the creation of a Cardano Developers Club at university that will host activities such as lab exercises to let students gain experience on making blockchain applications and other events (e.g. seminars, hackathon). By having these clubs, university students can gain learning and hands-on experience by attending seminars and building dApps with other students, which can be the catalyst of discovering new talents that can contribute to the Cardano developer ecosystem. ", "q0r": 5, "q1": "The proposer provided the number of team members and relevant links (LinkedIn, FB, etc.) backing up their skills and experiences that are needed to implement this proposal. This includes experience as IT lecturers at Vietnam National University and their past involvement in the Cardano space (i.e. VILAI Cardano stake pool), as well as their past experiences working in the IT landscape in general (i.e. data mining, blockchain, etc.) which are relevant skills needed to provide direction for the club members. \nThe budget  has been broken down very well into each identifiable items as well as their respective timelines, this includes information such as the number of people working on each item, the hourly rate, and total hours consumed which was provided in an attached google sheet. The budgeting was laid out into (1) the first month of lab designing, content planning, getting approval, and creating SOP for club operations; (2) the second month of creating exercises and learning materials for lab activities, promotion and member selection, as well as preparation for other activities (i.e. seminar and hackathon); (3) the third to fifth month of lab equipment procurement (5 laptops. furniture, internet, projector, etc.), securing a VPS (virtual private server), hosting 3 seminars, organizing hackathon, etc. The roadmap has been laid out clearly for a 5 months target that will include building a lab, creating exercises and leaning materials, hosting 3 seminars and a hackathon, etc. that has its respective milestone as stated above. Regarding additional funding, the proposer stated that ideally the project would be fully or at least partially funded by the university. For the latter case, a part of the project may apply for funding in the next round. Based on these points, it shows that the proposer have a clear plan on executing this project  and how it’s going to be done. \nLastly, the proposer has also identified risks that will come while executing this plan. This includes, (1) equipment that will have to be maintained and replaced which will require reciprocal fee (will be requested to the university); (2) venue limitation, however the proposer claimed to have built trust with 2 universities (because of the success of past project in Fund7); (3) conflict with other faculty activities which will be adjusted accordingly; and (4) the steep learning curve of programming language. This proves that the proposer have a clear understanding of the risks involved and how to mitigate them. However, I feel like there was a missing point discussing the risk of not attracting enough students, which is really important for the club to run. The mitigation strategy itself (doing a promotion) was mentioned in the timeline and budgeting but there were no further explanation on what type of promotion as well as through what kind of platform/media it will be done.", "q1r": 4, "q2": "The performance metrics chosen to measure the success of this proposal are relevant to the targeted goals. For example, the number of developers involved with the club, number of proposal submitted to ideascale, as well as the number of seminar and hackathon participants. These metrics all have correlation with the measurement for success of this project which is the outreach the club has and the quality of works coming from students participating in this club. These performance metrics along with the documentation of the events will be published on their website (cardano2vn.io) and there will be monthly reports provided for the community through github (https://github.com/cardano2vn). I would like to add that the cardano2vn.io website is in Vietnamese so non-vietnamese speakers might have trouble navigating this website and checking the documentation for this project via said website. Other than that, the proposal has provided relevant metrics and way to track their progress so it will be transparent to the community.", "q2r": 4, "assessor": "z_assessor_3408", "no_vca": 14, "ne": 3, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 11926, "q0": "The proposal tries to develop an ecosystem for the students so they would be able to learn, ideate, and develop with Cardano. Encouraging them with funded ideas will motivate these innovative and agile-connected students to contribute even more with their fresh ideas. This plan is brought up by the proposal of having a Cardano Developer Club at University.\n\nThe proposers are experienced developers and lecturers. They have written a very clear plan on implementing their ideas, making the project is feasible to run smoothly on its implementation. They also had mitigated the potential risk very well. Should this plan implemented successfully, it will bring so much impact on collaborating students with fresh-idea along with experienced lecturer and developer, creating a very insightful ecosystem that will help Cardano to grow, starting from the University for a bigger area of impact.", "q0r": 5, "q1": "The proposal has contained a decently detailed timeline and milestones of implementation, in the mark of each months in the approximation of 6 months run time. The proposers has also explained the budget breakdown very thoroughly, included every required technical aspects and resources along with it, making each of them are very logical and feasible. Proposal has also provide a concise background, relevant skills and experience of their team member, along with a relevant link for each of the member that would enable community to verify their credibility.", "q1r": 5, "q2": "The proposal has already given a very concrete and measurable metrics summarized in 4 points. The KPI mentioned are accessible by the community through the project's own website and published report on monthly basis via Github. The goals for the project has also defined very well, for example they want to measure the number of contributing developers and the number of dApps released in the 6 months.", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 11732, "q0": "Developing an open club for Cardano developers in Universities will make a lot of sense, this will create an opportunity for lecturers and students who love blockchain to participate in building basic labs. , Advanced; organize other activities. Currently, IT students are the resources of developers, but they are lacking the environment to practice and experience on the Blockchain platform. In fact, the current situation of information technology and blockchain human resources is very limited, so this proposal is the right solution to create human resources for the future.\nAs I have experienced in a university environment, I also understand that what is experienced during the study process is very beneficial for the student's experience after they go to work. This proposal has opened up an opportunity for the students to have a more enjoyable and rewarding learning environment. However, I have not yet seen a proposal on how to approach and convince universities and have not provided criteria for choosing which schools are suitable for us to invest projects in. The group should come up with criteria for selecting schools that have the ability to build clubs and the student population in that school that has the potential for this project.\nThe team identified the obvious risks when forming this project and also had solutions to go along when those risks occurred.", "q0r": 5, "q1": "The proposed team showed the community a specific work schedule and identified a timeline for carrying out activities to complete this project. However, according to the plan created by the proposed team, I see that the team has not yet come up with a plan on how to approach the Universities that have agreed to build a developer club in that school. We should put this to work in the first month, make sure we find the right University, then the plans after that will be implemented. To do this job, it is necessary to make an appointment to meet the leader of the school and the students of that school in exchange to introduce them to the project.\nThe proposal has provided a detailed explanation of the budget for each specific job. Almost all the costs involved in the construction of this project were covered by the team which convinced the community that it was transparent.\nI believe that the community will fully trust the group of experts involved in this project that the proposal proposes. They specifically give us their personal information so that we can track and understand their abilities and skills.", "q1r": 4, "q2": "There is no doubt about the success of this project. Since the proposed team has already provided an indicator of the success of the project, it also provides KPIs and these numbers will be published on their website so that we can look up any when.\nIf successful cooperation with universities, this is a solid foundation for the club to operate sustainably. Since then more developers will experience this and this is an incubator for future dApps.", "q2r": 5, "assessor": "z_assessor_3273", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11447, "q0": "This is a practical proposal. The proposer wants to form club within universities in Vietnam for IT students, or anyone interested in to join this club, creating a favorable environment for learning, practicing and giving students important orientation for their future career development as a developer in the blockchain industry. I think, their solution is a very necessary, especially for students who need honest, precious advices and rich experience from teachers, pioneers in blockchain in Vietnam to know more about Catalyst, Cardano blockchain. Besides learning purpose, by participating in this club, students could have qualified relationships with the same passions and interests, from that, co-works on real projects in the future. In short, I think this is a good idea. ", "q0r": 5, "q1": "The feasibility of this proposal is high. The proposer will carry out this project for the next 6 months, I think their plan is detailed enough, I know what activities would be done for each month. I think, this is a feasible plan. To operate this club, it requires a lot of jobs and personnels. In their project's cost, I think the total required cost of $44,550 is reasonable. the proposer breaks down into each task, and calculates the cost based on the total hours, base pay in USD, total people needed for each task which is quite clear. Most importantly, I'm more convinced about this project as the core team involved in this project is all talented. They are IT lecturers from few universityies in Vietnam, and computer science experts in Cardano ecosystem. In short, I believe in the success of this proposal. ", "q1r": 5, "q2": "The auditability part is very good. The proposer provides a detailed KPIs after running this project with clear targeted numbers: 30 developers using Labs, 1800 hours lab, 100 developers join clubs,...Besides KPIs, event's photo and videos and other materials will be published on their official website (cardano2vn.io). Additionally, community could check their monthly reports on Github (github.com/cardano2vn), and measuring some key metrics: the total number of developers involved in club, the number of developers use labs, the number of proposals submitted to Ideascale,...Also, the proposer has a clear success outlook for their project after 6 month of implementation. After all, it is easy to keep track of the project's progress. ", "q2r": 5, "assessor": "z_assessor_3246", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 13814, "q0": "This proposal does effectively address the challenge of helping increase the developer Ecosystem of Cardano community. Is a certain proposal to address the key role and participation of Cardano developers. Especially in regards to the University student environment which is central in this working area. These University students will be the future dapps developers and will be the main force of the developers community in the future of Cardano. Long term planning is key for the cardano's development. \n", "q0r": 4, "q1": "Due to the experience and plan presented, the proposal aims to be successfully implemented. The team information is wide and detailed and taking in account the previous experience and success in previous proposal and foundation, these Vietnamese teams have everything to achieve their goals and bring the Cardano community a great opportunity of developing their Developer Ecosystem.", "q1r": 4, "q2": "Considering the presented measurement track this team will implement it is highly likely to be audited successfully in future auditions through its developing process. The team has already participated in previous funds and knows the standard process protocol for showing advance and progress through the objectives.  ", "q2r": 4, "assessor": "z_assessor_3833", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 10951, "q0": "This is a proposal that provides a solution to the problem of developer resources currently lacking an environment to practice and experience building dApps on the blockchain platform. This is an interesting idea as the Cardano ecosystem is currently a very academically focused blockchain in mainstream Universities. That is what makes Cardano stand out from other ecosystems on the market. So I think this proposal is appropriate. This proposal has a positive impact on sustainable development as well as the real values ​​that Cardano is bringing to society. It is a place that attracts talented and reputable people. Especially in the environment in Vietnam, the voice of lecturers at mainstream universities is highly valued. They have a strong academic background. I see this as a project that contributes to the sustainable development of Cardano. They pointed out the risks easily encountered in the implementation process. I appreciate this because it means that they have had serious calculations in the implementation process as well as relevant experience. In the risk section, they also gave reasonable solutions. And it will be even better if they have a solution for the cases that coincide with other faculty activities that can be organized and videotaped for students to review. The environment that provides a favorable experience for the developer contributes to the great success of the focus on creating successful applications. Plus the advantage of having a team of lecturers and deans with many years of specialized teaching experience. So I give the impact of this proposal 5 points.", "q0r": 5, "q1": "I think the feasibility of the proposal is very good. I appreciate their work broken down into month by month and tool files detailing the execution plan. The budget theme is viable and suitable for the venue. They work very well here is a list of groups that includes the full names of the members and very specific links. And it would be great if they let me know what each one will do and what responsibilities are in this project. Also, I appreciate that as I have seen from the recommended team member, they have very relevant professional experience and I appreciate that. These people have done very well in their previous plans for students. And I especially appreciate that they have a vision for a project that could be self-funded or partially funded by the College. Therefore, I give the feasibility of this proposal 5 points.", "q1r": 5, "q2": "Regarding the ability to self-audit, I give it 5 stars. Because they have very clear and detailed timelines. Especially the team that has a history of making good proposals before. I appreciate that they will update what they have done and where you have done it so that the community can easily follow and support them. So looking forward to proposals for funding.", "q2r": 5, "assessor": "z_assessor_3211", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 9320, "q0": "\"This suggestion is not new, but very useful. In Vietnam, the clubs are very developed and the students participate enthusiastically. So with this project I think there will be a lot of potential for development. In addition, the university campus is where people of the same age know each other, so it is easy to attract a large number of people's attention.\nTo develop an effective club, knowledge needs to be updated regularly, especially with the ever-evolving technology field. The project is a practical and effective idea right out of the box.\"", "q0r": 5, "q1": "Wow. I see your team working very well. You have a very detailed work plan, divided into specific milestones. Regarding your budget, in the proposal you have clearly analyzed the amount for each specific item, besides you also have a google sheet link about the budget. You guys work really hard. As for the members, I don't think it's necessary to discuss more about everyone's experience and capabilities. Hopefully the project will be implemented.", "q1r": 5, "q2": "I see in the proposal all the required criteria. You have a way to measure project progress by publishing on the website photos/videos of the event and monthly reports on github (https://github.com/cardano2vn) to the community. The KPIs you have pointed out are very complete. Besides, you also have clear goals of success. Overall this is a good proposition and a good project that is easy to implement in practice.", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 8678, "q0": "The main purpose of this project is closely linked with the key metric of this Challenge, which is to establish clubs in universities in Vietnam to provide a reference, practice and experience environment about Blockchain and Cardano for lecturers and students. With the quick assimilation and high level of interest in new technologies by lecturers and students, the target audience they are targeting is suitable to be able to exploit the potential of the project. The author also has an in-depth analysis of the inefficient state of Blockchain operations due to the lack of resources for the main audience of the project to prove the feasibility of this project. The way the Cardano developer club works is also clearly described, it is easy to see that these activities will support, encourage, and motivate potential developers to participate and focus on contributing contribute to the blockchain. However, more information is needed to clarify the entry criteria of club members to be able to make a rough assessment of the quality of work they will bring to Cardano in the future.", "q0r": 5, "q1": "The project development roadmap mainly focuses on establishing club facilities and organizing activities as committed. The plan is divided into several small phases that have facilitated the management and monitoring of project progress. The direction of the cash flow is described in great detail, the allocation items such as facilities and club activities are clearly noted with the purchase quantity and frequency of execution. Most of the people leading the project and the club have previous jobs and activities that are deeply linked with blockchain technology. Many of them are lecturers from universities, which will enable them to leverage their reputation to convince key project participants to actively participate in the club.", "q1r": 5, "q2": "A very carefully designed audit trail here, KPIs provided based on the project's input and output commitments provide an overview of the positive effects. which it will bring to Cardano. The author also took a long-term and in-depth look at the club's potential for growth and survival. Managing and tracking the progress of this project is not a challenge as information on reporting methods and tracking tools can be found here.", "q2r": 5, "assessor": "z_assessor_2996", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 8247, "q0": "\"The proposal was built to create the supporting environment for students (developers) to practice their knowledge and gain more experiences through information sharing opportunities or enhancement of motivation by contest… The proposer mentioned clearly about what they will do in the club. The detailed information about how much it contributes to the development of Cardano system and Catalyst platform will contribute more to the feasibility of the project. \nMetrics of the project and KPIs were mentioned in the proposal. This information is quite clear with both quantitative and qualitative data. With the clear imagination about what they need to achieve in terms of how students utilized the club to gain more knowledge through their participation, the proposal could get more trust from all readers. \nRisks were clarified by the proposer with some tentative idea to solve it. \n\"", "q0r": 5, "q1": "\"The roadmap of the project was prepared carefully, with detailed in what they are going to do in the project. However, it is better to include information about how they will do to complete each step. The good point of this roadmap is important work will be done parallelly to let all members worked easily. \nThe budget breakdown is prepared carefully in terms of dividing into activity payment based on hourly paid, and necessary assets for the club development. With the careful financial planning, all readers can believe about its transparency and accountability. \nTeam members including both professional people in Stake pool and lecturers at many universities. So, it helps the project become more feasible as well as these top people can support the club functioned well. It would be better if the proposer can include some information about the how the team allocation will be. \n\"", "q1r": 4, "q2": "\"The proposer already includes quantitative and qualitative data to ensure all stakeholders could feel easy and convenient to track the project progress and development. \nThe strong point of this proposal team is all expectations are clarified in both number and quality. So, the team already identify that reaching a certain amount of targets. In addition, they think about the future of the project in the next three more years as well. \nThe project is the new one in Catalyst in this round, with the intention of team to apply for next round funding, as well as the team worked with others project in this round as well. \n\"", "q2r": 5, "assessor": "z_assessor_2969", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7590, "q0": "The problem described in this proposal is closely aligned with the Cardano ecosystem .The team demonstrates experience, knowledge and interest in the issue at hand . The proposal has been able to identify the problem within the challenge which needs to be solved by providing a precise solution which aims to build the Cardano developer club in the university.The proposed solution intends to facilitate the activities of Vietnam students who are actively engaged in the various Blockchain technologies by providing the enabling environment and resources to promote the ecosystem.The proposal also provides key important metrics and goals by through the engagement of the participants in seminars and workshops where they can share their interest and experience with each other in building the dApps to attract more people into the ecosystem.The proposal again will be a able to bring out the potentials in the students through their organization of several hackathons events to encourage developers to do in-depth research to explore the dApps.\nI highly recommend that ,if the proposal is funded many dApps will be developed in the Cardano ecosystem and that will Increase the number of Cardano blockchain developers. \n", "q0r": 5, "q1": "The team has great experience in IT development and have worked on projects in relation to their expertise by providing the relevant links to the proposal . The information provided about the team is detailed which also shows that the team will be capable of implementing the proposal if Funded.The  proposal has also be closely designed with a busy schedules to ensure that the successful documentation of their project.\nMoreover, the team provides the milestones for 6months which provides a detailed content in the task activities in each month.This proposal seeks to have a long term goals in the future of Cardano.The proposal provides an outline of the budget which had been clearly broken down into identifiable bits,is really commendable with the timetable which has further been shared too showing the budget in a table form.The team has been to outline clearly all the resources needed for successful implementation of the proposal by so doing it has been able to describe the workload on the team and what is expected to obtain their goals.\nAgain, the proposal took into consideration the risk involved in the implementation of the proposal such as venue limitation which they have been able to build trust with the faculties to provide rooms for their events and also the issue of the equipments becoming obsolete over time and the need to be maintain and upgrade them . They have kept in measures to ask for a reciprocal fee from the university to help promote the Cardano developer Club in Uni.", "q1r": 5, "q2": "The proposer and team has provided detailed information on the successful implementation of the proposal.They have provided the milestones, information on how success will look like should they be funded by elaborating on milestones such training 30 developers using the labs in the first 6 months of the proposal by allocating 1800 hours on lab time in the first six months.\nThe proposal provides a clear progress of the proposal by uploading photos, videos and other materials to keep track by reporting to Cardano and GitHub.\nThere is clarity in the description of the problem,the solution is clearly aligned with the outcomes of the challenge .The team also did a great job by providing additional information on the project they worked on which helped in identifying the problem in Vietnam catalyst school.\nThe proposal has accessible public channels to help in the delivery of the updates to the Cardano community to make auditing easier.", "q2r": 4, "assessor": "z_assessor_2906", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7095, "q0": "I think this proposal would have a long-lasting impact. The proposer plans on creating a lab from scratch, from the equipment, recruiting the members, and designing the curriculum. The students will learn all the necessary knowledge to contribute to the Cardano ecosystem. The materials include an introduction to the programming languages for building in Cardano, dApps development, and even Project Catalyst so the students could submit their newfound ideas and their technical skills to get funding. The first students who completed the six months of the proposer labs could be the next pioneer as they are well equipped, and they could guide the next batch of students. Therefore, I strongly agree that the proposal would significantly contribute to the availability of future Cardano developers.", "q0r": 5, "q1": "The proposer has ticked all the boxes that reflect a clear plan; thus, I am confident there would be no significant hindrance when it comes to implementation. The proposer has listed their profiles: experienced lecturers and computer science experts. I applaud the proposer's initiatives to list the potential risks, for example, the unfamiliarity of Haskell for students and solutions to tackle them. The requested budget has been recorded through the sheets link provided; the amount is reasonable, and the items are all suitable for implementation. However, it isn’t clear how the proposer plans to bring the students onboard. I am sure the proposer already has plans for that marketing aspect. Still, as presented, it leaves room for ambiguity, which is unfortunate because everything else is already incredibly planned. That being said, I still believe the whole execution from start to finish would be very smooth with a detailed plan.", "q1r": 5, "q2": "The proposer chooses suitable metrics that reflect the success of the proposal. They target 30 developers who regularly visit the lab and release ten dApps in the six implementation months. The proposer expects the lab to stay afloat for at least three years. Regarding tracking the progress, they would give monthly updates through their Github and final report through their website. I have to mention the current website is only in Vietnamese; thus, we have to translate it. It will be excellent if the proposer adds support for English, so the translation is unnecessary. In the end, it is a minor thing that could be improved; as of now, the proposal is easy to measure and keep track of.", "q2r": 5, "assessor": "z_assessor_2878", "no_vca": 11, "ne": 1, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 4355, "q0": "The theme of this Challenge is the developer ecosystem. The team made a proposal that is tied to the goal set in the Challenge. And the team determined that the problem that needed to be solved was the lack of development resources for IT students. I think this is a problem that exists in many places, not only in Vietnam, the development of information technology (related to Cardano blockchain) for young people is very important in the development of the country and the Cardano ecosystem. If this proposal is resolved, it opens the door for students to enhance their practice in a technology environment while increasing their knowledge and this proposition will add value to the Cardano ecosystem. I completely agree and endorse the impact of the proposal. Even in the long run, the proposal team can scale to address future challenges. The proposal is well written, consistent from start to finish, and well reasoned. Because, in the current era, information technology is a good tool for world economic growth and national development. If successfully funded and applied, I believe this will be a premise to continue to develop Cardano projects among students. I vote 5 stars.", "q0r": 5, "q1": "About the feasibility of the proposal. First, I noticed that the team consists of people who have a lot of experience in the field of information technology activities, some people are experts, university lecturers... well qualified. This has built trust in the community. Moreover, all members publish their identities and photos through documents (videos), and social networks (Linkedin). With the number of members of the team being 9 people (not to mention collaborators), I fully believe in the feasibility through the human resources the team already has. In terms of budget, detailed per task and timeline. Even the smallest jobs were mentioned with the corresponding amount. We all know that publicizing the budget is one of the most important factors to prove the feasibility of the proposal. I see the team has done this. The plan and implementation method were very clear and methodical. However, I have a small idea to contribute: Can the team explain in more depth the technical aspects of the shelf technology applied when implementing the proposal? Currently, the only purpose of the proposal is to target students using the Cardano blockchain. If I do a little more technical analysis of technology, I find that this proposal is quite feasible. The risk and challenge aspects of the proposal listed by the team are reasonable. I want to talk about the government side, will the government and university leaders allow to freely implement this proposal? As I understand it, the Cardano blockchain and related things are not yet considered a mainstream subject taught in universities. Those are the ideas I want to contribute to increasing the feasibility of the proposal. All in all, I'm very impressed with the feasibility you've outlined.\n", "q1r": 4, "q2": "What impressed me most when reading the proposal was the roadmap and milestones the team had set. It is very specific and detailed in chronological order with clear parts spread throughout the process. I know that the team has implemented a part of the work at universities before writing this proposal (considering the project was initially successfully built at the university). In my opinion, this is an important premise for the team to continue implementing the next steps). Along with that are the KPI index and the criteria for evaluating the success of the project. I am very pleased that the team has divided these two parts (in some of the proposals of other teams, they combined). From the outset, the problem was clearly described and understood. Measured risk challenges are also addressed by the team. Auditability and transparency are both confirmed. I wish other proposals from old Vietnam did as well as this one. I am confident that this idea, this proposal will be funded by Catalyst. I vote 5 stars.\n", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 2790, "q0": "\" the proposed group itself is the faculty of the university dean of information technology, the sponsored developer, the SPO and the eastern town hall moderators. after the cooperation realized the limitations about how to approach the Cardano platform when the human resources of universities are abundant, so the proposed team provided a solution to meet the requirement that the challenge is: to shorten the gap between human resources at universities and the Cardano ecosystem.\n  The main difficulties that university human resources are facing, especially in information technology majors are: lack of available testing environment for applications, few members know about funding rounds of the university. Catalyst to turn ideas into products for the ecosystem. but mainly they still use the traditional way of applying for funding. very difficult for the budget to implement the idea.\n  to thoroughly overcome these limitations and at the same time promote the growth of talented developers in the future they will contribute great ideas, once they have a knowledge base in information technology . The proposal announced the creation of a club community at universities that organize labs (nodes on test-net, nodes on main-net, Plutus playground...), specifically to encourage The incentive for future developers is to create mini-games that encourage the creation of ideas.\n  * with this proposed method accidentally went in the right direction of IOHK CEO Chales Hoskinson. he also brought documents related to the Cardano platform to prestigious universities for them to study and test. great for this idea. and in the same way what has greatly impacted the growth of developers is introducing the target audience to the Catalyst ecosystem and the funding program for their great ideas.\n  There are four main possible risks that the proposed team has foreseen and also has taken measures to prevent it from happening. perfect you will have one vote for my funding round. \"", "q0r": 5, "q1": "\"the proposal claims to have 6 months to implement and complete this idea with milestones divided by month in milestones there are a lot of sub-goals in general very specific and relevant to accomplishing the milestones suggest.\n  I agree with the presentation of the detailed budget table of the proposal, it must have taken a lot of time for the team to make this presentation to have a detailed table like this and it is also reasonable with the general level of the market. school.\n  your team is experienced and mainly university lecturers from many disciplines but mostly information technology and computers. The links to each member's social networking site are also provided in great detail. However, in order to achieve the highest feasibility, the team needs to assign specific work to each member to match the assigned tasks with the members' personal experience, for example: who will be in charge of Development Practices dApp, Integration with web/mobile platform. who is going to do the Laboratory Furnishings.\"", "q1r": 4, "q2": "\"all KPIs provided by the proposal will be provided by the proposal team on the proposal's website as a commitment of the team. Also the team promises to have a monthly report on github for the community to follow. Whether the club's activities ensure quality or not.\n  The number of developers of the future Dapps formed from the club of the proposal will speak to the success of this project. \"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 2064, "q0": "I think this proposal is very useful and certainly achieves the goal of the challenge as it aims to build an open club for Cardano developers at Universities creating an environment for Instructors and Students interested in blockchain can participate in building basic, advanced labs, organize hackathons and other activities. This proposal is made because currently IT students - developer resources are currently lacking an environment to practice and experience building dApps on the blockchain platform. This directly affects what we are looking for in the challenge because creating such an environment will motivate developers and allow them to focus on creating successful applications in the future. Some risky challenges are mentioned and the author also has safe methods to overcome them. This proves that the author is ready to successfully implement this project.", "q0r": 5, "q1": "The feasibility of this project is amazing, we have a lot of information about the roadmap, budget as well as the project team. First, about the roadmap, we know the project will last 6 months and know very well what will happen each month. The activities involved are very specific and we know exactly what to do next. That is, our visualization of the process is pretty solid. Next on budget, this section is also very well presented. The proposal asks for $44,550, we know how the total will be split, and the requested budget also matches the timeline of the proposed roadmap very well. So my conclusion is that the budget is appropriate, well thought out, and realistic with the relevant details for the successful implementation of the proposal. And finally, about the project team, 9 people in all are described. We know their names, areas of activity as well as the experience of members. Their affiliated profiles (LinkedIn, telegram, Twitter...) are also provided so that all information provided is accurate and verifiable, and we might as well know more directly what they've done so far. 2 out of 9 members are active members of Catalyst, and have contributed a lot of ideas to develop our ecosystem. Based on the above information, the team's confidence was completely strengthened. Therefore, the feasibility of this project is perfect.", "q1r": 5, "q2": "The team provides us with good data to use to evaluate the proposal. Regarding the roadmap, we know the phases of the project, with corresponding tasks on what will happen in each phase. In this way, we are provided with information about what will happen and when, so it is very possible to track whether the promised operations are carried out. Several metrics to measure success and KPIs are provided, which can be easily tracked. The project's suitability is also very transparent, all activities will be published on their website cardano2vn.io and the team will also provide a monthly report on Github (https://github.com). /cardano2vn) for the community.\nAbout the successful presentation of the project. The team identified four successes after 6 months of implementation. Each success is very clearly described as stated in the proposal and has specific results to be achieved: About 30 developers use the lab regularly for 6 months, and at least 10 dApps are released in 6 months... I see success closely related to the challenges of the campaign. The project is very well established, I highly appreciate this project, and hope to receive a lot of support from the community so that the project can be approved and put into practice soon.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 12, "ne": 2, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 1203, "q0": "In Vietnam, learning is heavily theoretical, without clubs or laboratories for students to practice and improve their skills before graduation. This is the cause of the shortage of high-quality human resources in technology, which recruitment businesses are in dire need of. The proposal to build a club for technology students to access and develop applications on cardano goes right with this trend and is a necessity to change the new way of teaching and learning for students in Vietnam. The source of talented students in Vietnam is also abundant, so this is the best way to promote cardano in Vietnam and help promote the creation of more cardano application developers in the future.", "q0r": 5, "q1": "Roadmap develops student club on blockchain technology at their universities built in 6 months. The tasks are written carefully, full of information and convincing me. They will focus mainly on preparing equipment and rooms where technology club students live. Next is to prepare documents and organize discussions and share knowledge shared by lecturers at those universities. And students get to practice practical exercises on writing applications on blockchain. They will also organize hackathons to promote creativity for students. The cost for the project is also listed in detail for each item. Personal profiles of 9 team members are public, experienced enough. This shows their serious investment in this project and their willingness to execute the project.", "q1r": 5, "q2": "They already have a website and github page for detailed reports on work progress. (cardano2vn.io, https://github.com/cardano2vn). These are 2 popular reporting tools and very convenient to track. They also have very clear KPIs that set goals for the project in terms of developers, number of members, number of seminars, short courses, hackathons for students...\nIn addition, they propose very clearly the criteria that they commit to statistics and include in the monthly report. And they also have a long-term proposal to maintain support for these clubs for about 3 years - long enough to give the club a certain influence in universities. I hope their project will receive votes from the community, because I see that this project has really been well prepared both in terms of people and work plan, as well as commitments on progress reports. work.", "q2r": 5, "assessor": "z_assessor_2217", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 10268, "q0": "I agree with your arguments and evidence about the lack of a practice environment and experience sharing about Cardano and Blockchain in the Vietnamese student community. I appreciate your ideas about building a club for students at universities. Students are enthusiastic and full of ideas, and are also the main force that will deploy and use Blockchain in the future. For any technology company, the R&D department is always an extremely important part, helping to improve and upgrade product value. Similar to the Cardano ecosystem, we need to nurture and create conditions for the community to have an environment to share experiences and grow. The proposal was very suitable for the challenge, however, one thing I need to point out is that there were many similar proposals in different forms, for example the project “Catalyst Events 4 Vietnam Students”. The author needs to specify more clearly what is most unique about your proposal, this will help Voters have more confidence when voting.", "q0r": 4, "q1": "From the success of the project \"Catalyst Events 4 Vietnam Students\", it is very important that you have the trust and support from the universities, I think you will successfully implement this project. The team is very experienced in relation to the development of this project, and all the background information of the team members is provided very clearly. I agree with you about the difficulties and risks as you have listed, I would like you to explain more how to connect between your club and other organizations and agencies to resolve conflicts and Support each other when the project is Funded. What is the mechanism to promote initiative in the club? What is the mechanism to attract qualified and qualified people to join the club? How to connect the club with the business community to apply and popularize Blockchain Cardano. In addition, I would like you to provide more detail on what the working days of the people involved in these jobs will be, how many days a week they will work, and for how many hours a day. ? Will the Cardano community have access to the drafts of these stages?", "q1r": 4, "q2": "The authors have shown how the community can audit the implementation of the proposal by measuring the number of participants in the club, the number of developers and proposals… This shows that the working group is ready to go public. Declaring work information so that the community can easily check the results. However, the author should systematize this information on an official website with enough pictures and videos of the activities like many projects have done. This helps the team work closely with the community and easily receive support.", "q2r": 4, "assessor": "z_assessor_3170", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 14457, "q0": "The proposal caters for IT students in university who now lack the necessary resources by opening a Cardano developer club. This club will grant blockchain enthusiasts the access to advanced labs and blockchain development. According to the “detailed data” that the proposer gives, the number of blockchain developers is inadequate. Several problems that deter students from Cardano blockchain are given, most notably the lack of testing environment and lack of understanding about the Catalyst funding system. From this, the proposer opens a Cardano developer club that will address these problems. In this club, students will have access to the Cardano labs with necessary resources (nodes on test-net, main-net,...). Students will also have teammates to exchange ideas and hackathon events will be organized for students to do research. This has an encouraging impact on students who are blockchain enthusiasts. In this proposal, the proposer is able to highlight the educational (lectures) and practical (multi-labs,..) support that the club provides to students. Not only will this invite more students to onboard Cardano but it could also facilitate more innovative ideas from students once they are given the tools to realize those ideas (such as the Catalyst funding system). It also shows that the target market where this club will be taking place is universities in Vietnam. Therefore, the proposer should give some background information about the local context. The proposer should specify what universities the proposer plans to form partnerships with and how IT students in Vietnam will perceive this club. The potential of the blockchain community and IT students in Vietnam should also be briefly discussed to give more conviction about the efficacy of the club and their potential contribution to the Cardano and Catalyst community. The main risks are well-identified, showing the consideration that the proposer gives to the development of this club. Mitigating measures are also given to address these risks.", "q0r": 4, "q1": "The timeline follows a six-month plan, with clear activities divided for each month. The first three months are dedicated to preparation (lab design, universities’ approval, lab exercises,..). From the 4th month, dApp will be built and seminars will be organized. At the end of the 6th month, a project completion report will be given, which is good for tracking and reporting. The timeline is clear and detailed. The proposal also includes how the team will handle workloads with specific listings of the activities that will be taken. This demonstrates the caution and well-preparedness of the whole team. The budget breakdown is given in the form of a google spreadsheet, which is really clear as to where each expense will go. There are 23 items that will accumulate to the overall budget, all of which are specified with a clear amount of money. The money is calculated depending on the base pay per hour per person. It is also specified during which month these items will need funding, so the 23 items are organized in a chronological progression. A little suggestion is that project management and marketing budget can be more elaborate. For instance, for marketing budget, the proposer could brief through some promotion methods they intend to use (Facebook posts, workshops, billboard). The team members are well-grounded in Computer Science and IT, some of which are Dean and Faculty members from University of Transportation and Communications and Nguyen Trai University. The relevant experiences and credentials of the team members are highly suitable for this proposal as they have many connections with universities and have experiences in technology and lecturing.", "q1r": 5, "q2": "The auditability is also good as the key metrics are quantifiable and abundant. KPIs are given with clear goals and figures to achieve. Community audit is also viable as reports will be uploaded on github and recordings of the event will be posted on their website. The vision of success is well-aligned with the challenge. The figures (1800 hours, 30 developers, 6 months,...) are helpful in tracking the progress and growth of the proposal.", "q2r": 5, "assessor": "z_assessor_4055", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "We aim to build an open club for Cardano developers at University. Lecturers and students who love blockchain can participate in building basic, advanced labs, organize hackathons and other activities", "experience": "We are Lecturers, Deans with many years of experience in teaching and writing specialized IT textbooks. Understand the process of creating and publishing textbooks in Universities. We are also full-stack developers, funded proposers, SPOs, and Eastern Townhall moderators."}