{"id": 416112, "author": "seirayun", "title": "Decentralized Escrow for Remote Job", "url": "https://cardano.ideascale.com/a/dtd/416112-48088", "category": 26597, "amount": 54400, "description": "Direct contracts between employers and remote developers may lead to disputes. However, centralized escrow services can be expensive and their decisions may be arbitrary. 日本語", "f6_no_assessments": 5, "f6_rating": 4.933333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 3052, "q0": "Socious's solution is to create 1 Dapps for devs, Socious will help the process of implementing decentralized work (Deeds system), ensure payment, dispute through escrow into Cardano smart contract .\nA great proposal can motivate and connect Devs with organizations, businesses or individuals. Devs participate\nSoucious's ecosystem will also be mandatory or more accessible to Cardano (smart contract, enterprise ecosystem, community of Cardano).\nThe proposal also describes its decentralized model through the Deed system of the soucious platform. However I think the solution would be perfect if we add some details like this:\n1- The system of Deed certificate holders participating in the administration of the smart contract execution process is 3 people. My suggestion is to need at least 5 people, according to consensus models\nClassic like BFT, only 3 nodes are needed to create consensus. However, at the present time, to ensure decentralization, it is recommended to build a model with 5 participants.\n2- It is very complicated to build contracts that do real life jobs. The same proposal outlines the risks and solutions to this problem.\nIn my opinion, in order to minimize the risk, the proposer should give the scope to build different types of contracts at this stage in simple contracts such as project contracts under work packages, project contract delivery and 1 time payment etc. After experimentation and experience, proceed to build more complex contracts.\nIf the proposal can complete the risks like I mentioned above, it will create a great impact for the dev ecosystem because the proposal is developed on a decentralized social networking platform and is available in the community. ", "q0r": 4, "q1": "The implementation plan of the proposal is very detailed, the work items are divided into monthly units and there are details for each month. The proposer also calculates and provides a backup deployment plan in case of delays. The level of care is also increased when the proposer also lists technical aspects (architecture, language, technology). My suggestion for the proposal's implementation plan is that the proponent add weekly timelines to the blueprint, which is actually completely self-calculating when comparing budget allocations of the proposal. However, to shorten the time for the community and voter, adding details like I mentioned above will help the community more.\nThe proposal implementation team is the Socious platform development team, in the proposal to list 4 main members and check in the website, there are more than 15 members with enough experience in all fields to be able to complete the project. export. The proposer also presented the feasibility when in this fund 9 there are also other proposals submitted by the proposer.\nThe fund allocation is very detailed with the amount allocated for each workload matching the detailed deployment plan. And I consider the proposed number to be completely reasonable.", "q1r": 5, "q2": "Sources for tracking and auditing the progress of the proposal include checking out the code on the proposer's github, directly participating in product testing, and video tutorials of the proposal. Very complete to be able to perform the proposed progress traching. In addition, the proponent also provided 1 KPI with a specific commitment number on the number of participants, the number of jobs, the transaction value... This is also a measure to evaluate the level. What will the success of the project look like? 1 figure in my opinion is challenging but also very impressive, showing the seriousness of the team implementing the proposal. If this project is successful, it will be a Dapp that creates efficiency, transparency and has a great impact on the community.", "q2r": 5, "assessor": "z_assessor_2394", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4634, "q0": "This is a very good idea. The proposal is a decentralized escrow solution to protect remote developers and recruiting organizations with low fees and fair and decentralized dispute resolution. This idea has an impact on motivating more developers to develop projects on Cardano because it solves the problem of payment disputes. Freelance developers are protected by an escrow system. This helps create a positive experience for freelance developers as well as recruiting organizations. If this project is successful, it will help increase the number of developers actively participating in the Cardano ecosystem. This proposal addresses the challenge posed by creating a positive developer experience that helps developers focus on building successful apps. Therefore this proposal has the right impact to grow the developer community on Cardano.", "q0r": 5, "q1": "The proposal is highly feasible for the following reasons:\nFirstly, about the plan, the implementation plan will take place in 3 months and monitor and evaluate the project results in 3 months after starting. The implementation roadmap is clear, and the specific timelines and the tasks performed each month are listed in detail. Throughout the plan can be seen the careful and thorough work of the development team through market research, process optimization, implementation, testing, and improvement.\nSecond, about the budget, the cost items are listed in detail, corresponding to each work item outlined in the plan with the hourly unit price. A detailed budget sheet helps the development team effectively manage the funding received from Catalyst.\nThird, about the project development team, members are experienced and have good professional knowledge, prestige, and wide relationship in society. All members have attached a link to check the experience in accordance with the project development content.", "q1r": 5, "q2": "The proposal outlines key indicators and KPIs to measure the project's progress line. All of the quantitative metrics match the project in the pilot phase. In addition, the proposer provides evidence to prove the completion of the project. Catalyst and the community can track project progress metrics through monthly progress reports, Trello, and GitHub. Therefore, it can be said that the proposal is highly transparent.", "q2r": 5, "assessor": "z_assessor_2578", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6010, "q0": "The idea behind this proposal is to build a decentralized escrow protocol Socious. This will be a platform to unite remote developers and hiring organizations in signing employment agreements. The burning problem that is facing today is the disputes between the two parties when performing the contract such as: not paying the employee's salary on time, the employee does not complete the assigned work, disputes over around the issue of payment, bonus if the employee completes the job excellently, so the idea of ​​​​implementing the implementation of a smart contract, it will help bind the parties and when both parties are satisfied conditions, the contract is executed. This brings great benefits:\nFirstly, on the part of employees (ie remote developers): payroll issues will be done on schedule and in full. Thereby helping to motivate developers to reach their full potential, improving work efficiency on platforms that match their preferences.\nSecond on the employer side: reduce costs to a low level because now there will be no longer having to pay user fees to third-party companies. In addition, minimizing unnecessary disputes with freelancers.\nConclusion: Through the platform, the promotion of the development of remote programmers (freelancers) will increase more and more. Create a great experience for developers to build successful products on the Cardano ecosystem, and contribute more Dapp building proposals to Catalyst.", "q0r": 5, "q1": "I strongly agree with the information that the proposer has provided us. The roadmap for implementation is within 3 months from the time of funding. The work to be done has been clearly presented in 3 months. In this case, the proposal team clearly understands the work to be done so that the proposed team has a plan to follow the set schedule. The funding cost is also listed very clearly and in detail for each work item, we have a budget table here that fully shows each type of work (like development, UX/UI design, Technical and Market analysis, etc.)\nMembers are experienced and competent in their positions. Having a team of programmers with 9 years of experience or more, who have made active contributions to the blockchain space.", "q1r": 5, "q2": "Auditability is great with the information that the proposer gives us. We know who each project team member is, what their experience is like, their area of expertise of their subject. That is, the proposer has clearly provided us with this information and attached a link to the profile page (LinkedIn) for the community to verify.\nWe have specific numbers to measure the progress of the project. I agree with the metrics the team gives us, such as the number of freelancers finding work; the number of organizations that find freelancers through the platform; number of hours worked by the freelancer.", "q2r": 5, "assessor": "z_assessor_2771", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 14008, "q0": "I appreciate the practicality of the proposal since it addresses the problem about the disputes between employers and remote developers. That conflict may be the postponement in salary payment, the quality of the product is not ensured, or extra-working hours but no more commission. Then there are centralized escrow services that are provided to guarantee/minimize those conflicts, but the centralized escrow services offer an expensive cost to charge, so that decentralized escrow, Socious, is the solution for it. There would be a constraint for both employers and developers since all the conditions must be met, the contract would be activated through the smart contracts which are provided in this service. This would enhance the motivation for freelancers to take jobs and release the employers from worrying their targeted products are not met. If the proposal is successful, it would promote the development of those remote developers and create a terrific experience and motivate developers to build, create or contribute more useful, diversified products to Cardano’s ecosystem.", "q0r": 5, "q1": "The proposal is undertaken by various experienced experts who are described as having more than 9-year experience and above like Jayson Ilagan, a talented senior developer, or Cristhian Tejada - expert in blockchain developing. The budgeted plan has been shown in a detailed statistical table which provided us all essential factors to understand how these costs are computed. The 3-month roadmap has been presented specifically. Thus, I have compliments rather than any suggestion for such a perfect description of feasibility. ", "q1r": 5, "q2": "The proposer has provided all related information about the human resource with attached link to each member’s profile (mostly via Linkedin). Moreover, this estimated number of achieved targets after 3 months will assist everyone to keep track of the progress as well as evaluate the practicality and the possibility of the projects. For example, there would be 2000 freelancers who found work through the platform or 500 organizations that found freelancers via the platform. We can imagine the expectation of the team on this time proposal. I like the specific goal in the description and how the success is defined by the team. To build a platform provides protecting rights for both employers and freelancers and also protection for freelance work. This is such a tremendous proposal, especially for those freelancers who need to be protected like me.", "q2r": 5, "assessor": "z_assessor_3870", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14552, "q0": "This is a very well written and well-organized description of the proposed solution of the Socious team. The proposal presents a decentralized escrow for remote jobs. Its working mechanism is explained clearly. Its striking features sound attractive enough to freelance engineers and hiring organizations (decentralized decision-making, automated payment and lower fees). I’m especially impressed with the decentralized decision-making feature of this project. As stated in the proposal, only the users who have an impact score above 700 are issued the verifiable credentials. The impact scores are thoroughly calculated to ensure the fairness of the provision of verifiable credentials. Thanks to this, the voting power is only in the hands of the related and experienced. In this way, Socious is expected to solve the existing problems of centralized platforms like Upwork, where the decision making power is manipulated by the platform only. Therefore, the decentralized escrow system contributes to bringing better and more secure working conditions for the related parties when they work on blockchain projects on the Cardano network. With the ability to attract more developers to the Cardano ecosystem, it matches the challenge well. It would be even greater if the proposal adds some key metrics to measure the impacts of their project. The proposal mentions three risks that the team may have to face when conducting the project and suggests a solution for each, which I find quite seasonable. All in all, I strongly agree with the Impact session of the proposal. Rating of 5.", "q0r": 5, "q1": "Regarding the feasibility evaluation of the proposal, I believe the team has done an awesome job. The roadmap of the project is well-prepared. There are also four expected deliverables which can make the auditing process easier. The budget is broken down into details which are very clear and transparent. Speaking of the skills and experience of the team members, the proposal has such an excellent description. The name, location, position and a short bio of each member are all provided together with their LinkedIn profile as the firm evidence for their competence as described. The Socious team has done a great job so far, and they are now on their way to achieve their goal of becoming a decentralized autonomous organization (DAO) by 2026. This escrow project is part of their Socious community. I do believe this professional and experienced team is more than capable to run the project efficiently. Rating of 5.", "q1r": 5, "q2": "The team has provided excellent descriptions of the components of their project auditability. They clearly explain the four clear deliverables that will act as proof of completion. Their five key metrics/ KPIs until 2023 March for this project are very well-organized and transparent.  Thanks to these specific figures, this escrow project can be easily audited. Once the escrow system is completed, it will benefit its users by protecting their freelance work and allowing them to submit complaints for decentralized dispute settlement. What is more wonderful than being protected and listened to when doing freelance work? I find this another great point of the project. Rating of 5", "q2r": 5, "assessor": "z_assessor_4072", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Decentralized escrow to protect both remote developers and hiring organizations with cheaper fees and a fair/decentralized dispute settlement mechanism.", "experience": "Socious is a fast-growing impact community with 1,000 MAU, supported by 500Global and Microsoft. The team has extensive experience in the impact sector and is comprised of experts in impact measurement, finance, data science, and blockchain development."}