{"id": 417091, "author": "sbpabon", "title": "GIMBALABS TREASURY FOR TUTORS", "url": "https://cardano.ideascale.com/a/dtd/417091-48088", "category": 26597, "amount": 8640, "description": "Members of Gimbalabs are offering mentoring services to new students without financial recognition for their hours of work.  ", "f6_no_assessments": 8, "f6_rating": 4.624999999999999, "videos": [], "media": [], "f6_assessments": [{"id": 951, "q0": "“There are many resources for learning about Cardano and how to become a Plutus developer”, is a phrase I wish I could say, but the truth is we have a long way to go until that becomes a reality. Building a strong foundation for developer training is especially important because of Cardano’s eUTxo model and Haskell-based programming make it pretty unique in the blockchain world and daunting for most developers who don't want to necessarily leave their comfort zone. Honestly even among the few developers that we have, I only know of one who doesn’t find Plutus difficult. So it’s very important that the developers that are willing to sacrifice their time and put their skills at work teaching other developers are acknowledged and properly compensated.\n\nThis proposal is addressing the Developer Ecosystem challenge head-on by looking to offer developers support through education.\n\nI haven't been to any of the Gimbalabs sessions personally, but it seems like people who have are very satisfied. I also see that they're developing new techniques and generating high-quality educational content for Cardano-related topics, such as Plutus, regularly. That’s why I think that this proposal, looking to fund tutor hours for the Gimbalabs educators, would be a very good investment for the Cardano treasury.\n\nMake no mistake by providing tutoring, they are sacrificing, at least financially, by volunteering their time. Plutus developers are very in demand at the moment, and the hourly rates are multiple times higher than the one quoted for tutoring in this proposal.\n\nOn top of this, the proposal itself is very well written and makes a very good case for why it fits so well in the Developer Ecosystem challenge.\n\nIf we want Cardano to succeed in gaining market share it’s crucial that we build a strong support network for developers, providing them with guidance and practical advice on how they can succeed working on our blockchain.\n\nI'm writing this assessment based on my experience as part of the Catalyst community since February 2021 and my engagement with the Cardano development communities since March 2021. I also have experience working directly with  Cardano developers since July 2021.", "q0r": 5, "q1": "The implementation plan presented makes a lot of sense in the context of this educational project. The team plans to offer 2-hour tutoring sessions, 6 times per week for three months.\nThe detailed budget is also very easy to follow by simply multiplying the resulting 96 hours per month by an hourly rate of $30 for 3 months.\n\nOne sidetone here, given that the Catalyst funding schedule has now moved to 4 months per fund instead of 3, I wonder if having planned for 3 months is an oversight on behalf of the team or if they plan to offer the tutoring sessions for 3 months only.\n\nAs mentioned before the $30/hour rate is extremely reasonable given the value of the service provided and I view it more as a symbolic rate, given the current industry rates for Plutus developers.\n\nEven though no exact names are provided in the proposal, as the Gimbalabs team plans to work with a bounty system for their tutoring sessions, the core Gimbalabs team have proven to be very solid over the past, at least a year and a half, and I have no doubt that the project as a whole will be successfully implemented.\n\nFund 9 saw the introduction of two new workload questions, one for previously funded proposals and one for proposals/projects submitted in Fund 9. In the case of this proposal, both are answered “Yes”.  But, no details are provided in the main feasibility section as requested when submitting the proposal. I won't deduct any points from my rating for this, as the questions are new to Fund 9, but I do recommend that the team include these details on future submissions.", "q1r": 5, "q2": "The accountability plan and the bounty system for tutors presented by the Gimbalabs team make a lot of sense in the context of this proposal and will offer the community the data it needs to track the implementation of this proposal.\n\nThe KPIs described in the proposal and the definitions of success also revolve around the bounty system and the number of tutoring sessions provided - very simple and clear, in line with the proposal as a whole.\n\nGiven Gimbalabs very visible presence in the community, the deliverables and results of this proposal will most likely make themselves known without the need for an actual auditinf process.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3535, "q0": "Gimbalabs are one of the big builders in cardano. This proposal would help many students by providing tutors to learn from. Currently there aren't enough tutors good enough to accomodate all people that want to learn, but if they were to have a monetary incentive as they deserve, they'd possibly be able to spend more time on tutoring. This proposal will add value to the ecosystem no doubt, because it's going to greatly speed up the process of generating developers that are capable and can hit the grownd running once they start working on any cardano project. Learning by doing is the best way to learn, but if you have someone to learn from on top of that, the sky is the limit. Keep in mind not everybody wants to teach so it's important to keep and motivate the people that do.\nThe offered challenges and key metrics seem reasonable to me as a developer and IMHO the proposers hit the nail on the head with it. Attracting more developers is a crucial part of evolving the ecosystem. The proposers know the risks better than anyone and if money is the only problem, there's an easy solution. When we have lack of tutors and we do have the funds, that would be a real problem so we can easily fix this one.\nOverall this is and will continue to be an impactfull effort and we as a community should keep supporting it IMHO as a dev, but that's just my oppinion.\n", "q0r": 5, "q1": "The provided plan is separated by months giving an overvew of the session times and duration of each session. The roadmap seems reasonable and would provide the necessary time to teach more students. The budget breakdown is the standard one $/hr provided and the necessary time to be spent provided so it's as clear as can be. On top of that I think they're selling themselves short because tutolige should be more expensive than 30$/hr so I'd say this cost per value ratio is a bargain.\nI have checked and verified the gimbalabs team members many times for the past 4 funds so I had no problem verifying the team and can say with certainty they have the necessary knowhow to make this project happen. There are not that many technical details to speak of for this particular proposal so nothing to dig in there. The necessary tutors are known and are able and willing to work so seems like all that's left is the small funding for them to do so.\nAs an assessor that has seen 170+ proposals let me say this cost / value ratio is one of the best ones considering what a small part of the whole budget it is. Overall this is as straightforward and valuable of a proposal as they come. It's definitely feasible.\n", "q1r": 5, "q2": "There are so many channels where people can learn and the linked site gives regular updates on the progress of the past and current proposals funded that I see no issue whatsoever with the auditability of the project. The community is comming together and evolving by learning and teaching and making a streamline of developers.\nThere's a clear and understandable problem - need more tutors, that has a prompt and definite solution to provide tutors and capable people to help along with the organization. There's an already established process on top of that, so this is happening.\nOverall this is an auditable solution \n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 14, "ne": 3, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 5540, "q0": "The idea is brilliant. The problem described in the proposal addresses the challenge. Creating a treasury funded by catalyst to cover the tutors’ working hours of Gimbalabs (a non-profit organization) is not of benefit to only the tutors and students but to cardano ecosystem as a whole. However, the proposal appears to be more of a non-app innovation rather than building an app.  The scalability potential of the proposal is very high because I believe it’s flexibility and can be made to fit into other challenges in the long run. The proposer has indicated that the sustainability of the project would be that the team would have return in later project catalyst funds to secure funds for its operation.\nThe proposal I must say is impactful.", "q0r": 4, "q1": "With the information provided about the team’s relevant experience and considering the relevant links and video attachment I am confident that the team is well equipped to implement the project. There is clarity in the information and details of the team, however it would have been best to outline some members from the organization that will be active in executing the project. The budget is well outlined. I appreciate the fact that the budget cost has been broken down as monthly cost for three (3) months. The budget is also reasonable to achieve the set goals. It’s a good effort that the proposer has foreseen the possible risks/challenges that may arise during the implementation of the project.", "q1r": 4, "q2": "The roadmap presented is detailed with clear milestones and time horizon. The KPIs stated are geared towards measuring the number of tutoring hours and budget spent per month, they are however not exhaustive. It would have been good if the proposer had measured the number of student developers to be realized at the end of the project implementation. For the problem described, there is clarity and also the solution. The proposed solution of the proposer in my view is effective to address the problem identified if funded.\nThe proposer has indicated that they would keep track of the tutoring hours through a system of bounties, however no inclusion has been provided as to how the project’s progress would be shared to the general cardano or catalyst communication. I foresee that it would make it difficult for community to track the progress of the project and hence the auditability can be a challenge.\nAuditability is not 100% guaranteed due to the issues identified above.", "q2r": 3, "assessor": "z_assessor_2713", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 6384, "q0": "One of the best proposals which, with its approach, can really help support the important work of training and coaching developers that the GIMBALABS team is already carrying out successfully. The creation of a treasury to cover the working hours of the tutors is a way to continue to motivate the tutors themselves to give the best of themselves and by this fact allow any developers following the tutoring to know more . I think this proposal covers a large part of the objectives for this challenge, which is to create a developer experience that helps the developer to focus on creating great applications and not wasting time. and the GIMBALABS approach (learning by project) is the best for this", "q0r": 5, "q1": "The Gimbalabs team has demonstrated through the various links provided that they have sufficient skills and experience in producing tutorials and supporting developers on a voluntary basis. The team has also presented a detailed plan spread over 3 months and the steps seem feasible. The team also took into account the possible risks it could face in carrying out this project, which is that of a probable lack of cash for the tutor. I think calling on volunteers in this kind of case is very practical given the non-profit nature of Gimbalabs. it is clear to me that almost nothing can really prevent this project from achieving its objectives since the activities to be financed are already underway and would only need this push to boost the morale of the volunteers.", "q1r": 4, "q2": "The roadmap is very well designed, there are deliverables/milestones that make it easier to audit the proposal including the fact that Gimbalabs plans to keep track of the hours of tutoring provided by their tutors in fulfilling their service, through a bonus system, in this case it is easier to know who has been paid and why based on the number of hours of tutoring projected in the Gimbalabs calendar available on their site. As metrics and KPIs are defined, I think they are good indicators to gauge success.", "q2r": 4, "assessor": "z_assessor_2813", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6419, "q0": "Gimbalabs is a project that focuses on education in the Cardano community. They have another proposal that is focused on bringing education to students interested in developing or building on Cardano. This proposal is to help fund the tutors taht will be helping members of their team. It will be a treasury that helps sustain their project as a non-profit organization. This proposal can help improve the Cardano ecosystem by bringing greater education to the young community members. The project as of now will have a local effect as they are focused on students at Oxford University. However, I would like to see the project create tutorials and have tutors that are broadcasted or utilized online. This can lead to having a global impact and will have the opportunity to provide education to more community members and developers around the world. For these reasons, I give this section 4 out of 5 stars. There could also be more information included on how this proposal will specifically benefit the Challenge setting of \"Developer Ecosystem.\" How will this provide utility to the developers in the Cardano ecosystem?", "q0r": 4, "q1": "The team at Gimbalabs has a lot of experience in the Cardano ecosystem. There is a link provided in the proposal that takes you to their website. On their website, it includes information on all of the team members and their experience. It also highlights their accomplishments which helps determine the potential likelihood of this proposal being implemented successfully. In the roadmap provided, there are specific details that suggest when the project plans to complete certain features of this proposed idea. They provide exactly what will be happening every month for 3 months until completion. These specific details and timeframes are important because it allows for the team at Gimbalabs to be held accountable for their work. There is also a detailed budget breakdown that is specific and helps the reader of the proposal to visualize where the requested funds would be allocated if funded. There are specific details and will also hold the team accountable to ensuring that the rewards would be utilized properly. They have taken into consideration potential setbacks and have plans to address those if necessary. One of these methods will be through tracking their progress daily and monitoring the tutors progress. For these reasons, I give this section 5 stars as it is extremely specific and gives a plan that supports their proposed idea to bring more education to the Cardano blockchain.", "q1r": 5, "q2": "I was impressed with the amount of information included in this proposal. However, it is important to note that it is not excessive. The information is concise and straight to the point, while including the important details. There is specific information included in this proposal that supports the auditability of the potential success of this proposed idea. The specific dates and timeframes in the roadmap and budget breakdown are extremely important because it allows for the principle of accountability to play a part. This also applies to the details provided on the team members and their experience. The community, students, and supporters will be able to hold the team accountable and can ensure that things will be implemented in a timely manner. It is important to note that the team should be aware of the principle of transparency. The team should be open with their future students and help keep them up to date with the details as this proposal becomes a reality. There should also be a focus on accountability. This was mentioned before, and should be taken seriously by the team. The specific details provided will allow for accountability to be specific and effective. These metrics of accountability and transparency will help audit the potential success of this proposal. If these things can all be implemented successfully and the community can trust that this project will function as stated. This will become a successful proposal. For these reasons, I give this section of the proposal 4 out of 5 stars. This is because I believe that the proposal could include more information on how they will grow interest from community members and how they will inform the future tutors or students of this project on current updates.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11484, "q0": "The solutions provided in the proposal align with the challenge requirements. The provision of a progressive developer ecosystem on cardano and the creation of positive experiences for new onboarded developers, is what I believe Gimbalabs is actively influencing. As a community driven ecosystem, cardano has prided itself with a community built by its members, with its growing technologies and decentralized system as has the Gimbalabs organization in its PBL driven educational module. This proposal, when given a chance, can impact the ecosystem with a fresh set of developers who can partake in the structuring of Cardano's future.  The proposal indicates its student body is mostly made up of university students and cardano idea builders, which I think is an encouraging outlook on the potential creators of the Cardano ecosystem. I believe in the project’s value for the ecosystem and the influence it holds to propagate for the adoption of Cardano against other competitors.  It's a 5 out of 5 on the impact. ", "q0r": 5, "q1": "The team has shown its value, based on the successive projects it has gained funding for under the catalyst and the equal number it has delivered. I think as an organization, they harness the right mindset and know-how to foster more well-trained developers into the cardano ecosystem. With a tested and efficient PBL system, as well as their prolific tutors from the cardano developer communities, they have strengthened the standard of developers they produce to benefit cardano. Gimbalabs has shown an immense proof of work and the successes it has choked indirectly through its student innovations, examples; jpg.store, rarity, all NFT driven initiatives that benefits the Cardano ecosystem. I strongly agree that the project is likely to be implemented because it's a continuation of an existing educational/technical learning system and high success rate. Aside from that, the proposal also includes information on the specific activities and a concise plan on how to spend the funding. I however commend the organizers for including that they will return any unused money back into the community. This strengthens their transparency level even more as well as a commitment to the  provisions made possible through the project catalyst. The milestones in the proposal break down its training into three months and the goal to provide learners with hands-on experiences in the blockchain/tech industry. The project has very little risks that can hinder its implementation, however on the issue of not attaining the funds required to support its tutors, I believe voters can see the value in this program and provide the necessary funding . I score 5 out of 5 on feasibility. ", "q1r": 5, "q2": "The project has a high auditability rate for the simplicity in the set roadmaps and milestones. Its success ties into the number of developers active in the Cardano ecosystem, active projects, effective through the use of the training platform and learning module, and other reliable measurements of success. The proposal includes a calendar and a public training platform for community scrutiny on the courses taught and its quality measure. As well as the openness of the platform to onboard various types of learners. Should the project be funded, I am confident that the provided remunerations for the tutors will further motivate them to continue a much greater work than already started. I strongly agree on the auditability of the project, a 5 out of 5. ", "q2r": 5, "assessor": "z_assessor_3252", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13817, "q0": "Gimbalabs have been working and already delivering high calibre educational content to a wide and increasing range of students who are interested in developing under Cardano code. Youtube videos are available to check their consistent work. However, this team claims increasing students have already overwhelmed their capacities. Having their own treasury to administrate and reward financially their tutors might launch this project to the next level. This high calibre tutoring program is certainly reaching the cornerstone of Cardano Catalyst main challenge, the outreaching strategy and onboarding of developers and entrepreneurs. Cardano suffers from blockchain and coding hurdles that we all are well acquainted with. Funding this kind of project will certainly tackle this main problem. This will bring consistency in the students' learning process and enhance the tutoring process. Financing this already working teaching program focused on the development of practical skills at Plutus and building on Cardano will effectively address the challenge of enhancing the Developer Ecosystem. ", "q0r": 5, "q1": "Abundant experience back up this presented key milestone plan. Plutus and Cardano blockchain experts are guaranteed a high calibre educational delivery. Timeline is consistent considering this team already knows what they are talking about. Website includes Youtube Channel links to recorder sessions where we can check the feasibility of this already successful working project. A marketing strategy might help them to increase even more their student attendance if they are considering storing their own treasury and expanding greatly their capacities. Budget breakdown is super consistent and professional. This proposal is highly likely to be successfully implemented.", "q1r": 5, "q2": "Gimbalabs developed a Bounties system in order to give transparency to their transactions. Having the Catalyst budget directly transferred into the Gimbalabs wallet is a transparency guarantee where tutors' payment will be properly recorded. Measuring KPIs as the number of tutoring hours and budget spend per month will be sufficient to audit the progress and the success of the proposal. Sharing website link and Youtube tutoring channel with the Catalyst will be enough to develop efficient communication channels, although a strong marketing strategy and focusing in communication channels within the Cardano Catalyst might help them enhance their already high calibre tutoring program. \n", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 14555, "q0": "The proposal aims to create a treasury to fund mentoring services to new students of Gimbalabs, a non-profit organization that has so far offered quality educational content to student developers and non-developers wishing to acquire the knowledge and skills necessary to build in Cardano. The dedicated members of Gimbalabs have supported a number of projects free of charge up to now. I do agree with the team that there should be some financial source to support the mentors themselves once the number of students registering for their training sessions is on the rise together with the popularization of the Cardano system in the long run. The team clearly explains how they attract developers from outside of our current community to participate in Catalyst, and offers a set of key metrics to measure the impacts they wish to achieve. Their proposal is well-aligned to the challenge and this part is also very well organized and presented. Additionally, tThe team has done a great job presenting the possible risks for them to cope with while conducting the project, and offering some workable solutions. I completely agree with them. My rating is 5. ", "q0r": 5, "q1": "The team is currently conducting live coding sessions on Wednesdays and Thursdays every week, each lasting up to 3 hours as specified in their schedule. To serve the increasing number of interested students, they are going to hold coding sessions 6 days a week, and they give a very specific plan to conduct those sessions, including how long each session is, how many students each session is going to support, and how many sessions are to be conducted in each month. The team breaks the budget down into three separate months, which totally meets their detailed roadmap. All budget components are presented and explained clearly enough. As the proposal doesn’t give any description of the team members (their names, experience, skills, previously done projects, etc.). I clicked on the link leading to the homepage of Gimbalabs and then, to the “About us” page, but unfortunately, only saw the notice of “updates coming soon.” The already mentioned information here is more like their teaching method and principle than the description of their team members. Gimbalabs team has done great work so far, yet it’s better to let the community know more about their dedicated team members. I suggest the proposal add more information on this, at least about the tutors that will conduct the coding sessions. My rating is 4.", "q1r": 4, "q2": "  The team has created a system of Bounties to keep track of the tutoring hours provided by their tutors in the accomplishment of their service. This is a very reasonable tracking method. They are going to look into the number of tutoring hours provided in the month/the number of tutoring hours projected in the timeline, and supervise the budget spent per month as well. Moreover, the team offers a clear description of the sections which are relevant to assessing the auditability of the project. I’d like to congratulate the team on doing an excellent job! I entirely agree with them and my rating for their auditability is 5.", "q2r": 5, "assessor": "z_assessor_4072", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Gimbalabs is a non-profit organization. The creation of a treasury funded by Catalyst to cover the tutors' working hours will give continuity to the students training process.", "experience": "Gimbalabs team. Gimbalabs builds technical, educational, and community infrastructure for people who want to show the world what Cardano can do. We believe that people learn best by doing things. More info: https://gimbalabs.com/team"}