{"id": 417176, "author": "thiago.ouros", "title": "Attracting New Developers", "url": "https://cardano.ideascale.com/a/dtd/417176-48088", "category": 26597, "amount": 50000, "description": "Developers are unaware of the possibility of being remunerated by a decentralized fund. Besides, they are not being motivated to engage in an ecosystem where their code can also have social impact.", "f6_no_assessments": 11, "f6_rating": 4.090909090909092, "videos": [], "media": [], "f6_assessments": [{"id": 3458, "q0": "It's a good proposal that adopts a a fair approach on really engaging with developers outside Cardano and bring them into the ecosystem.  It's excellent that a survey will be conduct in early stage of the project to understand the needs that should be tackled and the final outcome is the co-development of a proposal, which should help to reach the final goal. As well pointed out here. It has a great alignement with challenge by tackling kpis such as \"Number of developers actively building on top of Cardano\" and \"A sense of community and conversations\" and answers at least one of the guiding question (\"How do we attract developers from outside of our current community to participate in Catalyst?\").\nRisk management part is also clearly articulated and presents a very good mitigation startegy.\nAs a minor suggestion, it would be nice to understand how the  tailored content to communicate with developers in Latin America would be created. This would help to asses the communication strategy beforehand and already collect some feedback from community.\nHowever, this is more a small detail and does not compromise my rate (5). ", "q0r": 5, "q1": "There's a very good timelinee with acitivies described with a sound level of details. By its plan, its possible to clearly understand how the roject will be strucutured and what kindoe content will be built. \nBudget breakdown is sensible and aligned with project plan. It's nice they already explained what will be done in case the \"Security Budget\" is not used. The only thing I'd improve here is breakingdown the hackaton budget a bit more, saying which costs are incurred there.\nThe team has 2 people already committed with experience in digital marketing,  entrepreneurship and Cardano. Besides this, they'll count with advisors on technical end if necessary (although dont tell here who they'd be). The descripition on each person are really complete  and they provide several links to work as reference.\nAll in all, my rate is 5. Although I made some small comments regarding possible potential improvements, they should not be worth 1 star of penalty.\n\n\n\n", "q1r": 5, "q2": "Proposer explains very clearly how auditability will be communicated and tracked, which includes tools that were developed by community. Besided this, several kpis are suggested and the final develiverable of a co-creating of a proposal should really attest project success. I also appreciate feedback is taken into accout.\n It would be nice though to see some goals on the metrics as Number of seminar registrations and Number of participants enrolled in the post-seminar mentoring group.\nBesides this, a final report telling the methodology used and the main challenges of the project could also be ellaborated so community gets these learnings as well.\n", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4949, "q0": "The proposal aims to bring new Latin American 9developers to the Cardano ecosystem, through a developer onboarding seminar designed to end in a self-managed community hackathon and a future Catalyst proposal by the new developers. Proposers note that educating developers is key to attracting them to work in the space. As a developer, I find this to be true. There is a large educational gap for newcomer developers to onboard onto the ecosystem and start providing value. The proposers take a holistic approach with this problem, educating these newcomers on the blockchain ecosystem and technology, Cardano ecosystem, and on blockchain as a tool for social change. They also focus on self-organization and community mindset, which I think are key hurdles for newcomers to get used to when coming onboard Catalyst.\n\nThe proposal is aligned well with the challenge, as it aims to onboard new developers to Cardano and Catalyst, bridging some of the early gaps in knowledge and getting them to a place where they are contributing to Cardano. The work will result in a knowledge base of introductory knowledge that fills gaps in the exploration stage, a support structure/a community for new developers, and it will encourage the development of a hackathon by this community. These are all items highlighted specifically in the challenge. \n\nOn the surface these make the impact of the proposal look good. Yet there is an issue. The only information on the size of the impact is this in the plan: \"Executing 2 to 5 seminars with the intention to close 2 to 3 groups of 3 to 6 developers each\". So at the maximum, this will onboard 18 developers to Cardano. There is no mention of scaling this beyond this original group, or if the seminars, the community, or any other part of the work done in this proposal will benefit any other group in any other way. There is no mention of marketing, even though both proposers are marketing specialists. \n", "q0r": 4, "q1": "There is a massive issue with this proposal. The proposers have 6 proposals by my count. In 4 of these, they are the entire team. In 1 only a single proposer is present. In 1, there are 2 others. Looking at this workload, and looking at the 2500USD/month rate in this proposal, 2000-2500 USD/month in 3 others, and extras from the remaining 2, that adds up to around 10000USD/month of pay to each of these two proposers. There is 0 mention of workload management. There isn't even any effort by the proposers to mention these additional proposals. They're also working on proposals from past funds. Adding those all up, I find it extremely difficult to believe they can produce anything worth 2500 USD/month with this proposal.\n\nThis is the first time I'll be so blatant in judging a proposal: I believe this is a cash grab. They purposefully hid their other proposals, failed to mention workload, and left out how much time they'd spend working on this proposal and on others. I estimate with a usual 40 hour per week workload, they'd be making around 250USD/hour of work with all of their proposals. 250 USD/hr for work that is mostly content production. It is not highly technical. It does not require an extensive expert understanding. This is not a fair rate by any margin. \n\nDisregarding this outrageous price tag, we can assess if they can actually deliver, and they can, since there isn't much work to do anyway. The project plan is made of 7 months. First three months is focused on content development. Most of this information is generic and widely available, like Web3, NFTs, Smart Contracts. The team is made of 2: a developer, SPO and a tech copywriter. Both have experience in digital marketing. They have the skills and backgrounds necessary to build an introductory course for newcoming developers. The information is already out there so it'll just be a basic curation of existing resources. They won't have any issues, especially since they haven't defined any of the topics in their content production beyond the title. It's so unclear that delivering it should be no issue at all but read Auditability for that.\n\nThere is also no mention of marketing the work. As part of the work the team will do \"outreach\" to developers and companies. Where will you find these companies and developers? How will you get them to come onboard to your seminars? Assuming you did, how will you build a community with these developers? These are left completely unmentioned. The name of the proposal is to attract new developers. Kind of funny there is no mention of how it will be done.\n", "q1r": 1, "q2": "I found this proposal perplexing. It looks like it has detail to the work done. It's not a very short proposal. There is some good explanations. Yet going beyond the surface, I found it extremely difficult to understand what the outputs of this work will be. They will create a seminar. What topics will be covered is known, but at what detail is completely unknown. What the format of this seminar will be is completely unknown. Will it be a single presentation? How long will it be? A single one hour presentation could fit the bill. A 12 hour long seminar would also fit the bill. Do we have any clue as to what to expect? No. They mention they will execute 2 to 5 seminars. Is that 2-5 1 hour sessions? 2-5 12 hour sessions? That would make a whole lot of difference. \n", "q2r": 1, "assessor": "z_assessor_2643", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5644, "q0": "This proposal aims to create content tailored to introduce new LATAM developers to Cardano and to encourage engagement through group mentoring and community activities such as project development. Building decentralized developers, especially Cardano developers in the future, is excellent. As the proposer mentioned, building developers are not only the internet's future, but a new vision of the social organization can be a powerful motivator. \n\nThe remarkable thing in the proposal is that the team will encourage the group to start their self-managed community hackathon through financial incentives, they will use ADA to set tasks with different score levels and make payments with community tools once completed. It helps the learning process is more exciting and competitive. \n\nThe proposal is well-fit with the challenge since it helps to develop the Cardano platform and our community. The risk is considered well, however, how do they solve it if it does not reach enough the number of group participants? Additionally, the proposer should note ADA price fluctuations, it would be great if they added to the proposal.", "q0r": 4, "q1": "The budget breakdown is presented healthy and thoughtful since the proposer foresees the risk in the budget if it cannot be used entirely. The team comprises 2 members with detailed information, including Linkedin profile. I see they have not only the experience in their specializes but also in blockchain/Cardano. He is now Cardano's ambassador in Brazil, operator of the Ouros stake pool, and Director of Operations at Cardano Warriors. I have a concern about hiring more team member/staff to support the project, are there any plan or just 2 members is enough? I worry about the workload that the team must handle.  ", "q1r": 4, "q2": "In auditability section, it's good when the proposer suggests integrating auditability tools created by the community, like the treasury guild to manage transactions and Dework to build a pipeline to track different stages of this project, besides, they will create a spreadsheet to track the surveys received. \n\nThe team transparently implements the project, so they would like to establish a gitbook and provide the link during the first Catalyst monthly report. \n\nAnd yes, we're easy to see the success of this project through the successful self-organized hackathon and after that, New Latin American developers engage and culminate in the elaboration of projects in Catalyst.", "q2r": 5, "assessor": "z_assessor_2732", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7410, "q0": "The project builds seminars, and hackathons to help Latin American developers know about the Cardano ecosystem, specifically the world's largest decentralized fund Project Catalyst. A place that can incubate development projects based on the true capacity of the project through a transparent voting mechanism, making it clear that the project is suitable for the Challenge\nThis proposal serves as a bridge to help developers from Ethereum or other ecosystems have the opportunity to access the Cardano ecosystem, both in terms of knowledge and funding, a major barrier for developers secure product development.\nHas the content of the workshops been developed by the team? What sources are they expected to be referenced from? Please update specifically to help the community evaluate and supplement the project. This is an important part of validating knowledge.\nAs for the risk, there are 3 situations that are foreseen and have mitigation plans, which I highly appreciate. The project can reduce both risks 1 & 2 at the same time by connecting one more Haskell & Plutus expert developer, the workshop content will be more accurate and engaging, and the questions are practical and answered satisfactory answer. Let's highlight the advantages of Catalyst, the largest decentralized fund in the world. The Cardano ecosystem has free Haskell/Plutus classes, and EVM tools that convert products or build on sidechains. There are so many advantages to product development\nI rate this episode 5 points for its powerful impact\n", "q0r": 5, "q1": "Project implementation time in 7 months, with specific work items. The content of the seminars is logical and gradually develops in-depth. Hackathon is an important part, the project should show more specifically how to build a hackathon, and how to proceed. Help the community accurately evaluate and give useful suggestions for the project.\nAs for the detailed budget, the project is divided into 3 major items with a total application fund of $50,000, equivalent to 5% of the total Challenge fund, an appropriate number. For more detail and follow-up, the project should estimate the number of working hours for each activity, thereby proposing an appropriate budget. I have a question, the proposal has not yet stated the cost of organizing the seminars. Or suggest another contingency plan. Please contact to clarify the problem\nThe team consists of 2 members, with expertise in software development and analysis and blockchain advertising, provided by the project with specific social links. However, as discussed above, the project should collaborate with a member who specializes in Haskell/Plutus, making the project stronger.\nWith 2 members, you are still involved in other projects in this fund and previous funds, will that affect the working efficiency? How do you arrange your timetable? Please share for community evaluation. I would like to give this part 4 points\n", "q1r": 4, "q2": "The project outlines 6 very specific, highly intuitive, and easy-to-quantify KPIs. At the same time, the project specifies tools for checking such as treasury association and Dework. I appreciate this. This is a project about seminars, the ability to promote is very important, helping to spread the community, the project should create more social channels like Telegram for a bit of interaction, Fb, Youtube is communication channels. Communicate and update the results in an easier way, helping those who don't know anything about the software, about Catalyst still have the desire to get started.\nThe success of the project as a path into the Cardano ecosystem, initially the path is Catalyst, starting from Latin America, then the path is more open, other ecosystems will be interested and explode. Helping developers with the resources to build products that impact society. I rate this part 5 points\n", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8685, "q0": "The project is combining both educational ideas about Cardano for developers and activities to encourage them to learn and contribute projects for Cardano together. With this direction, the project is completely linked with the key metric of Challenge. The proponent's plan is divided into two parts, part 1 will be seminars to introduce the Cardano ecosystem and career opportunities, and part 2 will build an incentive structure using ADA to promote the development of self-organized and managed Hackathons among teams of developers. This can be considered as integration between theory and practice, the ultimate goal is still to promote the rapid integration and contribution of developers at LATAM to the Cardano blockchain. The risks have also been clarified and optimal solutions are given.", "q0r": 5, "q1": "The development plan is clear with tasks and timelines for the 2 major events of the project. We also know which Cardano topics will be covered in the seminars, this course is suitable for the path from basic to advanced learning about Cardano. Information on the ADA incentive structure for Hackathons will be disbursed and how to receive it is also clearly described. Regarding the budget allocation plan, the budget for Content Development, Research, Mentoring and Support for the 7 Months should be more specific, so there are estimates of total working hours in 7 months or the number of the average working time in 1 month of the two main members will be in charge of these tasks, this will help the experts to assess the feasibility and appropriateness of the required budget. The two members leading the project both have a deep understanding of Cardano and a high ability to inspire, which will ensure the good execution of the project.", "q1r": 5, "q2": "The proponent gave a clear introduction to the tools for project management and auditing, and reports on them can be found by anyone interested in the project. However, the audit roadmap is still not an effective route for measuring success, although the concept of performance indicators is clear and consistent with the main content of the project, but does not have a high reference value because it lacks two important information, which is the target for each KPI and the timeline for making the assessment.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 9491, "q0": "For recognition of a relevant need (for both Cardano AND LATAM developers) and direct solvency for that problem statement, I rank this section a 4. I think there’s a lot of good content here that flows nicely from proposal>link>impacts. I think this section can be vastly improved with a greater quantification of the problem statement, as that will naturally flow into the value of the impacts. How many developers exist within this population? What is the average experience for each of these developers? How many are the proposers connected with? I think answering this questions will provide voters with a much more tangible set of impacts to work with. While it may be assumed by some, I think it might also be prudent to identify the Plutus Pioneers program as a potential inflow for new talent. I think everything else from the guiding questions to the risk analysis all looks well thought out and organized. I think this proposal has a lot of potential to appeal to greater innovation, increased adoption, and economic impact for the Latin America region. ", "q0r": 4, "q1": "For well-rooted experience with Cardano, a reasonable and organized roadmap, and moderately efficient spending, I rank this section a 4. The concept of funneling in developers from an untapped source of talent is an idea that I’m very enthusiastic about because the ROI is monumental for the Cardano ecosystem. This core team is positioned to do just that as a couple of Cardano community members with heavy experience in Blockchain development and marketing, which are the most effective tools for Cardano outreach. The roadmap designs a clear outline of the content that will be presented to the target audience, as well as processes for refining, mentoring, and advancing. The results of this proposal, if we see relatively substantial participation, will be adding more capable developers into the Cardano ecosystem to support existing Dapps and/or creating their own Dapps that might support their local region for greater adoption potential. On the budget, I would like to see a little more breakdown in certain categories. The biggest question mark is on the Hackathon budget as it doesn’t provide any information on how that cost will be allocated. Though, assurance is provided with contingency plans for the funds if it’s not all spent. This section is very well laid out to demonstrate confident feasibility. ", "q1r": 4, "q2": "This section earns a 4 for providing a perfectly thorough list of KPIs with a vision of what a successful outcome might look like. I think that vision could be further defined by establishing target metrics for the short-term expectations of this project. This would also help with the tangibility of the impacts that were discussed before. If voters have a quantifiable vision of where this project expects to be, I expect they’d be much more likely to react positively to this proposal. Even better if this section can establish progressive goals at different milestones of the future of this project, to secure future confidence as well. A little extra effort here could easily push this section from a 4 to a 5.", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11355, "q0": "The problem with the proposal is that the developers are not aware of the possibility of being compensated by a decentralized fund. Besides, they are not motivated to join an ecosystem where their code can also have social impact.\n\nSo developing the right content to introduce new Latam developers to Cardano and encourage engagement through team and community mentoring activities like project development.\n\nThe proponent clearly explains who will benefit from their proposal, what needs to be done, and how what they create can benefit the community.\n\nProponent  explain the problem they are solving, in plain, common language that a non-expert can understand.\nIt is proposed to identify issues in the challenge that need to be addressed.\nThe proposal clearly outlines how it will bring value to the Cardano ecosystem.\nThe proponent also points out the potential risks and proposes suitable solutions to address the risks.\n\nClearly, this proposal fits the indicators of this challenge, as proposes to address the information gaps in the discovery phase of these developers, in addition to creating an environment where a sense of community Encourage them to interact.", "q0r": 5, "q1": "The proponent provides a detailed plan, including progress and milestones for the month-to-month implementation of the specific project including the to-dos.\nThe proponent fully describes the order in which the tasks will be performed, what problems will be solved at each stage, and how long each element of the project will take.\n The proponent details what will happen at each stage, who will do it, and what resources are needed.\nThe budget is clearly outlined and broken down into definable items, which is absolutely necessary to achieve the stated goal.\n\nThe project team is fully listed with their identities, and images with reference links, their experiences and skills are specifically outlined as: having a lot of technology experience in System Analysis and Development, an experienced businessman who founded several companies related to software development, including games, mobile systems, and web. Marketing Segment and Digital Strategy. is Cardano's ambassador to Brazil, moderator of equity fund Ouros, and CEO at Cardano Warriors...\nThey are people who have had experience working on fund proposals before so I agree that this proposal is highly viable and will be implemented successfully.", "q1r": 5, "q2": "Metrics are specified, and the information that the proponent gives, such as the progress of the project, and the desired outcome, is listed in easy-to-understand detail.\n\nthey will integrate community-generated auditing tools such as treasury association to manage transactions and Dework to create a system to track the different phases of this project.\n\nFully listed KPIs will provide the community with clear auditable evidence and measure the progress of the proposal.\nTo make it easy for the community to check out the work, the proponent will set up a gitbook and provide a link in Catalyst's first monthly report.\n\nPlans are optimally presented, and project information websites are provided, giving a good chance that the proposal can be successfully implemented.", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 11735, "q0": "The problem the team suggested with this project is that the developers are not aware of the possibility of being compensated by a decentralized fund. They have no incentive to participate in an ecosystem where their code can also have a social impact. So being a developer in a decentralized environment that builds the future of the Internet and a new vision of the social organization can be a powerful motivator. From the problem to the solution and the outcome of the proposal, I find it all harmonious and logical, so this proposal is a great fit for this challenge.\nAs summarized above, the team offers content to communicate with developers in Latin America that revolves around the background knowledge of the ecosystem, and organizes industry-related seminars on Blockchain technology and the Cardano generation system, the proposal also addresses information gaps in the discovery phase of developers. From these solutions, I think the project will be suitable to solve this challenge.\nTo carry out this project, there are still worrying risks, but the team has come up with very convincing solutions to address those risks. I think these solutions will solve the risk like the way the team came up with.", "q0r": 5, "q1": "The proposal was built within a specific timeline, and the team identified the work that needed to be completed within that time. The project took place within 7 months, the main work was to create content for the conference with the developers. Building the right content will reach developers, organizations, or companies. Next will assist the groups to complete the results.\nI see the budget has been divided for each specific cost, but this budget is not transparent because there may be excess money from the hackathon cost for 3 groups or the security budget. Although the group has come up with a solution to use that money for something else, I don't think it's reasonable. If the proposal is funded then that money we can spend on the next proposal or we should reduce the budget instead so that there is no excess of money.\nThere is nothing to deny the ability of the team involved in the construction of the project. The team not only showed the community the ability and experience of Thiago Nunes and Cristian Amaral but also cited their LinkedIn, which is enough for us to believe in their ability to work on this project. This proposal is sponsored I will come back and support it until the project is successful.", "q1r": 4, "q2": "I haven't seen the team propose to give specific metrics for this project, but just list out what the goals should be. We should give a specific amount to know whether the set goal has been achieved or not so that the community can compare and check whether the work is progressing as proposed.\nThe team has determined the success of the project that the purpose of this work is for Latin American developers to participate in building projects in Catalyst. This fits perfectly with the phylogenetic challenge we're building.\nAs mentioned above this is a brand new proposal so if the proposal is funded I believe it will be done until it is successful.", "q2r": 4, "assessor": "z_assessor_3273", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11858, "q0": "This proposal aims to attract new LATAM (Brazil, Mexico, Argentina, Colombia and Chile) developers to Cardano ecosystem. The Proposer claims new developer audience need to be educated about Project Catalyst to participate in the community which I agree. Providing them with essential information about decentralized environment will be beneficial for every individual in the community.\nCardano is missing such an easy on-ramp for newcomer developers. Main topics on that proposer designed to give in seminar are; ‘Blockchain Ecosystem and Technology’, ‘Cardano Ecosystem’, ‘Blockchain as a tool for social change’. In my opinion these three topics will be sufficient for beginners. Backing it up with surveys after seminars is good idea. This will create a sustainable plans and good for future events.\nProposer didn’t give any information about these seminars time lengths. How many hours or how many seminars will it take to prepare them as group and start their own ‘self-managed community hackathon’? We can see fundamental knowledge prepared. My question is, how do proposer attract these developers? How the proposer going to reach this audience? Discord, Developer Forums, Local Universities, Zoom? \nEducating new LATAM developers for the Cardano ecosystem is a good start. I suggest shifting the project from regional to international for far more reach and attract more developers. \n", "q0r": 4, "q1": "The proposer team is described briefly. Each 2 member provided a valid ‘linkedin’ page. From both of their experiences we can assume they are capable to give these seminars and guide new developers.\nProvided timetable isn’t detailed well. Content that will be provided ranked properly according to their technicality.  Seminar topics are given for each month but the length of time in these didn’t mentioned specifically. For example, how many seminars will be given in each month? How long each of them take? Who will present these seminars?\nRequested budget is divided into three elements which contains; monthly salary of each member (2), Hackathon and further expert budget. It would be better to see the members on the team in their assigned tasks, work distribution and work routine for clarity.\nFuture risks mentioned on impact with their regarding solutions.\nThe main problem that i can see that, this team working on 6 different proposal including this one. I wonder how they would execute this project with so much work load. It is not feasible.\n", "q1r": 1, "q2": "I admire the projects aim to attract new developers for Cardano ecosystem and educate them with essential knowledge but specific details are lacking. AUDITABILITY section seems incomplete. I would like to have seen a roadmap with milestones which included timeframes. Though I'm not sure as there aren't many details in the proposal. As such, I think it will be challenging to audit this proposal.\nGoals are presented in ‘Project KPI’ but how can community track these achievement? As an example, “Completion of post-seminar surveys”. How will community be updated about surveys? Where can we see the spreadsheet about received surveys? These are not defined well enough to be audited easily. A much detailed plan, which included specific dates, can prevent confusion.\nThe proposer mentions establishing a gitbook and providing the link during the first Catalyst monthly report but doesn't give any information as to where and how an audit could happen. Lack of communication elements make this project difficult to audit.\n", "q2r": 2, "assessor": "z_assessor_3300", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12825, "q0": "This proposal is closely aligned with the challenge. The proposal team intends to organize a Hackathon type of gathering for developers in Latin America. They intend to educate the audience in the advantages of blockchain and explain why blockchain is the future of internet. This kind of gathering will create awareness in the developers community and I think such a event may have great outcomes for our community. The author of the proposal is right to assume that there are many developers with great skills that aren’t aware of the potential of the blockchain and by introducing them to this topic we have the chance to gain a large number of qualified developers who are also motivated enough to produce grat work. The team also intends to make a survey that will help them gain invaliuable information so that they can improve the quality and content of future events. I believe that such an event is completely necessary and is going to introduce Cardano to a large number of people. Given these I believe that this proposal can scale in the future and take plase in differnet regions all around the world hence creatin a global imopact. Pretty solid proposal and deserves highest marks.", "q0r": 5, "q1": "The whole process forseen by the team is 7 months and they have provided a detailed timeline with realistic milestones and tasks. I believe that the team has accounted for all possible risks and has explaied briefly how they intend to mitigate this risks. On the other hand the budget split is very detailed. We are aware of what the team intends to do with the money in case they get funded. One thing that I really liked is that they have separated an addition 3000 USD in case they need to hire an expert if their team gets stuck in some kind of technicality and they got a plan of what to do with the money in case they do not need to hire an expert. This part gave me some sense of reassurance and responsibility by the team since they have accounted for every dollar of their requested funding. Given the amount of work involved in such events I also believe that they payment of 2500 USD/month for two team members is reasonable. As for the team, they have provided short backgrounds of both members and LinkedIn profiles are available as well. This team posesses the skills, experience and devotion to deliver this project as described. I really liked the feasibility of this proposal and I believe they deserve maximal marks.", "q1r": 5, "q2": "The KPIs provided by the team are very clear and very good indicators of what success look like and how can we measure their work. The team intends to create a gitbook page and make the link public so the whole community members intersted in this teams work can easily audit their work. The team stand for full transparancy between them and the community and I believe this is of outmost importance. The timetable has also been provided however I have one suggestion, periodic meeting would really increase the transparancy and also the community member may ask questions of things that they cannot understand from the gitbook. However this is just a suggestion, on itsel the audit part is pretty good.", "q2r": 5, "assessor": "z_assessor_3478", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14973, "q0": "Generally, the main idea of this proposal is to hold a seminar with the purpose of approaching and encouraging new developers to jointly build a better Cardano ecosystem. The targeted audience of this project would be people from the outside of the community. Coming to the seminar, they will be introduced to Blockchain technology, Cardano, how those ecosystems generate social impacts, as well as be inspired to progress themselves. Afterwards, they will be incentivized to start building some proposals and aiming to expand the Cardano ecosystem. Overall, I believe that the whole idea is very innovative and beneficial towards society. Not only does it enhance the development of Cardano, but it also brings technology, especially Blockchain, closer to many people, as well as gives them a chance to self-organize and aim for social goods. As mentioned in this section, the proposal addresses correctly some criterias that match the challenge setting, and I believe it is true. Furthermore, some reasonable potential directions are also provided to show what other ways this proposal can be effective. Besides, from my personal point of view, the risks stated in this section are well-prepared and sufficient. Coming along with those are mitigations for each one, and I believe they are the optimized options. To conclude, I believe this is a well-written part which shows fully what they are aiming for and how they are going to actualize it. However, there is 1 omission that still makes me confused. Although the team described that they are going to invite Latin Americans to the seminar, yet, I think that they did not explain particularly. Specifically, I believe the team should give some general detail such as: the estimated number of people being invited and the estimated number of people showing up, which country or which particular city where the seminar would be held (if some unexpected situations like Covid-19 happen, would it be postponed or held online), what particular characteristics the audience should contain (age, career, education, profession,...),... In my opinion, these criterias, if given sufficiently, would be very helpful in the process of evaluating the scale and impact of the proposed solution.", "q0r": 4, "q1": "Initially, a very obvious plan is offered in this section. In general, it takes around 7 month to conduct the final outcome, which is the proposals towards the Catalyst made by participants. Particularly, it would take about 3 months to finish the content development, 1 month to launch the BETA version of the presentation, receive feedback as well as refine it and another 3 months to officially hold the seminars as well as collect the results. Personally, I believe the steps contained in this plan are given clearly and convincingly. Besides, a detailed budget breakdown is also provided with the total requested funds of $50,000. In order to help the Catalyst understand the salary required for each team member, the team offered a brief introduction with details about profession, work experience and Cardano relations, as well as affiliate links for further background research. From my observation, I believe that the information included in this part is very comprehensive and logically ordered.", "q1r": 5, "q2": "The auditability of this project is proven thoroughly by different ways such as managing tools and tracking spreadsheets. Furthermore, the team also provides reasonable KPIs to follow, yet I would highly recommend that they specify on the numbers/levels that they are expecting. Additionally, although they express clearly their success measures in the future, I suggest that some particular sustainable development goals should be added to ensure a more efficient growth.", "q2r": 3, "assessor": "z_assessor_4118", "no_vca": 20, "ne": 5, "ng": 15, "nfo": 0, "vca_o": 1}], "solution": "Developing content tailored to introduce new LATAM developers to Cardano and to encourage engagement through group mentoring and community activities such as project development.", "experience": "Thiago Nunes - Cardano Ambassador, Developer and SPO. Owner of  a digital marketing agency for more than 7 years.\nCristian Amaral - tech copywriter, 10 years of experience in content marketing. Redirecting his career to be a copywriter specialist in blockchain."}