{"id": 417248, "author": "alfred.pham", "title": "WALLET ADD-ONS FOR GAME ENGINE", "url": "https://cardano.ideascale.com/a/dtd/417248-48088", "category": 26597, "amount": 26825, "description": "There is no wallet add-on for the game engine client in Cardano that suits the requirement of Miverse in long-term development. ", "f6_no_assessments": 8, "f6_rating": 3.541666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 711, "q0": "Yes, The proposals intend to create a Miverse wallet that can be integrated into the Miverse game and release it as open-source for other projects to use in their games.  The proposal aligns with the challenge setting of creating an awesome experience for Developers and bringing new developers to Cardano; however I am slightly surprised that no mention is made of the existing back and wallet services on Cardano. The wallet will be integrated into the Unity game engine thus creating a starting point for other game developers on Cardano.  The proposal is scalable as it will be released as open-source and any developer can use it in the future.  As a developer myself I find that a wallet integration into a platform is one of the key steps in delivering a quality and functioning product. ", "q0r": 4, "q1": "The delivery of projects will be led by Andy who's the CEO of Universal Studios that has more than eight years of game development experience in South Korea.  A link to his facebook account is provided in one of the attached documents. The requested budget is $26,000 and the budget is not broken down into identifiable items. An Excel sheet that is attached to the proposal called “detailed budget” is the budget for the overall Miverse game and it was not possible for me to find a breakdown of the budget just for building the wallet.  The Proposal also attached a print screen that is too small to read and which supposedly has the breakdown of the wallets budget. Furthermore the proposal states that the rate of a paid developer is $3,000 per month which is a competitive rate for blockchain development and is well below the rates of other proposals that I have reviewed.  The proposer's planning, in general, is good and he has a detailed breakdown of tasks for delivery of the Miverse game; however, I did not see a detailed plan for implementation of the wallet. In the attached excels, there is mention of different wallet integrations, and one of them is the Trust Wallet; another one is Wallet Connect. I also wasn't able to find an implementation timeline however judging from the budget and the monthly rate, it works out to just under 10 months to deliver the project which sounds reasonable for a wallet integration given that there is a cardno-wallet backend service that IOG provides. The proposal mentions that the wallet will be implemented in the Unity game platform but does not discuss the language or the technical aspects. The proposer suggests that they don't have any technical risks or challenges with the proposal. I find it difficult to believe. Overall I think the proposed is technically capable but not enough detail is provided to judge whether implementation can be successful or not.", "q1r": 3, "q2": "A road map with milestones and time horizons for the wallet is not provided; however there is a general plan for the Miverse game of which the wallet is part. The Proposal will track the number of minted CNFTs, the number of GitHub repos, and number of developers that go to Miverse. The definition of success is that it makes gamers quit less because of purchasing.  the success statements is worded ambiguously and is aimed at the Miverse game rather than the wallet itself. The proposal has generally done well in communication and putting information online for the public.  I, therefore, think the proposal is auditable, but with some difficulties because of the lack of tractable metrics for the wallet implementation.", "q2r": 4, "assessor": "z_assessor_2123", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1420, "q0": "There is a big need for more developers working on tooling for the Game developers who want to use Cardano as their blockchain. With gaming being a high net new user growth opportunity this certainly has a high impact potential. \n\nIntegrating wallets directly within Unity as an open source tool is highly anticipated and needed. Even if Blockfrost is working on a similar integration, competition and different approaches should be encouraged.\n\nSome notes for the Proposer and General ADA Voter to consider in regards to the impact of this proposal: The title of this proposal outlines a clear use case but upon reading more of the proposal there is much more added in that doesn’t align with the Challenge criteria. I would encourage the proposer to focus on the Wallet Integration. With what seems to be a majority of the time/scope for deliverables to be CNFT projects for their own game(?) as part of this proposal I have to give this a 3/5 ranking. I believe the focus as outlined in the problem, challenge solution, and execution should be refined in the future.", "q0r": 3, "q1": "With the scope of what is outlined, this team has a lot of work ahead of them. Considering they have a large team of what seems to be experienced game developers, manager, and staff from Vietnam it’s likely the cost associated for the work to be done is possible. It’s worth noting that Andy Nguyen - CEO of Unicorn Studio is not the same Andy Nguyen that is well known in the BAYC and his work in the Ethereum space. \n\nWith a level of experience outlined, it seems more likely than not that this team could deliver an open sourced wallet solution for Unity. For this reason I give this a 4/5 ranking.", "q1r": 4, "q2": "The use of a lot of external links is helpful, but woefully overwhelming for a voter - having reviewed (most) links, it seems that this is a carve out of the overall Miverse, and isn’t as specific to addressing the actual proposed problem/solution.\n\nI found the budget to be hard to tie into the impact and deliverables with the Open Source Wallet Connector + the CNFTs listed in their impact section. While they do have a clear graphic noting man-month costs, there is little transparency on what is being built specifically. This tied to the extra tasks listed in the Impact section lead me to give this a 2/5 ranking as I cannot determine what is being spent on the actual problem statement. ", "q2r": 2, "assessor": "z_assessor_2241", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1778, "q0": "Developing a wallet add-on for game engine clients adds a useful tool to the developer ecosystem. It facilitates the development of game needing a wallet connection to manage NFTs.\nThe solution is based on a specific wallet plug-in integrated in the Miverse Game, that will interact with a cardano-node through a back-end API. I understand that this wallet is not developped only for Miverse Game but also as an open-source project for all game developers. This project is a follow-up to F8 funded proposal \"METAVERS OF PLAY TO ENTERTAIN GAMER\". \nThe 5 star score would be awarded for Impact if more details were added about how the development takes into account not only the Miverse game specification and needs but also insights from various game development team, thus demonstrating an ability to scale. \n", "q0r": 4, "q1": "This proposal is a follow up to a Fund8 main proposal, \"METAVERS OF PLAY TO ENTERTAIN GAMER\". When checking on https://development.miverse.io/ I noticed that there is not a lot of information available about the progress of the development, development tasks description lack details.\nThe proposer is the sole developer of the project and claims an experience of 8 years in game development for Korean companies. I would have appreciated if proof of this experience had been provided (game name with credits) in the proposal. He explains that he has not past experience in blockchain, which I identify as a risk for the proposal.\nA general roadmap is provided, with a lot of items identified and scheduled among Q3 22, Q4 22, and Q1 23. I would recommend to organize these items, and refine the roadmap at a weekly level.", "q1r": 3, "q2": "Success is defined as well as key metrics including \"number of mined CNFTs\" and \"number of developer working with Miverse\".\nWhile not explained in the proposal, it is said in the ClickUp chart that progress will be tracked in ClickUp, with detailed public task execution and document publication. Commiting of the use of a public channel and offer public progress reports is a good point for auditability, but I would have expected to have an easier access to Fund8 proposal progress when assessing this Fund9 proposal .\n", "q2r": 4, "assessor": "z_assessor_2264", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2810, "q0": "The problem the team proposes to raise to provide a solution is: there are currently no wallets for game engine applications in Cardano that match Miverse's long-term development requirements. so the team is committed to providing an open source wallet for game engine applications.\nThe team proposes to publish a lot of components inside the solution, and in particular includes: Cardano Node This protocol allows the wallet of the team to create interactions with the Cardano blockchain to send and receive balance checks, as well as store and There are many other built-in features. Along with that, the method of posing the problem to solve and providing the solution of the proposal is very methodical, the presentation is easy to understand with examples and specific explanations, the group clearly states the benefits that the proposal offers. This release will bring to the gaming community and the Cardano ecosystem.\nAlong with that, the risk issues are mentioned and there are plans to optimize them, in addition, the group emphasizes the issue of funding, if not funded, the group will still operate but the quality can be reduced. not as calculated,\nwith all the arguments in the proposed solution then this proposal will thoroughly solve the problem presented by the team and also fit the required challenge.", "q0r": 5, "q1": "I'm very pleased with the layout of the proposal, they publish a roadmap and it seems that some of the early stage work has already been done, as footnotes are attached to each layout. The content of the work in the early stages is mostly done and done,\nAlong with that, the team has a professional and full-time team, through the expenditure budget statement, the salary is calculated by month, and the proposed team has annotations for all guaranteed expenses. transparent and easy to understand.\nin addition to presenting a great layout on the team also publishes full team information with pictures in the clickup platform, and the whole team is divided into small groups each team will take care of a development work private. I greatly appreciate this organized work.\nand so based on the initiative taken before the steps at the early stage plus relevant experience and other documents, this proposal will easily succeed.", "q1r": 5, "q2": "indicators are provided fully, in addition, the proposal team is committed to supporting the community in tracking the progress of the proposal's work on the clickup platform, the team has provided two links to check the progress of this proposal and one to examine the entire project of which the proposal is a part. In addition, the proposed team also provides the community that wants to track the plans to be implemented by which group will be available on the proposal's website.\nby making it more enjoyable for traditional gamers because there is no need for initial investment to play the game, and also by motivating players to create content, there are many other success indicators mentioned by the team,\nThus, according to the documents provided by the proposal team, it will be easy to track the completed workload and determine the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"id": 8805, "q0": "he idea is to develop an open source wallet add-on for game engine clients.At the outset that looks suitable to the challenge setting. On closer look, some caveats pop out. The proposed add-on is for the Miverse wallet being developed by the team.The details of the solution does not provide details about whether this solution will be compatible with other wallets/game engines or how it can be reused. Further the deliverables include 8 line items out of which  of 7 are about CNFTs specific to the game being developed by the team whereas just 1 item is the open source wallet add-on. I would have rated this higher had it been in the dApps & Integrations challenge. I reckon that this proposal does not address the developer ecosystem challenge aptly based on the solution and deliverables presented. The detailed plan and milestones are mostly about the entire gaming platform with very little mentioned about the add-on.", "q0r": 2, "q1": "The experience presented for the lead member looks good.The list of team members presented in a separate URL looks good too even though its devoid of individual details. Break up of the timeline into small items spread across 3 quarters gives a good idea about the execution plan. It’s good to see that some of the work has already started.This proposal is part of 7 proposals being submitted by the team in this fund.\nA downside of the execution plan I see is the generalization and digression to their game platform as a whole whereas the problem statement and title is specifically about wallet add on for game engine. The timeline or plan does not mention how they planned the development of the wallet add on. I see a risk that while the game development progresses as per plan but the wallet add-on might not be successful. The proposal lacks clarity to assure success of the add-on.\n", "q1r": 2, "q2": "Open source repositories are generally auditable. However, the overarching description of the game platform in the detailed timeline and lack of clarity on how much of the funding will flow towards wallet add-on is a concern. It will be quite hard for the community to assess progress of the wallet add-on repository or about whether the progress is in a direction to be useful for others and not be specific to this gaming platform. I hope the team presents more specific details to the community if funded.", "q2r": 3, "assessor": "z_assessor_3007", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9492, "q0": "For lack of explicitly stated context and articulation of quantified impacts, I rank this section a 2. While the proposal provides various links related to the Miverse metaverse game, there is not any easily accessible information that explains what the value proposition is of Miverse. Some voters may react positively simply because there are previously funded proposals related to this project but this proposal will not do it for those that require greater justification/proof for why every individual proposal has something of value to provide. In order to provide that for this proposal, the uniqueness/value proposition of the Miverse game needs to be reiterated for context, to make voters care about the problem statement for this proposal. Once that foundation has been established, voters can then weigh the solvency of the problem statement against the cost of the proposal in a cost-benefit analysis. To enable that more easily, the proposal needs to provide some kind of data on how many people this might impact, modeling evidence on the benefits of this kind of solution, and any other quantifying factors that give voters a sense of the magnitude of the given impacts. Voters are more likely to respond positively if these impacts appeal to the benefit to the greater Cardano ecosystem through adoption, innovation, or integration with the real-world. ", "q0r": 2, "q1": "For information that appears relatively positive but is difficult to access/interpret, I rank this section a 3. I assume that this team is capable of carrying out this proposal, as they have consistently delivered on previous funds up to this point. However, in an objective evaluation of the proposal contents (with all accessible information provided), it is not provably apparent that there is capability behind this team. We do get a promising professional description of the CEO of Unicorn studio but we are not provided with a LinkedIn source or any other information about other members of the team. This leaves me moderately optimistic but uncertain. I think credit does need to be extended for the tremendous detail of the given roadmap (though the roman numerals are a bit odd). The roadmap tells me that there is a clear technical understanding and direction for the steps that need to be taken to accomplish this project overall. The budget is confusing. As much as I appreciate the attempt to explain the system, it’s still rather difficult to objectively measure spending efficiency as I (and the voters) am used to doing. If there is a way to convert this budget’s format into the standard hourly rate, hours allocated, and categorical definition of labor, I think this proposal could be more clearly understood. ", "q1r": 3, "q2": "For a well-defined framework for measurement of success, I rank this section a 4. I think the given KPIs are an ideal framework for evaluating success, as they are metrics that directly measure proposal impact. Where I think this section can make a push for a more secure positive voter response is by setting target goals for each of these categories, as well as milestones for each of these metrics for different timeframes in the future of the project. I think this will show voters that this team has a specific vision for success and this commitment will motivate the team to make adjustments along the way if they are not seeing the performance that they anticipate. The transparency of previous proposals and public outlets for accountability are also much appreciated in this section. ", "q2r": 4, "assessor": "z_assessor_3063", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12805, "q0": "In this proposal, they want to build wallet add-ons for the game engine that will suit the Miverse requirement in Cardano. They want to use Ada as an in game wallet, which I think isn't a bad idea, and it could benefit Cardano. This Miverse wallet would consist of a Backend API which would be used for interactions between Miverse wallet and Cardano note, while the Cardano note would connect it with Cardano blockchain. The game would be a battleship game, and also have a comic book. Firstly, I don't now have many people would have interests in the game and the comics. There are already some battleship games like Sea of Thieves. But on the other side, wallet add-ons isn't a bad idea. It would reduce the time that is needed to develop a game that needs wallet add-on. And having it use Ada could be very beneficial. In the future, any game that would use need wallet for game client could really benefit Cardano. But I don't think the game and the comic could succeed, and for that reason I give 4 stars.", "q0r": 4, "q1": "In therms of feasibility, everything is well detailed. I decided to give 4 stars because I don't think the comics and the game could be successful. The plan and with it key milestone and timeline is well described and everything we need to know is there. Same thing is for the budget breakdown, everything it would be used for is there and the team of this project done also well. A wallet add-on for in game client is I think feasible, but I don't think the same for the game and the comics.", "q1r": 4, "q2": "In therms of auditability, there isn't really much to say, except everything is well done. For every single thing I there is a link with detailed breakdown of everything. The sentences are well done and there is even a link which also has proposal and Japanese and Vietnamese language. Which is a good thing. When it comes to success and the way it would be measured, it also has a link with detailed breakdown. So I give 5 stars.", "q2r": 5, "assessor": "z_assessor_3473", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12826, "q0": "I don’t think that this proposal will provide any value to our ecosystem. In this challenge we aim to finance proposals that will  make possible to attract more developers into Cardano ecosystem. Hence we would have a large talent pool that may be able to collaborate in the Catalyst Projects. The idea in this proposal is to develop an open-source wallet add-on for game engine clients and the team claims that this will draw more developers and game developers into the ecosystem since it will make deployment much easier and save a lot of time. I don’t think that this would be the case, having a wallet add-on that allows you to autofill web forms in the browser with your wallet information is a very minor task that any developer (including myself) wouldn’t mind the absence and the ability of this project to scale is extremely limited. I believe that in this challenge we are looking for ways to make the developers experience more attractive so they would want to join our ecosystem. In addition, after some research I understand that this proposal is only one part of a much larger project that they call “Miverse” a gaming metaverse platform. All in all, from the way that the proposal was presented to me, I don’t think it addresses the challenge.", "q0r": 2, "q1": "All team members are introduced on a ClickUp page where they have a detailed timeline and work distribution. It is clearly indicated what task each team member is going to be involved in here. The only suggestion I have for this part is for the team to include in the proposal a short summary of each member background because the webpage about the team includes only the photos of the team and even though I tried many times I couldn’t reach their profiles or their real names. However, the team has been funded previously by Catalyst and it seems that they have delivered so I think this is a trustworthy team and will be able to deliver what they have proposed. The budget split is also provided in very good detail together with other proposals that the team has in this fund. This part of the project is pretty good and projects confidence. The team has put in the effort.", "q1r": 4, "q2": "The team has provided several public channels for the community to audit their progress. One channel is for auditing the KPIs of the master proposal, another one provides all the details for the roadmap and finally a separate channel will show the tasks that each team member is assigned and the community members will be able to track that as well. The chosen KPIs are a good indicator of what the success looks like. They have been chosen carefully and are easily auditable. Finally the team has provided the necessary information on how this project is linked with several other projects from previous funding and this one as well. Pretty good auditability. One additional feature that may help to make the process even more transparent is to organize periodic online meeting were the team talks about the completed task, what lies ahead and the difficulties they are facing. However this is just my suggestion. ", "q2r": 4, "assessor": "z_assessor_3478", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We develop an open-source wallet add-on for game engine clients. ", "experience": "\nIn the scope of this proposal, we're running with 2 senior blockchain developers.\nFor making the project succeed, we're working hard with 4 teams of game development, comic production, and marketing with 50+ people\n"}