{"id": 418343, "author": "otaviolima", "title": "Crypto Blockchain Talents Platform", "url": "https://cardano.ideascale.com/a/dtd/418343-48088", "category": 26597, "amount": 49500, "description": "Where to find and contact talents and professionals with high technical skills in blockchain, DeFi, Crypto, Web3, Smart Contracts, NFTs, Metaverse and many programming languages used in blockchain.", "f6_no_assessments": 10, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 4380, "q0": "The team determined the problem to be solved here was to create a platform to connect talented people, highly technical experts in blockchain, DeFi, Crypto, etc... with companies that need these experts. . I appreciate the usefulness of this platform because there has never been such a useful platform in the world. Blockchain, DeFi, Crypto, Metaverse, ... are new technology trends, so there is a shortage of experts. And the companies that develop these technologies need even more experts, and talented people to collaborate with. Your proposal solves the goal set out in the Challenge as a developer ecosystem, it acts as a middle ground as a bridge to meet the needs of both parties. You've identified a problem that needs to be solved, there's a solution to it, and I'm especially excited when the problem not only has a solution to it but adds value to the Cardano ecosystem. This is very valuable. I hope that in the future there will be many similar proposals developed on the Cardano blockchain. It's also a way to scale and tackle future challenges. I realize that the world urgently needs similar proposals in different fields, specifically in the fields of agriculture, industry, gaming, health, etc... Because every profession needs professionals. experts, talented people with the best qualifications in that industry. In summary, I strongly agree with the impact that the proposal has brought. I vote 5 stars.", "q0r": 5, "q1": "You have experience working on the largest media site about Cardano (Cardanofeed). Those are valuable experiences that not everyone in the media can have. Your team members also have certain experience in e-commerce, software development, marketing, etc...and some of them have held senior and other positions. and have a certain capacity in the organization. This increases the community's trust in the team. One thing I find very satisfying is that all core members have a Linkedin social network link to publicize their identities and profiles. I'm sure the community is also looking forward to this because through it, the identity of each individual is disclosed clearly and transparently, step by step confirming the feasibility of the proposal. The credibility of the team is made clear through the document cited by the website Cardanofeed.com. There aren't many proposals that reveal the identity of the team and its members as clearly as this one. The detailed budget analysis also speaks to the professionalism of the team. In the proposal, the budget is divided into sections, which are reasonable with the set goals and the cost of each work part must be close to the price applied in the market today. It is also the honesty of the proposal. I appreciate the feasibility of the proposal through the specific budget to have been presented. However, I have a question regarding the budget: If funding has not been received from Catalyst, will the team continue to work on the proposal? At that time, does the team have any other funding sources to support? My questions are positive and are only meant to clarify the feasibility of the proposal.\nRegarding the plan and implementation method, the team clearly stated the work parts that are divided evenly over the months according to certain progress. I like this professionalism. When looking at the plan presented in the proposal, the community will immediately understand that the team is well prepared: from the initial steps such as designing the foundation structure to the UX/UI research in turn. for the website...and ending with the official launch of the platform and communication with media partners. I found that the sequence of execution of this plan is very similar to what you showed at Cardanofeed. I'm happy with it.\nRegarding the resources needed to implement the proposal, in addition to the core members, the team also has 7 other collaborators who are professional and highly specialized. I know that some members of the team have already made other proposals at Fund 9, I hope that the team can still assemble the best people to implement this proposal as well as the team presented. display.\nOn the technical side: I would like the team to elaborate more on the so-called specialized and fragmented platform that the team has been talking about through the technical elements. Because this is also one of the ways to increase the feasibility of the proposal. Everything the team has presented in the proposal makes me and the community understand the idea, but the technical aspects are still vague. Therefore, I hope that if possible, the team will analyze them more closely the technology and go deeper into the techniques applied in the proposal to implement in practice.\nI agree with the challenges and risks associated with the implementation that the team mentioned in the proposal. However, I would like to mention another risk that Ada's price slippage affects the budget when the team implements this proposal (provided that this proposal must be approved for funding by Catalyst). The team can consult with me to improve the proposal. And I would like to add that if more funding is needed, the team must come up with a specific, verifiable plan.\nIn summary, I strongly agree with the feasibility of the proposal, my suggestions and questions are for the team's reference. I just want to give positive comments to contribute to perfecting the proposal as perfectly as possible. I vote 5 stars.", "q1r": 5, "q2": "The milestones for the tasks to be completed are clearly outlined. I am satisfied with this. However, I would suggest that if the team presents work that needs to be completed on a certain schedule and ties the work to specific months of the year, it would be great to demonstrate transparency about the auditability of the team. offer. For example, to-do items for January, February, March (this is just an example). Thus, it is more convenient for the community to evaluate work progress, thereby increasing transparency and auditability. I find the idea of ​​developing projects through Catalyst KPIs a very creative idea. This proves the team's commitment to Cardano and Catalyst. If the team adds more key metrics, it is good to increase auditability. Because we all know how important KPIs and key metrics are to verify auditability and transparency. The team also defines how successful a project is by a series of numerical criteria, but I have not seen a specific number to reflect this. Hope the team considers and adds more to the full. Throughout the proposal, the team clearly and easily described all problems with a reasonable solution (except for the technical verification as I said when commenting on the feasibility of the proposal). ). With my constructive suggestions, the team can refer and supplement. I agree with the auditability of the proposal. I rate it 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 9, "ne": 5, "ng": 3, "nfo": 1, "vca_o": 2}, {"id": 3467, "q0": "The idea of having a dedicated platform for blockchain talents is great as this is indeed a niche universe that is still emerging and companies might find it difficult to find the right people just as the talents might find it hard to find jobs. Naturally, this brings a great alignments with challenge as it can boost the ecosytem and a attract more developers. I also see it aiming at potential directions stated in challenge description such as \"Support structures\" and \"e the tools that we need to prioritize first\".\n\nRegarding the proposal itself, it does a good job on presenting platform value proposition and, a previous survey was carried out to identify the challenges and they were properly mitigated. It's excellent they already considered an automated exporting and importing between platforms functionality.\nWhat could be further added here though is what features this platform will have, that are more specific for blockchain, other than just the telents and the available jobs themselves. Maybe it could work for sharing events or even work like a forum to have discussions and users learn with each other. Other thing that could be better ellaborated here is about the business model that will make the plataform financially sustainable. It says it will rely on fees charged from users but it could explain more how it will work (for example, if any user would have to pay or if it would work on a freemium model, if companies would be charged more, if there would also be any ads)\nAfter platform is implemented, I'd also suggest to look for partnerships, specially with trainings and learning platforms, so users have a easier way to improve their skills.\n\nAll in all, however, this is a valid idea and a fine proposal, aligned with challenge. As my comments here are more of smaller suggestions, not information that is really missing, my rate is 5.\n\n", "q0r": 5, "q1": "There's a really nice plan in place, time-framed and the acitivites have all a good level of details on how and what is going to be done. I liked they already considers a step to validate with key users first before the actual launch.\nBudget breakdown is sensible and reflects project scope and timeline. The amount of time for each cost is also provided (when applicable) which gives it more transparency.\nThe team has 3 people already committed with background in software engineering, e-commerce, digital marketing and Cardano, which should cover all project fronts. Linkedin links are provided just as a good level of description for each team member. \nI dont see any major hurdles in feasibility and hence my rate is 5\n", "q1r": 5, "q2": "Auditability part is really complete. It provides several good kpis with targets and a montly reported will be issued in Cardano feed, which will help comunity to track progress along the implementation. It's also possible to get good milestones from project, which I believe will be the ones communicated in the report. \nIt's also excellent that feedback is considered and improvements will be made based on them.\nmy rate is 5 as I strongly agree that project is auditable.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 6809, "q0": "A goto platform/hub for project owners to get reliable and professionals with different knowledge in developing blockcahin applications is a needed infrastructure in the Cardano Ecosystem. I personally have been in projects who have very good ideas and projects but have no direct reach to developers who can help them develop those ideas into products. The proposer identifies these problem and seeks to provide a solution for same.\nThe proposed solution is to build a specialized platform that will serve as a goto place for companies and project owners to find and connect with professional developers in different aspect of blockchain development. The solution will feature a powerful search engine that will filter keypoints that are relevant to users searches. However, i cannot categorically find how these solution directly impact the Cardano community and or increase adoption of the Cardano blockchain. Similar solutions are in existence already that does not necessarily leverage blockchain technology and yet provide excellent services.", "q0r": 3, "q1": "The timelines and KPIs provided is detailed and well structured. The timetable and implementation plan seams realistic and adds up. Resources like website wireframe, interfacing, design tweaks,users validation etc that are provided are relevant to the project. \nThe requested budget amount is fair and reasonable considering that all projections is for the period of 5months. There's detailed information about core team members with information about their previous works and contributions to the Cardano ecosystem. The team as well as their implementation plan seem fairly structured and i have confidence in them although the proposal does not seem to have much direct impact to the Cardano blockchain.", "q1r": 4, "q2": "I was provided with sufficient metrics and KPIs which are relevant to measure the progress of the project. The team will also keep their community in the loop with progree reports, there will also be regular updates on their social media channels. Furthermore, there's an articulated metric proposed and in place to determine how a successful implementation of these project will look like.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 7550, "q0": "Effective Problem Solving Challenge this is the place to find and contact highly technically skilled talent and experts in blockchain, Defi, Crypto, Web3, Smart Contracts, NFTs, Metaverse, and Many programming languages ​​used in blockchain. This proposal can scale up the challenge and add a lot of value to Cardano, it helps more people know about Cardano. The solution has clearly defined a platform that will connect experts with high technical skills in blockchain, Defi, Crypto, Web3, Smart Contracts, NFT, Metaverse, and programming, with companies seeking solutions from this expert. This solution can solve the problem of the challenge. In previous seminars the author faced 2 main challenges in their platform: Getting blockchain experts to list their expertise, skills, and knowledge on a new platform and bringing companies and projects interested in discovering, contacting, or hiring professionals with the skills and competencies to meet their needs. However, they also have a way to solve the above challenges which proves that this is a potential project worth keeping an eye on.", "q0r": 5, "q1": "The author has provided a complete blueprint with clear timelines. The timeline is divided into 6 months by the author, and the author lists in detail what the to-dos are for the month and also aims to achieve them within a certain period of time. The progress of the project is also easily trackable through the web links that the author has listed. Success is clearly described by the author as the results achieved are: number of talents established, number of profiles contacted, number of skills and competencies registered, feedback validation and background improvement foundation. This success is linked first to the challenge of the campaigns. The solution of this proposal is that the team will develop a segmented and specialized platform to connect companies and projects with highly qualified professionals with skills and competencies in blockchain, DeFi, Crypto, Web3, Smart Contracts, NFTs, Metaverse and many programming languages ​​are used in blockchain. These solutions can address the current challenge of the team.", "q1r": 5, "q2": "KPIs are clearly defined, the proposed future implementation plan is very detailed and complete. Performance metrics are complete and clear.\nAuthors will provide the community with some kind of progress report as they go along, in the form of a monthly news release on the Cardano Feed, to measure the progress of their proposal.\nThe author will also provide a board to be disseminated in the Cardano Feed, with the development of the project according to the Catalyst KPIs.\nNumber of visits to the website: 50,000\nSubscribers: 5,000\nNumber of records available: 3,000\nNumber of partner companies: 50\nWith the above indicators show that this is a good project with adequate performance evaluation and measurement indicators.\nThe team will have a journalist, blockchain and crypto content editor, video marker, and presenter. The team consists of 3 main members working on this project the author seems very experienced and has a strong background: Otávio Lima is Founder & CEO at Cardano Feed, Felipe Barcelos is a Software Engineer and the full stack, Lucas Fernandes is a marketing assistant. The author also outlines what each member of the team has done, they talk about their previous experiences. They also link attached network links so we can easily follow their projects easily. The funding for this proposal is $49,500 less than 20% of the full challenge budget. The budget is broken down into logical expenditures, detailed and clearly listed for each item, this proposal provides the full metrics and KPIs that determine the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8696, "q0": "I can envision the platform – the main product of this project will work almost like the Linkedin platform allowing companies/projects to search for profiles, and connect with candidates/experts/developers suitable for them. But in this platform, the level of concentration will be higher when their main users have career contexts related to the field of information technology, blockchain. This is a very good idea and it benefits all parties involved. For companies/projects of any size, this will be a time/cost effective source of new talent tapping. For candidates/experts/developers will give them one more career search opportunity. For the Cardano blockchain, the successful connection of the company/project with the right candidates/experts/developers will further boost the work efficiency and quality of activities on Cardano. To sum up, the solution proposed by the proponent can perfectly address the requirements of this challenge in the way that I envisioned in terms of its benefits for the three most stakeholders.", "q0r": 5, "q1": "The project development roadmap clearly describes the platform's architectural basis and key functional nodes. The roadmap is presented in a standard form as the project development stages, the tasks to be performed, and the output at each stage. This form of presentation is most effective for project management and project development tracking. Expenditure budgets are clearly analyzed for how the cash flows will be distributed to which categories, but we still need more detailed estimates of the hours worked for the positions mentioned to make it easier to assess the feasibility of the author's budget request. Through the presentation of the member leading the project, we can conclude that the working capacity of the two main members is completely consistent with the job requirements of the position that the two take on.", "q1r": 4, "q2": "The KPIs given based on the project output are ideal for measurement, although the proponent has set clear targets for each KPI, it is difficult to determine the effectiveness of the project if there are no specific milestones for implementing the indicator measurement. For example, if you reach your goal in 3 months, the project can be considered a success, but if it takes up to a year to reach those numbers, this project may be judged ineffective. Therefore, we need to be clear about the time to implement the goal from the beginning.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 8880, "q0": "While developing the projects sometimes , the team might  encounter shortage of members or even shortage of member for any particular role, hence this can cause the project to get delayed or even it might lead to abondan the project halfway , hence to create a platform where companies or projects developers can find the required personalities depending on their skill set ,experience or language is definitely a great idea to bring on, where it'll boost the developers without much pre planning required where they can hire experts in worst case scenarios, even if they fall of from some development in the future. hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The biggest challenge here for the proposer's team is finding the proper professionals and later listing them on to their website, the proposer's team has to find each professional and should make sure all the details of the professional is a legit about him/her, if the background is not checked properly later when any hired person gets to know that the professional was a fake , it would damage the entire platform in the future.\nThe team has over 800+ projects registered in the Cardano Ecosystem where they can make use of these contacts effectively to find the proper talents, with listing on website is achievable, hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit should have elaborated on what basis will the professionals will be listed on their website, and will they be making any tier's of depending upon the experience or talent of the professionals. The audit has showed us on how multiple search options and filters will be provided to make their website more efficient one.\nThe audit has displayed the experience of the proposer's team, and how they are involved in more than 800 projects until now, the audit contains neat budget breaking development and excellent timeline of the project depending upon the monthly scheme , hence he information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9140, "q0": "\"This proposal proposes the idea of creating a platform that can help companies and projects connect with experts in blockchain, Defi,Crypto, Web3,Smart Contracts,NFTs , Metaverse and many other programming languages. in blockchain.\nTheir platform has filters and multiple options that will help users find the right audience with the right elements.\nThey include an overview image of this platform in the proposal.\nThe team believes having a platform dedicated to aggregating talented people in Web3 will help attract companies to find and hire them. It is also convenient for recruiters not to have to look far.\nTheir project has two challenges: search, convince experts about the credibility of the platform and helping companies or projects discover, contact or hire appropriately skilled professionals on the platform. They also specifically outlined solutions to address these two challenges.\n\"", "q0r": 5, "q1": "\"They come up with a six-month plan and list out all the activities for each of those months. \nThey also have other projects on Catalyst, but since they have a team of 7 collaborators working with them, they have been able to coordinate this project steadily. They already have a bank of technical experts waiting to be hired.\nIn the budget section, they specifically list the amount to be paid for project activities and the salary of the required positions.\nThey list the key people working on the project with clear summaries of their experience and skills along with LinkedIn links to verify their information.\n\"", "q1r": 5, "q2": "The team will report their project progress to the community through the Cardano Feed. They also have specific KPIs that the project wants to achieve.Their success criteria are clearly stated and easy to understand. Through these indicators, the community can follow the project more easily.", "q2r": 5, "assessor": "z_assessor_3023", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10784, "q0": "Faced with the challenge of the Developer ecosystem, many solutions have been proposed in the spirit of creating a positive experience for developers so that they can focus on building successful applications. I have read through many proposals under this challenge from fund 8 to fund 9, such as educational programs, technology solutions to shorten operations, save time and money, and full-featured hackathons. And in your proposal, I know another impressive solution: an environment of active contact and exchange between companies and projects with highly qualified professionals. The proposal briefly introduces its solution and provides a list of topics searched on the platform. Readers can clearly perceive the strong relationship between this solution and the challenge through a rational explanation of the platform's bridging function for the Web3 talent community. Building such a platform will not be straightforward, and there will be challenges in attracting organizations and professionals to join the platform. I notice that your team has proposed numerous sensible methods to mitigate these risks; however, I think they are insufficiently persuasive. What criteria will you use to assess expert qualifications? Can you share some of the names you're considering? How would you promote the platform to get more people to interact with it? Lastly, how will you protect user data on the platform? Please complete your Impact section by answering these questions.\n", "q0r": 4, "q1": "Your team demonstrates your broad experience having other projects approved on Catalyst by giving a clear and defined roadmap. The budget also thoroughly details the costs of paying the workers to carry out the stated activities for the project's six months. I appreciated the introductions by key members of your team in diverse fields of competence (Entrepreneur and technology enthusiast, Full stack and software engineer, Marketing Assistant), as it demonstrated the talent and passion your team has for advancing the blockchain community. I like your proposal because you addressed workload management (something that many other proposals in this fund 9 lack) and demonstrated to everyone that you could guarantee the quality of work while working on numerous projects simultaneously.", "q1r": 5, "q2": "You’re still in good shape for this final section after completing the Feasibility section well. Your proposal explains how you will report project progress and specified KPIs to determine future success to readers. Your figures demonstrate your team's sincerity and commitment to this project. Thank you for your support of the growth of the Cardano ecosystem, and best wishes for your future success.\n", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12623, "q0": "A platform that collects and verifies information about highly experienced blockchain experts and developers, allowing companies to connect these experts.The project effectively addresses the challenge.\nThe proposer states that he will contact each expert via LinkedIn - a very popular recruitment platform. Therefore, like the proposer mentioned, it will be difficult for the experts there to provide information for a new platform. I think your solution doesn't really solve this problem, I hope you come up with a better solution, for example you can even gather information from experts through face-to-face meetings , that will improve the accuracy of the received expert information.", "q0r": 4, "q1": "Thank you for providing detailed information and experiences of team members. You said you will be collaborating with 7 other collaborators, but I have not seen any information about these collaborators, I hope you will complete this section. The project's roadmap is presented very clearly with 6 months and specific tasks, you should add who will be involved in each phase, for a project with a high volume of work, the assignment should be clearly stated. The budget is also well explained, it is quite easy to understand how it is used, I have no opinion on this part, as I think the information provided is satisfactory.", "q1r": 4, "q2": "The proposer outlined how the community can track the progress of the project through a table that is disseminated in the Cardano Feed, with the development of the project according to the Catalyst KPIs. This makes me feel more secure about the audit of the project. The KPIs given are reasonable, I suggest you can measure the success of the project by the number of experts successfully connected to the company, this shows the effectiveness of the project. I have no opinion on this part, I think I can trust the auditability of the proposal.", "q2r": 5, "assessor": "z_assessor_3445", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 13823, "q0": "A segmented and specialized platform where blockchain talents can find each other certainly addresses the challenge of improving and enhancing the Developer Ecosystem in Cardano Community. This powerful tool will help professionals, entrepreneurs and dapp programmers find the talent they need for their projects. Also it is an interesting way of creating community dynamic and social exchange between blockchain programmers and developers. Companies will be able to find more effectively the talent they need. In the same line, Cardano Catalyst projects will enjoy a more variety of talent at the time of choosing team members. This kind of project is a key milestone for Cardano Catalyst challenges and goals. If the community communicational channels are dynamic and effective, it is more likely their proposals and projects achieve goals and therefore success.", "q0r": 5, "q1": "This team has already several projects working on Catalyst and have the needed experience and knowledge to implement successfully every plan they design. Nevertheless, the plan presented is clear and consistent, dividing the key milestones into a monthly segmented timeline. This team is confident they will not need further funding in Fund 10 and become self-sufficient. It might be interesting that although the project does not limit only to Cardano talent, they find a way to link the talent platform with the Cardano Catalyst community for the improvement and expansion of it.", "q1r": 5, "q2": "A monthly report released on Cardano Feed is sufficient to audit the progress and the success of the proposal. It might be interesting that besides the numbers, the auditability also relies on the variety and diversity of talent that upload into the platform. Cardano Community is not only focusing on effectiveness and numbers but also into an inclusive improvement of the Developer Ecosystem. Only an inclusive transformation can lead into a real and complex, creative and really groundbreaking potential of blockchain technology. A strong media strategy might be needed to explore the potential of this perspective. ", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "A platform that will connect professionals with high technical skills in blockchain, DeFi, Crypto, Web3, Smart Contracts, NFTs, Metaverse and programming, with companies that seek these professionals", "experience": "The team will feature a journalist, blockchain and cryptocurrency content editor, videomarker and presenter. Conceived and produced by the CardanoFeed team, the largest media specialized in Cardano coverage. We already have over 800+ projects registered in the Cardano Ecosystem."}