{"id": 418957, "author": "juliane", "title": "Empower thru Project Based Learning", "url": "https://cardano.ideascale.com/a/dtd/418957-48088", "category": 26597, "amount": 36000, "description": "There are not enough project based learning (PBL) formats available for DEVs to become blockchain DEVs and deliver on the work ahead.", "f6_no_assessments": 7, "f6_rating": 4.857142857142857, "videos": [], "media": [], "f6_assessments": [{"id": 716, "q0": "Yes, the proposal addresses the challenge setting by creating educational material it helps onboard new developers and gives existing developers an ability to learn Plutud smart contract effectively.  It also shows new developers that educational content is available. Project-based learning approach is an effective Hands-On learning experience that focuses on learning by doing. The project will run for six months and should have proved successful, then James will come back for additional funding. The Plutus smart contract language is a functional language that is quite different to all the other languages that programmers are used to. Having practical examples helps devs learn and practice algorithms that they might recognize but have difficulty implementing with this new language. I think the proposal is well align with the challenge setting", "q0r": 5, "q1": "The Proposal is the co-founder of the Gimbalabs team. He provides links to his LinkedIn profile and has relevant experience in creating teaching material. James has been a high-school maths and computer science teacher for the last 11 years, and he has published two math curriculums that are still in use today. While teaching, he tries to use new tools to facilitate deep learning. James will design and deliver the courses.  the budget is set at $36,000 which will cover a salary for James of $6,000 per month for 6 months this is a reasonable salary for a developer on Cardano. Should the program be a success, James will come back for additional funding in future funding rounds. The Proposal is divided into two sections the operational part which will hold weekly playground meetings, prepare the meetings, documentation and collect feedback. The Innovation stage is composed of self-study and skill up for the participants; design and development of more project-based learning formats and experiment with new designs of project-based learning. This format has been tried and tested with the Gimbalabs team. There will not be any new software developed there for no discussions I made about languages architecture.  James highlights the risk that there might be a lack of project-based learning expertise should something happen to him; however, two to three developers are already being trained to become the next teachers. James also highlights the risk that there might not be enough students to participate in the Project-based learning program; however, experience has shown that the previous iterations of this program by Gimbalabs have shown a lot of interest. A growing Cardano ecosystem will be conducive to more participants in the type of program.  I would be interested in joining the program when it launches. I would have liked James to elaborate a little more on how this proposal differs from the project-based learning programs that Gimbalabs run and why the submission is made by him rather than the team as a whole.  I have no doubts that James will be able to deliver on this proposal", "q1r": 5, "q2": "Yes, the roadmap is clearly stated; it will run over six months, and the educational content will be prepared and delivered by James. The KPIs are well-defined and will be measured weekly.  They focus on the number of playgrounds and project-based learning held, the number of participants, and the number of new project-based learning pilots launched. The success of this project will be to empower more and more developers to build on Cardano; create an environment that is safe for innovation, and creates success stories that become businesses. The deliverable is straightforward to audit as these are public courses that anyone can attend and view the recording afterward. ", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 953, "q0": "One of the key pillars of the Developer ecosystem challenge setting is the creation and maintenance of developer support structures.\n\nEducation is key to the support network of any developer community, and the Cardano developer community is no exception. This is especially true because it not only is a relatively new developer community, but it also operates under a totally different paradigm in the blockchain space given it’s eUTxo model and Haskell based programming. \n\nBecause of this, relatively few developers are familiar with the tools, methods and best practices. \n\nAs such, it is especially important for those who are familiar to share the knowledge they have accumulated if they are willing and able to do so. Over the course of the last almost two years, James and the Gimbalabs team have proven that they are more than capable of taking on this challenge.\n\nThe proposal is asking for funding to enable the continuation of the Project Based Learning program for the 6 month (July - December 2022).\n\nI haven't been a part of the Gimbalabs Project Based Learning workshops myself, but the people I have come across who have, are praising them. For the work they do and the methods they are developing.\n\nMaintaining this core education infrastructure is key to the future developer adoption of the Cardano stack, something I think we can all agree is fundamental to the general adoption of our blockchain. By funding this work it is my assessment that we are only paying for the planting of a seed, but our whole ecosystem has a chance to be impacted greatly by it, and we might end up enjoying a small forest.\n\nMy assessment is based on the over 5 years of experience I have in managing mobile app studios and the fact that I have been involved in the Cardano developer community since March 2021. For the last year, I have also been actively project-managing Cardano developers.", "q0r": 5, "q1": "The project plan and roadmap makes a lot of sense and is very simple to follow. It is actually a continuation of the PBL framework the Gimbalabs team already has in place. \n\nThe detailed budget breakdown is only a line, but that is actually not a problem in the case of this proposal as the allocation of funds is very simple: six-month compensation for a master educator. \n\nThe project is part of the Gimbalabs initiative and is spearheaded by James Dunseith the founder and core driver of the PBL project. He is a master educator with a vast experience in teaching. James’ LinkedIn page is also provided in the proposal and it backs -up and ads to the data provided in the proposal.\n\nDespite the fact that the new question related to work on previously funded proposals is answered as “Yes”, no additional details are provided in the main feasibility section as is now requested by the proposal submission form. However, I will not be lowering my rating because of this, as the question has been introduced in Fund 9 and the proposers may have not fully understood what is being requested of them, but, I do suggest the team include full answers on future submissions, especially as they have indicated that they will be returning to Catalyst to seek additional funds in the future.\n\nEven though it’s not provided in the proposal, the information about past funded Gimbalabs proposals and current fund 9 proposals is available at https://www.lidonation.com/en/project-catalyst/group/gimbalabs . This tool definitely helps the community see the volume of work that needs to be managed. My assessment is that the volume of work is more than manageable for the Gimbalabs team, especially considering that they are already implementing the project that is in the scope of this proposal and the requested funds are simply for continuing the project.", "q1r": 5, "q2": "From what I’ve been able to observe during the last year and a half, Gimbalabs have been very transparent with their activities and this project is no exception. The KPIs are straightforward and easy to follow as they focus on the metrics around the educational content that will be provided.\n\nThe definitions of success for this project are very well presented and they do a very good job of explaining the importance of this project by themselves, as they lay out all the benefits that a Cardano developer interacting with the Project Based Learning course would stand to gain.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 12, "ne": 3, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3546, "q0": "This is a project based learning proposal. The idea is to train developers to become proficient and be able to work and develop real world cardano decentralized applications. This is done through the project based learning approach .. meaning you work on actual project to gain your skills, which as a developer I can verify is the preffered and proven way to learn something new.\nThe impact of this proposal is sure to be great and has already been empirically proven to be so. The growth between version 1 and version 3 is amazing and is sure to be even greater further down the line when more people and trainers get involved. I would love to take part of this experience and learn something new because I would enjoy transfering my skills to the cardano ecosystem as I'm sure many developers are.\nSharing knowledge is a noble goal and I do appreciate the hard work and effort put into craeting the video content and all the documentation. I also love the open source learning concept, and the combination between a github project to work on and a youtube tutorial is becomming more and more poppular so I suggest to the proposers to consider it if they haven't already.\nThis proposal would give the skills to devs, in a short time, to become a self sustained business if they so choose and the opportunities in the cardano ecosystem are endless as I see it. Overall this is one impactfull proposal that matches the challenge settings, helping developers in their journey and helping them better educate themselves and help out business idea of others or develop their own.\n", "q0r": 5, "q1": "James Dunseith (co-founder Gimbalabs) is has all the credentials to teach people and has already proven to be capable. I managed to verify all the listed skills with the ones in the linked profile and with a bit of googling managed to find out more about the people that have passed his lessons and all seem to be appreciative and happy. In that train of thought I'd recommend to James and the proposers to collect success stories in the form of a short video made by a developer, because there's no better marketing than regular people speaking out for the benefits of the program and it's always nice to connect a face to a story, hence the videos.\nThe program will span 5 months till late december, which is a good timeframe based on my experience if a little too short, but with the right motivation it's farr from impossible. There will be weekly playground meetings that will help developers get to know the program and each other better and make colaboration easier.\nThere's a sensible plan for implementation and all the relevant details will be documented as mentioned several times. Testing frameworks will also be a topic which is overlooked in other such projects which is a sin if you ask me. A tested application is a reliable one.\nThe budget seems reasonable, considering James does this only and is entirely focussed on it. The hourly rate is a bit low if you ask me, but that makes the value / cost ratio even more appealing for voting it in, which I encourage all voters to do. This is a negligible amount compared to the value it will bring long term. \nOverall a feasible solution to an importan problem. No devs means no ecosystem growth because it's a digital world so we need digital gurus to be generated. Good luck to James in his endeavour.", "q1r": 5, "q2": "I love the definition of success where his planning on passing the torch down the line and expanding the PBL programes to more than one. This is a worthy goal of a true educator.\nThere will also be all kinds of content related to the learning process like documentation, technical video content and discusstions. These are all great if you want to learn later on or at your own pace in your own time.\nThe problem is worth solving and we need people with this long term vision to solve the problem in a lasting way. The proposed solution is more than reasonable and as I already mentioned it's value compared to it's cost is huge. All and all, an auditable proposal.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6812, "q0": "Education and learning leads to a reliable and resilient community of informed people. Cardano being a collective DAO community with one major goal of becoming the global operating system of the world also needs unlimited models of educating and empowering developers with project based knowledge. Developers however are faced with issues of inability to build industry standard financial applications on Cardano. The proposer intends to create a platform where already existing Haskell developers will be empowered to build on Cardano using plutus. Developers will be guided and provided with peer reviewed approaches, providing open source learning opportunities, Project Based Learning environment, feedbacks and a sound network of innovative people will be empowered and eventually upskill developers to become blockchain developers. However, these proposal fits these challenge category.", "q0r": 5, "q1": "The proposer made available a well defined roadmap that covers major operations and key innovations that have been accomplished and the ones that are expected to be accomplished. Some of which includes weekly playground meetings where participants will discuss progress, Project Based Learning meetings (About plutus). The project, (Gimbalabs) have a track record of professional guiding, grooming and upskilling some notable individuals who are currently working with projects building on Cardano. With these, I undoubtedly believe the team behind the project that they will effectively implement the project. \n\nThe budget also is solely for the compensation of the gimbalabs instructor for 6Months (6k/Month) which is in my opinion a fair and reasonable amount considering the huge task been taken up by the instructor (I happen to be one of his student anyway) not been biased,  but you can checkout Gimbalabs and make a research out of it. However, I feel the need for the project to onboard more developers/instructors to assist the one instructor currently pioneering the project.", "q1r": 4, "q2": "Considering previous metrics and KPIs mentioned earlier, the proposer further  provided more metrics that can be used to track and measure progress of the project both on a short term and longterm basis which although needs further development (to ensure sustainability) but are reasonable and relevant to the project. For example, Project Based Learning (PBL) design, curricullar focus topics, infrastructure sophistication support and documentation etc are important metrics to measure progress and overall success of the project. With all the milestones accomplished and information provided, I believe the team is set to attaining it's set target/goal.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 7596, "q0": "The problem described in this proposal is closely aligned with the challenge. The proposer clearly provides precise solutions by providing a series of meaningful events by providing innovative Project based learning and also empowering them to build more developers in the ecosystem. The proposer also captures key important metrics under the campaign breif by mentioning some of the key values  such as the number of participants including both developers and non developers will to widen the network of developers .\nThe proposal is able to scale to the sustainability of the project to develop the ecosystem.\nThis i think is highly commendable and will help promote the Cardano ecosystem.", "q0r": 5, "q1": "The proposer has alot of experience based on the previous fund and successfully implement the proposal. The proposer provides relevant links which shows the skills and experience needed to implement the proposal.\nThe proposer has not been able to provide team members which I suggest should be considered despite having experience in the field of training developers. The budget provided does not provided a detailed breakdown of the budget into identifiable bits of information. Even though the budget is reasonable to achieve the set goals.The proposal also outlines the milestones by providing a duration of July 22 to December 22.\nAgain,the proposer has been able to provide sustainable plan on not only what is to be done but also how to implement the project.\nThe proposer has considered the risk involved such as missing out participants which they intend to intensify the format.", "q1r": 4, "q2": "The proposer and team has provided a clear outline on how to measure the progress of the project should they be funded . They have provided key milestones to look out for such as Pre and post work of all meetings held, uploading recordings and documentations.\n The proposer has also indicated how Progress will monitored on weekly bases since all formats (playground and PBL) are held on e weekly basis. Furthermore Plutus PBL will have a defined learning goal driven curricular which is self-tracked by all participants. The proposal provides the key metrics such as the number of Playgrounds and PBLs and also the number of new of new PBL pilots. The proposer is already facilitating a lot of programs and intends to train many developers to the Cardano ecosystem.\n", "q2r": 5, "assessor": "z_assessor_2906", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8894, "q0": "We have seen many developers who wants to teach students Plutus and Haskell but later student will just forget what they have learnt , in many scenarios people are not able to implement what they have learnt into real time projects , Hence to counter such major issues the proposer wants to implement Project Based Learning which will lead to massive to improve students soft skills, where they can add these projects developed in Resume so that it'll definitely help them in future, student  must get an idea on how the work implementation will be present in companies, so that they can suit up to the environment in quick manner ,Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed task doesn't involve any risk involved in it, where it just good teacher who can engage classes and help students through Project Based Learning , this task has already be assigned to James  who has proven records of onboarding devs to the Cardano ecosystem by providing essential open-source learning opportunities to upskill devs to become Blockchain devs. Hence with the expert already present the task can be achieved easily without further barriers. With proven experience of the proposer plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has displayed proposer's experience in development field and also his proven experience in creating systems and tools that support students , the audit even contains how this PBL technic can impact students future in development of blockchain.\nThe audit has decent timeline of the project and simple budget breaking idea , with easy key indicators to measure the success rate of the project which involves number of participants , number of projects conducted and completed, with great vision to improve the skillset of the students, and minimal risks involved in the project the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 10334, "q0": "Empowerment through Project-Based Learning\" was written by James Dunseith. This proposal not only appealed to me for the effective application of the PBL learning method but also expressed my admiration for James Dunseith from a man. Math teacher honored as both Math for America and BetterLesson Master Teacher and co-founder of Gimbalabs.\nPBL is understood as Project-Based - Learning. It is a student-centered learning method that directs students to acquire knowledge and skills through embarking on a specific project to solve a problem. Students will go through a process of discovery and discovery to solve a challenging project that requires thinking. This is an active, effective learning method that helps students directly apply what they have learned.\nWith this powerful learning method, James Dunseith applies it to introduce developers to the Cardano ecosystem by providing the open-source learning opportunities needed to upskill developers. Become a Blockchain developer.\nBy piloting the \"Plutus\" Project-Based Learning (PPBL) project series, developers gain experience with Plutus. Other projects are also being planned and are tested, We can see project schedule information here: https://www.gimbalabs.com/gimbalgrid/6\n\"Product is\"Gimbalabs Playground\": This is a weekly meeting format where community members and (not yet the community) can share ideas, present a project, and receive feedback from many colleagues.\nThis is also the tool and also the way to attract developers from outside the community to participate in the Catalyst project. The proposal aims to build networks by fostering relationships with individuals and groups in the Catalyst community.\nThis project has been successfully tested and applied from July 2020 to the present. I realize this is a long-term, sustainable project that James is aiming for. From the analysis points, it shows that the proposal is completely consistent with the challenge criteria of Developer Ecosystem set forth.\"\n\nThe proposal outlines possible risks, but those risks are small and can be overcome.\n\nI completely agree with this proposal.", "q0r": 5, "q1": "The proposal has a detailed plan and roadmap for implementation seriously. The proposal starts from July 22 to December 22 and will be implemented in 6 months.\nJames is currently interacting with developers to share his experience and support skills, Developers\nWatch the video here: https://youtu.be/CWTAU3DZxsY\n\nThe requested budget of $36,000 is calculated as follows:\nJames PBL Expert Salary Budget: $6000 per month x 6 months: $36000\nThe proposal focuses on providing funding for the mind work and activities James is required to invest in in the context of providing the playground, and actual and future PBL formats. James focuses on this job completely, so asking for a budget to pay his salary to serve the community, is a reasonable budget.\nOn the other hand, this proposal is a continuation of the already funded Fund 8. In Fund 8, this proposal was submitted to the Open source development ecosystem fund, currently participating in the Developer Ecosystem challenge is completely suitable for the challenge posed, because this challenge is a continuation of Fund 8 dedicated to the system. open-source developer ecosystem. See information here: https://cardano.ideascale.com/c/idea/404918\n\nJames Dunseith is a Teacher, Coach, and Moderator with experience in teaching, computer science, creative writing...and also a Gimbalabs operator. James has successfully tested project-based learning and proficiency-based grading. He was named a Master Teacher of both Math for America and BetterLesson.\nWith his experience and expertise and background, he is believed to have completed this thesis excellently.\nInformation about James is here: https://www.linkedin.com/in/james-dunseith-0135651/", "q1r": 5, "q2": "There are clear metrics and KPIs. Progress is measured weekly. The schedule of activities ensures progress. The good thing is that Plutus PBL will have a learning goal-oriented curriculum that all those who are interested in learning. participants can follow themselves: https://www.gimbalabs.com/gimbalgrid/6\n\nSuccess for the Cardano community - capacity building (development and education), Success for ideas to become businesses - creating a micro-environment for creativity and connection to the wider network.\n\nThis proposal is a continuation of the Fund 8 proposal: https://cardano.ideascale.com/c/idea/418957", "q2r": 5, "assessor": "z_assessor_3181", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Innovative PBL concept to empower developers to build on Cardano, incl. opportunity to access peer-experience & feedback & network", "experience": "James Dunseith (co-founder Gimbalabs) with proven track record of onboarding devs to the Cardano ecosystem by providing essential open-source learning opportunities to upskill devs to become Blockchain devs."}