{"id": 419066, "author": "jackie", "title": "Dev-focused Learn-and-Earn Quests", "url": "https://cardano.ideascale.com/a/dtd/419066-48088", "category": 26597, "amount": 110000, "description": "There is a shortage of developers developing on Cardano globally, specifically Asia, and there is still a lot of room for improvement in top-level developer acquisition for the Cardano ecosystem. ", "f6_no_assessments": 8, "f6_rating": 3.916666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 3284, "q0": "This is an almost gameified reimagining of the classic hackathon workshop model (which the team is also proposing elsewhere) where instead of a handful of winners competing for a limited, but comparatively large reward pool, many participants collaborate towards smaller incentivized milestones spread across more tasks, something they call \"quests\" over the course of a \"campaign\".\n\nThe proposal seeks to build out an initial campaign with quests built around onboarding developers to Cardano documentation.  As someone who has onboarded themselves via the docs, I can say that even a motivated self-learner would benefit from community and incentives to maintain focus through that process, so I definitely think there is value to be found here.  \n\nLike hackathons, the deliverable here isn't to have a persistent self-guided learning environment that is \"always-on\" but rather to create the content and run the first version of an event-style campaign, so voters should not imagine that this is a constantly running rewards platform.  Like any event it will necessarily have to limit participation (which they do expect to be around 1500 developers, 10% of which will complete the campaign and create a dapp) to the resources at hand, which includes not just the rewards pot but also the roles responsible for validating and ranking submissions and administering the whole thing.\n\nIf there is an issue here, it is that this doesn't have a clear path for sustainability drawn up here (they indicate more funding from Catalyst to continue to provide these campaigns in the future).  Because of this, the only source of scaling would be to build out more campaign materials, when what you really need is to scale towards adding more and more participation to what is already created.\n\nBecause the project is a solid idea for event based onboarding of developers, and because it seeks to reach so many in its prototype version, I believe there is strong impact here.  However, because of a foggy vision of sustainability and scaling I have to mark it down by one star, for a total of 5 stars for Impact.", "q0r": 5, "q1": "The team has already developed the basic prototype for the platform, having run multiple campaigns on HTML, Python and others, so they appear to have a good plan in place.  What this proposal comes down to is really 2 pieces:  create the Cardano campaign module and training guide for their reviewers, and then optimize the tools for onboarding, reviewing and incentivizing the participants.\n\nThe module seems straightforward, and looking at the list of quests for Rust, it seems like they should be able to get a very basic module built out for Cardano in 8ish quests.  The onboarding gets trickier.  I signed up for an access token to the python campaign (which shows that gating quality I mentioned...not a problem, just a limitation) and the questions they asked seemed to be about how to parse the list of applicants down if they had to.  Finally, the overhead for the project involves some kind of hand reviewing of submissions that isn't described here.  The success/fail metrics of such a process seem relevant to me here, but that point of clarification doesn't warrant getting marked down on the proposal.  \n\nAnd then obviously rewards distribution is critical.  There is no indication about whether they will be requiring crypto or Cardano wallets (bonus points if they are) or if they have or need to integrate a payment processing protocol.  It seems like an adapay integration would be ideal, since the money is going out, not coming in, but there are a whole host of issues that this creates.  $30,000 is earmarked for these distributed rewards, and 1500 participants are targeted.   There are real fairness and compensation concerns around basically \"failing\" participants who can only make it part way through the material, and whether there are time limits for retrying, and many more details that actually make this what it claims to be.\n\nBecause there is work already done and the team has a good idea of the team members and roles required, there is a solid foundation for the feasibility.  However, due to the lack of details that would indicate fairly compensated participation, I feel that this proposal loses a star for ability to successfully realize the full scope of its intentions.  4 stars for Feasibility.", "q1r": 4, "q2": "Outside of the provided website that currently doesn't have any way to contact or learn about the team (you can submit an application for an access token, but that isn't the same thing) there really isn't any presented access to the team or means for them to be available to the community.\n\nThe creation of the campaign module, which will consist of 8 quests creates easily auditable beats over the first 3 months, and then for the last three months it has the quests to monitor, rewards to distribute, so again, it seems like they should be able to measure progress and populate the monthly reports.\n\nThe KPIs they will report are the number of developers to sign up and the number that complete the campaign, among whom, they expect to fork and deveop a Dapp on Cardano, so that also functions as a success metric for measuring impact.  They are targeting 150, which sounds high, if everyone of them is creating a dapp (however many dapps could be personal tools like address or policy queries).  I would have liked to have seen some kind of reference that put the 150 number in context, but that isn't worth marking the proposal down.\n\nBecause the project has included specific targets to reach over a clear timeline, the auditability score is solid, however I have to downgrade it by one star due to a lack of ways to follow the project and because the team does not seem readily transparent and available.  4 Stars.", "q2r": 4, "assessor": "z_assessor_2436", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "To elaborate on the review process, our team of reviewers led by Rachel Lee (https://www.linkedin.com/in/rachel-kn-lee/) will assess the submission from the students. In our quest design, we use quest-specific rubrics to ensure that there is learning done, e.g., screenshot of a terminal, or output in an IDE indicating that code was run successfully. This is a laborious process, but is great because it ensures learning outcomes are met and we can detect cheaters easily. \n\nWhen our students or Stackies complete the challenges, we will distribute money into their ADA wallets. One of the quests that we design will involve them setting up their own wallets that do not require downloading the entire blockchain, e.g., Yoroi light wallet. \n\nFrom a sustainability standpoint, we do have clients using StackUp to scale their respective ecosystems and the platform is already up and running. This is good for two reasons, i.e. firstly we already have a proven business model and we can sustain ourselves as a business and secondly we don’t rely exclusively on Cardano grants to continue running.\n\nWe have received the feedback on the team being uncontactable - that’s something we will work on. For most parts, external parties have been successful with engaging the the entire team who are contactable on our Discord (https://discord.com/channels/895564164783808523/895573585484214342)\n\nThank you for your lengthy feedback! Really appreciate it. "}, {"id": 3206, "q0": "The proposal identifies correctly a problem and presents a solution related to this problem. In addition, the proposal is well related to the challenge, as it builds a developer ecosystem and brings more developers to Cardano. The system of learn-and-earn is also an intelligent solution to incentivize learners to conclude their studies, and the idea is potentially scalable. In this case, a score of 5 is fair to this item.", "q0r": 5, "q1": "The requested budget is relatively high for the proposal, but it is well described. However, they have provided no information about who are the people behind the proposal. In their website there’s also no information about the team behind StackUp. As there’s only information about the proposal’s leader, it seems that the team still has to be completed – which is not a problem per se. But this creates a lot more of workload to the leader and it might not be feasible in the timeframe planned for it. Especially because this is a big proposal with a big budget to administrate. On the other hand, one can assume that there’s indeed information missing, as the section that summarizes the relevant experience of the team says: “Core team of 10 members with experience running 28 learning campaigns”. But then, in the description of the team, no name appears, nor links with evidences. Therefore, a score of 3 is reasonable for the feasibility item.  ", "q1r": 3, "q2": "The proposal has a good view of success and addresses well the problem it focuses. And it has a detailed roadmap that describes the main phases. On the other hand, the proposal lacks a good explanation of what will be measured to track its progress. They provide information about their goals (e.g.: “to engage 1,500 Web2” and so on). But they did not explain how the execution of the proposal will be tracked, that is, how will they follow up with each deliverable or milestone that is necessary to achieve the goals once the project is concluded. If the proposal could provide concrete and clear KPIs, it would have been easier for the community to audit its progress. Therefore, I believe that it a score of 4 is reasonable.", "q2r": 4, "assessor": "z_assessor_2409", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "We are touched by the PA’s concern that the leader will be taking on most of the workload. The team is definitely complete, and we’re sorry we didn’t list every single member in the team as most of the members are responsible for operations. \n\nHere are the key members (StackUp is under Tribe):\n1. Ng Yi Ming: https://www.linkedin.com/in/yimingng/\n2. Ryan Chew: https://www.linkedin.com/in/ryan-chew-zi-jie/\n3. Jackie Tan (me): https://www.linkedin.com/in/jackietanyen/\n4. Rachel Lee: https://www.linkedin.com/in/rachel-kn-lee/\n5. Nicholas Hong: https://www.linkedin.com/in/nicholashongyk/\n\nWhile it seems that we spend the money ONLY internally to create content, we also engage native developers who are familiar with blockchain development. In this case, it is Plutus. For example, Josh from Josh’s DevBox is a good candidate to engage (https://www.youtube.com/watch?v=5lwOJmS5BsU&t=6s) and the budget (TBC) does go to these creators to create high quality content for the quests. \n\nFor auditability, we plan to present our results, e.g., key metrics, in the regular town hall so that members can observe the impact of the quests, and subsequent teams formed to join the hackathon as outlined in our sister proposal. We will also work with IOHK to publish the statistics for transparency.\n\nDuring the StackUp campaigns, individuals are welcome to ask questions or get information in our Discord channel (https://discord.com/channels/895564164783808523/895573585484214342) because we open up channels for the students to get help.\n\nThank you for your feedback! "}, {"id": 5110, "q0": "This proposal aims to launch a campaign targeting general developers on developing in the Cardano dev ecosystem. The campaign would be carried out on an already well-known learning platform, StackUp. The people behind this proposal also came from StackUp. StackUp is a unique learning platform because it offers a Learn-to-Earn model, where learners get paid some money when they finish a particular learning milestone. This could give a massive incentive for aspiring Cardano developers when learning the entire ecosystem. With that in mind, this proposed campaign goal is closely related to one of the challenge’s main problems: attracting new developers to the Cardano community.", "q0r": 5, "q1": "StackUp is already a rapidly-growing Learn-to-Earn learning platform in the community. The leader of this project has an impressive leadership track record, with his LinkedIn to back it up. The team behind this proposal came from StackUp itself; this ensures that the people working on this proposal have enough experience building a similar project. The proposal also includes details on people working on this project, with a laid-out job description. The budget plan on this proposal is also laid out and quite reasonable. A total of 72% ($80,000) of the proposed budget goes on to building the content itself, curating, and rewarding. A planned timetable with milestones is also presented with enough detail to support the primary goal of this proposal. Potential risks and challenges are acknowledged, and the author has outlined ways to mitigate them.", "q1r": 5, "q2": "This proposal has provided some ways to assess the progress in attaining its primary goals. The proposal has quantifiable metrics; it defines success by successfully engaging 1500 participants in the proposed campaign and 150 developers that would follow through on creating a dApp. One thing that kept me from giving a perfect score is that this proposal has not addressed a way to deliver regular reports to the community. It would be helpful if the author could lay out ways of regular reporting using an already existing channel such as StackUp’s Discord server.", "q2r": 4, "assessor": "z_assessor_2672", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "For auditability, we plan to present our results, e.g., key metrics, in the regular town hall so that members can observe the impact of the quests, and subsequent teams formed to join the hackathon as outlined in our sister proposal. We will also work with IOHK to publish the statistics for transparency.\n\nDuring the StackUp campaigns, individuals are welcome to ask questions or get information in our Discord channel (https://discord.com/channels/895564164783808523/895573585484214342) because we open up channels for the students to get help.\n\nThank you for your glowing feedback! "}, {"id": 8698, "q0": "The main purpose of this project is to develop a learning campaign with the Learn-To-Earn mechanism, which motivates the developers to mull the material from basic to advanced through doing tasks to get rewards. With this solution, this proposal ties in closely with the Challenge key metric, creating a great experience for developers, resulting in increased participation and contributions back to the Cardano blockchain. The proponent also clearly describes how the bounty is disbursed, the campaign organization process, and optimal solutions to solve the challenges that may be encountered during the campaign. An important thing to consider here is, the proponent's report mentions that Asia has a lot of room to tap new developer resources, but the proposal description does not mention which languages ​​will be applied to the campaign launch, it must be known that English is not to the advantage of developers in Asia.", "q0r": 4, "q1": "The project development plan is very well described, clarifying the tasks at different timelines, breaking it down into different phases such that it will facilitate the management of the proponent and track community progress. In the operating budget description, the award distribution structure and disbursement process are clearly described. However, there is no information about the prize distribution tool (ADA or any other coin). In addition, there should be calculations of the hours worked for the jobs in question so that you can assess the suitability of your work efforts and the budget requirements given. Overall, the budget plan table is presented very well, specifically about the working positions and the number of members in each position. The description of the personnel you give is just a presentation of their role in the project without descriptions and evidence proving that their work experience and qualifications are suitable to perform the assigned role.", "q1r": 4, "q2": "The team has identified and made commitments on the positive impacts that this proposal will bring to Cardano, the KPIs given are consistent with the project's inputs and outputs, and are ideal for successful assessment. However, there is a need for clearer descriptions of how the proponent will implement and present the acceptance reports to the community and the community to be able to follow the latest project updates.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "English is the working language for developers in many countries in Asia, even though it is not their first language - developers in the region do come from schools that teach English. \n\nWhen our students or Stackies complete the challenges, we will distribute money into their ADA wallets. One of the quests that we design will involve them setting up their own wallets that do not require downloading the entire blockchain, e.g., Yoroi light wallet. \n\nFor auditability, we plan to present our results, e.g., key metrics, in the regular town hall so that members can observe the impact of the quests, and subsequent teams formed to join the hackathon as outlined in our sister proposal. We will also work with IOHK to publish the statistics for transparency.\n\nDuring the StackUp campaigns, individuals are welcome to ask questions or get information in our Discord channel (https://discord.com/channels/895564164783808523/895573585484214342) because we open up channels for the students to get help.\n\nThank you for your feedback! "}, {"id": 8806, "q0": "The proposal intends to address the shortage of developers in the Cardano ecosystem . To that respect it aligns with the challenge.the dev commenity is relatively small in number for cardano even though almost all of them are high quality devs attracting top level developers to cardano will do a lot of good for caradano.it will bring new expertise and ideas and enrich the existing dev community. However I think the proposed fails to justify why learn and earn approach will attract top-level devs to cxardano.it is that top-level devs are looking for monetary incentives to get involved. I believe that is not the case. Good developers do not have time as opposed to money.For good devs to come into the community.They look at long term prospects,the sustainability of the ecosystem,the quality of the blockchain, the steepness of the learning curve and the cost effectiveness of running projects. Today the delay with Cardano(or any web 3.0 environment) is the level of maturity of tooling, the cost and time required for projects to get up & running. According to me, what the developer ecosystem needs is tooling,open source solutions, knowledge bases, hackathons etc. more than Learn & Earn. Learn and earn can do good not as much as the above approaches. Learn and earn can incentivise users to learn about cardano in general. But I don’t think it is going to result in top-level developer acquisition, a claim made in this proposal.The budget asked for this proposal is 11% of challenge budget.Remember that this essentially deprives other projects in this challenge who may be building a new tool or open source repositories or sharing their tech skills. I think the opportunity cost is too much given the percentage of the challenge budget sought. The guiding question suites. Hence with due respect, I give a low rating.", "q0r": 1, "q1": "The team is experienced enough to to take up a proposal of this type.The Stack up platform is suitable for a learn and earn platform based on its description. Different learning levels like learning exploration and practitioner is good. Breaking up learning into smaller pieces of topics that have a steep learning curve. I have a major concern with the reward: the payout is only 23% of the proposal budget. 73% goes to stack up or the team by the way of content creation , program management, community management ,evaluations etc. This amplifies my concern about whether this project addresses the challenge. 80k towards an existing platform for a total of 30k payout to new developers is a red flag for me. Remember that idea is to bring top-level developers in Cardano as per the problem statement.\n\nThe total platform costs look uneconomical. To call out a specific item reward a pay out to participants is priced at $10k four weeks. This itself looks too much. For example, there is a head for reward payout (4 weeks long), troubleshooting failed payments and answering payment queries for $10k which appears unreasonable. Monitoring tx on Cardano(assuming payout in ADA) is quite easy. It make me doubt if the team is unfamiliar with Cardano altogether and if the payout is not in ADA then the question is why not? The proposal does not describe what is the team’s experience level on Cardano as that will determine the quality of content created.  \n\nThe proposal says it will have at least 8 learning quests and targets to have 150 web 2 devs who have forked and created a dApp. Those who are familiar with caradno dev will question why 8 quests are sufficient. 150 devs creating a dApp is quite ambitious based on the details provided .The team has used the words “forked and created a dApp”. One does not “fork” to create a dApp on Cardano.  Fork what? It further reduces my confidence about the success of this proposal.\n", "q1r": 1, "q2": "It would be difficult to track the progress of the project in my view. Most of the funding is going towards set up and operational expenses. The proposal calls for 1500 high quality participants and 10 teams to give Caradano hackathon “a try” without defining what they mean by “high quality” or which hackathon this proposal is referring to. It would be hard for the community to assess the progress or the level of success with lack of clarity. Given the funds sought is 11% of the challenge budget I would have liked to see more concrete details about auditability presented by the team.", "q2r": 2, "assessor": "z_assessor_3007", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1, "reply": "Interestingly, human behavior is unpredictable, and in our own experience running StackUp, it’s possible to incentivize devs to look at an ecosystem through micro-learning and micro-rewards. \n\nWe must be careful not to view the world through our own lens alone, i.e. it’s also the little things that incentive devs to look at an ecosystem compared other ecosystems. While what you described is important, i.e. tooling, ours is the first legitimate Learn-and-Earn platform and we think we deserve a chance as well. \n\nWhile we are unable to reveal too much details as of now with regards to the other campaigns that are still running, using Learn-to-Earn as the top of the tunnel tool has been immensely helpful to funnel good teams into hackathons. We understand the potential opportunity costs involved, but we are confident that we can deliver the value that the Cardano community deserves. \n\nThe team is definitely complete, and we’re sorry we didn’t list every single member in the team as most of the members are responsible for operations. \n\nHere are the key members (StackUp is under Tribe):\n1. Ng Yi Ming: https://www.linkedin.com/in/yimingng/\n2. Ryan Chew: https://www.linkedin.com/in/ryan-chew-zi-jie/\n3. Jackie Tan (me): https://www.linkedin.com/in/jackietanyen/\n4. Rachel Lee: https://www.linkedin.com/in/rachel-kn-lee/\n5. Nicholas Hong: https://www.linkedin.com/in/nicholashongyk/\n\nWhile it seems that we spend the money ONLY internally to create content, we also engage native developers who are familiar with blockchain development. In this case, it is Plutus. For example, Josh from Josh’s DevBox is a good candidate to engage (https://www.youtube.com/watch?v=5lwOJmS5BsU&t=6s) and the budget (TBC) does go to these creators to create high quality content for the quests. \n\nTo elaborate on the review process, our team of reviewers led by Rachel Lee (https://www.linkedin.com/in/rachel-kn-lee/) will assess the submission from the students. In our quest design, we use quest-specific rubrics to ensure that there is learning done, e.g., screenshot of a terminal, or output in an IDE indicating that code was run successfully. This is a laborious process, but is great because it ensures learning outcomes are met and we can detect cheaters easily. We detect cheaters regularly and filter them out of the system and reward only those who are deserving of the prize money. This is why we invest a lot in ensuring that deserving devs are rewarded.\n\nThank you for not holding back on your viewpoints, and it is honest reviews like yours that make the Cardano community amazing and robust. Hope our comments were sufficient in addressing your concerns! "}, {"id": 9621, "q0": "The proposal aims to create a learning campaign with Cardano-related content and quests so that web2 developers can both learn and earn at the same time. In total, there will be 8 quests which include 4 knowledge-related questions, 3 ecosystem-related questions, and 1 hands-on dApp building activity. Developers will be rewarded from 10-15$ for each quest they complete. Currently, the Cardano ecosystem is lacking a lot of experienced Haskell/Plutus programmers to deploy dApps. By rewarding developers for completing quests, this project will further motivate developers to learn more about Cardano smart contract programming, thereby increasing the number of developers for the Cardano ecosystem. With the goal of engaging 1500 web2 developers to join the campaign, the project completely aligns with the outlined challenge settings. Therefore, I rate this project 5 stars for its impact.", "q0r": 5, "q1": "Regarding the team members, the proposal has only provided information of the leader (CEO), the remaining members do not have any information for the community to verify. Proposer should include each member's name as well as their LinkedIn so that the community can get a closer look at each team member's abilities.\n\nIn terms of budget, it has been divided into main categories but needs to be more specific. For example, for a $25,000 group of 3 people for Content Curation and Refinement of available Cardano resources, the proposer can specify more about the number of hours that each person works in a week and the hourly pay rate of each person. In addition, there is an amount that I think is not reasonable which is spending $ 10,000 for 2 people to pay out rewards to winners in 4 weeks. The project can save more time and resources by rewarding participants with ADA. Each Cardano transaction can transfer ADA to hundreds of addresses at the same time, each campaign participant just needs to provide their wallet address and the distribution of rewards will be extremely easy and fast. Instead of taking 4 weeks and $10,000 in costs, it can be shortened to 1 hour and $100 to pay out to 1500 people. The ADA payout makes the project even more transparent as anyone can check the payout process with the transaction ID the project provides.\n\nAs far as I know, in Fund 9, in addition to this project, the proposer also proposed another project called \"\"Virtual Hackathon for Dev Education\"\". It would be a plus if the proposer could add how he manages the projects so that the projects are implemented on schedule in case both projects are funded.\n\nThe project has outlined two risks that may be encountered during project implementation such as content quality gap and learners finding it difficult and giving up halfway. However, I would like to add one more risk that the project may face for the proposer to consider further. It's a learner who can create multiple accounts to profit from the reward, this risk is also known as a Sybil attack.\n\nIn summary, although the team has experience running many campaigns on StackUp, more information is still needed to make the proposal more complete. I therefore rate 3 stars for the feasibility of this proposal.", "q1r": 3, "q2": "The information provided by the project is enough for the community to audit the progress and success of the project. Quests will be launched on app.stackup.dev website and the number of participants of each quest are also clearly displayed on it. The metrics and KPIs used to measure the success of the project are also carefully considered. The problem statement and the solution are described in an easy to understand manner. I rate 5 stars for the suitability of this project.", "q2r": 5, "assessor": "z_assessor_3068", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "The team is definitely complete, and we’re sorry we didn’t list every single member in the team as most of the members are responsible for operations. \n\nHere are the key members (StackUp is under Tribe):\n1. Ng Yi Ming: https://www.linkedin.com/in/yimingng/\n2. Ryan Chew: https://www.linkedin.com/in/ryan-chew-zi-jie/\n3. Jackie Tan (me): https://www.linkedin.com/in/jackietanyen/\n4. Rachel Lee: https://www.linkedin.com/in/rachel-kn-lee/\n5. Nicholas Hong: https://www.linkedin.com/in/nicholashongyk/\n\nWhile it seems that we spend the money ONLY internally to create content, we also engage native developers who are familiar with blockchain development. In this case, it is Plutus. For example, Josh from Josh’s DevBox is a good candidate to engage (https://www.youtube.com/watch?v=5lwOJmS5BsU&t=6s) and the budget (TBC) does go to these creators to create high quality content for the quests. \n\nTo elaborate on the review process, our team of reviewers led by Rachel Lee (https://www.linkedin.com/in/rachel-kn-lee/) will assess the submission from the students. In our quest design, we use quest-specific rubrics to ensure that there is learning done, e.g., screenshot of a terminal, or output in an IDE indicating that code was run successfully. This is a laborious process, but is great because it ensures learning outcomes are met and we can detect cheaters easily. We detect cheaters regularly and filter them out of the system and reward only those who are deserving of the prize money.\n\nWith regards to managing the workload of the other proposal, our company has 60 members and there is an entire team which takes care of the hackathon process. "}, {"id": 10786, "q0": "Based on the goal of broadening Cardano's development scope to include a wide range of audiences, several educational programs have been offered in various forms, and the propaganda effect has been justified by Cardano's current popularity. StackUp is another Cardano teaching platform, but it is more than just a place for individuals to learn; it is also a good location for developers to generate money. The proposal includes a structured learning route for participants as well as a clear introduction to how the platform works. Simplifying the heavy learning curve with rewards to boost developers' forward-thinking is a notable feature of StackUp. This point has provided a great experience for developers, inspiring them to attend the Hackathon and participate in the Cardano ecosystem. The proposal also includes well-planned methods for mitigating risks that may arise during project development. The connection between this project and the challenge is evident.", "q0r": 5, "q1": "A good introduction is frequently followed by excellent preparation. Indeed, StackUp has created a clear roadmap with a timeframe and specific activity descriptions. The budget table is also structured rationally, with labor and money allocated to each activity item. With this rigorous preparation, StackUp should have no trouble completing in the future. However, your proposal still has a few flaws that cause me to award you only 3 points in this Feasibility section. First, you did not satisfactorily respond to the request \"provide details of the people.\" You provide a list of required positions on your team but do not identify who they are or how much experience they have (except for the Leader whose name is only known by Linkedin link). So, who were the \"10 members with experience running 28 learning campaigns and 79 quests for >30k Web2 developers across the world\" you mentioned? Second, because you have more than one proposal in this fund 9, I recommend you include workload management so that people understand how you will arrange your work correctly. Third, and most importantly, this proposal requests an investment in the education campaign, which entices the developer with a cash reward, and you state that you will most likely return to the following funds to propose other Learn-and-Earn campaigns with a larger audience and a deeper scope in terms of technical implementation. So, is StackUp a platform that can expand and exist on its own in the future if there is no community support? Please consider and explain these questions to improve your proposal.", "q1r": 3, "q2": "The proposal specifies the key performance indicators (KPIs) required to track project progress and practical quantifiable numbers to determine future project success. You have solid mental preparation, and the goal StackUp wishes to pursue. However, please include how and where you intend to disseminate information about your project so people can track its development. Thank you for your intriguing idea, and I hope your proposal is as successful as anticipated.\n", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "From a sustainability standpoint, we do have clients using StackUp to scale their respective ecosystems and the platform is already up and running. This is good for two reasons, i.e. firstly we already have a proven business model and we can sustain ourselves as a business and secondly we don’t rely exclusively on Cardano grants to continue running.\n\nThe team is definitely complete, and we’re sorry we didn’t list every single member in the team as most of the members are responsible for operations. \n\nHere are the key members (StackUp is under Tribe):\n1. Ng Yi Ming: https://www.linkedin.com/in/yimingng/\n2. Ryan Chew: https://www.linkedin.com/in/ryan-chew-zi-jie/\n3. Jackie Tan (me): https://www.linkedin.com/in/jackietanyen/\n4. Rachel Lee: https://www.linkedin.com/in/rachel-kn-lee/\n5. Nicholas Hong: https://www.linkedin.com/in/nicholashongyk/\n\nWe thank you for your well wishes, and we’re hopeful that this will bring impact to the Cardano community!"}, {"id": 12829, "q0": "The proposal is closely aligned with the demands of the challenge. The team intends to build a platform where developers get rewarded in small monetary incensitives when they complete a quest or task. The rewarding schme and the quests intend to be progressive, meaning that the difficulty of the task as well as the reward will increase with time. I believe that this project has the potential to produce great value for our community by keeping developers always motivated and attracting more developers from outside. In this platform, the team may prepare tasks related with the latest trends in the developer community and in this way we keep our developers in constant update and relavant. I believe that this project has the potential to grow in the future and produce a global impact where developers from all around the world can learn and can be paid at the same time. In my opinion, as a developer myself, this project is the ultimate experience, get paid for learning. Very solid proposal impact and I believe it deserves highest mark.", "q0r": 5, "q1": "The proposal has provided a very detailed timeline and milestones part. Everything has been desribed carfully. It provides clearity on how long will take for each task to get completed. Moreover a very carefully designed budget split is provided. The team requests a total of $110000 which I think is a substantial amount of money, however when accounting the benefits that this project will have on the community I believe it is justifiable. Every detail about where the money is going to be spent is shown carefully. As for the team it is just amazing. The CEO himself is the founder of StackUp and has been recognised by Forbes 30 under 30. After researching the CEO and company in great detail I believe that this team possesses all needed skills and experience to see this project through. I was just impressed from this part. Definitely highest marks.  ", "q1r": 5, "q2": "This part of the proposal has some missing aspects and I believe could have been done better. The chosen KPIs are realistic, achievable and very good indicators of success. The team intends to build 8 learning quests in three different categories that are knowledge based, ecosystem based and hands-on building based. The team has a clear vision of what they want to achieve and their aim is 1500 high quality participants. One thing missing on this proposal is a way for the community to audit the progress of the project. The team hasn’t provided any public channel or anything similar. I suggest they provide a github repository or make periodical meeting with the community member in order to increase transparancy and gain the communities trust.", "q2r": 3, "assessor": "z_assessor_3478", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "For auditability, we plan to present our results, e.g., key metrics, in the regular town hall so that members can observe the impact of the quests, and subsequent teams formed to join the hackathon as outlined in our sister proposal. We will also work with IOHK to publish the statistics for transparency.\n\nDuring the StackUp campaigns, individuals are welcome to ask questions or get information in our Discord channel (https://discord.com/channels/895564164783808523/895573585484214342) because we open up channels for the students to get help.\n\nThank you for your concern and your feedback! "}], "solution": "We want to launch Learn-and-Earn campaigns to educate Web2 devs with general and technical knowledge on developing in Cardano. The campaigns are launched through StackUp, our Learn-and-Earn platform. ", "experience": "Core team of 10 members with experience running 28 learning campaigns and 79 quests for >30k Web2 developers across the world."}