{"id": 419161, "author": "sebastiengllmt", "title": "Cardano Wallet OneBox", "url": "https://cardano.ideascale.com/a/dtd/419161-48088", "category": 26597, "amount": 45000, "description": "Currently, if you want to deploy your own light wallet or similar application, there is no single tool that you can use. Instead, you can have to figure out how to deploy and combine multiple tools", "f6_no_assessments": 10, "f6_rating": 3.033333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 958, "q0": "The team behind this project, Sebastien Guillemot & DC Spark have proven themselves to be very important contributors to the developer tools of our blockchain, most importantly by making available tools and libraries that make it easier for other developers to improve their workflow.\n\nThis project aims to take things a step further by providing an almost turnkey solution to other developers that wish to construct a wallet-like project, by making available the entire tech stack that the team has used in deploying their own wallet: Flint.\n\nThe team emphasise the fact that the project they intend to develop would be partially or fully reusable by other developers looking to deploy similar wallet-like products, without having to duplicate all the work that they have done for Flint.\n\nThis project is a great fit for the Developer Ecosystem challenge as it addresses head-on multiple of its objectives: creating a supportive environment for developers and providing them with tools and solutions that will make their workflows that much easier. If successfully implemented the Wallet OneBox has the potential to greatly speed up the process that a developer of a wallet-like tool would need to go through.\n\nThis assessment is made on the basis of my previous experience as a mobile app development studio manager. I have also been involved with the Cardano developer community since March 2021 and I have been actively working with Cardano developers since the summer of 2021.\n\nThere’s only one area that I’m a little concerned about, that might affect the potential impact of what is being proposed, (this is reflected in my rating of 4 for Impact).\nIt’s the fact that Flint, the project from DC Spark that is already using the components that they wish to deploy in this OneBox solution, is sometimes very slow and buggy. I’m not entirely sure what has caused this experience for me as a user, as I have not done debugging on the product, but the wallet has been constantly slower than the multiple other Cardano community wallets I have used and crashes have been pretty frequent. \nThis may be cause for concern if we encourage the Cardano developer community to base their tools on a tech stack that is not fully optimised yet.", "q0r": 4, "q1": "While this project has the potential to have a great impact on the speed with which developers building wallet-like products for our blockchain can deploy their solution, as a proposal, there is very little information given by the team to address the feasibility and auditability questions.\n\nThe role of a proposal assessor in Catalyst calls for looking at the proposal in isolation and considering what is presented in the text and in the attachments. The fact is that the proposal as it is now doesn’t meet even the most basic requirements of what a Catalyst proposal should be. It lacks a proper implementation plan, the budget is not broken down at all, and the exact team that DC Spark anticipates will be working on this particular project is also not described. One element that would have assisted the Catalyst and Cardano community assess the investments we are all making into DC Spark via the treasury and Catalyst would have been an hourly rate and an estimated number of hours the project development might take. In that way, it would have been plain for everyone to see that the funds allocated are not being mismanaged.\n\nThe team has also answered “Yes” on both of the workload questions that have been introduced in Fund 9. Despite this, the proposal doesn’t give any details on how the company team will manage all the workload that they have currently committed to through the Catalyst process. A simple inspection of the data available on https://www.lidonation.com/en/project-catalyst/group/dcspark reveals that the team is already working on 37 proposals that have been funded by Catalyst and currently has 15 proposals in Fund 9.\n\nThe information posted by DC Spark on their social media accounts seems to indicate that they have sized up the company to more than 40 employees, yet this is not mentioned in the proposal. Even knowing this, it’s still hard for me to visualise how the company plans to manage the large number of projects it has taken on without a clear presentation of this in the proposal.", "q1r": 2, "q2": "Considering the otherwise great work that the DC Spark team is doing in the Cardano ecosystem I would have liked to be able to grade every aspect of this proposal high. However, the auditability section is missing the information required to properly explain how the team will make the process of verifying the progress of the proposed project easy and transparent. There aren’t any KPIs mentioned in the proposal, the definitions of success are barely described and there aren’t any plans presented in the proposal for a more detailed accounting of the development of the project. My rating was given taking into account what’s present in the proposal.\n\nGiven that the team has a vast experience with the Catalyst process, the company has participated from almost the beginning, since Fund 2, it is obvious that they have not taken seriously the task of writing this proposal, otherwise, I’m sure they would have known exactly what to include and would have been capable of writing a complete and compelling proposal. \n\nIt can be argued that the DC Spark team is too busy building and deploying tools and products to worry about the Catalyst process. And indeed why would they, since almost all of the proposals that they have submitted to date have been funded, and as of now they represent the largest recipient of Catalyst funds (data: https://www.lidonation.com/en/project-catalyst/groups ). But, I’m a bit worried that if the Cardano community continues to vote for the DC Spark proposals regardless of their quality or presentation we will end up creating a two-tiered system that will very closely resemble nepotism and corruption even if at its core it may be well-intentioned.", "q2r": 2, "assessor": "z_assessor_2169", "no_vca": 11, "ne": 7, "ng": 3, "nfo": 1, "vca_o": 2}, {"id": 2081, "q0": "Unfortunately, the proposal is poorly explained, the proponent only gives us a general idea of ​​his project, without the necessary details so that we can understand what he is saying. How the proposal will be implemented and what impact will this have on the Cardano Ecosystem. The stated problem of this proposal is that currently if we want to implement our lightweight wallet or similar application, there is no single tool that can be used. Instead, we have to figure out how to implement and combine multiple tools. The solution was to provide a \"OneBox of Cardano Wallet\". A single deployable image will set up all the indexes and downstream engines needed to support all the endpoints needed to run the wallet. I believe this proposal aligns very intelligently with the goals of the challenge. However, the problem here is that although the solution description is suitable for the challenge, the concept of the proposal is reasonable, but the absence of a blueprint greatly affects the testability of the proposal. So, even though the idea is good and can be successfully implemented, we cannot know how it will be implemented. In my view, this proposal is more like an idea than a complete proposal, because all the details it provides are of little value, so I think the proponent should return to fund 10 with a more well-presented proposal.", "q0r": 2, "q1": "No team information has been released. The only thing this program offers is Their team consists of former Yoroi developers and developers of Flint Wallet, two popular wallets for Cardano. They are also the authors of the indexing tools like Carp that this project will use. But who are they? We will need to know each team member, name, role, relationship to Cardano Blockchain, etc. The more detailed the better, unfortunately, we don't have any details here. The proponent did not provide any roadmap to follow, so it is impossible to understand what steps would have to be completed to complete the project. It just says that they plan to deliver this OneBox solution in Q3. However, this doesn't tell us what will be done, what will happen next, and how long it will take until everything is ready. This proposal did not provide enough information to help audit the progress of the plan, was very sketchy, contained only one line, and did not include information on the roadmap, timelines, or timelines to be achieved. desired results.\nThe budget division is also not justified. The proposal asks for $45,000 for the project and states that all these funds will be used for project development costs, without any details to break the budget, which will certainly not be added. co-accepted because it cannot be audited. For the above reasons, I disagree that this proposal will be successful.", "q1r": 1, "q2": "And finally about auditability, as mentioned in the feasibility section, this proposal does not provide a clear roadmap, we do not know what work the members will do so it is certain that This proposal cannot be audited, because of insufficient information. The ability to measure project progress is referred to as \"Release the project and adopt a solution beyond our needs (Flint Wallet)\" and the final success is said to be \"Successfully integrated into the Flint Wallet and other Cardano projects\". With that said, this proposal would benefit from having a roadmap with milestones on an estimated timeframe. This way it can be tested transparently and the community will be able to track progress during development. I wanted this proposal to provide KPIs so that the community could easily check the progress of the project, as well as the detailed allocated budget. In this proposal, no detailed experience of the proponent was given, lacking all basic proposal components such as roadmap, detailed scope, metrics, budget, etc. For the reasons just described, I strongly disagree that this recommendation provides me with sufficient information about my ability to measure progress in achieving the stated goals.", "q2r": 1, "assessor": "z_assessor_2299", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2613, "q0": "When a user chooses to use one of the following light wallets available in the market: Yoroi, Nami, Eternl, Gero, Typhon, etc., they must trust the server of that lightweight wallet issuer. This proposal offers a solution where users can install their lightweight wallet, which will be a node on the installed machine itself. This is a proposal aimed at users who are project developers on Cardano so that developers can allocate more resources to develop projects faster, and the Cardano ecosystem is more and more expanded. This proposal to complete it also attracts developers in other ecosystems, as they notice that Cardano has more and more protocols & tools to help develop projects quickly. I consider the Cardano Wallet OneBox solution to play an essential role in the development of the Cardano ecosystem.", "q0r": 5, "q1": "The proponent offers a proposed solution by creating a single image to set up and run the necessary wallet tools such as Carp, Blockfrost, Ogmios, Token info service, Price feed service, Cardano-nodes. All these necessary services will be launched, synchronized, and managed by the Cardano Wallet OneBox. Personnel to implement this proposal have experience building Flint wallet and Yoroi wallet. So, with only 1 or 2 employees in charge of this proposal, I still consider the ability to complete the job completely within their ability. However, the proponent did not divide the detailed budget for each work item. Although the completion time of the proposal has been determined, it is still vague and not specific. This proposal uses many advanced tools & protocols of the Cardano ecosystem; Now, these tools & protocols have been launched on the mainnet by dcSpark so that this proposal will be completed on time. The scalability of this solution by creating multiple Cardano Wallet OneBox will meet the capacity when used by a large number of developers. I appreciate this potential. However, this proposal still carries the risk of users having to spend time learning how to set up a wallet. So this proposal is not a solution for individual users; it is only suitable for professionals suitable for other project developers. This Cardano Wallet OneBox also has another weakness: sync time depends on the Cardano-node's sync time; this weakness the proponent has no way to solve. With a good staff, I hope this proposal will be upgraded more strongly in the future.", "q1r": 4, "q2": "This proposal has a particular influence on the development of the Cardano ecosystem. However, the proponent only proposed a roadmap to complete the product in the third quarter; without a detailed plan, and I consider this to be a sketchy way that is difficult to convince the community to believe. But thanks to the reputation as well as the history of completing products of the dcSpark team. I think this proposal will still be excellently accomplished. To measure the success of the proposal, the community also has no choice but to wait for the finished product. I assess the transparency of this proposal is not available; to be auditable, users can only trust in dcSpark's dedication to this proposal.", "q2r": 3, "assessor": "z_assessor_2324", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2695, "q0": "dcSpark, the company behind Milkomeda, Flint wallet and other tools on Cardano has a proposal here for creating an “all-in-one” solution for creating a wallet or a similar app. This means that instead of the developers having to write their own code or manually integrating various tools which wallets use, this solution will automatically install them.\nThis sounds like a very good concept, as it will increase the ease of coding new wallets and similar apps, meaning more people will be encouraged to do it, meaning more options will be available for us consumers on the market.\nAs risks, the proposer mentions that combining all these solutions into one ready to install image will be tricky and it will probably be limited to use by experts (excluding beginner developers). However, this is not uncommon for a first iteration and in my opinion there’s nothing wrong with starting with a less use friendly development solution (after all, most blockchain tools are like this to begin with).\nI fully agree that this proposal effectively addresses the Developer Ecosystem challenge. Score: 5.", "q0r": 5, "q1": "For feasibility, we do not have a timeline, roadmap, or milestones, which is not ideal, but dcSpark often omits to add these. We have on the other hand an estimation that it will take 1.5 devops engineers until the end of Q3 to finish this project. It’s hard to approximate how many man hours that translates into, so that we can properly analyze the feasibility of the requested budget of 45000 USD. In future proposals, it would be greatly appreciated if you added a detailed budget breakdown, a timeline, milestones etc, as indicated by the proposer guide.\nRegardless, dcSpark is a very experienced company who already has people who have created a wallet (Flint), so I think it is likely for the proposal to be implemented successfully. Score: 4.", "q1r": 4, "q2": "The auditability section is very sparse and like the feasibility section, it does not contain key progress indicators, a roadmap or milestones. Without any numeric projections on what is to be expected here, it might be difficult for the community to understand how much progress is being made or how successful the implementation is. At the very least, it would have been nice to have an estimation of how many projects will use this solution within 3 months of it being released. \nDue to the lack of information, I am uncertain whether the progress and success of the proposal can be audited properly. Score: 3.", "q2r": 3, "assessor": "z_assessor_2335", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5168, "q0": "They propose a solution, a single image that users can deploy which will set up all the downstream indexers and tools required to support all the endpoints needed to run a wallet. The project impact is huge, and considering dcSpark successful experience in delivering various projects in the Cardano ecosystem, the project's chance of failing to be delivered is very low. However, the auditability and especially on feasibility section is very poorly written and lacks many details. The lack of details can discourage new voters that unfamiliar with dcSpark to give a vote on the proposal. The main risk of the proposal is many aspects needed to integrate the solution aren’t easy, which may hinder adoption to only experts. However, as the proposal state itself, the solution is still useful for many projects.", "q0r": 5, "q1": "As the proposal does not give milestones in the project, the timelines provided are only the completion of the project, in Q3 2022. The proposal does not provide any broken-down of how they will use the proposed budget, and only states the cost are spent for developers. If the cost is only for developers, they should provide an estimation of the hours needed to complete the project and the cost per hour. That information is crucial to determine if the requested budget is reasonable or not. The proposal only wrote the project are developed by a 1.5 DevOps engineer, without giving any further information. Even though the dcSpark has prominent names in the community, many new holders are unfamiliar with the company. At the minimum, the proposal should give the background and past projects of the company, and even better if the proposers can give details on the core team working on the project.", "q1r": 2, "q2": "The proposal does not provide any milestones or KPIs that can be used to track the development progress, and instead only states the main goal. However, as the project uses the Github repository, it can be implied that the community can track the project's progress using the Github repo activity. As the project purpose is to create tool for developers and other Cardano projects, the defined success is straightforward with successfully integrating with flint wallet and other projects. However, I suggest adding adoption metrics, such as at least used by 10 projects.", "q2r": 3, "assessor": "z_assessor_2675", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 5274, "q0": "The Cardano Wallet OneBox proposal is to develop a OneBox that will combine multiple tools (set up all downstream indexers & support all end points) to run a wallet. The DCSpark team also provide the quick overview with their attached image (showing endpoints of Flint). This OneBox solution will allow wallets users to run the wallet using their own machine instead of relying on the light wallet's server. This proposal is open source and can be used by other wallet projects that need to coordinate multiple service to get all endpoints needed. Although the team expects the challenge of coordinating all services from a single image and handling API keys for components will be limited to expert users, this proposal effectively addresses the Developer Ecosystem challenge well as it will alllow developers to focus on building successful core apps without having to worry about infrastructure.  ", "q0r": 5, "q1": "The delivery of this project is in Q3 with all fund going towards the development cost. The DCSpark team should mention on what they mean by 1.5 developers. They may ask for further funding for the projects that might need OneBox or add some optional services within OneBox. The team should clarify on the team members working on this project rather than specify 1.5 developers although this cannot be sure if it means one full time and part time dev or else. The project is likely to succeed as they are ex-developers of Yoroi and developers of Flint Wallet. They are also author of indexing tool like Carp. ", "q1r": 5, "q2": "The success is to integrate this OneBox solution into Flint Wallet and other Cardano projects. The proposal could add some key metrics to measure the release of this project into Flint wallet and adoption of solution by other projects (fork rate, commit rate or else). Of course, the community can check flint wallet themselves if this integration has been made but it will be easier for audit purpose. The DCSpark team has describe problem statement quite clear and that the solution will be able to sort out the issues and also fit with the challenge goal. ", "q2r": 4, "assessor": "z_assessor_2684", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8401, "q0": "Having read this section repeatedly, I am still not able to discover who will be your target subjects. Do you have any? If yes, please refer to them directly associated with a detailed description of how your project affects them positively. At the same time, spend more time explaining your project’s functions so that the community could make out clearly what your project’s going to do. What’s more, I don’t think the results you give are suitable for the requirements of the challenge because its key metrics don’t align with those of the challenge. You should ask yourself whether your project could make it easier for developers to build on top of Cardano or not, like the ability to fill in gaps defined in the exploration stage, etc. Elucidate these factors in detail so that the voters can support your project. Finally, where’s the solution for all the difficulties you foresaw? All the major risks are presented clearly but if there’s no workable solutions for them, it means that your team has no capability of addressing the matter arising in the project implementation. Then, who can vote for your project? Try your best to find out the key to solve all these defects.", "q0r": 2, "q1": "Oh Jesus! This is definitely the most simple and meager section that I have ever read. You upset me, actually. How can the feasibility section of your proposal be called detailed when three inner parts only consist of one sentence each? Are you really interested in this challenge? If yes, please provide a clear work plan with enough timeline & key milestones, allocate your requested funds transparently in more detail, and introduce your team members who will carry out your project in the future. Most of all, I still don’t understand 1.5 devops engineers here. Why is it 1.5? Please give me and the voters more explanations about this whole section.", "q1r": 1, "q2": "This Auditability section is scanty, too. As reported by, you will measure the release of the project and adoption of the solution outside of your needs (Flint Wallet). That’s no problem but the case is how you will measure them? Do you intend to utilize any technical tools? And where will you publish the results for the community to be informed? They’re the questions that you should answer in the clearest way. Besides, your standard of success for this OneBox project is not explicit enough. Could you please name other Cardano projects for an example? The more you list, the more it proves that your team has determined clearly the purpose to achieve success.", "q2r": 1, "assessor": "z_assessor_2980", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14118, "q0": "Many people wish to have light wallets. This project focuses on actual needs. OneBox was created by building from Yoroi and Flint Wallet, two popular wallets for Cardano. OneBox was created to get all the endpoints customers need. One great thing is that customers can run on their own machines instead of trusting the servers of light wallets. This proposal will effectively address the challenge posed. It is essential. Because OneBox will create high personal safety and privacy. What we really need in this virtual currency world.", "q0r": 5, "q1": "\nTheir team includes ex-developers of Yoroi and developers of Flint Wallet. That is enough to show that their experience is suitable for this proposal. They do not present members, detailed budgets, or detailed plans. This confused the reviewers. The team's workforce consists of 1.5 development engineers, which makes me quite nervous. But we all know dcSpark is a strong team in the community. Many of the household's proposals have been funded in funds before. I look forward to the outcome of this proposal.", "q1r": 4, "q2": "Too little information has been provided to gauge the progress and success of this project. The team does not provide specific indicators for people to evaluate or weekly/monthly reports, or live dashboards. They just presented a simple project release and Successful Integration into Flint Wallet and other Cardano projects. I don't appreciate this answer. Because in addition to the product that can bring benefits to the community, the presentation and implementation of the project is also a model for new proponents to learn and evaluate.", "q2r": 3, "assessor": "z_assessor_3906", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 14562, "q0": "This proposal aims to create a Cardano Wallet OneBox that sets up and runs all the tools needed to run a light wallet (or a similar tool). That sounds pretty convenient to the developers of the Cardano ecosystem. This Cardano Wallet OneBox solution is expected to be either fully or partially reusable by other wallets and wallet-like projects that need to coordinate multiple services to get all the endpoints they need. Though it’s not indicated directly in the description of the project, I assume Cardano Wallet OneBox facilitates the building of light wallets in particular, and the work of developers in general, and therefore, brings some nice values to the Cardano system. There are some additional details that the team could have elaborated on to better describe their project, like its target audience, expected impacts, and so on. The team realizes the time-consuming and difficult coordination of all the services required to build the wallet from a single image with a good UX, yet doesn’t propose any solution to solve this. This is all about the developers’ techniques and I suppose they should spend some time to create the best solution possible. The process may be time-consuming but they can do some research to propose some acceptable waiting duration.", "q0r": 4, "q1": "The description of the roadmap for implementing the project is too brief. The team only says that they “plan to deliver this OnBox solution in Q3.” There is no mention of any detail of their plan at all. What is the team going to do? What are their milestones? How are they going to obtain those milestones? What results do they expect at the end of each milestone? The answers to these questions should have been provided in the feasibility part of the proposal. The presentation of the budget falls into the same case. “All funds will be spent towards development costs” is everything presented about the budget breakdown. Therefore, the community won’t know anything about how the budget is broken down to cover which expenses and if it’s clearly explained or not. Again, in the team member description, the proposal only includes one piece of information, that is “1.5 devops engineers.” I believe they should present the names of their team members, their related skills and experience together with some links for reference and information verification. In general, the description of the project plan, budget breakdown and team members all need to be described in a more detailed way to clearly explain these points to the community.", "q1r": 2, "q2": "As for the auditability of the proposal, the method to track the project progress and development, as well as its success criteria is way too short. My recommendation is please add more details, including some key metrics to measure how far the project has been carried out (like the date of release, number of users, etc.), and specific criteria to evaluate the success of the project. Although the proposal may sound full of potential, it will be very challenging for the proposing team to win the trust of the community in terms of clarity and auditability without these adjustments.", "q2r": 2, "assessor": "z_assessor_4072", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 14678, "q0": "For this Developer Ecosystem challenge, the team plans to create a Cardano Wallet OneBox that setups and runs all the tools needed to run your own wallet (or similar tool) based on their stack for Flint. This will be helpful for developers, the main audience, who need this to build wallets and wallet-like projects that need to coordinate multiple services to get all the endpoints they need. It seems that the purpose of this proposal has partially met the requirements of this challenge. I only suggest leaving the image of 'which endpoint is handled by which service' directly in the proposal for convenience instead of attaching a link. Also, maybe because you think this will be useful for developers who need this to build other projects so you have no mitigation plan despite some risks you might face, but please complement it to make your plan convincing.", "q0r": 3, "q1": "Although I know this project doesn't need much time to accomplish, the team should provide a more detailed timeline for Quarter 3 as stated, or some key milestones for investors to easily imagine and follow the team's work. Besides, the proposer says that funds will be spent towards development costs, which is too general and I hope it can be breakdown to be more understandable. About HR, the team includes ex-developers of Yoroi and developers of Flint Wallet, two popular wallets for Cardano. I hope that the team with their experience will successfully work on the project together. You can also provide some reference information about your team's members through their personal profiles (LinkedIn,...)", "q1r": 2, "q2": "The KPI to measure is described kind of short and simple with no quantitative indexes. To make it better, show some KPIs that your team can achieve corresponding to each stage in the timeline. Also, please provide the tool that your team uses and how can the community keeps track of your project's progress through that tool. In addition, please provide information on whether this proposal is a continuation of a previously funded project in Catalyst or an entirely new one.", "q2r": 2, "assessor": "z_assessor_4083", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will provide a \"Cardano Wallet OneBox\". A single image that you can deploy which will setup all the downstream indexers and tools required to support all the endpoints needed to run a wallet", "experience": "Our team includes ex-developers of Yoroi and developers of Flint Wallet, two popular wallets for Cardano. We are also the authors of indexing tools such as Carp that this project will use"}