{"id": 419570, "author": "essbante", "title": "WAL-API Identity Wallet Service", "url": "https://cardano.ideascale.com/a/dtd/419570-48088", "category": 26597, "amount": 4950, "description": "WAL-CLI is a great tool, but it can be of greater utility for the developer community if it is expanded into an Identity wallet API service.", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 720, "q0": "Yes, the proposal identifies the need for a well-documented API that connects to the wallet and lets the user manage DID credentials. This is one of the building blocks for developers to have the required tools to build solutions to manage DIDs. The Proposal will contribute to the ecosystem by creating a Swagger API implementation for the RootsWallet CLI. Developers generally value APIs as they give them access to a technology they can work with for their projects. And having a well-documented API is a significant advantage.  The project is scalable as the proposers will release the solution as open-source. It will improve the developers' experience working with the decentralized identity and showcase to new developers coming to Cardano how they can get started quickly with the decentralized identity (DIDs). The library's on top of which the API will be built, have so far achieved four stars and one fork on Github; therefore, it is unclear how many developers will use the API from the start.", "q0r": 4, "q1": "Poses for white links to their LinkedIn profiles end Esteban is the developer of the CLI library on which this proposal aims to build an API.  Esteban has more than 15 years of experience in the area end is well qualified to deliver this project.  The second proposer is Rogelio and his LinkedIn profile is also provided, his skill set is in the DevOps and object-oriented programming. The project implementation plan is divided into 5 weeks and the tasks are clearly outlined for each of the weeks. The proposers aims to spend the first week researching, then design, followed by the implementation for two weeks, then testing end documentation. The number of hours required for each of these categories is provided and the total is 330 hours at a rate of $30 per hour which results in the budget of just under $5,000.  This is a very reasonable budget for a timeline that is planned with great detail.  The rate of $30/hour is well below the average of around $70 across a mixture of regions that I have seen on other proposals.  I have reviewed 30 + proposals so far. The decentralized identity on Cardano relies on Atala PRISM, which is still being managed as a private project by IOG, so the library os only useful for those devs that have access to the private repository of the project.  For the time being, this is not a problem as the developers interested in this API would also be users of Atala PRISM. Given that the proposers have developed the original library on top of which the API will be built and because of the very detailed plan provided, I think they have a very good chance of delivering on the proposal.", "q1r": 5, "q2": "Yes, a very detailed road map with milestones is provided, and the budget is set at a competitive hourly rate. The team does not provide quantitative KPI; however, audit can be done by looking at the progress on the GitHub repo. The success of this project is stated as a complete delivery with tests and documentation of an open-source solution. I think the team is capable and has committed to providing updates on GitHub; however; objective KPIs are missing. ", "q2r": 4, "assessor": "z_assessor_2123", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5297, "q0": "Swagger API is a popular open source - capable tool to simplify integrations into one's own projects. Enabling it for the Roots-ID solution and Roots-wallet on the command line is a project that initially sounds niche, but could have some useful and wide-ranging applications for self-sovereign identity and verified credential management using the Atala PRISM suite of products. This can be very useful for anyone having a combination of identity and payments in a decentralized manner as part of their project. Therefore, this tool would be useful to Cardano developers and is a good addition for this challenge setting. The proposers are very transparent about their portfolio of funded and open proposals, and how they tie in together, complement each other, but also stand on their own. This makes the Identity Wallet Service through WAL-API a good addition to the challenge and would have positive impact on the Cardano ecosystem, especially with regards to bringing financial solutions to the unbanked or disadvantaged.", "q0r": 5, "q1": "This proposal is part of several proposals past and current by the proposers. A lot of information already exists on the project on Github, and this is further complemented by other sources like LinkedIn and Youtube. The two core team members are both from Costa Rica and have previously worked at HP, Accenture, Gorilla Logic among others, and they seem to be very committed to make Roots-ID a success. I can sense that this is a highly motivated and capable team that have been funded before, and are on track to deliver an impressive over-arching body of work that will produce a very useful addition to the Cardano tools ecosystem. It seems highly likely that this sub-project will be carried out with the care it requires and integrate well into the existing suite of products.", "q1r": 5, "q2": "This proposal refers to and relies on its open source character and public version control for the clarity and auditability vis-a-vis project Catalyst. From the successful project completion and Discord channel of the Roots-wallet community, I think this is sufficient for the audit, but some specific milestones and goals for the project within the proposal form would have been nice to make it easier for the voter before funding and the community after funding to understand the implementation process, priorities and success. By using a lot of external links, the proposal makes it possible for someone with a lot of time on their hands to find out a rich network of previous work and communication channels, but providing this at one glance may give the reader a little bit more confidence about the focus on user experience and transparency.", "q2r": 4, "assessor": "z_assessor_2687", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5392, "q0": "APIs play important role during initial days of launch of products, As proposer mentions WAL-CLI tool which already has many benefits but it can be used more ways and use to its higher utility in developer community if it was expanded to identity wallet API service \nIdea seems look, The proposer mentions solution as expanding WAL-CLI implementation to create API-based identity wallet service.\nAs it will benefit the developer community and reduces work and increases efficiency. \nI strongly agree with proposal and This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer has provided detailed roadmap and timeline and explained in detail as followed, Research taking for 1 week and design 1-2 weeks, Plan from Wallet API endpoints to Key management API endpoints is explained.\nTesting and Documentation in week 5.\nIts fast and efficient plan. The budget breakdown is also explained in detail consisting cost of each step such as Research to Documentation required hours and cost for each hours.\nThe team members of 2 having more than 15+ years of experience and funded in 3 projects previously and Having good track record.\nI strongly agree with proposal and   \nGiven experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer will be providing details about developments and code in GitHub publicly.\nSo community and anyone can keep track and validate the process anytime. Other details reports also will be provided regularly in public domain. They have provided link where community keep asking any queries anytime to check. As they will be providing details in metrics and KPIs it will ease the process to track. As success of project utilization of WAL-CLI to its new potential and helping developers in community, I strongly agree with proposer and The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2702", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 9814, "q0": "The team proposes to build an API around an existing tool called “wal-cli”. As far as I can understand, the existing tool is only a command line interface (CLI) and needs to be extended with an API to be used from other projects, especially from an SSI wallet called “RootsID”. The proposers claim this is a missing piece of the puzzle to get the ecosystem going. After a bit of research, I found a video of a demo from the RootsId-Wallet, which seems to be working. So, it is a bit unclear, how this is still a missing piece of the puzzle. I wished the proposer made it more clear why this I needed for an already working wallet. Additionally, more information could be supplied about the way to use the API? Do I have to host it? How should the service be run? Who requires it?", "q0r": 4, "q1": "The team seems every experiecend and already completed similar proposals regarding the Wallet and the Wal-Cli. References of prior work are supplied.\nThe timeline and also the budget look realistic.\nIt should be positively mentioned that the developers are also including an architectural diagram, documentation, and a tutorial as deliverables. \n", "q1r": 5, "q2": "The team has already a history of catalyst-funded projects, and they are developing open-source solutions on GitHub. They also seem to have a board, everybody can ask question regarding the progress. The project should therefore be monitored easily. While I don’t fully understand the necessity of this project, I have high faith in the developers being able to complete their goal and deliver the project as planned, mostly based on historic data.", "q2r": 5, "assessor": "z_assessor_3105", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9908, "q0": "This proposal is made with the intent of filling in the gaps that are currently missing in Atala PRISM to properly allow the community to begin building a proper Decentralized Identity ecosystem. \n\nThis aligns excellently with the challenge goals because it is providing developers the tools they need to be able to create applications that build, as well as leverage, Decentralized Identity infrastructure.\n\nThis has potential for global impact because it will help anyone around the world that wants to build something on Cardano that requires Decentralized Identity infrastructure.\n\nThis project provides open source functionality that will be available to anyone, therefore, its ability to scale will only be limited by the ease of integrating the functionality to other applications that need it.\n\nTo boot, the cost to fund them is very low, while providing something very important, this is an excellent value proposition for the Cardano community.\n", "q0r": 5, "q1": "The team is made up of two developers that have already been funded 3 times previously. They have delivered on 2 of the 3 projects so far, and are still in progress on their most recently funded proposal from Fund8, which is completely reasonable.\n\nThe budget is thoroughly explained as an hourly pay of $30 an hour, for 165 hours of work (it seems there is a typo because they say 330 hours, but it is clear that their requested budget of $4950 is equivalent to 165 hours at $30 per hour). This is a very fair price for the kind of technical work they are going to be doing.\n\nRisks mentioned come down to lack of availability of the Atala PRISM SDK to the general public developers at the moment. Luckily, anyone that would currently use their API service will likely be an Atala PRISM pioneer, and all the pioneers currently have access to the Atala SDK, so this is not too much of a risk to worry about.\n\n", "q1r": 5, "q2": "Progress can be tracked on Github and there is even a discussion board where questions can be asked to be answered directly by the developers.\n\nThere is a detailed roadmap of the development cycle for this proposal showing how they will go from design to implementation to testing and finally documentation in a 5 week time frame.\n\nThe timeframe is well defined and if anyone has any concerns they can always ask the developers directly through the discussion board on the Github they linked.\n", "q2r": 5, "assessor": "z_assessor_3133", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Expand WAL-CLI implementation to create an API-based identity wallet service", "experience": "The team is fully engaged in Decentralized Identity projects in the Cardano community, with projects already funded and delivered on F7 and F8. They've delivered WAL-CLI and are currently working on developing WAL-CLI Communication (DIDComm v2)."}