{"id": 419934, "author": "otaviolima", "title": "Track Wallets: Notify Mint/Buy NFTs", "url": "https://cardano.ideascale.com/a/dtd/419934-48088", "category": 26597, "amount": 47500, "description": "Difficulty following, keeping up to date and tracking favorite wallet addresses with NFTs Minted, Bought and Sold on the Cardano blockchain in a simple way, in real time and receiving notifications.", "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 793, "q0": "Assets held by all Cardano wallets are available in the open domain in the Cardano mainnet for all to see if they dedication to digging around tools to see the same. Even for my personal desire, I would like to get a notification if some transaction happens in a wallet. Whale Alert Twitter handle tracks Bitcoin transactions and posts tweets if rare events of important nature happen in the Bitcoin network. This service in Cardano can attract a lot of attention and few such services in some form exists in Cardano. The proposal is to build a subscription-based service to monitor and notify personalised alerts. This has a large number of potential use cases. One such is to monitor own wallet to get alerts on transactions. This is not likely to prevent fraud but people would like to get notification regarding the safe keeping of their funds. Therefore there is a potential largescale use case for such services. Therefore I believe that this proposal is useful and is in alignment with the challenge. ", "q0r": 5, "q1": "The proposal lists four Linkedin profiles with enviable career profiles. The combined experience is in excess of 50 years in related and important fields. The proposal has well-defined technical risks, which can be handled and the team with this kind of experience will be able to handle the same. The proposal is to develop a web service with a backend to interact with Cardano mainnet to run on AWS this is fairly standard and no research and development is likely to be required therefore any team with a full stack developer and Cardano developer will be able to implement it. The UX/UI will play a crucial role in marketing. The proposal gives a fair plan. With all these in place, I think that the team will be able to implement the proposal in a successful manner. ", "q1r": 5, "q2": "“Track Wallets: Notify Mint/Buy NFT” is proposing to complete the project in five months at the cost of $47.5K. The earmarking for developer compensation is 2x $2800 x 5 months ( $28000 ). This forms the bulk of the cost and the amount looks very reasonable with the per hour rate coming to less the $30. The project road map is well defined. As stated earlier the success of the proposal will depend mainly on UX/UI which is not definable at this stage. However, with the given derails of road map plan, people involved and the budget without put of the proposal clearly emulated in the proposal, the project is highly auditable. ", "q2r": 5, "assessor": "z_assessor_2129", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5529, "q0": "Cardano is trailing some other blockchains in NFT market. Even though Cardano has some advantages over them, they still seem like the go-to-option for many users. So, we require some projects that can reverse this situation. This proposal aims to start something new and usable in the Cardano community; following people’s wallets to track their actions over NFT market. There are many creators, traders, influencers that mint, sell, or buy NFTs. With this many people and within a crowded community, one can miss out some NFTs. This experienced team’s main idea is to give the users an opportunity to keep in touch with the people they want to follow. For example, with such a platform I can easily follow someone’s wallet, that I find the ideas of whom are worth following.\n\nNow I want to talk about the risks that the proposal mentions, or absence of risks. I think that risks have not been regarded in a serious manner. Saying that there will be no risks  in the adoption of the project just because they have seen interest from users does not make sense to me. There are many aspects of the project; website, software, programming, interface, wallet integrations, feedback mechanisms, and so on. Thus, this part of the proposal feels very superficial for me.\n\nMain idea of this project is to create a better environment for users. The challenge setting here is ‘Developer Ecosystem’. Although this project can also be useful for developers in the long run, it is hard to say it is in line with the challenge. However, this idea can be very useful for Cardano and I decided to not to deduct a point for it. My only reduction will be for risks part.", "q0r": 4, "q1": "The team has listed their timeline and planning very well. Budget is also very on point and detailed. Unfortunately, I have several problems with it. \n\n- In month 2, they are planning to do studies for UX/UI and in month 4, starting frontend programming. This may lead some problems. If these two are not being done around the same time, it may rise to some compatibility issues down the road. Selected and decided design with some key users may not coincide with frontend part. To eliminate this issue, frontend programming could be started early.\n- Backend and frontend integration is planned to be completed in one month. Again since frontend will start fairly late this integration can also take longer than anticipated.\n- For minimum viable product just one month is definitely too short. Saying that after working for 5 months for a beta and launching the full platform just 1 month after cannot be considered as careful planning for me. There may be problems, or people may find some bugs. These can push the launch to a later date. I believe that instead of keeping this time to one month, they could have given more time for beta to develop.\n- For the budget part, they are planning to use a frontend developer for 5 months but as I said before frontend starts in the fourth month. So this part of the budget planning is wrong. Also they have a full stack developer in their team but they request a budget for frontend and backend developer, which does not make sense\n\nApart from all these negative things, the team looks solid and experienced enough to be working in this project.", "q1r": 2, "q2": "This part of the proposal is the shortest and can be considered as with the least details, but it is not the case considering given details are not insufficient. Here, proposal talks about quantitative data, that is, how many users are registered, and how many wallets have been connected. Each KPI they have mentioned in this part is very easy to follow and manage. I would give one note here, they could have divided this KPIs to 2-3 month periods. With this they would be able to see their current progress and if certain aspect is not going as planned they can align themselves to the newly acquired data.\n\nAll in all, the proposal is auditable. They have also planned to create a communication method to inform the community about their progress with progress reports and announcements in their website. Their planned social networks can also help collecting feedback from community. Although rest of the proposal needs some more work I do not believe that the proposal has problems regarding auditability.", "q2r": 5, "assessor": "z_assessor_2711", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7560, "q0": "The difficulty of tracking and updating favorite wallet addresses with NFTs minted, bought and sold on the Cardano blockchain is a problem to solve in this challenge. This issue is directly related to the present of the challenge. The well-defined solution tracking ADA Wallet and Get Alerted When They Mint, Buy or Sell Cardano NFT is the way to go about this. The author is confident that there will be no difficulty in adoption, as they have verified user interest in tracking minted, bought and sold NFTs from favorite users. With their confidence I hope this project will be successful.", "q0r": 5, "q1": "This proposal describes a clear roadmap and timeline for implementation. The timeline is divided into 6 months by the author, clear and specific goals are listed by the author in detail what to do in the month and also aim to achieve them in a certain period of time. . The progress of the project is also easily trackable through the social networking sites listed by the author. The success is clearly described by the author as the results achieved are: information generated in real time for website users, community participation on social networks (Youtube, Twitter, Telegram and Reddit) , make users follow the wallets of more experienced people and help make the best choices, keep users updated in real time, help discover new NFT projects, perhaps still in sight, validating feedback, and improving the platform. This success is linked first to the challenge of the campaigns. The solution to this problem is an app that allows you to track and trace your Cardano wallet click a button to track a portfolio to add to your Dashboard. From there, you'll start receiving notifications every time someone you follow mints a new NFT, buys, or sells. This solution could solve the present challenge of the proposal.", "q1r": 5, "q2": "KPIs are clearly defined, the proposed future implementation plan is very detailed and complete. Performance metrics are complete and unambiguous.\nAuthors will provide the community with some kind of progress report as they go along, in the form of a monthly news release on the Cardano Feed, to measure the progress of their proposal.\nThe author will also provide a board to be disseminated in the Cardano Feed, with the development of the project according to the Catalyst KPIs.\nNumber of visits to the website: 50,000\nSubscribers: 3,000\nNumber of registered users: 100\nNumber of connected Web3 wallets: 3,000\nNumber of wallets tracked: 3,000\nNumber of notifications sent: 50,000\nWith the above indicators show that this is a good project with adequate performance evaluation and measurement indicators. The team will have a journalist, blockchain and crypto content editor, video marker, and presenter. The team consists of 4 main members working on this project the author seems very experienced and has a strong background: Otávio Lima is Founder & CEO at Cardano Feed, Felipe Barcelos is a Software Engineer and full stack, Gino Matos is a crypto journalist & content editor, Lucas Fernandes is a marketing assistant. The author also outlines what each member of the team has done, they talk about their experiences. their previous experience. They also link attached network links so we can easily follow their projects easily. The funding applied for this proposal is $47,500 less than 20% of the entire challenge budget. The budget is clearly outlined and divided into appropriate expenditures. I think if funded this project will be successful.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13976, "q0": "When reading this proposal there was a lack of clarity in how it looks to address the challenge. The general idea is a bot that monitors NFT transactions a pre-existing idea that is seen on Solana and Ethereum blockchains. Intuitively I can assume that the rise of a popular bot (app) on the Cardano blockchain may attract interest from NFT developers to build on Cardano or even competitors to build similar apps. If popular it could lead to a community growing around NFTs flippers and investors alike. This however is all speculation from my point of view as an avid NFT investor and not detailed in this proposal at all. An automated system could be attractive but why is not explained. There is some mentioning of fighting fake mints which could provide security to NFT consumers but the benefit to Cardano is once again not clearly explained and more importantly it fails to meet the brief basic requirement of explaining how it will attract high calibre developers. The suggestion that the goal is large scale adoption is hinted in the proposal with the interest of users being claimed to be already verified. Prior verification of interest in the app is a strength however to improve tangible evidence of public interest would provide a stronger statement of intent. Possible reference to similar platforms on other blockchains in terms of users and competitors could also help display the projects benefit to the Cardano ecosystem. A key metric this proposal could look to focus is a ‘a sense of community and conversation’ explaining how the social aspect of following wallets could create communities. With users becoming influential or following influencers in the Cardano space. Another avenue this proposal could consider is that a transaction tracking app could help provide more transparency between developers and consumers, in turn pushing away low-quality developers (who may look to rug pull) and inviting in trustworthy developers who have long term goals. In essence High quality developers will be attracted to the platform as their trustworthiness can be confirmed by the community. Avoiding the fear mongering of a rug that, many NFTs projects face. In future proposals the proposals should consider the guiding questions in the campaign brief.", "q0r": 2, "q1": "\nThe proposal clearly states a month by month roadmap outlining the tasks and milestones starting from month 1 to month 6 . This appears to be appropriate time frame according to several internet soureces(https://spdload.com/blog/how-long-does-it-take-to-develop-an-app/,https://3sidedcube.com/how-long-does-it-take-to-build-an-app/,https://www.uptech.team/blog/how-long-does-it-take-to-make-an-app).This suggests a feasible timeframe with several sources agreeing a timeframe  of around 6-9 months required for a mid-large scale app. This were not Cardano or even blockchain specific and web 3 apps may require development that is beyond my expertise. Within the roadmap I will flag several concerns in particular the lack of specialised or specific information. For example, in month 1 it refers to gathering requirements and features a statement that I believe to be too broad, the proposers would benefit from describing these requirements and features as they are key in judging how feasible it will be to achieve within the time frame given. Another example is in month 2-3 in which the final bullet point involves creation of all other screens .Number of screens is specialist knowledge and greatly effects time frame proposers should look in future to reference how many screens are planned to be used as it will greatly effect the feasibility of completing the app in the estimated timeframe, The proposal in future needs to  clearly explains technical aspects like architecture, language and technologies as they are crucial for implementation. The tasks are outlined for each month but the proposal would benefit by describing who will be in charge of role and the amount of person working on each role the failure to do so makes it hard to discern whether a task can be completed in the given time frame, there is a reference to 7 additional collaborators that could help with workload(a possible challenge) but their skills and qualifications are not mentioned. In future referencing these 7 collaborators and the role each team member will play alongside roadmap would make the idea more feasible. Overall, the roadmap needs more specificity phrases like ‘attracting the first users’ without context of how and who is responsible for doing so result in a unclear direction, the proposers should detail how this is done (through giveaways, social media interaction posts) and consider referencing successful projects that have used similar methods. Using historical reference enhances feasibility as there is already proof   that it works. The budget appears to be feasible and applicable to the project intentions. There is some vagueness which is admitted by the proposal claiming more complete details will be provided if selected by catalyst. Key areas of concern being social media and marketing budget. In future proposers should provide as complete details in initial proposal to ensure funding rather than vice versa. Specifying what ‘social media’ entails and how it differs from the general marketing budget would be beneficial. The team across the board seem well qualified and already have several projects in the Cardano space suggesting a good capability to execute on the platform. This alongside with a large social media following(twitter) of 54k they have a large reach. I do have two concerns however despite the large following the twitter pages interaction is disproportionately lower than its followers. In terms of the website (cardanofeed.com) at time of viewing the images are stretched and pixelated, not a very professional. The UX/UI and ability to market well with good interaction are key goals the project looks to achieve, and their current projects fail to display it in certain aspects. Of course, this could be a funding issue, but it is an issue regardless. Perhaps consideration of UX/UI budget could help the proposers address this issue. The team don’t discuss any intrigue or insight in the NFT space which ill flag as an issue in terms of feasibility. Understanding the space will be key in creating a platform that meets the needs of the users and is hence successful. The team should consider adding a Cardano or even Plutus coding expert to ensure the success of the project as web 3 projects often face different issues. The team don’t plan to return to catalyst under the premise it will be self-sufficient. This is a fair assessment to make but without quoting membership pricing, cost to run and overall revenue predictions the feasibility once again comes into question. The team should consider adding to the proposal the cost of maintenance for the app and the price they will charge users before claiming the app to be self-sufficient.\n", "q1r": 2, "q2": "\nThe proposal does look to have an accessible public channel in the form of a progress report in which be published  on a monthly basis. They plan to use to use their pre-existing website Cardano feed and provide a panel to be disseminated with the feed. Both seem like reasonable offerings but are worded poorly within the proposal. The use of ‘some sort of progress report’ suggests a lack of great thought has gone into auditability. In future the proposers would benefit from detailing what they plan to put in this progress report, who will be involved in the panel and who’s role within the group it will be to publish this report. The proposal does mention some figures that will act as KPIs, important as quantitative targets are easier audited and completely definitive. These targets do appear to have issues, the first mentions hit to their existing website. It appears the website will serve as the hub for updates on the project  ,but one must consider that it also serves many other purposes so the number of direct hits it receives shouldn’t be assumed to be directly linked to the success of the proposed wallet tracking app. Correlation does not mean causation, for this reason proposers should consider another indicator of success(that directly links to app success) for example hits on a twitter page dedicated to the application. Another issue is that the proposed numbers don’t seem to align. The confusion may be on my end, but the proposal details a target of 100 subscriptions alongside a target of 3000 connected wallets/registered users. Firstly, registered users and connected wallets appear to be the same goal but are written as different performance indicators. Secondly the proposal suggested a 7-day free trial that moves onto a paid monthly subscription, due to the lack of time frame given for these targets’ auditability is negatively affected. Do 2900 members not move onto the paid version? Are these targets all meant to be reached in the same timeframe? The lack of clarity means all conclusions drawn are assumptions’ future proposers should provide estimated timeframes for each target. More clarity on the transition from free user to paid user would also help enhance the proposals auditability with paid users being a key indicator to app success-the app aims to be self-sustaining. The proposal does mention community engagement as a metric of success but as explained prior it would benefit from providing a clear time horizon for each goal. The goal themselves could be more comprehensive with three targets essential being the same target (tracked wallets/registered users/connected web 3 wallets). As a whole proposers should spend more time considering goals and their significance to the success of the app. Using the historical data of other applications could help determine what are suitable benchmarks for success. \n", "q2r": 3, "assessor": "z_assessor_3865", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14999, "q0": "This is a proposal for a very interesting project concept that would allow you to get notifications when wallets you choose to follow mint, purchase or sell NFTs.\n\nFirst and foremost I disagree with its inclusion in the Developer Ecosystem challenge as it doesn’t answer any of the guiding questions presented in the campaign brief. This would have been a very good proposal to pitch in the Dapps, Products and Integrations category, but it’s totally out of place in the Developer Ecosystem challenge and I completely fail to see why it was submitted here. The proposal does nothing to convince me otherwise and answers this question completely inadequately.\n\nIt could potentially add some value to the Cardano ecosystem, but definitely not in this challenge.\n\nBesides this, while the concept is interesting there are still several unanswered questions that  the presented plan doesn’t sufficiently address, like for instance how will the list of available public wallets be compiled and what would guarantee that even those who choose to share their wallets would do so with their “real” wallets, and what would guarantee that the tool doesn’t become just an instrument for manipulation.", "q0r": 2, "q1": "The proposal comes from the team behind CardanoFeed a multilingual news and info resource about the Cardano ecosystem. The team is very well presented, with short but comprehensive bios for each member and a LinkedIn profile to back up the claims and verify the credentials.\n\nThe implementation plan covers 6 month of work and is logically presented and easy to follow. As the team already has project funded by Catalyst a note on workload management is include - this is highly appreciated, as it’s something that very few proposers have included.\n\nThe budget is adequately broken down and covers all the required development tasks for the successful delivery of the product. The estimated costs seem fair and I like that the proposer thought about important but often overlooked aspects of the project, namely marketing, social media and community outreach.", "q1r": 5, "q2": "I don’t really appreciate the inclusion of the phrase “some sort of progress report” but that may have been just a language quirk as otherwise the presented KPIs are very logical and and realistic and would make the project very easy to track. I also appreciate that the proposers promise to include a page dedicated to the evolution of the project on their platform, Cardano Feed.\n\nSuccess is also very well defined and the presented metrics would enable easy monitoring.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Follow ADA Wallets and Get Notified when they Mint, Buy or Sell Cardano NFTs. Track wallets that interest you: influencers, whales, traders... Always be the first alerted via Discord, Mail & Web Push.", "experience": "The team will feature a journalist, blockchain and cryptocurrency content editor, videomarker and presenter. Conceived and produced by the CardanoFeed team, the largest media specialized in Cardano coverage. We already have over 800+ projects registered in the Cardano Ecosystem."}