{"id": 420395, "author": "tigerview", "title": "MeetProposer-Bright Up Dev's Ideas", "url": "https://cardano.ideascale.com/a/dtd/420395-48088", "category": 26597, "amount": 49892, "description": "Many developers have high-value ideas but aren't good at building them or promoting them to the community, so their proposals don't receive high PA scores and are not being funded.", "f6_no_assessments": 14, "f6_rating": 4.761904761904761, "videos": [], "media": [], "f6_assessments": [{"id": 13698, "q0": "To be honest, this proposal is quite excellent in the idea that I find it can be useful and have a big impact in the long term. It is about hosting meetings to bring proposers together so that their ideas will be presented to the community and get critical advice. The problem statement points out an obvious situation through this excerpt: “Many developers have high-value ideas but aren't good at building them or promoting them to the community, so their proposals don't receive high PA scores and are not being funded.” We all know that, Catalyst Funding receives many good ideas however they are imperfect at some points so they miss the opportunities to be funded. Obviously, Ideas that do not meet the standards will be filled-out but this proposal is suggesting a chance for those ideas to be better by the way that can’t be more practical. Thanks to the helpful advice of the community’s experts, the developers’ ideas are given an opportunity to be useful for the Cardano ecosystem. To me, this initiative is not only unique but also positive, fitting for sure with the objectives of the challenge. We know that, to attract the developers to build successful apps, we consider creating a friendly and constructive environment where they feel they can have their idea fixed to be more suitable for the whole community. For that, they feel connected with the ecosystem and want to contribute more to help our community. Talking about the impact, the proposers outline this part in a systematic and logical way. I first know briefly about the project, that it is a series of meetups held by a community called TIGER View and its purpose is also clarified. Through this part, I gain more knowledge about how this program is organized and there will be specific participants for example: proposers, PA, media team, community and so on. They are the one who directly join to make it fulfilling and useful for the related people. There is one excellent part that these meetups are not only for the host-country (Vietnam) but also globally organized to reach international ideas. Reading down the proposal, the workflow is also described in rich detail from which I can understand the process of this program. PA will register for the proposals they want to listen to, then the proposers will be contacted and met with everyone via Meet. I found this part is outstanding when there is a session called “After meet”. In this session, the reward will be given for high-value feedback from the community and PA. I believe this is a smart way to motivate the participants to give constructive and helpful advice for the proposers.The proponents also state that this program has been in pilot phase since 3 months ago; I have confirmed it and been quite impressed by the program itself. One of the most interesting pieces of information is that the proposers are able to point out every single benefit gained by every participant. Not just so, they state out risks might occur during the program and give it a reasonable solution. From the above, they show me that they have researched their project in a meticulous manner and have deep understanding about it to find better ways to implement. The proponents, throughout the impact, explain in detail how this project would be constituted, by which parts and what each one of them will generate for the total process, demonstrating a lot of mastery and clarity about the entire extension of the project and making its characteristics understood by the proposal readers. For these reasons, I believe that this proposal deserves the maximum score in impact, its premise is extremely useful for Cardano and it can achieve the specific objectives of this challenge. \n", "q0r": 5, "q1": "Regarding the feasibility. I can see that the information given is extremely rich and explained in a precise and detailed way. They first explain the brief introduction with a timeline and milestones about its activities. I know the program will be organized from Aug 11 and last until Oct 29 with a total of 12 weeks. With the above timeline, It’s suitable to host meetups as Fund 10 is expected to start on Oct 10 as well so it will be convenient for proposers to receive advice through meetings and have time to edit their ideas better. Now talk deep into the activities.  It is very rich in detail, but it lacked a sense of temporality and understanding what is behind the events. The activities to be carried out during the entire process are enumerated and richly detailed, so that we understand quite clearly what would need to be done and how. However, to me it's more like an agenda mixed with targets and KPIs rather than a detailed plan. In my view, a detailed plan should contain this information: what will be done by who, how and when; I haven't been clear with the “how” and “who” in here. For example, I expect the proposers clarify how they set up the Media team, recruit the members from where and based on what criterias? I would also like to know what job each role takes over and so on. Therefore, I think the script is accurate in terms of making us understand what events would be, but not what would happen behind them or how long each thing would take to be developed. Speaking now of the budget, I believe that the asking amount, approximately 50 thousand dollars, is very fair. Several meetings will be held, many things would have to be worked on before and some after, this generates a lot of expense. Regarding the explanations of this funding, we have some main points (reward, host Meet, Zoom payment, editing, Marketing, project management, reserve for ADA slippage, v.v). The first three points are divided into small parts, so we understand very well the reason for the asking price for each. My only observation is regarding the 3rd point, the program is hosted via Meet so I am not clear with the reason for including Zoom payment here. Now talking to the project’s members. There are 3 members, 1 team of more than 20 PAs, . This part is excellent, we know who the professionals involved are, what their professional areas are and it is also explained a little about their social media accounts, so that we can check all the information that is said. There is a lot of confidence in them, mainly because they are from the Cardano Catalyst community under many roles, which indicates that they would have a good idea of ​​how to imagine and dialogue with the target audience. There is an interesting point I highly appreciate that some project members  used to propose proposals and got 4 funded from Fund 6 to Fund 8, which shows their high commitment with contributing to the Cardano ecosystem. That is, I believe that the feasibility is good, with only a few points to clarify. \n", "q1r": 4, "q2": "The four ways this project will be tracked for progress during its development are clearly outlined by its proposers. These include the creation of a set of key performance indicators (KPIs) such as: Number of Proposers registered to present at MeetProposer, Number of new PAs participating in Meet sessions, Number of valuable critical questions from PAs and Communities, Number of high value advisors voted by Proposer. They explain to me the goals and the signal when those goals are attained. In other words, all the methods for measuring, analyzing, and reformulating the project are described, making it crystal evident to the Cardano Community what should be prioritized as each project phase advances. Now that we have the results, they provide a more thorough explanation of what would have to be achieved, we are also told exactly what to expect. I think that just like the other topics, the auditability is very accurate and gives us all the information we need safely.\n", "q2r": 5, "assessor": "z_assessor_3750", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 685, "q0": "Look at the videos, I've found the meetings have helped developers greatly improve their projects. For example, the project \"Cardano Forest In Vietnam\" [https://cardano.ideascale.com/c/idea/396832] has been funded since Fund8, which has been upgraded into a bigger project named Blocktree [https://cardano.ideascale.com/c/idea/414457] by the advice of Mr. Duc Tiger (https://youtu.be/RPNYfcr2Ijo). Another example is the project ADACHEEM (https://youtu.be/4b4a09rfHtk) has grown into a better project https://cardano.ideascale.com/c/idea/414059 by the advisement of Mr. Do Manh Hung, a very high-level of expertise of blockchain and Cardano. I think, this is a very impact project not only for the developer in Vietnam but also for the developer community in over the world.\nEven better, this seems to be operating as a DAO (Decentralized Autonomous Organization). If this project is funded, this could extend to the entire Catalyst ecosystem.", "q0r": 5, "q1": "The detailed plan with specific steps and clear goals within 8 months to conduct 50 Meet proves that the MeetProposer implementation team has prepared thoroughly. Despite some minor errors in the presentation of the timeline, it is not a problem, because the co-submitter has corrected them to adjust the schedule in the Comments section.\n\nThe broadcast team is made up of people with the right experience and expertise, and they seem to have been working together in the Cardano ecosystem for a long time.\n\nThe project has been piloted 4 months ago and produced 12 meets successfull.\nI have no doubt about the feasibility.", "q1r": 5, "q2": "The measurement indicators are consistent with those of challenge Developer Ecosystem. The proponent clearly explained how these metrics address the requirements of the challenge.", "q2r": 5, "assessor": "z_assessor_2115", "no_vca": 13, "ne": 2, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 1868, "q0": "The problem now is that when Cardano's ecosystem is growing stronger and stronger, especially when it comes to funding requests from Catalyst for good ideas from developers, it is becoming hotter than ever. . However, there are many developers who have high-value ideas but are limited in building them or promoting them to the community, so their proposal does not receive a high PA score and is not funded. Therefore, the purpose of this proposal is to connect people with good ideas and people who are looking to learn about technology projects to increase their knowledge and find investment opportunities from many people. Soon. The solution was to organize a series of proponent meetups, for developers to present their ideas to the community and receive key questions and advice from experts around the world. the world before the Completion period ends. Meetings organized by the TIGER View community on a weekly basis are arranged and fixed. The target audience of the proposal is people with valuable ideas for the Cardano ecosystem who are planning to submit funding proposals for the next Catalyst Fund, and PAs who are looking for information about other projects. projects to serve the evaluation of proposals in Catalyst Funds, or investors from the community, they hope to find early investment opportunities from high-quality and profitable projects. sustainable development trend. The scale of this project is a global scale. So it has the opportunity to develop widely in the world community if it is funded.", "q0r": 5, "q1": "The team also raised a possible risk of the proposal being a loss of connection during the meeting due to poor internet connection quality or a server outage, but the team should offer more than remedial measures for these problems. this risk. Does the proposal provide a detailed plan, including progress and milestones for implementing the proposal. The group has a clear assignment of work for members with the core team of the proposal consisting of 3 people: Mr. Duc TIGER is the Project Manager. He has been working on the Cardano blockchain technology and the Catalyst ecosystem for many years; Participated in Catalyst to evaluate proposals as CA (Community Advisor) from Fund4 and vCA (Veteran Community Advisor) in Fund6. He also founded and co-founded several sponsored projects: 2MIN and BWORK. In this proposal, he will oversee all processes of the MeetProposer project, connecting community members to work together to make the project of high value. Mie Tran is a global host, she has a very good command of English. She has extensive experience in translating and hosting the Cardano Catalyst TV show. Quynh Anh is a native Vietnamese host, she has been researching Cardano blockchain technology and the Catalyst ecosystem for many years; Participated in Catalyst to evaluate proposals as CA (Community Advisor) from Fund7. There is also the support of the excellent PA team and the TIGER Media Team: a group of people with social media marketing and communication skills. So looking at the experience and expertise of the members we see that the team is fully capable of ensuring a successful project launch. Currently, the proposal does not generate profit and only serves to spread Catalyst to the community and support developers to engage in this productive activity themselves. However when the project is strongly developed with a channel on youtube has a significant increase in the number of viewers, the group should pay attention to the fees collected from advertising activities.", "q1r": 4, "q2": "The total required budget is $49892, which is an adequate budget to develop an improvement project for the Catalyst ecosystem. In addition, the budget is explained in detail, specifically for each project item, showing that the proposed calculation group is very close to reality. The team has also clearly outlined metrics to track their project progress and explained what each of them means. Moreover, the team has clearly defined the success of the project and I see this success as possible. Conclusion: The project is financially transparent.", "q2r": 5, "assessor": "z_assessor_2280", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 2848, "q0": "The recommended developer team tells the reason for this proposal, because there are many developers with great ideas right now, but they are not good at communication and there is no way to meet, or contact with the PA community to get a high score, then use it as a basis for the community to vote. To remove this barrier, the proposal team held meetings for the PA community and proponents, exchanging community feedback with developers, to help the community understand the project. What problems does the lab solve, and also helps developers research more input from the community, in general the main work that this proposal group identifies is communication and referral, so it can be seen that this proposal only solves part of the challenge, why say it has partial impact, because now the Catalyst facilities are working so meticulously, they won't give up miss it. any proposal does not have a review PA because through the PA phase there will be statistics for the evaluations of each proposal for the vPA phase, if so they will resubmit those proposals for addition co-reevaluation. and according to the latest statistics of the 8th round, there are very few topics without reviewers, but there are articles with more than 10 reviewers, and the time factor for PA is now raised to 2 weeks, and No. the number of protected areas is increasing with each funding round, I think the number of proposals without reviewers will be very small and the % very low. Sponsored or not is still largely determined by the quality of the proposal's ideas, not by much the number of reviews. Why are there still proposals over 10 reviews and still not funded? The layout for conducting the meetings is fully provided by the team and explains what each person will be like and what role they will play in the meeting, with examples and evidence for that. In addition, the reward organization to attract the community to participate in interaction, clearly present and explain the reward mechanism, and what is especially interesting about this proposal is that anyone can use it proficiently. These two languages ​​can participate: English and Vietnamese. * However, I have a few questions I'd like to suggest to the proposed team: - the team claims to have successfully held meetings before this funding deadline, but the team doesn't say how many people are in the group. community has participated in the interaction, and has not made any commitments What is involved in ensuring the number of participants in each meeting, as the key to the success of this proposal will be interactive participation community, especially the Protected Area community. In addition, the team raised a potential risk that will not affect the meeting much, and also because this proposal is only communication, not technical, it will be less risky.", "q0r": 4, "q1": "The proposal team provides a very complete plan, but I have a small suggestion to add more details and also confirm with the community the feasibility of this proposal, here is my proposal, * team The proposal clearly defined the organization stage for each event, but did not specify on which date each item would be assigned within the time period that the group defined for meetings, e.g. the group identified there are a total of 26 important meetings for both Vietnam and the world, so it is suggested that specifying a date for each meeting will increase the score for feasibility, so it will be easier to identify and not I have duplicate meetings, in addition, I have noticed that there is an error in the presentation of the roadmap. It doesn't matter, along with that needing to specify how much reward is expected for each meeting is, for example, the total number determines the team will hold 26 meetings, domestic and foreign, so b How much reward is expected to be spent? for the community, also, what is the difference between national and global meetings?. Domestic meeting, foreigners are not allowed to attend? In my opinion, the group should not be divided like that, once the team has a member with experience in interpreting, because the first group mentioned will be the global meeting, and the content of the meeting with the developer will be alike. Content related to Cardano's ecosystem, Regarding the team information of the proposal I have no opinion as they have provided sufficient identity and suitable experience to implement this proposal.", "q1r": 4, "q2": "The scope of the work of the proposal is done online and the proposal team also declares, will record and make it available to the proposal team's Youtube page so that the identification, and tracking of the completed workload of this proposal is also very easy, and the team has also provided a full range of performance indicators for the community as a basis for verification.\n   The success of the proposal claims to affect and will benefit 3 components of our ecosystem: the PA community, the developer community, and the dReps community.", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 11, "ne": 2, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 3222, "q0": "The problem is clearly defined in the proposal. Match this challenge item. Most developers have good ideas but don't know how to build (write) proposals for their ideas or promote them to the community.\nThis proposal identifies several issues of the challenge and offers solutions and logical arguments. Specifically: Hold meetings with proponents present to the Community, their ideas with the community, and get questions and advice from experts around the world. These Meetups will be recorded and uploaded to the YouTube channel so that those who missed the Meetup can watch them again.\nRegarding the product of the project, there were about 50 meetings between the project owners (proposers) and the community (including core-PAs). Of which, 36 are from Vietnam and 14 are from international.\n\nThe problem here meets one of the critical requirements of the challenge. It's about getting developers from outside of Cardano's existing community to join Catalyst.\nParticipants are PAs, project owners, and the voting community, DRep will be and are active on Catalyst.\nGlobal area of ​​impact. Including Vietnamese, English, and local language-speaking communities depending on which country the project owners are from.\nProposal to add value to the Cardano ecosystem. Increase/engage developers from outside of Cardano's existing community to participate in Catalyst writing proposals and building active projects on Cardano.", "q0r": 5, "q1": "This proposal does not adequately cover the implementation challenges. Only talking about the transmission. I think you should add other challenges, for example, in project implementation and Marketing, are there any difficult challenges when attracting project owners to participate?\nClear, reasonable timelines with specific goals. Specifically, you have added/edited the \"Annotations\" section of the proposal.\n The overall project implementation roadmap is clearly presented according to each milestone.\n\"The team is full of people with the skills to implement the proposal. The team includes Mr. Duc Tiger with experience as PA from fund 4. Also a veteran VPA community advisor from Fund 6. There are also other members who are all community leaders and have a lot of experience in both PA and vPA as well as in writing proposals.\nThe team has publicly available Twitter, Linkedin, Github, Telegram, ..., proof of their qualifications and experience.\"\nThe group has assigned tasks to each member clearly in accordance with each person's skills and experience.\nIn terms of revenue, mainly from Catalyst funding. The required amount of this fund is $49,892\nThe proposal has a trial product and has positive feedback from the community. Specifically, they have experimented with the Metain project, Metaverse Builder project, ... and got positive and positive results from the community, PAs, and project owners.", "q1r": 4, "q2": "The budget is explained in detail, the expenditures are quite consistent and reasonable with the plan of the proposal.\nMeasurements are stated with specific numbers. The number of registered Proposers, and the number of PAs involved.\nA number of valuable questions from the PAs to the project proponent were presented.\nThe success of the project is described in detail, and easy to understand. Proposal writers on Catalyst receive valuable advice from PAs to help them improve their project proposals. PAs know the project well to help them deliver high-quality reviews. This will increase PA's reward by increasing the number of Excellent reviews. Voters and dReps have more information and know more about the project to make voting decisions.\nThis is the first proposal of the MeetProposer project. Team members already have other projects funded in funds 6,7,8.\nTheir other projects are still on schedule and nearing completion which is a plus for the team.\nThe community can check the team's metrics and work progress through a Google Sheet report file.", "q2r": 5, "assessor": "z_assessor_2412", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3827, "q0": "This proposal seeks to host a series of 'Meet Proposers' for developers to present their ideas to the community, and get critical questions and advice from experts around the world before the finalization stage. The problem statement is clear about the fact that many  developers do not get enough PA scores and don't get funded because most of the developers have great ideas but are not good at writing good proposals.\nThe Tiger View Community organized the 'Meet Proposer' meetup series which is done weekly, and the purpose is to strengthen the connection between idea proposers and the Cardano community. With this, the proposers will get the chance to present their proposals to the community in about 5-15 minutes.\nTo address the challenge, the proposer has explained that proposers will present and market their ideas in front of the community before the 'Finalize' stage expires. Then PAs can gather more information about these presented projects before the 'Assess' stage so they can have enough time to improve the quality of their assessment.\nThis way, developers are helped to be attracted to the ecosystem, which is partly what the challenge is working for. \nThe main risk mentioned by the proposer is loss of connection during the weekly meetings due to poor connection quality or power failure. To mitigate this risk, the proposer said there will be a Co-Host to remind.\nI can conclude that with the information above, this proposal effectively addressed the challenge. My rating is 5", "q0r": 5, "q1": "It is mentioned that the 'Meet Proposer' will kickstart from the voting period of the current fund to the 'Finalize proposals' and deadline of the next fund. \nThe plan shows a detailed timeline with specific duties, seen as August 4, 2022 - August 11 2022 (Start Vietnam native meet), August 12 2022-October 29 2022 (Fund 10 Meet Proposers), and all through to April 30, 2023 (close proposal). So the duration of the proposal is 9 months. Specific detailed duties are aligned to each timeline. \nThe budget total requested is $49892, which is reasonable and it has been broken down into comprehensive details showing costs for Host meet; digital marketing, etc. \nThe team is made up of 5 groups of people who are active members of the Cardano community and have experiences in Cardano blockchain technology; roles played as PAs, vPAs, etc. which are relevant to the project. Their LinkedIn profile references have been provided. \nThe team has said in the proposal that they will return to Catalyst for later round of funding to help continue the service to the proposers.\nThey are involved in other proposals in Fund9 and also working on previously funded proposals.\nI believe the information provided is likely to make the implementation of this proposal successful. My rating is 5.", "q1r": 5, "q2": "The proposer has presented some indicators to measure progress and success. \nFor progress measuring, the number of proposers registered to preset at Meet Proposer; the number of new PAs participating in Meet sessions; the number of high value advisors, etc. All of them have been explained in detail in the proposal. \nThe success for the project will be seen as, that Catalyst developers get highly valued advice from PAs to improve their proposals. PAs get a good understanding of the project to help them do good assessments . etc. This is a new proposal.\nThe points are good to help auditing but there is no mention of reporting and where we can track the progress, that is on You Tube, GitHub or where? So my rating is 4.", "q2r": 4, "assessor": "z_assessor_2483", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4402, "q0": "I find this proposal essential to bring good ideas from developers to the Cardano community, to professional PAs to get useful advice and advice for their ideas. A proposal acts as a bridge between the idea creator and the consultant to turn the idea into reality. So the proposal solves the goal set out in Challenge: Developer Ecosystem. The team identified the problem to be solved very clearly. I appreciate the team's idea because it is necessary for the present and long term for the Cardano ecosystem. Specifically, it adds value to the Cardano ecosystem. All of the famous projects in the current Cardano blockchain come from a developer's idea. Good ideas are considered seeds that need to be cared for and nurtured to grow into big trees in the Cardano ecosystem forest. And \"Meet Proposer\" is considered the ideal nurturing environment for seed ideas like the one I just mentioned. \"Meet Proposer\" is good for both idea proponents and PAs. It's great that this is a program that benefits everyone involved. The team is also very enthusiastic when intending to expand the initial scale from Vietnam to the international level. This is the source of proposals that can solve future challenges. I strongly agree with the impact of this proposal. A proposal with a good idea is very meaningful and completely applicable in real life. I vote 5 stars.", "q0r": 5, "q1": "The team is all of the people with long-term experience in the Cardano blockchain. In particular, they are Catalyst's PAs and vPAs. In the proposal, they provided relevant documents, specifically videos showing the Meet Proposer pilot program that they did (before writing the funding proposal). This shows the team's enthusiasm for the program. One more thing that makes me very satisfied about the disclosure of the identities of the team members is that they have presented the link of each member on social networks for the convenience of the community to look up. This greatly increases the feasibility of the proposal and the credibility of the team. I like the breakdown of the budget by items, it is reasonable with the set goals and convenient for the audit. This is an important factor to increase the feasibility of the proposal. I have a small question for the team: In this Fund 9, if the fund has not been funded, will the team continue to do Meet Proposer programs as they have piloted some programs? I highly encourage you to keep working with or without funding. Because it's a great program, very important for the proponent and PA and the whole Cardano Vietnam community (later on an international scale). I believe that the team's efforts will always be rewarded. In the proposal, the plan and implementation are presented. This includes the resources needed to make it happen. I understand, in addition to the key members of the team, that some collaborators are the core PAs, they are all good people. But I learned that some members also participated in developing other proposals at Fund 9. After all, does the team have enough human resources to implement the proposal? I believe with your professionalism and expertise, this shouldn't be a problem - you guys can do it easily. But that's from my perspective, and from the perspective of some people who have never known anything about the team before, I recommend that the team have a specific explanation to demonstrate the feasibility of ensuring resources. human resources to implement the proposal (this is especially good, needed for brand new members of the community). That's my advice, I hope you take it. On the technical side, with highly skilled people like team members, it is not difficult to deploy techniques and technology with languages ​​used in Vietnam and internationally. I strongly believe in the success of this. Given the risks and challenges involved in implementing the proposal, do you think the challenge is insufficient funding? (I mean the case where funding from Catalyst is not yet available.) Another idea, with the participation of talented and enthusiastic members - the program is definitely of good quality, but in terms of promotional images, how to increase the visual appeal to the community (apart from digital marketing solutions and group chat announcements)? I think that for the program to have a strong spread and be known by many people (both inside and outside Vietnam), the team should specifically assign a small group specializing in communication and promotion of the program, to gradually Build a brand that only Meet Proposer owns. It's also a way to help Meet Proposer reach out internationally. In summary, I strongly agree with the feasibility of the proposal, I only provide positive comments for the team to refer to. I vote 5 stars.", "q1r": 5, "q2": "I'm pleased to see the proposal's roadmap and milestones elaborated. It affirms the transparency and auditability of the proposal. Throughout the proposal, the problem was presented sharply with a clear and understandable description, and the solution was applied quite astutely. This speaks to the very good expertise of the team. Your review of the metrics shown in each program is great for the community to rely on for audits and increases the transparency of the proposal (number of registered proponents, number of New PAs, number of review questions, number of high-value advisors voted by Proposer) - these numbers are as important as KPIs. Through this, the community trusts more and more in the team and the team's suggestions. The fact that you define project success through valuable advice from PAs, voter feedback, and dReps demonstrates the keen attention to detail that the Meet Proposer program showcases. After all, I strongly agree with the auditability of the proposal. Good luck to the team with this proposal. I vote 5 stars.", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 10, "ne": 3, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5948, "q0": "The proposal is very well-defined between the gap between Catalyst idea Proposers and the Cardano community. The proposal stemmed from a deep understanding of the constraints of the Catalyst stages, and a short period for Proposal Advisor and Voter with a wide selection of proposers/ideas (normally more than 1100+ valid ideas at access stage per recent funds 8 & fund 9 and the number just keeps increasing.) The solution is very well structured in terms of the format of the Meet (before/during/after) with clear roles of the stakeholders involved (from organizers, and proposers to attendants and Voters.) Although the proposal is not very technical, it is definitely aligned with the Challenge Setting of the Developer Ecosystem. The end product is the recordings for the total community to rewatch everywhere around the globe, albeit in different time zones. The participants are very well-identified and clear benefits for each of them ranging from the PA, Proposers, and Voters. The only risk mentioned is the poor internet connection and mitigating actions. What could have been done better is the other risks that might expose: #1. The risk of not having sufficient participants to join the scheduled session. #2. The risk for the proposers to expose the ideas too early stage and they can get a copycat by other imposters in the submission stage. #3. The risk of language communication during the Meet especially with different countries and the ambition for the Global Meet. #4. And finally, the risk of overlapping timing and focus of Catalyst, as MeetProposer will happen from the Voting period of the current fund to the Finalize Proposals & Deadline of the next fund. Thus, during the Voting period, there is of course confusion for Voters about this fund and the upcoming fund of MeetProposer.", "q0r": 5, "q1": "The team shows a long history of engagement with Catalyst since Fund 6 and is very experienced with the Vietnam and Eastern Asian community. The detail team member is led by a PA from Fund4 and vPA from fund 6 and a Cardano Catalyst TV host (who got funded from Fund 7) that has proven their capability. As the session mostly happened in Q&A conversation with a host, the Native Host role is super important. It is suggested that the team should also mention the Global Host role profile as it is one of the risks also mentioned above in Impact. \nThe milestones are broken down based on the timing of the Catalyst Fund 10 & Fund 11 roadmap. It is really impressive that the team has the track record of Fund 9 MeetProposer with more than 10 Proposers attending. There is an overlap between Native Meet and Global Meet which would be greater if the proposer can show a separate calendar view for the voters, and proposers to see more clearly. The budget is broken down into each task of the proposer. It is recommended that the budget for Core PA and Community feedback mechanism. The PA had a look at the reward mechanisms and it was a blank sheet at the moment. Digital marketing is also shared but it would be greater if the how is elaborated clearer. And as per the mention of the Global Host, the cost for a qualified candidate should be included.", "q1r": 5, "q2": "Regarding the auditability, what makes the first impression is the clear KPI/OKR indicators defined by the team from PRE: Number of Proposers registered to present at MeetProposer DURING: Number of new PAs participating in Meet sessions/ Number of valuable critical questions from PAs and Communities/and Number of high value advisors voted by Proposer.\nWhat could be improved is the POST meeting feedback and also the tracking of the funded proposers (who joined the MeetProposer sessions.)\nThere is a problem with the top relevant link  http://meetproposer.ivote.space/ of this proposal thus making it hard to be tracked. The PA guess that the link will go live after this proposal got funded. However, the team compensates for this with proven records of the 10 Meet Proposer playlist in Fund 9. The success picture is really brightened up as the name of the proposal itself for the multi-audiences including Proposers/ PAs and d-Reps and also Voters at the Voting stage. This proposal is brand new, however, the team already got funded many proposals and there is a series of Cardano Catalyst TV proposals that also complement this proposal. This proposal is also not related to SDG at all as per the new nice-to-have focus for purpose-driven ideas from Catalyst.", "q2r": 4, "assessor": "z_assessor_2759", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8083, "q0": "The fact that more and more ideas are proposed is good news for the Cardano community as well as for the blockchain industry. However, not all proposers know how to present their ideas clearly, even though their ideas are very good. In the proposal that mentions \"Native Meet\" and \"Global Meet\", I think this is a very good idea because it will support communities in which English is a minority (Native Meet) or for those who like to learn more about experiences in the world (Global Meet). Therefore, having places or forums for them to exchange information, provide knowledge or experience to have good suggestions is very necessary. So I think the proposal is very practical.", "q0r": 5, "q1": "I have seen videos of these meetings before, so the feasibility of the proposal is very high. In addition to meeting periodically, they also have discussion groups, videos of meetings are posted on youtube, community interaction or Proposer in \"After the Meet\" will be a great support for someones who cannot attend the meeting. In the proposal, \"Global Meet\" is mentioned, but how to organize it, they are still not detailed, so I am a bit confused in this matter even though the idea is very good. In addition, there is still no mention of whether or not face-to-face (directly) meetings are included in this idea, although it is not a minus point for the proposal, but it reduces the feasibility because there are places where the community still prefers to meet face-to-face rather than online.", "q1r": 5, "q2": "The proposal team consists of members who have experience working on previous projects, so they have experience in setting clear project milestones for the community to check. The detailing of the budget allocation further enhances the transparency of the project. The community can audit the project based on the parameters of \"Number of Proposers registered...\" or \"Number of new PAs...\", etc. or the number of videos they put on Youtube.", "q2r": 5, "assessor": "z_assessor_2945", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8752, "q0": "You covered the current problem of several developers in the introduction. Personally, I find Meet Proposers to be a practical project that helps developers better build and promote their ideas. The purpose of the program has been introduced in the solution description. At the same time, you also introduce the participants and the workflow of the project. During the presentation of the information, you provided examples that were easy to understand. It's great that you run a pilot phase to meet 12 proposers 3 months ago. There's no denying the benefits this program will bring to proposers, PAs, developers, and Cardano. All information about these values ​​is mentioned in the proposal. In addition, do you consider a risk that the project may face, which is losing connection during the meeting due to poor connection quality or power failure of the host. The solution to this risk has been outlined. In my opinion, this IMPACT section is complete. It provides enough information, presents clearly and shows that this is a potential project.", "q0r": 5, "q1": "Your plan outlines the expected start and end times of the project. Activities in each phase are also mentioned. Your team members are experienced in previous Funds. This will be a solid foundation for the project during development. The amount you request for funding is analyzed in a detailed budget breakdown. What work will be implemented for how long and how much it will cost are listed clearly and transparently. For me, this is a reasonable and convincing budget breakdown. Finally, your project members and teams have been introduced. I love how you divide the work in your team. Each core member and team will assume a different mission. In general, I appreciate the feasibility of this project.", "q1r": 5, "q2": "Your audit presents four metrics for each Meet. The purpose of each measure is also explained in detail. With these metrics, I believe the project can audit progress. It would be better if you made your progress public on a platform for the community to follow. Regarding the success of the project, can you describe what the project will bring to Catalyst developers and PAs. However, I personally find it still quite generic. If possible, you can provide additional KPIs for the entire project. The presentation lacks concrete numbers to prove the credibility of the project. If you add them, this success will be more convincing.", "q2r": 4, "assessor": "z_assessor_2997", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9593, "q0": "\"The problem is that many Vietnamese developers' proposals do not have high PA scores and are not Funded. Because although the proposal has a good idea, it is not good at implementing it and promoting it to the community.\nThe proposal solves the challenge. The proposal to solve the problem is to Help attract developers to participate in the ecosystem. Motivate the participants to study and ponder the material.\nThe scope of the proposal is worldwide. English and Vietnamese speakers. The proposal is aimed at developers whose projects are submitted to Catalyst and PAs and vPAs.\nThe proposal meets the challenge with a good solution. I give 5 points.\"", "q0r": 5, "q1": "\"The implementation schedule is presented in detail, with specific timelines and tasks. MeetProposer will run from the Voting Period of the current fund to the Proposal Finalization Term and the Term of the next fund. Weekly timelines. Starting on 8/8/2022. Each timeline has specific tasks with a reasonable volume.\nTeam of 3 people and Core PA team. Prominent in the team is Duc TIGER, who is well known in the Vietnamese Cardano community. Extensive experience in the evaluation as well as proposal writing. Support the community to write proposals and support PAs and vPAs with quality assessments. The group has assigned tasks to members who are very suitable for skills and experience. Meetings are being held weekly, and I attend some meetings. The team performed their roles well, and the meetings went smoothly. If it is not funded, the team will still maintain and develop this proposal. I appreciate the team.\nI chatted with the Proposal thread. Currently, the project has no source of income. If not funded, it will cost developers if they want to present their proposal to the community as a maintenance fee for meetings.\n The proposal presents a unique risk of losing connection during the meeting. The solution given is to have a Co-host. Good solution to the risk. However, another big risk is that the number of participants is not much, and the quality of the participants is not high. This led to the meeting being ineffective and not helping much for the developer. I see they have a solution for this risk. Having rewards for good feedback and advice from the community, Helps attract people with knowledge and expertise to participate.\n The project was live three months ago, and 12 proponents presented the project to the community. All presentations are uploaded to the project's youtube page. Anyone can verify. These presentations have achieved certain successes. Show that the project has the potential to succeed.\nEvery aspect is perfectly presented. I give 5 points.\"", "q1r": 5, "q2": "\"Metrics are clearly stated, clearly explaining the meaning of the indicator. However, the proposal only provides the project's youtube page, which has some limitations for tracking project performance parameters. It would be better if there were a website to post information about the activity and increase interaction with the community.\nThe proponent has had several proposals to be funded but not related to this proposal.\nAlthough the proposal has some unclear measurement elements, the overall presentation of the project is obvious and detailed. I appreciate the suggestion. I give 5 points.\"", "q2r": 5, "assessor": "z_assessor_3067", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9728, "q0": "There are many great ideas to develop the ecosystem, but no capital, do not know how to raise capital to develop, \"MeetProposer-Bright Up Dev's Ideas\" was born to help projects know how to raise capital, develop grow strong. due to stronger development, thereby helping the ADA ecosystem to grow stronger. This is a project to develop projects in the Cardano ecosystem, so it is completely suitable for Challenge. The scale of influence of this project is very large because it can affect many projects, thereby greatly affecting the community. The project will connect developers with the community and experts, thereby receiving community questions, and feedback and advice from experts. The developers will then finalize their projects.\nThe solution given is clear and specific. A series of meetups are organized, helping to connect proponents and the community. The schedule of the meeting was carefully planned and detailed. There are specific conditions for projects, there is a professional roadmap when planning and working before, during and after the meeting. Meetings are also important to project reviewers, helping them better understand the project and the quality of the reviews.\nThe author has foreseen the risks that may be encountered, from which there are suitable solutions. Currently, technology has also developed, many channels help connect communities and projects, so there are more options to prevent unexpected incidents.", "q0r": 5, "q1": "The team defined clear and logical timelines. The goal is to help the proposals present their best so that they can be funded for implementation. The timeline is entirely dependent on Catalyst's timetable for each fund. MeetProposer will run from the time of voting of the current fund to the proposed completion date of the next fund.\nThe proposal provided a detailed budget analysis, reasonable justifications and clearly explained costs. The amount required for development is $49.892 or 5% of the quarter total, in line with the Challenge's Budget.\nThe team is experienced in the industry, is a Cardano blockchain technology researcher for many years and he is the founder of many projects. Mr. Duc TIGER also has a very good community experience, has his own community, with a lot of followers. Mie Tran is also one of the people who appear in many shows about the Cardano Ecosystem, in various roles. They are the people who are supporting the Cardano community very well. Participate in many projects, proving that they have a lot of good ideas to develop the community. We can easily check the information of the founders through the information provided. They have the right project development experience, with a clear assignment of tasks.", "q1r": 5, "q2": "The team gave clear specific metrics: Number of people who signed up to support the project proposal, Number of people who could attend the meeting, number of objections, and number of high-value advisors. We can easily measure, collect and test data. The project needs to summarize and report the indicators after each meeting, and post them to the community for monitoring.\nThe success of the project has been determined. Catalyst developers receive valuable advice that helps them improve and increase their chances of being approved. A better understanding of the project by the review community will help them make quality assessments.\nThis is a new proposal for the MeetProposer project.", "q2r": 4, "assessor": "z_assessor_3087", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10106, "q0": "This is a great proposal that I read at Fund 9. The proposal will solve the current problem that there are many developers with very good ideas, but it is difficult to build and promote, or there are shortcomings in the idea due to lack of experience. They did not receive high ratings and were not sponsored. In contrast, the PAs, when evaluating their proposals, could not understand well but could not ask due to time constraints, causing them to give up their evaluation or give low scores. This inadvertently causes us to lose some good ideas.\nThe proposal addresses the goal in this Fund9 : Improve the tool to support the human process in Catalyst, and it also meets the requirements of this Fund 9 challenge, the Developer Ecosystem. If this proposal is funded, I firmly believe that it will bring added value as well as have a positive impact on Cardano and Catatlyst as it will encourage developers with many viable projects to contribute to Cardano, and will create a team of core, experienced PAs along with a large number of visitors on social sites.\nThe KPIs satisfy the elements of this challenge (Increase number of developers actively building on top of Cardano), by periodically giving meetings with project owners, they will thoroughly explain their project and the PA, vPA have the opportunity to give questions and suggestions to help project owners better complete the project. I believe this is a great proposition and can solve future challenges", "q0r": 5, "q1": "The proponent gave a very clear list of project participants. Among them is Mr. Duc Tiger - Project Manager, an excellent member with many years of experience in Cardano blockchain technology and Catalyst ecosystem, is PA, vPA and Submitor in many Funds and has many funded proposals. Next is Ms. Mia Tran who also has many years of experience in special translation and interpretation in Cardano Catalyst, the third member, Ms. Quynh Anh, also has experience in PA from Fund 7 and envolves in some proposals sponsored. There is also an excellent team of PAs and a team of Tiger Media, all of whom have clear, well-informed information, proven experience from previous Funds shows that they can completely run the project to success. I have also participated in several meetings with proposer via Zoom, the advisory team is very active, giving many reasonable advices to the proposer, the translation team is also very dynamic and easy to understand.\nThe budget of the project is expected to be 49,892 USD divided into 10 categories which are very clear, specific and transparent and with the experience from a similar proposal in the previous Fund, I believe this budget is reasonable to be able to achieve set goals. However, I find the ADA slippage provision unnecessary because all proposals need this provision, which will cause a loss of confidence in the ADA coin.\nRegarding the project implementation plan, there are some bad points, but fortunately the proponent corrected it in the comment section, I have read it and found this plan to be very clear and reasonable along with the targets/tasks in 6 phases, thereby showing that the proponent has planned very carefully and seriously for this project. The proponent also anticipated the risks and proposed reasonable mitigation solutions.", "q1r": 5, "q2": "The proponent has presented a specific roadmap with clear KPIs, specifically, in the period from August 2022 to April 2023, he will meet all 50 project owners (36 Vietnamese proponents) and 14 global proponents), project success can be defined by specific metrics. The community can easily track project progress with videos of meeting with project owners posted publicly on Youtube to ensure transparency.\nHowever, I also have the following suggestions that I hope the proponent considers:\n1. ​The file​ \"Reward mechanism\" I opened does not have any information in it, maybe due to some error the proponent needs to consider carefully\n2. The list of meeting 12 project owners from the previous Fund is already on youtube, but I think we should have a file that summarizes the link of the proposals, the meeting time, there must be a satisfaction rating /comment of the project owner to show the effectiveness of the meeting as well as whether the meeting can solve the above problem or not\n3. Should the number of proposals be reconsidered because we are focusing a lot on Vietnamese proposals (72%), I think it is more reasonable to leave 50% to create opportunities for international developers to participate.", "q2r": 4, "assessor": "z_assessor_3153", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10447, "q0": "The proposal has had a fairly successful pilot phase with 12 projects. I think the idea of the suggestion is useful. Because there are a lot of good suggestions but they don't write them down clearly, making the readers that the PAs don't fully understand their ideas, so they don't give it a good score. With this proposal, project owners can present to everyone a better understanding of their ideas, through which people can directly comment with project owners so that they can complete their proposals well. than. This proposal will promote the development of catalyst, making the mechanism of catalyst more complete. The proposal also contributes to giving Cardano even more quality projects.\n", "q0r": 5, "q1": "This proposal provided a concrete plan with several phases. They also provide cost tables for specific jobs. I find that these costs are appropriate for the activities to be performed. The project team is people with knowledge of the Cardano blockchain. They also have CA and vCA experience from many Fun before. On the other hand, they are also the founding members and managers of the Cardano learning communities. Therefore, they have the advantage to attract the community and create confidence for the community to participate in the project.\n", "q1r": 5, "q2": "The cost of the project is calculated in detail by work, not by phase. The KPIs are given specifically and are easily checked such as the Number of participants presenting proposals, number of PAs participating in the meeting, number of questions asked... They also launched a youtube channel. 12 projects have been tested.\n", "q2r": 5, "assessor": "z_assessor_3186", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}], "solution": "Host a series of \"Meet Proposers\" for developers to present their ideas to the community and get critical questions and advisements from experts around the world before the Finalize stage expires.", "experience": "We are Funded Proposers, Proposer Assessors, Master of Ceremonies, English translator, Community manager."}