{"id": 420355, "author": "samjeff", "title": "Cardapper - YouTube C-Dev Channel", "url": "https://cardano.ideascale.com/a/dtd/420355-48088", "category": 26597, "amount": 9900, "description": "No YouTube channel to consistently post Cardano Development Tutorials that new developers can watch and learn for free. ", "f6_no_assessments": 11, "f6_rating": 3.606060606060606, "videos": [], "media": [], "f6_assessments": [{"id": 1698, "q0": "The proposal in theory is good, but in practice there is a lot of detail about what would be done, so that we could consider a project with a safe positive impact. According to the proponents, there is no youtube channel that works to post content aimed at developers to learn better about Cardano's technologies - with that, the idea is precisely to create a youtube channel that publishes Cardano development tutorials with a good frequency; it is also said that these videos would be created in a simple language accessible to everyone. In theory this serves very well what the challenge seeks, as is very clear in the excerpt: “Challenge KPIs include easing the learning curve for new cardano developers, and this proposal aims to do just that. Cardapper discord server, telegram and twitter will be posted with all updates. The comments, conversations and feedback from aspiring cardano developers on youtube and in the communication spaces will help in communicating the project results.” However, in practice some situations should be better exposed. The main issue that should have been clarified is the exact content that will be addressed, that is, what will be said in each of the videos, what knowledge will be addressed. It would be essential to have a notion of the curriculum that would be work here, let's say. It would also be important for proponents to explain in what way they intend to create easier and more accessible content than what is already available so far on youtube on this subject. For these reasons, my opinion on the impact is neutral, because while the idea is good, it is not adequately explained and developed.", "q0r": 3, "q1": "More or less, because this topic leaves something to be desired in several ways. The information given here is very basic, not allowing a good understanding of how the project would be put into practice. Speaking first of the script, we don't have enough information passed, it's not possible to understand what the pre-production process of the videos would be like. We know there would be the search, script, and edit steps. How would each of them be developed? How would the subjects to be taught be selected, how would proponents plan to write a script for each video, what would the editing style be like? How will the 20 hours of work that would be needed to create each video be divided for each part? All these processes would need to be explained in detail. Talking about the costs, the asking value for the project is not lacking compared to other Catalyst proposals. I believe that this is the part that is best in terms of feasibility, as the total amount is divided between the price for the production of each video ($800) and also for the purchase of materials: “Quality microphone - US$ 100 + 1 TB - $150 + Studio Decor - $50”. So speaking about the proponents, finally, I believe that they are qualified people, because they have a lot of understanding of Cardano's technologies and have already posted some videos that serve as a demonstration for the content they intend to create, but I still think they could have invested in more detailed CVs and they should also have attached their linkedin profiles, so that we could get to know them more in depth.", "q1r": 3, "q2": "Unfortunately, this is the topic that leaves much to be desired in the entire proposal, there is very little information passed, both on the auditability of progress and success. For progress, monitoring would be done based on the analysis of “steady good growth in developer viewership on youtube, consistent quality video posts every week, and positive feedback from developers”. But how could we audit the pre-production process of the videos, the making of the scripts, the recording, the editing? We would need to know if the 20 hours of work combined for each video were fulfilled and also if they were done properly, I would like the proponents to provide us with ways to understand these processes that would be behind the scenes of each video made available. It would also be necessary for us to have an understanding of how the videos would be disseminated - how they would reach developers interested in working with the Cardano ecosystem. As for success, unfortunately defining it as just “happy developers and they find it useful to ease the learning curve” is pretty abstract. How can we verify if the videos were being put to good use, that is, if the students and professionals who watched them understood the past knowledge and put it into practice? In my view, a direct survey with the audience that watched the videos would be necessary, and the results should be shared with our community, so that we could understand if the learning curve was really enhanced through this new channel of the youtube.", "q2r": 1, "assessor": "z_assessor_2259", "no_vca": 12, "ne": 7, "ng": 4, "nfo": 1, "vca_o": 2}, {"id": 1950, "q0": "Providing video tutorials about development on YouTube is a great way to reach out to developers and aspiring developers. If the videos would gain traction by the algorithm, it could on-board lots of new developers as well as bring more attention to the Cardano Ecosystem. \nThis proposal suits the “Developer Ecosystem” challenge setting somewhat well since it could (1) Increase developer productivity and (2) Broaden the knowledge base, (3) Attract new developers from outside our community when they stumble upon the videos.\n\nHowever, it is hard to make great educational development videos and from the proposal and the videos provided it is hard to tell what the course of direction is for the videos. It is stated that they will help developers by making tutorials. \nQuestions I would like to have answered is: In what format will the tutorials be? Will they be courses, projects, small videos where you show a piece of code? What level of knowledge do you expect your crowd to have? What is your main target audience? Beginners, developers unfamiliar with cardano, experts, Plutus participants?\n\nObjectively speaking, the provided video material displays interesting topics but it could be argued that they are not educational in their current format. Is the plan to keep the same format and educational style in the videos if you are funded? Have you in any way researched if this type of teaching is requested by developers/the community? If that's the case, it should be included to increase the credibility of the proposal. If not, you could do a case study and adjust your content according to your findings.\n\nThe intents and purpose of the proposal are great but the questions raised above bring the proposal score to a neutral standing. 3 points are given in terms of impact.", "q0r": 3, "q1": "The proposers have experience with Plutus Pioneer program, Gimbalabs Plutus PBL and other general dev and blockchain technology. In order to increase the credibility, some more links that can back up these claims would be favorable. It could be LinkedIn profiles and/or github profiles.\nThe detailed plan (and included milestones of 1 vid week á 12) is sparse but sufficient given the scope. The hourly rate is included in the budget which proves that the budget is fair for the required work. \nIt is for sure feasible to provide 12 videos in 12 weeks but a more important question remains about quality. Since there is no indication or target level in terms of quality it is not possible to be confident in giving a high feasibility score. A suggestion is to clearly outline the level of expected quality in order to assess the feasibility of the videos. At the moment they are estimated to consume 20 hours each, but what can the community expect from these 20 hours? What is your definition of quality videos?\nIt is hard to judge the feasibility when these details are lacking in the proposal and a neutral score of 3 points will be given.", "q1r": 3, "q2": "In terms of auditability, the nature of videos are very easy to audit. Video gets published, and the proposer has delivered for that week. \nThe areas to improve upon in the proposal are the KPIs and definition of success. The current definition of success states “Happy developers and them finding this helpful in easing the learning curve.”. This is not measurable, unless you perform surveys, but there is no plan provided for that. A suggestion would be to define your success together with KPIs that are identifiable and measurable. A few examples could be: 12 videos produced, 1 video per week produced on time, 100 views per video after 1 month, 1000 views per video after 11 months etc.\nThis proposal is easy to audit, but also very hard to measure the success since no measurable KPIs are provided. This should be included to raise the score.\nThe score in terms of auditability will be 3 points as a result.", "q2r": 3, "assessor": "z_assessor_2290", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3903, "q0": "The problem being no YouTube channel posting Cardano Development Tutorials to watch and learn for free. The proposer wants to create youtube videos that would post cardano development tutorials regularly and would help become Cardano developer. This will help added new developers to the ecosystem and will be very helpful for the growth of cardano ecosystem. The proposal can be scaled to add tutorials of other cardano related topics as well. Therefore this proposal addresses the problem", "q0r": 5, "q1": "Based on the details given and watching their previous YouTube videos the proposer have to required skill and experience to execute the proposal. The proposer will be releasing a video every week and have provided the explanation regarding the same. The proposer has considered all the required resources needed for the proposal. They have given a timeline which would be helpful. The fund requested of 9900 seems reasonable for the work. There isn't much risk involved in the proposal other than the videos getting delayed. Hence it is likely the proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has provided a clear plan and timeline that is 1 video per week for the next 12 weeks. This would be enough to track the progress of the proposal. The success of the proposal can be measured by the growth of viewers and subscribers. This will act as an indicator to know whether the videos are effective or no. The success of the proposal will be young developers able to learn about Cardano and becoming a part of Cardano community.  Hence with these observation it can be said that the information given should be sufficient to track the progress and the success of the proposal", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 4574, "q0": "This proposal's impact statement is short, but to the point. It addresses a persistent pain point within the Cardano ecosystem: a lack of convenient, up-to-date educational programming tutorials for self-guided learners. The solution is, quite simply, to create them.\n\nOne potential risk factor not mentioned could be keeping the videos current after major hard forks like Vasil, but even slightly outdated materials could still be valuable. Otherwise, the proposal appears to adequate outline and address risk factors. ", "q0r": 5, "q1": "The proposers have already produced tutorial videos, so there's no reason to doubt that they can continue to do so. The proposal lays out some expenses related to improving production values, and editing processes, which is well in the interest of the project. \n\nSince the project does intend to create a stake pool to continue funding videos in the future, it wouldn't hurt to talk a bit about the strategy for attracting stakers beyond the obvious appeals to viewers. How big of a total stake would it take to maintain the project in perpetuity?", "q1r": 5, "q2": "Auditors should have an easy time keeping tracking of the weekly releases of the tutorial videos, and of assessing their general quality.\n\nIdeally, I'd like to see more concise KPIs offered. What happens if a particular video isn't getting a great response? How will developer feedback be quantified? How much time will be spent answering direct queries?  ", "q2r": 4, "assessor": "z_assessor_2564", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5277, "q0": "Cardapper- Youtube C-Dev Channel posts Cardano development tutorial consistently and help Cardano developers learn faster and more efficient. Since the challenge KPI is ease the learning curve for Cardano Developers, this Cardapper -Youtube C-Dev channel will make it easier for Cardano developers to get quick content and learn every week new development within Cardano. This will also attract developers from outside Cardano to give it a try learning coding in Cardano. Although the windows that show tutorial could be zoomed in more (video production issue), it is possible to follow along the course instructor explanation. Releasing the new content every week is also good as it is neither too frequent nor too slow. This cardapper -Youtube C-Dev channel proposal effectively addresses the challenge very well. ", "q0r": 5, "q1": "There will be 12 videos during these 3 months. The whole production should take around 20 hours per video. The hourly rate is reasonable at $40. Also the proposer is so thoughtful to include equipment costs in the budget breakdown. The instructors are knowledgeable. Sam has created tutorial like open source code examples for learning Cardano dApp and use to create a course for Uni Luxembourg. Another team member Bharath will create tutorial on haskell basics and advanced plutus code. Other than that upon 12 weeks, they will set up a stake pool and fund the channel through stake pool operation. They will return to Catalyst for future funding. The project is well thought out in term of funding. It is very likely that the proposal can be implemented successfully.", "q1r": 5, "q2": "The proposal success is to have happy developers who find it easy in learning to build in Cardano. The Cardapper team will post all updates on discord, telegram and twitter. They will use growth of subscribers on their youtube channel as the measure for the success. Alternatively the cardapper team could have measured the user engagement like retweet, replies, discord messages etc. to track the project progress and report back to the community in the form of bi-weekly meetings or report. The Cardapper -Youtube C-Dev Channel helps to ease the learning curve for developers both for developers within Cardano and attract developers outside Cardano. The information provided in the proposal is sufficient to audit the project progress and success. ", "q2r": 4, "assessor": "z_assessor_2684", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5496, "q0": "When compared to many other submissions for the challenge, this one is rather distinctive. While the majority of them concentrate on attracting new developers to the ecosystem and providing them with all the amenities they need, our suggestion ensures that aspiring developers have a reliable source to begin their blockchain journey so they are skilled at what they do. In turn, this boosts the ecosystem's overall productivity, adoption, and capabilities. The proposer has definitely read between the lines and has come up with a clever plan to include the developers in the chain. This idea clearly tackles this issue to some extent by ensuring that the proper assistance is provided to people who want to start off, which is why the majority of developers have given up owing to the lack of appropriate content to guide them. The proposal is all the more credible and effective for the readers since the proposer is aware of what needs to be done, is aware of the difficulties involved, and ensures that the community is aware of their strategy for overcoming those difficulties.", "q0r": 5, "q1": "The proposal's feasibility metrics are quite succinct and logical given the type of work involved. The proposal maintains it to a minimum by outlining the overall number of films they plan to create and the timeframe needed to create each one. The cost to produce each movie is approximately $800, and while the budget breakdown is very straightforward, it is difficult to determine whether it is justified until the community has access to one of the videos and can assess the content's value and clarity of the production. Nevertheless, the total funding isn't exaggerated, so one could assume that the team is not trying to rip off the community. However, there isn't much to comment on because there aren't any examples of the author's earlier work to get a general notion. The introduction of the author is really brief, as is the introduction of the Plutus developer who may have created the movies. Because of this, even though there isn't much to explain, the author could have done a better job in some areas of the section on feasibility.", "q1r": 4, "q2": "I feel the very same about the feasibility parameters and the quantifiable key measures. The proposal's proponent reiterates their statements regarding what they intend to do both during and after implementation. The success criteria are still to be explicitly defined, however, given the submission's enormous challenge and the work required in comparison to the other suggestions, it's difficult for me to see how the author or the community might demonstrate progress from an auditability standpoint. Given the novel strategy they suggest, I'm certain that the views are the only realistic measures available. A plan like this might give qualitative metrics more weight than quantitative metrics. Additionally, with regular videos, the consistency could be monitored, and the quality of the proposal could be evaluated with the rise in user interactions with the material. However, a much more sophisticated one that attempted to prove the worth of the proposal from multiple angles could have earned them full marks as opposed to a blunt success definition like the one the proposer provides (\"Happy developers and them finding this helpful in easing the learning curve.\").", "q2r": 4, "assessor": "z_assessor_2704", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6443, "q0": "There is a clear need for more developers on the Cardano blockchain. There are currently a lot of people that want to participate in dApp development, but they don't know where to start. There are lots of people around the world that turn to Youtube for education purposes. This helps lead to an effective proposal that will address the challenge of lack of education in development. The main question that needs to be asked is how will people find out about this Youtube channel? Growing a community is extremely important because trying to start an educational platform without a large community can be hard. The purpose of these proposals is to bring growth to the Cardano space. There is a need for more free education for developers. However, there has to be candidates searching for this type of content. For these reasons, I give this section 3 out of 5 stars.", "q0r": 4, "q1": "It is important to recognize that the proposer has included information about himself with the experience and skills. This helps the readers of the proposal to assess how likely this proposal will be successfully implemented if funded. There is a clear roadmap that describes what the proposer intends to accomplish. It is important to include a specific timeframe of completion. This helps the community to monitor the current progress in hopes that the proposer keeps them up to date. The budget breakdown is precise and shows where the requested funds would be allocated. This helps ensure that the funds will be utilized properly and will add utility to the Cardano ecosystem. The plan is presented properly. However, it may be difficult to gain a large following in such a small amount of time. There may be developers that want to learn more about these skills that will be taught in these videos. However, they may never come across it. There needs to be a form of marketing that really allows this idea come to fruition. For these reasons, I give this section 3 out of 5 stars for now.", "q1r": 3, "q2": "There is a lot of information included in this proposal. It has been written very well and has a great proposed idea. The problem is the uncertainty that there will be enough demand for this proposal to be executed properly and allow the Youtube channel to be of great use to developers. There are two principles that can help monitor the success. The first being accountability, and the second, openness and transparency. The proposer needs to be completely open with the community and allow for conversation to take place. Once there is a following or a community behind the project. The principle of accountability will help the project to flourish and, in this case, will lead to the success of the proposal. For these reasons, I give this section 3 out of 5 stars. I am still unsure about the potential success of the proposal. I would suggest including more information in regards to the community or people that will be interested in this proposal.", "q2r": 3, "assessor": "z_assessor_2817", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7127, "q0": "The proposal tries to tackle the lack of free, consistently updated Cardano development tutorials on Youtube. A quick search shows that the problem is indeed valid. As a software engineer myself, I can attest that tutorial videos on Youtube are one of the most accessed resources for new developers to start learning programming languages and tools. Based on what I read in the proposal, what the proposer means by Cardano development tutorials includes Haskell basics, advanced Plutus, and dApps development. This is a problem. The proposer plans on releasing 12 tutorials in total, but I would argue this amount is simply not enough to cover the aforementioned topics, at least not for new developers. There is also the problem of existing resources regarding Haskell and Plutus. Developers typically learn Haskell at learnyouahaskell.com, and there is a Plutus Pioneer Program playlist on the Input Output Youtube channel (https://www.youtube.com/watch?v=wqC8oiurqsI&list=PLnPTB0CuBOBypVDf1oGcsvnJGJg8h-LII). The proposer could mitigate this by making tutorials around Cardano dApps development only. It would solve the problems of not having enough videos and having redundant learning resources. That being said, the sustainability aspect has not yet been touched by the proposer. Remember, the proposal statement centered around the lack of consistently updated resources. Therefore, I fail to see how the three-month implementation would solve that problem since it lacks details on how to keep producing tutorials sustainably. It could be mitigated by relying on Adsense, putting the video on other Youtube programming tutorial channels such as Traversy Media to gain a wider reach, or simply asking for a longer-lasting runway by requesting more budget. Whichever alternative the proposer picks, it would help them to resolve the problem. As presented to us, I have to disagree with the effectiveness of the proposal.", "q0r": 2, "q1": "I have mixed feelings regarding the proposed implementation plan. The proposer does list their relevant experience, and we could see what each member is responsible for. However, there aren’t any links we could use in the proposal to verify their profile. I can only find one of the members on LinkedIn through their profile website from one of their Github repositories. The proposer should have provided these LinkedIn and Github links in the first place so we could determine if they are technically capable of making learning resources. The budget requested is broken down by their hourly rate multiplied by the number of hours they have to spend. Unfortunately, I can’t entirely support the budget breakdown because the details around the number of hours are vague (how many hours do they spend researching? How many hours for editing? It’s also hard to justify the 40 USD per hour as it is a senior software engineering rate and one of the members is still in high school (based on the profile website). That being said, I applaud the initiative to manage a stake pool after the end of the timeline, though the details around that are unclear too. The proposer has mitigated the risk of delivery delays, but the risk of developer-related concerns is not mentioned yet, such as what if the videos don’t gain any traction or what if they are dissatisfied with the quality. Overall, I am unclear whether or not the implementation could be carried out smoothly. I do want to remind the proposer of something. If this proposal were to be funded, please make the tutorials with a clear narrative as if you’re teaching them to a stranger. I’ve watched one of the provided videos, and to me it feels like they are only explaining what the code does, not guiding you on how to create it from scratch or improve it. This is essential for every beginner programming tutorial, and I hope the proposer could keep this in mind when producing the videos.", "q1r": 3, "q2": "I can’t entirely agree that the information is enough for auditing. I have to disagree with the currently provided metrics to determine the proposal’s success. The proposer stated that their target is to publish one video every week for the next three months and gain positive developer feedback. However, it is not clear how we measure the latter. There are a lot of metrics that could objectively quantify that. For example, the number of likes to views ratio, the number of comments, the number of average views per month, etc. As of now, the proposed KPIs around developer feedback are ambiguous. That being said, the one video per week based on the roadmap milestones does show that the channel is constantly updated. Since it's a Youtube channel, the community could keep track of the progress just by looking at their uploads, making sure they have uploaded a tutorial every week.", "q2r": 3, "assessor": "z_assessor_2878", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8704, "q0": "There are many proposals for funding to create video tutorials on learning about Cardano on Youtube, although the idea is the same, each proposal has its own resources and topics to build content differently, all of which contribute to reducing the learning curve and creating a great experience for developers. So, conceptually, this project is a perfect fit for Challenge's key metric, the important thing to evaluate its growth potential is to consider which topics will be chosen to build the channel and commitment to the positive impact it will bring to Cardano. The main topic of their Youtube channel will be tutorials on Haskell and Plutus, it is relevant and ideal. The quality of the content will not be a concern as the team has experience working with projects with similar content before. However, the promise of positive effects is still very vague, it is missing the predictions expressed in specific numbers.", "q0r": 4, "q1": "The project development plan clearly describes the number of working hours, the number of output products, and the working efficiency (1 video per week). It is basically easy to understand and easy to track development progress, but with the focus of the project on attracting viewers, I would like to see clearer descriptions of channel marketing and promotion plans. The budget is prorated by the hourly rate and the resources needed for building another Youtube channel. The direction of cash flow in this project is clearly described, which will be a very good basis for future audits. In the personnel description, the information about the members should go into more detail, besides introducing career positions, the proposer can provide more links about achievements and projects. have done before and proof of working capacity such as Linkedin, CV, Github, etc.", "q1r": 4, "q2": "As metioned earlier, this project is lacking a clear audit roadmap. The given KPIs are suitable for evaluation, but the lack of targets for KPIs and the timescales for measurement reduces the reference value of the information provided by the proponent. An effective audit roadmap will be built according to the structure of timelines (short-term, long-term, medium-term) - KPIs - targets for KPIs.", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 14501, "q0": "The issue is that there is no YouTube channel where new developers may watch and learn Cardano Development Tutorials for free. The proposer proposes resolving it through a YouTube channel that constantly posts Cardano development tutorials in order to assist users become Cardano developers faster and more efficiently. The suggestion will benefit the community as well as the Cardano ecosystem. This proposal addresses the issue effectively.", "q0r": 5, "q1": "The proposer has asked $9.9K in funding and has provided a detailed budget breakdown. Based on this breakdown, it is possible to estimate that the project will produce a total of 12 videos. These funds will be used to purchase the necessary equipment and time. As a result, the requested funding is sufficient to carry out the project. In terms of feasibility, one video every week is a decent place to start. It allows them to plan the content and properly edit the video. There are no potential risks or challenges. With the information provided for feasibility, it is quite likely that the project will be carried out effectively.", "q1r": 5, "q2": "The proposal is very easy to understand. 12 videos should be published, one every week, but the proposer has not offered any specifics about what will happen next, as well as a rough projection of how many people you expect to watch or how many viewers number will climb over the course of 12 weeks. by offering, this proposer will be able to apply for additional funds in a future round if the predicted metrics are achieved and make more videos. For audibility the details offered are adequate to evaluate the proposal's success and progress but metrics would have help a bit more", "q2r": 4, "assessor": "z_assessor_4060", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14665, "q0": "This idea is about creating a Youtube channel that posts Cardano development tutorials consistently to help people become Cardano devs faster and learn efficiently. As an education advocate, I do like this idea. If successfull, it would bring a huge traffic to the Cardano system. However, the way this idea is presented did not satisfy me. I think the proposer should presented the content such as what aspects would be tutored. The target audience and the impact on them should be included to strengthen the productivity of this project. There are two risks mention but the solution is so vague. Besides, I think there are more challenges that should be considered such as attracting people to this tutorial channel or lacking of topics. The team should discuss and have a more detailed plan for those. ", "q0r": 2, "q1": "The plan provided here is not clear. Other than planing for the  video production, there should be a plan for marketing and development of the channel. The budget is broken down into 4 parts. But I wonder whether having to pay for the studio rent or not. The team has two members with little detail. I expected to know about their background and previous experience. Because it is a tutorial project, we should have the basis to know if the content is qualified enough. And also, there is no information about editing progress. I think the team should hire a professional editor to carry out this part. ", "q1r": 1, "q2": "This part in the proposal is not good. The KIPs mentioned to measure the progress of this project is so vague. What we got here are confusing one like constant growth or good quality. The KIPs should be more clear and measurable. Those should be qualified in order to make it easier to keep track. For example, the number of subcribers, the number of thousand-view videos or the number of regular visitors. The success picuture seems ideal but hard to imagine. The author should include exact number for the KIP like reaching 50000 subcribers in three months or so on.", "q2r": 1, "assessor": "z_assessor_4079", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Youtube channel that posts Cardano development tutorials consistently to help people become Cardano devs faster and learn efficiently.", "experience": "As part of the Plutus Project-based Learning first cohort at Gimbalabs, team member Sam created tutorial videos as open-source code examples for learning Cardano DApp development, now used by Uni Luxembourg. Bharath to create tutorials on Haskell basics and advanced Plutus code. "}