{"id": 421103, "author": "marcosantos", "title": "Asset ScamList", "url": "https://cardano.ideascale.com/a/dtd/421103-48088", "category": 26597, "amount": 21000, "description": "Today, with more than 5,000,000 assets created on the cardano network, we also have a proliferation of copies, imitations that aim to deceive users.", "f6_no_assessments": 5, "f6_rating": 3.5333333333333337, "videos": [], "media": [], "f6_assessments": [{"id": 962, "q0": "The project intends to create a public database of tokens they identify as “scam, rugpulls”. While the intention of keeping the community safe from potential scammers is definitely laudable, I view the approach that the project chose to take as potentially problematic and as a slippery slope toward creating a bottleneck of placed trust into a centralised unelected entity. They are nominating themselves to be the arbiter of what is and isn't a “scam'' on our blockchain. What happened to decentralised and permissionless? What qualifies them to take on this role, simply the fact that they have the technical know-how to create the database can surely not be it.\n\nThey correctly compare their plan to the Cardano Token Registry, but fail to identify why they are not in the same position. There are two key attributes that would make the two databases very different from one another in practice. The Token Registry Is maintained by the Cardano Foundation, which by default as an organisation, has to have the best interests of Cardano at heart - it's simple - if Cardano fails, it fails. And second, the Cardano Foundation has the resources to maintain the database indefinitely, whereas the proposing team only commits to maintaining the database for the next 6 months. What happens when the 6 months are up if they are not successfully funded a second time? This is not even identified as a risk in the proposal, I might add.\n\nBut the proposers do have a point. The Token Registry is manual at the moment, and they are proposing a semi-automated solution. This will probably be needed as the number of native tokens on Cardano continues to increase. However, I don't view the creation of a separate database as the solution. In my opinion, it would be much better to collaborate directly with the Cardano Foundation and try to automate their process.\n\nThe risk of not having the database adopted by the developer community is correctly identified in the proposal however I find the plan to mitigate this risk inadequate.  Transparency alone is not enough for developers to become aware of your product and motivate them to adopt it.\n\nIn conclusion, my thoughts are that the implementation of this proposal would not actually be an aid to developers working on Cardano, it could actually serve as a point of confusion, especially if not adopted sufficiently, and because of this I don't think it meets the requirements of the Developer Ecosystem challenge.\n\nMy assessment of this proposal comes from my background as a project manager collaborating directly with Cardano developers since July 2021. I have engaged with Project Catalyst, in almost all roles, since February 2021 and my involvement with the Cardano development and NFT communities started more than a year ago.", "q0r": 2, "q1": "The implementation plan for the proposal does a pretty good job of presenting the overview of the steps that would be needed to deliver the token database, however, it's not very detailed and it's only a bullet point list. Having said that, the plan only covers the technical development and maintenance of the database, without considering its promotion and the work that will have to be done to ensure its adoption. So I view it as only half complete. Why should the Cardano community allocate funds from its treasury for the development of code that just sits unused in a GitHub repository?\n\nThe budget is pretty straightforward, covering the two main stages of development identified by the team, but again, it fails to allocate any resources to the work that would have to be done to ensure that the database is actually adopted by its intended audience.\n\nThe proposal unfortunately does not provide a clear description or short bios with credentials (preferably accompanied by links to professional profiles - LinkedIn), of the team members working on the project. It simply lists the roles needed to get the development done. All is not bad, however, as the team does provide a link to their current project built for the Cardano ecosystem, so we have some reference to previous work.\n\nFund 9 saw the introduction of two new questions related to the workload on other Catalyst proposals and workload management. The proposers have answered “yes” to the one about other Fund 9 proposals. However, after searching the profile of the main proposer, marcosantos, on the Catalyst community resource website Lido Nation, I’ve found that this is actually his first-ever submission to Catalyst. In addition to that he also doesn’t appear as a co-proposer on other proposals ( https://www.lidonation.com/en/project-catalyst/users/2145 ). So the new questions may have been misunderstood by the proposer or he may be referring to another member of the team. Either way, more information is not provided in the text of the Feasibility section as requested. But, because the questions are new to fund 9 I will not be subtracting any points from my score for this. However I do recommend that the proposers include them in future submissions.", "q1r": 3, "q2": "I have found the auditability section of this proposal to be very lacking, instead of presenting KPIs or trackable metrics the team simply repeats what the main steps of the project are and assures us that they will produce documents to “measure” them. \n\nHowever we are not told what those documents will be, what exactly it is that they will measure, and how and by whom will the measuring be done. These are all details that I strongly recommend the proposers give more thought to and include with their next submissions. Perhaps try to think about what it is they would like to see themselves from a proposal successfully funded by the community treasury. What reporting commitments would they like to see? And answer guided by that.", "q2r": 2, "assessor": "z_assessor_2169", "no_vca": 11, "ne": 5, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 1390, "q0": "Yes, this proposal effectively addresses the challenge by creating a common open source repository for developers and community members alike to identify potential and known scams across the ecosystem.\n\nThe team is correct in stating that with 5M assets on Cardano, we are beginning to see an influx of rip offs and copy cats, this is not only terrible for the developers who have been scammed but also for the broader ecosystem as people may be deterred from using Cardano due to the scams. By creating a repository of known and potential scams, the community could have peace of mind that their wallets and assets are free from scams.\n\nWhat I would have liked a bit more is an explanation of how their project fits in with their existing beerhouse.io platform. Looking at the site it appears only specific people (staking to a particular pool or purchasing the $PINT asset) are able to use it. Whether this would be expanded or a new platform created is unclear. What could also be more further developed as to how they foresee this project being adopted by those who it is designed for. ", "q0r": 4, "q1": "Unfortunately, given the experience and plan presented it is not clear whether this proposal will be implemented successfully. \n\nThe plan leaves much to be desired with only high level goals to be reached, but no indication of what is required to reach them or how much time the project will last for. I'd suggest providing additional details to this section so that voters and readers alike aren't required to guess what is necessary at each step. \n\nI think that the team also could provide a better explanation of the team members themselves. While it's good to know that you need one project leader and two developers, there should be some names to go with the roles, and then provide some sort of way to check that they are who they say they are. As written none of this is available and it is unclear who comprises the team and who will be doing what. \n\nGiven that these two major components are largely missing, I remain neutral on feasibility. ", "q1r": 3, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal.\n\nWhat allows me to select four stars rather than three in this section is the team's commitment to making the repository open source and public through github. The use of open source tools as the default provides the community with some confidence that they will be able to explore and engage the project as it develops. However, without this piece, the rest of the proposal is very unclear as to how it would be audited. \n\nAs written, all we know is that the team will track the four stages and measure the documents in a \"qualitative way\", but there is no explanation as to what they mean by qualitative in this sense. There are also no linkages between the what is listed in the indicators section and the success measures. While it is good to say that success is to have membership similar to the Cardano Token Registry there are no actual thresholds or indicators. Are you going to be replicating the indicators on Cardano Token Registry on your platform? Will you track # of views, assets listed, scams found...etc..? I would encourage the team to provide actual milestones, indicators, and deliverables so the community can get a better sense of how this project will be implemented and audited. \n\n", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4214, "q0": "The \"Asset ScamList\" proposal addresses the Developer Ecosystem challenge by creating a github repository containing all tokens identified as scams, rugpulls. They modify their cardano-db-sync to ignore these deceptive tokens using their developed 4 rulees (similar names, similar image and similar description and policyid). The idea is similar to cardano-token-registry and flag assets with 4 flags (no flag, ok, alert and scam). They will modify their bots to interact with this repository and alert for the tokens that need reviewing. The database option is perceived as a risk for this project but they will try to be transparent in creating and maintaining this data bank. The project will reduce scam tokens in the ecosystem and make Cardano the safe blockchain to transact and this will provide the support structure to developer ecosystem and hence, this proposal fits the Developer Ecosystem challenge very well.", "q0r": 5, "q1": "The team knows what they have to do to complete the project (documentation, creating repository, manual integration, adaptation of bots to interact with github repository and feedback report on the performance.) they have organized their projects into stages with the estimates of manpower, time and cost. However, the project has not mentioned the pay rate and number of working hours. Also it is unclear who will be working on the project. The name and linkedin profile of proposer team are missing. Total project duration is 6 months and the team has sufficient time to complete the project. The challenges and risks of the project have been mentioned earlier.  I am very confident that the beerhouse.io team will successfully complete the project but for future reference, they should try to provide more info to make this project highly feasible. ", "q1r": 4, "q2": "The project success in each stage will be measured with documents in a qualitative way. It is possible to extract the project measures of success and also for the KPIs from reading between lines.  The proposer has considered future path of this project as a membership similar to Cardano-token-registry as a trusted database that benefit the developer community. The beerhouse team indirectly implies that the community can track project progress on github. After they finish their development, they expect the community to embrace this repository and maintain it with no other needed further funding. The team understood the problem of more than 5 mil assets created on Cardano network with the growing number of copies aim to deceive user and has come up with the smart solution to warn people off. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5499, "q0": "The fraudulent activities across the chain have been increasing in terms of copies and imitations of assets to deceive users and there clearly is a dire need to get a solution for the same. The author proposes one such solution which will have a shared repository, that shall have a mapping of the asset and a flag indicating its authenticity. This database could be accessed by anyone to evaluate the validity of a particular asset. The author is also aware of the hesitation of the developer community towards a tool such as this and confirms to make the creation transparent so as to instill a sense of trust across the community. The author provides a gist of how the validation process will be conducted and against what criteria each of the assets will be evaluated. However, there is no mention of how the current proposal meets the challenge's expectations apart from providing a generic database similar to a token registry. I would deduct a point for the same considering that this challenge may not be the best fit for this proposal.", "q0r": 4, "q1": "The proposer team describes the relevant experience. However, I could not locate the relevant references that support that. There is no introduction of the team members who will be working on the proposal, only the roles are mentioned without any indication of the people who will be filling in those shoes. Also, the detailed plan is not detailed in any way, there are only mentions of the different phases of the project without any tentative timeline to assist the claims. The same goes for the budget breakdown too, the amount is a pretty huge one and apart from a vague division of funds, there is no compact evidence to show the justified utilization of the funds. Also, the author mentions that there is no need for further funds and the project has to be maintained by the community itself. He/she also mentions that there wouldn't be a need for further contributions, so how exactly the registry/ repository be made more effective as the complexity of assets increase in the future. Hence, there is a lot of loopholes in the plan that I personally feel needs to be filled before any funds can be allocated.", "q1r": 2, "q2": "There is no roadmap with milestones. There are no metrics or KPIs, nor is a description of the success of the project clearly articulated. The auditability metrics only provide the readers with the different stages of the project with no quantifiable indicators to measure the extent of completion or attainment of each of them. Mere documentation may or may not be sufficient for the auditors to do their job. The success of the project looks very weak and the author makes no efforts to provide the community with what one could expect at the end of the project. Being a new proposal, there must have been more information than what is available now to make voters build a sense of trust and credibility in the proposal. The idea is unique and one of a kind, the author may go back to the drawing board and come back in the next rounds with much more evidence of ground work and definitive action plan. ", "q2r": 2, "assessor": "z_assessor_2704", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 6451, "q0": "Creating extra security for the Cardano ecosystem is very important right now. Cardano has so many different projects building on Cardano and there is a lot going on. This leaves room for malicious developers to try and scam users into fake versions of tokens. The team at Beerhouse plans to create an \"Asset ScamList\" on their website. It will be able to identify which tokens are real, and which ones are fake. You will be able to connect your wallet and it will inform you if your tokens are okay, or if they are scams. This can help all users in the Cardano ecosystem to verify if their tokens are real or not. You will also be able to verify policy ID before purchasing a certain asset. I believe that this proposal could have a large impact on all users on the blockchain. Hopefully it will have a global impact and allow all users to put security first. For these reasons, I give this section of the proposal 4 out of 5 stars.", "q0r": 5, "q1": "The experience given in this proposal is 1 project leader and 2 developers. It could be important to include specific information on people working on the project. This will allow for the community to hold the team accountable for the completion of this proposal. Currently, it would be difficult for this to take place. The roadmap includes all of the details they plan to implement into their project. These plans will allow the team to create a successful \"Asset scamlist\" to protect early Cardano users. There should be specific dates within this section. However, it is present in the next section under the detailed budget breakdown. This includes the specific details on where the requested funds would be allocated if they receive funding. I noticed that the team has a conservative approach to their funding process because the team is not asking for a whole lot. Especially given that they plan on utilizing the requested funds for 9 months. These indicators help readers of this proposal to determine how likely the team will implement their asset scamlist. It is a great idea that can bring a lot of value to the community. There needs to be more information on specific dates and verification of the team working on this project. For these reasons, I give this section 3 out of 5 stars until this information is included.", "q1r": 4, "q2": "This proposal includes a lot of information. It gives details on how the team plans to creat their asset scamlist and how that will benefit many users in the Cardano community. However, the proposal lacks specific information in the roadmap section. It isn't a big deal because that information is given later in the budget breakdown. But I would suggest putting that information into the specific roadmap and timeline section. This will make it easier for readers. There should also be more information on the identity of the team members. It can be hard for a proposal to be funded if people don't trust that the team will utilize the requested funds properly. This should be an easy task if the team isn't worried about not completing the proposal. Once this information is included, it will make it easier to audit the success of this proposal. The idea of transparency coming from a team is really important. This will allow for the community to know that that the team is dedicated to this proposal and is going to keep them updated throughout the entire process. This will allow the community members to hold the team accountable and will be more likely to successfully implement their Asset Scamlist. It is a project that a lot of community members would love to utilize in their trading to help ensure that they are being safe with their investments. For these reasons, I give this section of the proposal 4 out of 5 stars. When that information is included, these ratings can be considered.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "A github repository containing all tokens identified as scam, rugpulls.\nA program with set of rules that automatically categorize potential spam and add into repository. A manual revalidation process", "experience": "Team with more than 20 years in programming with experience in java, databases, golang, . With 6 months working with the ecosystem, developing the beerhouse.io platform and StakePool PINT."}