{"id": 421223, "author": "sirwolcott", "title": "Catalyst HeartBeat", "url": "https://cardano.ideascale.com/a/dtd/421223-48088", "category": 26597, "amount": 9115, "description": "Long form content requires too much time and energy to digest for Catalyst Contributors. Keeping up is NOT an option. Collaboration, Self-Marketing & Reach are of top priority to Proposing Projects.", "f6_no_assessments": 10, "f6_rating": 4.433333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 726, "q0": "Yes, the proposers identify a lack of short and snappy content to digest for Catalyst contributors and that Catalyst long form is not for everyone. The proposers articulate that a platform for pitching catalyst proposals in a short format would attract new developers to show how the developers can get what they want from the Cardano ecosystem. I think the benefit of this proposal is largely that dev who build products want a quick way to communicate with their potential users and create a sense of community by being given an platform to defend their ideas. I think the proposal addresses the challenge, but the proposers should make a tighter argument for that in their proposal. The proposers plan to return for additional funding in future rounds if HeartBeat becomes valued by the community. The short nature of the presentations: 1min pitch and 2min questions make it scalable by replicating this into multiple rooms running in parallel, similar to how Ideafest works. I have pitched at Ideafest in the past and found the experience very rewarding. I think the alignment to the challenge goals needs to be tightened in the proposal text; however, it addresses the challenge setting of creating a sense of community for developers and encourages developers to pith proposals knowing that they will get a chance to present them.", "q0r": 4, "q1": "Yes, the prosper are known members of the Carano community, and LinkedIn profiles are provided for each. The proposal is not technical; the proposers will not build new software; they will instead use an existing solution called Leancoffeetable.com to organize and keep track of time. The recordings will be uploaded to youtube for others to view afterward, with background information on each presentation. The proposers should check their math in the budget section. There seems to be some inconsistency in the budget numbers. In a video attached to this proposal, one of the proposers mentions a budget number that is roughly $2k smaller than what is written in the budget section. The math in the budget does not sum up to the total for organizing the event. Not a dramatic mistake, but would call out the attention to detail. The $500 per session budget is quite reasonable and includes hosting and secretariat work to register participants and upload videos. The proposers included a youtube video in their proposal with a demo of how the HeartBeat would run and the schedule for each event. This video validates that they have tested the format and take preparation seriously. The main risk highlighted is how to select the proposers for each round in an equitable manner but not provide any mitigating actions. I would suggest that the mitigating action could be to do it on a first-come, first-served basis and then replan to have more or longer sessions in future rounds. I agree that the team would be able to deliver on the proposal, and they have tested the format, and the budget is set competitively. I would personally go to one of their events and present my proposal.", "q1r": 5, "q2": "Yes, anyone in the community can audit the deliverable by attending their Heartbeat events. The videos will be uploaded online, which can be verified. The KPI is the delivery of the sessions and the videos. Success is clearly articulated as having full sessions all the way through. The sessions will be public, and the videos will also be made public. Therefore, I think the proposal can be audited effectively.", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 963, "q0": "I can picture a scenario in which the speed dating social initiative described in this proposal could be effective. Having said that, the proposal itself has not managed to totally convince me it will work in the current Cardano and Catalyst environment, and that we would see enough engagement or participation for it to reach its potential, particularly as a tool intended for developers (it is in the Developer Ecosystem challenge after all).\n\nHowever, as I think this could bring something new to The Catalyst environment, and given the relatively low asking price to implement this project, it represents a relatively low-risk proposition for the Cardano treasury, so I agree that it's worth running the experiment and analysing the results after the initial HeartBeat episodes.\n\nI would have really liked to see more focus and more details in the proposal on how the organisers plan to promote the event itself, especially before the start of the podcast’s first season.\n\nThe proposal successfully identifies the challenge questions that it could address however it doesn't provide any info on how it would address them.\n\nA pertinent risk to the project is identified, however, no solutions to address this risk are given in the proposal. This would definitely help voters better assess the planning that has gone into this project and I would recommend that the team include this info with their next submissions.\n \nMy assessment of this Developer Ecosystem submission is based on my experience as a project manager working directly with Cardano developers since July 2021. I have been part of the Catalyst community since February 2021 and my engagement with the Cardano development communities started in March 2021.", "q0r": 4, "q1": "I really like the fact that the proposal describes in detail the plan for each episode.\nIt flows well and it's sufficiently detailed to be able to make out the fact that it could end up being engaging and informative if conducted well.\n\nThe budget breakdown is adequately detailed given the small scale of the project. \n\nThe team is composed of 3 dedicated and engaged Catalyst and Cardano community members, who already have connections within the community and could lean on these to attract interest and participation in their project.\n\nA set of 2 new questions related to team workload were introduced in Fund 9, one that refers to previously funded proposals and one that refers to proposals/projects submitted in Fund 9.\n\nThe proposal mentions the other proposals that the team has submitted in Fund 9 however not all of them have links and no description is present about how they would manage the workflow associated if all of the projects were funded, as requested by the new Fund 9 questions related to multiple Catalyst submissions or funded projects.\n\nThe proposers have also responded “Yes” to the question of the previously funded proposals. However, no details are provided in the main feasibility section as requested by the proposal submission form. I will not be subtracting from my score for this, as the questions are new Fund 9, but my recommendation is that the proposers include the requested details next time.", "q1r": 5, "q2": "The project deliverables and trackable metrics make sense in the context of what HeartBeat wants to achieve. Perhaps I would have preferred something more detailed but they are sufficient for the first iteration of the podcast project.\n\nThe KPIs of the project or actually presented as definitions of success in the proposal, so they are there, but under a slightly different name.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1391, "q0": "Yes, this proposal effectively addresses the challenge by hosting elevator pitch-style podcasts where ten (10) proposers are welcomed onto the show, provide a 1 minute brief about what they are working on and what they need to succeed, which is then followed by a couple minutes of public discussion. \n\nI like this proposal because it offers the Cardano community a new way to get information. The proposers clearly articulate that the information overload in the community makes it impossible to be aware of all the amazing projects going on, while also limit's proposers' abilities to reach out to the broader community to highlight their main issues. Listening to ten projects in ten minutes will certainly provide more exposure to these projects and also allow the broader community to engage with those projects that interest them. \n\nI am removing a mark here because the focus on developers appears somewhat tangential. Instead, the project is much broader and appears to focus on all projects across the community, that may or may not be developer related. To increase the score here I think the proposer could add in a small section about their desire to focus on builders specifically, or perhaps half the spots are earmarked specifically for developers? Something along these lines would certainly strengthen this section. ", "q0r": 4, "q1": "Yes, given the experience and plan presented, it is highly likely that this proposal will be implemented successfully. \n\nFirst off, I want to commend the team on continually resubmitting in subsequent funds even though they have not yet been successful. This is a true testament to their desire to get this project up and running. The team is also composed of some well known community members who fulfill numerous roles all across the ecosystem. Given this, there is a very high likelihood this would be implemented successfully. \n\nThe plan is well laid out and straightforward which makes it easy to know what the team hopes to achieve and how they plan to do it. The division of the podcast into the 1 minute stand ups followed by conversations initiated by the community, and then follow up actions by the participants. One thing I may have liked to see here is the broader vision in addition to the episodes themselves. For example, how will you do outreach and engage the proposers? How will follow up activities and connections be facilitated before and after the shows? While I don't feel these necessitate a reduction in score, their addition would make the proposal that much stronger. ", "q1r": 5, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. \n\nAs I've said elsewhere, any project that commits to being open source by default and using open source tooling such as gitbook/github should inspire confidence in  the broader community's ability to audit the proposal. \n\nAnother positive for auditing this project is that all of the recordings will be uploaded and made available for free for the community to listen to. This means that not only can the community audit the podcast itself, it may also lend itself to following up on the projects that presented, thereby assisting in indirect auditing of those projects. \n\nThe team also does an excellent job at listing tangible success measures so the community can see whether or not they actually delivered. If the proposers fill all 10 slots each episode, collect the resources from all presenters, and average 100 views per episode then the project will be deemed a success. This takes the guesswork out of it. \n\nCongrats on a great proposal and I wish you the best of luck in the voting stage. What do they say...? Third time's a charm :) ", "q2r": 5, "assessor": "z_assessor_2233", "no_vca": 11, "ne": 4, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5299, "q0": "This is a very interesting proposal for community exposure and improving the visibility of Catalyst projects worth funding. It may have been better placed in the Dapps, Products & Integrations challenge setting, where although not specifically targeted at Catalyst-internal proposals, the usefulness to boost integrations and create new projects would have been obvious. To compete with tooling, SDKs, APIs and edu-tech proposals specifically targeting the incentives and productivity of our devs makes this proposal slightly less impactful when you compare it to the entirety of the submissions in its relevant funding category. I have no doubt that short, accessible pitches by projects to the community, organized by this experienced team will have a positive impact for Cardano.\nThe three rounds of the show format are a great idea, and should be brought to more events like this. I do not necessarily agree that the format is particularly suitable to developers, and might give those who identify as community managers or entrepreneurs an edge.", "q0r": 3, "q1": "The three core team members have impressive profiles, and all of them provide their LinkedIn resumes with the proposal. Their backgrounds in social media, funded proposals, startups and as a stake pool operator bring together a lot of relevant skillsets for the proposed show. From the Youtube links provided and information about Dework and Swarm I get, this makes them highly suitable to make this project a success. The budget could have been broken down a little bit more to show how the funds are divided between the proposers and who is responsible for which part of the implementation, but taking into account the good milestones and strong team, I do not consider this a negative.\nThe existing artwork and presentation in the sample clips could be \"slicker\" but this is not a necessary requirement for project success, especially as this is proposed for the Developer Ecosystem where function probably beats form.\n", "q1r": 5, "q2": "The goals of this proposal do not seem very ambitious with only 100 views on average at the end of the entire project. Collecting links and feedback for each show participant is also not setting any particular bar for the quality of either the pitcher or the show itself. Given the excellent rapport that the proposers seem to have with the community, this should not be a big problem. The proposers will be using Gitbook for the documentation of this project, and this seems to be something they have done for funded proposals in the past, so this will help  auditability and clarity and go a long way to communicate back to any audit that may be carried out on the project.", "q2r": 4, "assessor": "z_assessor_2687", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "PA thinks Proposal should be in a different challenge but takes an opposite view of what the Challenge Team of the \"Dapps, Products & Integrations\" Challenge Brief and team expressed to the community. \n\nPA essentially says proposal does not belong anywhere. "}, {"id": 9531, "q0": "For an interesting idea that effectively addresses the problem statement at a very inexpensive low-risk cost, I rank this section a 5. I think this could be a very useful (and entertaining) tool for the Cardano community because NOBODY can reasonably keep up with all the Catalyst proposals that exist out there. Based on the demo video, it looks like they’ve got relatively decent production value and the guiding questions seem to help frame how this proposal might move forward to achieve success in securing these impacts. I think this section could benefit from greater quantification of the impact, perhaps with market research about engagement on this kind of format and difficulties with keeping up with all these different projects (or how many proposals get submieted each round. This extra bit of work could help secure voter confidence in the tangibility of these impacts, through a more easily assessed impact analysis. ", "q0r": 5, "q1": "For a simple and straightforward plan at an inexpensive cost, I rank this section a 4. This team seems to be very well-equipped and involved in the Cardano ecosystem to be able to run this show in a way that will appeal to the language and culture of the Cardano community. There’s also plenty of experience in creating video form content to make it visually appealing enough to put on a legitimate production. The roadmap section isn’t so much as a roadmap as it is a sentence that explains 16 episodes will be recorded once a week. I think there needs to be more steps taken to contact/communicate with Catalyst proposers, organize schedules, edit videos, advertise content, and workshop the format. The description of the format feels a little bit like filler content when placed in this roadmap portion. While the overall budget is much cheaper than most other proposals, this one does not breakdown the budget in a way that leaves voters with a clear understanding of efficiency of spending. It could be further defined why each episode will cost $500 and what the $1k Dework Community Organization category entails. I don’t often criticize projects for not spending enough money, but in this case I think the hosts do deserve to allocate something for their own compensation (which would also increase voter confidence in the sustainability of this project). ", "q1r": 4, "q2": "For simplicity of deliverability and quantifiable KPIs provided, I rank this section a 5. There’s not much to be measured here except for viewership and proposer acquisition. Since this proposal identifies both of those as definitions of success AND provides a few resources for public accountability, I see nothing to deduct points for. I would like to see a little more ambition in the viewership goals, perhaps with a little more progressively increasing milestone goals for the future of this show. Other than that, this proposal provides everything I need to be able to evaluate this teams conception of performance and cost to impact tangibles. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 10792, "q0": "To begin my assessment, I'd like to applaud your creative idea of developing a new approach for developers to share and experience in the blockchain environment. You detail the benefits that Catalyst HeartBeat can bring to the community, as well as the questions and metrics that this project can answer for the Developer ecosystem challenge. You do, however, have several flaws that make your Impact section incomplete and unconvincing. First, your solution's introduction is highly appealing to readers, but it lacks particular instances to highlight the tight relationship between this proposal and the challenge. You must clearly describe how and by what means your proposal will meet the challenge's questions. Second, if two projects are listed in a triple stack of proposals targeted for proposal reach and community collaboration, please include enough links for both. Third, the key risk question has to be fleshed out more in terms of how you would mitigate the risk of the equitably selecting proposers to participate in the HeartBeat.\n", "q0r": 4, "q1": "The detailed plan describes the filming process for three rounds of 12 broadcast episodes. I enjoy how you vary the pattern of project activities by holding competitions for participants in various formats (answer questions, chat on topics suggested by the community and write oranges of immediate execution). I believe that by participating in these recording sessions, developers will gain valuable expertise and contribute valuable ideas to the Cardano community. However, your plan still contains several unclear elements, preventing me from awarding you 5 points. First, I observed a discrepancy between the number of episodes in your plan and your budget (you planned to shoot 16 episodes but proposed $8000 for 12). Second, I am concerned that the number of 10 proposers every episode is quite large, and you may struggle to find 160 persons to complete the project. Or, if you believe you can afford to invite 10 people to each episode, I'd like to see a strategy for recruiting people to join the project. Third, while I recognize that your team is composed of technologically talented individuals, I have yet to see any person who can guarantee the field of filming and event organization (I consider that interviewing and making YouTube videos for two years is insufficient). Fourth, if you are working on another project in this fund 9, please include workload management in your Feasibility section.", "q1r": 3, "q2": "I award you 5 points because you provided all of the information required for the community to track the progress of your project: Youtube and Github will be public channels where you will be able to upload products within 24 hours, you use Google forms to collect feedback and comments, and you provide the criteria that define success with specific metrics.\n", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12816, "q0": "In this proposal, they want to create a show something like \"speed dating\" in which people would have a short amount of time to write a proposal like 1 minute and then 2 minutes to write an impact, feasibility and auditability. So, we can see more proposals and more ideas because this way there are too many. This way they want to give a chance to proposals that didn't have one by this point. I think this isn't a bad idea. I gave 4 stars because the flow I see is that I don't know how many people would be interested in this. The solution could be advertisement or giving people bigger rewords to participate in catalyst Heartbeat.  But, except that, I think the idea isn't bad. Giving a chance to ideas that didn't have one is a good idea because there are probably some good ones that haven't been seen so far. This way, people could talk to each other and make new friends.", "q0r": 4, "q1": "When it comes to feasibility, I give 4 stars because there isn't a well described timeline in which this proposal would be completed, there is just a described timeline in which people would participate and do this challenges which is 4 months. In therms of budget, it's well-defined and people who would work on this project. And the way this project would work is well described. The only flow I found is, like I said, no timeline for completion of this project.", "q1r": 4, "q2": "When it comes to Auditability, the text is well written and easy to understand. There really isn't shown any way how to make people participate in challenges. Like in risk, there isn't a described way on how they will mitigate risks. The measurement of success of this project is well-defined and how does success look like is well-defined too. The only flow I sow, like I said there is no described way on how they will mitigate risks.", "q2r": 4, "assessor": "z_assessor_3473", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13842, "q0": "High-speed collaboration might be needed within the Cardano Catalyst Community as it continues to grow and enhance. Proposals are too many for having the opportunity of an efficient pitching instance. A sixty second pitching round might help lots of proposals to have a real chance of presenting themselves. This might also strengthen community bonds and give a sense of social and more human interaction. The process will facilitate spontaneous collaboration between different proactive members of the Community and give the whole Catalyst Community a more vivid and fluent internal dynamic. This would certainly help the outreaching strategy Catalyst is trying to develop as it might be easier for external developers and entrepreneurs to pitch their projects and ideas in a real human conversation. Giving velocity and rhythm to the proposal presentation stage, this Heart-Beat project is effectively addressing the challenge of enhancing the Cardano Developer Ecosystem by tightening bonds and human relations and interactions within the Catalyst Community. ", "q0r": 5, "q1": "Having a Swarm Veteran on the team and abundant entrepreneurial management experience in team members is a guarantee that they will be able to carry out the project. Planning is detailed and feasible in a consistent timeline. Nevertheless, this proposal might be groundbreaking for the whole of Catalyst Community and it might take a special consideration and evaluation instance before it is funded and having the real possibility of coming true as it might be a real game changer in the entire internal dynamic of proposal presentation and assessment. In order to be real and feasible it should take into account how it would change present rules and internal functioning. These huge changes might be too lightly considered and might need further investigation and planning in order to get real. ", "q1r": 3, "q2": "Having all their information uploaded in public facing platforms in 24hs is sufficient to correctly audit the progress and the success of the proposal. They also have already developed strong communication channels within the Catalyst Community. Auditability strategy is well defined and already resolved. It would be easy for the entire Catalyst Community to audit this proposal progress and help them enhance and improve their good and hard work.", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 14504, "q0": "The proposal provides as a platform for proposers from around the world to expand their reach and increase their possibilities of working with developers; nevertheless, I believe the target objects should be more precise in their proposal. The way the proposer explains the activity, how it is carried out, and the impact of this project is a little confusing and unclear. They noted the difficulty in locating participants for HeartBeat from all sections of Project Catalyst fairly, but they could not provide a specific figure. Regarding the scale, I believe they should have a particular number on the size and quantity of individuals in each field, as well as the method they chose.", "q0r": 5, "q1": "The fact that the proposal has already been approved demonstrates that the team is capable of completing this project. The team profile is complete and precise, and most significantly, the team included several active community members who are experienced and skilled in moderating and managing such meetings/events. I am certain that the team will be able to meet the proposal's aims and objectives. The proposer has asked $9115 in funding and has provided a detailed budget breakdown. Based on these breakdowns, it is possible to conclude that the requested funding is adequate to carry out the proposal. With the information provided for feasibility, it is quite likely that the project will be carried out effectively.", "q1r": 5, "q2": "The plan includes well-detailed Metrics that will help in measuring the impact of success. They have also provided a definition of success, which will help in tracking the proposal's progress. The proposal lacks a clear timeline that would assist to keep track of the project. The project's activities and developments will be made public so that the community can review and verify the project's success. For clarity, The information provided is sufficient to assess the proposal's success and progress.", "q2r": 4, "assessor": "z_assessor_4060", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 14772, "q0": "The proposal team found that the content presented by the proposers was quite lengthy, requiring too much time and energy for Catalyst Contributors to reach. Proposing Projects needs a project that supports Collaboration, Self-Marketing & Outreach. The team proposed the Catalyst HeartBeat project as a solution to help the Contributors Project bring their proposals to the community faster. In my personal opinion, this is a great initiative and brings great value to the Cardano ecosystem community.\nThe development of the project is based on the interest and contribution of the community. Moreover, this project will also contribute to exploiting hidden talents in the future. However, the Solution part presented by the team is not really clear. The content of the proposal has not provided a specific view to the viewers about the features and functions of the project. The team needs to talk more about how the project works as well as the features and benefits that the project will bring. The team should also clearly define the audience of the project as well as how the project affects these audiences and the impact of the project on the Cardano community. Usually, the proposal should also include an in-depth technical explanation. The above details are important to show the impact of the proposed project. Since the content has not been presented clearly, this will be a minus point for the proposal.\nThe project is considered to have met the requirements of the key metrics set by the Challenge. The project helps solve problems and offers solutions that attract developers from other communities to Cardano, create an easy-to-use environment for developers, and promote commercial development in the community. The expected results of the project have also been presented in detail.\nThe issue that needs special attention for the team when implementing the project is Equitably selecting of proposers to participate in the HeartBeat from all sectors of Project Catalyst. However, the proposers still do not have a specific solution or direction to this problem.", "q0r": 4, "q1": "The project is intended to be carried out for more than 4 months with a frequency of one episode per week and the program will consist of 16 episodes. The project is divided into 3 phases corresponding to 3 rounds and finally broadcasting. The team provided a fairly specific project implementation plan. Each round has described the activities that will take place. Questions and topics have been arranged for each round. The team also describes how the rounds are played out very specifically. The proposers clearly identifies the positions and the number of people needed to carry out the proposed project. The project proposed a realistic timeline for completing the given tasks in a logical manner. The proposal also shows the technical details required to implement the project. This helps the project to be highly appreciated by the community for its potential as well as its ability to achieve its goals.\nThe budget that the team suggested for the project was generally quite reasonable. Details of the expenses that the team will use the budget to spend are specified and transparent including necessary assets and activities. The budget plan is presented in a way that is easy to grasp with bullet points.\nThe project is implemented by the founding team of people with many years of experience in the field. They have the talent and knowledge as well as the skills to take the project to the next level and achieve the expected success.", "q1r": 5, "q2": "The team detailed the project's goal of success. The project aims to amplify marketing reach to proponents. This helps the Cardano community grow as it encourages developers to propose more projects to contribute to the community. Criteria to define project success include attracting the number of proposals per episode, gathering responses from proposers, and the number of program views the project attracts. These criteria are all given specific quantitative indicators by the team. Based on these indicators, the community can monitor the progress of the project and evaluate its success of the project. These details also show that the team has been very serious about pursuing the set goals and making efforts to implement the set plans.", "q2r": 5, "assessor": "z_assessor_4099", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "Think Speed-Dating. 60 second lightning rounds of Elevator Pitches. Followed by 120 second rounds exposing the nuances of each Contributors Project.", "experience": "Rhys - SPO, Plutus Pioneer, YouTuber, Streamer, Catalyst proposer & CCv3 SPO Representative\nPeter - Freelance Project Manager // Community Organizer\nQuasar - Network & Facilitation Skill, CCv3 GAH Representative"}