{"id": 421326, "author": "catalystswarm", "title": "Catalyst Swarm Operations", "url": "https://cardano.ideascale.com/a/dtd/421326-48088", "category": 26597, "amount": 41000, "description": "The Catalyst Community needs open spaces to network, connect ideas and projects, and participate in Catalyst governance.", "f6_no_assessments": 10, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 1559, "q0": "The Catalyst swarm is a vital part of the Catalyst community that is very important towards empowering and catalyzing its impact driven aspects and that gives a lot of democratic empowerment and sense of belonging to the community. Several people there are practically or almost engaged there full time and manage to do stuff that people like me (working full-time in industry and only participating in my free time) could not possibly achieve. For all of these reasons they are incredibly impactful and valuable towards the Cardano ecosystem, and for the reasons explained by the proposers themselves, also for the challenge. The money is important to maintain and scale the effort made by the swarm core contributers.", "q0r": 5, "q1": "For anyone knowing the swarm operations not much needs to be said about feasibility: They have a lot of stuff organized, including since recently some dework opportunities that give a lot of swarm members the possibility to participate - my point being: it can be seen that they do good, reliable and feasible work. The budget is pretty clear and straightforward and seems sufficient for te tasks while not beeing greedy. It is clear That this money will go to a working system and not be spent the wrong way.", "q1r": 5, "q2": "Auditability - Just check the Swarm discord channel - the many swarm proposals, the swarm pool and the swarm website. It can be seen super transparently what they are doing with their funds and how their various projects progress. They have provided means of tracking the transactions done with their funds and are really consequential in publishing these. A perfect example of transparency. Also they have set up suitable KPIs.", "q2r": 5, "assessor": "z_assessor_2257", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 3479, "q0": "Catalyst Swarm is a well know organization in Cardano ecosystem that support several acitivites, as pointed out in the proposal, and holds plenty of important meetings, that helps Catalyst grow. Proposal is also well aligned with challenge, fitting in several potential directions provided in challenge description, such as support structures and incentivization structures and knowledge base and documentation. it also addresses the challenge kpi of \"A sense of community and conversations. Having people around to talk with\". \nAs suggestions, I'd bring here to the proposal some general figures related to the swarm operation so far, as, for example, how many people usually attend the meetings. it would also be nice if any improvement/increment will be made in relation to past funds.\nThese extras are, however, smaller details, and my rate is 5 as I strongly agree that keeping up with swam operation is key for the ecosystem.\n", "q0r": 5, "q1": "Regarding the plan of this proposal hereby stated, it is basically divided into the main acitivites. As this proposal is mostly related to keeping its already on-going operation, its understandable not to have a timeframed scheduled but rather, having their leading and support adicitivies well laid out as done here.\nBudget is based on such acitivies and matches project plan. One thing that would be nice to see here is the amount of hours usually spend in each of these budget lines.\nThe team is available in the Swarm website. They have several people already involded, with more than 10 people, and their roles are provided as well  links for references (linkedin and twitters).\nAll in all, proposal looks feasbile, specially considering they have been running this since F3.\n", "q1r": 5, "q2": "There are several kpis suggested here that help to track progress and everything seems to be avilable in their Discord channel. However, it would be nice to understand better how they measure the \"Impact of our support Funds for Fund receiver (Productivity, Motivation, Engagement, Availability)\". The way it is written seems quite subjective. Other metrics nice to be tracked would be related to attendence/engagement in the Swarm Sessions, after THs, idea fest, etc.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 15, "ne": 2, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 4451, "q0": "This is the recuring proposal, it is about to continue the growth of Catalyst Swarm. As we all see, the Catalyst swarm plays an active and crucial roles on spreading out the Catalyst community. There is no denying that the work of Catalyst Swarm makes a valuable contribution to the Cardano community and adds great value to the community by bringing together members and projects. They have been working on this for a long time as volunteers.", "q0r": 5, "q1": "The requested budget is listed in detail and is reasonable for all the tasks. All the important links and references have been included in a complete and detail way in this proposal. I personally have no doubt that community will continue to observe good developments and progress if this important team takes care of it.", "q1r": 5, "q2": "Personally, I think the auditability of the project is quite simple. The proposer describes what success look like and what they will measure, that give us the necessary content to establish tracking. Since all transactions and contributors rewards are provided on Discord server, I'll say the proposal is fully auditable.", "q2r": 4, "assessor": "z_assessor_2553", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 6453, "q0": "The Catalyst Swarm is a group of individuals that have been around since Fund 4. They are very familiar with Project Catalyst and have a lot of skills and expertise in this area of field. The proposal suggests helping the team to receive funding to improve the quality of their project. The proposal gives details on what the team strives to accomplish and how they plan to do so. They provide details to community members and play a part in the Catalyst Funding process. This is important because it can have a positive impact on the Cardano blockchain by bringing utility to newer members of project catalyst. I remember when I was first introduced to project catalyst. I had never heard of it before and there was very little information on what it is and how it works. Catalyst Swarm plans to help prevent these types of occurrences. For these reasons, I give this section 4 out of 5 stars.", "q0r": 4, "q1": "This proposal includes the identity of the members of Catalyst Swarm. This can be important because it shows that they are comfortable with the community knowing who they are. In some cases, this can be a positive thing that could lead to the potential success of a proposal. In this proposal, there is a detailed roadmap that includes details on what the team plans to accomplish. There is a lot of information included in this section. It discusses networking, incubation, PR and marketing, and even events in the community. These are only a couple of the things that the team works on together. Typically, in a proposal it is important to include a specific timeframe of completion. However, this proposal is unique. It is more of a fund to the team to continue progressing with what they are doing. I know that there are other proposals from the team this fund. In this case, it is not necessary to include these specific dates because it is generalized. However, in the detailed budget breakdown, it shows exactly where the requested funds would be allocated. All of the different sections of this budget plan is given to the details provided in the roadmap. All of this information helps the reader of this proposal to determine the likelihood of success for this proposal. I think that it is likely due to the team behind the project and their specific roadmap. For these reasons, I give this section 4 out of 5 stars.", "q1r": 4, "q2": "It is always important to include a lot of information in a proposal. It suggests that the proposal is important to the team and that they want to bring more utility to the Cardano and Catalyst communities. However, there will still always be malicious proposals that intend to take these \"grants\" as profits and not fulfil their promise to the community. For this reason, it is important to consider all of the information given, and provide a consensus with the provided information. The team has included their identity which helps secure this point. When auditing a proposal, the transparency of the project should be carefully monitored. The team at Catalyst Swarm has proven themselves in previous funds and have given specific details in their roadmap and budget. The team needs to make sure that the community is aware of their proposal so that the community members can hold the team accountable for this proposal and fund. Because of this, I give this section 4 out of 5 stars.", "q2r": 4, "assessor": "z_assessor_2817", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 7567, "q0": "The solution and problem outlined in this proposal are linked to the challenge set. The need for an open space for the Catalyst community to network, connect ideas and projects, and participate in Catalyst governance is an issue that needs to be addressed in this challenge, which is directly related to the current problem. This can scale to solve the problems of the future challenge it adds value to Cardano/Catalyst and the community. Well-defined solution Catalyst Swarm is set up to help maintain and discover community critical infrastructure by empowering and encouraging community-led initiatives. Through that, it helps to solve the current problems. I understand the risks that the author is facing with the increasing number of people participating in the evaluation of Catalyst-funded projects, but many of them have not contributed their opinions to the project. Given that the Catalyst funding cycle has been adjusted to 4 months, a vote on and missing funding active proposal could be profoundly damaging as further possibilities for funding emerge in 4 months. They have also taken a method of mitigating this risk by submitting this proposal of the highest quality that we can currently afford. Swarm has provided the community with an extremely valuable benefit that ADA holders and Catalyst participants have come to rely on for information, service, and support.", "q0r": 5, "q1": "The timeline is listed in detail and clearly by the author through each period. Catalyst Swarm explores and maintains critical community infrastructure to deliver great experiences to maximize participation and collaboration in the Ecosystem that makes Cardano more known. The team has joined Catalyst from fund 3 so we are quite confident that after more than a year of providing mainly volunteer services, we have proven our ability to successfully carry out the projects. its proposal. The goal of the proposal is given specifically to provide our services and contributions to the community over a long period. The team's project progress can be easily tracked through the websites, Twitter, Meetup, Github, Gitbook, and Gitla they have listed.\nThe success of the project is clearly described by the author. Create a bounty system that successfully grows across various projects and communities.\nVibrant and ongoing interactions and interactions with the community on Swarm Discord\nhttps://discord.gg/tU9umVcQNe\nLively, ongoing interactions and interactions with the Swarm Dework community on Projects, public tasks, and bonuses\nhttps://app.dework.xyz/catalyst-swarm\nVibrant and continuous community engagement and interaction on Community Events\nhttps://www.meetup.com/cardano-catalyst-community-network/\nThese successes are fully related to the challenges of the campaign.", "q1r": 5, "q2": "Well-defined KPIs determine the success of the proposal, the information is sufficiently provided for the audit, and they also provide the necessary metrics to measure the success of the project. Catalyst Swarm rewards those who participate consistently over an extended period, from weeks to months to a year, who are building and supporting the Catalyst Community and Ecosystem. This is a perfectly good proposition I think if the project is funded, success is the destination for them. This is a powerful team that has assembled an experienced and committed team of community members, proposal reviewers, sponsored proponents, mentors and recommenders, Cardano Ambassadors, and Catalyst Circle Members who have been building the Catalyst Community since Foundation 4. All participants bring deep experience in building at the Catalyst Project & Cardano Ecosystem. Through the Link: https://catalystswarm.com/swarm-fund/ we can get a deeper understanding of their team. The identity of the group is completely identifiable. The funding requested for this proposal is $41,000 less than 20% of the entire challenge budget. The author's budget is divided into small amounts suitable for expenditures.\nMaintenance - 5000 USD\nDocuments and Websites - 1500 USD\nNetwork Connection - 5000 USD\nAnnealing - 5000 USD\nManager - 7500 USD\nArchitecture - 7500 USD\nAccountant - 3000 USD\nTools and Services - 2000 USD\nPR & Marketing - 4500 USD\nThe presentation of the team's budget makes perfect sense. If the project is funded I think this project will soon be successful.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7598, "q0": "The problem described in this proposal is closely aligned with the challenge.The team have done well by putting the proposal in the right challenge which seeks to provide an incentive and a structure system to coordinate the activities of developers . It also seeks to expand and bring more people into the Cardano community which is something that will help Cardano in the long term as more people join the catalyst swarm operations they will get to know more about the catalyst fund and what it seeks to achieve.\nThe proposal has done well by capturing key metrics/KPls which will be by offering an open , inclusive , and iterative space which will learn to an onboarding and retention of community members within the swarm facilities or operations .\nThe proposal addresses a key part in terms of sustainability because it mainly relys on the Catalyst fund so far as there is a catalyst fund it will always operate . ", "q0r": 5, "q1": "The proposer provides relevant links and information about the team involved in the proposal since fund 3 and have done quite alot of work in the community which is mostly volunteer based and it is their goal to provide further contributions to the activities of the ecosystem. The budget outline is clear and it has been broken down into identifiable units which include maintenance right to PR and  marketing. Most of the swarm community members can be found on Discord with an attached link which is also nice. The proposal also provides a realistic timetable. \nThe main risk of this proposal is relying solely on catalyst funding which is unsustainable and this is also mitigated by submitting the highest quality proposal they can develop to receive the funding.", "q1r": 4, "q2": "The proposal provides a roadmap which currently develops rewards for people who contribute more in the community over a year. Also all transactions are transparently tracked via Discord and Gitbook. The success of the project will also look like a vibrant and community engagement and interaction on Swarm Discord and on community events.\nThe proposal is also a continuation of a previously funded and voted proposal from fund 7 and 8 which means they can be audited through the community if funded.", "q2r": 5, "assessor": "z_assessor_2906", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9985, "q0": "The information given is greatly close and it effectively address the challenge mentioned in this proposal. The proposers have taken time to get solutions to the problems mentioned and this proposal will help grow catalyst. The team has provided relevant information that will help massively to grow Cadano.Swarm is a system of peer-to-peer networked nodes that create a decentralized storage and communication service to people in a community but as here the catalyst swarm provide a great help in growing Cadano In communities. Decentralization provide security and the team has clearly shown the challenges and has provided clear solutions to the problem.i believe when this proposal is funded will highly lead to success and this is the reason I  think it is a good proposal. ", "q0r": 5, "q1": "The experience and interest level provided by the team In this proposal,directly shows that the  team has got a great capabilities to lead this project successful. Moreover the breakdown of the project budget is good enough and clear. Also the description of the team members and their qualifications should have been written down rather than sharing a link.the experiences described and the success of this project is not in a doubt.also the team has provided a great Time schedule to guide and help them achieve this goal. ", "q1r": 4, "q2": "There is a good and nice explanation or description of the challenge, there is also a great ideas on a catalyst block chain development,the suggested solutions to the problems mentioned move along with the proposal. I believe all the solutions given are good steps In evaluating success and I believe when this is funded, it will lead to success. This is why I think it is a good proposal. ", "q2r": 3, "assessor": "z_assessor_3140", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 11854, "q0": "Catalyst Swarm is an organization created by experienced Cardano community members to provide an open space to connect ideas and projects, that aligns with one of the challenge settings, which is to provide supportive environment to boost new innovations from developers. The proposer described the project’s services, such as organizing community events and providing Cardano ecosystem experience for developers in various languages. The proposer explains that this project relies on Catalyst Fund, thus making financial security as a major risk. The proposer tries to mitigate the risk by submitting high quality proposal, which is a good step to maintain quality and secure future funding.", "q0r": 5, "q1": "The proposer explained their project plan in detail, although there are no timetable for most of the role operations, outside of the weekly scheduled events (such as Saturday Swarm Sessions). It would be great if the proposer could provide timetable/schedule of the role services (e.g. documentation maintenance: 1st and 3rd week of each month). The proposer provides details about the core team in their website, complete with their LinkedIn and Twitter account. Knowing that this project is successfully funded on previous funding (Fund 7 and 8), the team has the experience and ability to deliver this project. The proposer provides their budget, but lacks the detailed breakdown in the proposal. Although I believe that the team will deliver the project with the provided budget, it would be good if the team could provide a breakdown for each service in the proposal, describing the workloads and tools to be used and the estimated cost for each of them. Outside the lack of timetable and budget details, the team delivered this project for 2 fund periods, proving that they have credibility to run this project again.", "q1r": 3, "q2": "As stated in the feasibility section, this proposal still needs more information regarding the planned schedule for the operations in each role to provide a clear activity timeline for all team members. Catalyst Swarm team described clearly about how they maintain transparency by providing trackable transaction records in their Discord server and Gitbook. Their primary KPIs and success indicator are also listed in the proposal. Because this is a continuation of a funded project, it would be great if the team can also consider the project’s growth from previous periods as their success metric. For example, expanding KPIs by comparing the number with the result from Fund 8 (e.g. comparing between number of regular rewarded Community Contributors from Fund 8 and Fund 9).", "q2r": 4, "assessor": "z_assessor_3296", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12832, "q0": "This proposal is in complete alignment with the challenge. The team has a very solid project and is going to offer a variety of services including periodical meetings in a variety of languages, workshops, experience sharing etc. All of these will help on attracting more people into Cardano Ecosystem and many of those may be developers. This proposal has a very great potential since it is going to become a bridge between ideas projects and people. In addition I have been following the work of this team for some time now and I can say with full confidence that they are one of the most active teams in all ecosystem and they always deliver. The impact of this proposal has the ability to scale in the future, make a global impact and help people understand what our community is about and at the same time attract new developers. For these and much more I believe this proposal deserves maximal mark. ", "q0r": 5, "q1": "develop in their platform. They want to grow their Swarm community in order to reach more people and at the same time provide much more services. All of the people who are going to work in this proposal are shown on their Discord channel. Based on the qualifications, skills and past experience of the team as well as the reputation of Catalyst Swarm there is no doubt that they can deliver this project with great ease. Finally, they have provided a financial split that is convenient clear and reasonable. More information about the distribution of funds has been provided in their discord channel.", "q1r": 5, "q2": "This part is very well written as well. The chosen KPIs are good indicators for the community members to audit the success of this project. The team has a very clear vision about what they need to deliver and they have provided all the necessary means for full transparence here including discord channel and gitbook page. Given that this community has delivered good quality products in the past is another reassurance for out community. Very well designed auditability, every detail is accounted for.", "q2r": 5, "assessor": "z_assessor_3478", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13843, "q0": "Swarm is looking for further funding in order to maintain and keep up the good work they have been doing within Catalyst Community since Fund 4. Having an open platform that enhances internal networking and dynamics is the cornerstone of the improvement of our Community Developer Ecosystem. Knowing the good work Swarm is doing within Catalyst, their interactiving events, workshops and community events, open spaces on a recurring schedule and their constant entrepreneurial support and mentoring, is fundamental to understanding the efficient functioning of the Catalyst Community. Maintaining these efforts will certainly address the challenge of enhancing the Catalyst Developer Community. Supporting Catalyst core infrastructure and internal dynamics is fundamental if this Community is looking for massive outreaching and onboarding. Newcomers need strong foundations to engage and commit with our Community as a whole. Bounties system to complete tasks and activities has been widely accepted and well received within the Community. This already successful team and project will enhance Cardano Catalyst opportunities of growing and developing. ", "q0r": 5, "q1": "This highly experienced team knows what they are talking about. Plan presented is super detailed and consistent. Tasks are specified and feasible. They have considered every aspect of their challenges ahead and designed strong strategies in every field. Special and daily events, marketing, management, incubation, networking, documentation and website, every one of their key milestones are well developed and aware of risks and hurdles. Knowing they have been funded since Fund 4 is a safe guarantee that this proposal will be implemented successfully.  Budget breakdown is consistent and down to earth. This team is prepared for enhancing and improving their projects and their hard work. ", "q1r": 5, "q2": "Vibrant and constant community engagement activities are being shared regularly on Discord. They are also sharing constantly with the Community their Community Events and Public Projects and Bounties on Gitbook. Detailed KPIs were presented that will help Community measure numbers or regularly rewarded Community Contributors. Transactions are fully transparent on Swarm Discord Server. Information provided is sufficient to audit the progress and the success of the proposal. It might be interesting to follow up the mentoring and supporting of different projects and entrepreneurial proposals also so that the entire Community can engage and help enhancing new projects. ", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "The Catalyst Swarm establishes, maintains, and explores crucial community infrastructure by empowering and encouraging Community-led Initiatives.", "experience": "We are a highly experienced and committed assembly of community members, proposal assessors, funded proposers, proposal mentors & referrers, Cardano Ambassadors and Catalyst Circle Members, who have been building the Catalyst Community since Fund 4."}