{"id": 421486, "author": "chilestakepo", "title": "An open source book on Cardano", "url": "https://cardano.ideascale.com/a/dtd/421486-48088", "category": 26597, "amount": 59850, "description": "Comprehensive instructional resources on Plutus that don't require prior functional programming experience are limited and such resources are almost non-existent for Spanish speakers.", "f6_no_assessments": 10, "f6_rating": 4.566666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 112, "q0": "Many times simplicity and good ideas can trump complexity and convoluted solutions. The team behind this proposal has identified a great way of helping developers in the Cardano ecosystem – through the proposed development of an open-source instructional book that covers everything needed to master Plutus (and Cardano programming in general) – with no prerequisites – both in English and Spanish. The team might – if resubmitting this proposal in Fund 10 (if it does not gather sufficient votes in Fund 9) – think about renaming this proposal to “An open source book on Cardano programming” – as “An open source book on Cardano”. A suitable problem has been identified – the lack of resources for aspiring independent programmers who wish to delve into the Cardano languages and build, plus a nice focus on a bilingual solution is more than welcome. Spanish and English are great for the deliverables. The proposing team has clearly demonstrated how their planned project would add value to the Cardano ecosystem and the Developer Ecosystem challenge. Additional applause for going for an open-source publication concept that will be beneficial to everyone. Great that the team has already considered which type of license will be used – “The book will be open source under the MIT license.” This aligns well with one of the challenge’s proposed directions: “Knowledge base & Documentation”. What makes it (hopefully) more valuable is its intention to make it accessible to a broader audience as the team specified they will create content for readers with no background in mathematics or programming”. However, I would advise the tam to make sure that they find a stellar writer – bridging the gap between a high-level subject matter and a low-skilled reader requires a fantastic author. ", "q0r": 5, "q1": "My biggest concern when reading this proposal was quality. Will the proposing team be up to the challenge of delivering what is a frankly speaking a deliverable that is so dependent on quality? Of course, it is impossible to know whether it will be done, what can be done is we can ascertain at this stage whether the team has a credible plan and whether the team has the relevant competencies that would qualify them for this type of endeavour – to banalize - bringing Plutus to the masses. The team has provided a very convincing general outline of the book with a tentative breakdown of the chapters indicating that the proposal is based on a specific plan – not a general plan of the “I want to write a book” type. I personally have started learning Haskell on my own, so this seems like a very welcome addition – as I am in the target audience for a book of this type – as Haskell is a stepping stone for Plutus and Plutarch. The references to be used for the book are all laid out . The team has given an 8-month long plan of action with a plan for chapter completion in that period. The formats (HTML and PDF) have been specified. The budget has been broken down into the key components and they seem realistic. The author has teaching experience – which is critical. The author is Camilo Chacón Sartori - a Ph.D. student in artificial intelligence at the Artificial Intelligence Research Institute (IIIA), in Barcelona, Spain. He has already authored a book that touches on the theoretical (lambda calculus) aspect of functional programming, among many other impressive references of his polymath abilities. Seems like a perfect fit. The other team members have also provided their references. One risk that has not been addressed is the risk that the author’s Ph.D. studies (which are time consuming) will interfere with the project. If the project is resubmitted in Fund 10, it would be good to address this. ", "q1r": 5, "q2": "The auditability seems straightforward thanks to what the team has provided. At the end of the first month the first & second chapter will be online on Github… same goes for the third chapter (end of third month), fourth chapter (fifth month) and the rest by the end of the eight month. Github commits will be a key indicator of writing progress, according to the proposers. What I am missing from this proposal, is the quality control, namely the editing and the editing advice. An author is usually too close to the subject matter to be able to realistically see some glaring mistakes. Yes, the budget does include a provision worth $28,000 for the main author for “Research, Writing & Editing of the Book” – however, if the project is to be financed by Catalyst – the end result should be not only written well, but also verified for consistency, quality, readability and presentation/coherence. Hence, I am not completely sure that the solution (author is paid for both writing and editing) is good enough – for a project of this scope that effectively relies on quality of output (like any book). If it is my misunderstanding – then it is probably a good thing to clarify if this proposal is resubmitted in Fund 10. Even bestselling authors such as J.K. Rowling require editors who are independent and experienced. This proposal would probably need an independent editor – who would help to “audit” (edit) the final result (the book) before finalization and publication. Probably it would be done best, chapter by chapter – as the book is being delivered. ", "q2r": 4, "assessor": "z_assessor_2047", "no_vca": 22, "ne": 10, "ng": 12, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to review our proposa"}, {"id": 3554, "q0": "The proposers have an idea of a book that will cover several important topics: mathematical foundations, programming, functional programming, haskell, blockchain, cryptographic fundamentals, smart contracts, decentralized finance, decentralized exchanges, plutus, monads, plutarch, marlowe. These are just some of the topics the book plans to cover and it will be targetin people who are not developers and have no prior knowledge.\nThis is a great idea, althought I don't think it's very feasible. I'll get to that in the feasibility section, because I want to focus on the possible impact here. A book that will teach you mathematics, functional programming and blockchain development will be trruly invaluable. The idea of making the book online with an MIT license is great, because all community memebers will be able to offer edits and knowledge on all different kinds of topics and chapters, which there are a lot of. I still don't know how a book will give you practical knowledge without excercises, because setting up the environment to start learning something has been an integral part of any programmers learning curve. That's the beauty of it infact because programming gives you the opportunity to learn by doing, unlike many other diciplines where that simply isn't possible like biology or quantum mechanics. There the entry level is much higher.A self contained book that covers all those topics seems unreasonable, especially if the authors don't want it to be outdated quickly.\nI did see mentioned possible challenges, but I didn't find any possible solutions to them, and considering there might be quite a lot of challenges, it would have been nice for the authors to include their plans for overcomming them. Overall if created this book will have an impact over the community for sure with the few caveats I've mentioned.\n", "q0r": 4, "q1": "The team has provided their credentials and they all seem well educated and completely capable of writing a book. For that I have no doubt.\nI do have a couple of other doubts which I think I should share:\n1. As a software engineer, I can say with certainty that in order for this book to be usefull it's going to have to be at least 20k pages if not more. Let me explain. Each of the aforementioned topics has several books of their own, and these books do not cover introduction to programming and are actually targeting programmers mostly, part from the ones that explain only theory. The notion that one book will be able to teach you mathematics, programming and will give you practical knowledge in blockchain development and will be done in 8 months is practically impossible.\n2.Budget breakdown is not good enough. After reading the proposal I have a lot of questions regarding the actual creation and expectations of the book. There is no explanation on what exactly does project management of the book means and why it's 15 000 dollars. If the book will be published in 8 months doing releases every month, when will be the time to edit it?. A book and especially a textbook has an extremely rigorous editorial process that sometimes means reordering rewording, retrying or simply deleting chapters. I simply don't see the time for that to hapen. \n3. Considering all goes according to plan, the proposers have stated to do the work in 8 months. There is no specification on when those 8 months will be. Also considering they do both this and the e-learning platform (https://cardano.ideascale.com/c/idea/422099) projects, I don't see enough time in the day for both of them to be done in paralel if both get funded. So I'm really uncertain about both projects reaching completion if both get funded.\n4. There is a mention of the book not being outdated. While that might be true for a book about blockchain, this could never be true about Plutarch or marlowe. These are rapidly evolving. Another argument related to that statement is that I don't understand the reason behind sending a hardcopy to 50 ICT colleges around the world. I think it's a great idea to have them use the book, but why would you want to print an online book just to send it all over the world, considering 1. it could be used online, and there's no need for a hard copy. 2. The book will probably be updated several times untill it reaches some parts of the world where it were intended to. 3. If the universities wanted to, they could just print the book themselves and save the delivery fee.\nOverall, mainly for the aforementioned reasons I don't consider this project to be reasonable. My suggestion would be to focus on one topic and generate an online book for it and then perhaps move on to the next one. There are plenty of amazing books for blockchain and haskell and mathematics. A book about marlowe would have much greater value, because it's unknown territory, unlike most of the other topics. Another option is to translate books already created in english and have proven themselves over time in spanish, which would also be effort well spent. Especially if it becomes an online book providing royaltees to the authrors.\n", "q1r": 2, "q2": "Having an online book will be great for auditability, because as the authors mentioned commits will be a proof of the work being done. There's a clear problem - we need more educated cardano developers with practical abilities. The solution could maybe use a bit more polishing, but the general idea to do a practical book / books seems a good one to me. The choice of the authors, doing MIT is amazing and doing the whole work online is a great step in the right direction as well. The metrics and KPIs are reasonable and would serve to check on the progress of this project.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thanks a lot for taking the time to review this proposal :)\n\n1)This is a book of fundamentals, of course it would be really hard to master each topic treated in each chapter, of course there are books about mathematics with over 700 pages, about functional programming and Haskell over 500 pages and others about blockchain with over 600 pages, but this book get inspiration from books like this one \n\nhttps://www.oreilly.com/library/view/computer-science-illuminated/9781284155648/ \n\nThis one in particular covers topics that are complex as binary systems and representation of the information,  programming languages, databases, operative systems, simulation, computer graphics, telecommunications network, computer security,  theory of computation, artificial intelligence, etc. As a summary: a Book of fundamentals  \n\nOur proposal’s goal is to show the fundamentals to be a Cardano developer, as an example, types of maths are omitted that would not be as useful for our objective (for  example, calculus and linear algebra ); only some aspects of lambda calculus are shown (not everything); just some characteristics of Haskell that are relevant to learn Plutus (not all  characteristics of the language), etc.\n\nThen this book doesn't guarantee that the reader will become an expert in each topic, rather into someone who will have a solid base of fundamentals to build applications in the Cardano ecosystem, that in the future can go deeper on the journey of learning. This  book will contain a suggested reading books list. \n\n\n2) Edition is important. That’s why it is an open source book,  it’s hard for us to think that after eight months the book won't have further changes. it's a book that should be in constant changes, some chapters more than others.\n\nThe change in the order of the chapters (or even the elimination of them) it’s a strange process, I have published in editorials and the first to be defined and get’s to be validated is the book index (that’s why we submitted at the proposal) before start writing it; the changes that usually happens are on the form that the content is presented, but not in the structure\n\nWe thought as mentioned in the project description that we are thinking about doing the edition process through a someone who had finish PPP (plutus pioneer program)\nalready have people in mind for this position, also The Latam Cardano Community will provide support with another peer. The idea is that they can work on the chapters as Camilo writes the following one.\nProject Management, thanks for pointing out the lack of information about this item on the budget. The management of the task  consists of taking care of KPIs of the project mentioned on the project description such as finding the individuals with the credentials for the task and the responsibility of taking care of the progress of the project as a whole and also doing the task of  research and  creating the network with the ICT colleges introducing Cardano to them through meetings where this book is presented, creating trust and relationships with the cardano ecosystem. \n\n\n\n3) The second proposal “Cardano e-Learning Platform” is a bigger team of people, Camilo is just one of the members involved on it, and his labor, in case of both projects being funded by Catalyst voting, will never be as big as the task of writing this important book.\n\n\n4) The first chapters of the book could change little with time. And as well you mentioned at the end, when we talk about Plutus & Marlowe this chapters will see more changes, then it’s when it’s relevant that it is an open source book (MIT License) not a close one, because especially at these chapters we could see the community proposing changes.\n\n\nThat’s why we write the book in 8 months, but there is not the end, as the same as an open source project life, it will continue if the community decides so.\n\n"}, {"id": 7428, "q0": "The project created a book of Plutus instructional resources in English and Spanish, giving developers more tools to perfect their products. This project is perfect for the Challenge\nThe book helps to increase the productivity of learning about Plutus knowledge for programmers, suitable for all audiences. The book is presented in chapters, with great self-contained, suitable for those with no programming experience and blockchain knowledge. With 6 main topics and many sub-topics, showing a huge amount of knowledge, I am really impressed with this. A thoughtful preparation to launch the project. Reference books are listed clearly and reliably. After reviewing and interacting with the community, I rate these resources as containing powerful, standard knowledge. At the same time, the book is directed to an open-source code, in line with the decentralized orientation of the Cardano ecosystem, which is absolute respect for the authors, who have spent a lot of time and brain.\nAs for the risks, the project has no official documentation. I think this is more of a step than a risk. Blockchain knowledge is so new, everything is evolving by the minute. The book as a compilation, with reference to reliable sources, is a gift for developers.\nAs for the question, why books? Books are knowledge, the foundation for the whole society, other versions are developed from books. Books help to read, memorize, and note into documents at the same time. Books are an advantage\nI fully support this part, 5 points\n", "q0r": 5, "q1": "The total estimated time is 8 months to complete, a respectable amount of work and the team must work very hard. From document synthesis, logical arrangement, writing, review, and publication. In terms of methodology, it's nice that at the end of each chapter, the project is updated on Github, reporting progress to the community, and the community has an assessment and addition to the content. A great step.\nThe total budget of $59,850 represents nearly 6% of the Challenge fund. This is a pretty comfortable budget to make a book of value, the brain is something priceless when it is kept and passed on. The budget is for information technology schools, which is a very good step, both popularizing blockchain, increasing community, and orienting students with a standard document.\nThe team has 3 main members, all with rich experience and ability. Spread across areas such as artificial intelligence, interpreters, and community building, all complement each other to run the project smoothly. All member data is provided with a full reference link. In addition, there is a supportive LATAM Cardano community behind the scenes, helping with peer review and adding more resources as needed.\nMembers are involved in other projects in this fund. Will that affect the results? How is the timetable arranged? The project please clearly presented for the community to evaluate. Apart from the small question as above, the rest of the parts are very good, I would like to give this 5 points\n", "q1r": 5, "q2": "The project progress is clearly reported by you, including completed chapters and specific reporting addresses. All metrics are intuitive, easy to quantify and stick to the project. More reporting on metrics such as peer-reviewed community feedback should be reported, and with the number of books delivered to schools. These are indicators that contribute more closely to the performance taking place. The success of the project creates the first open-source book in the Cardano ecosystem developed by the community. It is a premise to help developers create faster and better products. And from there smart contracts are used more. The success of the project is highly anticipated. I rate this section 5 points", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8706, "q0": "The main audience of this project is Spanish developers and its main aim is to write a comprehensive guide to Plutus in English and Spanish, which is intended as a basic learning material for new developers in Spain to encourage them to learn, join and contribute to the Cardano ecosystem. Proponents have also clearly outlined what content will be provided in their material released as a book and open-source. Although in concept, this proposal is completely consistent with the requirements and goals of the Challenge and the author also has explanations for why using the main form of reading book for release. But this release form will bring a big challenge for the project as to how to measure the rate of user conversion to Cardano by reading this book, and how to confirm the developer really brooded over and read through this book? This proposal is missing the number/developer conversion rate commitments for Cardano, although we know for sure it could have a positive effect on Cardano by increasing the number of developers involved in Cardano, as we need a more specific prediction to be able to determine if the potential of this project is big or not.", "q0r": 4, "q1": "This project development plan is simple and straightforward as it mainly revolves around the milestones of completing the previously listed content chapters and the timing for the book's release. In order for the budget allocation plan to be really valuable for reference and beneficial to the audit work, besides factors such as resources/work required for book writing and publication, overall cost for each item of work, the proponent may provide an estimate of the number of hours worked for each task. In the personnel section, we have found good candidates for content editing, and content translation in two languages ​​​​Spanish and English. Most of the people working on this project have in-depth knowledge of the programming language, Cardano, and have experience in composing content in a variety of formats. These are the basis to ensure the feasibility of the project and the good performance of the proponents.", "q1r": 4, "q2": "Github will be one of the main platforms for publishing books and also an ideal platform for the community to track the progress of this project. However, this project is lacking a roadmap to audit and evaluate project success including timelines and ideal metrics. As I mentioned earlier, the conversion rate of developers to Cardano thanks to this document would be one of the ideal metrics for this project. Additionally, I have seen descriptions of book releases on the Amazon platform, but no estimates yet as to how many books will be released in the timelines after content compilation is complete. . For example, the proponent expects 1000 books to be sold on Amazon in 6 months. These estimates are necessary to be able to assess the potential the project will bring to Cardano.", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to review our proposal"}, {"id": 9130, "q0": "My heartfelt congratulations go out to the team for your outstanding proposal, especially for the fantastic description of the history and why we need to handle the numerous elements of this complex topic. The overall concept, project proposal, and overall outlined objectives and milestones sounded reasonable to me, not just for the targeted investment value but also for the entire project proposal. Furthermore, the idea and construction of the project look to be well-designed. A dedicated session focusing on impact is also advantageous because it clarifies the value provided. This tip significantly improves the Carnado environment. A dedicated session focusing on impact is also advantageous because it clarifies the value provided. Aside from that, it's excellent to include a case study in the proposal, which most others don't have. As a suggestion, make these report indicators as visible as possible, such as graphs and dashboards, so users can understand the size of the backlog and where the tasks are in the process. All I want is a directory where I can save \"proofs\"/evidence of successes as documents.", "q0r": 5, "q1": "In terms of viability, this proposer leaves nothing to the imagination. That is, the skills and expertise are there and recorded, the budget is suitable and broken down into components, and a timeframe for implementing the recommended solutions is supplied. The proposer describes the technical components of his concept in considerable detail and does it effectively. Based on the information provided, I believe the proposers have the necessary competence and skills to successfully complete this project. The entire team boasts a wide range of skills that will all be necessary. Many of the proposers have previously worked with Cardano catalysts, so they are familiar with the system they are aiming to improve. The proposers provided a comprehensive strategy as well as a timetable. This roadmap is ambitious, but not impossible to achieve. They will bring in proposal teams to build the funding process after a month of fundamental study. Furthermore, the budget is reasonable in light of the amount of critical work that the proposers will put in. The KPIs are more focused on operation and development/implementation milestones, which makes sense for this project and guarantees that all stages are covered and auditable. A full risk assessment would be desirable in the challenges section.", "q1r": 5, "q2": "They did a wonderful job of laying out the five stages. Each with a brief description of what might happen. The team took a step further by updating the community about upcoming activities such as hiring, development, and research. There are wonderful time-framed KPIs with the target and good milestones in the KPIs sections. The KPIs are more focused on the operation than on the development/implementation milestones, which is appropriate for this project and guarantees that all stages are covered and auditable. This project will be easily tracked and audited by the community, and the proposers will be able to provide evidence and certification of completion. They will also have official social media and a gitbook, which will be great resources for creating public record of their work and impact. As a suggestion, I'd include the risk mitigation strategy for each of these challenges in the same section. They are distributed throughout the strategy, but it would be useful to have them stated directly here.", "q2r": 5, "assessor": "z_assessor_3022", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to review our proposal"}, {"id": 9144, "q0": "\"This proposal proposed writing an open-source instructional book in both English and Spanish that covers everything needed to eventually master Plutus with no prerequisites. \nA theoretical and practical approach is used in this open-source instructional book. Mathematical foundations will be covered first, followed by an introduction to programming, with a focus on functional programming, before moving on to Haskell and its type system. Since this book systematizes the fundamentals, it will make it easier for the reader to understand how to get into Cardano. This book will boost community technical proficiency while also increasing developer productivity. \nThey show a general outline of 6 chapters and also specific subject indexes. The group offers both the risks and opportunities of the project, but I have not seen the risk resolution. In addition, they also clearly explain why using the book format and have Spanish in it. Along with that, they also did not forget to cite the sources of the preliminary references to be used in the book. \n\"", "q0r": 5, "q1": "\"According to the plan they give, the book will have 6 chapters and the completion time it will be in 8 months. \nThey will use Markdown to write and pandoc to convert into another format. To assist the reader, the book will have many graphic elements to aid in understanding the content. They also use various translation techniques such as direct translation, adaptation, and reduction to transmit this important documentation to the majority of people who are interested in learning.\nThe budget clearly stated the amount of each main job and briefly explained it. They also make it clear that there is an extra cost for the risk if control is lost. I quite like the cost for donating this book for ICT colleges and this way will help many people understand the path of participating in Cardano, Blockchain and the E-UTXO Mode.\nThe team section is very well described with information about the key people in the project along with achievements and includes LinkedIn for a closer look.\n\"", "q1r": 5, "q2": "\"They will upload each completed chapter to a public repository on GitHub, where the book's progress can be publicly and transparently tracked. This makes it possible for anyone to offer suggestions for improving a chapter or to ask questions about any content they don't understand through the issues. The team took commits on Github as an important indicator to evaluate writing progress and try to reach 30 stars in the GitHub repository in the first 3 months.\nTheir book is aimed at people who have never coded or don't know functional programming and will help them go from scratch to develop smart contracts using Plutus.\n\"", "q2r": 5, "assessor": "z_assessor_3023", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to review our proposal"}, {"id": 10909, "q0": "The proposal aims to create a step by step instruction book where one can learn the basic math and coding languages as well as the Cardano specific programming. Without much knowledge of Plutus, Haskell or anything on blockchain is possible to learn within this book. I do respect the goal of creating such a teaching resource but would be better for the project and readers if it has included more about cardano in this teaching material. \n\nWe need quality content for beginners who want to enter into the world of Cardano; we need articles that introduce people to step by step how everything works from blockchain to as deeply as Plutus, so that they are more comfortable with our ecosystem and understand it well. ", "q0r": 5, "q1": "The proposer does a great job detailing his qualifications and some achievements, giving the voters confidence in actually being able to implement the book. Successful implementation appears highly likely due to their knowledge and connections within Cardano LATAM community.\n\nThe budget The budget breakdown makes sense but the total budget 59850$ seems a bit high for a person with no experience in writing such a book. The budget breakdown of the proposal is simple but direct. They break down the total cost of the project and distribute it based on different categories like research and translation, etc. This makes it very easy to make sense of both the proposal and its budget breakdown.", "q1r": 4, "q2": "Audibility is quite good and complete. There are a lot of ways to measure the process because what is promised is that all chapters will be available online as github online repositories. This provides plenty of ways to audit both the progress and completion criteria. Using such a strong model actually stimulates auditing, because it's code, so all readers/auditors can easily fork and move things through pull requests. ", "q2r": 4, "assessor": "z_assessor_3205", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for taking the time to review our proposal "}, {"id": 12415, "q0": "This proposal brought up the issue of the lack of structured educational resources for people to learn about blockchain and Cardano, be it in general or the technical aspects of it. It aimed to addresses this by making an open source book going over structured instructions of learning Plutus  from the very basic. I think this proposal has managed to identify a relevant issue that needs to be solved considering that Haskell and Plutus have a really steep learning, even for novice programmers. Though it can lack interactivity, by structuring it in a book, details can be explained more in-depth than say, a short video. And, since the book will be open-source, it can act as basis to be adapted to other learning medium, such as online/offline courses, video, or other formats that can have more interactivity.  It can even be adapted to a more traditional learning environment like a university course. Additionally, the book would be made in English and Spanish since there is even lesser educational resources for Spanish speaking people. The proposer has also provided detailed chapter structure going over  mathematical foundations, basic of programming, Haskell, intro to blockchain, and Plutus. The chapters are very well laid out detailing every concepts that will be covered in each chapter even with example codes and exercise associated with each chapter. By the very well structured content, I can see that the proposer knows what subjects are essential and how it can be delivered even to students with minimal programming knowledge. Overall, I think this project can benefit the Cardano developer ecosystem greatly by giving avenue for new developers to learn about and jump into Cardano and in turns would create “a bigger talent pool of developers that Catalyst projects can collaborate with”, which is the challenge setting objective. ", "q0r": 5, "q1": "The proposer has provided relevant links (via LinkedIn and other site) providing the team members’ experience and skills needed to implement this project. This includes experience as a book author (topics: Racket, Haskell, and Python), working on Cardano projects (staking service), as well as proficiency in English and Spanish.\n\nThe budget has been broken down well into identifiable items, such as the creation of the book, translation works, peer review, project management, backup funds, as well as the cost to donate books to several colleges. Some of the items has been broken further, such as the number of peer reviewers, the printing and shipping cost for donated books. However, I’d like more details regarding the 8 months expenses requested for the author during researching and writing the book, as well as total workhours and requested hourly rate for translation works and project management. i think these are important information needed to evaluate the budget allocation more clearly.\n\nThe 8 months roadmap has been laid out well detailing the specific timeline and its respective milestone, in this case the completion of each chapters. The proposer also mentioned how each chapter will be stored in public repo, the book format, and the final compilation process of the book. This shows that the proposer has a clear plan on how the chapters will be written, given feedback, and finalized into the final product.", "q1r": 5, "q2": "The project’s progress can be easily tracked since each chapters will be uploaded on Github and it allows for feedback collection and revision. The performance metric chosen to measure the project’s performance is the amount of stars the book will garner on Github, which is adequate enough to evaluate the content quality. However, other metrics to measure the project’s outreach (e.g. number of other learning resources referencing the book) can be beneficial as well. ", "q2r": 5, "assessor": "z_assessor_3408", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to review our proposal "}, {"id": 12474, "q0": "The proposal perfectly meets the challenge setup. Blockchain technology and crypto are increasingly developing, especially in the last few years from 2017 to 2021 Bitcoin continuously set new price records. This promises a great future for all blockchain developers including the Cardano developers. According to a report by Evans Data Corporation, there are 26.9 million software developers worldwide in 2021. This shows that the current developer community is very large. But there is one problem that hinders the developers and all those who have no programming experience and want to learn to program on the Cardano platform, finding and accessing reputable, official resources is extremely difficult. Currently, there are not many professional documents specific to Haskell or Plutus on the Internet, if there are, it is very difficult to verify the quality of the materials, while the official reputable courses are very expensive. In addition, language is also a huge barrier for people who are not fluent in English like Spanish or any other countries that do not speak English fluently. Therefore, creating an open-source book on Cardano is a very good idea and meets the actual needs of people. According to the index of the book, the book has very clear and methodical content that helps people who have not had any programming experience to read and understand and become Cardano developers. The content goes from the core concepts of programming such as data types, reduction, and abstraction to logical algorithms and then an introduction and in-depth conceptual knowledge of blockchains such as consensus protocol, Smart contract, Staking & Testnet, etc. In addition, it is open-source, so everyone can contribute and edit the content so that it is most accurate and suitable for readers. This will have a very positive impact on the developer community not only in Spain but all over the world. The book is a reputable, methodical, accurate but highly effective miniature blockchain forum. Help everyone to learn and become a Cardano developer in the future.", "q0r": 5, "q1": "The proposal is a hundred percent feasible. The proposed solution is completely workable and very suitable for the current situation when specialized resources for blockchain-specific such as Cardano are very limited and difficult to find. The members of the project team are listed very clearly and in detail with personal information, professional qualifications, experience with LinkedIn, and even personal interests and achievements of each member. All of them have many years of experience in technology, research, translation, writing, and publishing as well as working with many corporate organizations around the world. For example, Mr. Camilo with more than 23 thousand followers on Quora in Spanish, was Quora's \"Featured Spanish Writer\" for four consecutive years (2018-2021) for her 800+ replies on computer science and is the author of books like Computación y programación functional, Marco editorialmbo, Mentes geniales. La vida y obra de 12 grandes informáticos, Editorial Marcombo. The budget breakdown is well planned and provides sufficient clarity for each project activity and purpose. Especially, there is a section to donate books to 50 universities and colleges to help expand the project flexibly and meaningfully. With quality members with a lot of experience, good solutions, and reasonable capital allocation like this, I believe the project will be easily possible.", "q1r": 5, "q2": "The project can be easily outlined for the auditability. The proposer provided a clear roadmap, the expected time to complete each chapter of the book in a total of eight months. The content of the book voters and the community can see the extremely detailed and complete appendix to a book that explores the Cardano blockchain. We can check the progress of the project accurately through GitHub because the entire content of each chapter and related activity will be uploaded to GitHub after completion. KPIs of completed projects are listed in detail by the proposer in the auditability section. In the first month the first & second chapters will be complete, the third month the third chapter, the fifth month the four-chapter, and the eighth month the fifth and sixth chapter.\n\nI really hope the project will be successful\nGood luck", "q2r": 5, "assessor": "z_assessor_3420", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13564, "q0": "The challenge is to create an awesome developer experience that incentivizes adoption and growth. The proposal seeks to address this challenge through the development of an open source book about Plutus. \nLack of proper documentation is a sore spot of the developer experience that is widely documented in forums such as Cardano Stack Exchange, Reddit, on the IOG Technical Discord, etc. \nThe proposal seeks to address that challenge by providing \"comprehensive instructional resources on Plutus that don't require prior functional programming experience\". \nThe proposal also states that the book would be developed both in English and Spanish. \nThe proposal effectively addresses the challenge. It centralizes relevant documentation in a well structured, comprehensive and pedagogical format that assumes no prior understanding of the subject matter and can be made available to two different and broad user bases (Spanish and English speaking).  ", "q0r": 5, "q1": "Yes. \nThe author is an academic and a subject matter expert in functional programming with experience writing pedagogical books on the topic of functional programming. \nThe proposal includes a detailed and comprehensive outline of the book that covers subjects ranging from mathematical foundations to Haskell through to Plutus and its development ecosystem. \nThe proposal also includes a concise writing and translation methodological approaches, more than sufficient for the type of project and the experience of the team. \nThe budget breakdown provides a detailed description of the projects different milestones and objectives. ", "q1r": 4, "q2": "It would be nice to have more information about the peer review process. \nThe proposal writing methodology states that \"each completed chapter will be uploaded to a public repository ... where progress of the book can be tracked\", according to the proposal this will allows feedback and suggestions for changes, it doesn't provide information regarding the feedback and suggestion process, which should be an important part of the development of the book since it is community funded. \nThe proposal states that the book will be revised \"by a third party\". Information should be provided regarding the third party or at least the minimum qualifications of said party that make them competent to revise the translation. \n", "q2r": 4, "assessor": "z_assessor_3695", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to review our proposal "}], "solution": "An open-source instructional book that covers everything needed to eventually master Plutus with no prerequisites required, written in both English and Spanish.", "experience": "Our team includes a PhD student of Artificial Intelligence who wrote the first book on functional programming with a theoretical and practical approach in Spanish. We have a Spanish to English translator on the team as well."}