{"id": 421555, "author": "gondlr", "title": "Developers Reward program DEV$", "url": "https://cardano.ideascale.com/a/dtd/421555-48088", "category": 26597, "amount": 55000, "description": "Developers are not incentivized to work with Cardano technology, there is no reward for choosing to focus on this technology. No monetary incentive compensation is offered to use Haskell and Plutus.", "f6_no_assessments": 6, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 1394, "q0": "Yes, this proposal effectively addresses the challenge by developing an incentivization structure for Cardano developers who will earn $DEV for the products they build, and the value these products create for the ecosystem. \n\nOverall, this is an interesting project and could drive further impact by incentivizing builders to come to Cardano, not to only get paid by the teams which they are helping, but to get rewarded in native assets that can be sold for alternate tokens. This could also incentivize new devs from outside the ecosystem to try working in Plutus and Haskell to earn these rewards rather than spending FIAT. \n\nI am left with some questions however, particularly regarding the reach of this program across the ecosystem that could significantly hinder its impact. To this end, the proposal is not clear about the integration of the $DEV token into the Cardano ecosystem, including how it could be distributed broadly or how teams would find out about it. Given that the solution is only as good as those who use it, without this explanation then the impact is in question. ", "q0r": 4, "q1": "Yes, given the experience and plan presented, it is very likely that this proposal will be implemented successfully. \n\nAs far as the plan goes, the team will adopt the sprint development method which will allow them to work on individual pieces that are determined ahead of time and adjusted as needed. This approach will allow the team to create, test, and improve on a constant basis and have a better understanding how all the parts fit together, starting with the foundation and building to the more specific details. The outline of what will be included in the sprints seems logical and appropriate. \n\nThe team's abilities seem mostly aligned with what is needed, however, I am left desiring more information on the tokenomics, including total amount of $DEV to be minted and the distribution plan. How would projects get ahold of $DEV should they want to use it? The team appears more focused on the rewards structure, which is fine, and may need to hire outside to build the tokenomics and tools but I would have liked to see more explanation of this component. \n\nIn addition, mentioned in the impact section, I also think the team could have better explained their outreach strategy for onboarding new projects and groups to the $DEV incentivization scheme. The team requests money for marketing but there should also be an accompanying component in the plan that shows the intent and activities here. \n", "q1r": 4, "q2": "Yes, the information provided is sufficient to audit the progress and success of the proposal. \n\nThe team commits to making all sprint development updates accessible through a live document that the community can engage with. This live document will show updated progress reports, Dashboard, execution Plan by dates, a backlog, and a Grooming list. This will provide valuable insight into how the project is proceeding. \n\nI do think that the team could have done a better job at outlining their success measures. As written there isn't really a way for the community to determine whether the project was successful as the KPIs presented do not well align to the success measures. For example, the team sees success as the launch of the program and registration tracked with $DEV in the developer's accounts. However, this is very abstract and doesn't give any sort of threshold for how many developers would need to participate to be deemed successful. \nI would encourage the team to draw clearer linkages between the KPIs and success measures. For example, if the KPI are # of sprint plans (divided into 15 sprints with dates and status) then the success measure should be 100% completion of sprint plans or 15/15 sprint plans completed and presented the community. As written there is too much room for interpretation. \n\n", "q2r": 4, "assessor": "z_assessor_2233", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3128, "q0": "Without a doubt this proposal will surely drive up the adoption rate of new developers to Cardano. Developers are incentivized to learn and build on Cardano is a powerful tool. With a simple yet beautiful interface, adoption rate would increase. I believe this project will further evolve in the future and leave a footprint to build a larger developer community in the Cardano ecosystem.", "q0r": 5, "q1": "This proposal clearly breakdown the budget and timeline, and it looks reasonable and achievable. The team has a working product VEMT which gives me confident that they can implement this project with success. However, the proposal lacks the information on the risk of the project. The sustainability of the project is what worries me the most. How does the team ensure there would be enough income to sustain the reward system. The lack of information regarding the sustainability makes my stand neutral in this assessment.  ", "q1r": 3, "q2": "The proposal list a detailed budget breakdown and a clear roadmap over a timeframe of 4 months. The proposal did mentioned the use of a public live documentation to track the progress which is a plus sign. I would have score this proposal higher if there is more information regarding the target registered developers or other key indicators to quantify the success of the project. All in all, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2403", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5502, "q0": "The shortage of Cardano developers has been an everlasting problem on the chain and any action taken to ease this is doing no help. The existing developers are also leaving the chain because they are not getting the right opportunities and this also may be due to the fact that other than the proposal developers, the open-source developers working on their own time aren't getting anything in return for their participation and efforts. It has become highly important for the community to retain these developers and rewarding them is probably the best option we have in front of us. The proposer provides us a solution on a similar line of incentivizing the developers for their participation in the chain. DEV$ can be used to exchange for ADA or redeemed for prizes, NFTS, and gift cards. These tangible rewards instead of hollow words of appreciation and promises could go a long way. More time spent on chain development, more rewards, and could increase developer adoption, productivity, and creativity across the chain and would be a win-win situation for the community.", "q0r": 5, "q1": "Coming to the feasibility section of the proposal, it also seems complete in every way as the impact section is. The details provided by the author regarding their roadmap are plentiful and exquisite. The entire plan is dissected beautifully into a 4-month plan with each month's milestones being very keen and attainable. Also, the total budget of $55k looks practical considering the amount of work involved in getting the MVP completed and launched. The division of the funds is not overstated and every individual is sufficiently compensated. The team members are introduced briefly and the mix seems to bring in different flavors to the project with all their previous experiences. Several of them being co-founders of start-ups would sure know how to get the project moving at a smooth pace, and the team still has a few shoes to fill from the development perspective. With all this information in front of me, I would score a 5 out of 5, despite some small lacking as most of the other information is very promising and simple.", "q1r": 5, "q2": "The author mentions that the entire development process would be divided into 2-week sprints and the sprint details available on the dashboard would help the community track their progress. These metrics should be quite enough to keep an eye, nevertheless, other methods such as monthly reports, and regular updates on some channels of social media might have added more value to the routine assessment of the proposal as not all auditors/community members would understand the nuances of the sprint-board. Anyway, the success definition looks complete in the form of having a working MVP that can track the amount of DEX$ deposited to every developer's wallet and the MVP is a platform where the DEX$ holders could exchange it for ADA or redeem it for other rewards, gifts. The author, however, mentions this is not a continued proposal, but a completely new one, hence I as an assessor would have appreciated it if the author had provided much clearer KPIs against some of the well-laid milestones in their action plan. Hence I would restrict myself to scoring a 4 out of 5 in this section.", "q2r": 4, "assessor": "z_assessor_2704", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 6247, "q0": "This proposal seeks funding for the development of the first reward program focused on developers using Haskell/Plutus.\nThe problem is stated clearly, there is no reward for choosing to focus on Haskell and Plutus.\nThe main idea is that Projects can offer DEV$ to attract developers and will have a tool to reward them based on parameters they define (hours, goals, milestones, etc). and the principle structuring of the program is that Developers earn DEV$ Tokens at an increasing rate according to their status level and revenue amount generated to the community.\nThe voter should keep in mind that Haskell/Plutus developers are very well compensated for their work and are in constant demand and there is a problem with finding enough developers with these skills.\nThis proposal clearly being an incentivization structure for developers is clearly in line with the challenge.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer envisions as a risk to the project the limited amount of Cardano developers. The proposer states that he had discussions with Cardano developers and he knows how to balance this shortage. However a concrete path or a direction for mitigating that risk is not presented.\nThe proposer presents a detailed plan month by month and week by week. \nThe proposer presents a budget with monthly remuneration per position and the positions that needs to be filled. \nThere is only one position of 5 that is blockchain integration and tokenization, so that alleviates to a certain extent the risk mentioned above.\nThe team of 4 people is presented with their positions, expertise and linkedin profiles for additional information.\nThe proposer will return to Catalyst for further development and improvements of this solution.\nThe proposer has 4 proposals in fund 9 with a total ask of $421K. The other proposals in this fund are regarding a reward currency named FLORAS, two proposals and an AEROS Universal AirMile.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer uses weekly sprints that will be reflected in a live document that can be accessible by anyone. \nThis gives me the impression that the proposer binds the auditability milestones and timeline (not provided in the auditability section) to the plan from the feasibility section of the proposal.\nThe proposer will create a dashboard where progress will be reflected by dates and the minimum requirements will be found there.\nBacklog List will also be available.\nOver all very good plan, the only thing missing is the information how the community could access this information.\nSuccess metrics are well defined.\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2795", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"id": 12834, "q0": "This is a really great project and has tremendous potential. I believe it addresses the challenge fully. The team intends to build an interactive loyalty program that focuses on rewarding the developers. The currency of this program will be DEV$ tokens which later can be exchanged for ADA or be redeemed for prizes, NFTS and gift cards. The proposed reward system will be based on the status level of the developer and the amount of revenue generated to the community. I think such a practice will direct the attention of developers toward the Cardano Community. The main reason for my view depends on the fact that the programming languages that Cardano developers use for building smart contracts are Marlowe and Plutus both of which are either powered by Haskell or based on it. So the minimum requirement for developers in our community is to be proficient at Haskell. And this is where the problem starts. Haskell has two downsides from a developer’s perspective (including myself). First: it is really hard to learn mainly due to its terse syntax, abstractness and functional purity. Second: there is a lack of motivation among developers since the facilities of Haskell are very different from what the mainstream programming demands. This proposal addresses the second downside, since money is the greatest motivator, developers will be motivated to join the Cardano community. Finally the developers would have a good reason to deepen their knowledge in the Haskell programming language and join our community. \n\nBased on this reward scheme for developers, the value of ADA coin may increase significantly as long as developers redeem their DEV$ tokens into ADA, a simple demand supply relationship. This has also been claimed in this proposal. Apart from this there is one small thing that got my attention and I believe that team needs to revisit: The whole idea of rewarding developers based on the total revenue provided to the community seems to be a very efficient and a self-sustainable I am not convinced on how exactly is this strategy going to be implemented. Since the total revenue provided to the community is based on may variables and many different parts of the ecosystem, what would be the exact way of calculating the revenue provided only from developers?\n\nAll in all, I believe that  this proposal is very well aligned with what this challenge demands and deserves highest marks.", "q0r": 5, "q1": "The proposal clearly states all the parties that will be involved on the development of this project. Their names and a short description of their past experiences has been given as well. Additionally, the LinkedIn profiles of all involved parties are present, so we have a pretty good idea about who the team members are and what they do. After checking all of their credentials in great detail, I can conclude that they are definitely able to see this project through. The proposer has a good understanding of all things needed in order to be successful and the chosen team members seem to possess all required skills and experience. Outstanding team, they have worked for many well known companies and that projects a lot of confidence!!!  The financial split is also been given in detail, everyone involved is going to be paid 3000 USD a month and an addition 1000 USD has been required for web services. One suggestion I have for the team is to provide the amount of time that each involved member is going to spend in this project. That would really help on assessing how realistic the timeline is. Apart from that the requested funding seems really reasonable given that the team claims to deliver the MVP in 4 months. Finally, there has been provided a list of task that the team intends to complete each month for 4 months, although not in very great detail it gives a really good sense on the workload and when to expect each step to be over. So I believe this part is really good, I just suggest they provide a little more details on the teams workload and maybe provide some estimation dates on when each task will take place.", "q1r": 5, "q2": "The team has provided a clear and well designed roadmap with achievable and realistic milestones. The team suggests that all the tasks (sprints) related to the program will be shown in a live document reachable by anyone. The live document is going to have a dashboard where details can be tracked by the community (i.e. the number of hours spent on the product development). This feature is going to make the audit of the proposal extremely easy. The proposal team has provided the KPIs needed for the community to be able to check if the project is delivering what it intends. One additional feature that I believe will increase the transparency is: making regular online meetings where the progress is discussed. This may also increase the trust of community on the team. However the audiability of this project is very well designed and in my opinion it deserves maximum evaluation.", "q2r": 5, "assessor": "z_assessor_3478", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13846, "q0": "Monetary compensation for the usage of Haskell or Plutus or any Cardano technology might be a groundbreaking idea that really changes the game rules. In order to attract developers into Cardano there must be some kind of incentive. This proposal suggests that a platform can be created that would reward developers with Tokens for the different valuable actions they perform. As Tokens can only be exchanged for ADA, ADA value will increase because of the higher demand. This mechanism might be interesting for an educational program where Cardano technology students obtain rewards for their learning. This might be the cornerstone of an ambitious outreaching strategy. This reward mechanism can expand into project creating and project leading instances and will surely increase ADA dynamics and transactions. This proposal effectively addresses the challenge in which it’s submitted, as it will certainly help to improve and strengthen the Cardano Catalyst Developer Ecosystem. Catalyst's major challenge nowadays seems to be the necessity of drawing in newcomers and becoming more attractive to the developer laboring market. Monetary incentives are the missing key element, as we know, “money makes the world go round”. This groundbreaking proposal might be just what the Cardano Catalyst Community was missing. ", "q0r": 5, "q1": "\nTeam is highly experienced in developing digital products and dapps. They have more than fifteen years of experience in the field. They already know how to make this kind of digital product work. Timeline and planning are divided into 4 months of work with detailed milestones. Budget is consistent and down to earth. It might be interesting for their proposal to have a marketing and social media outreaching strategy in their key milestones as well. This is usually overlooked but it is certainly necessary to put digital products onto the market. If the product is great but it has no outreaching capacity or has really few activity, the proposal won't be successfully implemented. Nevertheless, apart from this marketing weak point, given experience and plan presented it is highly likely this proposal will be implemented successfully. \n", "q1r": 5, "q2": "Team will be sharing live documents with dashboards, sprints plan, backlog and grooming. Metrics will be specified and correctly information will be available for sharing with the Catalyst Community. A communication channel with Cardano Catalyst Community might be missing in order to correctly share the proposal progress information and hopefully the success of developer registrations and transactions. Auditability might need further development in order to be efficient and sufficient but this groundbreaking proposal surely deserves the chance of working it out as this is the first presented project of this high calibre team in Catalyst funding. ", "q2r": 4, "assessor": "z_assessor_3833", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "DEV$ is the first Reward program focused on developers. The main objective is to incentivize the participation and usage of Cardano tools like Haskell / Plutus. The more you use it the more you earn.", "experience": "We are a group of experienced Loyalty program creators with 15 years of work with airlines, gaming, and retailers. We developed white label solutions for different industries to incentivize and change behavior based on rewards. Team is composed by a Ph.D, economist & 3 engineers."}