{"id": 421674, "author": "titan", "title": "Transaction Editor post Vasil HF", "url": "https://cardano.ideascale.com/a/dtd/421674-48088", "category": 26597, "amount": 7200, "description": "The transaction editor supports the Alonzo Hard Fork yet with the newest features coming with Vasil it requires many updates.", "f6_no_assessments": 5, "f6_rating": 4.533333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 732, "q0": "The proposal is to maintain the tool that the proposer built through funding from previous rounds and update it to the Vasil hard fork, introducing some breaking changes. The tool is a swiss army knife for interacting with cardano-cli and cardano-wallet. It improves the user experience of devs when dealing with Cardano services. There is, however, no evidence that the service is used widely in the community; it has been forked once and has 9 stars. I struggle to measure the benefit to the community from an update to the tool that has not gained traction after 9 months after being first published. I would encourage the proposer to ensure there the community needs the tool before spending a lot more time on it. If the community used the tool, it could scale very well as it is installed on the user’s machine.", "q0r": 3, "q1": "The proposer provides evidence of relevant skills through GitHub repo of the project, on top of which this work will be done. The proposer also provides a link to a personal page and a youtube video explaining how the tool works. The roadmap is split into updates to cardano-cli which will take 64 hours, and updates to cardano-wallet, which will take 32 hours and the hourly rate is set at $75/h. The rate is reasonable for back-end engineering work on Cardano. There is no clear timeline provided for when the work will be executed. The proposer mentions that there had been delays in the past. I would encourage the proposer to provide a clear timeline, at least biweekly of what work will be executed and when; without this it makes it challenging to assert when the proposer will complete the project. The Vasil hard fork will go live in about 4 weeks from the date of writing (4th July); therefore the work needs to be completed ideally ahead of the go-live, and if not possible, then shortly after. The proposer highlights risks of illness from Covid or war which are reasonable concerns. Should something happen to the developer then at some point the community might pick up the work - from personal experience, this is a risk for any project and the given that the tool is open-sourced on GitHub means anyone pick it up. The languages and architecture are not discussed in detail; however given that this is an update to an existing tool, the work would be done within the same language. Given that the proposer has written the original tool then he shouldn’t have technical difficulties updating it for the Vasil hard fork. I have doubts about the timeliness given the Vasiil hard fork is imminent, and by the time the funds are approved, the Vasil hard fork will have gone live on the Mainnet.", "q1r": 3, "q2": "A roadman with the deliverables is provided and includes the hours required to deliver each section. The budget is derived from the hours allocated times the hourly rate. The proposer commits to update the code on the Github repo when the code is ready and to submit monthly reports to the community. The information on KPIs is missing. The success statement is made at a quite high level, focusing on empowering people to use their means of computing and people embracing it. I suggest the proposer focuses on adopting the tool within the community and seeks feedback on what the community values in his tools. Given the lack of KPIs and a timeline for the project, I would have a hard time auditing if the project remains on track or not", "q2r": 3, "assessor": "z_assessor_2123", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 965, "q0": "The proposal is for maintenance work on a previously Catalyst funded infrastructure tool. As someone who hasn't used it before, I was somewhat impressed by the capabilities of the Transaction Editor. It looks to be a really powerful tool that can help developers and advanced users, who regularly use the CLI easily build complicated transactions.\n\nIf its capabilities are maintained and upgraded to support the latest version of the Cardano stack, the tool might represent a powerful component in the Cardano developer's toolkit by simplifying workloads and freeing up time that was previously wasted on manually building transactions on the Command Line Interface. Because of this, the project is a very good fit for the Developer Ecosystem challenge.\n\nAs a side note, I would like to add that the proposal is very thorough at outlining the risks to the project and providing some possible solutions.", "q0r": 5, "q1": "The project implementation plan does a very good job of presenting all the steps that would be needed to complete the upgrades. It is estimated by outlining every step and calculating the execution time. I consider the work estimations to be realistic. The hourly rate of $75/h is used to calculate the budget required for the project. I find this to be very reasonable and in line with the expectations of a Western developer, below the current rate for Haskell and Plutus dev work. The proposer is the only developer on this project. The entirety of the budget is allotted to compensation for his work, which is obviously not a problem given the nature of the project. The proposer states that infrastructure costs are covered by his Fund 7 funded proposal and I appreciate the inclusion of this detail.\n\nAfter taking a look at the public GitHub repo of the Cardano Transaction Editor project developed for a Catalyst Fund 7 funded project, and after reviewing the proposer’s website and credentials I am confident that the proposer will be able to deliver the upgrade that is the scope of this proposal.\n\nThis is one of the very few proposals that actually took the time to answer the two new project workload questions introduced in Fund 9. The proposer provided all the details requested in the proposal submission form and presents a realistic plan on how he will deal with the additional workload. I consider this to be additional proof of the developer’s meticulous nature and commitment to the process.", "q1r": 5, "q2": "The auditing plan is based on the implementation plan, so it will be easy to follow. The community will be able to examine and audit the available public code in a GitHub repository. The developer plans to release his work under an open-source license which is very relevant in the case of this project. In addition to the code, the developer mentions that he will be releasing explanatory videos to present the usage of the Transaction Editor tool.\n\nThe proposal states that the goal of the proposer is to make his software available and used by as many people as possible, which is a sentiment I appreciate and is very much in line with the goals of this challenge.\n\nMy assessment of the proposal is anchored in my ongoing experience as a project manager working with Cardano developers since July 2021. I have participated in almost all roles in Project Catalyst since February 2021 and I am myself a funded proposer. I’ve also been involved with the Cardano development and NFT communities for about a year and a half.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3557, "q0": "The proposals will accomodate the changes to the transaction edditor necessary for the Vasil Hard Fork. As the authors state, this is mostly maintenance work, but it's important nontheless. Relatively to the rest of the budget for the whole challenge, this is a really small price to pay, especially for maintenance of an already developed and used product.\nIt's sure to bring value to the cardanofl ecosystem as it has already done. I've personaly used it and can say it's very helpful for all developers. It's in line with the challenge settings and will continue to be a positive change for the cardano ecosystem as it's stated in the about info.\nThe proposal doesn't need to add too much explanation of how it will add value, because it's already been doing it for some time now, but the author has mentioned the pros even so which is really nice. It allows the automation of scripts, which is one of the greatest benefits for developers. It's ofcourse usefull to just enable transaction browsing, but scripts enable automization.\nHaving a single developer might be a risk as the author states, but still I think he'll have no problems. Ofcourse it's nice to think about growin a community.\nOverall a decent proposal with fair impact.\n", "q0r": 5, "q1": "I managed to verify the listed skills an credentials with a bit of googling and following the provided links, so I'm sure the developer has all the necessary skills to bring this project to it's eventual suscces. I really do like the prospect of forming a community aroung this, because it's worth it for sure.\nThe given roadmap is concrete and detailed enough and considering the given timeframe it's a perfectly reasonable proposal.\nThere is a budet breakdown that's given in the standard hours given and a hourly rate, and it's reasonable.\nThe proposer has previous work done from funds past and has already completed or still working on some of them, but it shows he's a valuable and active member of the community. I do appreciate when someone leaves the github repository because it's really better for me as a developer to assess the code, becuase it's speaks to me more than words, and moreover the code doesn lie so that's always nice.\nThe proposer has described in detail what changes need to be done, so I agree with all of them. Let me mention again that the cost per value ratio is really good and that should be an argument for voting for it.\nOverall this is more than a feasible proposal, it's necessary and I'm sure a community will form around this in the future.", "q1r": 5, "q2": "There's a github repository, which usually is enough for me to say that the project is auditable. The deliverables section is good enough to use in combination with the github repository to track all the progress of this proposal.\nThere's a clear problem - the upcomming vasil hardfork and the solution are some known changes that should happen in the transaction edditor. Considering the proposer is the creator of the editor there should be no issue.\nOverall a great and auditable proposal with decent metrics and I really like the success definition, because I really do agree that the most important success factor is a community to form around the transaction editor.", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4222, "q0": "The \"transaction editor post Vasil HF\" proposal addresses the Developer ecosystem by providing a maintenance work (changes in behavior, outputs and features arriving with the new cardano-node for the hardfork era. The transaction editor provides a powerful user interface to work with complex transactions for Cardano. This will allow the latest features for token minting, burning and its metadata format. The transaction editor is very useful for developers in handling transaction crafting (especially the complex ones) as the developers can construct automating for recurring transaction types. The proposal facilitates the work of developers in Cardano and hence fits the challenge very well. There is no evident risk as the code is open source. The technicality is also not an issue as the proposer is familiar with the transaction editor and already testing the Vasil-devnet and need this upgrade nonetheless. ", "q0r": 5, "q1": "The proposer has subdivided this update package into 2 updates: updates around cardano-cli (64 hours) and updates around cardano-wallet (32 hours) along with writing documentation, update the progress feed on cardano forum and releasing showcase video. The proposers is very transparent on his previous funded project and already completed his project in fund 7. This proposal is one of his 2 proposals in fund 9. His pay rate is $75/hour. He also provided his GitHub and personal website. He has detailed the milestone for these 2 updates. The proposer has previously mentioned about virtually no risk for his project. It is very likely that the proposer can complete the project successfully.", "q1r": 5, "q2": "The project is easy for the community to track the updates as he explain in detail of his deliverables. The software is also open source and available in the well known code repository GitHub. He has provided a working demo in his youtube channel and progress can also be measured via the report. It is great that the proposers work on updates for his funded proposal. The transaction editor works with a full cardano-node despite how convenient the web-wallet is as light clients. The proposer understands the necessity to update the transaction editor after the Vasil hardfork and working extensively on transaction editor. He keeps his code open source and promote the practice of developing with and for this text editor. The community can easily audit this project to see if it successfully completes as he expected to finish this project before the fund 9 rewards. ", "q2r": 5, "assessor": "z_assessor_2525", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 15321, "q0": "IMPACT\nThe proposal is a continuation from the F7 funded and delivered proposal Transaction Editor and Wallet. In this case it is to add the needed adaptations so the editor works with the Vasil HF.\nAs this is a tool that is aim and intended to easy the work being done by developers and other technical people in Cardano, it is clearly aligned with the Challenge objectives.\nSo I strongly agree the proposal aligns with those objectives.", "q0r": 5, "q1": "\nFEASIBILITY\nThe timeline is detailed enough and it does have the estimated effort divided in to main categories of functions to be delivered, with a total of 96hs.\nIt would've been great to estimate not only the effort but rather the estimated timeframe in which this proposal could be delivered. The proposer did include a comment that as this is not the only proposal he will be working on, if funded in F9, those efforts compund and will take more than 2 weeks. But still I think the timeframe is a key info that any proposal shall provide.\nThe team is composed of 1 individual, Oscar, that has enough credentials, experience and proven delivered projects to assess he is fully capable to deliver what is being promised.\nThe budget is based on a value x hour, of 75 USD times 96 hs. totalizing USD 7200, which is OK for this type of development.\nWith that I strongly agree the project will be delivered on intention.\n", "q1r": 5, "q2": "\nAUDITABILITY\nThe proposal indicates that the progress can be audited by following the public changes on the github repository, as this is an open source project, also by the monthly progress reports reported to Catalyst. But there are no outcome provided metrics, that are key to measure the value and impact being delivered, such as amount of downloads, forks, usage of the tool by the community.\nFor that reasons, I do agree the community will be able to track this project.", "q2r": 4, "assessor": "z_assessor_2398", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "This is mostly a maintenance work. But the Transaction editor needs to incorporate the changes in behavior, outputs and features arriving with the new cardano-node for the hardfork era.", "experience": "I'm the author and developer of the Cardano transaction editor a Catalyst Fund 7 funded and completed project."}