{"id": 421769, "author": "hotspringfinder", "title": "Flutter SDK", "url": "https://cardano.ideascale.com/a/dtd/421769-48088", "category": 26597, "amount": 15000, "description": "Flutter is the fastest growing mobile app developer community but currently there's no Flutter library support in the Cardano ecosystem.", "f6_no_assessments": 8, "f6_rating": 4.791666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 80, "q0": "- Flutter SDK project with slow but steady development created by a single developer.\n- Recurring project since fund 5, 7 and 8 => we can see the progress in the GitHub and the demo app provided.\n- Low budget ($15k) proposal with very high impact: A single SDK for Flutter does target all the major platforms in the same go (web. desktop, mobile, Apple, Android and GNU/Linux) which means that a developer can use Flutter to write a single code base for ALL platforms at the same time. This is a killer advantage and a must for Cardano. As a developer myself I'll definitely consider Flutter and Dart the next time I'll have to write an app on mobile because the most annoying thing for a developer is to have to maintain the same code across different platforms, or worse depend on another developer for a specific platform...\n- This proposal is perfectly aligned with this challenge’s goals as it will provide a new means for developers to very easily develop on Cardano's blockchain with the unique advantage of simplified interoperability. This alone can tip the balance in favor of Cardano when having to choose a blockchain development platform due to the important savings realized in having to maintain a single code base compatible with all platforms at the same time...", "q0r": 5, "q1": "- Proven experience available through GitHub and the dev is a Plutus Pioneer (single developer).\n- Slow but steady delivery.\n- Recurring project, no surprise apart from the proposer spending way more time than anticipated. This small but recurring funding allows him to continue.\n- A code audit is mentioned as part of the future plans (which is really a requirement when it comes to app managing funds and dealing with cryptographic primitives in general). The project still being in active development the audit can wait but it should be done as soon as it begin to make sense (in a different proposal to prevent blowing up the budget and keep the low budget recurring nature of the project intact)\n", "q1r": 5, "q2": "Audit can be done through:\n- # of commits, issues filed, forks, etc... (GitHub metrics)\n- Various usage metrics on pub.dev (flutter package management website)\n- The demo application + video provided already.\n\nThis is a low risk project with very high yield potential which has already delivered some of its promises.\n", "q2r": 5, "assessor": "z_assessor_2044", "no_vca": 18, "ne": 2, "ng": 16, "nfo": 0, "vca_o": 1}, {"id": 735, "q0": "The proposer correctly identifies the lack of a mobile SDK to develop mobile apps on Cardano. As a developer of a project myself, I searched for a mobile SDK  and after I didn't find one I decided to code everything up in React Native.  A mobile SDK would bring new developers into the Cardano ecosystem, knowing that they can develop mobile apps that leverage the Cardano blockchain. It would also improve the developer experience for existing developers on Cardano by saving them time on the basics. The SDK will be open-sourced and for anyone to use, therefore the deliverable scales well. The proposer has taken the approach of asking for small funding amounts to incrementally improve the Flutter SDK and plans to come back for additional funding in future funding rounds.  There have been a number of mobile apps developed on Cardano, such as Flint, Minswap, CCVault, but they have remained closed source. An SDK would give a boost to mobile app development on Cardano and I think it aligns very well with the challenge setting.", "q0r": 5, "q1": "The Proposal provides links to social media accounts, and GitHub repos end the video explaining how the SDK operates. A short Bio is included, which informs the reader that Richard has more than 30 years of experience in Java and mobile development and is also a Plutus Pioneer from the 3rd cohort. It is evident that Richard is a very experienced developer in the mobile field and has the right skill set to deliver this proposal. Richard will be the sole developer on the projects.  The budget is detailed with hours per task provided; covers things such as Smart contract development, fixing bugs, providing Community Support and investigating alternative backend adapters. The budget is set at $15,000 and covers 300 hours of work which works out to $50 an hour. This is a very competitive rate for a mobile developer with blockchain skills in the US.  The average rate of proposals that I have reviewed so far (30+ proposals) has been around $70 an hour. The timetable is realistic as there is a specific allocation of hours per task. Richard explains the technical aspects of the project in great detail and includes background information on what Flutter is, and also describes things that he learned from previous funding rounds, which is always nice to see. Richard describes two main risks to the project; the first one is the challenge of implementing Haskell off-chain smart contract support in the SDK.  I recommend that Richard looks at the cardano-serialization-lib, which is a helpful library for generating off-chain transactions. The second risk is that the Cardano official light wallet, Lace, will be released soon. However, Lace is not suited for stand-alone clients; therefore, the SDK is still relevant for developers that need to embed wallet functionality into their apps. With a detailed plan and good alignment between required and available skills, I think Richard will be able to deliver a quality product.", "q1r": 5, "q2": "Yes, Richard provides the link to the repository where the open-source will be uploaded and where the popularity rating can be tracked. Richard will track likes, bugs reports and pull requests to measure user engagement.  The key metric of success is that many users use the SDK. No social media communication channels are provided.  There are also no suggestions of providing a regular update to the Cardano community.  I would encourage Richard to provide a little more detail in the auditability section next time. Overall, I think there's an objective deliverable, and progress can be measured through Github repos.", "q2r": 4, "assessor": "z_assessor_2123", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4956, "q0": "The proposal aims to continue the development on Flutter SDK, bringing Flutter to Cardano. Flutter is a cross-platform mobile development environment that makes developing mobile applications easy. Cardano applications on mobile is non-existant to my knowledge, so an easy to use SDK for Flutter would be great for the developer ecosystem, opening the way for great applications on mobile. It will also attract Flutter devs to come onboard Cardano, granting Cardano an edge against other blockchains. The proposer has also thought about community support and feature requests for the SDK, which directly correlates with the challenge metric of community and conversations. ", "q0r": 5, "q1": "Development on this project has been going on since Fund 5. The git repository has been in development for the past 14 months. The proposer has been coming back to Catalyst to continue the funding of the project. At this stage, I would have liked to see the SDK is being used by others, or at least a mention by the developer if it's being used at all. Diving deep into the scoring system of the Flutter library at pub.dev I found that it was actually being used. The popularity metric for the library was at 47% when I reviewed. This means the project is in the middle of the pack in terms of use in the last 60 days. Not bad. It shows at least someone is using the library. Hopefully this metric ticks up in the next few months. \n\nI am a backend developer, so I'm only barely familiar with the technology being developed in this proposal. To me, it seems 14 months to develop a SDK is too long, though I'll have to say I have never developed an SDK myself and have no basis for such an estimation. From the git repository, we see development is actively progressing and the proposer says with this fund we'll reach a stable 1.0 release. So I'll give the benefit of the doubt to the proposer here and say this is entirely feasible. If at the next fund we don't see a stable 1.0 release, then this proposer has lost my trust. It shouldn't take 18+ months to develop an SDK. \n\n", "q1r": 5, "q2": "The main metric to measure for progress is the popularity metric for the SDK library at pub.dev, where the library is hosted. This is as good a metric as it gets, it tells us how popular the library is compared to all other libraries at pub.dev. A short description and discussion by the proposer on where that metric has been in the past, and where it is now would be great. Considering the same proposal has been given since Fund 5, this information would validate progress. \n\nThe single missing piece in this proposal is related to success. This is all the info the proposer has provided on the topic: \"Many users of the SDK as reflected in likes on github and pub.dev.\". I'd like to see this defined better. Again, since this proposal is a continuing one, this information should already have been collected at previous rounds. So putting that information on the proposal to define success for future rounds would be a good idea. ", "q2r": 4, "assessor": "z_assessor_2643", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5282, "q0": "The proposal is about creating the Flutter SDK (off-chain library). This will be written in Dart which make the complex cryptographic code work seamlessly on all platforms: mobile, desktop and web. Flutter is a very well known cross platform mobile development environment. If the project is completed successfully, new users will use these Flutter SDK in their projects and bring more people from flutter community to Cardano. As such, this proposal fits the challenge Developer ecosystem very well.  The proposer has mentioned the risk of lack of time and the alternative SDKs (Lace) but he also can mitigate those risks. ", "q0r": 5, "q1": "The proposer provides the high-level timeline as he will have his project in fund 7 completed by December 2022. He projects the timeline for this project to finish in June next year after delivering his prosposal in fund 8. There is a fund 9 task breakdown (50 hour block represent $2500 of work/ 300 hours of work) The proposer has provided more than sufficient data on the tasks -smart contracts, bug fixes/upgrades, community feature requests, community support, tutorial and alternate backend support. The proposer might add his online profile next time. However, since he is a previous funded proposer and he has already learnt his lessons from fund 6, 7 and 8 to deliver the project successfully. ", "q1r": 5, "q2": "The flutter SDK proposal usage is the success of this project.  How widely the flutter SDK is in use or not can be monitored on GitHub and pub.dev The popular rating on pub.dev will be the primary metric. After the first beta release of flutter SDK, there should be more new users starting to leverage SDK  in their projects. The community can track project progress also on the bi-weekly meetings and report. He also provides information on the status of his projects so far from fund 5 to fund 10. ", "q2r": 5, "assessor": "z_assessor_2684", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6081, "q0": "Flutter is an easy-to-use cross-platform app development framework used by 500,000 developers monthly. This ongoing project to build a \"Cardano SDK\" as open source has the potential to expand the developer ecosystem effectively by reaching some its approximately 2 million web app developers who like to build dApps on the Cardano blockchain. This is a really nice direction for the Developer Ecosystem, as it is much more inclusive (meaning reaching a wide global community) and expansive (meaning growing faster) than some of the very niche, blockchain-centric tooling we see being proposed here. The gradual growth and meticulous documentation since the beginning are impressive and I believe if it keeps going for long enough, this project has the potential to be a bit of a game changer for ecosystem growth. ", "q0r": 5, "q1": "Richard's Flutter SDK was funded in Fund-5 for a \"bare bones\"/pre-UI version with 10k, failed in its request for 30k to complete the library, publish tutorials and support the budding community, and came back in Fund-7 with two proposals splitting the further development into two parts of 15k each, which both got funded. Throughout this process, he has shared all code on Github and been very transparent about the scope and working hours for each milestone and different funding request. It is nice to see the project taking shape, having a working UI and integrating smart contracts. This is a great example of a down to earth, honest to God, developer project that grows gradually, fills a need and produces verifiable content along the way. The scope of the Fund-9 funding request is for for support, additional user-requested features, bug fixes and more documentation and tutorials. Given the delivery track record and excellent documentation so far, this is highly likely to be delivered successfully.", "q1r": 5, "q2": "Although this proposal is among the shorter, more readable ones, it has all the information one could ask for. There is a Github repository updating the open source work of this project in \"real time\", the proposer contributes to the Flutter documentation, and has video tutorials. The timeline and working hours budget, organized nicely along milestones, is extremely transparent, and there is currently a lot of back-and-forth with the community about incorporating user requests and feedback. This information makes it very easy to track and audit the progress, understand the costs, risks and journey as a whole. It is fantastic to see this kind of \"keep it simple, stupid\" adhered to while maintaining the highest standard of technical detail and documentation.", "q2r": 5, "assessor": "z_assessor_2781", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 8419, "q0": "This project is very interesting, because it will provide the flutter SDK to support the cardano ecosystem. Proposer has started to apply for funds since fund5 till now and all are successful except fund6. The description in the proposal is similar to the previous proposal except that additional goals for the fund9 are also explained. This proposal is for improvements to all previous Flutter SDK developments.", "q0r": 5, "q1": "The timeline is very clear with an explanation that the prototype made on fund5 has been running and has been proven to work. The proposer also indicated the target completion time of the funds obtained from fund7, fund8 and hopefully they can receive more from this fund9 so that the tutorial on how to use the flutter SDK can be used and get support from the community. The funds received will certainly make the developer focus on implementing this project. Hopefully.", "q1r": 5, "q2": "I think the explanation with the github url and others sent by the proposer has explained a lot about the progress that has been made and the successful implementation of this project. But it's best not only to look for likes, but how many people use it and open up discussion space for technical support for SDK users.", "q2r": 4, "assessor": "z_assessor_2982", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8707, "q0": "This proposal is a call for funding for the continued development of a product that is in the works and has already had many prototypes released. Successful fundraising in previous Funds shows that this project is trustworthy and it is really effective in helping developers save effort when creating their Dapps, creating a great experience for them to further boost their productivity and contribute to the Cardano blockchain. To reduce the barrier for non-technical people, the author has an in-depth technical analysis of Flutter SDK, how cross-platform compatibility and other strengths will facilitate developers in the process of creating Dapps, smart contracts. Risks and mitigation measures are also fully covered.", "q0r": 5, "q1": "The work experience and expertise to execute this project well have been verified through previously completed versions of the main product and successful fundraising multiple times in previous funds. For the purpose of improving and completing the main product based on the pre-existing design framework, the project development roadmap is simply for the community to determine the completion time and release the upcoming version. The budget table is very well described, the direction of the cash flow is clear, and we can know exactly what tasks will be carried out and how long it will take to do them. However, because of the lack of cost allocations for each category/task, this budget sheet is more of a project development roadmap than a budget analysis plan.", "q1r": 4, "q2": "Compared to proposals in previous funds, the proponent's success metric is progressive and ideal, alongside the popularity rating on https://pub.dev/ packages/cardano_wallet_sdk, user experience feedback will also be one of the bases for evaluating the success of the project. However, if the proponent had previously had specific estimates for their KPIs (https://pub.dev/packages/cardano_wallet_sdk exceeded 40), in this proposal the target for the KPI is still quite vague. The plus point is that the tool for providing project acceptance reports to the community is presented through GitHub.", "q2r": 4, "assessor": "z_assessor_2996", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8936, "q0": "As we know flutter is one of the most used programming languages by the application developers, to integrate the flutter with cardano some libraries are needed, so that it can make developer's task easy and help in program smoothly, hence to counter that the proposer has been building this project since fund 5 and has already built a beta version in last proposal , so he wants to release 1.0 stable release ,so that people can use it and report any bugs , so that he can fix the bugs, Hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "Building libraries for any programming languages will never be a easy task to achieve, but however the proposer's team has been working on this project since fund 5 and has successfully delivered target 3 times, the proposer's team has already released the beta version of this project last time, and delivering 1.0 release, community support, tutorials will never be difficult task to achieve for such a team, the team has adopted slow and steady state so that , they can release the product in slow manner with minimal bugs, Hence with proven experience and Given experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The audit has clear goal to produce stable version of libraries of cardano to flutter programming language and provide tutorials over it, the audit has even provided the details of proven experience of the project from previous funding, audit has mentioned their adoption style as slow and steady from the previous project.\nThe audit has provided simple timeline structured for the project, it even contains detailed budget breaking scheme to make the project still more successful , Hence with proven experience from the past The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}], "solution": "Open-source Flutter SDK - Support ongoing work to add smart contract features, APIs, data structures, tutorials and community requested features. Slow but steady funding model: $15K/fund.", "experience": "Fund 5, Fund 7 and Fund 8 Recipient\n4 years Flutter/Dart\n10 years iOS/Android\n25 years Server-side Java\n6 years tooling/code generation\nPlutus Pioneers 3rd Cohort"}