{"id": 421873, "author": "harveypham", "title": "Cardano Node on AWS - Quick Start", "url": "https://cardano.ideascale.com/a/dtd/421873-48088", "category": 26597, "amount": 16580, "description": "A lot of individuals and organizations want to build a Cardano node themselves, but the problem is creating services, apps on AWS as network, server, security, and alert system, making the system HA.", "f6_no_assessments": 8, "f6_rating": 4.541666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 740, "q0": "Yes, the proposer identified a problem with spinning-up Cardano nodes on Amazon Web Services (AWS). New developers wanting to develop applications on Cardano often needs to launch a Cardano node and various service on top of it to build their application.  This can be a daunting prospect if they are new to Cardano. As a stake pool operator, I can say that spin up a Cardano node first time on the cloud, such as Amazon web services or Google Cloud, can take anywhere between 2 and 5 days. A template that lets developers launch a pre-configures Cardano node will be very useful for new developers to Cardano. Existing developers would also benefit, particularly those who currently rely on centralized services and are thinking of launching their own node. The templates will be created and made available for anyone to use on AWS; therefore, it scales very well. I think this is a useful service, and I would give it a try if I had to use AWS to run my Cardano node there.", "q0r": 5, "q1": "Yes, The proposers identify themselves and provide links to social media accounts and Linkedin. There are 4 proposer and one of them (Cuong) is a Cardano Ambassador and a Stake pool operator and another one (Harvey) is a certified Amazon web services professional.  This is the right skill set to deliver the projects. The proposers provide a detailed plan on the steps needed to deliver the project and size the budget as the number of hours needed for each step, times the $4k monthly salary of a Senior Solutions architect.  The project timeline is 3 months and the total budget is $16,000. The execution plan is detailed over 23 steps. The risk highlighted is the cost of running an Amazon web services server which is relatively high compared to the Industry average but provides high reliability. This cost can be reduced by applying saving plans that give discounts. Given the team’s background, which includes a Stake pool operator and a certified professional of AWS I think they can deliver the project to a high standard.", "q1r": 5, "q2": "Yes, The proposal provides objective KPI add metrics that focus on what will be delivered at the end of each month. Success would be measured as delivery of a template that will spawn the entire Cardano node infrastructure following best practices that ensure a stable and controlled Cardano node running on AWS. There is a large Cardano community in Vietnam that currently runs their Cardano nodes on AWS and would adopt this template once it is delivered.  Given the details plan, the experience of the team, and the fact that there's a target public who would use the deliverable, I think the community will be able to audit the proposal effectively.", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1, "reply": "Thank you, bro!"}, {"id": 2879, "q0": "The submitted proposal is considered an innovative solution as large scale users (organizations) might operate a Cardnao node on AWS. From the challenge “Developer Ecosystem” information, the project has addressed the potential directions of developer productivity and support-incentive structures. Speaking of impact, the project could potentially increase scalability as AWS supports Cardano node, therefore potentially extending developers ability to optimize their work. From the depicted diagram in the description section, it’s true that for the traditional setup process there exists  the limitation of resource consumption and complexity. Contrary to the point, with the utilization of CloudFormation (templace) the process has been cut down to only 3 stages (compared to 8). The architect diagram has illustrated the fault tolerance system of the model with the integration of AWS implemented tools and backup strategy for the server. From the two points, it’s quite obvious for the project  to reach the goal of simplifying the node operation process : the project managed to create a tool for users, featuring clean up for the infrastructure (when no longer in use). The project is considered safe as the only risk they have to encounter is the service cost from AWS, however they’ve also resolved the problem by utilizing the pricing plan. ", "q0r": 5, "q1": "The work scope is clearly written as they also specify demand total working hours for activities. Therefore there is transparency for the salary section of all fields (project management, resources). Speaking of technical background the team is considered qualified as proven in their profiles, the team has also held important positions in the Cardano community in Vietnam (Ambassador, Group admin). Condition for the project to return to Catalyst is also identified with the mission of spreading the work for developers or helping them to develop ideas. ", "q1r": 5, "q2": "For the auditability section of the work, it’s highly appreciated that the project specified each header tasks with stamped timelines and being transparent of publishing the progress to the public. The project well defined the success of the project and emphasized the needs of the community. ", "q2r": 5, "assessor": "z_assessor_2356", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you, bro!"}, {"id": 5301, "q0": "This proposal targets would-be node- and stake pool operators to deploy more easily and quickly using AWS CloudFormation. The project plans to create a template, modules and documentation. This is not how the proposers who are SPOs currently operate, so the research and implementation will have to go through the entire setup, assess feasibility and best practices and then provide the documentation for its intended users. This is great and should indeed result in a more decentralized and robust network by allowing more parties to operate Cardano nodes. I therefore agree that this proposal is likely to have positive impact for Cardano. It does not directly contribute to the challenge setting directions, i.e. tooling for devs, developer environment or incentives, or lead to increased developer adoption, productivity, or creativity. Overreliance on big cloud resources like AWS could have been discussed in the proposal. Apart from that, this is a proposal with potentially high positive impact that will bring new people to operate nodes and could free up time of existing teams to work on forward-looking projects.\nIt is nice to see that the project will be published as open source.", "q0r": 4, "q1": "The proposers have been active on Cardano and Catalyst and have an impressive portfolio of resources about our ecosystem for the Vietnamese community. The four team members span a wide range of relevant skills, like SPO operations, devops, marketing, and demonstrate the deep knowledge required to research, deploy and document the implementation successfully. Their portfolio of funded proposals and existing websites are an asset for Cardano in Vietnam and provide a solid reference for this proposal.\n\nThe timeline and budget breakdown provided appear to be thorough and realistic, and everything will be published on Github as open source after about four months. I consider it highly likely that the project will be implemented successfully. ", "q1r": 5, "q2": "The detailed timeline and short implementation period combined with open source documentation will enable sufficient auditing and give the community access to this resource early on. Most of the criteria provided for assessing whether the proposal will be on track for successful implementation are rather qualitative, and it would have made this proposal even easier to audit had we been provided with more quantitative goals or performance metrics. A discussion of cost control measures, such as the many promotions and rebates available at AWS, would have been beneficial for this proposal. Overall a well-presented proposal that has clear goals and high transparency from well-known and well-respected members of the community.", "q2r": 5, "assessor": "z_assessor_2687", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you, bro!"}, {"id": 5531, "q0": "Blockchain technology is getting attention from all kinds of people thanks to its growing influence over technology and economics. Crypto currencies is easily one of the most important aspect for these new users. Many people just trade but there are some people who are interested in wallets, crypto nodes and staking pools. Moreover there is a certain availability in the market for many node operators. \n\nThis proposal aims to help the people exactly for this purpose. Right now, to setup a server you do not need any hardware, you can just use Amazon Web Services. Using AWS also requires know-how. With the help of this team’s product anyone can use AWS to create a Cardano node. In my daily works I use AWS a lot and I loved to see such a good implementation for Cardano. Their solution is explained with a diagram but I have problem with one aspect of it. Diagram shows that ‘Deploying a Cardano Node’ is a responsibility for user and not their solution. However, rest of the proposal, especially planning part, mentions node deploying as part of their work plan. When I started reading the proposal I was about to close it without an assessment since it was not about Cardano. They should have made this clearer from the beginning. If you are using a visual aid, that should accentuate the most important parts. After saying this, I should also mention that they have planned the project to create to different availability zones to make the whole system as High Availability system which is very positive in my opinion.\n\nThe proposal is a great solution for the challenge setting. Such a system can help Cardano to get attention and users from many different developer communities. Their description of this part is also very good. For the risks part they are aware that AWS is more expensive that their counterpart solutions with a direct ratio to its security and quality. They have also thought of a plan to decrease this cost but they could have prepared (or planned to prepare) a documentation listing AWS’s advantages over other solutions. After all their target market may not have ideas about these differences and should be informed about them. In my opinion, the proposal did not give much thought about the possible risks.", "q0r": 3, "q1": "They have detailed the key milestones and planning clearly. However, I believe they made an error while detailing the timeline. There are work hours present for each of their activities but they failed to mention how long each of this will take. For example, they specified a work plan called ‘Setup Notification’ which will be 32 hours in total. But there is no information about their planning for the actual time span that this will take them to complete. It might take a few days with multiple people and tight time or a few weeks with less people. Without specifying this it is hard to determine the project’s feasibility.\n\nBudget is also detailed but I have to say the same things that I have said about the timeline. For a Senior Architect, they have prepared a budget for 3 months but without a timeline and seeing how long they will actually work, it is not possible to make a comment whether that is suitable or not. Another thing is they have given a cost for AWS but there is no detail or breakdown for that service. AWS pricing is always changing with how the resources are used. Without a detailed explanation of this, this cost is also impossible to evaluate.\n\nThe team and their overall experience looks solid. After checking their profiles and previous works I can safely say that they are capable of making this project happen. Also it is good that they have high regards for Catalyst project and trying to be helpful to new users and developers in the Cardano ecosystem.", "q1r": 3, "q2": "All the goals are in place and all the key points, which have been set in the planning, all have a completion time. As I have mentioned previously since they did not give any specific timeline for these points, listing this timetable is left hanging in air. There is no basis or explanation for these. Not giving an information or omitting it makes the flow of the proposal not working. \n\nAt the end of their project, they are planning to release the source code as open source. Which is a great way showing that they will be making their project more accessible. This open source can also be implemented some other developers in other projects, which is also a coinciding factor with the challenge setting. They also mention a documentation for the entirety of their system. This document should be top notch and very easy to follow. It is the same thing as my comments in the risks part. Target audience may have very little knowledge about what they want to do. Such a documentation should be very clear with much details so that everybody can understand it easily.", "q2r": 4, "assessor": "z_assessor_2711", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for your assessment, to track the timeline based on the scope of work, the team will public project management tools like Trello, Asana, or GitHub... and attach them directly to the GitHub of the project. The pricing of EC2 on AWS will change small (almost will cheaper after several years), and you know, the team will propose a multi-pricing model to give users better pricing. Thank bro."}, {"id": 8941, "q0": "There are many  individuals and organizations  who wants to build Cardano node themselves, but many are not aware on how to use these AWS cloud facilities effectively so that their project can becoming more effective and cost efficient, Hence to overcome such scenario the proposer team wants to set up CloudFormation to set up the infrastructure , and modularize the sources so that it will be easier to be inherited and can be extended later on. with set up provided people can create apps over the infrastructure  created, and user can even delete entire stacks on non requirement of services which will be flexible to use for the user, Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The presented task is moderate to achieve where setting up a flexible infrastructure over AWS is not easy to achieve , Since the team consists of SPOs, member of the Plutus Pioneer Program, DevOps Engineer, and Cloud Solution Architect, with integration knowledge of all members that the task can be achieved, the proposer infrastructure tool will not be helpful for new startup it will be helpful  to even experienced workers where they can easily search template of the tools, which helps in conserving time while working , with the idea of flexible infrastructure over the server and consisting of members with Given experience, plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The audit has provided clear goal in the proposed solution on how to build a flexible infrastructure over AWS so that , onboarded members can create run Apps over it and can even delete entire stacks if they dont need services any more, the audit has even provided the experience of the people who will be involving in the project and their expertise field in building or deploying over the server.\nThe audit contains detailed budget breaking scheme which includes cloud charges for their infrastructure, it has even detailed timeline to complete the project, with a great goal to help the onboarding developers, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1, "reply": "Thank you, bro!"}, {"id": 9632, "q0": "Cloud Formation is a file that saves your cloud infrastructure configuration (network, server, firewall, internet connection, etc.) and helps you deploy this infrastructure on the AWS cloud with just a few clicks. Creating a Cloud Formation template saves developers and stake pool operators a lot of time when they want to deploy Cardano nodes in the AWS cloud. When the Cloud Formation template is designed following AWS best practices, it also makes the nodes more secure and able to recover faster in the event of a failure. Therefore, I rate this proposal 5 stars because it effectively addresses the challenge.", "q0r": 5, "q1": "The team consists of 4 people, including 2 Solution Architects / DevOps engineers. Especially Harvey has an AWS Certified DevOps Engineer Professional certification so I can be sure that the team is qualified to carry out this project.\n\nThe budget is explained pretty well, but it doesn't make sense to me to spend $12,000 to pay Senior Solution Architect within 3 months to complete the project. As a developer who has used AWS daily for 3 years, I fully understand what to do and how to do it to build a Cloud Formation. For a certified Solution Architect / DevOps Engineer it only takes 1 month to build a Cloud Formation template, including system performance monitoring and alerting services as well. The time it takes to design the Cloud Formation template can even be shortened by referring to the existing templates already available on AWS. So extending the project to 3 months is not realistic for me, that's why I gave this proposal 3 stars for its feasibility.\n\nIn terms of technical aspects, the project has presented the architecture of the cloud formation, which consists of 2 Availability Zones, 2 core nodes, and 2 relay nodes. That is a good sign that the team knows what to do and how to do it.", "q1r": 3, "q2": "The project has a roadmap with clear milestones. The information given is enough for the community to monitor the progress and success of the project. Cloud Formation template will be published to GitHub by the team as open source so the community can verify it themselves. In addition, developers and DevOps engineers can test the infrastructure using the project's template to check the results.", "q2r": 5, "assessor": "z_assessor_3068", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for your assessment, the total effort to create the CF template took more time because the team uses more parameters to be flexible, testing with the multi-pricing model, and easy to update later and keep simple for customers. My team will try to deliver faster and still ensure the project's quality. Thank again, bro!"}, {"id": 10912, "q0": "The author of this suggestion has proposed to provide a CloudFormation template that generates all instances needed for Cardano primitive deployments in an AWS environment. Currently, it is possible to deploy Cardano node on AWS, but it requires manually setting up multiple EC2 instances and configuring them correctly. This approach can help developers to implement a node in a fast and secure way.", "q0r": 5, "q1": "The team is capable of implementing the proposal. All members have a high level of experience and technical skills. This information can be verified since each member has a link to their github, linkedin and social networks.\n\nThe action plan is presented in the form of a table. It presents the activity and the number of hours required to complete it. I miss a more in-depth explanation of each activity.\n\nThe total budget is $16,580. It is well detailed, it includes salaries at $4,000 per month (it may seem high but they are professionals in the sector), costs in AWS and Project Management.", "q1r": 4, "q2": "Audibility is quite good and complete. The team proposes some ways of tracing the success of their project, such that after 1 month it would be “Documentation for Solution and Architecture Complete + Cloud formation in the cloud to create network (VPC/ Subnet/ TGW…)”. I really like these partial goals, they are very practical and serve as a bridge between what was planned and the final result. It is important that during these periods there is also a constant dialogue with the Cardano community.", "q2r": 5, "assessor": "z_assessor_3205", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you, bro!"}, {"id": 13511, "q0": "The proposal aims to use CloudFormation to set up the infrastructure. In fact, there are now a lot of individuals and organizations that want to build a Cardano node themselves, but the problem is creating services and apps on AWS as network, server, security, and alert systems, making the system HA... requires time, finance, and certain technological knowledge. However, with the use of CloudFormation, users do not need to know about AWS services. All they need to do is manage the applications inside the servers. This will make it easier for developers to create nodes, increasing the number of active nodes on Cardano.\n\nIn the detailed description of the proposal, the team outlined the difference between creating a Cardano Node with templates and without a template. Accordingly, customers/developers have reduced 1/3 of the process to create a Cardano Node with the use of CloudFormation. In addition, the proposal also provides solutions to optimize system operation, such as: alerting rules to check service endpoints' health and notify administrators if there are any incidents; the whole system will follow the security standards and best practices; track cost usage; and trigger alerts when the usage exceeds a predefined threshold. That helps keep the system running smoothly and efficiently.\n\nThe proposers believe there is no comprehensive template of the tool to generate all of the infrastructure on AWS. The developer needs a tool to create a quick start without creating many resources on AWS. This will not only be good for onboarding developers, but it will also provide existing developers with an easily searchable template of the tools. With the use of CloudFormation, users do not need to know about AWS services; all they need to do is manage the applications running on the servers. If the users do not use the service anymore, they can remove the whole infrastructure cleanly by deleting the CloudFormation stacks. If the project is successful, building a Cardano node will be extremely simple, and of course, there will be many users—people who buy and hold ADA with the desire to participate in the ecosystem, as a real developer and not just a holder or trader.\n\nHowever, with the use of AWS, the cost will often be higher than other providers. In exchange, the service quality is very high. To reduce costs, the team can apply AWS pricing models such that reserved instances and saving plans can be used. The cost can be decreased by about 30–50% compared to the on-demand model. It's an expense that can be considered.", "q0r": 5, "q1": "As for the feasibility of the project, the team created a detailed time allocation table. We can easily see that more than 2/3 of the project time is focused entirely on creating the CloudFormation system—the core factor that creates the success of the project. Besides, other implementations and additional steps, including Setup Notification, System Health Monitoring EC2 & Automation, and Documentation, are also clearly divided into completion times.\n\nThe budget is well defined and demonstrates the major concern of the project focused on technology development (2/3 budget for Senior Solution Architect/DevOps Engineer). The proposal also provides a budget for resource costs on AWS for 5 months of deployment with compelling evidence, especially that project manager salaries represent only a very small percentage of the total budget, showing that the team has researched and carefully considered the allocation of budget most reasonably and effectively. A budget for project marketing appears to be missing here—an element that helps promote and replicate the project to users.\n\nThe team is made up of four experienced and competent members with a track record on LinkedIn:\n\nHarvey: Solution Architect, DevOps Engineer, Admin of Cardano Vietnam Official Group.\n\nVuong Tran is the Co-Founder and CTO of 3sfarm.io, as well as a Solution Architect and DevOps Engineer.\n\nChien Nguyen: Online marketer, programmer, and administrator of the Cardano Vietnam Official Group.\n\nCuong Tran: Cardano Ambassador; SPO; Admin of Cardano Vietnam Official Group (founded in 2017); Community Outreach experience; 6 years of Project Management and Supplier Focus Technology experience.\n\nWith a team of people who have worked for many years in the largest Cardano community in Vietnam and are experienced in participating and spreading Catalyst to the Vietnamese community since Fund 2, they will be the core factor for trust, confidence, and high performance. If the proposal is funded, the team will make it easier for more people to build a Cardano node, thereby bringing more developers to Cardano and helping the ecosystem to expand and grow.", "q1r": 4, "q2": "Roadmaps are specifically built with reasonably allotted timelines to achieve the project goal: to create Cloudformation with all infrastructure on AWS. The success of the project is assessed through real user experience, specifically for a new user, using just a simple template that spawns the entire infrastructure following best practices will ensure a stable, smooth, and controllable system. Customers now just take care of the service running inside that server, saving a lot of time on the operation and maintenance of the infrastructure on AWS. From a developer perspective, that would be a huge step forward in bringing the masses to Cardano. However, the team can consider quantifying the success of the proposal with more specific numbers, for example, the number of people using the Cloudformation System, the number of Cardano Nodes created, or the rate of conversion of people who are using the old approach to using Cloudformation Systems.", "q2r": 4, "assessor": "z_assessor_3662", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for your assessment, the great ideal quantifies the success of the proposal, I will create a form, attack them to link GitHub, and try to focus the survey and improve the cloud formation template. Thank bro."}], "solution": "We propose to use CloudFormation (Infrastructure as Code) to set up the infrastructure. We will modularize the sources so that it is easier to be inherited and extended later on.", "experience": "SPOs, member of the Plutus Pioneer Program, DevOps Engineer, and Cloud Solution Architect."}