{"id": 421924, "author": "udais", "title": "Add Senior Developers to Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/421924-48088", "category": 26597, "amount": 31000, "description": "There is a shortage of qualified senior developers for Cardano Blockchain worldwide. India has 2 million Developers with only 0.25% on all the Blockchains.", "f6_no_assessments": 12, "f6_rating": 4.805555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 741, "q0": "Yes, the proposal aims to train 5 new Plutus developers and 5 new Atala/PRISM developers within 6 months and help integrate them into Cardano projects. This addresses the challenge objective of increasing the number of developers building on Cardano. On a personal level I see there is a lot of demand for qualified Plutus developers and for the projects that I am delivering we are always on a look up to hire new developers, so having access to additional developers would help me advance my projects. The proposal is able to scale in future iterations by tracking a large number of developers through the program. The proposer also suggests that out of the 2 million developer market in India, only about 0.5% are blockchain developers and there is the potential to attract many more with the right training and incentives for new developers.", "q0r": 5, "q1": "Yes, the proposal provides Linkedin profiles for himself and co-proposers. Udai, the lead proposer has more than 20 years of experience in tech and has successfully established a hotel software business. This suggests that he should have no problem finding candidates for his program. The Co-poser has a similar track record and has been more involved with Cardano than Udai. The schedule is provided and is split into 3 periods of 2 months each (6 months in total) where a cohort of 10 selected devs will do self learning for 2 months, then project-based learning for 2 months, and training on live projects in collaboration with Gimbalabs. The budget is reasonably set at $31k where $15k will go as a stipend to trainees and the rest spend on preparing training material ($6k), marketing and material ($2.5k), and project management ($7.5k). Having worked with outsourcing contracts I can conclude that this is competitive for the Indian market. The timeline is realistic and logically broken down into self-learning and project-based training. The proposal is not technical in nature, as no new software will be built, at the end of it there will be 10 new developers ready to join Cardano projects. The key risk identified is not being able to attract the right talent and the risk that there will not be adequate projects for the new devs to join, these are reasonable risks, but given the contact network that the proposers have and the constant lack of Plutus developers ni Cardano I believe these risk can be adequately managed. I do not see any problem with the team delivering this proposal.", "q1r": 5, "q2": "Yes, a roadmap is provided and broken down by months and by task. The KPIs are thoughtful and cover the key metrics of a number of developers in training, assignment progress, and feedback from the community during the live projects. The team will keep the Cardano community updated with monthly reports and also make it available on a Github repo. At the end of the project, the team will make a formal communication with the profile of newly trained developers at the Catalyst townhall. What success looks like is well articulated and is objective: 5 new Plutus and 5 new Atala/PRISM developers available to join Cardano projects. This is a good auditability section and I am comfortable that the community will be able to monitor progress and reach the members for comments should that be required.", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 2519, "q0": "The objective of the Developer Ecosystem challenge is to create a positive developer experience which makes developing on Cardanon a fun experience for the developers . At the same time training the developers from other communities and even those who are not active in Blockchain technology, for Plutus, Haskell and other developer tools required to build on Cardano will also fulfill this objective and bring more developer activity to our Ecosystem. Haskell is not a very user friendly programing language and there are not many developers who are efficient in it. Training and motivating such developers to learn Haskell and Plutus and then build on Cardano will create a new line of developers which is essential for growth and adoption of Cardano.\nIndia is a breeding ground for software developers. The IT market, in India, is one of the biggest in the country with a market size of $197 billion in 2021 and projected to be $350 billion by 2025. The Indian IT industry employs 4 million workers with nearly half being software developers. Yet, of the 2 million software developers in India, only 0.25% possess the necessary blockchain development skills. The big tech giants like Google and Microsoft employ a large part of their workforce from Indian engineers and software developers.\nThe proposal is planning to train such web 2.0 developers from India in Haskell, Plutus and Atala Prism and assist them to build in Cardano ecosystem. This will help in bringing new developers to the Cardano who are well versed with its architect and understand the basics of creating decentralized application using Plutus. This perfectly aligns with the objectives of this challenge and fulfills the growing need of having trained and qualified developers for the Cardano Ecosystem.", "q0r": 5, "q1": "The projecd is divided into 4 stages which include, Marketting , Guided self study, Project based learning, and Training on live projects. The program will run from September 2022 till April 2023 and plans to train 10 developers from India, who after this training, will be ready to participate and contribute in Cardano ecosystem.  The team consists of two people from India and both have long experience as developers and worked at number of organisations. One of the team members hold M.Tech Degree from Indian Institute of Technology (IIT) which is the most prestigious technology Institute in India.\nThe team has requested the funds of $31000 to complete the project. The break up of funds, required for different taks, shows that the amount is reasonable to complete the project. Moreover, a major chunk of this amount ($15000) is being spent to incentives these newly trained developers for project based training. This will motivate the developers to participate in the training program.\nAll these factors show that the project is feasible and will create a new breed of developers who will be ready to start building on Cardano. Only concern is finding enough number of interested people for this project and then making sure that these developers are actually participating in Cardano Ecosystem. The best way to it would be to look for the people who are already members of Cardano community and who are interested in building decentralized applications on Cardano. It would also be good if they can invite applications from interested people before applying for Catalyst funds and in this way making sure that there are enough number of interested candidates.", "q1r": 4, "q2": "The team will share regular updates with the Catalyst community about the progress of the project through community channels and monthly reports submitted to the Catalyst. These updates will include data regarding Number of developers being trained, Developers learning progress notes and Projects assigned to different developers for project training etc. A  dedicated Github will also be opened to present the progress as well as include all relevant information in the monthly reporting and final report. Once the project based training is concluded,  they will communicate through social channels and After town hall session about the available developers for collaborattion and existing  projects on Cardano can hire them. This will help both - these newly trained developers and the projects who will be hiring them. For newly trained developers, it will be live project training and they will get first hand experience about building on Cardano. On the other hand the projects will get extra manforce to help them in their project completion. The success of this proposal will be reflected in the facts about how many of these developers become Plutus or Atala Prism Developers. Loking at the transparency of the team and the regular sharing of the data-monitoring and Auditability of the project looks attainable.\n\nIn the end, I would add that this is a good initiative by the team and if successful, it can help in increase in developer activity on Cardano. I wish the team all the best.", "q2r": 5, "assessor": "z_assessor_2312", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3560, "q0": "The proposers want to invite and incentivise more indian developers to start working with plutuis haskell and marlowe. This is a great opportunity for the ecosystem to grow. It's true that it would be 10 people at a time, but those 10 people would develop applications that could possibly reach millions of people, so it's a matter of efficiancy not quantity. I do appreciate the idea and really believe it will have an impact over the developer ecosystem.\nThe proposers identify a serious problem in the dev community, because it's currently growing with an amazing rate, and more senior developers are need to accomodate all new projects and ideas that come up. I really like the practical approach and having projects to learn on lined up. It's clear the proposers are well integrated in the community, because they've spoken to already running businesses to check the demand for senior devs. Any good market approach includes checking where best you can fit economically into any environment so this is a really good step to take, even before any work is actually done toward growing your own senior cardano devs.\nThe key metrics of the proposal are good enough, considering it's a hard task to know what each individual has learned since starting the self development program. As a developer myself I can say that different people have different growth and speed of learning, so having any kind of notes on what's being learned is a good way to show what's going though their minds and having it written down helps with the learning process as well as the metrics.\nI don't see anything missing from the proposal, and overall I think it's an impactull solution for the aforementioned reasons.\n", "q0r": 5, "q1": "The proposers have provided plenty of links, credentials skillset and done projects and have a solid work history, which brings the credability of the whole project up in my eyes as a developer and a veteran assessor.\nI really like the self learning + project learning + live project learning each for 2 months. It may seem a bit rappid to someone, but keep in mind these will be senior developers which don't need to learn programming, just need to learn the paradigms speciffic for the space and have a solid experience with all kinds of technology so this wouldn't be their first rodeo. It's a really practical and pragratic approach and I'm a fan of both, and have experience this rappid form of learning new things, which is not uncommon in our work.\nThe budget is more than reasonable, although it doesn't specify what exactly will be the generated marketing content, for the pricepoint, I believe it's worth it. Even so I would have liked to see in the proposal a more detailed breakdown of what exactly marketing approaches would be taken - digital, direct marketing or something else entirely. Just curious, but I do believe it would make the project more transparent and would invite assessors with the necessary skills (unlike me) to give you a free suggestino or two in the assessments.\nAs a developer the timetable of 6 months is a reasonable one, but that depends on the people they choose, so I defer to the selection process of those 10 devs to the proposers that have much more experience than I do in that particular sphere of operation.\nThe proposers have considered possible challenges, and I do think they've hit the nain on the head, because everything seemed really reasonable to me as a developer and I would have loved to be a part of such educational opportunity. It's true to make the switch from web2 to web3 development and I'm speaking from experience. Overall A feasible solution that I would definetely vote for when the time comes. I wish good luck to the proposers!\n", "q1r": 5, "q2": "Since there will be a github to present the progress as well as include relevant information in a monthly report, I think it will be possible to follow along with the projects progress and eventual success, keeping in mind of course that people are different and the learning curve and speed of learning is different for all participants.\nThe roadmap and milestones are reasonable and can be followed by interested parties. \nSolution is really practical for the problem stated and I do hope it's going to be efficient as well as well planned out. I appload the proposers for a well thought out proposal and I like the preparation steps they've taken like talking to businesses to setup the demand before they provide the supply. That's a blue ocean strategy https://www.blueoceanstrategy.com/what-is-blue-ocean-strategy/ and I do like the efforts to supply the newly created demand.\nOverall an auditable proposal, no worries there.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 13, "ne": 4, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3840, "q0": "This proposal is about adding senior developers in India on the Cardano ecosystem to bring awareness, and identify web 2.0 experienced developers and train them on Plutus and Atala Prism, to help them collaborate with projects.\nThe proposer emphasized that India skilled and experienced developers pool can be a solution to fill the gap of the developer requirement for Cardano, and these developers are engaged in developing complex applications using other technologies in web 2.0. In six months, they expect to prepare 10 experienced developers as Plutus or Atala Prism developer, 5 for each, and these developers will be available for the community to hire on projects. \nWith the approach, the shortage of developers on Cardano can be solved quickly.\nIn addressing the challenge, which is about supporting this challenge by bringing in more developers into Cardano, this is exactly what this proposal is seeking to do, that is making available more trained developers on Cardano by existing web 2.0 developers in India and training them and also giving them on-project experience.\nThe proposal mentioned 2 main risks, one being that web 2.0 developers may not be interested in Blockchain technology. To mitigate, the proposer wants to use monetary incentive to learn a new tech.\nI believe this proposal has addressed the challenge effectively. My rating is 5.", "q0r": 5, "q1": "The timeline and milestones are shown in the detailed plan of this proposal. The plan has been divided into visible tasks, specific timelines, and other projects involved. The major tasks which have been explained well in the proposal are marketing and promotion, Guided self study, Project based learning and training on live projects.\nThe project is seen as starting from September 2022 to April 2023 with specific monthly tasks. Other projects involved are mentioned as Udai and eRevMax team.\nThe budget requested is $31000 and it is reasonable. It is further broken down into smaller budgets for the various functions in detail.\nThe team comprises of 4 members with various experiences in blockchain, Java/JZEE, Big Data, Software Application Design and Development, Project management, etc., who are capable of implementing the project.\nThe proposers have indicated that they will not return to Catalyst for further funding because they will use their own funds to continue the training. \nWith is impressive details derived from the proposal. it is highly likely that this proposal will be implemented successfully. My rating is 5 for this good job.\n", "q1r": 5, "q2": "It is mentioned in the proposal that progress of work will be shared with Catalyst community through community channels, and monthly reports. Indicators for measuring progress of performance are listed as the number of developers being trained; developers learning progress notes; projects assigned and feedback from community project team when applicable.\nIt is mentioned that a GitHub will be opened to present the progress as well as final report of the project. \nSuccess of this proposal will be seen as 5 experienced web 2.0 developers become Plutus Developers; 5 experienced web 2.0 developers become Atala Prism developers with on-project experience. India becomes an example where senior experienced developers learn and become Cardano Blockchain developers. Also the proposer mentioned that additional success is integrating the developer with projects and companies working on Cardano and getting paid in a way that they can be trained and get onboard more developers to the ecosystem; thus building a successful hub of training and onboarding developers.\nWith all the contents above, the information provided is sufficient to audit the progress and success of the proposal., and this warrants my 5 star rating. ", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5555, "q0": "The problem of the proposal is the shortage of qualified senior developers for cardano blockchain and relating it to the challenge, it aligns, because it deals with the need to school and train Indian developers on specifically the Plutus and Atala Prism platforms which are uniquely designed on the cardano blockchain. Hence, the problem identified is in alignment with the challenge setting. The proposer is aimed towards engaging developers (these are already developers and it means that they already have some technology skills), and with that I believe that if the team is able to train them on the cardano specific platforms and with the expertise they already have, that will be a great mark for the ecosystem. Running through the key metrics and the goals, I see that there is an alignment with the challenge. I see some sense of positive flexibility in the proposal in a sense that the proposal can incorporate new ideas into it that can fit into other challenges in the long-run, it’s very scalable. However, the proposer has not envisioned to sustain the project in later funds of project catalyst and that leaves me in a state of uncertainty as to how the project can be sustained.\nAll thesame, the project when funded is impactful.", "q0r": 4, "q1": "Going through the information provided about the team’s relevant experience and their various and considering the links and video attachments, I believe the team is up to the task. There is clarity in the names and number of team members. The budget provided here is well broken down into identifiable items, this makes it easy to understand the budget. A project of this nature which deals with blockchain developers is one that entails a lot of funds, hence I will say the budget is reasonable for this kind of project. The time duration of the project if funded is expected to be implemented from September to April next year, this is realistic and gives more space for engagement with developers. The roadmap/plan presented here is comprehensive. The nature of the plan gives me the assurance that there would be intense engagement with developers. It’s good that the proposer has outlined the possible risks/challenges that may arise in the process of executing the project and putting in measures to curb such risks. That’s a commendable effort.\nI am confident that the proposal is feasible.", "q1r": 4, "q2": "The roadmap is exhaustive and comprehensive because it gives an overview of how activities would be carried out. The milestones are also stated clearly and so do too the time horizon. At the end of the project or the success of the project is to have 5 experienced Web 2.0 developers become plutus developers and 5 experienced Web 2.0 developers become atala prism developers, however I don’t seem to find in the proposal clear metrics/KPIs that would help achieve this desired outcome. I think it’s very necessary to clearly state the metrics/KPIs. There is clarity in the description of the problem, it’s solution and generally how the proposal aligns. The proposed solution outlined in the proposal is effective to address the problem.\n\nThe proposer has indicated that updates on milestones would be shared with the catalyst community through community members channels. Having this included would make it easy for community members to track project’s project and easily audit it.\nWith all these stated above, I am sure that the project is auditable.", "q2r": 4, "assessor": "z_assessor_2713", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6820, "q0": "The proposer was very articulate in presenting the problem and a reasonable solution to it. Developers have a huge impact on the development of the Cardano ecosystem. With the recent spike in native project build ups around Cardano, we have also seen the rise in demand for native developers (plutus and other relevant skills within the ecosytem). Furthermore, the proposer is clearly focused on developers around India, developers who are experts in various developing environment and skills, by providing them further opportunities to learn development in Cardano in the most possible concise manner. According to the metrics provided in proposal, India has a huge already existing senior web2 developers (over 2M) and onboarding a reasonable percentage of that number will stir up the Cardano developer ecosystem, encourage community built projects and increase adoption across a large userbase. These proposal however, is clearly aligned with the challenge category", "q0r": 5, "q1": "The company is already existing and has track records of training individuals and these gives me a satisfactory feeling that the team is up to the task. A very clear and conductible implementation plan was presented. Roadmap, timelines and key milestones were clearly identified with a realistic timetable that ensures longterm sustainability and completion of the project (tasks that are relevant to the project are clearly stated like marketing and promotion, guided self custody, project based learning and training on live projects). The budget is well broken down and requested amount is fair and reasonable. Information about team is provided in detail and all roles and expertise are relevant to the project. The team appears professionally consistent so much that if they get funded in these funding round, the will be self sustaining and will not come back to catalyst for additional funding.", "q1r": 5, "q2": "The proposer identified notable metrics that will be used to measure progress some of wich includes deliverables and milestones identified above, number of developers trained, projects assigned and progress, developers learning progress notes. The team also will open a dedicated github repo to present progress and other relevant information and same information will be delivered to the catalyst community. They further identified the project to be a successful project when atleast 10 developers become well up skilled with both developing plutus applications and Atala DIDs integration and also when developers get trained to confidently take up company level roles to build on Cardano.", "q2r": 5, "assessor": "z_assessor_2831", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 8943, "q0": "Since India is one of the largest software exporter in the world, there are many skilled developers available in all software languages in India, where they are tend to develop new projects every year, but there is very less number of developers who have knowledge over Plutus and Atala Prism.\nHence to find the developers and improve their development skill in Plutus and Atala Prism is a great idea, where in future cardano development projects will be in great demand, and present developers can act as senior developers in the future, which will enhance the software exportation of the country in every possible way. hence his proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer of this task has experience of 45 years in experience in development, designing and building enterprise application, and also he has learnt Plutus, Haskell and Marlowe and has been implementing these languages for the fund 8 project which is definitely a great boost .\nThe challenge here is how to convince the working developers to learn the new programming language, where they usually tend to reject due to their busy schedule ahead, some boost must be provided to help these developers to learn new language and make them develop their own language ,since the team already has great experience already with Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The presented plan has introduced us to all the team members involved in the project,  and has displayed us their proven experience both in development field as well as in blockchain funding experience, the proposal has failed to explain on how they are going to attract the working developers and make them to learn new languages such as Plutus, Haskell and Marlowe.\nOther than above fact, the audit has presented us proposed solution in very detailed manner and has provided  clean budget feasibility, and proposal contains decent budget breaking idea to make the project a successful one. Hence, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 9119, "q0": "The proposal raises the issue that there is a severe shortage of qualified senior developers for the Cardano Blockchain worldwide. In India, the information technology market is one of the largest markets in the country. The Indian IT industry employs 4 million workers with almost half being software developers but only about 5,000 or 0.25% having the necessary Blockchain development skills. The proposal offers a solution to increase the number of senior Indian developers into the Cardano ecosystem by training them on Plutus and Atala Prism, assisting them in participating in projects. These people are engaged in the development of complex applications using other technologies in web 2.0 and they have the ability to quickly grasp and be ready to be developers for Cardano. The training goes through 3 stages: guided self-study, project-based learning, live project training. They will be recommended to register for the Plutus Pioneer program. This proposal fits the challenge perfectly.\nThe proposal also introduces two risks that Web 2.0 developers are not interested in Blockchain technology or they do not continue after initial interest and difficulty in placing ready developers on live community projects. They also come up with solutions to fix them.\n", "q0r": 5, "q1": "The project has a specific roadmap as follows: September will do marketing, advertising, select 10 developers, collect resources for self initial learning; October will complete self-study, identify training projects; November and December connect with the learning initiative based on the Gimbalabs project… This roadmap is specific and clear, so the project is easy to implement successfully.\n\nRecommended budget is $31,000, where marketing and advertising costs are $2,500, development costs $6,000, Partial project funding $15,000, project management $7,500. The cost list is quite detailed and reasonable.\n\nThe project team consists of 2 people: Udai Solanki - Founder of eRevMax.com 20 years ago, served as Chief Technology Officer and since last two years ago as CEO (eRevMax is a leading travel B2B integrated technology company, leading innovator), He is working on a proposal funded in Fund 8 that Atala Prism is using; Narendra Das is an Enterprise Software Architect, Developer and Manager, has about 22 years of experience in Software, Support, Integration and Management application design and development, with expertise in Blockchain - Ethereum ERC 20, ERC 721, Cardano, Haskell, Plutus, Marlowe… Thus, the personnel match the requirements of the project. The community can find out information about them easily via linkedin.", "q1r": 5, "q2": "The project will share with the Catalyst community through community channels and/or monthly reports on the project's progress (opening a separate Github) such as: Number of Developers Trained, Notes on Developers Learning Progress, Assigned Projects and Progress, Feedback from the Community Project Team when applicable. They will also provide information, profiles of developers. They aim to train 5 Plutus Developers, 5 Atala Prism Developers with project experience. At the end of project-based learning, they will communicate with the community through social channels and after a Town Hall session about the team members available to collaborate on projects. Therefore, the community can control the progress and results of the project easily.\n", "q2r": 5, "assessor": "z_assessor_3021", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 9539, "q0": "For a well quantified problem statement and major impact potential (all at around a very average Catalyst cost), I rank this section a 5. Through this proposal, Cardano might be the only blockchain out their actively recruiting the demonstrably underreached population of advanced/senior software developers. This proposal successfully addresses the problem statement with aggressive outreach and funneling that talent into a program (Plutus Pioneer Program) that exclusively benefits the Cardano ecosystem. This would accelerate growth on Cardano and very effectively solve a lot of the developer shortage issues that we’re seeing all across the ecosystem. I also very much appreciate the guiding questions listed in this section as it gives me the impression that the proposers are actively trying to think like their audience. The main things I look for in this section are tangible/quantifiable problems, solutions, and post-proposal impacts, so I react very positively to this section for providing all those things (and more!). ", "q0r": 5, "q1": "For unique positioning of talent, exceptionally efficient spending, and a clear roadmap, I rank this section a 5. The experience and influence of this core team (extending back 20+ years for each core team member) uniquely enables this team to carry out the given proposal because they have an extraordinary track record of work experience and networking history WITH time spent as influential head figures within this industry. I’m excited and encouraged just based on the mere fact that this team is talking about Cardano and likely telling their connections about it. Then, they take it a step further and layout a beautifully organized roadmap that shows just how quickly would could start to see developers funneling into the community. Lastly, the budget does not even allocate any funding for their own compensation (which I think is a good thing because it means they intend to see a level of success in this that they would be able to provide for themselves AND/OR genuine care for the Cardano community). ", "q1r": 5, "q2": "For appropriate KPIs, public sourcing for accountability, and quantifiable target goals, I rank this section a 5. The only piece of feedback that I feel like I can give to this ENTIRE proposal is that voters may react very positively to a set of progressive milestone targets to give voters a sense of the future of this proposal. Still, this section does thoroughly establish clear KPIs that are well designed to measure progress AND potential need for adjustments along the way. I think this proposal thoroughly defines success and is very well setup to achieve it. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 10913, "q0": "This proposal aims to address the shortage of experienced Cardano developers by training web 2.0 developers in India and making them available to the community. The onboarding model over 6 months will make the developers ready to build on Cardano. India has a large number of brilliant developers, with the help of this proposal some of them can be educated at Cardano.\n\n", "q0r": 5, "q1": "The proposal's roadmap is detailed and reasonable, starting from September and ending at the end of March next year. Regarding the solution and benefit realization stages, the proposer divides them into two time frames by assigning specific tasks to each milestone. But I think these timetables can be more transparent if they wrote down many specific targets instead of just some information such as “20 experienced developers identified - 30% of experienced developers on Cardano” or “Train 10 developers” or so on. \n\nThe total budget is $31,000. It seems like a large budget since the goal is to acquire 10 new developers. Keep in mind that we are looking for a personal and close relationship and that $15,000 of the budget is intended to encourage developers to work on projects.\n\nThe team appears to have the necessary expertise to complete the proposal. Both members have access to their linkedin where anyone can check their experience.", "q1r": 4, "q2": "The proponent talks about the ways we could monitor this project, through a set of small activities (number of developers trained / learning progress notes / assigned projects and progress feedback from the community team etc.). I think that this data collection is more accurately done by a neutral third party than by the team itself, but anyway, at least we have something to base ourselves on verifying whether what was promised in the maintenance phase has been fulfilled\n\nSpeaking now about how success would be perceived, we are told 2 different possible scenarios: 5 developers become experienced web 2.0 Plutus Developers + 5 experienced web 2.0 developers become Atala Prism developers. About these measures of success, my suggestion is precisely what I said earlier about inquiries aimed at an audience that is specifically focussed on Cardano. In other words, it is more objective for us (that is, people from our ecosystem) realize if actually there is incorporation into work spaces focused on Ada.", "q2r": 3, "assessor": "z_assessor_3205", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11266, "q0": "The proposal highlights the shortage of senior developers in the Cardano ecosystem and the need to bring some web 2.0 developers over to 3.0 by training them on Plutus and Atala Prism. There is a lack of a supportive environment for developers and the team would like to provide one to the existing developers. There are several challenges such as how they would attract developers to the Cardano space, what the developers want, and the motivation that developers need to grind through all the docs and codes. Fortunately, all these have been addressed in said proposal. The team would have marketing to attract potential developers. Through the second phase - teaching and development, there are feedback sessions and the team would know more about the wants of developers. There is a paid incentive to keep the developers motivated to learn. Overall, the proposal effectively addresses the challenges. ", "q0r": 5, "q1": "The team consists of Udai Solanki and Narendra Das. Udai is the founder of eRevMax.com and served as CTO and CEO. eTevmax is a leading travel B2B integration technology company that was founded over 20 years ago and has more than 1000 tech integrations. It is also being used in many hotels around the world. Narendra is an Enterprise Software Architect, Developer, and Manager. He has 22 years of experience in Software Application Design and Development. The team alone is very capable, at one glance it is shown that these 2 individuals have a lot of experience and know what they are doing in their fields. In addition, their plan is well thought out. The first part of their plan is the marketing and selection phase, this is where they will run awareness campaigns on various social media and private groups and ask interested parties to join their program. Throughout this first phase, they would weed out uninterested candidates. Once the first phase is completed then they would start phase two of their proposal, which is the training and development phase. They also plan to hire a Marketer, Content Creator, and two Project managers for said proposal. The team has planned things out rather well and thus I am confident in their execution. ", "q1r": 5, "q2": "The team would share the milestones set to the Catalyst community through community channels and/or monthly reports. Those milestones consist of the number of developers being trained, developers learning progress, projects assigned and progress, and finally, feedback from the community project team whenever applicable. In addition, the team would also show the community the process of learning and also the identities of the onboarded developers. Furthermore, a dedicated Github would be opened to illustrate progress. The team would also announce the available team members to collaborate after the project-based learning stage through social channels. ", "q2r": 5, "assessor": "z_assessor_3233", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12419, "q0": "This proposal brought up the issue about the lack of developers with knowledge of blockchain, including Cardano, in India. This proposal aims  to tackle this challenge by recruiting several developers from India to learn blockchain via a training course that includes a guided learning stage and hands-on projects for the participants (working on other community projects). The course itself will be focused on training web 2.0 developers to work with Plutus and Atala Prism. The issue brought up is relevant since blockchain technology is still an underexplored sector of interest, especially in Asia, and the goal of this project is aligned with the challenge setting objective, which is to grow “a bigger talent pool of developers that Catalyst projects can collaborate with…”. Overall, I think this project can add value to Cardano ecosystem by introducing more developers that are capable in the Cardano blockchain that will lead to more products and further adoption of Cardano. ", "q0r": 5, "q1": "The member working on this project has the relevant skills and experience to implement this project that has been backed up by relevant links. They were a funded proposer in past fund working on a product that involves Atala Prism (Ideascale linked in proposal) and also have experience working in the technology industry (LinkedIn provided in the proposal) as well as competency with the Cardano programming language (Haskell, Plutus, Marlowe).\n\nThe budget of 31000 USD was requested has been broken down well into details, such as the rate requested, number of people involved, and work hours. The budget includes marketing, training and development cost, partial project funding (for hands-on training), and the rate for project managers. The budget is well laid out and seems reasonable with its justification.\n\nThe 6 months roadmap was well laid out going over the 3 key milestones (2 months per milestone) of marketing, selection, and guided self study (weekly progress assessment), project based learning (working on sample or finished projects), and live project trainings (working on community projects). With the clear and well laid out roadmap, the project seems feasible to be completed in a timely manner. The proposer has also identified the risks that can come with the project regarding participant interest and developers willingness to let developer in training to work on their project by giving monetary incentives and finding for projects with shortage of developers. \n\nOverall, the proposal shows that the team has the relevant skills and experience as well as the ability to identify the resources needed & come up with a feasible project timeline.", "q1r": 5, "q2": "The overarching goal of this project is to have 10 web 2.0 developers with experience working with Plutus and Atala Prism (5 developers each) and the metrics used to measure the project’s progress is also suited for its means (i.e. number of developers in training including progress notes, the live project’s progress, and community feedback from the live project used for training developers). These metrics are not only able to measure the progress of the project’s deliverables but also the competency of the developers after training. These metrics will also be reported on a monthly basis via Github so that it can be tracked easily by the community. ", "q2r": 5, "assessor": "z_assessor_3408", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "To add senior developers in India on Cardano ecosystem, bring awareness, identify web 2.0 experienced developers and train them on Plutus and Atala Prism, assist them to get on projects. ", "experience": "45+ years of experience in development, designing and building enterprise application. With keen interest learned Plutus, Haskell and Marlowe. Implementing a project F8 based on Atala Prism. \nUdai and Narendra trained many senior developers in their technology leadership role."}