{"id": 422249, "author": "dao.coders", "title": "DAO-NET: Small Developer Funding", "url": "https://cardano.ideascale.com/a/dtd/422249-48088", "category": 26597, "amount": 30000, "description": "The bureaucratic overhead and long timelines of the Project Catalyst funding are significant hurdles to developers seeking to rapidly create apps requiring only small budgets.", "f6_no_assessments": 7, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 746, "q0": "The proposer identifies the challenge of funding proposals quickly and with much lower timeframes than project Catalyst. The objective for this to give funding to developers focusing on smaller problems than what submission to Catalyst would justify. This lines up with the challenge by improving the developers' journey and has the potential to attract new developers to “dip their toes” into the Cardano ecosystem before fully committing. The proposal is able to scale through the bespoke DAO creator that the proposer has delivered through previous proposals. The proposal will fund the treasury of the DAO that will give out daily funding of up to $300 for 100 days, after the proposer plans to return for additional funding. I personally tried the DAO creator platform where I created a new DAO , added a new budget and funded it from my we-wallet (on the testnet) , I created a new vote on how to distribute the funds and the experience was to a large extent smooth and plausible that the community could use this distribute small amounts of funs. Also I have seen Milkomeda from dcSpark do something very similar where a treasury was funded by Catalyst and which they distributed to promising projects wishing to migrate to Milkomeda. I will likely participate in the DAO when it launches", "q0r": 5, "q1": "Yes, the proposer provides evidence of his skills and linkedin profiles that supports his abilities to deliver a project like this. The project is not technical. It will reuse the infrastructure of daocodert.net that the proposer has delivered through previous proposals. It will be a team of 1. The budget is reasonable to achieve the goal. The basic premise is that the proposer will use the $30k budget to fund the treasury of a DAO that he will create on his platform and will use that DAO to attract members, accept proposals and distribute up to $300 per day. The budget will last for 100 days. The proposal is completely realistic as it is a distribution of funds and the technology to distribute these funds has been build to a large extent. The highlighted risk is not having enough developers join the platform and the mitigating action is to advertise it through one of the weekly Catalyst town halls and raise awareness through Discord and Telegram groups. I personally do not see a problem that he will be able to attract interest from developers. I think the biggest risk is with auditing the deliverables of projects in the DAO and how he plans to maintain a high standard of projects. I think there is a high chance of success given that the technology already exists and it is more a use case of that technology funded by Catalyst", "q1r": 5, "q2": "The roadman is clearly stated to run over 100 days where on each day $300 will be distributed to the proposers of the DAO. The KPIs are clearly outlined and will track the number of members, projects, and funded items in the DAO. A report will be shared with the community monthly. There is a clear deliverable in the project and no ambiguity in how it will be delivered.", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 3564, "q0": "The proposal would enable developers to fund small budget projects and would get quick funding through a DAO, allowing the community to vote on funding those projects. I really really like this idea and think it will have an impact over the ecosystem. To be honest I don't really agree with several ideas of this proposal, but I do believe that no one can have the right answer right away and it's important to experiment try and fail to find an optimal solution. So in that train of thought I would really like to see this proposal funded.\nThis proposal is in the right category, because it would immensly improve funding for small budget projects. It's aligned with the challenge settings and would be a perfect addition to the ecosystem. The key metrics are reasonable, because it would show unambiguously if the DAO would be a success through tracking rapid funding and people participating on both investor and project side. \nI really believe this proposal would have a larger impact in the future once the whole process and proof of concept have been polished. Currently I don't see many things missing from the proposal, besides a few things I'm going to mention in the feasibility part of the assessment. Overall a good proposal that I think is going to have an impact for small projects.\n", "q0r": 5, "q1": "The proposers have provided all the necessary links so I was able to verify that Dwayne Collard has all the necessary tallents and skillset to manage the funding through the DAO. As a developer I am a big proponent ot automated solutions so I do enjoy the proposal that much more for it.\nI am a developer, but I'm also an economist and I didn't understand what would the incentive be to fund the DAO? If it's like patreon and it's some kind of chairity, that's good, but I do belive this needs to be mentioned. It would set the right expectations, because if you're a chairitable person, you'd want to participate no matter what, but if you're an investor you'd want to know what the return on investment is.\nI didn't quite understand how the funded projects would be accountable for the usage of the funds. So there needs to be a better defined explanation about that in the proposal. I do approve of the experimentation with rapid funding. Even if it's not the most optimal solution right now (I'm not saying it's not, it's just not verified yet) it would become polished over time and this needs to be allowed to happen. I have already seen previous variation of rapid funding, and I welcome a new one to be tested out over time. As the prroposers mentioned 30k wouldn't be a big cost for testing out something that wouldn't take 5-6 months to get a project funded which whould speed up the development of the environment itself.\nThere's a sensible plan for funding and a doloar cost averaging way of keeping the price around the medium of the change of price, so that's smart and would deffinately be worth the value of the overall transactions. I'm sure the proposers have already solved several challenges and have gain the know-how of dealing with dao problems, so I defer to their knowledge about the challenges they have forseen, because I can only speculate, and I avoid speculation at all cost.\nOverall a decent and feasible proposal despite the few small improvement suggestions mentioned.", "q1r": 5, "q2": "It's a DAO so it's transparent, I don't have a problem with the auditability of this proposal. Furthermore Dwayne Collard is a well known member of the community helping it grow so I don't have any worries he'll mange the project without a hitch.  A clear and understandable problem - get small funds to projects that need them rapidly, and a clear solution - create a DAO to fund them. Good KPIs good metrics, good and proven formula for funding and dolar cost averaging, so I do believe this is one auditable proposal and I wish the proposers good luck.", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7827, "q0": "The proposal has outlined prudent and realistic solutions which  effectively addresses the challenge. The proposal has also been entered into the right challenge. The action plans deployed in the proposal when funded will see more developers joining the Cardano ecosystem. For this reason I gave it a 5 star rating.", "q0r": 5, "q1": "The team behind this proposal have actually worked on  several funded proposals in similar challenges in Fund 8. This therefore reinforces the authenticity and viability  of the laid down plan in the proposal. The team has quite some experience to effectively implement the proposal successfully. The budget presented in the proposal has been clearly and reasonably allocated to identifiable task. The time frame given for execution is on point. A 5 star rating is what I gave for this segment of the proposal based on the above mentioned observations.", "q1r": 5, "q2": "The proposal contains adequate information with which audit can be done easily. The DAO coders deployed by the proposers is meant to manually tabulate the number of Project Catalyst small developer funding DAO members on its platform. This will then be forwarded to the community for audit. The proposal also has provided key milestones with which success can easily be measured. A 5 star rating is therefore what I give this proposal.", "q2r": 5, "assessor": "z_assessor_2924", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9548, "q0": "For clearly communicating a need, convincingly addressing the problem statement with the solution, and concisely explaining some of the basic fundamental intentions of the project, I rank this section a 5. This proposal presents a relatively simple solution for what can be a very big problem in productivity of projects that engage with Catalyst. There may be room to provide some modeling evidence for situations where small funding issues can cause big problems in project development (perhaps more easily found in traditional markets). This would likely help voters to more easily recognize the magnitude of this proposals impacts. Still, I think the proposal does very well in rationalizing a need and a solution that effectively upgrades the effectivity of Cardano Catalyst. ", "q0r": 5, "q1": "For showing necessary experience from someone who is familiar with the niche of Carandao Catalyst, providing a clear breakdown of intended proceeding actions in the roadmap, and a fully committed budget breakdown, I rank this section a 5. It appears to me that the only cited core team member of this proposal is uniquely qualified to carryout this proposal. I also really like this roadmap breakdown that explains specific actions that will be taken at each juncture of funding. I would’ve liked to see a little more action points on plans to push awareness of this DAO to the community (especially since low participation is one of the cited risks for this project). This isn’t a huge hole in the proposal but I think it would provide voters with a little more substance to know what to expect. ", "q1r": 5, "q2": "For thorough definition of success with quantifiable targets for participation, I rank this section a 5. I think this section provides voters with plenty of substance to evaluate this proposals KPIs and target metrics. Everything here is clearly outlined and easy to understand where the proposers thoughts are for the future of the project. I think I would’ve liked to see an intention and target for DAO participation percentages, as opposed to just membership. I think this aligns well with the mechanism described in the impact section about minimum 10% DAO participation to see funding approval. This is a pretty minor suggestion as 10% is a perfectly functional margin but this section was too unbearably perfect to go without something to criticize. ", "q2r": 5, "assessor": "z_assessor_3063", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10797, "q0": "DAO-NET is no longer an unfamiliar name in the blockchain business or among PAs such as me. Previous funds have financed projects that have developed smoothly and provided many great experiences for developers, and this time you are back with a project that assists developers who are seeking small investments (under 10K USD). Your team's experience has led to a well-presented and concise proposal. You clearly and understandably present the idea and how the Catalyst Small Developer Funding project works, and then demonstrate the close link between it and the challenge (helping small developers eliminate the cumbersome paperwork so they have a more positive experience and can focus on app development). Because the DAO-NET project's straightforward fundraising and submission process is a positive aspect, I believe the risk of low participation can be readily managed if you have a robust promotion campaign in place. However, there is one question that I need you to answer: What will DAO-NET do to ensure voting round transparency? Even though the funding amount is not excessive for small projects, I believe you should demonstrate how to ensure transparency in the distribution of investment funds to avoid problems with claims complaints later on. Because there are many dishonest developers that are constantly looking for ways to extort money from crowdfunding, transparency is a major worry. I hope you can clarify more about it.", "q0r": 5, "q1": "The project's strategy is tightly aligned with a funding transfer process that consists of four distinct phases (three 33-day periods used to transfer ADA into the Catalyst Small Developer Funding DAO project and a final day to transfer funds money remaining after deducting transaction fees). Calculations and roadmaps appear to be minor issues for a talented and experienced staff like DAO-NET. Because the entire process will be mostly automated and the applications will already be launched prior to funding, your team may be confident that you can fully streamline your workload to achieve Quality assurance for each project in this fund. I admire your team's adaptability and dedication.\n", "q1r": 5, "q2": "The KPIs are clearly given, coupled with exact metrics that characterize the project's success. You demonstrate to everyone DAO-purpose NET's not only with this project but also with a decentralized ecosystem. The DAO-NET ecosystem is still evolving and expanding as new initiatives are proposed. You have consistently maintained the attitude of saving time and money while fostering a pleasant atmosphere for developers to exchange experiences. I hope your team can keep up this incredible work and assist the Cardano community in developing more affluent and robust.\n", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12690, "q0": "The problem that needs to be addressed here is that the bureaucratic and lengthy costs of Project Catalyst funds are significant obstacles for developers looking to quickly create applications on a small budget. .The proposal makes it clear that it will add value to the cardano ecosystem by allowing developers to submit small budget items with minimal cost for quick funding and allowing the community to drop votes on funding categories as an early test of the DAO-NET ecosystem. Proponents offer measures Using the DAO-NET platform, Anyone can become a member of DAO with a small transaction fee. Any member of the DAO can submit a Budget Item to fund a small development project. To limit abuse, a minimum of 10% of DAO members must approve a budget item as valid before it can begin to receive funding. Using a quick, simple funding and proposal flow makes the developer experience much more positive and allows developers to spend more time focusing on app development instead of manual work paperwork.This proposal allows new developers and those without support networks to develop small projects to build their experience, reputation and portfolio, thereby increasing the talent pool of developers Cardano development. thereby helping to scale up the project so I completely agree that the proposal will effectively solve the challenge.", "q0r": 5, "q1": "The proponent provided information about the relevant experience and skills of the Product Manager: Dwayne Collard - 20 years + IT Consultant, Solution Analyst, IT Director, Veteran Community Advisor Attached is a link to verify. The proponents identified the team members as an experienced team of Blockchain developers, Plutus pioneers, veteran Community Advisors, and Solution Analysts that were merged after funding. pre-loop support for several DAO-NET suite proposals, available for viewing and testing (link included). The proponent requested funding for this project of $30,000 including 100 Transaction Fees for daily transfers (~18 ADA). All remaining funds go to the DAO Small Developer Funding Catalyst Project daily for 100 days for redistribution to Developer projects based on community votes. actual timetable developed by the proponent within 100 days of specific planning: On the day of the successful funding announcement, after receiving the first, second, and third installments, and on the 100th day of public announcements specific things to do. The proponent also took into account possible risks and solutions to deal with them. I agree with 5* for the feasibility of the project. ", "q1r": 5, "q2": "The proponent gives a specific roadmap with a detailed plan within 100 days, Specific milestones and timelines are given: at least 30 developers, organizations or DAOs will submit budget entries for funding. at least 1000 members become DAO members in the DAO-NET ecosystem. DAO-NET community should expand and develop. The maximum decentralized DAO-NET ecosystem will become part of the overall Cardano ecosystem. Each month, DAO Coders will manually measure the number of small developer funding DAO members of Project Catalyst number of Catalyst Small Developer Funding DAO Project budget items created, and the number of Catalyst Small Developer Funding Project DAO budget items as a measure of project success. The proponent clearly describes the problem as well as offers a clear, easy-to-understand solution to the problem. This proposal is a continuation of previously funded projects in fund 7.8 that increase the credibility of the proposal. I rate 5* for the suitability of the proposal.", "q2r": 5, "assessor": "z_assessor_3449", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13858, "q0": "Yes, this proposal does effectively address the challenge. Allowing new developers to fund their projects in a more rapid and effective way is a really interesting way of facing the Cardano Community core problem of expanding itself and their blockchain transactions. Small budgets can easily provoke velocity and rapid growth of the Cardano Community dynamics. Overcoming obstacles and complex bureaucratic hurdles in really simple and small transactions can be an excellent opportunity of opening up the young and new Developer Ecosystem panorama. ", "q0r": 5, "q1": "Dwayne Collard has a great deal of experience in the Software Industry. He has also managed the 4 successful DAO-NET proposals from Fund 7 and the 3 successful DAO-NET proposals from Fund 8, all of them will be completed prior to funding release for Fund 9. It is important to our community the continuation of projects and proposals lined with our challenges and goals as it is the only way to strengthen our dynamics and transactions. ", "q1r": 5, "q2": "The information provided seems sufficient to audit the progress and the success of the proposal. As DAO Coders will monthly submit the measurements and final Project Catalyst reports along with the list of budget items funded with description, this proposal looks like a well builded project. Along with the manual measurements it would be sensible to think and develop software that automatically tracks the results of the small budget projects and their development. ", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "This proposal will allow developers to submit small budget items with minimal overhead for rapid funding and allow the community to vote on funding items as an initial trial of the DAO-NET ecosystem.", "experience": "DAO Coders Inc is an experienced team of Blockchain developers, Plutus pioneers, Veteran Community Advisors and Solutions Analysts that was incorporated after previous round funding for several DAO-NET suite proposals, which are available for viewing and testing (see link below)."}