{"id": 422370, "author": "mavster04", "title": "Java SDK to Build Health App", "url": "https://cardano.ideascale.com/a/dtd/422370-48088", "category": 26597, "amount": 7500, "description": "Building a health app in a blockchain has lots of challenges. Aside from compliance, security, & data privacy, one has to learn blockchain-specific programming language. This makes onboarding harder.", "f6_no_assessments": 6, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 751, "q0": "The proposal aims to build a Java SDK to interact with their Hippocrades APIs. This opens up their health information system to developers who prefer to work with Java. This is a useful addition it could bring new Java developers to Cardano and give an existing developer who prefers to code in Java, or has integration needs with other Java a platform to get started quickly. The SDK is geared towards Hippocrades and therefore not reusable immediately for the rest of Cardano ecosystem, therefore the reach is limited to some extent. It would have been good to see the proposer extend the scope to cover other parts of Cardano for which it could be used. However, the relatively low budget of $7k makes the reduced scope justified. The proposal scales to the extent that more developers will come to work on the Hippocrades apps.", "q0r": 4, "q1": "The proposer has provided the list of individuals that are needed to deliver the proposal but has not identified who those individuals will be. The proposed however has a track record of delivering other parts of the Hippocrades app and states that access to a pool of developers who he can pull to work on this proposal. It would have been nice to see who those individuals are to be able to assess their technical capabilities. The budget of $7k is outlined and split between the tasks of a project lead, a backend developer, a python developer, and a documentation lead. The budget monthly rates for each of the tasks are competitive (e.g., $3k for a senior backend developer). The project is planned to be delivered within 1 month and this is quite realistic given that the team already have a Javascript SDK. The language differences between Java and Javascript are still quite large, as Java is typed language and javascript is not, so there is some work involved in defining the type for all the variables which can identify some bugs in the existing javascript implementation and lead to some delays beyond the 1 month that has been allocated in this proposal. I think the proposal will be able to deliver, but it would have been nice to see a little more detail on the planning and recognition of the delivery risks. The proposer highlights that there is minimal risk to delivery. I suggest the proposer elaborates a little more on how the porting of the Javascript to Java will be done. I think the proposer will be able to deliver, but there are risks of a delay.", "q1r": 4, "q2": "The proposer sets the time at 1 month to deliver the project after which the Java SDK would have been delivered and open-sourced on Github. The project is quite short in terms of time, so it is unlikely that there will be intermediate steps to monitor progress. The proposer commits to pushing the development of the SDK for the community to monitor. The success is stated as the delivery of the SDK which is in with what the proposal set outs to deliver. The deliverable is objective and there should be no difficulty to audit the proposal.", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 972, "q0": "The Hippocrades Team has built an impressive suite of infrastructure products to enable app developers working with and for the health care industry to easily deploy applications that leverage the Cardano blockchain. This is a key piece of infrastructure that could prove very important for the adoption of Cardano. This particular proposal is requesting funding to build an SDK to allow Java developers to quickly deploy an app on top of their existing infrastructure without the need to learn a different programming language.\n\nThe best part about it is that we don’t have to hope that the team will have the skills to deliver on an SDK as they have already built one for JavaScript that’s available today and linked in the proposal. The funding they are asking for in this proposal will go towards building the SDK for a new programming language, Java (this proposal).\n\nThe team has 4 proposals in Fund 9 with the goal of building SDKs for developers working with languages to be able to deploy on their infrastructure with ease: Java (this proposal), Rust, Golang, and Python.\n\nI understand and agree with the decision of the team to submit a different proposal for each programming language they intend to create an SDK for. This enables the community to choose and allocate funds to those it considers necessary, and also select one or a combination of multiple languages that are relevant and would be good investments for the treasury. This is not something that would have been possible in the case of a single proposal that would have bundled all languages together.\n\nThe team has been very transparent about the fact that they have multiple proposals in Fund 9 all with the same objective, just for different programming languages, as they mention this fact in every one of the proposals. This should also help with discoverability by the voters, but my recommendation would be that if there will be a next time, they should consider including links from each proposal to all the others to help with navigation in case a voter or a community member wants to support multiple.\n\nThis set of proposals are clearly a very good fit for the Developer Ecosystem challenge because they directly answer the key guiding questions of the challenge: “what are the tools that we need to prioritize first” - those that will make the development process on Cardano the most seamless and effortless, and “how do we attract developers from outside of our current community to participate in Catalyst?” - by allowing them to build on Cardano in the language they are most comfortable with. By splitting up their plans for SDKs into multiple proposals and giving the community a chance to vote on exactly which ones they believe are the most relevant they also allow developers to directly answer the questions “what do developers want, and how do they get it from the Cardano dev ecosystem?”  Also the Hippocrades project as a whole very much addresses the last guiding question of the challenge “what are enterprise dev managers looking for in order to be able to build out enterprise projects - either internal or commercial?”, at least as it applies to dev managers connected to the medical industry.\n\nMy assessment of this set of proposals in the Developer Ecosystem challenge is based on my experience as a project manager working directly with Cardano developers since July 2021. I have participated in almost all roles in Project Catalyst since February 2021, including as a previously funded proposer, and I’ve been involved with the Cardano development community and NFT community for about a year and a half.", "q0r": 5, "q1": "The team presents not only an impressive list of qualifications in the proposal but also a complete list of their already operational medical services infrastructure platform and a demo app. We don’t have to envision what developers could build with the new SDKs in the languages they are comfortable with, we actually get to see it. After inspecting it I can say it looks impressive, it seems to cover all the needs of a health professional while also maintaining a modern clean look.\n\nThe implementation plan is logical and makes sense within the context of the overall project. It’s for 5 weeks of development time and seems to cover all the necessary steps to successfully implement the SDK for Java (this proposal). Each one of the 4 proposals in the set is estimated to take 5 weeks, meaning that in the case that all 4 proposals are funded, the total estimated completion time would be 20 weeks, given that the same team will be responsible for the execution of each SDK.\n\nAs this is a straightforward development project at an existing company, the budget breakdown only concerns itself with worker compensation for the month it is estimated that the development of the Java SDK would take. The amounts seem very reasonable, low for Western standards but that shouldn’t be a problem since the team has indicated that they are in Africa (they haven’t directly specified this in the proposal, but since they are part of the Ariob Incubator / Iceaddis program I assume this is the case.)\n\nThe team members involved in the development of this particular part of the Hippocrades project are described in detail within the proposal, and the technical speciality of each is presented. They seem to collectively possess the skillset required to successfully deliver. However, because the proposal didn't link to any professional profiles (LinkedIn) or examples of previous work, I wasn't able to verify the claims around credentials and experience. But, even though they haven’t provided links for each individual separately, they did provide a very ample description of their project overall (Hippocrades) and numerous links to multiple resources about the project and showcasing the project.\n\nAll these factors make me very confident in the Hippocrades’ team's ability to deliver on the scope of this project if funded.", "q1r": 5, "q2": "The proposal is very clear in what it wants to achieve and what are its intended deliverables. This alone should help a lot with the auditing process. A clear roadmap for the project is presented and from that, the delivery date can be easily extrapolated and verified. The team states it plans to use GitHub to record and monitor its activities and deliverables, which should further simplify the verification process as that is an almost universal tool used by most programmers in our developer community. \n\nGiven all this, I see this proposal (and this set of proposals) as being very easy to audit by any member of our community with the right technical skill set and knowledge of Java (this proposal), Rust, Golang or Python.\n\nNote on the proposal set and the assessments:\n\nI have verified the content of all 4 proposals using software that allows for snapshots of text and comparisons between snapshots (Scrivener). I did this to make sure the text of all proposals is the same before writing this assessment. They are indeed identical, only the name of the intended programming language differs between proposals. As such, I have assessed all 4 proposals as a set. Just as the text of the proposals, I have also changed the specific programming language in each one of my assessments and I’ve written “(this proposal),” where this needed to be highlighted.", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 12, "ne": 5, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3568, "q0": "The proposal is about delivering a Java SDK to help developers with building a healthcare app using a language they know - java, while it's still a blockchain app and can take all the advantages of that. Concerning healthcare apps that have very specific requirements applied to them like data privacy, compliance with different standards among other things, this SDK will greatly benefit the positive experience developers have while building a healthapp using the aforementioned SDK.\nThere will be considerable impact over the dev ecosystem, although this sdk is specific and not everyone will be able to use it, this is the same reason it's so valuable. I like the plan of the proposers to build versions of this sdk in other languages as well to engage more devs from different communities and involve them in cardano by offering them a smooth transition.\nThe key metrics and goals of the proposal are really good and it's clear a lot of thought was put into the whole proposal. This proposal will be able to scale with the future challenges and I'm sure as a developer myself that a lot of people will be interested in using this sdk and working with the proposers as well. Currently I don't see anything missing from the proposal and I do believe this sdk is a missing puzzle piece that needs to be built.\nOverall an excellent proposal that will have a strong impact. ", "q0r": 5, "q1": "There's a really excellent roadmap in the https://hippocrades.org/ . It specifies the plans for the near future which is the first I've seen a project having a 3 year roadmap, with ticked items on it. I really don't know why more people don't do this since it's a great way to track how the project is comming along and you don't need to be a developer and look at commit messages in github in order to understand the project is comming along nicely.\nUnfortunately I wasn't able to match and verify the listed skills and credentials of the team members with anything because there were no links provided and I couldn't google the team members with only their first name. So that's a bit unfortunate because it brings the credibility of the project down a bit for me.\nThe proposal does have a good budget breakdown although I am a bit sceptical about the sdk creation timeline because I've created an SDK similar to this one, and it is no small task, but considering all the listed credentials they might make it. On the other hand considering they've already built a javascript sdk, the process will be a lot easyer and speed up when they have a point of reference.\nThe proposal clearly explains the technologies and skills necessary and team member types that will be necessary resources to finish the SDK. Overall this is a solid proposal and the value to cost ratio is really good. A feasible proposal with the small caveat about the team members not having linked verifiable credentials.\n", "q1r": 4, "q2": "The success will be monitor through weekly meetings to discuss blockings and issues - basically the usual agile development standard so all normal there. As I already mentioned the proposers have listed a roadmap which anyone can follow and that makes it quite auditable. They have covered some SDG goals which is great because universal health coverage is something we all need to have. \nThere's a clear problem to be solved and a solution that would be relatively simple to implement, considering they've done it for the past 5 years and there already is an implemented working sdk be it in another language. Overall an auditable proposal. I would suggest to the authors to link the team members next time to bring full credibility to their work.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4962, "q0": "The proposal aims to create a Java SDK (Software Development Kit) for Hippocrades, healthcare infrastructure on blockchain that's being developed since 2016. From their website: \"Hippocrades provides a comprehensive decentralized healthcare infrastructure and protocol that unlock interoperability and security challenges among different health systems. This allows users - patients, health providers, and health facilities to manage and audit their medical records while making them shareable in a decentralized, private, and permissionless health exchange.\" \n\nThe team has several whitepapers, extensive documentation, both for the product, and for developers. At a glance, Hippocrades looks to be one of the best projects I've seen on Catalyst. It solves a great host of problems related to interoperability of healthcare systems. It is an original use case for blockchains. Suffice to say I love the project. Now onto the proposal.\n\nThe proposal is one of 4 very similar proposals in this fund. Each of the 4 proposals is to create an SDK for a different language: Python, Rust, Java, and Golang. The proposers have already created the first SDK on Javascript and now are working on these 4 languages. \n\nDeveloping an SDK that can be used by developers is entirely aligned with the challenge. That is, if the SDK has anything to do with a Cardano. There is no obvious connection between Hippocrades and Cardano. The proposers state: \"Since the team has been building the Healthcare Infrastructure in Cardano, other developers will be encouraged to build their health apps in Cardano as well.\" I wholeheartedly agree that if this project is being built on Cardano, other developers will build their health apps on Cardano as well, using Hippocrades. I'm just not sure Hippocrades is being built on Cardano. There is no mention of Cardano on their website, or on their whitepapers. \n\nI asked about this connection in their developer Discord server got this response: \"The Hippocrades Protocol (Hippr) talks about zero knowledge proofs being saved in blockchain. The health exchange is triggered by those proofs. The blockchain being used is Cardano.\". Since this is an amazing project being built on Cardano, there is some alignment between the project and challenge, yet not total alignment. The team makes almost no effort to market Cardano. It took me additional effort to even confirm how Cardano is being used. I don't believe this project will onboard many developers to Cardano. But this isn't something that can be fixed easily, and I believe this is a high quality project, so I rate this proposal with some leniency.", "q0r": 4, "q1": "The team is very strong, with two solid developers and a Harvard grad founder with extensive experience in the healthcare sector. These guys know the problem they're solving. It shows in the extensive documentation, 2 whitepapers, and their website. They smell of professionalism. With 1 month of work and a budget of 7500 USD, I think this is a fair amount for the work to be done. \n\nThat work is not too well defined however. The plan is very general. It has no specifics as to the work, the featureset to be implemented in the SDK is not specified. I'll give the benefit of the doubt to the team here, I think they know exactly what they want to build, as they have already created a Javascript SDK, and they have a lot of work done already on Hippocrades. For the future though, I suggest giving some of this information on the proposal as well.\n\nAlso, there is no Java developer on the team. None of the three listed in the team has Java as a listed skill. Who will develop the SDK is not clear. I assume they will hire someone to do it. But this again is information that should be made available by the team that hasn't been. \n\nSince I believe this is a high quality project, I rate this proposal with some leniency.", "q1r": 4, "q2": "What features the SDK will have is completely lacking. The proposers say: \"Since the team has already built a Javascript SDK, the approach and framework will be based on this and just converting it in a different language.\" We can interpret this as the featureset of the SDK being the same as the featureset of the Javascript SDK, but that is not entirely clear. The javascript SDK also doesn't have documentation, so we don't know what features it has. As such, what features the SDK will have is entirely unclear. \n\nFrom where the progress of the project can be tracked is also not specified. There is no public communication channel on the proposal. No Discord, telegram etc. There is also no github, even though github is mentioned in the proposal. This information is also not available on their website aside from a Discord server for developers. This server however has a total of 2 members. Maybe they just got started, but it wasn't particularly easy to find. \n\nSince I believe this is a high quality project, I rate this proposal with some leniency.\n\n ", "q2r": 4, "assessor": "z_assessor_2643", "no_vca": 9, "ne": 2, "ng": 3, "nfo": 4, "vca_o": 1}, {"id": 5925, "q0": "This is a very useful suggestion. When you want to participate in building a health app in a blockchain has lots of challenges. Aside from compliance, security, & data privacy, one has to learn blockchain-specific programming language. Often, programmers will spend time and effort learning new knowledge, and finding ways to practice it. However, this solution provides a Java SDK, which makes it easy for programmers to build healthcare projects in Java language. As a result, it will create a sense of excitement for them, attracting a large number of developers to Cardano. Thanks to the positive effects it brings, I am sure it will effectively solve the challenge posed.", "q0r": 5, "q1": "You mentioned that your group has more than 10 members, but I only found 3 members, it would be great if you provide complete information (experience, skills, knowledge, profile) ,...) about the rest. However, I am still very impressed with the information provided. Your team consists of experienced members, they have their own strengths, combined to form a perfect team. Besides, they have achieved successes such as: successfully building Hippocrades healthcare platform, creating JS SDK, holding many important positions,... . Those are proofs that this is a capable team, fully capable of implementing the project.\nDetailed route has been provided specifically. You've identified what needs to be done and allotted it to specific timelines. However, I think the marketing and communication for the project is also a very necessary thing. It will help increase the number of people to reach, increasing the effectiveness of the proposal. Similarly, in the budget section, also calculate the budget for marketing and communication. At the same time, the budget needs to be further clarified, because the budget is still quite vague at the moment. Budgets can be broken down by determining the number of people involved in each job, the number of hours worked, the hourly rate, etc.", "q1r": 4, "q2": "In addition to the issues I mentioned in the previous section (clarification of budgets, additional marketing and communications,...). In the section on the criteria for evaluating progress and success, you did a great job when you listed these criteria. However, it would be nice to have specific numbers, for example: once it's rolled out, it will get 100 people per month,...\nThe approach of this proposal is essentially the same as the JS SDK, just porting it to a different language. This will be a huge advantage, increasing people's confidence in its success. Although the information provided is not really complete, but with the above advantages, I firmly believe that this project can be implemented, it will bring great benefits to the developers in particular and the ecosystem. Thai Cardano in general. As a developer myself, I feel I get a lot of benefits from the project, so I totally agree!", "q2r": 5, "assessor": "z_assessor_2757", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9148, "q0": "\"This proposal describes each of the main ideas of the proposed project very well. They identified the problem of developers having to learn new languages to try out new technology like blockchain. So they wanted to create a Java SDK that would make it easy for Java developers to build health apps without spending a lot of time learning new languages. Their team already has a website called Hippocrades, a decentralized healthcare infrastructure and protocol, with the Java SDK already integrated, but they want to extend it to other languages. \nWith this project, other developers will be incentivized to build their health apps in Cardano. \nThe existing infrastructure also saves developers time thinking about security, industry standards, compliance, and data privacy among other things. \nThey will attract more developers to learn the new language not only to join Cardano but will be able to create quality health apps in less time. They are planning to build SDKs for other languages like Golang, Rust, Python.\nThey built the core of Hippocrades Infrastructure and have Javascript SDK for a long time so their risk is pretty low. Thereby increasing the level of prestige about the success of the project greatly.\n\"", "q0r": 5, "q1": "\"Their plan clearly includes 5 weeks with work items for those weeks. A list of the costs of each position is also given, but if the team could add more details about the responsibilities of each position, it would probably help this section be more detailed.\nTheir team consisted of 10 people and in this proposal they specifically listed 3 key people in the project along with their experience clearly. I have a small suggestion that the team can add a link of information like each person's LinkedIn for readers to learn more. In addition, the responsibilities of the remaining 7 people in the project can also be stated.\n\"", "q1r": 4, "q2": "\"The team came up with 5 protocols that they have followed for the past 5 years that also apply in this project to make sure it goes well. As for the tasks and work of the Development Team, they are monitored and managed on Github.\nThey track success by marking completion of each task performed on each module. When the Java SDK is deployed and available in the Hippocrades infrastructure for developers to use, the project is complete.Through all the specific and simple information above, this project is highly feasible.\n\"", "q2r": 5, "assessor": "z_assessor_3023", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Hippocrades has built a health infrastructure with APIs for devs to easily create a health app. Currently, it has a Javascript SDK already. We want to create an SDK to cater Java developers.", "experience": "We are from the Hippocrades Teamthat has built a decentralized healthcare infrastructure for Cardano. We have been selected in the 1st batch of the Ariob Incubator / Iceaddis program in Africa which is supported by Cardano for high-potential startups. A Dev Portal is already set"}