{"id": 422429, "author": "thecatalystschool", "title": "Catalyst School Fund 10 Operations", "url": "https://cardano.ideascale.com/a/dtd/422429-48088", "category": 26597, "amount": 9250, "description": "Proposers, Assessors, Voters and other Catalyst members still struggle to understand how Catalyst works and how to play their roles.", "f6_no_assessments": 14, "f6_rating": 4.785714285714286, "videos": [], "media": [], "f6_assessments": [{"id": 1723, "q0": "Certainly the proposal is extremely important for our community and also fits the challenge. In general, the idea is to continue the work of the Catalyst School, which is a place aimed at increasing the impact of Catalyst as a whole (as they well define), this is done through teachings to different actors of the catalyst (either a evaluator, tenderer, etc.). The group works by teaching new people who arrive at Catalyst how to insert themselves and how to act in a correct and impactful way, and with that it increases the number of active members of our community and helps people to develop their tasks properly. This fits the proposed challenge because, among the types of people that the School will help are developers: as much as this group is used to dealing with the technological world, as is well stated here, Catalyst is a very unique and that works under its own rules, so that everyone needs a light, a help to understand what this project is and how to embark on it. With that, the two KPIs cited by the proponents (number of developers actively building on top of Cardano + a sense of community and conversations. Having people around to talk to) are well addressed through this proposal. It is positive how they explain the main topics covered by the School (introduction to Catalyst, bidding on Catalyst, how to be a bid evaluator and how to be a Veteran Bid Evaluator); and we also know how these teachings would be passed on (live sessions and workshops, 1-to-1 and group support in many different languages, interactive website and other Catalyst-related workshops). Total confidence is conveyed in the impact that this project will generate, since the group has been operating since fund 6 and already has a lot of experience in the activities that are mentioned here, they already have an idea of ​​their mistakes and successes and how to mitigate situations that by chance come to appear. In addition, they have several established partnerships, some examples cited are the groups Gimbalabs, WADA, Prefecture of the East, Sustainable ADA, among others; such groups themselves are already well established in the ecosystem as well, having funded proposals and proven work. Another positive point is that they attach various media to prove the works that are cited, so that those evaluators who are unaware of the project can find out about the situation and have a guarantee of the seriousness of the School's work, seeing in practice some things that have already been made. A comment I would like to make, which is not a criticism, it is more a question: in what way did they improve the marketing so that the group could have more engagement, more people participating in their sessions, etc? Apart from this small question that was raised to me, the proposal is without a doubt totally positive and impactful for Cardano and also fits the scope of the challenge.", "q0r": 5, "q1": "The proposal is entirely viable. We know in great detail all the necessary information regarding how the project would be put into practice. Starting with the script, the proponents explain exactly what would be done and why. As they already have a lot of experience in relation to the practice of the project, they realized that it is more productive to have fewer sessions, but that they are better designed and have more people participating. And the sessions are split based on which stage Catalyst would currently be in. For example, the first week the session would be for the introduction to Catalyst only, as we would be in the insights sharing phase. In the second week, when the submission of proposals was opened, there will be a session to introduce Catalyst and also two sessions on how to propose, how to submit proposals in the best possible way. This logic follows the timeline, for example, when opening to evaluate the proposals, a session would be held addressing this topic, and so on. A comment that I think is pertinent to make would be in relation to the 1 to 1 support sessions: in which languages ​​would they be provided? How would the people to be taught be selected? How would these meetings take place, how many would they be, how would they be held (through calls, probably). It would be interesting to have more details about this part. Moving on to the next topic of analysis, when it comes to cost management, the group is quite conscious when it says that they realized in practice that some activities that they developed in previous funds took less time than what was planned, so they reserved fewer hours (and as a result, they asked for less funding for those parts). It is also very positive as they claim that there are 2 thousand dollars left over from what was requested in the previous fund and that is why they discounted the amount in relation to the current financing. In general, we understand very well how the money would be spent, since we know the hourly value of the professionals involved (50 dollars per hour), we know what activities would be done and how many hours they would take, approximately (for example: representing the project externally (eg TH and Community Initiatives - 10h/fund; manage project funding - 4h/fund; fill in any role if needed - 5h/fund) They separate activities into some categories, such as the management part , document creation, gitbook maintenance, etc. With this, in addition to understanding the whole, it is possible to know how it is categorized, so our understanding could not be more solid. Finally, analyzing the team part, it is passed an instant trust in them as they are already quite experienced developing the activities of the School (they are already working on it for several funds) Not enough, they attach short descriptions about each member involved, so we know their names, areas of activity and some projects in which they have already been involved.\n", "q1r": 5, "q2": "The proposal is highly auditable, but I would like to make some suggestions as well. Talking about the auditability of the process, it is said that progress reports will be made, which would likely contain data not only on what was delivered but also on the work behind such partial results. Would it be possible for the community to also have access to such information, how has the team been organized to keep the project in full operation, if there were problems and challenges along the way, how were they overcome, etc? Regarding the partial results, we undoubtedly have a lot of material that can be analyzed here, because, as the proponents report, the workshops are always uploaded to youtube (so that we could see in practice the products that would be generated by the initiative); written content would be available on the site; and a list of members requesting individual follow-up would be provided - this way we could contact him directly, if desired, to understand how these follow-up sessions were going, if they were being done as promised and in a proper manner. Talking about the final success, this could be measured by some metrics, like the number of workshop participants (maximum and average) + 1 to 1 support sessions provided + views on our YouTube videos + hits on our website. In addition to these quantitative data, I think it would be interesting for the School team, at the end of fund 10, to collect qualitative information that would allow us to understand the practical impacts of the project. For example, some new members could be gathered, who were introduced through the help of the School's activities, and it could be said how each would be acting in our community now. For example, who would have become a bid evaluator; who became a proponent: what projects would they be looking to develop and what proposals would they be creating to submit to fund 11; if suddenly they brought other people into the community themselves (they commented with acquaintances about Catalyst and its opportunities; etc. That way we would have a very complete understanding of the impacts generated by the proposal. However, I believe that the idea is fully auditable, not only by the information provided but also for the various ways that the community itself could monitor whether the work was being done (in addition to participating in the workshops, we can check what is being posted on youtube, the new content on the site, etc.) With that, this topic It also deserves top marks, in my opinion.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 13, "ne": 9, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 3489, "q0": "Proposal is for keeping the operation of Catalyst school, which has been running since past funds. Catalyst School plays an important role on the ecosystem by onboarding new member and providing guidance and updates not only to new but also already existing members. Moreover, it fits well in challenge, as it can aid the increase of the challenge kpi of \"A sense of community and conversations. Having people around to talk with\" and Reduce wait time of unanswered communications with developers to 24 hours\", just to mention 2 examples.\nProposal does a good job on presenting the scope of work of the Catalyst school and showing its value proposition. As suggestions, it would be nice to see here some general numbers related to past funds/months of acitvities, as how many people they helped, how many of them got funded and etc. They mention an important challenge in the risk part (low attendence in past fund) and their solution will be based on the improving marketing and outreach strategy. it does make sense but iti t would be also nice to understand how this strategy will work.\nOverall, due to the relevance of catalyst in the ecossytem, my rate is 5.", "q0r": 5, "q1": "There's a fine plan in place where the acitvities to be developed here will be syncronized with the catalyst funds. They highlight how each phase will happen and when. However, some other acitvites, more related to the management part/support could be listed, as the ones for the marketing/outreach, which was a key risk identified in the impact. This would help to understand what they have in mind about that.\nBudget breakdown is very detailed and transparent. They include everything that is related to each budget line and the necessary hours to perfom them. It's also very clear the explanation on why this budget differs from the one in past fund.\nAs for the team, there are 7 people already committed with a lot of experience in Cardano, Catalyst and in running catalyst school. their background description is good but links to reference could be provided.\nAll in all, I agree the project is feasible but minor improvements could be done in the plan section.\n", "q1r": 4, "q2": "All the content generated by them will be avialable to public, uploaded online and several kpis are provided. However, specially considering their past experience, they could set some goals for these metrics in order to fully assess if project was a success. This even more imporant now due to low attendence in past fund. The feedback from participants could also somehow be incoporated to these measurments.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 16, "ne": 0, "ng": 16, "nfo": 0, "vca_o": 1}, {"id": 3570, "q0": "The proposers want to keep the community obboarding gateway open, meaning that there will always be a free place to onboard new people, content to watch and ecucate onself on project catalyst along with the workflows schedules and so forth. I deeply believe in this idea and people like Victor Corcino, Lucio Baglione and Felix Weber have personally and helped me with onboarding when I was introduced to project catalyst and onboarded by the swarm. I am so grateful for them and their work and I can see their work has payed off and the impact they have is immence.\nI'd say this proposal is covering some of the basic challenge settings like onboarding developers into the cardano family, although I might feel this project could be suited in other challenges equaly well. This is an integral part of the cardano community and one of the most critical onces, since it's taking the introduction to anyone new to the entire ecosystem, showing them the ropes and opportinities for them.\nThey have proven to be able to scale with scaling of the ecosystem, so I'm not worried about that. I don't see anything missing from this proposal as they are veterans, and have done many proposals that were funded prior to this one, just as important. They do have a proven track reckord and I know that is important for any voters that hear these names for the first time.\nOverall I think this is an impactfull proposal, that will continue to serve the future and present members.", "q0r": 5, "q1": "The proposers have listed their credentials, although I don't need to verify them, since I know them by name and reputation besides checking their credentials when I got started in the programe. They bring credibility to each proposal they take part in, and all of them are connected in one way or another with helping new people and providing the process and infrastructure that makes things easier.\nThe roadmap is detailed enough that anyone can follow along and the sites provided are always there to get the info you need or the meeting with someone that could help you. The proposers have great ideas and have been implementing them for the last 9 months by my accounts, probably beyond that timeframe as well. The time table seems reasonable for the work they want to do and I really like the workshops idea because I've been part of 1 or 2 and it has brought me great value for the time I invested in them.\nThese are known members of the community now only by me but anyone in the telgram channel knows Lucio is the main figurehead when it comes to support tooling like the pa and vpa tools along with the proposer-tool any many others that help the community be more efficient.\nI also like the youtube content, because that's one of the ways to show you're serious about your work and any voter can quickly check the quality and content being provided. Overall I think this project is in sync with what's already been done and is taking care of providing maximum value for each new fund. This is a feasible proposal IMHO so I'd be sure to vote for it, when the time comes.", "q1r": 5, "q2": "The project is as public as it gets so there should be no problem for anyone to follow alongside the progress of the project. The KPIs are on point and metrics like number of workshops or 1-to-1 support sessions provided are a really good indicators of success. The problem statements that voters and new members are struggling to understand how catalyst works is an accurate description, because there are so many moving parts to this whole machine and it's good to have people to help you navigate and plug yourself and your skills if you have a desire to do so as I did. The solution is straightforward - helping all people understand and integrate into the environment.\nSo far they're doing a great job, and I'm sure they will continue to do so over the course of project catalyst evolution. The proposers have a knack for knowing what new members of the community don't grasp and what is important for them to understand now and what can come later, so that kind of prioritizing is very important when there are such vasat amounts of information available.\nOverall an auditable proposal. Good luck to the team behind it.", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 12, "ne": 4, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 4455, "q0": "Education is important at all stages and understanding how to navigate and assess proposal with constructive feedback is key to growth cardano ecosystem. The Catalyst School is already a pretty solid group within our community, known for really being the best place for new people to get involved with the Catalyst process. The proposal of \"Catalyst School\" is quite appropriate at this stage, in order to promote more countries and more high-quality personnel to cardano for development. All these explanations make really understandable the positive impact of this proposal as well as its previous successes.", "q0r": 5, "q1": "The problem statement is very clear and so does the plan and experience. The team previous work is adequate evidence that they are capable of delivering on this proposal. They have created useful educational resources in the past, and plan to build on that success. They have provided a clear roadmap with measurable and auditable goals, and a clear budget breakdown and explanation of how the funds will be used. The proposer also realized that the budget they requested in Fund 8 were overestimate, then they improve their process and work, then decreased their requested budget for Fund 10, which is great! It was a responsible and professional act of an organization like the Catalyst School.", "q1r": 5, "q2": "The many partners, as well as the establishment of this project from several funds within the community are elements that provide considerable indices of confidence.\nThe milestones and outcomes of this project are simple to track through the various channels identified. In terms of metrics quantitative tracking (number of youtube videos uploaded, number of workshop attendees, etc) is great. I believe it is time to take this to the next level of qualitative measurement to generate an understanding of how well the materials and workshops are received by Catalyst School students. This should also help with further improvements and innovations.", "q2r": 5, "assessor": "z_assessor_2553", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4664, "q0": "This one is a no-brainer, there is a need for the Cardano community to have this type of educational service. Our ecosystem doesn’t function by itself; we need well-informed members that can participate as we grow our community. The proposers more than demonstrated the value of this service with ongoing educational workshops and live sessions. I too as a PA benefited from the educational materials produced by this group and can state without a doubt that my onboarding would have been much more difficult without it.", "q0r": 5, "q1": "This is clearly a useful service and would be great if each funding round could allocate funds to keep it going. That said, the proposers have more than demonstrated their ability to meet its goals and objectives. They have an experienced team that meets all the Catalyst requirements set forth in our guidelines (Work product references from prior funding rounds, GitHub repository reference links, etc.).", "q1r": 5, "q2": "The proposer provided a clear roadmap with milestones to more than adequately measure the progress and success of the project. The proposal is in line with the Catalyst requirements Metrics that define the success of the proposal. The only item of consideration I would like to see added is a survey which could be made available at the end of each training session. I think they are a good tool for the trainers and the participants. It will help to highlight things that are being done right as well as areas of improvement. ", "q2r": 4, "assessor": "z_assessor_2581", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5005, "q0": "Being new to the Catalyst program I agree it can be quite intimidating and I often wonder if I am even doing it correctly.  I did over 20 hours of research about Catalyst and being a CA (now known as PA) and it was difficult to find relevant information about a specific topic without watching/reading the same things over before finally finding the relevant information I was looking for. Having a school for Catalyst that is laid out in a user friendly format would cut down on hours of research and help On board new people to project Catalyst with ease and precision.  They have been functioning since fund 6 and I have just now heard about them and will be doing a further deep dive into there operations but I believe the Cardano Ecosystem would greatly benefit from having this Catalyst school.  Catalyst funding is a new concept and is different from every other chain so people do not have a reference point and must learn everything from the very beginning.  They address scaling in the sense that it will On board seasoned PA and Proposers as the school begins to grow so as long as the growth isn't exponential it should be able to maintain scalability and it will always have a good pool to recruit from as more people learn how to utilize Project Catalyst. My previous statement also touches on sustainability having more people to hire from or donate there time to educating people about project Catalyst and as long as Catalyst is up and running it should continue to grow and as long as new users join the space there will continue to be people to educate or even refresh there skills or find specific information they are looking for easier than searching the vast space.  ", "q0r": 5, "q1": "This Proposer is clearly very familiar with the project Catalyst and has laid out all relevant information in an easy to consume and propose manner.  All the team member are laid out in this proposal along with names and exactly what there role will be in the school and in the entire process.  The budget is laid out perfectly with every aspect broke down and laid out each step of the process.  The budget even gives a per hour rate which is completely broken down so we can see where every dollar amount will be spent.  They are also only requesting a small amount (9250usd) from Catalyst and will be stretching every dollar according to there budget breakdown.  The roadmap is broken down into an 8 week process and explains in great detail what exactly they will be providing each week.  They provide multiple sites to utilize there teaching experience, Linktr, youtube, discord, twitter, a website, and something I am unfamiliar with gimbalabs. The team members have all disclosed there names and there backgrounds in the space along with very specific and in detailed analysis of what they will be doing for the school and their project. ", "q1r": 5, "q2": "All the information will be assessible to the public on multiple platforms.  They will be doing frequent uploads of there workshops uploaded to there YouTube Channel. All of their content will be available on their website.  they will provide a list with contacts from all the community members who asked for 1-to-1 support session. They will be tracking their success through a means of measurement consisting of new On boarded members, Youtube views, website traffic, and workshop participation/enrollment on a per week basis. The roadmap is hands down the best one I have seen on any proposal and goes into great detail about the project breaking each week down from an 8 week overview. ", "q2r": 5, "assessor": "z_assessor_2662", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7603, "q0": "This is a brilliant idea that will help promote the Cardano ecosystem by providing a Catalyst school.The problem described is clearly aligned with the challenge.The team has done a great job by identifying the proposal with the right challenge .The proposal clearly provides a precise solution that will impact catalyst as a whole by improving the contributions on the different roles and players in the ecosystem.The proposal also captures key important metrics under the campaign breif by providing the value the participants will bring onboard to the Cardano ecosystem through Live sessions and workshops.And also the\n1-to-1 and group support in many different languages.\nInteractive website and\nOther workshops related to Catalyst.The proposal also has a clear plan for the future sustainability of the project by  providing measures on which they can work with to actively keep the Catalyst school.\nThis I think is highly impressive from the team inputs and will promote the Catalyst and the various roles in the school to the top and to make Cardano a best place to be if Funded.", "q0r": 5, "q1": "The team has provided relevant links to the proposal, showing that the project is already in action in previous funds.The team also have knowledgeable people who are well equipped the Cardano and also partnership with other blockchains.The team has alot of experience and have provided relevant links Should they be funded I think this is really impressive. The proposer has done a well by providing a detailed budget outline that has been broken down into identifiable bits on how they are going to execute the project should they be funded.The proposal also outline the milestone by providing the duration for which the proposal will be funded and also includes the resources and equipments needed for the project.\nMoreover ,the team has impressive by providing a well planned timetable showing the content of the topics for the catalyst school. The proposal has a great team with array of experience which shows the role each member plays to the effective development of the ecosystem.The team has has alot of technical experts in the Blockchain technologies.The team has provided the risk involve in the previous fund such as low attendants in fund 7 but has done great by providing strategies to market their workshops to promote the Catalyst school.", "q1r": 5, "q2": "The proposer and team has provided  a clear outline on how to measure the progress of their project should they be funded.They have also provided the milestones and the duration for the execution of the proposal by providing enough evidence on how the success of will be measured by reporting to IOG in the bi-weekly coordinator meetings, and to the challenge team in the monthly meeting. Again the the outcomes of the proposal seeks to solve the targeted problem stated in the proposal by providing the Proposers, Assessors, Voters and other Catalyst members a clear understanding on how Catalyst works and how to play their roles effectively to promote Catalyst. The proposer and team has been doing a great job in making the channels and links available to everyone to gain  insight into the Catalyst school. The team has worked with alot of reputable organizations in the Cardano ecosystem and will be able to excute the project.", "q2r": 5, "assessor": "z_assessor_2906", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8955, "q0": "We have seen many a times Proposers, Assessors, Voters and other Catalyst members forget their role and doesn't even how to contribute to catalyst development , hence by schooling to all the members of the catalyst depending on their role is a great idea , where it keeps every member of cardano engaged towards development of blockchain, just by buying the coins alone doesn't help the community to develop, there are others ways where members can contribute for cardano to be for efficient which can be schooled in this idea , hence this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The proposed team has all kinds of members involved in it such as Veteran assessors and proposal mentors, education professionals, very active Catalyst community members since early Funds, hence with such a team provided developing a website where it can conduct workshop and also communicate 1v1\ncan be achieveable.\nThe Catalyst School is already helping the community since the beginning of Fund 6. where it has been using reviews of the people to make the school more enhancing and more efficient ,since with team already provided and has started schooling since fund 6 with minimal risk involved the  plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The presented proposal has introduced all the team members who'll be involved in the project and has displayed the experience of each person in expertise field and their contribution in cardano, the audit even contains some of the demo of their schooling and 1v1 conversation which are efficient.\nThe presented plan has many partnerships for their school already which has been displayed, The audit contains detailed manner budget breaking idea of the project, and has clear timeline structured to complete the project ,With decent key indicators such as continuously measuring the engagement of people in YouTube channel, the information provided is sufficient to audit the progress and the success of the proposal.\n\n", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 9851, "q0": "The proposal offers a solution that effectively addresses the challenge. The challenge of a lot of people being in the darkness of the Blockchain industry and project catalyst is solved as the proposal seeks to give a great roadmap to enhance catalyst impact by improving the contribution of all persons. It can also be noted from the proposal that, the proposers seek to adopt a hybrid approach in their implementation which will suit different people as people learn by different methods. This proposal is great as it addresses the challenge.", "q0r": 5, "q1": "This proposal is a continuation of a previous project in Fund 8 so makes it very possible to see the successful implementation of the proposal.\n\nWith the experience and plan outlined, this proposal is mostly likely to be implemented successfully if proposers stay committed to the action plan outlined in respect to the timelines given.\n\nThe team has done well by giving out information about themselves and their field of expertise, which gives them a great stand in the successful implementation of the proposal.\n\nWith the experience and plan given, the proposers will be able to implement successfully the proposal, as they already have a great track record of work concerning the proposal. So funding this proposal will be a  great advantage to educate more people on Project Catalyst, Cardona ecosystem and ultimately enlightenment in the Blockchain .", "q1r": 5, "q2": "From the proposal, it can be noted that, the information provided is absolutely clear and accurate for easy auditing of the progress and success of the proposal. The proposers set realistic KPIs with an understanding of timelines that are specific to the activities. \n\nThe budget of the proposal too is comprehensive and well out laid as it is easy to understand and every milestone is appropriately budgeted for.", "q2r": 5, "assessor": "z_assessor_3109", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 9994, "q0": "The problem given is greatly align with the problem. The way the team has also provided us with Individuals description. And Also the risk also need to be considered very seriously when organizing such a problem next time. Attendance record taking is so much  important and the team need not to forget that also. The way the team gave details more explanation about the issues and idea to fund catalyst school. I believe the proposal greatly address the challenge. I believe the team will highly lead this to success. I believe the founded will lead to success. It has also address the challenge at hand ", "q0r": 4, "q1": "Given the experience and the interest stated here is much enough to lead to success,the details with Cadano. The idea of building catalyst school and making it free tell how much seriousness that the team have put up. They have also given details about their working experience and I believe also their interest and hardworking minds to get fund catalyst school is a great idea. Each team member has a great time working experience. This experience and plan stated is likely to get the proposal implemented. This is why I believe is a great proposal, also the proposer tried getting Great time time to schedule for this project. And I believe with each of them having working experience makes it okay. This why I think is a good proposal. ", "q1r": 4, "q2": "With the information given is enough to highly audit this proposal. The success of the first training month will be great and most amazing. I also love the way the team have taken time to explain and describe their qualifications is so great and the milestone given are sufficient to evaluate the success of this project and therefore will help grow Cadano.I believe the information given in this proposal are good indicators for evaluating success.there is clearly identification and description of the challenge. ", "q2r": 4, "assessor": "z_assessor_3140", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 10918, "q0": "The Catalyst School is a place created to enhance the impact of Catalyst as a whole by improving the contribution of all its different players and roles. We onboard new members and help improving their skills along the way, in any way they decide to engage with Catalyst. With a great consortium of teachers already assembled and lecturers continually being put through the training program themselves, connected to the Project Catalyst Discord group along with recently delivering Insight Sharing workshops, this proposed solution is very much in line with the objectives of this fund.", "q0r": 5, "q1": "The team is capable of implementing the proposal. The proposers have made a good presentation distinguishing their abilities and also linking us to their profiles. The team composed of 7 members includes a mix of skills and experiences, background in IT amongst other, with relevant experience inside the catalyst such as being a proposer, or veteran assessor. Therefore it is very likely that this proposal will be implemented successfully. But It would be more convenient if we had links to the team's social networks or linking profiles.\n\nThis proposal has provided a road map with weekly milestones on each of the above causes. The team have chosen a work plan that works in sync with catalyst phases so will get maximum benefit out of it.\n\nThe total budget is $9250. I should mention that this is a very efficient use of the budget given the scope of the proposal. The budget is well detailed and explained. An hourly rate of $50 is taken into account.", "q1r": 4, "q2": "Audibility is quite good and complete. The team makes it clear that they are already very experienced in delivering their workshops and evidently comfortable with public presentations. What I like about the proposal is that the proposers stated what and where content would be produced and how can the community track what’s happening. And it’s good to see that they also provided some concrete actionable KPIs with which we can measure the outcome of the project. For example, number of workshops participants (maximum and average), number of 1-to-1 support sessions provided, number of view on our YouTube videos, number of access in our website are all good output metrics to track this project progress. \n\nMy suggestion is that each time they update, their report should include information about what improvements were noticed by the teaching team regarding workshop participants", "q2r": 4, "assessor": "z_assessor_3205", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11855, "q0": "The proposer managed to clearly described about the real problem and proposed solution. Not only that, the proposer also provides their detailed reasoning of proposing this project, and mention their planned delivery methods and topics. As a new member in this community, I found that the flow for the whole Project Catalyst process is a bit confusing to learn alone, and by providing free sessions / workshops to introduce Catalyst, not only will it help new members to understand the process of each funding, but also helps to understand how to do the role they’re interested in (PA, VPA, Proposers).\n\nThe proposer also mentions the proposal’s alignment with the challenge’s KPI, including helping developers (proposers) to create a proper proposal. This proposal mentions trackable success metrics such as participants and video views. The proposer knows the risk (outreach) and learning from their previous projects, they managed to grow their existence in the community and improve their marketing strategy. The proposer also stated that this project will most likely return to Catalyst in the future, as they believe that the project should be free for everyone with continuously growing partnerships.", "q0r": 5, "q1": "The proposer provides details about this project implementation in previous funding, indicating that this project already has been carried out well and will be successfully implemented with improvements from previous evaluations. The proposer provides brief detail about the team members with experience in Catalyst community, although giving LinkedIn page would provide more general background information for each member. This proposal has a clear roadmap and milestones by providing sessions following Project Catalyst phases in each week. The budget breakdown is listed well too, with estimated cost per hour as the base calculation, following by each required role and their workload, complete with estimated hours of work for each point. The proposer also states about budget comparison with previous funding by recalculating their estimation for some workloads. Overall, this proposal provides detailed information about the project details and improvements from previous funding.", "q1r": 5, "q2": "As stated before, the proposer provides a clear roadmap and milestones, with trackable success metrics, such as number of participants and video views. Although, there is no metric that measures user impressions/opinions of the product’s quality. Receiving feedbacks from workshop and 1-to-1 participants would provide user involvement to evaluate the product, and might help the auditing process. Showing brief statistics of the project implementation would also give transparency about the project growth over time. The proposer describes about providing progress report in meetings and workshops recordings in their YouTube channel to track the project’s progress. This is good because auditors can check the workshop quality in each week. The Catalyst School also provides Telegram and Discord as public channel to give their project updates.", "q2r": 4, "assessor": "z_assessor_3296", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13860, "q0": "Learning about how Catalyst works might bring newcomers and improve the dynamic within the community. The Catalyst School is a basic need in Cardano Catalyst in order to put some clarity in its functioning. This proposal effectively addresses the challenge of improving the Developer Ecosystem right away. For every role to be played correctly and to enhance the general dynamic of the community it might be super useful to have a digestible platform to put everybody together and help newcomers understand the Cardano method of working and funding. If Cardano Community wants to consolidate and expand not only as a community of developers but an inclusive one, its rules must be really clear for everybody. Without clear and accessible information we are losing a wide range of newcomers and might be allowing old members to misunderstand their roles. This can only lead to loss of effectiveness. ", "q0r": 5, "q1": "The team's experience in previous funds gathers knowledge to improve their new proposal. It is highly likely that thanks to their useful experience, they successfully implement the proposal. The time line adjustment, including also budget into Fund 10, shows the team knows the challenges ahead. It is interesting for our community funding projects that have long-term aspirations for the improvement of our internal dynamic. Sessions and workshops synchronized with Project Catalyst phases is an efficient way of making the best with the assigned resources. Experience and plan looks consistent and strong.", "q1r": 5, "q2": "Reports to IOG in the bi- weekly coordinator meetings are sufficient to successfully audit the progress and the success of the proposal. This type of flow communication with the community is guaranteed success of exchange and dynamic. 1 to 1 sessions are the best way to assure real educational improvement in the different members of the community. The sharing of the listing may be sufficient for auditing but it can also be interesting to share impressions and key doubts in students so all the community can enhance. Youtube channel and website are open source for easy auditing during the process. It might also be interesting sharing this audiovisual content in a strong media communication strategy.", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 14474, "q0": "The proposal is a Catalyst school where the skills and understanding of the Catalyst community members will be enhanced. This proposal stems from the insufficient understanding of how Catalyst works and the roles involved that are happening in the community. Catalyst school as a solution will onboard new members and provide them the skills to interact with the Catalyst community as a proposer, assessor and many more. Better training will allow for better contribution made by these members, which altogether facilitates the fullest growth of the Catalyst community. The proposer goes on to list out all the activities they will conduct to support the learning process. There will be live sessions, workshops, 1-1 and group meetings (in different languages) and interactive websites. A table of contents is also given to see what topic the proposal will be delivering. The proposal has already been in progress since F6 and has several deliverables in the form of workshops in previous rounds. The proposer is able to specify the necessity of Catalyst school on the premises of Catalyst different methods of funding compared to conventional funding platforms. This highlights how useful it is for there to be a platform such as Catalyst school where information and knowledge about how Catalyst works and how to succeed is provided in a convenient way and provide connection to other community members for knowledge exchange. Partnerships are also formed with other educational stakeholders in the Catalyst community, which can help diversify Catalyst school while expanding its impact. The overall impact of this project will be to create a welcoming, open environment for anyone who wants to join the Catalyst. The proposer is also able to point out how this will align with the goal of getting more people to contribute to the Cardano community. The main risk is identified as outreach with a low attendance rate, which has happened in their F7 and therefore, they have developed a mitigating measure in the form of marketing strategies to attract more participants. The results of this is reported by the proposer as an increase in the number of people going to workshops and support sessions, which is a good indicator of how the proposer will overcome this risk.", "q0r": 5, "q1": "The feasibility is positive. The roadmap and milestones are presented clearly with elaboration of what they plan to do and its correlation to their proposal in F10. The F9 proposal will be conducted in 6 weeks, with clear activities accompanied during each week. The budget breakdown is another strong point of the proposal. The key items are clearly listed in different sectors (Project Lead and Management, Documentation & Auditability, Core Content, Website, Marketing/Media). This is a really exhaustive listing covered in a well-rounded way). The proposer also accounts for each expense. Money will be paid according to working hours and the proposer specifies working hours for each of the small key items, which clarifies the budget breakdown. Activities in each sector are also clearly presented so we can understand how the proposal will be built step-by-step. The proposer also points out how the budget has lowered compared to their previous proposals and gives an explanation of how they manage tasks more effectively and cut down working hours, eventually saving some expenses. Therefore, although the budget will need $11,250, they will only ask for $9,250. Information about the team members are provided and it shows that they have the relevant experiences to work on this project (web development, community member of Cardano and Catalyst, proposal mentor and veteran assessor,...). The proposer will need more funding in later rounds and give a suitable explanation: the Catalyst school will be a free service. As it is an educational platform to improve human resources of Catalyst, it is reasonable that this project is subsidized by the Catalyst treasury.", "q1r": 5, "q2": "The auditability is good as meetings will be conducted to report progress to IOG while other external audits such as posting contents from workshops to Youtube and their website. The vision of success is well-defined: to generate deliverables according to schedule and to onboard a vast number of people. Key metrics for tracking are measurable and clear. Regarding SDG goals, it is true that the proposal is most aligned with SDG 4: “Ensure inclusive and equitable quality education and promote lifelong learning opportunities for all”.", "q2r": 5, "assessor": "z_assessor_4055", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Catalyst School, a place to enhance the impact of Catalyst as a whole by improving the contribution of all its different players and roles.", "experience": "Veteran assessors and proposal mentors, education professionals, very active Catalyst community members since early Funds, already Catalyst School funded team, Catalyst Circle ex-members and more."}