{"id": 422451, "author": "fluxcap", "title": "Immigration Documents on Chain Pt.2", "url": "https://cardano.ideascale.com/a/dtd/422451-48088", "category": 26597, "amount": 3900, "description": "This is phase two of a Fund 8 project (https://cardano.ideascale.com/c/idea/398633/comments/403972) that develops a working example that translate immigration documents to Atala/PRISM for compliance.", "f6_no_assessments": 7, "f6_rating": 3.904761904761905, "videos": [], "media": [], "f6_assessments": [{"id": 574, "q0": "This proposal includes a problem statement, and solution that are well aligned with the challenge question; \"How can we create a positive developer experience that helps the developer focus on building successful apps?\" By building this open source tool that will allow university students to \"circumvent the need to have governments as the issuer of the credentials: instead focusing on the possessor of the credentials, and they would \"issue\" their own credential onto the chain.\" The secondary impact of this proposal will be too also bring more academic institutions into blockchain tech and the possibilities Cardano presents. Additionally as the proposer has mentioned, it will likely involve immigration compliance concerns. While this is a risk to the proposal, it could also be a positive step for Cardano, as open source decentralized technology can showcase to regulators and compliance officers that we can build better alternatives too many of their existing systems. They are more likely to look deeply into this technology, only when it becomes necessary to do so, and this could be a small but significant step in that direction. The budget is also a small ask, for a project that could have a large impact. This could eventually scale up to multiple universities around the world adopting solutions like this one using rootswallet https://www.rootsid.com/ or other Cardano DID alternatives like Atala Prism or IAMX ", "q0r": 5, "q1": "The proposer is the supervisor of immigration compliance at the Univ. of Arkansas, and therefore uniquely qualified to make this proposal a reality. The proposer has also provided sufficient information about their technical skills and abilities and relevant background knowledge of this proposal.  The budget is very reasonable, with a timeline for completion of Spring 2023. The proposing team has the skills and resources required to implement this proposal, with a clear understanding of the technology and architecture. ", "q1r": 5, "q2": "This project will be open source on Github, and therefore easy to track by the Catalyst community. In addition, the team will be providing \"contributions in both document and source code\"  provided at the end of the project, as well as setting up a discord channel. Due to the limited scope of this project, and the relatively low budget amount requested (compared to other larger catalyst projects) I do not believe monthly reporting to Catalyst is critical for this project, as the Github repository should provide enough transparency for those interested, and more documentation will be provided upon completion of this project. ", "q2r": 5, "assessor": "z_assessor_2108", "no_vca": 17, "ne": 1, "ng": 16, "nfo": 0, "vca_o": 1}, {"id": 754, "q0": "The prosper aims to have a working example of a student minting their immigration documents minted as an NFT onto Atala / PRISM and then have the officials at the Arkansas university verify the immigration papers. This is a wonderful example of a real-world application of blockchain and a successful trial would deliver a great message to the developers’ community of the capabilities of Cardano. This has the potential to onboard new developers and attract developers from other blockchains and therefore addresses the challenge setting to attract high-caliber developers. As a developer, I feel motivated to see this practical use case come to life. The use case has very a large market which is all universities in the US and worldwide.", "q0r": 5, "q1": "The proposer evidence their experience with LinkedIn profiles, Jim has an illustrious career of over two decades and Steven has been a valuable member of Cardano Catalyst since fund 6 as a CA and vCA and works at the university where the trial will be done. The budget is set at $3 900 which is very little in my view for the proposed deliverable. This is a continuation of a previously funded proposal where the budget was similarly set very low at $1 800. This is a very reasonable budget to demonstrate a use case of DID formally at a US university. The proposal plans execution conservatively to be delivered by spring of 2023 leaving ample time to plan the next steps. The proposers say they have built a front-end to process the documents, but at the time of writing (3rd July 2022), the website https://pillarwheel.io/ was not accessible. The proposers articulate the technology they will use Atala/PRISM, Root Wallet, and Angular. There is a risk of compliance that the proposers highlighted of using real immigration documents, the concern is valid and the proposer considers this in their planning.", "q1r": 5, "q2": "The deliverable is to have a successful trial at the University of Arkansas for the officials to verify immigration papers using the blockchain. The deliverable can be audited objectively. The proposers will open-source the code on Github for the community to review and discuss on Discord and social media. What success looks like is well articulated which to have a university use this system to confirm the immigration papers of foreign students.", "q2r": 5, "assessor": "z_assessor_2123", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 3571, "q0": "The proposers want to be able to mint NFTs that would represent immigration documents or find another way to introduct said documents onto Atala/PRISM. Let me start of saying after reading this project that the cost to value ratio is really good. The impact might initially be limited, but would provide an invaluable precendent and serve as a proof of concept for others after that. Keep in mind that finding the initial path is really difficult work, and the proposers have almost done it and don't need much resources to do it. I really do like the proposal and feel like it's going to have a big impact long term.\nThe proposer clearly states how this project is going to bring value to the cardano ecosystem and I also really like the definition of success because it's straight to the point. I don't see the need for scaling because as the proposer mentioned this is an MVP and doesn't need to be an enterprise solution, more like a proof of concept only at this stage, that would allow others to point at it's direction and state \"it's possible, they've already done it\".\nA few things that stand out as a good and efficient path to take: 1. They're reusing and colaborating with open source solution to NOT reinvent the wheel. 2. This project definitely brings what cardano is all about to life and all the ideology attached so I do think of voting for this project. Overall I like this project and the proposers have done a great job since last round.", "q0r": 5, "q1": "There are names and links provided of the two team members and I was able to verify their skillset, which is also shown by the practical details mentioned like the imigration document types and numbers. This is a way to showcase your in depth subject matter knowledge. I love the fact it's a continuation of a previous fund that started the whole thing and even more it's just the previous fund. That means people think their MVP is importand as I do and have voted for them and funded their efforts, which shows the ideology of the cardano community as well.\nThere's not much budget to speak of. As I already mentioned the cost to value ration is really big compared to many other proposals so it's a no brainer for me. Two team members are more than enough to do the necessary work, which will be more beurocracy IMHO than anything else, and I appload the patiance to do it. The knowledge of legal documents will prove to be invaluable when negotiations start I imagine.\nAnother thing I like is the definition of success which gets to the heart of the matter. At the end of the day this is a practical solution to a practical problem taking full advantage of the blockchain technology. The fact it's happening on cardano only makes me happy and proud to be a part of this community with such great inovative projects.\nOverall a decent, definitely feasible proposal. Good luck to the proposers and keep it going!\n", "q1r": 5, "q2": "There's a discord channel that solves so many problems with communication and asking for help. I always support a channel to the community to have constant feedback and help if necessary. An amazing amount of people are willing to help causes like that. Besides that there is an open source github repository available to anyone to follow along with the project implementation.\nThere's a clear problem - help imigration documents find their way to atala/PRISM and a few possible solutions one of them being minting NFTs. Maybe a way to measure their progress would have been nice, but I can't think of any way to do that in their particular case, so that's not so big of an issue. This is an auditable project for sure.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 14, "ne": 3, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 4456, "q0": "This is a follow-up research project from Fund 8 that wants to look into an SSI solution for universities around the globe to be able to have a way to manage a students immigration documentation (which is typically a messy paper trail). So I have to learn the Pt. 1 proposal first then cross-checking this proposal. The proposal addresses the challenge and can bring relevant innovation to the immigration system. Documents for immigration purposes needed to be authenticated, and shared individually or together, which I believe Atala/PRISM can effectively enable it.", "q0r": 4, "q1": "The experience of the founder of the project is very rich. Proposer also has the support of an experienced advisor. I believe with all those experiences, this follow up project will be implemented effectively. For total $1800 + $3900 budgets, proposer only mentioned those are consulting fees and also stated that \"This will be the last round of funding for this project.\" I'll make sure this next Fund.\n\nOne thing I want to note: since the budgets are not transparent, maybe next time Proposer could breakdown the budget. For example: $3900 is for 6 months consulting fees or something like that. With those budgets break down, your proposal could be a reference if another Proposer have the same idea like yours.", "q1r": 4, "q2": "There's little information about a roadmap is not very much explained. But We all can publicly see for all the deliverables in github Proposer attached in this proposal.\n\nAlso, the description of how the project measures project progress is too limited. I can't see it on their Github too. I suggest that in addition to tracking the project progress through the timelines established in the plan, the project can create checklists of work items and make this checklist available to the project team.", "q2r": 3, "assessor": "z_assessor_2553", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 8717, "q0": "This proposal is to seek funding for the continued development of the work of an ongoing project that has previously had a successful funding call. But it seems the proponent is having some confusion here, their previous proposal was presented in Challenge open-source-immigration, but this one is Developer Ecosystem. The target audience of the two challenges is completely different, and in this proposal, I have not seen the author describe the positive impact it will have on developers - what is the main audience of this Challenge. And in my opinion, to be able to receive funding in this round, besides describing what components will be upgraded in the overall product, the proponent also needs to clarify how these upgraded features will have a positive impact on the audience and Cardano compared to the previous version. Unfortunately, the author has not really done well at this.", "q0r": 2, "q1": "Although there are descriptions of how the work should be carried out, the proposal is still uncertain about the definite time frame for completing the proposed work. Presenting such a project development plan is not effective for tracking its progress. Most of the budget requests will be allocated to seeking expert advice, however, the proponent also needs to clarify the workload of these consultants to be able to see whether the cost pay for their work is appropriate or not. The description of the main consultant in this proposal is clear and shows that consulting work will certainly be effective for the proponent's intentions.", "q1r": 2, "q2": "In terms of form, this project is lacking a clear audit roadmap that requires the necessary elements to be timelines, KPIs, and targets for KPIs. At the same time, there is no information on what methods the proponent will use to manage their performance, nor how the community can monitor project performance. In terms of content, this idea is completely unsuitable for key metrics due to misidentifying the target audience in the first place.", "q2r": 2, "assessor": "z_assessor_2996", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 10312, "q0": "This is the second phase of the Fund 8 project. The idea is fascinating and it has been scaled up to develop a working example that translates immigration documents to Atala / PRISM for compliance.\nit would have a huge positive impact on the whole is to require holders of their immigration documents to use NFTs, or to translate their login information into Atala/PRISM, a US affiliate. then processed.\nAll in all, I'd love to see this project work in real life regardless of winning the .\nI also need to confirm that related blockchain developer for a few years. which I don't know, I don't know where to comment and I think it's the best fit in terms of impact, I think the project should be rated for the right goals, problem solving\nAll challenges presented are ok, the risk can be determined", "q0r": 4, "q1": "Progress and Feasibility Spring semester 2023 will be more likely to work towards a real use case using immigration documents.\nwe started to address these use cases, building Angular components to handle the documentation testing process\npotential team capacity Now we need to work on decentralizing this process is nearing completion from Fund 8.\nThis will be the last round of funding for the project that puts immigration documents on the Cardano blockchain\nThe budget sets forth reasonable requirements for clear and transparent amounts", "q1r": 4, "q2": "I believe this project has a high index of project success on GitHub, or other publicly available and open source resources, contributions in both documentation and source code are provided at the end project.\nIt is evidently practical and innovative that a university in the United States undertakes the research conceived and presented by this project sufficient to have a prototype or a minimum viable product (MVP) produced in these locations. their base to then contribute back to the public project.\nMatching the challenge and the whole proposal The basic process of success would be an international student or scholar from Rwanda, put their documents into this implemented system, the university to validate the this document and may download it, and then let the university use the system for this purpose. confidently allows this student to continue their studies at their universities and is confident that their international student or scholar is in active immigration status.\nThe timing mentioned is fine but I think running an equity fund should be the first step towards getting income to support operating expenses.\ni think if project win needed fund it can be audited as funded in installments after each mentioned goal they will get next batch and so on.\nI hope the project can continue good luck", "q2r": 4, "assessor": "z_assessor_3171", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 12358, "q0": "The proposal seeks an open source solution that will contribute to the cardano ecosystem. Some blockchains  operate on a closed source that have vulnerabilities and poses risk of attacks. Rather open source provides security due its trustworthiness. This is because looking for malicious codes in an open source may be given fewer bugs and vulnerabilities due to coding errors that will exist. This calls for a reinvention looking at the wallet and ID project by providing a solution to use their app as a use case. This proposal is the phase two of fund 8 project which seeks a solid integration of the project at the University of Arkansas. The project intends to continue the project when funded.", "q0r": 4, "q1": "The team provided have the needed experience and skillset to execute the project. The project seeks to partner with roots wallet to work on the project. The budget is very brief, however, I'm not too sure about the budget since it caters for only compensations and no actual works are covered in the budget. It is not too clear what the works will be in the phase two of the project. The time to implement this project is quite far to me and some economic factors such as inflation may cause the requested amount to be insufficient to carry out the project. The budget should have made provisions for a contigency to cater for project.", "q1r": 2, "q2": "The proposal addresses the problem. However, I believe more information to the budget should be given as this will help with the projects implementation. The time for the projects implementation is not immediate and having stated a relatively small budget cost could loose its value at the time the project commences.The proposal should provide more details to understand the project if it is to be implemented.", "q2r": 2, "assessor": "z_assessor_3401", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "The solution we are still developing from F8 is to have an owner of their immigration documents mint NFTs, or otherwise translate their credentials, onto Atala/PRISM that a U.S. univ. then processes", "experience": "I started IT development and support in early 1990, eventually moved to media production, and in 2015: back to IT in International Education. I supervise immigration compliance at the Univ. of Arkansas, and have been studying blockchain dev for a few years. CTO of a few companies"}