{"id": 422514, "author": "piensalibremexico", "title": "Spend Less Time And Money", "url": "https://cardano.ideascale.com/a/dtd/422514-48088", "category": 26597, "amount": 25000, "description": "There's no sufficient data about how general public interacts with Cardano and what's their knowledge about the ecosystem in general, that makes teams spend time and money to get that data.", "f6_no_assessments": 7, "f6_rating": 1.9523809523809523, "videos": [], "media": [], "f6_assessments": [{"id": 756, "q0": "The proposal suggests doing market research about the view of the population on Cardano and then creating a database and an API through which the parties interested in Cardano can query to find what the public thinks about Cardano. This could be potentially interesting for developers who are new to the blockchain and are looking for surveys before deciding which blockchain to go with. The type of information to collect from the public is not very well articulated, so it is very difficult to determine how useful this would be to new developers. As a developer myself I would usually opt for social media and formal publications to determine the pros and cons of a blockchain, this proposal would have to deliver something very substantial to stand a chance in today’s information overload. I would suggest the proposer elaborates on what information would be collected and provide a sample template of the survey. With the information provided I struggle to see how this would deliver value to the Developer community.", "q0r": 3, "q1": "The proposer does not provide evidence of skills or experience, there are no links to LinkedIn profiles or GitHub, and the link provided for the Twitter account leads to a profile with no posts. The proposer suggests that they hold a Bachelor of Science in Computer Science, but no evidence is provided to support this. I would suggest the proposer to provide information in the proposal that would help the assessor to verify the claims being made. I suspect there is a language barrier that the proposer has tried to overcome and this is commendable, however, the basic information still needs to provide even if it has grammatical errors. The budget is broken down into salary for a front-end dev a data analyst and a team for conducting surveys on the ground. The budget is set conservatively at $25k, the bulk of which would go towards paying workers on the ground performing surveys, the salaries are 1k per month for developer and data analyst and $750 per month for surveyors. Additional funding will be requested in future funds to update the survey results, this is a reasonable plan to maintain information up to date for the community. The proposal lacks technical detail on the platforms that will be used, or languages used for development and data science. The provide schedule desccribes the first 2 weeks of work to build the front end and the backend and from there onwards there is little furher detail. The main risks highlighted at that of possible disruptions from the Covid pandemic and mitigating action will be to delay delivery. GIven the lack of detail on the techbnical details, lack of a schedule beyond the first two weeks and little detail about the team I have no little conform that the proposal can be delivered. I would suggest the proposers focus on these elements in future proposals.", "q1r": 3, "q2": "The roadmap is described only for the first two weeks out of the three month project duration. The proposed metrics are number of our API request, views, clicks and other data. I could not describe these as well throughout metrics particularly as there will be a large volume of information collated by the surveyors and new front end and backend delivered by the project. I would have liked to see here KPIs that monitor the delivery of the new technology and how many surveys collected as an example. The delivery channel for KPI and Metrics is not mentioned. The project success statement is quite generic to maker project building on Cardano faster, cheaper with their data analysis. I Auditabilty sections lacks concrete information that any member of the community could use to track the deliverable, I would struggle to at any point if the project is delivering on intentions, as the intentions are ambiguouslt stated. The proposers did not come back on the comment that was left for them requesting to provide additional information on Ideascale", "q2r": 3, "assessor": "z_assessor_2123", "no_vca": 13, "ne": 6, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1583, "q0": "Unfortunately the proposal is not yet very well designed. It is missing some insight on which data is going to be collected appart from how well blockchain is known to the general public. Hence, it might provide some insight for generally well-known projects like trading and NFTs, which only make out a small scope of what the Cardano blockchain can actually achieve. Hence, it will have some very limited positive impact thus it can't really be said it effectively adresses the challenge.", "q0r": 2, "q1": "We don't know anything about the proposer. All that is provided is a newly created twitter accout and telegram channel with no information about any of the proposers competencies. The budget breakdown is incorrect, as it only covers a fraction of the requested budget. The roadmap/implementation plan basically only covers the first week and no more information is provided about what is done apart from the very general information about making some surveys. Unfortunately at this point the proposal cannot be assumed as feasible. Please share a more detailed plan next time.", "q1r": 1, "q2": "Only a very small limited set of metrics is presented, it's however difficult to apply as the whole scope and direction of the proposal is not described very well. No platform exists yet, so at the time being there is no guarantee that there is some place for the community to track the progress of the platform and the overall claim that the platform will be programmed in one week while in the present the proposers don't even have a website makes this even less credible. ", "q2r": 1, "assessor": "z_assessor_2257", "no_vca": 13, "ne": 0, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 3574, "q0": "The proposal wants to provide user da.ta to cardano startups. This is a good idea and I do believe startups might want to pay to get this data. I'm unsure if this is the right place for this proposal, because this is a more business related proposal and It could have had a better fit in the dapps and integrations challenge or somewhere else.\nThe proposal does state how it will add value to the cardano ecosystem through offering of user data. I don't understand what's the reason behind making the surveys live instead of online.\nAt one point the proposers said and I quote:  \"We pretend to make surveys in eight differents countries during...\" and I believe they meant to say intend, otherwise it would be quite funny. The whole paragraph describing how the proposed solution will address the challenge is copy pasted from the description of the proposed solution and has nothing to do with answering the question. Both of these facts and the wrong budget and several other mistakes, make me think the proposers haven't read their proposal after they made it, which leaves a bad impression. \nSo my suggestion for the proposers would be to read and re-read their proposal before submitting it and making sure it's all in order. Overall and interesting idea, but a poor proposal for the aforementioned reasons.\n", "q0r": 2, "q1": "Unfortunately I wasn't able to verify the listed team members. There are quite a lot of DjSams out there, but I couldn't find one that has a \"Bachelors of science in Computer science\".\nI can't understand how the requested funds are 25 000, because the calculations don't add up. The budget breakdown speaks about months but the plan with the timeline talks about weeks so I was confused and unable to make sense of it.\nThe plan is not detailed enough and as a developer I can say that making a \"frontend and the backend\" is unreasonble and highly unprobable, as well as the design for a week. Another thing that make me have a pause is creating a database without knowing what data it will hold. I can state that this is simply impossible. In order for data normalization you need to have the data first. That's one of the first rules on database architecture.\nOverall there are too many faults and confusing statements in this proposal for my taste. Having read and assessed over 150 proposals I think I have an idea of what should a proposal look like and this one doesn't have the claryty and descriptions necessary. I would urge the proposers to polish their proposal and work on the details and explanations and come back for the next funding phase.", "q1r": 1, "q2": "There isn't enough information for this proposal to be auditable and I don't see a way of interested parties to follow along with the projects' progress.\nThere is a clear problem that the proposers state, but I don't see a clear and well defined solution to the stated problem. I'd recommend to the proposers to put themselves in the shoes of a voter and I hope that helps to form a better proposal. Another thing would be to look at other excellent poposals and learn on how to structure and what information must you provide as well as the level of detail, expected from you. \nOverall this proposal is not auditable, but I do wish you good luck and hope you come back next round.\n", "q2r": 1, "assessor": "z_assessor_2463", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 6488, "q0": "It would be interesting finding out what the general public knows about Cardano. This information could be beneficial to users of Cardano because it could help community members know the levels of understanding right now. It is likely that during the timeline of Fund 9, there aren't very many people in the world that know what Cardano is. The team plans on addressing this challenge by going out in the general public and gathering this information. They would then develop a web platform that shows the data and can by used by other people in the ecosystem. A proposal should be conscious of the purpose of Catalyst. These funds are granted to proposals to help bring more utility and growth to the Cardano ecosystem. I would suggest writing about how this proposal can specifically benefit Cardano in both of these ways. Does the team think this will have a global impact? Or just a local impact? These details would also be important to include. It is an interesting idea and could have utility in the future. I just don't know if that time is right now because of those suggestions that were mentioned. For these reasons, I give this section 2 out of 5 stars.", "q0r": 2, "q1": "There isn't a lot of information provided on the proposers/team. It is important to include specific names in a proposal because it helps the community keep the proposers accountable for their ideas. This information should also be paired with specific experience and accomplishments. The roadmap in this proposal could be written more specifically. It is important to include specific or tentative dates. This will help the readers of the proposal to have more trust in the team and will increase the likelihood of this proposal being implemented successfully. There is a budget breakdown that includes details on where the requested funds would be given. This is good. However, it will still be hard to verify if these funds would be utilized properly as there is a lack of verification of the team and their accomplishments. The proposal has a unique idea. However, I'm still unsure on how this will directly benefit the Cardano blockchain, and specifically, who it will benefit. For these reasons, I give this section of the proposal 2 out of 5 stars.", "q1r": 2, "q2": "There are two important factors that should be implemented when auditing the potential success of a proposal. The first is transparency from the team. The team should be open with their community and keep them up to date as the project is being worked on. However, without a community, this will be a difficult task. The proposal can include information and how the team plans to grow a community or in other words, a group that can hold the team accountable. This is the second concept that is very important. There should be a following or a group behind each project. This will help ensure that the requested funds will be utilized properly and that ultimately, the proposal will bring long-term utility to the Cardano ecosystem. I think that this proposals idea of gathering the general publics knowledge of Cardano and putting it into a webpage can be important in the future. This can help display information in terms of growth of the Cardano blockchain from a different source. There still needs to be more work and consideration in the proposal. For these reasons, I give this section of the proposal 2 out of 5 stars.", "q2r": 2, "assessor": "z_assessor_2817", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 7915, "q0": "I find it difficult to see how this proposal can add value to the Cardano ecosystem because the proposer does not do a good job of explaining what this project is. The problem statement is vague and it assumes that there are no free sources where one can learn about the Cardano ecosystem. This is not at all true and a quick search on a browser or YouTube will already get one access to some free material. One can maybe categorize this proposal under “Knowledge base & Documentation” but this is left open for interpretation. \n\nThe proposer needs to outline in detail what their product is, what is the problem it wants to solve and how it is going to solve it.", "q0r": 1, "q1": "Not a lot of attention and consideration was put in drafting the budget. General round numbers are given and the budgeted items are not broken down properly, just lumped together. The proposer needs to have an itemized budget, detailing how much each item costs. Also include subtotals in the budget, and not leave it up to the reader to calculate the budget total themselves in order to reconcile that total with the requested amount. \n\nThe only reference links provided are for one member of the team showing their personal Telegram and Twitter handle. This is not what a reader wants to see. The proposer states that they are “developers and entrepreneurs with a Bachelor of Science in Computer Science” but no references are included to back up these claims. The proposer should include reference to past projects and/or a link to a personal profile so a reader can be in a better position to assess their skills and expertise. ", "q1r": 1, "q2": "The proposer did not provide any way for the community to audit this proposal. The propers states that “after the first week all the community can use our platform and our API” but does not provide an indication how. The proposer could include a github link where updates will take place and/or a Telegram group for project announcements.\n\nThe timelines only state what is to be done the first week and nothing after that while in the budget it is indicated “1,000 USD per month during three months for one fullstack developer”. So according to the budget, this project will take more or less three months but sadly the timelines do not go further than the first week. The proposer needs to reconcile the timelines with how much months of work is indicated in the budget. If there are discrepancies then they need to be rectified because at the moment it seems like a week's work is being done while wages are paid for three months.", "q2r": 1, "assessor": "z_assessor_2935", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9946, "q0": "The proposal suggests making surveys to everyday people about their blockchain involvement and then let developers to benefit from that data through API. I really like integration of data analysis of potential customers to the product designing process. To carry more impact, I would like to see a plan regarding scalability of the survey and systemization of the process. Perhaps it could be possible to be automated, at least partially, and become much more cost effective. \n", "q0r": 2, "q1": "The roadmap is understandable but should be much more detailed especially regarding the implementation of the surveys. The amount asked is reasonable for the beginning and the budget breakdown is pretty clear. The service will require continuous funding for the future to stay updated and there are no plans for it to become self sustainable. Follow-up funding from Catalyst seems to be necessary. \n\nThe proposers are likely to be able to implement the API successfully. There is some contact information but not information for example on their previous work or other track record. People to make the surveys are to be hired and currently unknown. \n", "q1r": 1, "q2": "Since the platform can be utilized right after the first data points begin to float in, it offers an immediate window to see how the surveys are progressing. There are natural KPIs to measure the success after the implementation.\n\nThe platform is planned to be ready for this after the first week of work. This kind of proof of concept could probably be made with much less funding than currently requested. It would provide some confidence and instant feedback about the software side of the service. \n", "q2r": 2, "assessor": "z_assessor_3138", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 14845, "q0": "Cardano is a public blockchain platform that was founded 7 years ago and has since grown. However, blockchain is still not properly embraced by many people, leading Cardano to suffer greatly. As a result, I feel that the notion of conducting surveys of this project would undoubtedly benefit the ecosystem. The poll will be conducted on the road in eight countries, covering a wide range of subjects directly connected to the Cardano ecosystem, and all information gathered will eventually be available on the online platform. It can be observed that if this project is carried out, besides providing information to risk managers, actuaries, data analysts, developers, executives of startups, or project managers before establishing a project, the entire ecosystem will also evaluate Cardano's recognition to outsiders. \nOverall, this is a project that intends to benefit the ecosystem greatly yet has several flaws. Taking a survey of passersby isn't inherently a bad decision, but it's tedious and unlikely to attract many volunteers. Furthermore, pedestrians come from a wide range of backgrounds, ages, and hobbies, therefore the vast majority are uninformed of and uninterested in the blockchain. As a result, I shall offer counsel to which the proposer may refer. If you're intending to conduct an interview on the road, try rewarding individuals who can answer the question with a present to make the survey more exciting. This not only draws a large number of participants but also assures the quality of responses. In this scenario, prepare as many questions as possible to prevent the latter from knowing the answers from the former. Alternatively, the author might try to conduct the research in places where there are a lot of people, such as corporations or universities, because they are generally young people who are interested in what will happen in the future.", "q0r": 3, "q1": "The project’s plan and budget utilization are in perfect sync. As can be seen, the project will only take one week to build the platform and three months to perform a poll of pedestrians. Furthermore, the funding will be utilized for four items: one full-stack developer, one data analyst, eight laborers, and hosting, domain name & variable expenses totaling $25,000. These two parts provide all of the essential information; however, the introduction of the working team requires a bit more. We know the names of two persons who are most likely the project's hosts, but it isn't enough. Proposers should offer additional information about their profile, as well as contact information and links to their social media profiles, so that voters may determine who will work for them. Likewise, I note in the budget part that the proposer plans to utilize two persons from LATAM, but the author does not specify what firm it is or what industry it specializes in. Additionally, I wholeheartedly endorse the pick of 8 volunteers to conduct the interview assignment. However, keep in mind that the hiring requirements must be correct, as well as the most qualified employees for the project.", "q1r": 3, "q2": "Aside from the activities completed, particular deadlines are required to effectively analyze the development status of a project, and thankfully, the author has included this aspect. Furthermore, for the successful author highlights section, we have the benefits that the Cardano ecosystem will become extremely evident. However, it would be preferable if the author could provide the number of persons questioned every day throughout the eight nations. It is not just a member's goal, but also a tool for investors to assess the project's performance.", "q2r": 4, "assessor": "z_assessor_4104", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "We're going to save your time and money because we're going to provide data analysis to your startup based in real data obtained from the people in the streets who are the final users of your products", "experience": "We are a team of developers and entrepreneurs with a Bachelor of Science in Computer Science from México, we have experience in web development, data analysis, artificial intelligence and blockchain in general."}