{"id": 422504, "author": "santi", "title": "Oura v2", "url": "https://cardano.ideascale.com/a/dtd/422504-48088", "category": 26597, "amount": 44640, "description": "Adoption of the open-source project \"Oura\" has increased and new feature / issues are being requested. Extra development bandwidth is required to add new features and keep up with code maintenance.", "f6_no_assessments": 6, "f6_rating": 4.722222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 755, "q0": "The proposal identifies the problem of syncing the blockchain state to offchain databases and other services. From personal experience of running services on top of the cardan-node service there is currently only one service that reads blockchain data from the node and syncs with a local database and that is DB-Sync and is mainateind by IOG. There are sometimes issues with this services which often led to looking for alternative, if only just to chekc if there is an alternative implementation. I was not aware of Oura, but now see that it is valid alternative to DB-Sync and has over 160 stars on github. I might give it a try. The proposer suggest that the advantage is that it gives the freedom to choose the destination of the sync, which can be other than an SQL database that is supported by DB-Sync. This is useful for the developer community as it gives flexibility to implement with other downstream services. It will add value to the community through the flexibility of downstream a services into which the sync’d data can be piped. The proposal aims to extend the functionality of Oura by making the sync 5x faster, improve the data structures and integrate with cloud steam processing services. To the extent that developer run cardano-node on cloud providers this is a useful development to integrate the sync with cloud storage services. The solution is scalable as new code is open-sourced and users can copy it to run on their machines.", "q0r": 5, "q1": "Yes, the proposer provides a reference to previous work done in building Cardano back-end services. The website txpipe.io is a collection of backend services that improve the user experience of back-end developers. The team consists of two individuals for whose Github and Twitter profiles are provided. The team demonstrates experience in the field and a track record of building tools on Cardano. The budget is set at $44k and delivered in 3 months, the majority of this is to pay for a rust developer $75/h which is reasonably priced for a senior developer in South America. The budget also includes a technical writer. This seems to be a reasonable time and budget to deliver an improved version of the Oura service and integrate it with the storage services of cloud providers. I have used Google cloud to launch nodes and configure bucket storage, it is a convenient pairing that can scale with demand. The main risks highlighted are the uncertainty of facing unknown technical difficulties which they plan to resolve by reaching out to the community and contemplating best practices. Additionally, the prosper highlights that the v2 of Oura might introduce breaking changes to current users of v1 wishing to upgrade, this is a reasonable concern and affects all open source packages, users of this technology are naturally skeptical and are well equipped to handle this type of risk. The proposer reasonablyh plans to start with what they know and will come back for additional funding if the usage picks up and there is demand from the community for additional functionality. I strongly agree that the team has the skill and the right plan to deliver this project.", "q1r": 5, "q2": "I reviewed the Kubernetes proposal by the same proposer and make the same observations for this auditability section as the information provided in this section by the proposer is the same. The proposer suggests that a detailed roadmap will be presented as part of the open-source repo. It would have been preferable to include this roadman in this proposal. Each milestone will be delivered as a release on GitHub and direct communication with the team is possible on Discord. The proposer suggests weekly updates via Twitter. The proposal would benefit from more detail in this section, particularly a set of KPI metrics that can be tracked by the community. The roadmap for the project is clearly articulated. I, therefore, agree the project has a clear deliverable, the channels of communication through which questions can be raised and the proposer has committed to providing regular updates, however, the section is missing KPIs and well throughout Metrics.", "q2r": 4, "assessor": "z_assessor_2123", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3573, "q0": "The proposers want to evolve their solution that's gotten quite the attention and usage from the community. As far as I understand it's a solution that attaches to the head of the cardano blockchain and tracks specific events and logs and enabling devs to find patterns. Sounds interesting considering that I've already seen two proposals that already used the word observe the blockchain already, I guess there's a use case for this.\nThis is definately in the right category and mixes well with the challenge settings, most of all with the \"let's make the devs lives easier\" challenge setting. As a developer - I approve this message.\nIt's absolutely great that the community took such an interest in this open source project, and that causes the proposers to need more funds and more devs to work on it. It's a great organic evolution of any open source project.\nThe proposers sure can address the future challenges which are quite specific, and that's how you know the proposers haven't just written down the first thing that pops to mind just so they can have something written down, as some other proposals are doing unfortunately. There are real arguments and rationale behind their decisions and fears and it shows. \nCompared to other proposals this looks to me like it's more focussed. Besides that, this is the first tool I've seen to \"observe\" the blockchain so cheers to them for finding a blue ocean market.\nOverall an excellent proposal already having an impact and planning to have an even bigger one. \n", "q0r": 5, "q1": "They are a small team of 2 developers and 1 technical writer / junior dev, which is amazing, because if you want to do all the refactoring you need to do, it's better off to have a small team that knows integrally their product. I was able to verify their credentials and skills mentioned in the proposal and can safely say they're over qualified for the work that needs doing, although it's a tricky business.\nI love the depth of technical details explanations and elaborations. This helps me get the bigger picture as a developer and better navigate their idea and plans. \nThe budget breakdown is the standard one - estimated hours * hourly rate - both are reasonable so no problems therre. The rodmap seems easy enough to follow along with and the task separations and deliverables are reasonable given the timeframe set for it's completion. The timetable for the execution of the project is really nicely separated to compliment future work so it's optimizaed even before they started, which is always appreciated - not wasting time.\nThe plan describes all the resources and technicalities that will be used to get the project done. The project is in sync with what's already been done, in this case not overlapping with other projects (probably causing the big community interest). Overall a feasible proposal, which I can propose you vote for. Good luck to the proposers and hope to see you again next fund.\n", "q1r": 5, "q2": "There's a github repo present and it's opensource. It's a really good opportunity to see masters at work doing refactoring (overhauling) the code. So if you're reading this and you're a developer, I would point you here: https://github.com/txpipe/oura before they start their optimizations and the concurrency model.\nA clear solution to a clear problem - we'll make tool better because it got too big too quickly and now people want stuff from us. That's the TL;DR; version (half kidding). This is an auditable solution no doubt, budget is reasonable, work is planned out, resources are present. Basically a no brainer to vote for.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6615, "q0": "The team well explains at the LATAM IdeaFest how difficult it is to work on this technology, so they decide to present a project that could provide a supportive environment for developers. Allow more developers to be attracted to Cardano. Which is perfectly in line with the objectives of the challenge.", "q0r": 5, "q1": "The level of detail and knowledge with which the team presented their proposal at the aforementioned event demonstrates a high level of professionalism.\n\nAlthough I respect the privacy of team members and the community, but in a funding process where money is requested, transparency must be guaranteed and therefore all possible information on team members must be provided. In this writing, I missed finding more details about the background, for example, the LinkedIn of the team members to know their experiences.\n\nI have decided not to lower my score due to this lack of information, but the team must take this feedback into account for future proposals.", "q1r": 5, "q2": "The information provided is kind of efficient to audit the progress and the success of the proposal, but it is not very detailed either. The team is highly qualified for this project, but they need to improve a little in the writing of the proposal, providing objective KPIs that allow them to track the progress and objectives of their project. This is a learning process where we are all part, but the next time to obtain a total score of 5 stars in all aspects, you should take these tips into account.", "q2r": 4, "assessor": "z_assessor_2822", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 10920, "q0": "Before going deep into the solution, it seems that those proposing this know Oura very well. They've done a great job at implementing it and taking in suggestions from the community which show their passion for the Oura project. They've detailed many of the issues currently faced by many who are using Oura as much as they could based on current levels of adoption by developers around blockchain. These suggestions are for various use-cases, which shows what is yet to come in terms of developer and stake holder expectations on Cardano data integration tools like Oura. This proposal could help future projects and services running on top of Cardano ecosystem.", "q0r": 5, "q1": "The Team here is definitely has the experience and skills to pursue this endeavor. They are active contributors to the github project.\n\nThe implementation plan of the proposal is totally adequate.  We know what activities would be developed and in what time interval.\n\nThe total budget is $44640. This budget is divided between the hours spent on development and technical writing. The budget is calculated on the basis of working hours. I miss some mention of what happens if the development time is extended, as this is always difficult to calculate. Who will be covering the cost increases in that case?", "q1r": 4, "q2": "TxPipe's Project Oura setting up its goals for success clearly with defined milestones for each version release. The provided communication platforms will be used as communication tool updates with Github as milestone progress tracker tool as well as project updates of Discord Server and twitter reports. With a strict time frame set, the community will definitely able to track TxPipe Project Oura development of their milestones on a timely manner", "q2r": 5, "assessor": "z_assessor_3205", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 15226, "q0": "The proposal aims to maintain and build a new release of the blockchain sync service Oura. It’s submitted by the team who has built the first version of the open source product.\n\nJudging by the GitHub activity for the project, the first version of Oura has been very well received and adopted by the Cardano developer community. This makes the proposal a very good fit for the Developer Ecosystem challenge as it answers several of the guiding questions presented in the campaign brief, namely  “What are the the tools that we need to prioritize first?” and \"What do developers want, and how do they get it from the Cardano dev ecosystem?\"\n\nWhat makes the project even more valid, and by extension the proposal, is the fact that Oura is an open source tool to which the developer community already contributes.", "q0r": 5, "q1": "The implementation plan is presented by development milestones which makes a lot of sense given the nature of the Oura project, is easy to follow and logical. It covers 3 full months of development and is divided into 3 milestones related to the functionality of the service.\n\nThe budget is broken down by task, Rust developer and technical writer, with an estimated number of hours for each. The attached hourly rate is very reasonable for blockchain development. \n\nJudging by the short bios presented in the proposal and by the content of their Github profiles provided, the team is more than capable to deliver on the scope of this project.\nAlso, the website provided by the team - https://txpipe.io/ -  is a collection of project and products for the Cardano ecosystem, once again proving their know-how and dedication to the ecosystem.", "q1r": 5, "q2": "The metrics and KPIs could have been better presented in the proposal, but given that Oura is already a very public project, that has a substantial number of users, I have no doubt that the community will follow the development of the project on its GitHub page and on the teams Twitter account, auditing it naturally as it progresses and the deliverables for each milestone are released.\n\nIn fact the community will probably do much more than audit the success of the proposal they will, most likely, also actually use the resulting product/service, something that can’t be said about a lot of Catalyst proposals.\n\nThe definition of success is also well articulated and speaks once again about the positive impact the project could have on the Cardano developer ecosystem. ", "q2r": 5, "assessor": "z_assessor_2169", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15388, "q0": "The proposal is version 2 of Oura opensource, in which version 1 has already been completed and used by the community. The project is very much appreciated as the feedbacks and improvements were coming from the community basically in terms of new features and extra bandwidth. The risks are also listed for the very much so-call peer-reviewed approach.  There should be more streamline to gather feedback effectively from the community.", "q0r": 5, "q1": "The team will be led by Santiago Carmuega with 20 years of experience in software and Lucas under him, with the technical documents by Florencia Luna. The past work can show the team's capacity and history work at   https://txpipe.io  Milestones and budget are very much laid out clearly by working hours and required headcount. What could be improved is the timeline attached to this proposal so that the community can keep pace with the proposal status.", "q1r": 4, "q2": "The road map and detailed OKRs/KPIs will be tracked at the TxPipe Discord and Github repository. The community can also follow update summaries on their Twitter account. There should be the Feedback cycle suggested in Discord so that the team can gather more in time and effective feedback loops. A glance at the Discord and Github showed that the team is really serious and committed. What would be better is the categorization because many proposals also running by the same team. ", "q2r": 4, "assessor": "z_assessor_4129", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "We'll assign a fixed development bandwidth to develop a new version of Oura that incorporates new features, improves performance and evolves the event model.", "experience": "We're TxPipe, a small team of seasoned developers passionate about Open Source and Cardano. It is the team behind existing projects such as Oura & Pallas. We specialize in backend development, data pipelines and cloud architecture. Rust is our language of choice."}