{"id": 422603, "author": "santi", "title": "Kelley: Cardano k8s Operators", "url": "https://cardano.ideascale.com/a/dtd/422603-48088", "category": 26597, "amount": 64560, "description": "Deploying and maintaining Cardano components on Kubernetes clusters is complex and requires a deep understanding of many configuration details.", "f6_no_assessments": 9, "f6_rating": 4.62962962962963, "videos": [], "media": [], "f6_assessments": [{"id": 760, "q0": "Yes, a configured Kubernetes cluster will help developers to deploy and manage applications on Kubernetes clusters. This is useful for developers of large-scale applications that receive large volume of traffic and need to ensure high availability. As a user of Kubernetes in the financial services industry, uptime is of utmost criticality, particularly when things get busy. Also as a user of cardano-node and DB-Sync. From personal experiences, the repercussions of slow recovery from the failure of these services can be critical. A Kubernetes solution has scalability built-in by default - it launches replica services as demand increases. A ready-to-deploy kubernetes service would improve developers’ experience and lead to increased developer adoption, productivity, and creativity. ", "q0r": 5, "q1": "Yes, the proposer provides reference to previous work done in building cardano back end services. The website txpipe.io is collection of backend services that improves the user experience of back end developers. I have not heard of the Sctolls repo that has 38 stars on gitrepo and Oura that has 169 start on gitrepo. The team demonstrate experience in the field and a track record of building tools on Cardano. The budget is set at $64k and deliver in 3 month, majority of this is to pay for a python developer $65/h which is reasonably priced for a senior developer in South America. The budget also includes tetsig and a technical writer. This seems to be a reasonable time and budget to deliver an on demand Kubernetes service for the core Cardano services. From personal experience it takes around a month to set up a Kubernetes cluster for a handful for services, so an additional two months to test, packaged and document seems very reasonable. The main risks highlighted are in the uncertainty of facing unknown technical difficulties which they plan to resolve by reaching out to the community and contemplating best practices. The proposer reasonable plans to start with what they know and will come back for additional funding if the usage picks up and there is demand from the community for additional functionality. I strongly agree that the team has the skill and the right plan to deliver this project.", "q1r": 5, "q2": "The proposer suggest that a detailed roadmap will be presented as part of the open source repo. It would have been preferrer to include this roadman in this proposal. Each milestone will be delivered as a release on GIthub and direct communication with the team is possible on Discord. The proposer suggests weekly updates via twitter. The proposal would benefit from more detail in this section, particulary a set of KPI metrics that can be tracked by the community. The roadmap for the project is clearly artcularted. I therefore agree the project has a clear deliverable, the channels of communication though which questions can be raised and the proposer has committed to provide regular updates, however the section is missing KPIs and well throughout Metrics.", "q2r": 4, "assessor": "z_assessor_2123", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 810, "q0": "Kubernetes provides a method to host Infrastructure as code and can support scaling in an automated and massive manner. Cardano ecosystem hosts a large number of backend services like dbsync to support a multitude of applications like light wallets etc. I have personal experience hosting DB-sync and Ogmios. There are fairly complex processes and require experience and a large amount of time to host correctly. Operators are software extensions to Kubernetes that make use of custom resources to manage applications and their components. Availability of k8 operator for the Cardano resources as mentioned in the proposal like node, dbSync, Ogmios and Submit API will provide immense help to projects like dandelion from Gimbellabs and can boost API service provides productivity. Therefore the proposal is in alignment with the challenge. ", "q0r": 5, "q1": "The GitHub profiles of the proposers including that of Santiago Carmuega and txpipe are impressive and give sufficient confidence that the proposers have the technical capability in completing the project. The oura project of the proposers has a very good following on the github with 26 forks. The other software created by the proposers is also having good standing in the Cardano community. Therefore with these credentials, I believe that the proposers will be able to implement the proposal in a successful manner. ", "q1r": 5, "q2": "\nThe proposal is for four months of development with three distinct Milestones. Each milestone employs one Python developer, one SRE and the last milestone of one month a technical writer. The proposal has defined a clear set of hard deliverables for each milestone therefore it is going to be quite simple to track the progress of the project. The rates of pay sum up to Python Developer: 36,400 USD, Site Reliability Engineer: 22,400 USD and Technical Writer: 5,760 USD. The amounts are at the rate of 65 USD per hour for the developer and $70 for SRE. The amount of time and the hourly rates for the devs and SRE are very reasonable. Considering all this I rate the proposal as auditable and cost-wise reasonable. ", "q2r": 5, "assessor": "z_assessor_2129", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3579, "q0": "The proposal is about infrastrubute and providing kubernetis, which is a system for automated deployment mainly, but deals with scaling and management as well. This is a great benefit for the developer experience because automating things is always a good idea. This proposal will have a positive impact over the envitonment, becuase usually when you hear that something can be deployed with a click of a button, you need this infrastructure in place to make that possible. Where to deploy (test environment / production) or what projects depending on other projects should be deployed first (ordering services deployment) and so on and so on are all configurations that need to be done in order to have a seemless experience when deploying. That's what the authors mean behind having a complex configuration that will be hidden.\nAs a developer myself I really like the solution provided, because I'm used to having this infrastrucuture in place and realize that's not the case for cardano, and tools and infrastructure such as this needs to be built from the grownd up. Hence the proposal clearly adds value to the caradano ecosystem and is aligned with the challenge settings.\nThe proposal will be able to address future challenges and from what they've listed as risks I can really appreciate the approach and understanding they have, because knowing someone might have already done what you're trying to is smart. Asking for help is even smarter and more efficient than figuring out everything on your own. \nOverall an impctfull solution, no complaints.\n", "q0r": 5, "q1": "I checked out the team members first, because they're the most important thing to making this project a relity. Their credentials and listed skillset checkout, although It would have been a lot easier if they linked their proffecional profiles, instead of me having to google their names which took a bit more time in order to verify their skills, but in the end everything checks out.\nThe roadmap seems decent and the time for setting up operators and statefull procedurs seems resonable to me as a dev and having done some of those things myself I can say the authors have a good idea and a small buffer to make everything well in time. I can speak also to the documentation part, having written quite a lot, so all and all the effort compared to the time seems well planned out. I like the iterative approach, but I do wish there was a better breakdown of tasks, because the listed information is just a roadmap (an overll view) and does not provide the necessary technical details in order to do a better and more accurate estimation of the tasks.\nThe wages are in bounds with what's regular, so there are no complaints there. The resources necessary to implement this proposal are clear and well defined. The number and type of team members is known as well and all team members are already present.\nOverall this is a feasible proposal, even with the caveat of the missing breakdown of technical tasks, that would have allowed a better view of the iterative technical approach.\n", "q1r": 4, "q2": "The auditability isn't great as it stands now, although it could be if the project is funded. Some of the things mentioned that will be done, should already have been done regarding for example a detailed roadmap and the milestones presented as partial releases, because those could have been done easily and wouldn't have taken that long to just write down to give the readers of the proposal a better vision of the future plans of the team.\nEven so there's a TxPipe discord server, and when it comes to auditability and feedback, discord is always a good place to be in. \nThere's a clear problem statement and an infrastructure to be build as a solution to it. Overall this is a good and somewhat auditable proposal with the few caveats mentioned.\n", "q2r": 4, "assessor": "z_assessor_2463", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4497, "q0": "This proposal is a very good fit for the challenge's goals, as it would provide exactly the productivity, abstraction, simplification and tooling that makes developers' lives easier and more productive. Although Kubernetes for Cardano is quite a specialized  and currently niche application, as DApp development on Cardano grows this might go a long way in facilitating deploying and scaling applications and integrations. I agree that this proposal very effectively address the goals described in the challenge.\nAs the Setting specifies, attracting new developers and new types of developments are exactly what this challenge is all about, so by doing something that does not only service existing users and use cases, but paves the way for easier development in the future is a further benefit of this proposed project in the light of this fund's objectives.", "q0r": 5, "q1": "TxPipe.io have already created the Oura backend tool and have a meticulous open source presence and strong team, especially on the Python development side and for technical writing and professional execution of projects with well-defined scope like this. I am highly confident that they can deliver the promised results over the detailed timeline and within the well-specified budget. All the team's profiles are present, and the company website and Github pages are well-maintained and informative. This seems to be a strong team with a passion and commitment to Cardano that should achieve or overachieve on the brief and milestones.", "q1r": 5, "q2": "The team demonstrates very good use of Github to update and allow tracking of their projects, and are very active and highly regarded in open source circles. The business plan, budget and timeline are broken down to the last detail, showing recommendable care and transparency. Abstracting from the technical difficulties this project might pose, the auditability and clarity are outstanding and give me high confidence that the auditors and community will be able to understand and follow the implementation.\nAs we are promised a more detailed roadmap on Github after funding, it would have been nice to see some estimates about performance metrics and a \"dummy\" project github link or some other way to understand the roadmap better.", "q2r": 4, "assessor": "z_assessor_2554", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5200, "q0": "The project tries to provide a set of Kubernetes operators for the main Cardano components, hiding the configuration complexity behind high-level resources. This greatly helps developers in deploying Cardano-specific infrastructure on Kubernetes clusters. The impact of the project is huge as every developer can benefit from it. The proposal itself is concise and readable, yet still, gives every crucial information. The proposal outlines the main risk as the team probably doesn’t know the best practices from other teams/developers, which personally I find is not fatal to the project. But the proposers have mitigation by reaching out to different projects, and IMO is sufficient to overcome the risk.", "q0r": 5, "q1": "The milestone and timeline sections are written in a readable and structured format. Each milestone are providing deliverables, the time it takes, and developer needs. The budget breakdown is concise yet so complete. It must be appreciated the proposers not only provide the total budget but also outline the hourly rates and required hours. That information is important to let the voters know the workload of the project and ultimately can determine if the requested budget is reasonable or not (in this case it is reasonable). The information on contributors of the project is inconsistent, Santiago Carmuega is complete by providing background, experience, and past projects. On top of that also attaching a Github account so the community can easily check the proposer's abilities. It will be much better if other people give the same information.", "q1r": 5, "q2": "As the proposal provides the public Github repository, the community can easily track project progress by the repository activity. The team also published the updates through the Twitter account and discord server. The defined success of the proposal is concise yet informative. With existing and new Cardano projects using Kubernetes use the available operators.", "q2r": 5, "assessor": "z_assessor_2675", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 5427, "q0": "Kubernetes often know as K8s which consist of components that represent the control plane and a set of machines called nodes.\nAs understanding it takes lot of time and knowledge, As maintaining and and deploying all these components of Cardano on Kubernetes Clusters is hard process and very complex, As it requires greater understanding of all configurations. As proposer wants to provide Kubernetes Clusters with all complexity hidden by them and reducing time level and give new Kubernetes operators to Cardano components making it easier to use.\n strongly agree with proposal and This proposal effectively addresses the challenge.", "q0r": 5, "q1": "They have provided detailed roadmap and timeline explained all into many phases and milestones. They have explained taking 2 months to complete first milestone from operators, development to deliverables and Milestone 2 Stateful Procedures and Milestone 3 Documentation which looks great.\nAbout budget breakdown they have explained\nhow many hours they need to complete and hourly rates of developers , engineers and writers which all look sesnible.\nLooking at there team of 4 which includes developers , planners, validator and Tech writer which is enough to complete proposal.\nI strongly agree with proposal and  Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "As by deploying new Kubernetes with less complexity will increase transaction among Cardano users and attract more users. \nAs progress of project will be measured by KPIs and metrics,\n The proposer will be providing details roadmap achievements and deliverables report on open source. Each milestone details will be provided, Direct communication will be established in Discord and explaining if queries arises. weekly summaries provided to community, I feel this is enough to Audit the process, I strongly agree with proposal and with given  information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2702", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 8984, "q0": "This is a great project for the Cardano environment. The project basically aims at easing the barriers for the developers to deploy their codebase for various DApps on the cardano environment. \n\nThis is done by creating a Kubernetes cluster. Kubernetes or K8s as it is informally called, is an container orchestration tool, meaning you can deploy your code in form of smaller set of codes and interlink the codes/applications to function as a single application. These all small set of codes are deployed on a kubernetes cluster where in it can be managed efficientlywith having certain servicers continuously running even if a services goes down by having multiple instances of the service running on the cluster.\n\nThis employs a container technology, which reduces the work load on the developers to make their application to deployable on a particular platform. \n\nThe proposal essentially is providing these clusters with operators for environment management, to developers to deploy their code or application without making their application platform specific. This in-turn increases adaptability of Cardano and hence attract more skilled and seasoned developers to the environment.\n\nThis is a great initiative, as it allows the developers to actually deploy their code/test/modify/update without having to worry about the platform. The cardano components this cluster will be available for are: Cardano Node, DB-Sync, Ogmios Submit-API.", "q0r": 5, "q1": "The track record of the team behind this initiative is excellent. They have demonstrated their expertise in delivering the projects in Oura and Pallas projects.\n\nThe milestones have been set and described precisely. \n\nThe budgets are specified at rate/hour and total number of hours required, this is a marker of a seasoned proposer on Project Catalyst.\n\nThe team involves 4 members: 2 Python Developers with an average experience of 8 yrs and 1 Cloud and Project lead, and 1 Technical writer each having vast experience in their respective fields.\n\nConsidering the experience and track record of delivering the previous projects, it is more than like that the project will be delivered and would be helpful for the community in a major way.", "q1r": 5, "q2": "'A detailed roadmap will be presented as part of the open source repository., hence cannot be judged based on the data provided in the auditability section.\n\nHowever after assessing the budget breakdown and the timeline listed in the Feasibility section. The auditabilty can be inferred to be good enough,. The weekly updates regarding the progress on their twitter account(as mentioned) should also provide good transparency and monitorability. Discord / GitHub can be used to audit the technical progress.\n\n", "q2r": 5, "assessor": "z_assessor_3009", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 11610, "q0": "This proposer and his team has done a yeoman's job by placing the proposal in the right challenge. The proposal therefore effectively addresses the challenges and has the potential of bringing value to the cardano ecosystem. \nThe proposer and his team has demonstrated an in-depth knowledge about software developing and creating apps for cardano. With the experience poured out over here I think if cardano and project catalyst is of the view that they are creating an awesome experience that will incentivized developers which will to lead to increased developer adaption productivity and creativity, I think this is one of the results-oriented proposal that must be funded. The proposer and his team has created an app which is called a Kubernete operator which is an application specific, controller that can help you package, deploy and manage applications on the kubernete cluster. The proposal also stated that this proposal involves the developers of an operator for each of the following commonly used cardano components. Cardano node, DB-sync, Ogmios,submit API.\nTo continue, the proposer and his team also has removed the complexity associated with managing cardano infrastructure which will allow developers to focus on project features while do seamingless adopting best practice this and many more are the reasons which call for the funding of this particular Project, the proposer and his team are very determined and it shows in their explanations in the projects and I do agree with them that they should be funded to execute the proposal successfully.", "q0r": 5, "q1": "Given the experience and plants presented by the proposer it is highly likely this proposal will be implemented successfully and which bring success to Cardano and project catalyst. The proposer and his team has brought a clear roadmap on how they intend to carry out this project. The project is in phases phase one which takes up to two months and the activities to be undertaken in it include 2 month development, one full-time Python developer, 1 part time SRE, deliverables and all operators but with limited features install procedures versions are upgraded procedure monitoring and alert procedure. These are some of the milestones in the first and second phase and we have a litany of these programs and projects run in phase 1 to be repeated and same in phase 3 to carry out the proposal project according to them if funded.\nIt is said that cardano attracts high calibre developers and developers have ample resources to work on platforms that suits their interest and I think this is one of the great developers that should be attracted buy cardano in order for the world and the participants of cardano to get the fruit of his knowledge. The proposer and his team has also requested for a budget and which when given will facilitate the execution of this project. This budget is of importance to this proposal Project, the proposer and his team has taken the pain to break the badget down into identifiable bits and every penny is allocated to an activity for the sake of accountability. The people that would be working with the proposer and his team in the project if funded, their details and links has been put out in this proposal for easy traceability and confirmation of their existence and who they are in the block chain industry. If this proposal should receive funding.\nIn the area of risk, the proposer and his team said it has experience deploying this components but other teams might have identify best practices known to them and so on how to mitigate some of these challenges they come across in the field include reaching out to different projects and requesting non-confidential information on how they run their infrastructure to assure that they are contemplating all the best practice already used by the community if funded.", "q1r": 5, "q2": "The proposer and his team has presented sufficient information to be able to audit the progress and the success of the proposal. The proposer of the project says the progress of the project will be measured by released versions metching the scope predetermined milestones. In order to get the auditing right the proposal said a detailed roadmap will be presented as part of open source repository, and that the milestones and task  will be tracked via GitHub using their projects management tools and also that a weekly update summarise will be posted via TX pipe's Twitter account. With the precise and detailed information provided I would agree that the information provided above is sufficient enough to audit the progress and the success of this proposal if funded. What the success of the program looks  like the proposer and his team said that the existing and new cardano projects using kubernetes use the available operators as the default canonical will of provisioning or providing infrastructure if funded.\nWith a key metrics provided I think the program and the proposal deserve funding.", "q2r": 5, "assessor": "z_assessor_3260", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11838, "q0": "Problem Statement and solution are clearly stated. The proposal asks for funding of a kubernetes operator to simplify Cardano component deployments in a K8S cluster. I know from personal experience that deploying more complex software solutions on K8S can be tricky and time consuming. Lowering entry barriers for developers is an important aspect to drive adoption and K8S is a very popular technology. I therefore agree that the proposal addresses the challenge.", "q0r": 4, "q1": "Team members are explicitly stated with their roles in the project and seem to have relevant experience though no external profiles (e.g. linkedIn) are stated for most of them. Therefore it's hard to assess to what degree they are capable of delivering the project. The roadmap is split up into three major milestones with deliverables, but no timeframe has been provided. Funding is also very vague and is not matched with each milestone. Not knowing the best practices of other teams is stated as a risk, something that could to some degree already have been mitigated as part of the proposal drafting and preparation process. Also the roadmap is not factoring in time/tasks to collect this information. Hardcoding stuff into a binary suggests future maintenance requirements which are not specifically stated in the proposal either.\nThe team might be able to deliver their proposal but many details are missing, so i cannot agree or disagree if this proposal has a high probability to implemented successfully.", "q1r": 3, "q2": "The team states there will be a detailed roadmap provided as part of the open source repo, but its not available yet. Based on this fact and that also there are no timeframes or KPIs for the milestones given it is hard do assess how good the auditability of the project will be. Therefore I respectfully disagree the proposal provides enough information to the community to track it's progress effectively", "q2r": 2, "assessor": "z_assessor_3289", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "We'll provide a set of Kubernetes operators for the main Cardano components, hiding the configuration complexity behind high-level resources.", "experience": "We're TxPipe, a small team of seasoned developers passionate about Open Source and Cardano. It is the team behind existing projects such as Oura & Pallas. We specialize in backend development, data pipelines and cloud architecture. Rust is our language of choice."}