{"id": 422721, "author": "mmahut", "title": "Plutus support for Golang SDK", "url": "https://cardano.ideascale.com/a/dtd/422721-48088", "category": 26597, "amount": 32000, "description": "Golang serialization library has been funded and completed in previous catalyst rounds. It support Byron and Shelley era, in order to attract developers we need to bring it up to date with Plutus.", "f6_no_assessments": 7, "f6_rating": 3.8571428571428577, "videos": [], "media": [], "f6_assessments": [{"id": 2704, "q0": "This is a proposal by Five Binaries, a company that has been active in the Cardano Ecosystem for many Catalyst funds now, to update a serialization library called Golang, to support the Plutus language. The proposer points out that it is important to do this in order to expand support of programming languages on Cardano. Currently, only Haskell, JavaScript and Java are supported properly, while upgrades like this one will immediately add support for Go and then other languages in the future as well. This means that the pool of developers who will be capable of building on Cardano will grow considerably, which I agree is something necessary for us to keep expanding.\nThe risk that the proposers identified is that serialization libraries are very difficult things to implement and it’s hard to estimate the necessary time to complete them. The mitigation to this risk is simply being aware that this is the case and factoring in the possible extra difficulty into the estimated time for completion.\nI fully agree that this proposal effectively addresses the Developer Ecosystem challenge, as the outcome here will be increased support for developers to build on Cardano. Score: 5.", "q0r": 5, "q1": "Five Binaries provides us with a worst case estimation of 5 months to complete the work and a best case estimation of 2 months. This is quite a range, but it’s understandable considering what they mentioned in the Impact section above. We are also given 3 milestones to look out for, which seems enough planning to me for something that is a straightforward (but possibly difficult to implement) task. The requested budget of 32000 USD is very reasonable considering the rough estimation of 480 man hours needed to finish the work (this comes out to 67 USD/hour, a very modest price for a developer in this space). \nThe person working on this will be Five Binaries’ lead Go programmer. Ideally, we would have been given a name and some credits to back this person up, but it’s not the first time I see companies with Catalyst proposals not do this and given the track record of Five Binaries (visible here: https://catalyst.fivebinaries.com/), I still feel confident in their ability to deliver. As a recommendation for future proposals, however, do try to provide a link to a social platform for the people that will work on the project, as this allows the community to see that the person is real and possibly get in touch with them if necessary.\nIf anyone has the relevant programming knowledge, the repository for this library can be found here: https://github.com/fivebinaries/go-cardano-serialization. \nI think this proposal is highly likely to be completed successfully. Score: 5.", "q1r": 5, "q2": "It’s been a pattern for a few Catalyst funds now that companies are not very verbal in the auditability section and it’s no exception for this proposal. Five Binaries provides us with a link to their Catalyst dashboard which I also added above and while it is true that one can find what’s been done for a project there (especially the ones already delivered), I would be remiss if I did not mention that Catalyst strongly recommends that proposers think about key progress indicators in the Auditability section, as these will help the community keep track of what is being done here. It’s understandable that companies with many successfully delivered proposals rely on their reputation to take care of this aspect, but in order for me to be able to give a perfect score, KPI’s and clear success metrics need to be included here, which unfortunately they are not. As a measure of success we are only told that this will be the final implementation with documentation and examples. This does help show that the code was written, yes, but it does not prove that the proposal succeeded in helping expand the Developer Ecosystem. For that, for example, a success metric could be “have at least 1 team start a project on Cardano using Go within 3 months of this proposal being completed”.\nAll in all, however, as I stated before, support for more programming languages is always a good idea and since this company has a good track record, I am sure the community can work with them to verify the progress and success of this proposal. Score: 4.", "q2r": 4, "assessor": "z_assessor_2335", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3581, "q0": "The proposal is about expanding the functionality of the golang serialization library to support Plutus. It's a straightforward idea and will have some impact on the community, but probably later on. Right now the library doens't see much support so the impact would be limited.\nThis project is in alignment with the challenge settings and would help development efforts of golang software engineers and would invite devs to work with it. As the author stated the isn't much attention right now for one reson or another, because because the toolchain around go isn't mature enough yet.\nThe proposer has one challenge in mind, and has solved it with extra time, but I can't say if that extra time is 10 or 20 or 50% of the final 480 hours which is problematic for assesing argumentatively.\nThe proposal currently lacks details. There isn't enough information about the budget, extra time estimated, technical details and plans and some more, but these are the main ones. Overall I' heasitant to state this will be an impactful proposal, but it might have some backing later on.\n", "q0r": 4, "q1": "The proposal lacks links to team members that will work on it. I looked through the repository to see the github commits so I can see who's going to work on it and found a person called HannesKimara if the github handle could be trusted as a name. I searched for this profile in linked in and only found https://www.linkedin.com/in/hanneskimara/. This profile has no information about skills so I don't know where to go on from here.\nThere's no breakdown of the necessary budget. There's a mention of 480 hours for a successfull implementation and a budget of 32000 so that means 66.67 $/hour, which I can't say is ideal considering most other proposals I've seen hang between 45 - 50 $/hour. But the real question that I have is how much time from those 480 is a buffer for unpredictable circumstances and how much is for planned development. The usual reasonable buffer for unpredicted circumstances is between 5-10% from my experience as a developer. Unfortunately it isn't specified in the proposal.\nConcerning the timeframe, 5 months seems a reasonable amount of time to deliver the listed functionalities. There is some lack of the technical plan of implementation which is not broken down so there aren't any segregated tasks to estimate to make a combined expected timeframe, so I have troungle estimating that as well, but as I said, 5 months seems doable.\nMy sincere suggestion to the proposers would be to put more effort into the next proposals they will do, because it will leave a better impression on the assessors and the voters and that increaces the chance of the project to be realized and funded.\nOverall I can't say if this is a feasible proposal or not, because lack of information. Good luck in this and the next funding rounds.\n", "q1r": 3, "q2": "The proposal has really good auditability. I really like the site created to follow the progress of each project done or in progress. Anyone interested can go to https://catalyst.fivebinaries.com/  and check out their projects by following the links.\nThere's a clear problem and a somewhat clear solution to the given problem, but I didn't spot any KPIs or metrics for user adoption or technical progress. People can always look at github and see the commits directly, but for non technical people I don't think this would be a prefered choice. I do hope this proposal gets funded, in the future when it's polished and has some community behind it.\nAs a summary I think this proposal is auditable and people can follow along with it's progress on github and the aforementioned site.\n", "q2r": 5, "assessor": "z_assessor_2463", "no_vca": 14, "ne": 4, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4694, "q0": "The well-defined issue of supporting the Byron and Shelley eras to attract author developers who needed to update it with Plutus needed to be addressed at this challenge. This issue is addressed through the implementation of Plutus support which includes the Vasil fork element that powers Golang automation from previous catalysts. The author has measured the risk for this project from previous experience which is a delay in delivery and the risk of delay due to the technical difficulty of the task. They also have a workaround to reduce this risk by giving them more time to deal with technical issues.", "q0r": 5, "q1": "The timeline for the author to release the Go sequential library project with Plutus support is within 5 months if it receives funding. They will make their best effort to get this done within the first two months. The timeline is reasonable for completing this work. They give 3 milestones: providing Plutus support (one to three months), providing necessary changes to Vasil (one to two months), and documentation and examples (two weeks). The success of the project is related to the challenge of the campaign. The solution to this challenge is to offer Go as another programming language then increase its availability and attract more developers into the ecosystem.", "q1r": 5, "q2": "Well-defined KPIs easily measure their progress by reporting the progress of all their sponsored proposals on the Catalyst dashboard. We can visit their Web site here https://catalyst.fivebinaries.com/ to see more of their metrics. The members of this proposal are the Five Binaries team who have relevant experience with this challenge and this is also a follow-up project to the Go Serialization Library that was funded in Fund 3. The application budget for this project is $32,000 under 20% of the budget is funded for the whole challenge. The budget is clear they use this money just to spend programming hours of their programmer they estimate it will take 480 man-hours to ", "q2r": 5, "assessor": "z_assessor_2608", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5287, "q0": "The plutus support for Golang SDK proposal will implement plutus support (especially vasil fork element) into the Golang serialization library. The proposal aims to support Go programmers and attract them into Cardano. The Five Binaries team foresee the challenge in term of delay in delivery. Other than that, this plutus support for golang SDK should make the transition of people who know Go to come to develop more on Cardano and effectively address the Developer Ecosystem Challenge.", "q0r": 5, "q1": "Although the Five Binaries team will release the Go Serialization library within 5 months, it is possible they will attempt to finish this project within 2 months. They could give more detail on the 3 milestones. The example is what are those changes needed for vasil. It should take around 480 hours of go developer time.  Updating the library of golang SDK to take into account of the most recent hardfork should be possible for the team to complete the project as they have worked with Go serialization library since fund 3.", "q1r": 5, "q2": "The project is auditable simply with all documentation and examples and they also have their dashboard at https://catalyst.fivebinaries.com The proposal could do more with the detail on milestone and key metric in each milestone. However, as the Five Binaries team has dedicated space to report project progress, it is convenient enough for the community to see that the project is on track and will be a success.", "q2r": 5, "assessor": "z_assessor_2684", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 5931, "q0": "This is a pretty useful proposition. Golang serialization library has been funded and completed in previous catalyst rounds, in this proposal it will be updated with Plutus. Compared to other blockchains, Cardano has very poor programming language support. However, this project offers Go as another programming language, which will help increase availability, attract more developers to Cardano, and help the Cardano ecosystem to grow. With the above reasons, I firmly believe that it will effectively solve the challenge.", "q0r": 4, "q1": "According to what is provided, the Five Binaries team will work on the proposal. However, I did not find any information about the team. I think you should add information related to the team. For example: name, skills, knowledge, work experience, forte, profile,... . Providing specific information about the team will help people trust the project more. As you know, the team plays a very important role in determining the success or failure of a project. Unfortunately !\nThe roadmap and budget allocation is so vague, I can't figure out what you plan to do. For the project to go smoothly, you need to provide a more specific roadmap. By listing even the smallest things to do, then allocating them to specific timelines. Also, I think the marketing and communication will also help increase the reach of the project, please add it to the roadmap section. The budget should be broken down even further, everyone needs to know how the $32000 is being spent. Here, I have some suggestions that might help you: determine the number of people involved in each job, determine the number of hours worked, the hourly rate, .. and then recalculate the budget. more specific. This will make the project more transparent than ever. It is commendable that you have a page to report project progress (https://catalyst.fivebinaries.com/). However, it would be even better if criteria for assessing progress and success were provided. For example: after implementation, there will be 300 monthly reach,... . Having specific metrics makes it easier for everyone to gauge the progress and success of the project.", "q1r": 2, "q2": "The Go Serialization Library was funded in Fund 3, which is a very good sign. However, in this fund9, I am sorry to say this, the information provided is incomplete, therefore, I do not think this project will be implemented. If you want the project to go smoothly, you should add the information that I mentioned in the previous section (clarify budget, add team information,...). Let's do it again, let's work together, don't give up. Hope to see you again at the next funds.", "q2r": 2, "assessor": "z_assessor_2757", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 7144, "q0": "The proposal tries to update the existing Go library for serialization. For context, serialization means converting an object into a format that can be utilized, and in this case, into formats such as Cardano address, transactions, fees, etc. I personally experience how data structures in Golang are a bit strict; thus, having a serialization library without having to understand the underlying implementation would make developers' lives a lot easier. It’s obvious how this proposal would fit with the challenge setting, which is to attract Go developers who aren’t fully supported in the Cardano ecosystem. I consider this a potential opportunity because many software engineers in the industry are using Golang to develop their software using microservices architecture.\n\nThat being said, I am still unclear whether this proposal's contribution would be as significant as I made it out to be because, based on pkg.go.dev, there aren’t any imports yet. It doesn’t mean that providing updates is a bad idea; it just means that there haven’t been any new Go packages that depend on this serialization library. Considering the huge 32,000 USD budget requested, it’s crucial to address this. Perhaps the proposer could give us some insights on how the previously funded serialization library has impacted or attracted developers. Another way to emphasize this proposal's impact might be to explain a little bit about what changed for the Vasil fork, and from there we could determine if there are many breaking changes or not. I understand that providing this information might require a lot of research time, but that’s just one of many ways for us to understand the proposal’s necessity. For now, I tend to agree, but I still want to hear the proposer address the few points above.", "q0r": 4, "q1": "I am confident there would be no major blocks in the proposed implementation. The proposer has relevant experience previously, both in developing the Go serialization library (which includes researching the Haskell implementation as well) and providing the Golang SDK for the Blockfrost API. The person in charge of this proposal seems to be just one person, their lead Go programmer, and if we calculate the total budget divided by the approximate man hours spent, we’d get a rate of $66.67 per hour, which is a senior software engineer rate. Considering the team experience, I think this number is reasonable. The timetable provided is great since they also put in an additional time buffer to deal with delivery delays. I do want to hear the response from the proposer themselves about one question. What is their workload right now? Because based on their Notion, we could see they still have on-progress projects from Fund 6 and Fund 7. Other than that, it’s all clear.", "q1r": 5, "q2": "The proposer has given us enough information for auditing. The milestones are listed in the proposal, which consists of Plutus support, Vasil fork support, and documentation, all within two to five months. The success of the proposal is self-explanatory; the release of the new Cardano Go serialization library complete with its documentation. We could track this in real-time using the library’s Github and also monitor the team's overall work using the provided Notion. Overall, the provided information is sufficient. That being said, I wonder if it’s beneficial to measure the library forks, stars, or imports as a way to determine developers' usage. On one hand, the concern about the library not being used is always there when developing something, but on the other hand, the aforementioned metrics might not serve as an accurate indicator, especially since Cardano or blockchain in general are only starting to improve their developer ecosystem, so the numbers might be low.", "q2r": 5, "assessor": "z_assessor_2878", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 14634, "q0": "The project was created to solve the problem that the proposer suggested that Cardano has very poor programming language support compared to other blockchains, to this day, supporting only Haskell, JavaScript, and Java fully. To expand the pool of potential users and draw more programmers into the ecosystem, Go will be added to the list of available programming languages. I regret that the proposer provided insufficient information to be able to evaluate the project. With the content shown in the impact section, the proposer does not show any information about the purpose, main functions, main activities, and results of the project. In addition, the proposer does not have a roadmap and does not express expectations about the future of the project. I tried very hard to find the highlights of this project but failed because the proposer did not have a specific plan. The description of risks and solutions is also outlined in a sketchy way, not at the heart of the problem. I hope the proposer can add the information as mentioned above in a clearer way to increase the persuasion of the project.", "q0r": 1, "q1": "I couldn't see the seriousness of the proposer for this project because the way the proposer plans the work and budget is really not detailed and has no basis for evaluation. First, the work plan has no specific timeline, no detailed list of tasks that need to be completed, no expected time for completion, and no person responsible for that work. Second, the budget breakdown has only one item, which is the cost of 480 hours - $32000 for the developer to complete the project, nothing expense else. Finally, the proposer describes that \"Five Binaries team is going to be working on this proposal\" but does not provide any further information about the group. I cannot know how many members the group has, education, and work experience, because the proposer does not provide the above information.", "q1r": 1, "q2": "Again, I regret to comment that the information provided by the proposer was not sufficient for me to evaluate this project objectively and effectively. Proposer does not provide key metrics, KPIs, traffic, or any other numbers that represent their expectations for this project in the future. The proposer also does not specify the outcome of the project if successful, so it is difficult to know what metrics the success of the project will rely on.", "q2r": 1, "assessor": "z_assessor_4076", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Implement Plutus support, including Vasil fork element, into the Golang serialization library.", "experience": "We have implemented the Cardano serialization support into Golang."}