{"id": 422818, "author": "nmkr", "title": "Unity Game Engine NFT Plugin", "url": "https://cardano.ideascale.com/a/dtd/422818-48088", "category": 26597, "amount": 45000, "description": "Cardano is not very accessible to Game Developers, there are barely any games running on Cardano and even less Game-Focused tools.", "f6_no_assessments": 6, "f6_rating": 3.6666666666666674, "videos": [], "media": [], "f6_assessments": [{"id": 762, "q0": "Yes, the proposer wants to create an NFT minting add-on that can be used by game developers in Unity.  Unity is one of the leading game engines on which more than 50% of all games run. I have reviewed other proposals in Catalyst where game developers are using the Unity game engine to design the games therefore it is popular platform.  This create a better experience for existing developers in Cardano as well as potentially attract new developers knowing that they can integrate Cardano NFTs into their games. It aligns with the challenge setting of creating an awesome experience for developers and attracting new developers to Cardano. Plug-in will be released on Unity Asset Store for anyone to use. The Proposal does not mention whether that minting service will utilize their service and charge a fee, or if it will be for free and made open source.  Overall I think it will benefit the developer experience.", "q0r": 4, "q1": "The Proposal identifies three individuals who will be working on the project and there is a short bio for each one however, no links are provided to social media profiles. The proposers have created the NFT MAKER  which is a popular NFT minting platform on Cardano which support the idea that they can deliver the project.  The project plan is rather vague and high level: it includes 4 weeks to prototype the plugin, eight weeks for development and 2 weeks for Q&A. The budget is set as time for a senior developer which works out to just over $10k per month. This is a competitive rate for a Cardano developer.  No description is provided about the programming language, architecture, or how the plug-in will be developed; therefore, it is difficult to assess whether the time and the budget is right for the task. The main risk is deciding if they want to build a wallet inside Unity, or connect to an external wallet; whatever they decide might be a suboptimal option and might need to rework. This is a risk in any software development. Overall I don't think there is enough information to determine whether they will be able to deliver the project or not.", "q1r": 3, "q2": "The Proposal aims to create monthly reports and share with the community.  There are no meaningful KPIs proposed.  Success is stated as a release of the plug-in into the Unity Asset Store.  The deliverable is quite clear but the intermediate steps lack detail.", "q2r": 3, "assessor": "z_assessor_2123", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 4073, "q0": "Even though it's a brief proposal it is a compelling one. The proposer aims to develop a Unity plugin to attract game developers to the Cardano ecosystem. With features such as NFT minting, wallet connection and querying metadata of all NFTs from a wallet into the game this plugin has the potential to increase the number of developers actively building on top of Cardano and attract high-caliber game developers. This in turn can lead to the creation of awesome games and increase the number of Cardano users in general, which would add value to the Cardano ecosystem. On the other hand, the proposal never discusses strategies on how to scale to address future challenges. Also, no KPIs were defined to track and assess the success of the proposal.", "q0r": 4, "q1": "The members described in the proposal and the NFT-MAKER company itself seem to have a pretty solid experience both with Unity and blockchain technologies. However, they were not able to provide evidence of that experience through LinkedIn links, for example, or bios in their website. Their budget is outlined in a clear and very concise way and they know which type of skills will be required to implement the tasks proposed. However, the amounts requested seem a little overpriced (USD 73 an hour for a developer). The plan provided is extremely summarized, to the point it harms the quality of the proposal. The first two phases are the creation of a prototype and then the development, but the proposal does not show what will be done in each stage.", "q1r": 3, "q2": "The roadmap provided is very poor and lacks a lot of information. It is literally three lines long or eleven words long. The team could have provided a clearer understanding of what will be done inside each stage of the project and state what they expect will be delivered each two weeks or so. Also, no KPIs were defined in the proposal. Some suggestions of metric would be number of developers attracted to the Cardano ecosystem, number of downloads of the plugin or better experience by developers developing games in the Cardano blockchain (could be measured by a survey for example). Finally, the team mention they will create a monthly report but never says where it will be published. Preferably it should be made through a public channel.", "q2r": 2, "assessor": "z_assessor_2513", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5289, "q0": "The Unity Game Engine NFT plugin proposal will create a Unity plugin (to be released for free on the unity asset store) and allow for easy management of NFTs and NFT minting in-game. The NFT-maker.io has built the very first NFT minting tool on Cardano and create the largest NFT minting API. This proposal will extend the utility of NFT and bridge them to the game space. Currently there are only 2 other NFT plugins (on Ethereum and Solana) on the Unity asset store. It will make it easier for game developers outside Cardano to build more in the Cardano ecosystem. The team also mentions the risk in the way they connect wallets to the Unity Game Engine (not decided between native wallet inside Unity or an external connector through a website). There are pros and cons on these 2 options but the chosen approach could be the best possible as the team weighs between options and picks the one that would lead to the most secured and convenient for cardano wallet holders. As such, I strongly agree that this proposal effectively address the Developer Ecosystem challenge very well. ", "q0r": 5, "q1": "The proposer should give more information on the detailed plan. The timeline of 14 weeks looks reasonable for the main tasks - plugin prototype, plugin development and Q&A. The proposer should also tell how many working hours will be spent on the project for each role. This will add to the feasibility of the project and make the total budget $20000 look reasonable. It will also be useful to know the team member online profile and their responsibilities. They would return to Catalyst only if they want to expand this plug-in. ", "q1r": 4, "q2": "The success will be their release on a functional plugin to the Unity Asset store. The proposer should add the metrics to measure the progress of their main tasks so that the project itself would be on track within provided timeframe for their main tasks. The key metrics such as number of users on its Unity Game Engine NFT plugin would be a good start. The plugin development takes the longest time for this project and by having key metrics on this phase, it would increase productivity of the team. Creating a Unity Game Engine NFT plugin will extend NFT utility and bring more Unity game developers to Cardano. ", "q2r": 4, "assessor": "z_assessor_2684", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 5584, "q0": "I'll start by saying that I'm a fan of gaming and of Unity. I've seen what others are building using Unity (NOT on Cardano) and would love to bring this functionality to the chain. Given the number of builders, assets, and collaborative opportunities locked behind this plugin, this proposal definitely addresses the challenge of expanding the developer ecosystem. \n\nFurthermore, given the interaction in the comments, it's clear to me that the team behind this proposal understands the desires of the gaming community when it comes to blockchain gaming. \n\nFinally, the proposal includes members of NFT Maker as part of the team that will build out this plugin. Knowing that this project is tied to NFT Maker gives me additional confidence for the project's success. ", "q0r": 5, "q1": "As noted in the tail end of my previous response, the team working on this includes members from NFT Maker (Patrick Tobler), which carries a certain gravitas given the success of NFT Maker and it's own goals in the space.\n\nTaking a look at the groups credentials there is much confidence in me that this proposal will be implemented successfully. Given my own experience within the space, I'm familiar with what this team has already implemented and believe they are more than capable of completing this plugin challenge.\n\nThe plan itself is also well-organized and well-thought out. If anything, this feels like a natural progression for what the group has been building. \n\n\n", "q1r": 5, "q2": "This is one of those, \"when we succeed, you'll know we succeeded\", type of progress reports. In many ways, this isn't a terrible way to audit the project. Still, for those that are looking for more things to audit, the group could easily add ways to update everyone via milestones. But those should be developed by the team. \n\nMuch of the trust that I myself place on the team is based on what they've achieved previously. It's also based on the many things they've done within the larger community, many things which are not noted here. In any case there could be more detail about the process. \n\n\n\n", "q2r": 4, "assessor": "z_assessor_2716", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8317, "q0": "From what I’m given to understand, the focal point of this project is to provide a free to download Plugin to the Unity Engine that supervises NFTs and NFT minting in-game and makes the development process on Cardano for the common group of developers. This PlugIn will contain the components that the team believes together will create a good tool to invite Game Developers into Cardano, just like how its other 2 iterations on Ethereum and Solana have managed to do. The team has also extracted one main issue they have with the foundation of the project, which is their to-be-determined approach to how they integrate wallets into the Unity Game Engine. Currently, they have had two options of using a native wallet inside of Unity or enlisting the help of an external joint through a website. I hope that the team can soon come to a unanimous decision and inform us of their choice. \nPerks and merits aside, I would like to bring up a few points that I find as shortcomings of this section. Namely, while the components and main function are present, the proposer hasn’t gone into details explaining what each of those components actually do and how they work together inside the Plugin, and though the main function of the project is to bring in more developers from the outside community or other blockchains into Cardano by making things easier to manage, which I suppose fits well with the objectives of this Developer Ecosystem challenge, the key metrics to actually measure those figures of success are still absent from the proposal. I’m aware that this project is not opting for a great scale in structure and size, but still, I would love to have more details to understand the project more thoroughly and have a more conclusive verdict. Therefore, I would suggest the proposer supplement those details quickly.", "q0r": 3, "q1": "This is another section which, once again, leaves quite much to be desired. What I mean by that is while the proposal does have some information for all the requests, but lengthwise and detail wise, It leaves me baffled and wanting for more. To be specific, in the timeline and milestones provided, there are only 3 categories that have been brought up, the 4 weeks of making the Plugin prototype, 8 weeks for Plugin Development and another 2 weeks for Q&A. I honestly wish to know more about what occurs in each stage, for example, what components would be utilized to make up the prototype, which features will be enhanced from the prototype to form the final product or perhaps where the Q&A session will be hosted, etc. \nThe same situation also applies to the listing of individuals involved in this project, as I am offered with the names and respective expertise only, and no other further insights into each member or no means of verification in the forms of online profiles or visual evidence.\nThis makes it hard for me to assess the budget either, since I have no deep explanations of why each segment costs the requested money.", "q1r": 2, "q2": "As far as auditability is concerned, the team may perhaps achieve a certain degree of it via creating a monthly report and sharing it with the Catalyst community. Yet, once more, there are still no key metrics to measure the progress of the project, which will ultimately be the content of the monthly report. \nThe success of the project would evidently mean the fruitful deployment of the Plugin on the Unity Asset Store for the quick and convenient access of Unity developers on Cardano, which, as I mentioned above, aligns well with what this challenge seeks for. Nevertheless, It would be further appreciated if the team had included more details of how much of an easier time those developers would have with the Plugin.", "q2r": 3, "assessor": "z_assessor_2974", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10410, "q0": "One of the potential elements of the Cardano ecosystem is the gaming industry. Although many game projects are being built on Cardano, game developers are still struggling to use game tools to build. Using these tools in the Cardano ecosystem is still difficult for game developers. The proposal suggests building a Unity Plugin that helps game developers on Cardano manage Nfts and mint Nfts easily. The proposal is realistic and very useful for game project development. After completing the Unity plugin, it will be uploaded on the Unity Asset Store for all game developers of Cardano.", "q0r": 5, "q1": "The team is NFT-MAKER team. They are building nft-maker.io on Cardano. The team is good at blockchain, especially, Cardano. I am using their platform. It’s very smooth. Although the team has experience with the project, they should give more details about their team information for everyone to check. They have a road map for their project and they also suggest $45000 for this project. However, they should tell more details in the road map. In addition, they should also disclose details of how the budget is used for each issue.", "q1r": 4, "q2": "According to NFT-MAKER team, they share a monthly report with the Catalyst Community. They should create social channels to update information about the Unity Plugin. This way will help everyone easily follow. They should share data and documents relating to the Unity Plugin. In addition, they should have detailed KPIs for the project.", "q2r": 3, "assessor": "z_assessor_3183", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "We want to create a Unity Plugin which will be released on the Unity Asset Store for free, that allows for easy management of NFTs and NFT Minting in-game.", "experience": "We've built the very first NFT Minting tool on Cardano and since then created the largest NFT Minting API, that has powered over 1.2 Million Cardano NFTs. Our focus is making Cardano development easier for regular developers."}