{"id": 396732, "author": "felixweber", "title": "Catalyst - Rapid Funding Mechanisms", "url": "https://cardano.ideascale.com/a/dtd/396732-48088", "category": 26455, "amount": 750000, "description": "How can we distribute Cardano Treasury funds more rapidly in a transparent, accountable, and safe manner?", "funded": 1, "upvotes": 36993556, "downvotes": 21569920, "votes_result": 15423636, "votes_cast": 153, "f6_no_assessments": 3, "f6_rating": 3.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 1146, "q0": "In the previous fund, there were only 15 proposals that applied for funding within this challenge. Of those, 11 were approved by the community, but only four were funded. I can identify relevant variables in this case, on the one hand, it was one of the challenges with fewer proposals in fund 7, on the other hand, the percentage of proposals allocated funding is below average, while the percentage of proposals approved by the community but not allocated funding is among the highest. The first indicates a relative lack of interest in this challenge in the community, whereas the latter two indicate a need to increase the challenge's budget. Considering the above, and that fund after fund the overall budget increases it makes sense to me to increase it 200% but I am hesitant to increase it 300% and bring it to $750,000. That is why I gave it a rating of 4.", "q0r": 4, "q1": "In the previous fund there were only 15 proposals that requested funds within this challenge, 11 were approved by the community but only 4 were allocated funds. Here I can identify relevant variables, on the one hand it was one of the challenges with the fewest proposals in fund 7, but on the other hand the percentage of proposals to which it was assigned is below average, and the percentage of proposals approved by the community but the one that was not assigned a budget is one of the highest. The first is an indication of little relative interest in the community for this challenge, but the last two are indicative that it is necessary to increase the budget of the challenge. Taking the above into consideration, and the fact that fund after fund increases the overall budget, it makes sense for me to increase it by 200%, but I have doubts about increasing it by 300% and taking it to $750,000. That's why I give it a rating of 4.", "q1r": 4, "q2": "Having examined the proposed set of success metrics, I must say that the set of questions that the challenge team asks future proponents seem to be very accurate since they consider all aspects of a rapid fund allocation process, such as transparency, scalability, accountability, impact, etc. They have the right approach and are relatively easy to measure and manage. They have the right approach and they are relatively easy to measure and trace. So I strongly agree with the verifiability of this challenge, and the score assigned is 5.", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6808, "q0": "It's important for the proposers, advisors, etc to have a proper and rapid funding mechanism. This is a crucial part of Cardano's mission. It impacts all the mission statements. By providing a faster way of funding for proposals you impact the whole chain of events.", "q0r": 5, "q1": "We have a large community that is creative and active enough to address this challenge. Everyone benefits from a faster funding mechanism. In Fund 7 we already have 4 proposals that are funded for the rapid mechanism but seeing as Catalyst keeps growing we will have a need for better implementation of the funding.", "q1r": 5, "q2": "The key metrics presented in the proposal as suitable for the challenge. Nonetheless, since a few proposals are already funded for this challenge in F7 it might be a better idea to add a few more. It would be helpful to add key metrics about the impact on the ecosystem. Depending on what funding mechanism is proposed this could be completely different. ", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10609, "q0": "Funds disbursed over time based on performance would improve the effectiveness of the Treasury. IF this challenge leads to something that can improve the way Catalyst works, then it would very much improve Catalyst. However, I assume the best project would be picked and integrated into Catalyst workflow, so I question if a whole Challenge is needed. Some clarity on what the Challenge seeks to deliver by the end of it would be helpful. ", "q0r": 3, "q1": "No team is included in the Challenge. I think it would be quite unreasonable to expect results in six months or so of starting this Challenge. If there are administrative decisions that need to take place to change the funding system used, then I would assume it would require even more time before we can expect results. ", "q1r": 2, "q2": "Challenge lacks clarity on what the current average period for payouts is on Catalyst. Without numbers for comparison, potential proposers and current voters for this Challenge wouldn't be able to tell if 1) proposed solutions improve the situation drastically enough to warrant the switch 2) if this Challenge is needed at all. Scalability of solution seems like the wrong metric to measure. It should be able to deliver Catalyst's needs right away. Transparency, and Accountability should be a prerequisite because the treasury is involved.", "q2r": 2, "assessor": "z_assessor_948", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "importance": "Catalyst relies on continuous work by the community to progress and grow, rapid funding can support a wider array of work and personal needs", "success": "Implemented rapid Catalyst funding mechanisms that provide sustainable economic value to proposers within Project Catalyst guidelines."}