{"id": 397002, "author": "dimitri777", "title": "Grow Sri Lanka Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/397002-48088", "category": 26455, "amount": 300000, "description": "How can we provide momentum to the adoption of Cardano and expansion of its community in Sri Lanka", "funded": 0, "upvotes": 24183948, "downvotes": 27952893, "votes_result": 3768945, "votes_cast": 190, "f6_no_assessments": 4, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 1156, "q0": "Like many countries in Africa or Latin America, I agree that the economy and inhabitants of Sri Lanka can be favored by implementing solutions through Cardano. From that side, and considering that Cardano seeks to become the financial operating system worldwide, it would make sense to implement alternatives to traditional financial services. However, as I have described in other challenge proposals. For fund 9 we have approximately 9 similar challenges competing with similar characteristics (specific challenges for development and growth in one area of ​​the world), I believe that the best way we have today to address this type of needs in the community is to have a general challenge where proposals that seek the development and growth of emerging economies compete. Because although each region may have particular needs, personally I think there may be more points in common than not. So with this I can say that I neither agree nor disagree.\n", "q0r": 3, "q1": "Normally the community responds well to this type of challenge, historically we have seen it with a focus on Africa. Also in the past fund we saw a large number of proposals in the challenge focused on LATAM and in this fund we see a considerable number in the challenges focused on India and East Asia. However, contrary to what I have seen in other areas of the world, I have not seen proposals in the background 7 that indicate to me that there is a particular need in Sri Lanka. I want to make it clear that I am not denying that it exists, what I want to say is that from my experience, the first signs we see is that isolated challenges begin to appear in a particular area until a sufficient mass forms to become a challenge. From that point of view I neither agree nor disagree.", "q1r": 3, "q2": "the defined success criterion seems to me simple and appropriate. However, finally, when evaluating the success metrics suggested by the team that prepared this proposal, unfortunately all of them are focused on measuring the performance and impact of the challenge itself, when we should be able to evaluate the metrics that the team suggests to future proponents who want to seek funds.", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 7979, "q0": "The challenge is one of the most important for Cardano how can we drive the adoption of Cardano and expand its community in Sri Lanka this is the problem to be solved in this challenge and it is directly related to the challenge. The author makes an interesting proposal to improve the transparency of the current funding mechanism.", "q0r": 2, "q1": "This proposal has not defined timelines, and the objectives are not clear. The progress of the project is hard to check. The funding applied for is $30,000, but there is no clear detailed list of the amounts to be spent for what purpose. The team is not clear to see the assignment of work to each individual in the group.", "q1r": 1, "q2": "The proponent does not have a specific plan for the difficult audit to take place. The success of the project is also not clearly stated by the author. It would be nice if the project had some clear and specific goals for how to use their material relative to certain timeframes.", "q2r": 1, "assessor": "z_assessor_649", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 10052, "q0": "Within the same frame of mind which has made Africa the main geographical target of Cardano adoption, all geographical Challenges within majority developing-country areas of the world are of the utmost importance for the mass adoption and spread of Cardano. They are the ones that generate the most visible projects for new members, that generate the first approach and most tangible form of onboarding for new emerging-economy members. However, Sri Lanka as a country offers only a potential population of approximately 22 million. Therefore, in terms of impact of geographical Challenge settings, the community should prioritize either regional Challenges (such as Africa or Latin America), or country-based Challenges that offer a significantly larger population base (such as India or China). Lastly, the amount of funds requested do not match the scale of the geographical area, considering they outnumber (in relative and absolute terms) the funds requested and granted for much larger regions and countries.", "q0r": 1, "q1": "The proposer is an active member of Catalyst Community (General ADA holder in Catalyst Circle V3, Community Advisor in Fund 6 and 7, Veteran Community Advisor in Fund 7, Founder of South Asian Town Hall), but with proposals only having been made in this Fund8, although there are multiple proposals already submitted, centered on the South Asian region as a geographic area ripe for Cardano development. However there is no identifiable track record outside of the Catalyst or Cardano ecosystem via  LinkedIn or other platforms. It would be interesting to have said track record for a future iteration, and to know if there are other team members that could make up the Challenge team for this proposed challenge, perhaps with Community members from other neighboring countries (other participants in the South Asian Town Hall?) so as to give a regional setting to the Challenge and a more diverse panel conformation to the Challenge Team, enabling physical meetups and Community development in different hubs within the region. ", "q1r": 3, "q2": "As with other geograpchical challenges, the proposal centers key metrics around how many proposals are presented and how many Dapps/DAOs/services centered on Sri Lanka are brought forth and potentially funded by this mechanism. The KPIs presented are in line with those presented by most similar challenges, though they could use some further refinement. Although in the different Fund iterations, geographical challenges have usually attracted much attention and a large number of proposals, specially in their first iteration, in this case due to the rather small population of the target area we believe this would not be the case, and in fact many proposers from the region already engaged in the Cardano Community may be presenting their proposals within other neighboring geographical Challenges such as Grow India, Grow Cardano. Perhaps a more interesting approach would be to unify forces for future iterations as a Grow South Asia, Grow Cardano challenge setting that can incorporate other countries such as Nepal, Butan, Sri Lanka, Bangladesh and others to the main player in the subcontinent.", "q2r": 3, "assessor": "z_assessor_787", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10702, "q0": "Cardano being  third-generation, decentralized proof-of-stake (PoS) blockchain platform designed to be a more efficient alternative to proof-of-work (PoW) networks. It must be available to all including Sri lanka,\nWe must provide more help to such nations which lack infrastructure, By providing momentum to adapt cardano and community in Sri lanka,\nWith small population and demography and island nation, It needs bigger IT sector and more better solutions form cardano, \nWith lack of infra , Funding, solutions, Current economic crisis This challenge is critical to achieve Cardano's mission.", "q0r": 5, "q1": "Nothing is impossible to achieve for Cardano catalyst community to achieve,\nBut here challenge is very big , Still every big achievement starts with small changes,\nAs proposer mentions\nBy moving real time projects, expanding community , \nFunding and supporting new teams under catalyst , increasing local projects, and making all the projects implemented might address the challenge,\nStill, Lack of History, Experience can't be sure will the projects gets completed,\n\nThe catalyst community has the capacity to address challenge only with taking very significant risk and for sentimental reason.  \n \n ", "q1r": 4, "q2": "Since country is in biggest crisis dollar forex crisis, an exchange rate crisis, and an agricultural crisis etc,\nRecently lanka govt  was unable to conduct exam postponed due lack of funds to import paper,\nInvesting and bring cardano community sounds great idea theoretically, But gaing locals trust and hiring and having great team support only way possible,\nRequested funds of 300k$ is very big amount and  risky,\nthere is not enough data to audit also,\n Success criteria and suggested metrics are neither correct nor wrong to measure progress in addressing the challenge.\nI will Neither Agree nor Disagree as Sri Lanka needs Cradano help.", "q2r": 3, "assessor": "z_assessor_992", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "importance": "Small population, multiple crises happening, young demography, large IT sector. Country needs solutions which can be provided by Cardano.", "success": "Proposers from Sri Lanka in future Catalyst Funds.\nReal world projects with impact.\nExpansion of Cardano Sri Lanka community."}