{"id": 397157, "author": "swhitenstall", "title": "Improve and Grow Auditability", "url": "https://cardano.ideascale.com/a/dtd/397157-48088", "category": 26455, "amount": 350000, "description": "How to make auditability of funded proposals & oversight of governance efficient, distributed and transparent?", "funded": 1, "upvotes": 63746675, "downvotes": 13480602, "votes_result": 50266073, "votes_cast": 196, "f6_no_assessments": 4, "f6_rating": 4.416666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 1158, "q0": "The number of proposals to which budget is allocated grows exponentially, and the current mechanism centralized by IOG will soon reach its limit in terms of scalability, so if we think about the medium and long term, having robust audit processes is totally critical for us to get the Cardano mission. However, traditional auditing methods tend to be very costly due to the level of expertise that is required and that it is generally a fairly manual process, so if we want to build a governance not seen before, we must find innovative methods to ensure accountability on the part of founded proponents but at the same time improving efficiency in the consolidation of results and data available to the community.", "q0r": 5, "q1": "In terms of the technical capacity and intention of the community to address this challenge, I have no doubts, since fund 6 the community has been responding with very interesting proposals to which funds have been allocated. Now when analyzing the requested budget we have that in fund 7 with an amount of US$100,000 there were 16 competing proposals, of which 11 were approved by the voting community and finally 8 received funds. For fund 8 with a budget of US$200,000, we have 22 proposals competing, which represents an increase of 45% vs. the previous fund. The challenge team is requesting a 150% increase vs. the current fund, which makes me a little doubtful about the demand. That's why I decided to give it a score of 4.", "q1r": 4, "q2": "The success criteria and suggested metrics are defined correctly, however, I believe that the focus should be on the metric provider that future proponents use instead of focusing on metrics to measure the performance of the project. Additionally, and considering that 1) we are talking about the challenge that seeks to improve auditability of Catalyts as a whole and 2) at the time of preparing the configuration of this challenge for fund 8, there was already accumulated experience of fund 6 and 7. It would have been interesting that the challenge team present the current status of the metrics aimed at evaluating the performance of the challenge. It would be a model for the rest of the challenges and we would begin to have visibility of the real impact of the proposals that have been allocated funds in the past.", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6499, "q0": "The \"Improve and Grow Auditability\" challenge aims to promote proposals that seek to audit the development of proposals funded through the Catalyst project. It is an essential challenge for Cardano's mission, because only with auditing, data collection, information and performance sharing will it be possible to know if the proposals funded by the treasury are fulfilling what they have not committed to deliver.\n\nThis challenge is also aligned with the Catalyst Fund9 Challenge Setting Strategic Goals established in the Community Advisor Assessment Guide, with this challenge addressing all 3 items of these goals( 1 Prepare a group of people willing and able to make contributions to the ecosystem, 2 Turn Cardano into an open source project 3 Accelerate the growth and evolution of developer & app ecosystem) Acting directly on items 1 and 2 and indirectly on item 3, because despite not having a direct/focused participation in the development of dapps and dev ecosystem, proposals dedicated to audits end up auditing proposals that involve dapps and the developer ecosystem.", "q0r": 5, "q1": "This challenge entered Catalyst in Fund 6 and has remained in all Funds since then, demonstrating that the Cardano community has been voting in favor of this theme on a recurring basis. There are already several different teams working on different auditability proposals.\n\nThere is a growing demand for proposals included in the challenge from Fund6, and in Fund 6 there were 11 proposals (6 funded, 1 approved and 4 not approved) for a total budget of $100,000USD, in Fund 7 there were 16 proposals(8 funded, 3 approved and 5 not approved) with a budget of $100,000 USD and in Fund 8 there are 22 proposals. In Fund 7, if all approved proposals were funded, the required budget would be $170,000 USD. If we consider the average growth of around 40% in the number of proposals and the increase in the total budget requested in the last 3 Funds, I believe that the requested budget is appropriate.\n\nThe proposer is already part of the challenge team for this challenge, I would recommend just mentioning in the challenge setting if the challenge team would remain in Fund9.", "q1r": 5, "q2": "This challenge setting established several relevant metrics (quantitative and qualitative) to verify the performance of the proposals. The definition of success is reasonable.", "q2r": 5, "assessor": "z_assessor_43", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7482, "q0": "This challenge is set for proposals that seek to improve the tracking, transparency, accountability and progress of projects that are funded by Catalyst. Alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\nIn terms of strategic goals it does not directly make Cardano open sourced even though it is indirectly doing so through improvement of transparency. Open-sourcing is about transparency and sharing what you have learned and done after all. The third strategic goal is to accelerate the growth of the dapp and developer ecosystem. This challenge does not achieve that to any great extent. \nIn terms of guiding questions, this challenge is unlikely to create great voter enthusiasm. It is also not directly a crucial component that could propel Cardano adoption. With this said, auditability is a necessary component of creating a thriving ecosystem. \nOverall, the alignment with the stated strategic goals and guiding question is relatively low and the benefits are not clearly outweighing this drawback. \n", "q0r": 3, "q1": "This is a challenge that has been funded in the past and a quick check on the current funding round reveals that a budget of $200k has received 21 project proposals. Amongst them are several projects in the range of $20k-$30k. The challenge proposer is himself involved in some of the proposals in some of the current fund8 auditing proposals and so I would expect some justification or results presented in terms of the KPIs of previous iterations of this challenge. This was not presented even though it seems to me that an auditability challenge proposal would excel in such reporting. \nAs it is a repeated challenge, I believe the standard can be set slightly higher, especially considering that the funding request has been increased from $200k to $350k. To put this in context, this is as much as the challenge “Grow Cardano Grow East Asia” is requesting. Hence, this challenge were to be approved then that would mean that Catalyst is spending around $500k (seen across these 6 months) on auditing 400-500 proposals, meaning an average of $1000 per proposal. This is very expensive and warrants further justification. \nHowever, this dimension is rated purely on whether the community has the skills to meet the challenge and thus far, there is not much data to work on given that the oversight and reporting of funded proposal is still managed fully by IOHK. To some extent Challenge Teams are also designed to fill the roll that auditability would fill, and they are incentivised with $4000 or more per team to do so. \nHence, as a CA from the past 2 rounds, I am reluctant to give full score on this dimension for the reasons stated. \n", "q1r": 4, "q2": "The challenge lists a large number of metrics that are well defined and allow tracking of progress. For example number of funded proposals audited in each challenge using methods funded in this challenge, training/education sessions produced by proposals funded in this challenge and levels of engagement/satisfaction of these. Moreover they also point out some metrics for oversight of governance such as “degrees of variety and innovation demonstrated in the oversight of governance changes” and “appropriateness, scalability and sustainability of governance oversight approaches funded in this Challenge”. \n\nThese are clearly very well thought-through and cover most if not all possible venues for auditing. However, they are not all operationalised. For example, it is not clear how “appropriateness” is measured in practice. Moreover, the overwhelming amount of suggested metrics involving for example both “quality and quantity of reports, articles, media, workshops and tools for both qualitative and quantitative measures …” could be abridged. For example the proposers could have written “Quality of educational content and tools for quantitative measures. This includes…”, “Quantity of educational content for qualitative measures. This includes …” and so on. One bullet point per metric instead of 4 bullet points per metric along with explainers in parenthesis. \n\n", "q2r": 5, "assessor": "z_assessor_582", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 7655, "q0": "Fund 8 has even further cemented the need of proposals that addresses this Challenge. Fund 8 was bombarded by copy paste proposals spanning various Challenges. This I believe was a result of our auditing process being to relaxed. We are not instilling \"fear\" (although that is too extreme of a word) to the community that the appropriate use of funds is paramount. What logics permits one to submit numerous proposals without considering the viability of materializing them? Why is this even an issue? What are we missing from our auditing process that brings life to these kind of attempts? And how can certain individuals access core functions of the community with nefarious intent? Again, something is too relaxed. We need more creative and strict solutions on how to tackle our auditing system. Or how to create an alternative system that caters to those seeking to be anonymous (with all it's risk) and full fledge transparency without hindering Project Catalyst growth. Yes, this Challenge is 100% critical. Anything related with funds use must always be accompanied by equal auditing process effort.", "q0r": 5, "q1": "Stephen himself, and the system he has developed in QA-DAO is essential. The issue is, we need more Stephen's. And I see no one stepping up other than Stephen to address this issue. Kinda feels everyone is soo laid back on the use of their budget. And probably that is the case. I am predicting the average effectivity of all proposals in Project Catalyst is around 65%-70%. Effectivity here meaning, meeting their KPI's. Decentralization does not mean undisciplined, decentralization does not mean missed targets, decentralization does not mean relaxed environment. Something that I feel, people tend to equate decentralization with. And for me the smoking gun, is there is only Stephen and his partner that are champions in this regards. We are slowly creating a culture of being mediocre if not accompanied by strong auditing processes. This type of culture only pushes away individuals who want to produce and produce and produce.", "q1r": 3, "q2": "Stephen has it spot on. Though how it is displayed in the proposal format is surprisingly short and more towards being descriptive and not definitive. One would expect from Stephen that this proposal would be beautifully structured with rows of bullet points, bold texts, detailed descriptions and so forth.\n\nPersonally would like to express my gratitude to Stephen's closing remarks as following : \"...and of the theoretical background to them, so that the community is able to assess them.\"\n\nWhich correlates to what I previously mentioned we need to educate the community the importance of auditing, the negative effects of not meeting their auditing parameters, what is actually auditing and then convey effectively and continuously to the community. Most specifically CA's and vCA's.", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "importance": "So funded proposals are evaluated & governance oversight is resourced to ensure accountability & legitimacy through community participation.", "success": "Several projects providing audit, assessment & evaluation tools for funded proposals & oversight of governance changes"}