{"id": 399965, "author": "emeliasarfo2", "title": "NGO Outreach & Integration", "url": "https://cardano.ideascale.com/a/dtd/399965-48088", "category": 26455, "amount": 350000, "description": "How can NGOs in developing countries receive funding from Cardano for income generating development projects to transform more lives?", "funded": 1, "upvotes": 47141220, "downvotes": 17849211, "votes_result": 29292009, "votes_cast": 188, "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"id": 4934, "q0": "When it comes to organization, and imparting or educating people out side classroom, NGO plays a key a roll in most countries especially Africa \nGiven NGO the opportunity or funding NGO to partake in the cardano blockchain will add a huge value to cardano ecosystem. ", "q0r": 5, "q1": "The proposal has clearly indicate that they are going to educate the youths or the community how to use ADA wallet \nWhich I think will be a good initiative and expansion to the cardano ecosystem. \nAn experienced personal with 20 good years experience is quite enough to handle any NGO work. ", "q1r": 5, "q2": "The issue has been addressed how they are going to tackle every issue \nAnd how they are going add more people to the cardano ecosystem by engaging them in trainings. ", "q2r": 5, "assessor": "z_assessor_1805", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 5895, "q0": "It is really nice to have projects that integrate Cardano with NGO. Cardano wants to expand to many places in the world (Africa, Asia, Latam) and, in order to effiently act , it needs to work with people or organizations that know local realities and struggles (sometimes much more than the proposals). Local NGOs know a lot about the challenges in these places and have experience in developing projects in each place. Thererefore, I think the challenge can contribuite a lot with Cardano expansion and help local communities to grow. It is aligned with all F9 strategic goals (\"Prepare a group of people willing and able to make contributions to the ecosystem.\", Turn Cardano into an open source project\", ccelerate the growth and evolution of developer & app ecosystem) and with Cardano purpose (a global society that is secure, transparent, and fair, and which serves the many as well as the few.).\n", "q0r": 5, "q1": "Cardano community can run this challenge as many proposers have already worked in NGO or at least have been in contact with one in their places. It would also help those to want to develop projects in places where they dont know well, as it will have an intermediate who would help to mitigate risks. \nThe proposer provides her credential but its not clear if she would be part of challenge team (and there's only one person mentionted). So, the only reason its not scoring 5 is due to the lack of a challenge team.", "q1r": 4, "q2": "The definition of success here is quite subjective, the kpis listed are SMART, easy to measure and make sense in the challenge proposed I'd also include as kpi the number of different regions or countries that the projects will act on. Acting global is essential to reach Cardano objeticves and having projects with NGO all around the globe would generate a lot of knowledge and growth for the community (and for the world).", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6162, "q0": "The challenge proposes to bring people together to contribute to the ecosystem through NGOs and touches upon all three Fund 9 strategic goals. This challenge competes with several other challenges that help achieve Cardano's mission in the broad category of outreach. The necessity for a specific NGO outreach instead of simply having NGOs propose under one of the broader challenges could be better explained.", "q0r": 4, "q1": "The budget request is slightly on the high side for a new challenge with such a specific target audience (NGOs) but arguably NGOs might need to submit larger proposals than individual proposers to make the process worth their effort. The proposal could be improved by providing some background info on the current number of NGOs applying for funding in Cardano, their success rate and in which challenges to demonstrate that the broader challenges are not sufficiently meeting demand.", "q1r": 4, "q2": "Given the challenge question, the metrics should include the amount of income generated through projects and possibly the resulting number or amount of ADA transactions. Progress can be measured though to a reasonable degree using the metrics provided.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "importance": "NGOs in developing countries and other parts of the world can promote Cardano to be adopted by many. More will be engaged in Cardano.", "success": "More people engaged in Cardano\n\nCardano becomes the best crypto\n\nMore projects physically changing lives\n\nMore communities"}