{"id": 400929, "author": "mmahut", "title": "Building (on) Blockfrost", "url": "https://cardano.ideascale.com/a/dtd/400929-48088", "category": 26455, "amount": 50000, "description": "How can we expand the Blockfrost ecosystem to drive the developer adoption on Cardano?", "funded": 2, "upvotes": 58063439, "downvotes": 28114760, "votes_result": 29948679, "votes_cast": 250, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 7246, "q0": "The challenge question is clearly formulated and easy to understand, in my opinion. This challenge is about developing the open-source tools for building on Cardano, specifically those from Blockfrost.io. \nWhy it’s important is easy to understand as well: any blockchain needs solid infrastructure that makes it attractive to developers who want to build something. Blockfrost.io at the moment is one of the most important pieces of infrastructure on Cardano and I agree that we need to keep building tools on it as it’s critical to achieving Cardano’s mission. Score: 5.", "q0r": 5, "q1": "I think the objectives of this challenge are very feasible. We want to see proposals for new SDK’s, frameworks, interoperability, educational materials etc and the people of Cardano have been delivering these since the earliest Catalyst funds.\nThe fact that the preference is for these solutions to be open-source is a bonus in my opinion, as they can easily outgrow their initial proposers and new developers can easily join in to help with development or suggest completely new ideas altogether.\nMy only issue here is that the requested funds seem to be very low (50000 USD). As a person who's worked in IT for over 7 years, I know for certain that with that low an amount, you can only build a few very simple tools at most. However, with it being the first iteration of this challenge, it makes sense to start slow to see how successful it is, then scale it in future challenges. Score: 5.\n", "q1r": 5, "q2": "I think the success of this challenge will be very easy to verify, as the proposals for it will all have to be simple and practical (the tools mentioned before). Adoption of these tools by developers, users, new projects built using tools from these proposals are all simple KPI’s that can be tracked by the community, along with the number of contributors and many more. Score: 5.", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7495, "q0": "This challenge is for projects that in various ways create a thriving ecosystem of tools around the Blockfrost API – a service that lets dApps talk to the Cardano blockchain without needing a full node themselves. The alignment score is set based on two sets of metrics that define whether a given challenge is critical to achieving Cardano’s mission: the fund9 strategic goals and the guiding questions for challenge setting.\n\nFirst, strategic goals. This challenge effectively addresses brings groups of people together as the challenge explicitly seeks to create and make such collaboration easier by creating content and supporting infrastructure that would improve on the Blockfrost API services. Blockfrost state that they will be open-sourcing their backend and so this is very much aligned with the open-sourcing strategic goal. Lastly, it naturally accelerates the developer ecosystem and dapp.\n\nWhen it comes to challenge setting alignment, this proposal is not as likely to rally voters’ enthusiasm. However, it does provide critical infrastructure which in turn leads to a better developer and user experience. This is of course critical for mass-adoption. \n", "q0r": 5, "q1": "The possible projects that are welcomed in this challenge is quite broad. Everything from hackathon, code auditing and educational material is welcomed. Hence, there is ample of room for proposers with different backgrounds to apply for funding. The request is only for $50k which is modest but within a reasonable range. ", "q1r": 5, "q2": "They list four KPIs. All of which are clearly measurable but not as well-tied to the challenge. The key metric of interest is really the added-value of this challenge. Given that many of the suggested directions involve improving the user experience and quality of already existing infrastructure, something like a user-survey documenting the improvements would be a decent proxy for this value-added aspect other than the raw number of new users/developers that do use Blockfrost API. The problem with just measuring numbers and trends is that it won’t tell us much about the added-value of this challenge (through the funded proposals) – one can argue that the number of users would’ve gone up anyways.", "q2r": 4, "assessor": "z_assessor_582", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10243, "q0": "Blockfrost has been continuesly growing larger and larger as a project and has been voted, with some changes on the whole idea each time, through the Project Catalyst's Funds, so we know for sure that it has the community's support and is not something that will have to earn their trust from the start. Building a whole space around Blockfrost, with hackathons, learning material, events and a wide variety od SDKs seems like an idea that would have great impact, not only for the community of the developers but also societal, on Cardano's ecosystem. ", "q0r": 5, "q1": "I really like all the possible directions/solutions for this proposal. Some additions i would like to make in order for the description of them to be more specific would be, for example, to consider getting in touch with other projects like yours that coming to the forefront at these days of development, in order to bring more users together and grow the adoption of Cardano's technology itself. I think the results of this proposal are going to be obvious very early and i consider this positive in order to continue investing time and money in this project or either decide to make some critical changes on it. There is no challange team (which is not somethibg bad at this phase) but there is no plan to create one and I think users should be aware of that. ", "q1r": 4, "q2": "It is my humble opinion that the success criteria and suggested metrics are set to measure in addressing the challenge. I feel the Proposal Success Metrics are, although a bit broad, sufficient in setting a frame or set of expectations for measurable KPIs. I might like to see, however, some hints or suggestions to quantify things like 'How many developers, contributors, users will be needed to consider this a success?'. However, i hypothesize that the proposer will be able to fix this on the next Fund should this challenge setting gets voted on to be on the next round.", "q2r": 4, "assessor": "z_assessor_861", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10591, "q0": "Blockfrost is a highly valuable API infrastructure we have in Cardano. I also think Blockfrost can be the incubator of aspiring developers looking to deploy their dApps in Cardano with barriers as low as possible, leveraging their API-as-a-service and advance integration with IPFS. Five Binaries have built SDKs for around 14 different programming languages to onboard the maximum number of developers possible so far. This shows their commitment to Cardano spirits of decentralization, public, and security without sacrificing performance. I believe solving this this challenge can enable much more novel and impactful things growing in Cardano and helping all of us in the community to achieve our aspirations and mission.", "q0r": 5, "q1": "Proposals submitted to these challenges can help answering some persistent hurdles in Cardano community such as driving new developers to Cardano, including existing ones from other blockchains, making Blockfrost as critical infrastructure to be more decentralized and robust, and educating developers the importance and know-how to build more secure product in Cardano. The Blockfrost team is willing to provide assistance in technical sides and free subscriptions to their service to boost and propagate chance of success in implementing the upcoming proposals. The challenge team might not be mentioned in proposal yet but since Five Binaries and Mareks have been with us since testnet time and their steady development toward open-source, assembling the team will be done in no time. Catalyst community as a grass-root governance has majorly contributed to the growth of Blockfrost since Fund 3 so I strongly believe we have everything in our community to address this challenge.", "q1r": 4, "q2": "The metrics mentioned in this proposal are aligning well to measure the progress in addressing these challenges. Everything is relevantly quantifiable such as number of developer/users, number of new additions to the ecosystem, activites like forks, downloads, and starts on GitHub along with more contributors. The outcomes we can expect are also suitable includinga number of desired results in the expected proposals such as new frameworks & concepts, educational materials, SDK for NFT minting and management, hackathons, etc. with strong preference for open-source solutions.", "q2r": 5, "assessor": "z_assessor_943", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "importance": "It is important to create a thriving developer ecosystem around critical infrastructure components such as Blockfrost.", "success": "Different open-source initiatives building an active ecosystem around Blockfrost, from tooling to frameworks."}