{"id": 405419, "author": "dcspark", "title": "The Great Migration (from Ethereum)", "url": "https://cardano.ideascale.com/a/dtd/405419-48088", "category": 26455, "amount": 500000, "description": "How might we make it easy and fast for dApps and other projects to expand or completely move from Ethereum to Cardano?", "funded": 2, "upvotes": 179238979, "downvotes": 3252552, "votes_result": 175986427, "votes_cast": 398, "f6_no_assessments": 5, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1199, "q0": "The success of Ethereum cannot be denied by anyone with even the slightest understanding of the ecosystem and the various blockchain platforms. Ethereum dominates the market in rough numbers, with many successful use cases that would be extremely valuable if they were ported to Cardado. Although, you must also consider the shortcomings and problems that Ethereum is experiencing today as it strives to move from Proof-of-Work to Proof-of-Stake. Thus, my question to the challenge team is, why only focus on Ethereum? There are a lot of teams in many other ecosystems with brilliant innovations that also deserve Catalyst's attention, from this point of view it seems to me that perhaps the challenge fell short in scope. In terms of the challenge and its alignment with Cardano's mission, there is a clear relationship, and in terms of strategic goals, bringing EVM based projects to Cardano would contribute to the growth of the ecosystem. The assigned score is 4. ", "q0r": 4, "q1": "This is the first time we have undertaken this challenge, and for now we can only analyze the number of proposals submitted by the community. The challenge has a budget of $500,000. We only have 22 proposals competing for the allocation of funds, which, compared to other challenges of this fund, position us as one of the challenges with less proposals. This is a fact that should be analyzed by the challenge team, who decided to maintain the budget for the next fund. With the current number of proposals, this seems to be a very good decision. On the positive side, I believe that all the improvements in throughput that IOG is implementing with those planned for Q2 will improve the conditions of the chain considerably and as a consequence will be a much more attractive proposal for these EVM based projects. The assigned score is 4. ", "q1r": 4, "q2": "Regarding the success criteria defined I think it seems appropriate, now regarding the suggested success metrics I think there could be an improvement versus the current challenge setting, I say this because of the two presented one of them (Number of projects that migrate) focuses on measuring the performance of the challenge itself, instead of focusing on being a suggestion for potential proposers. I think that challenge metrics are also necessary, but to avoid possible confusion with proposers a better wording of the setting could have occurred. The other metric seems to me correct and relatively easy to measure. The score assigned is 4. ", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5789, "q0": "This challenge advocates for interoperability between Ethereum and Cardano ecosystems, as well as to support migration from Etherium to Cardano. Creating easy onboarding for projects to move from EVM-based blockchains, like Ethereum, to Cardano's eUTXO models, is one of the most important goals for Cardano ecosystem.\nI can strongly agree that this challenge delivers on all Fund9 strategic goals.", "q0r": 5, "q1": "Challenge brief states that many efforts are currently underway, like ERC20 Converter, the Milkomeda, these projects are reaching point of maturity. There is big demand for new tools needed for successful migration, and this challenge proves to be successful in creating necessary support for this endeavor, as it counts to 33 active projects in the current Fund 8 round.\nI strongly agree that Catalyst community has the capacity to address this challenge.", "q1r": 5, "q2": "As a key metric I suggest to take the wording from \"What does success look like?\", and make it the primary key metric. The final stage, to identify the success as complete, the integration of an EVM project to the Cardano blockchain.\nThe first key metric in the challenge is a metric of the challenge itself. As to not create any confusion, there should be some editing done. Other metrics mentioned are acceptable.\n", "q2r": 4, "assessor": "z_assessor_276", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7707, "q0": "This Challenge is mission critical. No doubt about it. This race we are having with Ethereum, for them to deploy 2.0 for us to deploy Hydra (and deploy it soundly without major hiccups) is what will make Cardano the leading blockchain. Will Cardano become or even need to become the labelled Ethereum killer? Not at all, for eventually when the technology is similar, that is when branding has a play. And Cardano must strive to become \"The Blockchain For Good.\" Until that day comes, we must strive to onboard as many as possible Ethereum dApps. I believe that is the lowest hanging fruit in terms of massive adoption. We can try to create legions of Cardano specific developers, but that will take time. Rater than focusing only on grooming developers, we should put emphasis on accelerating the creation of bridges and etc. I would even suggest the budget to be bumped up to $1 million in ADA, in fact anything that deals with the acceleration of the number of developers that master or have deep understanding of Plutus and Haskell should have the minimum budget of $1 million in ADA.", "q0r": 5, "q1": "Speak no further we have dcSpark and MLabs. Unfortunately that is all we have right now. We do have the future currently brewing, in the form of EBU's Hackathon, but that is a \"production line\" that still needs funding to be constantly producing developers. Other than that, I see no credible or sustainable source of Cardano developers. Viet Nam has the potential to become a power house of Cardano based developers, but again that all takes time. If the majority of the dream budget, where to go to dcSpark and MLabs themselves (due to lack of equally capable entities), to be honest I would have no issue. My emphasis is clear and repetitive, we need more developers. We need more dcSparks, we need more MLabs.", "q1r": 4, "q2": "Although I am not tech savvy, the success criteria is concise and simple. The potential proposer instantly understands what needs to be done. Regarding the metrics, even though there are only 2 (two), it does cover what we need the most to be achieved; Ethereum projects that migrate and the number of smart contract users. That is and should be the general goals of the overall general community. Though perhaps it could've used a bit more of fleshing out. Recommend the proposer to have a look at other Challenge settings formats, including key metrics. Perhaps the proposer could expand the key metrics to \"Educating the Ethereum community on Cardano's readiness\", or \"Workshops on how to integrate the bridges\" and etc.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9652, "q0": "This Challenge invites the Cardano community to capture the huge opportunity that is currently present of bringing onboard a huge number of developers and projects that are currently suffering from high costs on the largest smart contract blockchain in the world: Ethereum. The opportunity will not last forever as other blockchain projects are already making this very same effort and even Ethereum itself will close the current gap with its ETH 2.0 solution in the not very distant future. \n\n", "q0r": 5, "q1": "Harnessing the huge potential of that community is fully aligned with Cardano's interests not only by bringing scale and cross-chain capabilities, but also talent, innovation and capital to further support growth.\n\n", "q1r": 5, "q2": "The key metrics proposed by this challenge are exactly the outcome Cardano would benefit from in the way described before. \nIf future versions of this challenge are proposed it would be a healthy exercise to include metrics relevant for current Ethereum users since measuring Cardano's attractiveness would naturally and sustainably bring people and projects over.\n", "q2r": 5, "assessor": "z_assessor_740", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9930, "q0": "Facilitating migration of dApps from Ethereum to Cardano is important for Cardano’s mission, and it meet Fund9 strategic goals. I would not consider that it is completely critical though. \nThe whole eutxo vs account model debate at the launch of the main dexes has also shown that it brings value to a project to be designed for Cardano’s blockchain from the beginning. Therefore I’m not convinced that Cardano really needs Eth dApps for its development.\n", "q0r": 3, "q1": "As recalled by the challenge brief, many projects are underway to convert dapps and projects from Ethereum to Cardano. Based on theses examples I think that it is likely that the community will be able to make good quality proposals in the frame of this challenge.", "q1r": 4, "q2": "Success is defined by the challenge team by reaching a large number of projects and smartcontracts migrated from Ethereum to Cardano. This is a good metric for the challenge progress, but proposers may need further guidance on how enable a good tracking by the community of their “migration proposal” in itself.", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "importance": "Many projects are stuck on EVM-based blockchains like Ethereum and are looking for an escape. Cardano can be faster and cheaper to use.", "success": "Projects who were either planning to or did launch on an EVM-based blockchain deploy in the Cardano ecosystem and can do so easily."}