{"id": 414389, "author": "uptodatedevelopers", "title": "CARDANO FRENCH COMMUNITY IN DRC", "url": "https://cardano.ideascale.com/a/dtd/414389-48088", "category": 26600, "amount": 9000, "description": "Projects developed in French-speaking African countries lack information on blockchain technology in general.", "f6_no_assessments": 24, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 1607, "q0": "The idea is very good, and from what I understand, it is a continuation of a project that has already been financed. In fact, Africa is a very promising continent for us to have massive investment in, as it is a place where blockchain technology develops solidly. However, some obstacles still need to be overcome, and one of the main ones is the language barrier. The proposal launches the idea of ​​promoting weekly workshops that will be recorded and made available on youtube (for those who are unable to attend in person, or even have internet connection problems, which do not allow them to follow the event online). I think each encounter could be better explained. We know that experienced developers will be invited, who will share their knowledge of blockchain and how to create applications that involve smart contracts. We also know that some professionals are bilingual, so they can study courses in English and bring this knowledge to the target audience in the Democratic Republic of Congo, who speak French. But what course would those be, and where would they be available? I believe that it would be enriching for the impact of the proposal if each workshop were better detailed, if we had a kind of pre-defined schedule. We know which topics will be covered per month, but not the specific topics of each meeting. It would also be important for us to know exactly where these face-to-face meetings would take place, in the chosen country, and what the logistics behind them would be like, that is, more pragmatic details of the production, which involve renting space, drinks, perhaps food, transport, etc. It would also be very important that the dissemination mode - which is said to be through social networks - was a little better detailed. For example, will posters, videos, informational texts about the workshops be posted? How to effectively attract the attention of the target audience? In general, the idea is excellent and it certainly achieves the objectives of the challenge well, because once these workshops are done, new students in the areas of technology, design, law, etc. who can join Cardano will be well educated. But I believe that a little more detail regarding the meetings themselves, the pragmatic part of the production and the publicity of the events would add even more confidence in the impact of the project. However, the proposal continues to be well aligned with the objectives of the challenge to benefit both Africa and Cardano, favoring the expansion of our blockchain technologies there.", "q0r": 4, "q1": "The proposal's script is a little confusing because it says more about the contents covered in the meetings than necessarily what activities would be necessary for them to become possible. I missed a temporal organization, indicating what would need to be done by whom, how and when, so that 1) the meetings are held 2) the physical space becomes adequate 3) the online content is recorded and made available 4) the dissemination be done properly. Therefore, I think it would be important to establish a more direct temporality associated with the actions that would result in the progress of the project phases, even if its complexity is not so high, the project involves several aspects so that the final product (the workshops) can happen . That said, I consider that the script part leaves a little to be desired, unfortunately. The ideal would be that the activities were really detailed and well related to each other, as well as better situated in relation to the total timeline. When it comes to the budget, in turn, the information is given in a more concrete way, but still without the degree of detail that I would like. For example, $3,000 is requested for the creation of content in French (in this case, the contents taught, I believe, the teachings themselves) and also for the creation of a promotional video for publicity. How much would go to content and how much would go to video, and why? Who would be working here and in what way, for how many hours per month, what would be the hourly price of the professionals involved? In the second part, $6,000 is requested for various things, such as training Saturdays, video editor and trainers. It would also be important to know how much would go for each. However, the asking value is quite reasonable compared to most proposals, I found the funding to be quite fair, I'm just suggesting a few more explanations so that our understanding of it is even more solid. Finally, when it comes to the team, I think that trust is passed on to those involved, as we are told a lot of details about each one of them. We know their names, professional roles and linkedin profiles, their resumes are also included, containing some previous work and also a greater clarification on how these professionals are involved with the Cardano ecosystem. As we know that the proposal is a continuation of an already funded project, trust is automatically passed on to the team, in addition to having a lot of detail about each one of them; with that I consider that this, without a doubt, the best part of the viability. In general, the proposal is feasible, but as I suggested, a greater depth of detail could be done in the script - so that we could understand more precisely what would be done, how, when by whom, etc.; and we could also have a better detail about the financing, as I mentioned the value is very fair, but it does not exempt it from being carefully argued and justified.", "q1r": 4, "q2": "Monitoring progress is suggested through the content available online, both recorded videos of the meetings and files corresponding to past teachings. However, in my view, these ways focus on realizing the partial results achieved in a progressive way in the project, but not the production that would be behind it. In my view, it is necessary that the proponents, in some way, keep the Cardano community up to date with updates regarding the preparation of the workshops, how the professionals behind it would be working, how the translated content would be selected, for example, how would be the professionals' work routine, what challenges did they face while carrying out the project... A crucial point for the success of this idea is certainly publicity, so one way to follow this issue would be sharing the reach of the ads and also the process of creation of the material disclosed, for example. In other words, I don't think the proposal is so simple to audit when it comes to its development process, because we don't have such a detailed roadmap for that either. Therefore, I suggest that some improvements and deepenings be made in this part of the proposal. Talking about the success scenario, the final results, we know that the main objective of all this would be that developers from the Democratic Republic of Congo participate in these meetings, integrate the technologies of our blockchain in their projects, that more and more developers are reached and that the community who speak African French will benefit greatly from the project. One way that I thought would be very interesting for us to follow this would be if the developers who participated in the weekly meetings give us some feedback, after a certain time, informing if they are actually using the technologies learned and how, in what way they are applying the Blockchain tools in their applications, such knowledge was passed on to their colleagues as well… Anyway, how did this influence their daily work. In this way, we could have a very good idea of ​​whether the initial objectives and goals of the challenge were truly contemplated. So this topic, like the previous one on feasibility, is not bad, but it gives us a more basic understanding of how monitoring could be done - further information on both progress and perception of the success scenario would be welcome . In summary, I think that the proposal is indeed possible to audit, but the proponents do not explore this point so well, giving us adequate materials to be monitored periodically.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "- AUDIDABILITY\n\nThe professionals in charge of producing these videos are selected according to the content to be produced. After the production of the first content by our team, the participants leave us comments on our Telegram channel; and it is on the basis of these comments (containing requests) that we choose the content of the next videos. The professionals in charge of producing the videos are our in-house developers, independent developers or members of Cardano. We choose them based on the content to be produced and their availability. And it is on the basis of these elements that we establish a work schedule, the number of videos to be produced per week, the different dates of the Q&A meetups on the content produced.\nThe production professionals therefore start by working on the content in English, then they translate it. After translation, the content is sent to the designers to add the branding and reassure themselves that the sessions are not very long. The same content is then sent back to the production professionals for approval, and the production is complete.\nRegarding how Cardano tracks participant feedback on how they are using Blockchain during these sessions, in addition to our Telegram chat channel, we are also improving our knowledge sharing platform for web visibility, https://updevcommunity.com/."}, {"id": 437, "q0": "A great initiative in yet a different region of Africa. Though for future references, would be wise if countries were not made an abbreviation for it can be confusing for some. In order for Cardano to gain traction or adoption in Africa, local developers should be educated on Cardano. Cardano is at a point where there is a strong need or emphasis to scale through community. As per the Cardano way, which is decentralization.\n\nThis proposal seeks to do just that, by educating Congolese and African developers on Cardano. The proposers intent is for these developers to then create dApps or to integrate blockchain into their existing IT projects.", "q0r": 5, "q1": "Reading the scope of this proposal which is quite limited to education of developers, the experience provided by the proposers are plentiful. Of all their team members 5 of them are either blockchain developers or Haskell/Plutus trainers. Each of their member has also provided in correlating LinkedIn link for those who needs further verification.\n\nIn terms of their reputation in the Cardano/Catalyst community, one of the team members are active in WADA. WADA with all their initiatives has build a strong network of enablers. By being part of this, any shortcomings of their proposal or when the potentially get funded, are negated for they have a pool of consultants to draw. Ensuring everyone would most likely be happy to see this proposal a success story.\n\nThe plan itself is as is. There are no surprises or hidden processes. It is purely attempting to educate developers and  to enhance their understanding of blockchain and Cardano through French.", "q1r": 5, "q2": "Since it is a very simple proposal, the effort to audit is categorically easy. The usual metrics are all there and can be accounted for. An interesting note, since they are developers besides their own YouTube and Telegram channel, a website they also are using GitHub. A stable trademark of project initiated by developers.\n\nThough there is a footnote here, they indeed have identified a very important risk/challenge, which is the possibility of having low tractions. To mitigate this, steps taken are not comprehensive enough or forward thinking enough. One can perhaps utilize an onboarding campaign. Their only method to mitigate this is by promoting in all their social media channel. Since this is already a funded proposal, that would potentially incline they will be saturating their existing proposal target which perhaps resulting in future traction will be limited. It would have been great if the proposers notice this and actually devised a marketing effort to expand pool of developers to educate on.", "q2r": 5, "assessor": "z_assessor_2088", "no_vca": 15, "ne": 1, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 13357, "q0": "Your proposal aims to provide information on blockchain technology and the Cardano network in French to African countries, which will help to spread this new technology to the wider African community, thus suggesting Your proposal matches the challenge of the Catalyst program.\nYour goal is to reach over 300 French-speaking developers across Africa by December 2022, which will create a networking opportunity for developers to work together on Blockchain projects. help the community of dapps developers here grow stronger, and incubate Africa-focused projects, a strategy often promoted and pursued by IOG and Charles Hoskinson.\nAnd translating the Cardano ecosystem documents from English to French is absolutely necessary for the developers here to expand their knowledge and experience in their field.", "q0r": 5, "q1": "If the experience of the groups you have presented is true, then I believe there is a high probability that the proposal will work out well. Because the time for the plan you have arranged is very long with 4 months for French documents in PDF and PowerPoint format.\nSo how about the Video course, how will you do it, the video learning form will be more intuitive and interesting when reading pdf and powerpoint pages.\nNext is the detailed budget for the project, I see there are two phases with phase 1 needing $3000 and phase 2 requiring $6000 but I have not seen detailed details for each item here, you can tell For example, how much is the bid for 16 training courses?, how much is the fee for the video editor after the lesson, how much is the payment for the trainer? This will be more detailed and feasible for the project.", "q1r": 4, "q2": "Your youtube channel is pretty clear to gauge the number of videos, progress and success in 4 months of the proposal.\nAnd I recommend that for each topic, you save it to a playlist for the community to follow more easily.\nAs for the website, I have not seen any website in the information you provided, so I cannot verify this on the website.\nRegarding the success of the project, I would advise to have a specific number such as the number of new African projects developed after the course or by the end of 2022, the number of developers French-speaking Africa joins the end of 2022 and other factors.", "q2r": 3, "assessor": "z_assessor_3616", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11758, "q0": "The idea of “Cardano French Community in DRC” fits perfectly with the requirements of the challenge “Grow Africa, Grow Cardano”. This is an unfunded proposal at Fund 8. I find that the content and impact of the solution in the proposal submitted at Fund 9 have not been changed or updated. The solution content is to establish a Cardano community in DRC to share knowledge and resources about blockchain in French for developers in the region. The aim is to create an environment that encourages African developers to mass adopt blockchain technology and gain more exposure to the Cardano programming language. The team plans to reach more than 300 French-speaking developers across Africa by December 2022. The form of implementation is a combination of meeting online and posting and sharing resources on channels: Youtube , web, group telegram. I appreciate the value of the solution, in an effort to help developers in Africa not be isolated and fall behind in the development flow of Blockchain technology. In fact, Africa is also the area Cardano prioritizes to reach and expand its influence. However, the difficulties our Cardano ecosystem is facing in reaching this area are: expensive internet costs, English is not a common language, many blockchain terms are not easy to understand when translating. into another language… Consumers in Africa are paying 10-20% of their income per month for the internet, the highest rate in the world (https://www.cnn.com/2019/10/22/ africa/internet-affordability-africa/index.html). In particular, the Democratic Republic of the Congo - the country proposed by the authors to be the first deployment site of Cardano's French-speaking community is also the country with the highest internet cost in the group, up to 20% of the total income. people's monthly income. Not to mention, blockchain documents are mostly in English, a language that is uncommon in Africa. The team also anticipated the risk of poor internet connection and had solutions to overcome such as: storing videos recorded for each online meeting, sharing on youtube. However, I think the team should further consider internet cost risks that could affect the effectiveness of the solution's impact. I suggest the team create a blockchain and Cardano educational directory in French, categorize documents by content topics, store and share them for free to the community through platforms: web, Youtube. The goal is for the masses to have access to this free resource at any time. In addition, I also suggest that the group should add Q&A content, answers and tutorials in addition to the document at the online sessions. This helps make the most of the online meeting time of the French-speaking Cardano community. Personally, I rate 4 points on the impact of the solution because the information given by the authors is concise and clear. I believe that if approved by the community, this solution will make Cardano more accessible to developers in Africa. However, I minus -1 point because the proposal has almost no refresh in content and approach.", "q0r": 4, "q1": "Regarding the implementation schedule, the group has described it quite clearly, with a specific timeline. Specifically, blockchain documents and introduction to Cardano will be compiled and posted by the team on the web and Youtube for 4 months, one content topic per month. Every week, Saturday is the time for online training. I consulted the site shared by the team https://uptodatedevelopers.com. The team member information, profile of their experience and qualifications through the link provided to sites such as LinkedIn, Twitter is clear. I learned about the team's information through a number of activities they have successfully organized in Africa in the years 2020, 2021 such as: Updev Challenge for programming training lasting 5-7 sessions for ages 12 – 30 years old, gathering new technology enthusiasts. I believe that, with their proven capabilities and experience, they are capable of successfully implementing this solution. However, regarding the project implementation budget, I suggest the team should have a more detailed explanation. This will help the community better understand how each cost item is used. Specifically: $3000 the team plans to create content in French and a small promotional video. I suggest the team to build a unit price $ for the number of hours of document translation, or $ unit price / production video. Similarly, the cost of $6000 aggregated for 3 categories (16 online training courses, payment for trainers, video editing costs) is unclear. In my opinion, the group should clearly divide the cost of each item, with the unit price attached. For example, the unit price $/number of lessons to be paid to the lecturer. Similarly, how much does video editing cost $/video * number of videos to edit… I give 4 points for feasibility, the reason I appreciate the solution's feasibility but deducted -1 point due to the lack of unit price for each item in the budget.", "q1r": 4, "q2": "Regarding auditability, I think that the community can completely audit the success of this proposal. The reason is that the group has provided links to the group's web and Youtube, where the community can follow the teaching materials and video of the online sessions shared by the group. However, what I find unfortunate here is that the team lacks specific KPIs that measure success. Although, here the team has given the main auditable metrics such as: number of session attendance, number of new developers, follow-up and engagement questionnaires, but there are not any numbers any specific commitment. I suggest the team add in KPIs for each indicator. For example, 100 people are expected to join each online session, 20 new developers join the community every month… These numbers are very important, helping the community to measure the successful outcome of the project what it will look like. So I deducted -1 point from the auditability of the proposal. My rating is 4 points.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11373, "q0": "A blockchain is distributed database or ledger that is shared among the nodes of a computer network. As database a blockchain stores information electronically in digital format. Blockchains are best known for their crucial role in cryptocurrency systems, such as bitcoin for maintaining a secure and decentralised record of transactions. The innovation with the blockchain is that it guarantees fidelity and security of record of data and third party.As french speaking African countries lack information on Blockchain technology organising weekly live code meetups on this in to boarden knowledge on subject. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The project has detailed plan including introduction of Cardano blockchain and smart contracts, blockchain program beginning, blockchain programming and using cases of blockchain. The project has detailed budget breakdown which is outlined clearly and is reasonab to achieve set goals. The proposer explained technical aspects like architecture, language and technologies for implementation and consider challenges and risks in it. The people working with the project has good experience in it.  Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by videos which should normally available in YouTube channel and on website which can make archives available in text format. Congolese developers of DRC participating in weekly meetups be able to contribute integration of Cardano blockchain in application and African senior junior developers from french speaking countries interact in blockchain technology which helps in success of the project. This information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 11281, "q0": "The proposal is great and serves the goals of the challenge well, which is to promote projects that benefit both the African continent and the Cardano blockchain. Aware that projects developed in French-speaking African countries lack information about blockchain technology, the proponent has come up with a strategy with comprehensive and concise information on each stage to address this challenge. The project will allow users to communicate directly with advisors to draw on their expertise by linking French experts via Telegram. This will certainly benefit the continent, as it will provide education for professionals in the field of technology, opening up other opportunities for them. The positive thing is that the team will record the meetings and post them on youtube, contributing to the expansion of Cardano Blockchain in Africa, starting with the Democratic Republic of Congo. Another positive is that they already have a Telegram community with over 130 developers who are African and French-speaking. Proposals are accessible to more and more developers in the long run. The key things missing from this proposal that the team should add are: what knowledge content will be covered in these meetings, the sequence, and strategies in which they will be adopted, the number of meetings, and the number of meetings. Developers scheduled each meeting,...Then I think this idea will be more complete and clear.\n", "q0r": 4, "q1": "I find this project very doable. The strategy is outlined in each timeline from June to September 2022 with a total of 16 sessions, a plan with such an exact timeline is also good, but this is still not enough to convince investors. investment and improvement in some respects. We also know the general issues that will be solved during each month of the project, however, it is a bit sketchy and needs to be better organized. I wonder what steps you mentioned here (rebuilding English classes in French in pdf, PowerPoint, and Creating a small promotional video for the invitation) correspond to the timeline in your plan. friend. So the team needs to add information such as the time of classes, and who will write the content,... The proponents explain to us the areas to be studied each month, and the subject The topic of each class should also be specified separately. Example: \"June 2022: Introduction to Cardano, Blockchain and Smart Contracts\". I think the team should mention the number of meetings that will take place this month? What is the topic of each meeting?... Regarding the budget, the amount requested by the team is 9000 USD, which I find quite reasonable. However, I think the team should come up with a clearer and more specific budget breakdown for the community to follow. For example, $3000 to pay for creating content in French and creating a small promotional video to call for engagement. I want to ask how many content creators are paid? How many editors make videos? What is the amount to pay them an hour?. Finally, about the experience of the team, they are very qualified people and very related to Cardano. The team provides each person's CV, the proponents attach their link profiles so the information can be easily verified by everyone.\n", "q1r": 3, "q2": "The team offers a way for the community to track project progress through youtube videos and web documents. The team should not only show how to keep the community on track but also explain what goals you want to achieve for the activities mentioned in the plan above and the estimated time to complete them. The lack of completion time makes it impossible to forecast and evaluate the performance of the project. On the success of the project, how did the team see the success of this project and listed the key indicators the team aspired to achieve. It's a pity that the team could not give specific figures. How many people does the group want to attend the session? How many new developers will be participating? Quantitative numbers will make your proposal a lot better.\n", "q2r": 4, "assessor": "z_assessor_3235", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10557, "q0": "“CARDANO FRENCH COMMUNITY IN DRC” is a good idea and meets the challenge “Grow Africa, Grow Cardano”. This proposal raised an important problem: \"Projects developed in French-speaking African countries lack information on blockchain technology in general.\" I think that holding weekly live code meetings on Blockchain technology to expand the French community and expand knowledge on the subject, helps to promote projects that benefit the whole region. Africa and Cardano's Blockchain. In the current situation, online meetings will be developed between French-speaking and African developers, the project team has come up with solutions to solve the challenge that will invite developers experienced developers with advanced knowledge of Blockchain to share their knowledge in designing smart contract applications. Some bilingual developers can take courses in English and share them in French in the community. This can bring many benefits as it provides education for professionals in the technology field, creating a variety of job opportunities for them. The plus point here is that they do record meetings and save them on their Youtube channel for resources available in French. Usually, people will have a problem with where to find data information from, any specific source, the positive point here is through various social networks that any developer anywhere in the world. A French-speaking country in Africa can join for free. Therefore, this will no longer be a barrier when they want to participate in the project. The next advantage here is that the project team already has a community with a telegram channel with more than 130 developers, meaning there is already a significant amount of people involved in the project. However, this project still has a few details that have not been mentioned: what will be covered and discussed in the meetings, who will be chaired and maintained, who are the participants, and What is the expected outcome after each meeting? I think, if these parts are added, it will make the project more convincing. To successfully implement this project, the proponent also pointed out the risks faced such as poor internet connection quality, and problems related to reaching a large number of participants. However, each of these risks was also foreseen by the proposed team, and proactively taken remedial measures.\n", "q0r": 4, "q1": "The proposer has given a timeline, budget, and participants to implement the project, but this plan is not detailed and complete. I think there should be a plan that clearly states the timelines for each part of the work, the functions and tasks of each part, the members in charge, and the results to be achieved,... so that everyone can easily understand. Get project information as well as the proponent to conveniently control the workflow. For example, the team will first restore the English lessons in French in PDF and Powerpoint, so how long will this work, and who will be in charge of this work. Next comes the introduction of Blockchain to the stage of UTXO and the account model, here the publisher just stated a rather general plan, for example, June 2022 introduction of Cardano, Blockchain, and another smart contract however here I see, this topic is very broad so how many meetings will it take to complete the intro, what will be included in the showcases and in what order? And the detailed planning for each month should be done similarly for the following periods. As for the budget, the proponent has allocated it for two different purposes. However, I think the proposer should have a more detailed statistics table, for example: in Step 1 will spend $ 3000 to create content in French, so what are the specific contents, how much content is there? content, the budget is divided equally for each content or there is a classification and assessment of the importance and necessity of each content to balance the budget reasonably. The rest of the budget is used to pay the video editor, to pay the coach, so how many hours does each coach teach and what is the salary of each coach or the amount to pay for each edit? How much is the maximum video editing? Regarding project participants, the proponent provided some information about 4 members about their names and positions. However, in my opinion, these contents are still incomplete, the proponent should add more information about work experience, professional qualifications, and job positions that each person is directly responsible for in the project. this and their job suitability. Besides, if possible, the proponent should provide more links so that the community can conveniently check and track team information, helping to increase the persuasion and reliability of the project. In summary, some of my opinions about the feasibility of this project are as follows: Build, plan in more detail on timeline and budget, and have specific and easy-to-understand explanations on how to allocate funds. books help the community to easily grasp information and control; define the tasks of each professional team in the project.\n", "q1r": 3, "q2": "To measure the progress and success of the project, the proposer has given the information about the Youtube channel and the website to host the document as formathttps://uptodatedevelopers.com/our-trainings, I think this is also a source to check information quite specific and transparent. However, to measure the success of the project, the proposer relies on the actual results of the participants of the weekly meeting, approaching the project sponsors high-end African development. I think in this section, the proposer should add specific metrics and KPIs for people to easily evaluate and track and increase transparency for the project. As this is a continuation of previous funded projects, I think that the experience and resources built up from previous funds will be an advantage for this project to develop.\n", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 10526, "q0": "This proposal seeks to be more inclusive and grow the cardano community in the DRC. It includes translation of various educational ressources to french, as it is a commonly used language than french in the DRC. They will also offer different formats of ressources, PDFs, videos and online meetups. This will help give more accessibility for people with different technology access options. I believe this project is very meaningful and will grow knowledge of blockchain technology, as well as the cardano ecosystem immensely in the DRC and french speaking african countris as a whole. This projet answers the challenge completely. ", "q0r": 5, "q1": "The author already has an important userbase on their telegram, and I believe they are on a good path to keep growing. The timeline shows what the author plans to translate and make available for learning: introduction to cardano and blockchain technologies, a programming learning ressource, and a practical course on how to use the aforementioned knowledge. This is a very comprehensive program that would help learners take their first step into the cardano ecosystem. The budget seems reasonable, but could do with a more detailed breakdown of planned hours of work and salaries. Overall, I think this project will know great success. The developers seem very competent and full of experience as well. ", "q1r": 5, "q2": "The progress and success of the project will be easily trackable, as the ressources that the author will make available will be completely public, and so we can see if the ressources are being put out on schedule. The success of this project will be easily auditable by looking at their telegram and other socal media platforms, through video views, engagement in the chatrooms. Overall,I think this project is very easily auditable. ", "q2r": 5, "assessor": "z_assessor_3189", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10265, "q0": "Raising awareness about Cardano in the African community is a challenge that has emerged from several Catalyst Project Funds back in the day. There have been many similar proposals to bring Blockchain and Cardano to the African community. This project of yours has its own particularity, which is towards the French-speaking community at DRC. In fact, a recent report by Chainalysis, a blockchain data platform, found that between July 2020 and June 2021, Africans received $105.6 billion worth of cryptocurrency payments—an increase of 1200 percent from the year before. We see that Africa is not isolated at all, developers have been developing technology on par with the world. I think that the lack of information like in your problem statement is mainly because of the language barrier, because in today's technology age, people are connected and information is everywhere. Your proposal will focus solely on the popularity of Cardano in the French-speaking community. I rate 3 points for meeting challenge alignment, however your suggestions are quite sketchy and need to add more details.", "q0r": 3, "q1": "I think this proposal will be implemented successfully, because your goal and way of construction are quite specific and reasonable. The participating members all have experience in Blockchain system development. Africa is home to the largest number of French speakers in the world – 120 million people in 24 francophone countries. So, the English to French adaptation will definitely attract a large number of developers to join the community. The detailed plan you have announced lasts for 4 months, covering both theory and Use - Cases of Blockchain, but I find the introduction schedule quite sketchy and have not mentioned Blockchain Platforms, Blockchain Applications, or The Limitations, Opportunities and Challenges of Blockchain… I think you need to list and build a more detailed introduction program and publish the schedule on social networking platforms to attract interest from the early days. Detailed budget breakdown has been mentioned but there is no specific explanation of labor and working hours, the amount values ​​you give are only quantitative. You need to give an assessment risks taken into consideration.", "q1r": 4, "q2": "The author team makes the entire process of the proposal publicly available on the Telegram channel, including the number of Telegram users, the number of messages, the amount of donations… This shows that the working group is willing to make information public, make it easy for the community to check the results. You should systematize this information on an official website with enough pictures and videos of activities like many projects have done. This helps the team work closely with the community and easily receive support.", "q2r": 3, "assessor": "z_assessor_3170", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "We report on the project in the Blog page of our website (https://uptodatedevelopers.com/blog?page=2)\n\nWe are also working on the web discussion forum that will allow the Cardano community to follow the progress of participants' interactions."}, {"id": 7687, "q0": "It is a proposal that meets the challenge. access to information on the blockchain to the French-speaking world is timely. With a typical project, we hope that it comes to solve the challenge with their solution in organization of meetups and direct code in French language, this will make it possible to reach many more Congolese members interested in the blockchain and thus facilitate the expansion of the network in Africa and the DRC in particular.", "q0r": 5, "q1": "In view of the experience of members who have worked as a developer, programming experts with experience on the cardano blockchain and representative of Wada DRC for some, there is reason to hope for the implementability of this project. The presented plan although concentrated, there is hope of its implementation considering the competence of the proposers and as the project is a continuation having started since last June.", "q1r": 5, "q2": "The team proposed as a challenge to create a cardano community in D.R.Congo to learn more about the Blockchain, to broaden the knowledge of Congolese programmers, to be able to contribute to the development of applications based on smart contracts, to reconstitute English lessons in French in pdf, PowerPoint and UTXO transactions..those information provided are sufficient and the verification feasibility  will make it possible from the monthly reports, the proposers have also made available relevant links than their website, GitHub and Telegram channel which will allow regular monitoring of the execution until the delivery of the second tranche of fund and will help to follow-up according to the plan started in June.", "q2r": 5, "assessor": "z_assessor_2915", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7623, "q0": "The problem described in this proposal is closely aligned with the challenge.\nThe team has done a great job by putting the proposal at the right challenge. The problem within this proposal calls for a drastic change in attitude towards how French speaking countries are trained to adopt Cardano and improved training efforts in Francophone countries in Africa, especially DRC through the organization of weekly live code meetups on Blockchain technology to increase the number developers in the French community in order to broaden their knowledge on Cardano and other related matters about the ecosystem. \nThe proposal clearly articulates how it will add value to the Cardano ecosystem through  reaching more than 300 French-speaking developers across Africa who will be on boarded into the ecosystem. Moreover, the key metrics and goals of the proposal align with the outlined challenge and the proposal is able to scale to address future challenges through making their resource available to other French speaking countries. The proposal also shows a plan for the project's future sustainability and development beyond the borders of DRC. \n", "q0r": 5, "q1": "The team is a young, vibrant and dedicated group who have experience in web development and are passionate about learning and improving their knowledge of Cardano. The experience and skills stated in the proposal show as people who can implement the project if funded. The budget is clearly stated but they have not been able to break the budget down to cover the bits of details that it is going to be used for and the budget is reasonable to achieve the set goals. Also, the proposal offers a realistic timetable to complete the work and provides a sensible plan for implementation that shows not only what is being done but also how and by whom which is commendable.  \nTo sum up, the proposer has considered challenges and risks relevant to a successful implementation and how to mitigate them. How they are thinkimg of getting other countries involve on the project is testament to the kind of people behind the project and what they want the project to achieve in the long run.\n", "q1r": 4, "q2": " They have been able to state a clear  roadmap with milestones and a clear time horizon for achievement, but haven't really stated a well-thought out Metrics/KPIs that define the success of the proposal. They go further to state how success will look like for the project at the end which includes the fact that the Congolese developers of the DRC will be able to participate in weekly meetups, they will be able to contribute to the integration of Cardano blockchain in an application and it will reach senior and junior African developers from French-speaking countries who are interested in Blockchain technology. \nAnd finally, they have provided a dedicated YouTube channel which will be an accessible channel for delivering regular updates to the community for auditing their progress on the project.\n", "q2r": 4, "assessor": "z_assessor_2908", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6309, "q0": "This proposal attempts to onboard the developers through weekly live meetups and Youtube videos from French-speaking communities in the Democratic Republic of Congo, where French is the primary language. It is well-aligned with the Challenge statement as it is trying to onboard developers from Africa.\n\nCurrently, the proposer focuses on DRC, where the proposer and his team live. But the team is interested in going to pan Africa, where French is the spoken language. This will have a good impact and help onboarding new people to Cardano, especially the developers.\n\nAs accepted by the proposer main risks in this proposal are the less participation of the developers and the poor internet connectivity in the region where they want to do the live meetups. However, they seem to be addressing this problem by uploading the video on YouTube and inviting a much larger number of developers on their social media platforms, such as Telegram. It is good to know that the proposer already has a community of 130 developers on Telegram.\n\nIndeed, more details about the program would have helped to estimate the impact, such as the content that will be made available in the meetups or videos. The brief details are provided, but the mentioned time will not be sufficient to cover those extensive topics. I would be interested to know the plan or how the proposer wishes to cover those topics in the meetups.  ", "q0r": 4, "q1": "The proposer and his team seem qualified to do the mentioned tasks of the proposal. Also, their brief details, along with their LinkedIn profiles, are provided within the proposal.\nThis is the continuation of the funded proposal with the same name in Fund 8. The proposer can add 'the progress from the funded proposal and the feedback of proposer and participants' to this proposal for a better decision.\n\nThe asked fund is $9,000, which seems fair, and it is broken into the identifiable tasks of content creation in French, promotional video creation, training meetup, payment to trainers, and video editing charges.\n\nThe timeframe is provided and divided on a month basis based on the topics which will be discussed in training.\nI am giving it four stars because I think the whole proposal is good, but I have doubts about the extensive topics to be covered within 16 training sessions.", "q1r": 4, "q2": "As stated by the proposer, auditors can track the proposal's progress on their website and from the training videos uploaded to their Youtube channel. Other details could help in auditings, such as the number of developers participating in the training and their response to it. But I think the auditing here will be okay as it is an onboarding program.\n\nThe main KPIs will be the number of participants in the training and, ultimately, the number of developers moving on to build DApps on Cardano.\n\nThe timeframe is relatively straightforward, divided into four months with the specific topics to be covered each month. Hence the delivery dates are unambiguous.", "q2r": 5, "assessor": "z_assessor_2811", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6092, "q0": "Projects are developed in French-speaking Africa. However, there is still a lack of information about blockchain technology. The team proposed with the idea of ​​​​establishing a Cardano community in the DRC, holding live code meetups on Blockchain technology. Learn Blockchain, expand knowledge and French community, contribute to smart contract application development. The proposed team has set a goal of reaching 300 French-speaking developers by the end of 2022. If the project develops well and properly, it will be a success for the growth of Cardano in Africa and the human community. France in Africa. Besides, it is possible to develop with the French community not only in Africa, but also to develop a large number of French users in the world with a youtube channel in French. Especially, it is possible to expand the community with about 67 million French people through youtube channels and social networks in French. In my opinion, the proposal works well for the challenge posed. The proposal aligns with the goal of the challenge, focusing entirely on the promotion and development of Cardano in Africa, especially the French community and developers. is necessary. The team described the solutions clearly and in detail. Besides, the team has also recognized the risk and has a solution for the risk that may occur when the proposal is implemented.", "q0r": 5, "q1": "In planning, the first is about the route. We can learn the basics here, however, I think we can get more details to better understand and trust the process. The team can further explain who the first 5 developers are, possibly providing more information about them. For example their identity, their qualifications, skills and experience. As shared about the team's solution, the team also has bilingual English and French developers, it would be nice to have a short presentation about these developers. followed by the budget section. We know how the total amount is divided into parts. However, each part needs to be broken down in more detail. For example, how much for French content and how much for 1 promotional video. Cost per training course, video editor, trainer? How many members, which experts and what jobs will be assigned to them, for how long and the salaries of experts for each job they are in charge of. Finally about the team. The research team provided a rather satisfactory breakdown of the team members involved in the project. We know who they are, their experience and skills, and have links attached to them. They are entrepreneurs, developers and a very active part are Blockchain entrepreneurs and crypto experts. About the team, everything is almost perfect. Having a close connection with Blockchain, this in my opinion is very necessary. In general we can grasp the plan of the whole project, however some details can be improved to complete the project in a solid way.", "q1r": 4, "q2": "The group said that the proposal is a continuation of a previously funded project. In my opinion, the team can provide more link of the previous proposal, we can better understand the content, development and success of the funded project. In addition, the team provided ways for us to measure the progress of the project, the success of the project. The team has attached a link to easily track the project progress with videos often available on youtube. Very good suggestion, there are a few small details that can add more details. If the proposal is successful and properly developed, it will be a next step for the proposed team, and the Cardano Blockchain Development and French speakers in Africa in particular and in the world in general.", "q2r": 4, "assessor": "z_assessor_2786", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"id": 5537, "q0": "The problem described here is a good fit into the challenge. Raising Congolese developers who will be able to contribute to the integration of Cardano blockchain in application is a goal that aligns with the challenge of seeding and growing Africa and when executed creates a big positive mark for the ecosystem. The proposal can reach out to more and more developers in the long run sense because a proposal of this nature when executed, considering the plan, would be able to get many of the French people in Congo educated about Cardano blockchain. I think that having 5 developers reconstitute English lessons into French pdf where the Congolese people can learn and get well informed makes the project scalable and functional; that for me is a good effort. The key metrics and goals are also in alignment with the challenge setting.\nThe proposal is sustainable considering the fact that the proposer intends to return to catalyst for further funding. In fact financial wise the proposal can be sustained.\nThe proposal effectively addressed the challenge hence it’s impactful.\n", "q0r": 4, "q1": "I can say that the information about the team and their relevant experience and expertise gives me the assurance that they are up to the task. However I have an issue with the budget, I was expecting that a more breakdown of the items under each of the two steps ($3000 for step 1 and $6000 for step 2) given so that the amount could be subject to the last level of scrutiny so that we can determine to the later how the funds would be disbursed. However, I believe it’s still reasonable and sensible to achieve the set goals. The plan presented here is concise and the timeline is also definite. The plan presented does not include technical language that would need further explanation to understand the approach. The plan appears simple to comprehend. The risks/challenges have been considered with measures to mitigate them, and for me is a good effort required in auditing a proposal. I was however expecting that the proposer will include a challenge of insufficient or limited days for project execution as one of the risks because it’s indicated that project would commence in June 2022, but here is the case that June has ended. I will advise that the proposer takes this into consideration in future proposals. \nThis project is one that appears to be feasible.\n", "q1r": 4, "q2": "The roadmap is concise with clear milestones/deliverables and time horizon for the achievement of the project. One desired outcome of the proposal is to reach out to African developers from French speaking countries interested in blockchain technology is a good indicator of what success looks like. The metrics/KPIs chosen are good indicators of evaluating success as they are concerned with measuring the number of session attendees amongst others.\nThere is clarity in the problem identified and I am of the assurance that the proposed solution is effective to address the problem. \nThe proposer has indicated that, the project’s updates will be shared on their YouTube channel so that members can track the development. I however, also recommend that the proposer makes use of the catalyst community channels on Telegram, Discord and the rest so that the project can be open up for more evaluation.\nWith all this being said, I believe that the project is auditable.", "q2r": 4, "assessor": "z_assessor_2713", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4338, "q0": "This proposal is very good for the French in Africa, it is especially good for non-French-speaking African countries. The proposal that addresses the goal set in the Challenge is \"Grow Cardano, grow Africa\". The team was very aware of the problem that needed to be solved which was the lack of information about the Cardano blockchain, and the lack of information about the technology for the French in underdeveloped countries. I think if done well, this proposal will solve two problems. The first is to raise the intellectual level (knowledge of Cardano) of the French-speaking communities in Africa. The second is indirectly increasing the value of the Cardano ecosystem (this takes time). I still sometimes come across similar proposals during my evaluations, but I always try to take a close look at each one that has its character, they are similar in that they are both beneficial to Africa and the world. Cardano. However, I am thinking about expanding the scale of this proposal if it is successfully implemented after being funded. In what direction will the team scale? What do I mean by continuing to grow the French-speaking community in Africa - raising their awareness of Cardano or the development team in the direction of educating people in Africa? I believe that with the right development, this proposal will solve many future challenges on a national scale and even more on a continent scale.", "q0r": 4, "q1": "The proposer has experience working on web, mobile, and desktop applications. The team also has members with full qualifications to implement the proposal. I am very pleased that the team has specifically disclosed the identity of the members through links to social networks. However, when I have advice on providing more documentation regarding the proponent and the number of team members, if the team can do this more then the feasibility of the proposal is clearly shown and make the community trust in the team. Regarding the budget request of $9000, the requirements with the nature of the job seem reasonable, but I want you to analyze it more fully to increase the reasonableness with the set goal. Detailed example \"Create content in French\" how much does the team need? How much does it cost to \"create a small promotional video to call for participation\"? If the analysis is so specific and clear, the reader will surely be convinced. The implementation plan seems feasible. I just hope that if you analyze more about the technical aspect of the technology used in the proposal, it would be great instead of currently only knowing the technology developed through the web or YouTube, etc... Analyzing the risk of implementing the proposal, I have a question: Why do you think that poor internet quality easily entices developers to go online? Do you have any confusion about using the words \"online\" or \"offline\" or not? The rest, I completely agree with the social network plan to propagate and invite people to attend meetings and events.", "q1r": 5, "q2": "I was convinced by the roadmap and milestones you outlined in implementing the proposal. It's reasonable. Like how you clearly stated the problem along with stating the solution to solve the problem. The only thing I would like to comment on is that I do not currently see KPIs appearing in the proposal. You all know that KPIs are important to demonstrate transparency and audit. Why don't you show KPIs? I recommend that the team add digital KPIs to improve transparency and make it easier for the community to perform audits. Also, do you intend to report on the progress of the project? I think this should be done because it greatly aids in monitoring the work of the proposal. From the very beginning, when I read the proposal, I liked the idea. One more idea, I want to contribute to the proposal is that the team should clearly state the role of the members as full-time or part-time when implementing this proposal. That information is in my opinion important to increase the feasibility and transparency of the proposal. Although it does not have much to do with the criteria to evaluate the auditability and transparency, it shows in detail the honesty of the team when fully describing the current work status of the members. Wish the team and the proposal continues to be funded.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 3657, "q0": "This proposal is likely to have a major impact on the Cardano ecosystem, given the potential for Cardano to expand as a cryptocurrency in Africa in French-speaking countries. The proposal meets the challenge because it seeks to spread knowledge about Cardano and also create closer relationships between African developers within its ecosystem. This opens the door for new partnerships, ideas and projects to emerge with a focus on expanding Cardano's reach. The proponent presents the risk of developers not having a good internet connection to access the content that will be created in video format, but also mentions that it will keep the videos saved on a youtube channel to ensure that everyone can watch them on pority. A point that I believe the proponent could explain better is about the degree of knowledge he and the team have about Cardano and also if the proposal will try to spread information and knowledge specifically about Cardano – the blockchain of this ecosystem we are in.", "q0r": 4, "q1": "Regarding the feasibility of the proposal, the planning of the project stages seems to have very close dates if we consider that in June 2022 (when the proposer intends to start the project) the proposals will not even have been voted on, so I suggest that the team reevaluate these milestones and dates. Regarding the budget, it seems that it will be sufficient for the steps described in this proposal, although it could have been more detailed in smaller items for the community to better understand how the funds will be allocated. About the team, the knowledge presented in the proposal and on LinkedIn of the members seems to be enough to put the proposal into practice.", "q1r": 3, "q2": "As a CA and active in the business area, I believe that the proposal could better explain its auditability. In order to provide data to support the auditability of the progress and success of the project, the proponent could cite some metrics and KPIs such as: number of views of the videos on YouTube per week or month, number of new subscribers to the channel also per week or month, how many French-speaking African developers join the weekly meetings, etc. Using these indicators makes it easier to understand if efforts are generating results and change them if necessary. In addition, bidders could use targets on each of these indicators, doing a Target vs. Accomplished analysis each month, for example. The proposer could also present milestones and deadlines more clearly, presenting them as a timeline for the CAs and voters to better understand.", "q2r": 3, "assessor": "z_assessor_2466", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "AUDITABILITY :\n\nSince the beginning of the sessions on the Blockchain Cardano, we have exceeded 100 subscribers on our Telegram channel (https://t.me/updevcommunitygroup).\nMore than 100 on YouTube (https://www.youtube.com/channel/UCTMujKbKTF2zHaBBS0ooDKQ),\nOver 1000 followers on Twitter(https://twitter.com/developersup), over 2000 on LinkedIn(https://cd.linkedin.com/in/uptodate-developers-068729195) and over 5000 on Facebook (https ://m.facebook.com/DevelopersUp/photos/?ref=page_internal&mt_nav=0).\n\nWe also intend to get participants to be active on our discussion platform, Updev Community (https://updevcommunity.com/.) to allow the Cardano community to follow the results based on participants' interactions as they arise. sessions will be held."}, {"id": 2772, "q0": "\"We find solutions to the challenges posed in this proposal, which is committed to providing information and knowledge to the Francophone community in Africa, with the goal of The first proposal that was proposed was the Democratic Republic of the Congo, which was an idea that had local impact for a region, and that fit perfectly with the requirements of the challenge.\n\n   The solution that this project has provided is relatively easy to understand: the proposed team will learn knowledge related to Blockchain, Cardano and then edit it into a document to pass on to the community in the area. target area. How they convey:\n  1, with french video on Youtube channel,\n  2, is written documents also in French.\nin order to suit each community's time and conditions, this is a proposal to follow the success of other proposals like in the Vietnamese community, they also have similar proposals and in my opinion known they have been very successful. With the experience of the proposal team having been successful on a previous proposal, I visited the link to https://uptodatedevelopers.com/services and found the content there mainly to help and support those who need help and support. New developer, this is very interesting as the dev team has gone ahead and now all that remains is to create a community of users with this proposal. Therefore, I think the group will be very successful in this round of capital.\n  it would be very rare to risk with this proposal, also the problem of the internet. has been thoroughly used.\"", "q0r": 5, "q1": "\"According to the statement, the roadmap to implement the idea of ​​​​the proposal, which has been working since June, will have 4 months for the team to provide basic documents and videos about Blockchain, January 1. Thematic is also reasonable for compilation, and translation into French.\n  The detailed budget table of the proposed proposal is also quite complete but not really easy to understand, for example, the group that provides specific expenditures to each small goal in the steps will be easier to understand, and ensure greater financial transparency.\n  The proposed development team all have relevant industry experience and moreover they have project development experience and have had success in other projects. However, in this proposal, if the group presents more, how to divide the work to each person, for example: who will be the translator, who will compile the content, .. if so, this feasibility will be very easy. maximum score. \"", "q1r": 4, "q2": "\"The proposed team will return with the next funding round to continue to expand the community. It is very easy to follow the roadmaps to implement this proposal, because the videos available on the group's Youtube channel are the answer. answer for whether they work hard.\n   The success of the proposal is that in the not too distant future there will be new developers present in the Cardano ecosystem, and they are from the French-speaking communities in Africa. \"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 13, "ne": 2, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 2400, "q0": "Regarding the goals of the challenge, we have that the central idea of ​​the proposal in question fits perfectly, as it aims to promote the creation of an ecosystem with great potential to have a positive impact on the African blockchain market, as professionals who are able and specialized to work in the blockchain market will be forming. In addition, we have that the budget being requested for the project is quite consistent with what you want to accomplish; the $9,000 amount for holding weekly meetings over about 16 weeks is a fair amount. It is also worth mentioning that the benefits of this project should only be perceived in a future period, when the specialized workforce is better trained, but this is perfectly valid and is also consistent with the purpose of gradually promoting the emergence of each more projects that use Cardano technologies. In this way, with the success of the project, proposals for future funds aimed at the African continent will have a greater chance of success, as a more fertile environment of French-speaking developers (quite common in Africa) will have been formed.", "q0r": 5, "q1": "Regarding the professionals involved in the project, a very positive point is their strong relationship with the technology and blockchain market, which fits with the proposed objective of providing weekly meetings that teach concepts about this market. Additionally, we also have that the CVs of these professionals were made available to verify their relevant experiences. Regarding the detailing of the action plan, it is possible to see that the average duration of the project is well established and the goals make a chronological sense, going from the teaching of initially more introductory concepts to the programming stage and use cases. The division of the total amount being requested for the realization of the project is quite plausible, with no excessive expenditure and with the allocation of most of the capital (about 66%) being directed towards the teaching sessions, which is the main focus of the project. We also noticed a concern of the team with regard to promoting the project, since a promotional video of the project will be made. A not so positive point that is worth mentioning here is that the github link provided shows that there have not been many recent updates, it would be interesting if we could observe a more current engagement in this context, mainly because it is a project aimed at teaching of technology. Regarding risk mitigation, it is interesting to note that the team understands the gap that exists on the African continent in relation to internet access, and is also prepared to take measures to mitigate this storm.", "q1r": 4, "q2": "Regarding the ways to follow the development of the project, we noticed that the team has a succinct but sufficient vision of what should be understood as a good progress of the project. As the main focus of the proposal is the realization of remote teaching sessions, we have that the posting of videos on Youtube, as mentioned, is a great way to follow the evolution. But the main positive point of this section of the proposal seems to be the team's understanding of what would be the success of the proposal, because, as mentioned initially in the impact section, the great result of this project would be the creation of an ecosystem favorable to the creation of futures projects involving Cardano's technologies; what is being cited primarily as the team's perception of success. Additionally, it would also be interesting if some numerical parameters had been better established to understand the scope of the project. For example, a target number of developers could be established who started to work predominantly with blockchain technology after this period of classes. Another possibility would also be to measure engagement around the project on social networks.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1999, "q0": "This is a very interesting project which aims to create live coding meetups in French, encouraging the development oof people/devs in DRC who wants to enter in this world but have language barrier (since the majority of the content is found in English).\nThis tackles the challenge because:\n1 – ADA: Since the team is aiming ADA as model to create the content and make the meetups, there has a big chance to encourage people from DRC (and other Francophones countries in Africa) to use ADA and create solutions to their community using ADA which will arouse interest in other people, making ADA more well accepted among this community; and\n2 – Africa: Having people from the same culture/background creating content and organizing meetups is good because it can encourage people from DRC (and other Francophones countries in Africa) starting creating solutions to their community, probably creating jobs, increasing the money flow – which is good to their economy, educating people from the region etc.\n\nThe project mentions the poor internet quality, which is a real problem. It’s a good solution to upload the content on the YT channel, however it would be essential to monitor the growth of the channel and the feedback, and maybe think about start doing a presential meetup. Also mentions the risk of ‘not reaching a large number of people’ – this is a serious problem which needs to be taken into account. Maybe allocating a part of the budget to marketing would be a nice shot.\n", "q0r": 5, "q1": "To evaluate the feasibility, we can focus on some aspects:\n1 – team: The first thing to notice in this project about feasibility is the team. The team provided the link which directs to their company website, giving proof of knowledge, knowhow, projects and stakeholders. There you can find information and proof that they are capable to deliver what they promise and with quality (which is fundamental). Therefore, this aspect is safe.\n2 – task: the task proposed is to create some French lessons and having meetups on Saturdays to teach it. It was told the content of the lessons, which is good. However, it does not specify the time which each lesson will take. I’ve been a teacher long time ago, and an important aspect of being it is the organization, knowing how to conduct each lesson and how long it’s going to take. Therefore, would be nice to add an expected time and, then, add an extra time for questions and chat.\n3 – budget: The budget should’ve been more detailed. The proposal is dividing the budget in two big groups with some different activities, not specifying how much each of its minor activities are going to cost.\n4 – self funding/scalability: It was not provided a clear plan to monetize/self-fund this project. Depending on the feedback of the students, it might be charged a fee just to pay the teachers and continue with this project. Another aspect is trying to boost the YT videos and, since it’s a very specific niche it’ll be watching, the add-view price will be high and capable of fund the continuity.\nThat being said, the proposal is possible to be accomplished. It’s just missing some information.\n", "q1r": 4, "q2": "The proposal does have a personal channel to share the information, their website and YT channel.\n\nThere is a success metric (reaching 300 french-speakers until DEC2022), however it’s missing more metrics and KPI. Maybe adding # of attendance in the meetups, # positive feedbacks, # shares, # likes etc, will help you measure the evolution and success of this proposal. More than that, it’ll be possible to create strategies to improve it.", "q2r": 4, "assessor": "z_assessor_2298", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1530, "q0": "The proposal identifies a valid problem.\n French is a world language spoken in many countries, and the lack of french resources and networks is a clear entry barrier for people from many african countries. The proposal aims to improve this with a relatively modest amount of funds. In relation to the low amount of funds used to the impact networking effects and aducational materials can have, it can be said to have a notable impact. Networking can also have very positive effects on scalability. SInce, as mentioned above, there is a big french speaking community in many african countries, the proposal suits the challenge well.", "q0r": 5, "q1": "The team has proposed before and they so far seem credible and reliable. THe team is transparent about their background and they have links providedAs usual they ask for a relatively low budget which is highly appreciated. The budget is broken down reasonably and they have in implementation plan/roadmap that could be more detailed however, e.g. by providing a concrete list of the translated contents.\nA reasonable mitigation plan brings a good solution to adress possible hurdles like bad internet connection and also adds benefits by producing content that can also be seen later.", "q1r": 4, "q2": "The problem description is clear \nand the solution approach is defined well and will be beneficial if properly implemented. A route to tracking progress is provided and a brief roadmap gives a rough timeframe for the proposal. The roadmap could however be more detailed.  Try defining some more quantifiable success metrics/KPIS, for example by defining the exact content you want to translate.", "q2r": 4, "assessor": "z_assessor_2257", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 1042, "q0": "I see the language barrier as being indeed a great impediment for anyone willing to learn, but cannot benefit from having the needed resources in a native language. For many of us, who either speak a second or third language (learned most probably in school) or for those who are native English speakers, the thought of not being able to learn something because you cannot understand the language is almost incomprehensible. And especially when it comes to the African continent, the barrier is even bigger, caused by the lack of internet coverage or financial resources that would enable gifted children to receive an education.\nAs such, a small project like this one, built by devoted and gifted developers willing not only to translate important resources like smart contracts programming, UTXO, but to also hold virtual meet-ups is laudable.\nFrom what I have seen on their channel and mentioned also in their risk section of the proposal, their reach is not very high. I would highly advise them to also start thinking and taking into account how to reach a wider audience, as I am sure there are so many more other people who would be interested in this subject and who are willing to learn, but haven’t yet found the right source.\nBut, this is more of a suggestion, so I will not be taking any point for it, but I do hope the team will find ways to market their efforts more.", "q0r": 5, "q1": "The plan the team presents is not very detailed, but I find it offers enough information and I am not left with any important questions unanswered. They aim on having live sessions 6 days a week for the 4 months following project funding. They intend to make each session available on their website and on Youtube, which I find to be a very good idea, as that makes it easy for anyone starting their learning journey to find the information they need.\nRegarding the budget, I find it a bit too compact, and even though the amount of money requested is not high, I still feel some additional descriptions would have been beneficial in reviewing the project’s feasibility. For example, I do not have the knowledge regarding salaries in the DRC, so it would have helped me get a better picture if I had the numbers for the estimated amount of hours of content creation, video editing or the number of trainers, etc.\nWhen it comes to the team members, I find the information provided is ample and combined with the Linkedin profile I have been able to acquire additional information that proves the skill and dedication of all project members.\nAs a small downside though, the questions regarding the team’s other proposals from either this fund or previous ones have not been addressed at all beyond the positive answer. Providing more context to these questions would have been beneficial, as maybe some of their proposals are inter-related and as such, they could sustain one another by providing further details.", "q1r": 4, "q2": "The team makes the progress of their project easily verifiable online through their uploading of the sessions on Youtube and in written format on their website. Since both sites are easily accessible, I see it as a great way of tracking the evolution. The team’s view of success is well described, but lacks any kind of metric, maybe setting even a modest goal would have helped in setting some expectations in regard to the project. However, I don’t see this as a great impediment and since the team plan on returning for future funding, the Cardano community will have a second chance at evaluating the project’s success.", "q2r": 4, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 606, "q0": "This proposal’s goal is to create (or expand) a community of developers in the Democratic Republic of Congo (DRC). The proposing team already has a community of around 100 participants in their Telegram channel, but they want to increase it, and with this community, run some workshops about blockchain in general and Cardano more specifically. Those will be weekly workshops, ran for 16 weeks, where Cardano developers will share their knowledge about the Plutus and the blockchain technology with the community. These workshops will be hosted in French and will focus the DRC community. Some of the team members will take place as hosts of these workshops, and external persons will be invited to participate as guests. One of the reasons of creating these workshops is that there’s not much information available about Cardano in French, and it’s more difficult for people who are not fluent in English to learn it - even though the language itself is written in English, lowering the entry barrier by translating content is still a good approach. The events will be recorded and made available on YouTube afterwards. This approach allows people who cannot watch in time to watch it later, or even get the file offline. In my opinion, this is a very good proposal in relation to impact, since they are aiming at including 300 new developers in their community. This would have a very good direct impact and has the chance of having an even higher indirect impact, with the people attending these workshops bringing more people to the community. Also, the impact of this proposal is not only limited to DRC, but other French-speaking countries and communities can benefit from it. Since it’s focused on the DRC community, and the team is based there, this proposal is very well aligned with the Challenge. Among the risks mentioned in the proposal, they say that it’s possible that some people wouldn’t be able to attend to the sessions due to limitation regarding internet, but as mentioned this can be worked around with the recording on YouTube and offline files. I’d say that there is also a risk of not having enough participation form the community. I’ve seen other similar projects trying to create something like that but having a lower community engagement than expected. To mitigate that, I’d try to open this for other French-speaking community outside DRC, but still in Africa. Overall, I believe this proposal’s impact might be very high.", "q0r": 5, "q1": "The execution of this proposal seems to be quite straightforward: plan the sessions, prepare the material, market the sessions, and finally run the session. The proposing team presented a timeline to execute the proposal starting the session on June/22. This scheduled is very tight, and impossible to achieve, because the results of Fund 9 voting will not be available before August/22 at least. Some proposers do this, and in some cases it’s just a matter of shifting the schedule to a few months ahead. Although, in this case the team has not considered some time to translate the content and to do the marketing before the sessions take place. I’d say these are important steps and at least 1 months should be considered to execute them before the sessions themselves start. The budget for this proposal is presented as lump sums for two different steps: step 1, comprising material creating, and step 2, the budget for running and editing the training sessions. Budget are, respectively, $3k and $6k. The issue is that since the budget is not broken down, it’s not possible to evaluate if it is appropriate. There is not information about how long the sessions are going to be, what’s the hourly rate that’s being paid for lecturers, editors, and there is also no budget for marketing. The latter might be ok if they do light marketing in their social media but would be better to have specific marketing budget to increase the reach and consequently the impact of the proposal. The budget overall seems to be appropriate though, even if the details are not provided. The team behind the proposal are part of the Uptodate Developers, a center for developers based on DRC, and a member from Canada that is part of Gimbalabs, one of the greatest developers initiatives in Project Catalyst. They are leaders of an already existing community, and even if the community is not big yet, this has a lot of value, since they are recognized in their field in their country. The links they provided to their LinkedIn pages make it possible to verify the information provided, and I also personally know one of them and know their work. I believe that this team is very capable of delivering this proposal successfully. The team has been working on previous proposals and has other proposal, which is other cases could raise a warning, but since this proposal might not take that much time to be completed, I don’t think it is an issue in this case.", "q1r": 4, "q2": "The way that the community can track this proposal is very simple: check the uploaded videos. The proposers will upload them to their YouTube channel and to their own webpage. They will also provide the content in text format. This is sufficient to track the progress of the proposal. The main success metric proposed to be tracked is the contribution of people who attend the sessions to the Cardano blockchain and ecosystem. Though, this is something very difficult to measure because it would mean keeping track of the activities of possibly hundreds of developers over the next months and years. Even though it’s a good metric, it’s really hard to track it. Possible metrics would be attendance of the sessions, number of views on YouTube, numbers on social media and number of developers who joined the Uptodate Developers community for example, with specific goals for each one of these KPIs. In general, the auditability of this proposal is good, and it won’t be difficult for the community to track the execution and also measure the success, if the KPIs I just mentioned are considered.", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 13807, "q0": "Creating a French Cardano Community is one of the missing elements in a strong outreaching strategy for Cardano Community throughout the African continent. Having weekly meetups in French and building social networks where french based projects can enhance and come alive will help french speakers entrepreneurs throughout the African continent engage in Cardano Catalyst and become proactive members of our community. Being language one of the biggest barriers in the outreaching African strategy, this proposal effectively addresses the challenge and will certainly transform the Cardano Catalyst African environment. It can also be a good way of getting closer to a wider and non-specialized audience and help Africa become a Cardano adoption leader.", "q0r": 5, "q1": "Plan presented is not consistent with a reasonable timeline. Months might be fixed in order to have a consistent plan. Another weak point of this presentation is the missing translation milestone. Team has delivered a plan where translation has already been done. Nevertheless, these weak points might be easily fixed in order to achieve their profitable challenge. Having a French Cardano Community in Africa deserves the effort. This team enjoys a wide experience in blockchain technology but is lacking previous experience or alliances within Cardano Catalyst. This might be another fixing point in order to successfully implement their proposal. ", "q1r": 3, "q2": "Weekly uploaded audiovisual content in their Youtube channel and available archives in their website might be the starting point of an auditability process. Nevertheless, effective and simple communication channels might be lacking within the Cardano Catalyst Community. This might be something this team can work out before being funded in order to engage fruitfully in our community and correctly share their hard work and have interesting feedback. This might be necessary for helping them achieve their goals and build a productive and enhancing french speaking African Cardano community.", "q2r": 3, "assessor": "z_assessor_3833", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14687, "q0": "Developers are primarily the reason the blockchain ecosystem keeps advancing. In the Cardano space,  developers represents the backbone of the its success. Therefore, considering the huge role of developers in the growth and success of the cardano ecosystem, this idea is a great initiative. The intention is to organise educational meetup events for developers in the French community. Due to the low number of developers from Africa, I anticipate that this project would be provide the foundation to scale up the growth of developers in the Cardano ecosystem and Africa. This project presents a clear and coherent solution in addressing the objective of grow Cardano grow Africa challenge. The proposed solution will provide the possibility of not only educating but also introducing developers to the opportunities and  possibilities of the cardano blockchain via the regular meet ups. The value proposition of this project to Cardano ecosystem is to ensurw adoption via the integration of the cardano blockchain into software applications in the French communities. This will eventually increase awareness creation and encourage more developers to make cardano the blockchain choice. Obviously, right from the onset the proposer points out its target audience and subsequently provides marketing strategy to attract developers across the country. However, I think the use of the team’s social media platform to attract developers may not reach a larger audience, especially considering the number of audience the team wants to attract. Therefore I wish the team adopts a more advance approach to attract developers. In my view, I suggest that the team adopt the use online Ads and the use of social media influencers. These strategy would provide a bigger reach to its target audience. Again what’s the long term strategy here? The proposer only indicates that the project would continue indefinitely. But I prefer a more strategic outlook that would make the project a national event. Therefore, I wish the team adopt incentive mechanisms to scale up this initiative and make it more sustainable in the long term .Other than that this is a great initiative. ", "q0r": 5, "q1": "On the basis of the information provided, it’s highly likely that the project would be implemented. The proponents presents a thorough plan of what the team seeks to do each month and a well constituted team of experts for the activities to be undertaken. With the information on the roadmap, I think the proponents have presented a clear and concise plan with details about what will be done. We know very well which activities will be happen for each month, however, I notice the absence of a marketing phase within the roadmap. In my view, there should be a conscious effort to attract audience across the country. As a result, I suggest the team include a plan for marketing. In respect of that, I expect that either a marketing expert is hired for this role or the team assigns such a role to any of the team members. To the team experience, I suggest the proposer consider assigning specific role to each team member, to ensure that each person is aware of where his or her expertise would be required during the project implementation phase. Apart from that, I think the teams profile is great, very comprehensive and detailed with all relevant links and documents presented to support the needed information of the team. Considering the vast level of experience of the team, I am convinced of their competence in implementing the project. On the budget, the proponent has not provided a clear information on the breakdown of the budget scheduled for this project. For instance, instead of providing an amount of $6000 for a total of 4 items, for the purpose of transparency, I wish the proponent gives us a breakdown of how much each item would cost. At least with a  specific amount for team members, so that we can tell how much each team member is paid for the 16 Saturdays of training scheduled in the roadmap. Therefore, I wish the team could provide budget allocation to each item on the budget. Again, should the team consider my suggestion  at the impact section on the appropriate marketing strategy for the project, then I also expect a subsequent budgetary allocation for marketing.", "q1r": 4, "q2": "It is quite possible for us to audit the process already based on the information made available on the activities that needs to be performed. The available of information on the YouTube page and website provides enough grounds to monitor the progress of the project. In my view, aside the provision of channels that would enable the community access the information on the progress of the project, there are no clearly stated KPIs here. For the purpose of this project, the proposer should think of KPIs such as, the number of developers the team intend to train and the number of views the team expect from their YouTube channel, these could guide the community in monitoring the progress of the project. These KPIs gives more understanding when used as metrics for the progress and success of the project. Even though monitoring the success of a project is very important , it is equally ideal that we know how to carry out this monitoring. In reference to that, the proponent provides a link regarding the channels to access information on the progress report. Aside that, I also consider it satisfactory the attempt to provide continuous update on their channels. This will help access these documents and videos by any individual who could not join any of the scheduled meetup at any time. In addition to the channels for accessibility to information on the progress of the project, does the team intends to provide update on the progress of the project to the community through the cardano media channels?", "q2r": 4, "assessor": "z_assessor_4093", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Organize weekly live code meetups on Blockchain technology to expand the French community in order to broaden our knowledge on the subject.", "experience": "Startup working in the development of Web, Mobile, and Desktop applications; with more than 18 developers, with a community of more than 100 developers (telegram channel)."}