{"id": 414464, "author": "afia", "title": "Catalyst Africa Town Hall (CATH)", "url": "https://cardano.ideascale.com/a/dtd/414464-48088", "category": 26600, "amount": 23800, "description": "Participating in Catalyst is difficult and quite challenging when you live in the Africa where English is not the main language for most descents.", "f6_no_assessments": 20, "f6_rating": 4.45, "videos": [], "media": [], "f6_assessments": [{"id": 438, "q0": "As a participator of various Town Halls, it is proven that they are one of the leading bridges to onboard the general public on how to start being involved in Cardano. By providing a safe space for locals to ask innocent questions act as a catalyst for individuals to continue explore and stalk. As a virtual space to congregate consistently -disregarding any notable event taking place- acts as a guarantee to that individual they can come back when they are ready. I myself is a product of a Town Hall. And so are 300 other individuals.\n\nOnboarding is never a straightforward ordeal, it takes time, it takes patience, it takes consistency. Keyword here should always be consistency. Consistently having Town Halls is the first step of onboarding, the next is filling these Town Halls with compelling events. This is where we as a community lay judgement to the Town Hall. Not their existence but what they are doing with it.\n\nThe failure of a Town Hall does not lie on the Town Hall itself but on it's individual members. This I hope could be addressed and understood in the future. Our capability of passing judgement on the actors and not the idea.", "q0r": 5, "q1": "The individuals stated are seasoned veterans of the Catalyst community who have been involved in numerous other successfully funded proposals. Felix, the initiator behind countless Town Halls and other Catalyst initiatives, has non-stop continuously weaved together various individuals across various communities to create solutions that have made numerous life's changed for the better. This is only one of the team members involved.\n\nThe plan presented is also a continuation of their successfully executed proposal, though if I may interject a minor critique, perhaps there should be a further emphasis or development on what programs are they planning to do to increase their engagement. For it is stated that they seek to increase the number of involvements.", "q1r": 5, "q2": "By providing clear achieved metrics, such as their growth of their social platforms and Town Hall participation one can now have a base value of their growth in future proposals. There are though intended goals to achieve that have not been reported but as a minimum -which is participation- they have achieve their initial intent. A word of advise to proposers, for future proposals to provide all achievements and growth for to my understanding there are metrics outside of this proposal that they have achieved but not reported. Such as their influence in inspiring other proposals from their community.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 16, "ne": 1, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 13014, "q0": "This Proposal presents sufficient information to adequately address the challenge. The challenge involves giving the African people the opportunity to be involved in blockchain activities and implicitly joining project catalyst, explicitly being active in the community. This proposal presents an avenue for free interactions between experienced people in the African community and new people. Not only new people but also community members seeking to be more involving. The is an avenue for presenting presenting proposal, There is an avenue for sharing ideas and other events that enhancing and strengthens the community. This scales to reach the community members at large inviting them to experience the African environment and helping the African community to be more involved.", "q0r": 5, "q1": "given the experience and the plan presented, it is highly this proposal will be implemented successfully. This proposal is a continuation of a previous fund and has seen success through their activities. The is a well broken budget representing the resources necessary for the success of the proposal. The timeline of the proposal is reasonable as it takes into account the relevant activities and allocated time to them. The risks of this proposal has been identifies and solutions to the best of my knowledge has been presented to better suite the solutions identified. The proposal presents a team with the right experience for the execution.", "q1r": 5, "q2": "The information provided to audit the progress and the success of the proposal is sufficient. The is  a clear roadmap of activities that shows when activities are done. The are clear channels presented in this proposal that suggests the transparency of the events as the community can track the events of the proposal. The channels include WADA website and their YouTube channel. The success metrics have been well thought out to represent the measurement of success of the proposal.", "q2r": 5, "assessor": "z_assessor_3535", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13007, "q0": "I believe that there is alignment between the problem and the challenge.\nThe proposal attempt to grow Africa and to also promote and create awareness of Cadano ecosystem in Africa, therefore, the proposal will bring an impact to Cadano ecosystem.\nThe goal of the project aligned with the challenge setting.\nIn the future, the people of Africa through education, seminars and Town Hall meeting as stated in the proposal, will understand everything under Cadano ecosystem and therefore there will an impact on the future.", "q0r": 4, "q1": "Thw past experience of the team players show's that, the project is realistic. The team players were among those people who took part of the fun 7 and 8 project and are also committed people who will help for this project to be executed.\nThe budget of the the project try to show the number of people that the project will need to carry out this successful and the activities and the amount needed.\nThe project is to carry out within three months.\nThe project tells how the Team always have their biweekly meetings and the languages that comes together and the time that's needed for this project to be successful.\nThe distress or challenges that will affects the proposal in executing this project is finding members with enthusiasm and willingness to collaborate, amd to keep them engaged for long period of time.", "q1r": 4, "q2": "The core planning committee meets every week to deliberate on activities and programs that will be discussed in the biweekly meetings. And the project particularly has a duration of three months starting from June 1st to August 31st 2022.\nThe problem of the proposal is clearly stated.\nThe proposal has efficiently addresses the problem as it states the experience that the team players has got.\nThe proposal stated clearly has it will use U_tube to make it known to people around.", "q2r": 4, "assessor": "z_assessor_3528", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12919, "q0": "The project identifies the problem of community organization in Africa, helping many peopleto promote Catalyst with a variety of languages. Catalyst Africa (CATH) is a community-oriented project (funded in Fund8 https://cardano.ideascale.com/c/idea/401713) the project aims to raise the community's active participation in the building of the Cardano Ecosystem. . The problem is consistent with the challenge. The problem solves two challenges: expanding the Cardano community and improving the knowledge and standard of living of Africans. This proposal represents the expansion of the project in F8, expanding the community in the future with a population of 1.4 billion people in Africa by 2022. Drive growth in both the quantity and quality of Cardano's developers in Africa. CATH holds biweekly meetings in four languages: English, Arabic, Swahili and French to educate about Cardano and encourage collaboration to address the continent's challenges using Blockchain technology. The solution is to have a big impact on the Cardano community of participants, who are disseminated their knowledge of Blockchain and Cardano. The CoreTeam team is in charge of planning weekly meetings to discuss activities and programs that will be discussed in meetings every two weeks. The solution is done on the group's Youtube channel, Twitter, Discord, Telegram. The solution has the right way to solve the problem, creating a strong community development for Cardano. Risks have occurred in F8 when there is not enough funding to maintain, difficulty in finding enthusiastic members who are competent and willing to cooperate. The solution for the project to continue to implement is to propose more funding is in line with the project in progress. We have an opinion, the implementation of the project needs to have spare funding and determine the appropriate time to implement, we can come up with solutions to implement the project in 6 months to 1 year to maintain operation, return to Catalyst when the project is finished.\nI rated: 5", "q0r": 5, "q1": "The project's implementation plan involves holding meetings every 2 weeks in 4 different languages. The project asks for additional funding to maintain for the next 3 months (in fund 8 asking for 9,800 USD, fund 9 asking for 23,800 USD). The goal of achieving F8 ears has had positive results, showing that the F8 implementation plan is on the right track, the proposal for additional funding in F9 is appropriate. The group consists of 7 participants, each of which is clearly assigned tasks. Their abilities and abilities are perfectly in line with the implementation of the plan (as evidenced on LinkedIn and Twiter accounts). The work performed at F8 of the members has had certain successes. The offered amount of $23,800 representing 4.76% of the funding for the F9 challenge is appropriate. The budget is broken down in detail according to the headings: Community manager, community events, treasury development and management, financial printing, marketing, and social networking all with specific numbers in the proposal. There were contingency costs for hosting the event with $2000 being suitable for implementation.\nI rated: 4", "q1r": 4, "q2": "The roadmap for implementing the project has been tracked from F8, the measurement indicators of the number of members on youtube channels, twitter, wed sites, etc. are appropriate. The number of interactions from the community, the number of meetings given is appropriate to monitor progress. The author has committed to having reports on progress and plans for activities. The project achieved concrete success in Fund8 through numbers such as developing its telegram team of 124 members and Discord with 30 members. Every two-week meetings have about 20 participants and will increase. The success of the project is determined, the maintenance and development of the community in Africa is the outstanding success of the project.\nI rated: 5", "q2r": 4, "assessor": "z_assessor_3514", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12840, "q0": "The project is amazing, with such an idea to train the African community and host seminars online is good and easy for everyone to get access to join if there is a meeting. But my concern is our network is not that stable for a good meeting, so I suggest we should also engage in physical training which will help to impact more knowledge to the community and how beneficial it will be for them. Again, bringing this to the community and Africans will help develop themselves and the country as a whole.", "q0r": 5, "q1": "Knowing the meetings will be held in different languages is a good point that will help various African countries or individuals as a whole to participate in the meetings and the project as well. The budget is outlined and the breakdown of how the money is going to be used on every item in the project is sensible to me. I am confident about the team behind this proposal. Since they have and still doing this program, I am 100% sure that they can successfully implement the solution provided to the identified problem.", "q1r": 5, "q2": "Tracking the project through all the social media platforms is ok. The team has done well to justify clearly what they will be measuring and how they intend to measure them as well as where the community can get access to the results of this activity. This will really help the community to set the expectations right and also do away with any time-wasting activities regarding the search of information for progress on this project.", "q2r": 5, "assessor": "z_assessor_3489", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11759, "q0": "Quite clearly, this is a good idea that meets the goal of the challenge. This proposal has not been funded at Fund 8 so it continues to be re-submitted at Fund 9. The solution proposed by the authors is, to maintain and develop Catalyst Africa Town Hall (CATH) – a project established in March, 2022, supporting the African community to participate in Cardano and Catalyst. At Fund 8, CATH has just been established. Therefore, when continuing to submit at Fund 9, the proposed content has changed, aiming to maintain and develop the CATH community to transfer knowledge in different languages. As for how it works, CATH currently holds meetings every two weeks, in four languages: English, Arabic, Swahili and French. The aim is, to educate the community about Cardano and encourage cooperation to solve the challenges of the continent using Blockchain technology. The proposed budget at Fund 9 increased 242% to $23800 (compared to $9,800 at Fund 8). It should also be added, CATH is a project to support and connect the Catalyst African community on Telegram, Discord...  After 3 months CATH was established, the group now has 124 members on Telegram, 30 members join the Discord server. CATH meetings are currently attracting 20 participants. Personally, I think this is a good initiative that can expand Cardano and Catalyst's presence in the Africa region. However, as someone who has spent a lot of time learning about the difficulty of blockchain access in Africa, I think there are a few risks the group hasn't really addressed. It is the cost of internet in Africa is very expensive. People in the area have to spend an average of 10%, even 20% of their monthly income on internet connection (https://www.cnn.com/2019/10/22/africa/internet-affordability-africa/index .html). This barrier will prevent the masses from accessing CATH. Not to mention, the quality of internet connection in the area is often unstable. Second, the risk that the price of ADA coin during the bear market period may affect the budget to fund the group's activities. So, in order to overcome these barriers and help the Cardano African community to function effectively, I suggest that the team consider combining online meetings with traditional meet-ups, broken down by region language area. To do this, CATH needs to have a set of standards, documents for admission, training, and guidance for members. These documents need to be synchronized and consistent before being translated into many languages for different geographical and cultural areas. In addition, a 10-20% contingency budget should also be taken into account. My personal experience in organizing community activities shows that the group should consider opening a small media campaign to promote CATH to increase its effectiveness in reaching potential members. Therefore, I rate 4 points on the impact of the proposal, deducting -1 point due to some risks that have not been mentioned.", "q0r": 4, "q1": "Regarding the feasibility of the solution, I think that the project is completely capable of successful implementation. In fact, CATH has been established and put into operation since March 2022. Currently, the number of members of CATH in Telegram that I observe is more than 100 people. In addition to the biweekly online events that the team offers, I need the authors to further explain how they will empower the community to rapidly grow new members. In addition, I did not find in this proposal the list of training topics, tutorials on Cardano and Catalyst that the team prepared. For example, how to become a PA/proposers, how to write a proposal in Catalyst… Project budget at Fund 9 increased nearly 2.5 times. Previously, the group only applied for funding for 3 categories of expenses: costs for planning meetings for CATH, document translation costs and general administrative costs. At Fund 9, the new cost goes to 50.4% of community management ($12000). In addition, new cost items were added such as: marketing and social networks, community events, internet subsidies for the community... This shows that, the team focused more budget on community managers and community marketing plans. However, I noticed that the team was missing a detailed explanation of the unit price * quantity of each item budget. The community needs to understand how the money will be used specifically. Regarding the team, I appreciate that the team has gathered many individuals with Catalyst experience to participate in CATH. However, the link to each member's profile is incomplete. 5/8 members of the team have no links to social media profiles. Therefore, it will be difficult for the community to fully verify the capacity and experience profile of each person in the group. I rate 3 points, deducted -1 point due to lack of unit price information in the budget section, -1 point due to lack of information of team members.", "q1r": 3, "q2": "In terms of auditability, the team has set goals to pursue in the future such as: number of CATH participants, number of new community members per (Telegram, Discord)... However, I find it very unfortunate because All of these success metrics are not tied to any specific target number. I asked the team to come up with specific KPIs. For example, the number of people participating in CATH each month/quarter is expected to be 30/90 people. Similarly, what is the minimum number of proposals submitted by CATH members to Fund 10? The community needs very specific metric commitments to be able to measure the success of the project throughout its implementation. Therefore, I rate 4 points in the auditability of the project, after deducting -1 point for lack of KPIs.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 10, "ne": 5, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11108, "q0": "This proposal highlights the language barrier as one of the main problems that hinder to Participate in Catalyst and is quite challenging, because it is explained in the African area that English is not the primary language for most of the descendants. Challenge: Increase Participation in Catalyst in local languages. The solution is that they make a community-based project that emerged through involvement in Project Catalyst with the aim of increasing the community that proactively participates in building the Cardano Ecosystem. The proposal is a strong reason for its ability to help expand Cardano especially Catalyst to Africa. selected and the previous proposal has been financed in fund 8 and this proposal continues activities in the fund 8 proposal\n\n", "q0r": 5, "q1": "This project involves developers at Cardano Community (Marlowee Pioneer), Community Advisors at Fund 7, Co-founder of Catalyst Swarm, and teachers who collaborate on this project. The team is clearly explained in the proposal with appropriate links to their experience. The team has the advantage of being able to master various languages ​​such as English, a regional language in Africa, which will later be needed for translation. The proposal contains a clear description of the resources needed to realize this project. The team has calculated that this is an expense over a 3 month period.\n\n", "q1r": 4, "q2": "This proposal has detailed well what to expect at each point in time, from the initial launch of their website to the key processes of their targeting such as Biweekly Townhall videos published\nRecords of weekly coordination meetings to report on progress and plan for activities\nManagement of our social platforms per day (Twitter, Discord, Telegram, etc) . The KPIs outlined not only include what this team will prepare and create, but even go so far as to mention the involvement of community members from each channel such as twitter, discord, and youtube. I would measure this project as highly auditable, largely because of the monthly breakdown of what to expect", "q2r": 5, "assessor": "z_assessor_3220", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10558, "q0": "“Catalyst Africa Town Hall (CATH)” is a good idea and fits the challenge “Grow Africa, Grow Cardano”. This proposal raises an important issue: \"Participating in Catalyst is difficult and quite challenging when you live in Africa where English is not the main language for most descents\". CATH is a community-driven project that emerged through participation in Project Catalyst. It aims to enhance active participation in the building of the Cardano ecosystem. This implementation will encourage and empower community members to engage in activities that create and sustain an inclusive community to promote African community engagement. The solution proposed by the proponent I found quite reasonable and solved the problems of the challenge, helping to keep the CATH community growing, transferring knowledge in different languages and helping to break down barriers language. To successfully implement the project, the proponent has also foreseen the risks they face, which isnot being able to sustain all the activities that we perform.  Finding members with enthusiasm and willingness to collaborate, and to keep them engaged for the long term is a big challenge for the team. However, the proponent has also actively sought solutions to overcome this difficulty and minimize this risk. With this thorough preparation, I think the team will always be ready to cope well with the difficulties and challenges ahead.", "q0r": 5, "q1": "This proposal has identified the start time of the project implementation but has not provided information on the end time. In my opinion, this timeline should be specifically determined to avoid the case that the roadmap is delayed for too long, affecting the overall results of the whole project. The proponent has planned quite detailed that CATH holds meetings every 2 weeks in English, Arabic, Swahili, and French to educate Cardano and encourage cooperation to solve the problem solve challenges using Blockchain technology. The core planning committee meets weekly to consider activities and programs to be discussed in biweekly meetings. The content and the work to be done I find quite clear, however, I have a question in the meetings, who are the participants, after the meetings and discussions, the organizers and planners Who are the implementation and implementation plan? If possible, the proponent adds more information so that everyone can grasp the information. Regarding the budget, the proponent outlined the allocation plan and the purpose of using the budget as quite detailed and reasonable. However, I have a question as to whether this cost is divided equally among the members or how it will be paid in proportion, in my opinion, this budget should be paid according to the ability and capacity of each person. people, such as community management costs instead of 4 members x 3 months = $12,000, this amount of $12,000 will be divided according to each person's ability and work completion results, not fixed equally divided among members. This will help increase creativity and efficiency in the working process of each individual. Regarding the team involved, the proponent presented quite detailed and complete information about the project participants mentioned such as full name, title, working experience, and professional qualifications, in addition to, In addition, the proposer also attaches LinkedIn so that people can easily access and check the information. I think this is a positive point of the proposal.", "q1r": 4, "q2": "To measure the progress and success of the project, the proponent has come up with the required indicators and KPIs. However, I found that in the KPI section, the proponent should add specific metrics, such as how many members participate, how many messages from the community in each channel, the number of visits specific likes and shares, etc., by showing the results through specific numbers, it will help people easily assess the completion rate of the project, increasing the transparency of the project. The success of the project is demonstrated by the fact that in the last three months the team has grown its telegram group from XNUMX members to +124 and created a Discord server with +30 members. Their biweekly meetings have around +20 people participating and growing at each meeting and they plan to increase this. It can be seen that this content is presented in detail, in my opinion, the auditability of this project is relatively high. This is a follow-up to the proposal that was sponsored at Fund 8, which submitted a link for people to check the information. I think with the experience and resources from the proposal at the previous funds will help this proposal have more advantages, and increase the possibility of being approved and funded.\n", "q2r": 4, "assessor": "z_assessor_3190", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 9874, "q0": "The proposal fits the challenge setting because it seeks to enhance the community by bringing new participants and ideas to grow the community as well. This is going to be done mainly through engagement in the project catalyst. This proposal seeks to achieve its success by creating discord servers and telegram accounts which will serve as a means of collaboration for people who believe and have interest in Africa to discuss issues and synthesize efforts to grow the Africa community on cardano.\nThe proposal seeks to bring new ideas from participants which will also contribute to the growth of the community\nAs well as boost engagement of the overall African. as much as the proposal seeks to merge new ideas and participants it also creates an atmosphere to maintain them and bring them more closer. This is going to be done by providing incentives and initiating a management community plan. The management community aims at creating communication hubs to feed them with needed information and to build connection and relationships around projects and writers.\nAlso communication events are have also been put in place to help achieve this. This will be done by organizing events like workshop, sessions to allow the community to meet and connect with each other as well as share ideas and projects to the community. A marketing and content management plan is also in place to spread the word about cardano and to ensure a wider participation and awareness of our action to the Community.", "q0r": 5, "q1": "The plan of the proposal is to organize biweekly meetings in four languages which are English, Arabic, Swahili and French to educate and give more enlightenment about Cardano and encourage collaborations to solve challenges using Blockchain technology. There will a lot of activities for every meeting and there's a specific timeline of 3 months. There is also a budget breakdown for which renumeration is allocated for each activity to be take place. Thus the community managers, community events, development of a treasury and its management\ndocumentation marketing & social networks. Also the personnel working on this proposal have gained immerse experience  from the catalyst community and cardano at large. ", "q1r": 5, "q2": "The success of the proposal will be audited through various progress indicators and their outcomes.  Some outcomes of the indicators like number of community members on each of the channels used channels, number of messages from the community in each of these channels, number of attendees to the scheduled town hall meetings, creation of more social channels which includes website, YouTube, twitter and number of likes and re-shares of the content in each of the  channels. This means are sufficient to monitor the growth of the African community.", "q2r": 5, "assessor": "z_assessor_3123", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9760, "q0": "The problem statement is linked to the challenge: the adoption of Cardano by and in the continent of Africa. To tackle the challenges that prevents African from being a Cardano adoption leader rather than a follower, there is the need to enhance the community, which proactively participates in building the Cardano Ecosystem. \nSustaining the activities performed in the community is a major risk to the growth of the Ecosystem in Africa as a whole. Currently, lead members perform coordination of these activities as a time donation. Finding members with enthusiasm and willingness to collaborate, and to keep them engaged for a long period is a huge challenge.  \nCatalyst Africa Town Hall (CATH) proposal intends to mitigate these risks by obtaining the requested resources needed to be able to provide fair economic incentives to the key contributors or lead members. This will help grow the an open and warm environment where people from all over the world with interest in developing Africa can participate in Cardano related activities. This is planned to be achieved through a detailed three months plan through community management, community events, documentation, marketing and content management. \nCatalyst Africa Town Hall (CATH) aims to sustain, grow and evolve a vibrant Africa community that is engaged and actively growing its contributions to the Cardano ecosystem.\n", "q0r": 4, "q1": "The proposal provides evidence of relevant skills and experiences needed to implement the project. Given the successful implementation of the Fund 8: Catalyst Africa Town Hall.\nThe information about the implementation of the project described in the proposal are individuals working or are already performing tasks for the Wada community hence bringing on board experiences in the Cardano/Catalyst system. \nThe budget is clearly outlined and broken down into identifiable deliverables; community managers, community events, development of a treasury and its management, documentation, marketing and social networks. It offers a realistic timetable to complete the work in three months for sustaining, growing and evolving a vibrant Africa community that is engaged and actively growing its contributions to the Cardano ecosystem and the nurturing of new localized communities that are born under the incentive.\n", "q1r": 4, "q2": "There is clarity in the description of the issue of sustaining the activities performed in the Cardano community is a major risk to the growth of the Ecosystem in Africa as a whole. Finding members with enthusiasm and willingness to coordinate collaborate, and to keep them engaged for a long period is a huge challenge as at present, lead members carry out these activities at no cost.  \nThe road map of providing fair economic incentives to the key contributors or lead members is well laid down. The metrics chosen i.e. number of community members on each of their channels, number of messages from the community in each of their channels, number of Attendees to their Town Hall, creation of more social channels - website, youtube, twitter and others and the number of likes and re-shares of their content in each of our channels will be good indicators for evaluating the success and impact sustaining dedicated community leads. Thus, the increase in number of people who will sign onto Cardano/Catalyst community in Africa. This will help sustain, grow and evolve a vibrant Africa community that is engaged and actively growing its contributions to the Cardano ecosystem. \n\n", "q2r": 4, "assessor": "z_assessor_3093", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7831, "q0": "O think the Proposer wants to the issue of English not being the only language in African and therefore a hindrance to participate in Catalyst. \nAddressing the challenge, the Proposer felt the need for the emergency of CATH as a community driven proposal or project with the aim to enhance the community to proactively participate in building the Cardano Ecosystem.  Looking at the Proposal, \n the CATH is built on the 4 pillars which are, Community Management,  Community Events,  Documentation and lastly, Marketing and Content Management  with a goal of spreading Cardano in Africa. The four pillars listed above denounced the main goof CATH which is to generate an open and warm environment with people from various parts of the world and with different languages with a common interest in developing and participating in Cardano related activities. \nMain challenge that may arise is finding dedicated members. Mitigated measure to this challenge is provided. \nHaving gone through the presentation,  I believe the proposal addresses the Challenge. ", "q0r": 5, "q1": "Proposal outline and time frame if 3months is well elaborated and \nclearly stated. \nI will therefore say the proposal will be implemented successfully.\nTotal budget of $23,800 for 7 dedicated member team for the execution if the project is presented with details for analysis.\nThese are the 7 member solidly behind the success of the project, Felixstowe Weber,  Afia Owusu, Daniel David Lezu, Richmond,  Paul Mupenda,Baba Elliot and Emelia Sarfo. They have indepth knowledge and experience in Cardano and professional areas.\nI will therefore say,  the proposal will be implemented successfully. \n\n", "q1r": 5, "q2": "Key progress indicators as well as KPI are stated clearly. \nAgain, what we should look for in terms of sucess of the proposal are stated, more members participating in the bi-weekly meeting,  telegram membership increases, etc.\nThe above factors and indicators show that, the proposal is highly auditable. ", "q2r": 5, "assessor": "z_assessor_2927", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7624, "q0": "The problem described by the challenge in this proposal is closely aligned with the challenge. This is because the proposal seeks to bring individuals who are not manly English speakers under a specific platform where they can interact and share ideas about project Catalyst and Cardano to broaden and strengthen their knowledge through teaching and learning to break the gap that exists amongst them. The theme of their proposal is to use English, Arabic, Swahili, and French. \nThe project definitely highlights the ways it will add value to the Cardano community at large through organizing biweekly meetings, facilitated by trainers who are native speakers of these languages.  ", "q0r": 4, "q1": "I firmly believe that given the level of experience of the team, and this is not their first time organizing such a project in the past they will wholeheartedly be able to carry out this project. This is because language is an essential aspect of every ecosystem and Cardano is no exception. Real development, come from an innate need to accept change and progress in order to grow the community.  The budget is feasible enough to cater to the needs of the proposal considering the number of trainers, the pool of participants, and the timeframe of the sessions which happens online. The project is going on for three months which is more than adequate time to bring new people into the ecosystem and show them the ropes of what they can learn from it to become experts.  ", "q1r": 5, "q2": "They have shown a clear path to report their progress and update the community on their work. This is because they have set up a dedicated telegram channel for having their discussions, and meetings are followed by not less than 20 plus people on zoom and other mediums they use. This means more people will be coming on board as they kick-start the second part of the training. With the freebies to be handed over to participants that means more people will come on board as well.\nAlso, they already have a Discord server with +30 members which will keep rising, as the project is going on. I want to see how these numbers translate into the activities of project Catalyst. Currently looking at the progress of the project one can see that they have made strides in how to communicate back to the community through showing these numbers on telegram, Discord, and Zoom, but beyond that, we want to see more work on other channels in future.", "q2r": 4, "assessor": "z_assessor_2908", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6778, "q0": "I found the proposed solution in addressing the challenge to be encouraging. The goal of the proposal is clear. It identifies a problem within the challenge. The proposal is able to address some future cchallenges. However, those identified future risks appears to be ones that were encountered during Fund8 implementation. The proposal failed to explain in detail how it will solve/tackle the main risk that could prevent it from delivering the project successfully. I did not see any clear plans for the project's future sustainability.\n", "q0r": 4, "q1": "Aside not seeing the proposal's ability to articulate plans for future sustainability, I found the proposal as one which is likely to be successfully implemented when seeded. With respect to current date (month), the project duration stated by the proposer (June 1st to August 31st 2022) stands not to be achievable since we are already in July 2022. May be revised extension will be considered to commensurate the budget presented. I will suggest a reduction of thr monthly pay-out to members to $650 since their formal engagements with participants is biweekly. Also, the proposal even though stated members and plans for implementation, it failed to state clearly what activity or duty will be handled by who.\n", "q1r": 4, "q2": "The information provided is somehow sufficient to fully audit the progress of the first three (3) month stage of the proposal when funded. However, I could not locate any stated accessible public channel for delivering regular updates to the community for auditing purposes. Hence, the \"Project Catalyst Monthly Reporting Sheet is recommended.\n", "q2r": 4, "assessor": "z_assessor_2830", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6580, "q0": "This project is one of the best adapted to the challenge. The team has worked throughout these months to spread the Cardano message throughout Africa.\n\nTheir objectives are also adjusted to the KPIs that are detailed in the challenge. To support my argument I must simply quote a sentence from the wording, because they want to continue building \"a platform where people who believe and have interest in Africa could come together and collaborate. The platform served as an avenue for discussions on issues pertaining to Africa and also to consolidate efforts for the growth of the Africa community on Cardano\".\n", "q0r": 5, "q1": "As I said, the team has been working for several months to build a community in Africa. Although its growth has slowed down, specific tools could help its continued growth, such as better use of social networks and having a weekly town hall instead of fortnightly.\n", "q1r": 5, "q2": "The proposed KPIs are quite auditable and very similar to the rest of the world's communities. Therefore, guaranteeing follow-up and transparency is quite feasible. The project is supported by Swarm, experts in creating independent and functional, fully auditable and transparent communities that add a lot of value to our ecosystem.", "q2r": 5, "assessor": "z_assessor_2822", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 4341, "q0": "This proposal is by no means new to PA and Catalyst. It comes from people dedicated to Cardano. They want to bring good to the community through the Cardano blockchain. The proposal, of course, tackles the challenge posed by doing good for Africa and good for Cardano. The issue that needs to be addressed very clearly is support for all interested in Cardano and Catalyst through a center called Catalyst Africa Town Hall (CATH). This is a common model in other continents such as Asia (Eastern Town Hall) and it has been very helpful to the community. Therefore, I do not doubt that it increases the value of the Cardano ecosystem. The impact is huge and it is entirely possible to continue to scale to address future challenges. It's welcome to the team that you've decided to do this in a place that is in dire need of investment and development. Cardano, Catalyst is like a mission to make it happen. I believe the proposal will be successfully implemented and Africa will become a continent free of poverty and Cardano's print development will expand.", "q0r": 5, "q1": "Reading the proposal, I was delighted that it was developed by a team of experienced and professional members. Those are the people who were quite familiar with Catalyst in the previous Funds. The identity of the proposal at Fund 9 continues to be made public through social networking sites. I have absolutely no doubts about the feasibility of the proposal. However, I also suggest that the team can add some necessary documents for readers to refer to, which is also a way to increase the feasibility of the proposal. Document implementation is vital to a high-impact and non-novel proposal on Catalyst. The budget is broken down into very reasonable items. I understand that in doing this, the team consulted and filtered the good things from previous similar proposals to create the CATH proposal. Therefore, the plan and how to implement it are also clear. I also appreciate the implementation resources, especially the human resources, where qualified professional members are gathered to write and support this proposal. However, I still have a comment on the technical aspect, can the team be more specific about this suggestion when applied in practice, what is your use of technology? You can be very specific to increase feasibility for the community. I know you have mentioned the risk that maintaining the quality of all the jobs in the CATH requires can get quality from that it requires the recruitment of input personnel to be filtered, and conducted strictly. tight. After recruiting, you will take measures to retain quality human resources. I would like to give my opinion on keeping the members attached for a long time. It is a team that can build a reward system, encourage encouragement for members who make positive contributions, and bring benefits to the organization. For example pay bonuses, incentives with ADA... Just my opinion. I vote 4 stars.", "q1r": 4, "q2": "Circuit roadmap, clear milestones. Proposal to do the same professionally as done in other Town Halls. This is a great proposition. I have no opinion on KPIs. I have no opinion on the problem described because it is very clear and easy to understand and the solution is attached. With what you've written in the proposal, it can be publicly auditable to the community. I only have one small question, can the team explain why this project has a duration of about 3 months (starting from June 1 to August 31, 2022)? So, after 3 months, you continue to submit funding proposals? Is this the same as the other Town Hall implementation deadlines? I have always wished, that great ideas like this could be held regularly and last year after year without interruption. Organizing for 3 months may have an element of risk of interruption, choosing a program that is very beneficial to the African community and the Cardano ecosystem. Can the team think more about this, and maybe find a way to fix it?", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 4139, "q0": "It surely requires a strong and diverse community to allow the wide-scale of Cardano in the African region. One major problem I have noticed with most human beings is that if you show them the way and refuse to guide them through it, they easily go astray and eventually fall off the hook. This is a critical challenge that affects the impact of whatever initiative started by a community just like the Cardano community. It can be said on record that a lot of people who joined the Cardano train some time back, probably from the African region, fell off due to the language barrier. This has indeed affected the Cardano impact indirectly. I see the solution to problems like what I have described above in this proposal. I love the fact that the CATH is not focused only on English but rather has diversity and a variety of languages like Swahili, Arabic, etc for participants to choose from and also seeks to be around through its community managers to further guide those who are shown the way until they're well acquainted with the ecosystem. At least, I can tell from this initiative that a certain percentage of people who join the train and fall off eventually are going to be sustained by this project. Really good initiative it is.\n\nFrom the proposal, it can be confirmed that the proposer has articulated exactly how it is going to add value to the community. This is evident in the proposal description where they seek to host biweekly town halls to engage folks who are interested in the development of the African region with regard to the Cardano community. I have attended this town hall before and I can attest to the fact that it really adds value to the Cardano ecosystem. It's such a welcoming community with great guidelines.\n\nThe metrics of this proposal align with most of the KPIs allocated in the challenge set. Measuring the number of attendees to the town halls of course would help the challenge to realize its return on intention. As the proposer clearly articulates that it will rely on Catalyst for some time till the project become self-sustaining, it shows how fair the proposer is to the community. With this being said, we can surely expect a proposal like this in subsequent funds to come from the proposing team. However, it would have been awesome if the team could provide details of what their self-sustaining plan is. Through exposure, they could have gotten ideas from the community as to whether it would be feasible or not.\n\nI strongly agree with the proposals' impact.", "q0r": 5, "q1": "For the team needed for a successful implementation of the project, the proposer has down well to identify team members needed. However, I am unable to confirm for all the team members whether or not they have the requisite experience. The reason is that details and links have been provided for some team members whereas others don't have any links and details. This makes it hard for me to believe the described team on the proposal as one that can deliver successfully.\n\nA budget of 23,800 USD being requested by this proposal looks feasible with respect to its breakdown. The proposer has done well to provide us with details on exactly how the funds are going to be spent and on what purpose it is scheduled to serve. \n\nFrom June 1st to August 31st, the team has done well to inform the community on how they plan to go about project implementation. The proposing team has indicated that they plan to host the town hall on a bi-weekly basis and prior to that, the organizing team would be meeting to discuss activities that would aid the successful implementation of the project. I think the team would have done a great job by providing details on what activities they plan to deliberate on in their meetings prior to the town hall. This would give the community a sense of what to expect in every town hall and further encourage participation.\n\nThe risk of losing contributors with regard to lack of incentives is indeed a risk that could go a long way to affect the project. I will applaud the team for being able to identify and provide a great mitigation approach for this risk.\n\nEven though I am not 100% convinced about the team, I do agree that the proposed plans and budget seems feasible to deliver.", "q1r": 4, "q2": "The proposal identifies a clear problem that needs to be solved in the challenge. The problem of Cardano adoption in the African region remains a problem until further education has reached the uneducated. The scope of this project is clear through its metrics that it is going to educate participants about Cardano. With this, I see that the problem is being addressed effectively.\n\nIt's unfortunate that the proposing team refuses to state clearly what public channel the community can use to track the progress of the project. It is mentioned that Telegram and Discord channels have been created since the inception of the project but unfortunately links to these channels were not provided and thus making it hard for a community member who has no access to these platforms to track the project. However, I am thinking that the community can track the project through the YouTube link even though the proposer refused to state it emphatically. This prevents me from strongly agreeing that this proposal provides sufficient information on how to track the progress of the project and hence my score is 4.", "q2r": 4, "assessor": "z_assessor_2518", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3432, "q0": "This proposal is a continuation of a funded one in F8, to keep running the Afica town halls (CATH). As it is widely well-kown in Cardano community, the town halls are na effective manner to provide updates, support and have fruitful dicussion, in many geographical leves. (Continue to) having one is essential to keep this engagement in the continent, specially considering its key role for Cardano and the obstacle related to langauge, which restricts the access to other conents, pointed out in the problem statement. Consirgint it all, it's possible to say that proposal is aligned with challenge, potentially addressing challenge kpis of \"Number of proposals addressing the fundamental issues preventing Cardano adoption in Africa\" and \"Number of new Africa-based Catalyst members (proposers, voters, CAs)\".\nAs for the proposal itself, it does a nice job presenting how it is strcutured in terms of activities that contribuitors provide. In order to make the value of it even clearer. I'd bring here what were the results so far, considering the time it is active (March to May), and potentially the feedback from the attendees. It would also be nice to see a strategy on how they intend to expand and reacher new people, at the same time that ones already engaged keep on board.", "q0r": 5, "q1": "There's a 3-month plan in place, based on the frequency the TH occurs and it included planning to get the TH origanized. As this more a continuation of a recurrent set og meeting, it makes sense no to have a regular timeline. Budget breadown is sensible, divided into the 5 main activities and includes a contigency line, which is a good practise.\nRegarding the team, there are 8 people committed plus an advisor from Swarm. There are good descriptions on each team member which include their roles, experience and linkeding links, all with relevant experience in Cardano and Catalyst. Considering also that this very same already executed this project for 3 months, there doesnt seem to have any issue on feasbility.", "q1r": 5, "q2": "Proposer is suggesting good kpis to assess project success. However, specially considering the TH were held for 3 months, they could have some targets (which could be based on a growth % in relation to past fund). Other metrics that could be included is the number of new members onboarded, number of new peopple propsing in Catalyst because of the TH and even some way to measure feedback on the these sessions, that could be done via a survey after each meeting.", "q2r": 4, "assessor": "z_assessor_2461", "no_vca": 12, "ne": 0, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 3375, "q0": "Host town halls every 2 weeks during the project implementation will for sure attract people by curiosity but also those who want to get trained.\nTownhalls may take place local, but the idea and  management of it, may inspire other people in others regions or countries to learn from.\nThis proposal helps to keep the CATH community growing, transferring knowledge in our various languages and helping onboard projects into Cardano", "q0r": 5, "q1": "Outreach to new people by putting a place a Hub, with target group being: Cardano Foundation Ambassadors, Catalyst School & CATH Members, proposers Assessor (PAs) & Veteran PAs, Challenge Team members, IT & Software Engineering, Blockchain developers, Plutus/Atala Prism Pioneers, Educators and proposers, will help share information to those one's and through them to other community members.\nCardano hubs are very useful for people with interest to the Cardano ecosystem, can be scaled to different places geographically and even virtally.\nThe entire budget is allocate to the pay of employees, which is normal, especially for such initiative that needs human presence, so I was wondering where will this town hall be organized, since this needs a venue.", "q1r": 5, "q2": "The KPI's are clear and the show important indicators used to show the results. The dates of delivery are mentioned.\nOn each risks raised, there's a plan of mitigation.\nI would rate this proposal with a 5 star\n", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 13808, "q0": "CATH platform is an already funded and successful project that looks for further funding in order to monthly reward their key contributors. The platform has managed to gather people of a variety of backgrounds that are interested in African development and the Cardano Catalyst project. Town Halls held discussion of ideas and different sorts of African issues. This kind of project is fundamental in order to enhance the African Cardano community, as English might be a language barrier for the wide audience and internet connections and hardware are often scarce. Monetary reward for active participants of the African Cardano Community is the key element for having this spark turn into a big fire. CATH is aiming to build popular community events, clear and digestible documentation and designing marketing strategies also. Funding this proposal is totally lined with Cardano Catalyst challenges and goals. Having monthly rewards for seven active members will effectively address the challenge.", "q0r": 5, "q1": "Timeline and key milestones aren’t deeply designed and presented. Although the team is already working and can deliver consistent information on their highly successfully implemented proposals, they haven’t presented a detailed plan of what they are actually planning to do with concrete milestones. The proposal aims to be a monthly reward for already active members and budget breakdown is clear but a more detailed key milestone plan might be useful for other members of the Cardano Community that are just getting to know their work. Even Though, considering their experience and their success in previous already funded proposals, it is to be said that this proposal is highly likely to be successfully implemented. ", "q1r": 4, "q2": "The auditability strategy of this team’s proposal is great. Publishing biweekly Town Hall’s audiovisual content, records on biweekly meetings and social media management per day are sufficient and enough to audit the progress and the success of the proposal. As this team has already been funded in previous funds, they know Cardano Catalyst dynamics and rules. They have communication channels already successfully put up and auditability will be efficient and proactive. Telegram and Discord member increasing is a fine milestone but it might be also interesting to have Cardano African newcomers, and having them presenting their own creative proposals. \n", "q2r": 4, "assessor": "z_assessor_3833", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14954, "q0": "i think this proposal has more to offer than the few points outlined. though the proposal has outlined the challenges, there are to it than just listed. The scope is very broad and it needs a lot of research to satisfy certain angles. Example, many people out there who happens to establish business in Africa as i means of investment but were let down by family and friends through mismanagement and negligence and their businesses were dragged down in the mud may not wont deal ever again in African investment. Secondly, these categories of people wouldn't advice anyone or friends to do business or invest in Africa because most of them have lost huge sums of money in the process. The proposal must look into how to convince and persuade with strong bail out and security as it sells the idea wanting investors to the shores of Africa. The proposal must look into all these areas and address clearly with evidence challenges in this manner.", "q0r": 3, "q1": "The implementation may or may not be successful. I think the proposal seems to address only the positive side of the challenge which from that angle looks promising and feels like they nit a milestone but alone is not enough in my opinion and not impact strongly as recommended or will suffer a set back over time when realities like what has been highlighted in the first assessment evolve, looking into the long term way. On the other hand if these challenges are anticipated and solutions or the right technical approach are put in place, then in the long term there is hope. ", "q1r": 3, "q2": "Looking into the auditability approach, the information tools put together is measurable. It can be monitored and future data base or subsequently can be assessed without any difficulty. Only that the other social media platform the proposal seeks to implement on a later date must be done as soon as possible without delay because these media platforms have the strong waves to reach out to millions of people all over the world. ", "q2r": 4, "assessor": "z_assessor_4116", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "The CATH is a community-driven project which emerged through engagement in Project Catalyst. It aims to enhance the community which proactively participates in building the Cardano Ecosystem. ", "experience": "Our key members are Cardano Foundation Ambassadors, Catalyst School & CATH Members, Community Advisors (CAs) & Veteran CAs, Challenge Team members, IT & Software Engineering, Blockchain developers, Plutus/Atala Prism Pioneers, Educators and proposers."}