{"id": 414806, "author": "manfo2021", "title": "SSI from ancestral African Lenses", "url": "https://cardano.ideascale.com/a/dtd/414806-48088", "category": 26600, "amount": 25000, "description": "The notion of Identity is deeply ingrained in the initiatory journey of ancestral Africa communities. No solutions out there come close to incorporating the African perspective on this notion.", "f6_no_assessments": 10, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 610, "q0": "The concept of identity is different from culture to another, and this is the main topic addressed in this proposal. As the concept of Self Sovereign Identity (SSI) is currently being developed and it is deeply related to the concept of Decentralized Identifiers (DIDs). This proposal discusses the difference between the western concept of identity, considering the individual as a completely separate being from everything else, and opposes this to the concept that was developed by ancestral African cultures, where the individual is part of the whole and their life is deeply connected to the environment around them. The team is proposing the create a series of sessions to discuss this ancestral concept of identity, and how it could be incorporated to the recent developments of SSI and DIDs. This would occur every 2 weeks during the breakout rooms of the African Town Hall. They would bring the community and subject matter experts (SMEs), from Kimuntu, for example, to discuss this topic and figure a way to incorporate it into SSI. Considering the different perspectives in relation to the development of new technologies and concepts is very inclusive and, in my opinion, the results are better overall. The goal of this proposal is not to discuss the technical details of DIDs, for example, but to have a collective brainstorm and use this as input for future developments of SSI. This proposal differentiates itself from all others I’ve seen, in a positive way because it brings the philosophical and cultural aspects to the center of the discussions, and many times the focus is only on the technical side. Also, the proposal fits very well the Grow Africa, Grow Cardano challenge, since its goal is to incorporate elements of the ancient African culture into the development of SSI, and it will be executed by an African team, focusing mainly of the African community as well. The main risk mapped by the team is to not be able to challenge the status-quo of the western way of thinking about identity. The American and European way of perceiving identity has expanded to Africa and most of the population has, unconsciously, adopted it. I see this as a real challenge, but I don’t believe the objective of the proposal will be to convince a large group of people, but to find at least a small group that would be willing to provide their perspective and to work together to define the next steps to incorporate the ancestral African concepts about identity into the development of SSI.", "q0r": 4, "q1": "The execution of this proposal will be done in 3 phases, ran in parallel. The first phase will last for 6 months and will focus on creating and strengthening the partnerships with subject matter experts. The second phase will also take 6 months and will focus on hosting the conferences, debates, and discussion about the topic of SSI and ancestral African concept of identity. The last one will last for 6 months as well and will focus on using the knowledge and results obtained from phase 2 to work on an MVP for a DID solution that takes into consideration the context of Africa and its ancient culture. The information provided is a high-level planning for the execution of the proposal, but I’d like to know more details about some of its steps. It’s mentioned that some sessions will occur in the breakout rooms of African Town Hall every two week, what means that a total of 12 sessions will take place. In the budget part, there are some costs related to travel and logistics, besides equipment, what indicates that some in person events will also take place, but this was not mentioned previously in the proposal. A total of 12 appearances of SMEs are also foreseen, what means that probably all sessions will have the presence of a SMEs they are attending only to Town Halls. During phase 3, and MVP DID solution will be produced, but it is not clear if it will be developed and or just conceptualized, and they don’t mention which technology will be used (in case of implementation). The budget of the proposal is $25k, and it includes costs related to SMEs, logistics, support team, translation, and equipment. As mentioned previously, it was not clear until this moment that local sessions would take place, and the budget allocated for live translation seems quite higher than market rates. The cost per appearance of a SME seems quite high: $625. I believe the budget will be enough to execute the proposal, but from my perspective, it is actually more than necessary to do so. The team behind the proposal is part of WADA. They are well known in the community and have contributed a lot to the development of the Cardano community in Africa. They are very capable, and I have no doubt they would execute this proposal successfully. Also, links are provided to check Manfo’s and Megan’s background, and information about their accomplishments so far and the WADA Hub in Cameroon as well. The team is currently working on other funded proposals and has other proposals submitted in this Fund, but they have been successfully delivering their ", "q1r": 3, "q2": "The proposed KPIs to track the project progress are good, but some of them, like the number of attendees are actually measures of the success of the proposal. To keep track of the progress, it might be enough to track, as mentioned, the bi-weekly gatherings during Town Halls and to see them on YouTube. They have added some KPIs to track the conceptual evolution of a SSI that takes into consideration the ancestral African concept of identity, to see how it evolved over time based on the input of the SMEs and the community. The definition of success of the proposal is good, but there are no metrics to be tracked there and no KPIs related to the success - although some KPIs proposed to track the progress of the execution could be used for that. I would include at least a KPI related to community participation (which is mentioned in the other section), because other things like the number of people who changed their concept of SSI based on these conversations would be very difficult to track. Overall, I believe the easily track the execution of the proposal and check the SSI concept developed at its end, so the auditability of this proposal is good. They also mentioned that this proposal is a continuation of a previously funded proposal, that hasn’t been completed yet, but whose outcomes led to the submission of the current proposal.", "q2r": 4, "assessor": "z_assessor_2110", "no_vca": 12, "ne": 3, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "Feasability: the assesor states that \"the budget allocated for live translation seems quite higher than market rates\" but I am surprised by this comment because our rates are low compared to what some translators have asked for which we have seen up to $400//hour"}, {"id": 1533, "q0": "It is a quite interesting \nnotion to integrate various levels of defining identity in the concept of SSI thus making it more inclusive and multifacetted. It is exactly those perspectives we need to make the Cardano ecosystem something that truly is for everyone, independent of class, origin, nationality etc.and not just another neocolonial investment project. In this respect, I believe it has the potential to be incredibly beneficial to the Cardano ecosystem and also have a great positive impact on the challenge, as it plans to bring african perspectives onto the table.", "q0r": 5, "q1": "WADA in general, but also WADA cameroon, have proven to be \nsuccessful and reliable proposers in the past. The team is well-known and trustworthy and it can be told they are not in it for a quick cash  grab without any solid fundation. The budget is modest yet seems to be sufficient for generating an insightful proposal, especially as the single parts of it are explained. I highly appreciate that WADA proposers most of the time set lower budgets that still leave enough room for a lot of other proposers. THe phase like structuring of the proposals enables to see what will be achieved and how. The proposers are transparent about the team members and a credible timetable is presented.", "q1r": 5, "q2": "The problem description is very comprehensible \nand the solution approach is defined well enough to understand where the proposers are going, yet open enough to allow for open-ended research. In general, the proposers are quite transparent about all of their proposals and regularily present progress in townhalls etc. They have set enough metrics to provide transparency and auditability. In the feasibility section, also a lot of points to be adressed are mentioned which enables defining a lot of auditable deliverables. In addition to this, the roadmap improves auditability even further", "q2r": 5, "assessor": "z_assessor_2257", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 1620, "q0": "No, in my view the proposal does not meet the requirements of the challenge well, for example, it does not seem to me to be a project that would contribute to the growth of the numbers of: “proposals that address the fundamental issues that prevent the adoption of Cardano in Africa + which offers solutions to problems of infrastructure projects and new users integrated into the challenge (bidders, subscriptions on the Catalyst new members platform on the Catalyst new users platform on the Catalyst new resources platform on the Catalyst new users platform), the proposal is quite abstract and I don't see how this project could benefit Cardano specifically. to the complexity of the individual, the ties with his cultural group, understanding the individual as a divine portion that permeates all fields of the next generation. In short, bringing to light ancestral African perception on the concepts of identity, through philosophical debates. The proponent cites how SSI is associated with the project, but does not explain exactly how and why. Would Atala Prism DIDs be part of that debate, would some data be minted on the Cardano blockchain? It is quite abstract how this subject would relate directly to the technologies of our ecosystem. Not that the question is not valid, important for the debate, but in what way would this reflection bring new active members to our community, propagators like Cardano technologies, increasing the popularity of our blockchain in Africa? In my view, this bridge should be better established, so that we have a more continuous understanding of how the project would meet the specific needs of this challenge, which are the best proposals for the well being and giving to others Cardano; So I believe the idea is better developed, but it still needs to be better developed, but it still needs the proponent to be better developed and needed. would approach the concrete target audience of our blockchain, mode and insurance, the impact of the proposal would certainly be better guaranteed. My suggestion is for him to clarify this point, not even after reading the other parts of the proposal (feasibility and auditability) it became clearer. The proposal does not seem to be accessible and needs to be better with the objectives of the challenge presented and developed for this to be possible.", "q0r": 2, "q1": "The proposal's script is average, having some points that certainly should be improved. The problem here is temporality, in my opinion. Each phase would last a very long time of 6 months, nor is it explained how much time the activities that make up each phase occupy the period corresponding to the whole of it. In addition, the activities are not very detailed, the greatest wealth of detail consists of the list of all the topics that will be discussed. The most extensive and impactful phase would be phase 2, but turning my attention a little to phase 1, first. How would contracts with specialists be defined? How would these experts be selected, would they understand a bit about blockchain and Cardano, too? In phase 2, several activities would take place, but the main one would really be the meetings to discuss the defined subjects. Would these be face-to-face, online (proponent cites both cases, but what would be the predominance? How many people are expected per meeting? How would these people be motivated to participate in these events? How many meetings would take place per month, and where? How would Cardano be introduced into the debates ? The proponent states that it has a proposal financed in fund 7 on Hackathons; how would this concept be related here? How would the contents to be translated be selected, who would do this translation, how would this work routine be? would English speakers reach French speakers? In my view, several things are suggested, but it is not clear how these would develop in practice. Moving on now to the budget analysis, $30,000 is requested. The total amount is divided into a few parts, but these are not well explained and argued. For example, we know that 6 thousand dollars would be destined for the consultation of the spec ialists: how many specialists would there be, what is the price of the consulting hour? What are these trips and logistics surveys? How would these actions be marketed and publicized? Through which strategy would the content be disseminated, what is the plan for it to reach the target audience, arousing their interest? Would the developers have a work schedule that would justify the $400 monthly incentive? From the way this part is presented, it is not clear in practice how the money would be spent. Finally, when it comes to the team, this is the best part of feasibility. Still some improvements should have been made. For example, some team members attach a lot of information about themselves, as in this case: “Manfo - Technical Lead @ Wada Cameroon Hub, DITC, interested in identity and ownership solutions with a deep passion for honoring traditional practices through modernizing technology . Manfo and Mermoz will be in charge of reaching out to the subject matter experts (Ntumwa Nswadi Kimbasi, Mbog Bassong, Philipe Omutunde), organizing a work schedule and securing contracts with them. Manfo will also coordinate the team of development interns on the MVP solution.” But like other people, not so much detail is provided. It would be nice if we had the same amount of information about everyone. Confidence in the team is conveyed as they are part of the Wada group, which is already well established in the Cardano community. Therefore, the feasibility is average, as we have positive points, but certainly several things to improve.", "q1r": 3, "q2": "This is the best part of the proposal. Regarding the monitoring of progress, the proponent would provide a series of variables that can be used for us to make a quantitative and qualitative analysis of the whole, such as the observation of the fortnightly meetings of the City Council, number of documents shared from GitHub, bimonthly conversations with experts , number of videos and documents translated into English, etc. I think that what could further improve the quality of this monitoring would be to define how this information would be accessible to the Cardano community. Would there be some interface (a website, a telegram channel?) where all this would be gathered? Because they are diverse and different content, in my view it would be interesting to use tools such as Notion or Miro (online interfaces that support the upload of files, videos and photos). Another thing that would certainly benefit this part of the proposal would be a better detailing of each suggested data. For example in “Quarterly Hackathon Session”. How would this indicator be analyzed? How would conversations with experts be monitored? Would they all be recorded and made available on youtube, perhaps some file summarized in written form could be useful for our better understanding of these meetings? Overall, I like how the proponent is aware of the importance of tracking partial results, but beyond that it would also be important for us to monitor the tasks and work routines that would be behind these products. In relation to the final results, the degree of specificity decreased. We know that the goal is “to open up the debate on a whole new perception of what the notion of SSI is in the African ancestral circle, a great participation in the debate space will definitely be the first step towards success, the next step will be to be developing a game conceptualizing that notion and making it useful and fun.” But in what palpable ways could this scenario be perceived? Perhaps some direct research with the public that got involved in the debates? It would also be essential for us to understand what the effects of all this were for Cardano. Did the events attract people to become active members of the community in one way or another? How will all this be presented to the community? I suggest that the team choose some official communicative bridge to provide all this data to the Cardano community, to improve this contact between the team and us. improve I think the auditability is good, but a few more details would make it even better, easier to verify, and more accessible.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Feasibility: the assesor's commments show they did not read the proposal in detail. \"nor is it explained how much time the activities that make up each phase occupy the period corresponding to the whole of it....How many meetings would take place per month, and where?....how many specialists would there be, what is the price of the consulting hour?\" We go over these details in our proposal. \"Concretely we will invite guest speakers once per month and use the other one or two meetings that month to discuss as a community the content brought up at the lecture.\" etc."}, {"id": 2780, "q0": "\" this proposal offers a very novel idea, which is perhaps an extension and evolution of the project \"\"Cardanno Conservation Culture\" that this development team has worked on and has succeeded in many places. The content of this idea is to open discussions, search and re-investigate identities and philosophical arguments outside of science, which will involve a number of issues of origin. spirituality, or optimistic energy in life, the laws of the universe... there are many identities to be searched for and unearthed. I feel this idea is very good, it is very similar to the content in my favorite books, such as the law of cause and effect, the imagination that opens the way, or the book of body language or alchemy, these are famous books about the universe and inner forces * in general this is an idea that will develop for awareness and in-depth study of psychology beyond science, but it will go into the natural science how to form emotions. Naturally, *identified risk of the proposed group: with the speed of development, the influence from the west has made the lives of Africans faster, made their perception complex and lost the simple but profound of the ancestors. so the way to fix that would be to debate and reopen the histories of their ancestors. If the proposal is successful, it may help Africans integrate with the development of the world, but still retain the beauty of their ancestors. \"", "q0r": 5, "q1": "there are three phases that will be implemented by the proposed team in parallel, but each will take different time to complete, this offering is easy to understand. The proposed group is very experienced in presenting, the summary of this proposal I see the professionalism in the layout of the group's text, it is very detailed and easy to understand. The detailed budget table is also detailed for each small expenditure to ensure transparency. The team is also presented very specific and detailed about information, experience as well as clearly assigning each position to each person.", "q1r": 5, "q2": "\"There are a wide variety of proposed progress metrics on offer, all of which can be easily measured on the group's Youtube channel or at the town hall.\n    The awareness of the ancestral history of the Africans, and the large number of interactions, will justify the success of this proposal, and the proposed team also claims that it will provide more complete solutions in the future. .\"", "q2r": 5, "assessor": "z_assessor_2352", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 4346, "q0": "You have raised a problem that has existed for many generations, which is the perception of generations of Africans about their national identity and culture. I welcome your comments raised in the proposal, I consider it an innovative thinking concept that has been ingrained for many years. Up until now, you have applied high technology: Cardano's blockchain to combine and express African identity and culture. I rate this as very good in terms of the spiritual value of the Challenge's overall goal of \"Grow Africa\". This is a novel and rare proposition among the proposals I have read in this Challenge. This is interesting. If this proposal is successfully implemented, it will have a great effect on spreading African culture to all people in the African community and even to people all over the world. The promotion of culture and national identity is always necessary for any country, any continent, at any time. However, when I would like to point out the other side of this proposed impact, which is increasing the value of the Cardano ecosystem - I do not appreciate this goal. Of course, developing a proposal on the Cardano platform is already good for the Cardano blockchain. Specifically, SSI (a technology that allows a user to disclose only part of his or her information, etc...). SSI has been widely adopted by previous proposals. Have you ever thought that this proposal will have a big impact on increasing the value of the Cardano ecosystem? And if this proposal has a small impact on the Cardano ecosystem, what will you do next to make a high-impact proposal, that is good for the Cardano ecosystem? With that, what will you do to scale in the future? I greatly appreciate the impact on the traditional cultural identity of Africa. But on the contrary, I do not appreciate the impact of the proposal on the development of the Cardano ecosystem. Anyway, I still support this proposal.", "q0r": 4, "q1": "I have great confidence in the team behind this proposal. Since previous Funds, several team members have participated in several funded proposals, creating a reputation in the Cardano and Catalyst communities. In my opinion, when in this proposal, the team should still clearly present the members and accompanying identities so that those who have never read the proposal quickly grasp the profile, and professional qualifications. professions of the members. I strongly agree on how to break down the budget by the items that you have presented. It is specific, detailed, and easy to understand. In the same way, the practice is tied to the depiction of traditional African culture. One thing I would like to add to the proposal is that the team can elaborate on the technical aspects, in addition to using technology using SSI. This further increases the feasibility of the proposal. I understand the challenge you are facing about the current way of life of African people, especially young people who come into contact with the West a lot - they will gradually lose their ancestral knowledge and lifestyle. , the tradition of previous generations of Africa, of their ancestors. I believe this proposal will help them realize their current way of life, and better appreciate the history and traditional culture. I would like to propose an idea to contribute to improving this situation, that is, you can develop communication channels to propagate African national cultural traditions to people in African countries to understand more and understand better. If the team can do that along with holding open, frank conversations, I'm sure the problem will be largely solved and this also greatly enhances the feasibility of the project.", "q1r": 4, "q2": "The timelines have been specifically divided by the team from January to December. But unfortunately, I have not seen the proposed milestones related to the months of the year. I recommend adding this because it increases testability and makes it easier for readers to test. Also, do you present your success or performance metrics for the community to understand? I understand your core goal is a whole new understanding of SSI. But for me, we need more specific criteria to help the community evaluate the auditability of the proposal. Example: How many people have access to talks and discussions? And after those talks and discussions, could the team use the survey to see how many people are fully aware of SSI, or the cultural traditions of their African ancestors? Or, after implementing the proposal, can the team get more input from the participants to see if they are interested in this approach (adopting the Cardano blockchain platform)? I hope the team can consult this and further refine the proposal. I want it to be as good, and high quality as the proposed solution.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7287, "q0": "This is a good and interesting idea, this proposal effectively solves the problem presented. The problem is that Africans have an identity that is ingrained in the beginnings of ancestral communities in Africa, where they have their own traditions, but there is currently no solution that combines the views of Africans with their own concept of Identity. The proponent wants to build a useful SSI tool in line with the African spirit, helping Africans understand and see themselves through an African lens. This proposal solves the problem and tries to solve it, this will help increase the adoption of Prism Atala and Cardano which adds value to the Cardano ecosystem. The proponent also gave a clear idea, with milestones closely linked to the challenge, the problem presented, and also how the proposal effectively addresses those issues. This proposal can be replicated in different fields, so that it can solve the challenges in different fields in the future.", "q0r": 5, "q1": "The proponent and their team have a deep understanding of African human culture and also have experience working in the Cardano ecosystem. They have operated and received funding from the catalyst from demons 6 “Our Cardano Conservation Culture” shows that their experience, skills, and dedication are great. Proponents understand the problem and know how to solve it with a plan, solution, along with detailed timelines of the solution that they can achieve the target well, they know how to use the resources they are using. yes, it's town hall (ATH) to increase work efficiency. This proposal with a clear budget breakdown, understandable costs including equipment costs, as well as logistics. The proponent has outlined the risks and challenges they may face and proposed solutions to successfully achieve the goal. With all the above information, the proposal will be successful.", "q1r": 5, "q2": "The proponent provided clear details on how to track progress through the update and posted to his Wada and DITC youtube channels. The proposal also includes clear step-by-step timelines with goals to be achieved within the timeframe. This will also help the checking community to see if the proposal is going on schedule or is it falling behind. It is very useful if the proposal can research to provide more KPIs that are specific numbers, so that the community can easily assess the performance achieved for each indicator corresponding to each specific period. Very useful for auditing. The proponent also described a clear easy-to-understand solution that solves the challenge. Considering all of the above and all information provided to be clear and secure, the conclusion can assess the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9305, "q0": "What are the reasons and purposes for developing this project? Give reasons with clearer main ideas. Then describe your solutions. With such an order, it will be easier for the reader to understand. Creating space for insightful conversations about identity perception viewed through an African lens requires attendees to be able to participate in the meeting. So what's your plan to engage your attendees? The advantage of your group here is that when giving project ideas, you have planned what topics to talk about, what content includes. I think it's good to have a plan like you guys, so keep trying.", "q0r": 4, "q1": "The proposal has a detailed plan. You divided it into 3 phases, each period is 6 months, I think is reasonable. You have clearly analyzed the budget, have the time and the corresponding amount. Information About the group - 3 people did not mention years of experience, only mentioned their profession.You need to add more.", "q1r": 4, "q2": "Your proposal provides metrics to measure progress and growth, but no specific KPI numbers. Should give specific numbers to easily visualize the success of the project. Do you also have successful goals but not sure if it is short, medium or long term? The success of the project can also be attributed to the number of likes, shares and positive feedback on the content that is regularly published on the YouTube Channels of Wada and DITC.", "q2r": 4, "assessor": "z_assessor_3046", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 10777, "q0": "After reading your well-written and comprehensive Impact, I can understand how dedicated you are to this project and how much you care about African identity.\nFirst and foremost, let's discuss the solution's presentation. When you offer the context, the proposal, and how to implement the idea in-depth with a lot of information, you show the reader a clear direction in front of them. This demonstrates that your team fully comprehends what you must do now and in the future. I especially appreciate the conversation's content.  You make the local words and captions simple to grasp while yet piquing the reader's interest.\nNext, I admire your frankness in simply answering the question and emphasizing that this is only the beginning of a larger SSI. You've already laid out the path to equity and inclusion, not only for this idea but also for the notion of identity in our community's future.\nFinally, while speaking directly to the reality of Africans today and recognizing that this is the greatest risk to your mission, you keep that frankness. This in and of itself demonstrates your team's professionalism.", "q0r": 5, "q1": "I've seen a lot of proposals, and the Feasibility section is usually missing information when it comes to action items, but your proposal makes me feel fulfilled. In three phases, you provide milestones and a list of critical actions to complete. Furthermore, you have a detailed explanation of what you will perform in each phase. I don't have much to say about the detailed budget because it already fits the requirements of a detailed budget presentation with such specific numbers for each cost category. And, with a team as strong as yours, I believe this proposal is enough totally to demonstrate your seriousness.", "q1r": 5, "q2": "Your proposal did a good job in terms of presentation and important information. And at the end of this section, I can see how your team will track the project's progress and development, as well as picture the success you aim to achieve. However, I have a recommendation for you: Rather than just the word \"number,\" I believe investors will want to see a more explicit quantifier for the attendees at each town hall. It doesn't have to be an exact figure, only a figure \"around\" so they can confirm the project's progress.", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11537, "q0": "I assumed the proposal idea was fascinating. Instead of bringing Cardano to people in Africa, bring African perception of identity to Cardano through a deep conversation about the very nature of identity.I see a very interesting area emerging for further investigation of the differences between how Cardano approaches storing SSI information on the blockchain and the African cultural viewpoint of SSI that is introduced in the proposal. I see a great deal of value in this because acknowledging the ancestral cultural underpinnings of SSI in Africa could help Cardano gain traction among traditional communities. This could have both a local ( African communities) and a global impact (the notion that culturally-relevant perception of identity is being recognised and discussed without prior judgement through the lenses of the western society). The project also respects the campign setting by introducing blockchain and cardano to traditional communities where they would not normally be of interest. ", "q0r": 5, "q1": "The team members' characterizations appear to be comprehensive, including the role they will take part in the project if it is funded, as well as their experience relevant to the project's goal. Personal websites, as well as the roles of some members in relevant organizations such as WADA, are provided. The timetable is divided into three 6-month periods, with the first two phases elaborated in detail but only providing surface-level information about the last phase, where it is unclear how the discussed material will be leveraged and advanced to create a tangible MVP SSI/DID solution. While the overall concept and discussions appear to be meaningful, the idea of implementing SSI based on ancestral African views is doubtful to be implemented; however, such discussions are important in bringing cardano to all demographics in Africa. ", "q1r": 3, "q2": "Direct KPIs are mentioned in the proposal to provide an accurate outcome monitoring the scale on which the discussion will take place. Furthermore, the project intends to disseminate the outcomes of the discussion on YouTube channels and designated WADA websites, where it is likely to receive feedback on the discussion's ideas. As a result, the deliverables are represented on the website as YouTube article recordings as well as documentation. What I'm not sure how the MVP SSI solution will be developed and released to the github community in such a short period of time. While the idea of a thorough discussion about SSI appealed to me, I am missing some details about how such a complex and abstract perspective on SSI would be implemented on the blockchain, as well as overall technical details about the potential solution if the discussion favors \"African ancestral lenses.\"", "q2r": 4, "assessor": "z_assessor_3256", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 13361, "q0": "This is truly a unique and interesting proposition, beyond my imagination, the subconscious perception of combining the complexity of individual identity and its relationship with cultural group identity. chemical. A novel introduction that few people notice, I agree with your suggestion because it fits this challenge.\nIt is perfectly reasonable to meet and speak at City Hall (ATH) to discuss as a community the content given at the lecture, and an English translation is required for the community.\nAlthough the theories of the universe as in the proposal I don't quite understand, in the end the end goal is still to change the perception of the African people about new concepts like blockchain or Cardano.", "q0r": 4, "q1": "Based on your experience and your team members there is a high probability that the proposal will be successful within 18 months of action, and I expect the project to be approved.\nIt has been a long journey and requires perseverance and effort to engage the community in insightful debates and discussions around the concept of Identity Formed through the Lens of the African Model.\nThe budget with a total budget of $25000 has been broken down into small categories and clearly, I appreciate this.\nI have a small suggestion that you should use advertising campaigns before the conference, hire people to distribute leaflets, publish them in local newspapers, and local radio stations to advertise to more people.", "q1r": 4, "q2": "I see clarity in describing metrics to track your project's progress, clear and highly actionable roadmap, verifiable by attendance.\nI have some small suggestions to improve the successful audit of the project proposal, here are some suggestions such as:\n  - The number of attendees at each town hall during the lecture, you should give a specific number, such as 20 people, 30 people or any other specific number based on your experience.\n  - similar to the number of people in attendance at each town hall during the session, there should be a specific number.\n  - How many views on youtube, how many days out a video?", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Create a space for a deep conversations on the perception of identity viewed through African lenses, incorporating the complexities of an individual's identity and its ties to cultural group identity.", "experience": "DITC, Wada Cameroon Hub\n\nTeam member (Manfo) undertaking initiation through Kimuntu School\n1 Subject Matter Expert support from Kimuntu School (Ntumwa)\nLocal Artist and Cultural Expert Partnership (Mermoz and the Ufulu Cultural Center)\n"}