{"id": 414939, "author": "nanasafo01", "title": "Growing The African Tertiary Sector", "url": "https://cardano.ideascale.com/a/dtd/414939-48088", "category": 26600, "amount": 17600, "description": "The Cardano ecosystem and Project Catalyst are gradually evolving in Africa. However, the adoption rate in the African tertiary sector is very minimal and thus needs to be uplifted, but how?", "f6_no_assessments": 19, "f6_rating": 4.701754385964912, "videos": [], "media": [], "f6_assessments": [{"id": 1624, "q0": "Theoretically, the proposal aligns with the scope of the challenge. Here we seek to fund projects that are beneficial for Africa and for Cardano, simultaneously, and this would be done through workshops that teach what the technologies of our blobkchain are and about Catalyst - which would certainly generate a greater number of citizens from Ghana, specifically, active in our community, generating opportunities and income for them, how much would popularize Cardano in that locality. However, unfortunately, I didn't find this idea all that innovative. The proponent aims to increase the integration of Africans into the Cardano ecosystem, focusing mainly on Ghana - with its inhabitants as a target audience. He intends to hold some workshops covering various topics such as what is Cardano, what is the Project Catalyst, the roles in the catalyst (CA, vCA, proposer, proposal mentor); in addition to other aspects of the ecosystem, such as betting pools, development tools, wallets such as Yoroi, Nami and etc… The problem that I identify here is that we already have well-established groups on such matters. For example, to teach everything about Catalyst, from what this funding program is all about to the functions we can work on, we have the Catalyst School, a group that has already been funded has several funds and has been active in the community for a while. There is even a branch of the School dedicated especially to Africa. We also have the Wada group, which is already well established in the ecosystem, and which works especially for the support and benefit of Africans. There are many channels on youtube that also address such teachings; I believe that it would be more interesting to partner with projects that already exist, improving what has already started, raising the level of teachings and working so that they can reach more people, than creating a project from scratch, in which all the dissemination work would have to be done. I have no criticisms regarding the planning and quality of the contents that will be transmitted here. It is very positive how the proponent outlines what his role would be both online (\"organize meetings with potential participants who live on the outskirts of Accra to make the fundamental presentation on Cardano. I see LinkedIn as a good place where I can also look for university students, Ghanaian developers and instructors who can be marked as potential participants before their appointments and activities”); and also offline (\"I plan to visit the university's blockchain hubs to give a keynote presentation on Cardano to spark your interests, while scheduling a one-on-one meeting with instructors to run them into a foundation presentation/discussion\"). It conveys a lot of confidence that he has already defined the frequency of the workshops and the teachings that will be transmitted in each one. It is also positive that the proponent already foresees some problems and how to deal with them. The issue here is that there are already several projects in this direction and in my opinion it would be interesting to invest in those that already have a certain base than to start a new attempt at an early stage.", "q0r": 4, "q1": "The script is satisfactory in the sense that it gives us an idea, on top, of what will be done. Let's analyze it by parts. Starting with the first month, it would be interesting for the proponent to justify why he needs an office with so much equipment, I believe that providing a computer with a good camera would be enough for the main thing to be done. I fully agree with the need for a fiber internet that is fast and consistent, as well as the creation and subscription of some online tools such as zoom. I don't think that the furniture itself, such as tables, chair, blinds, rugs and air conditioning are Catalyst's responsibility, I believe they are items that will certainly increase the comfort of the activity of recording the course, but that are not indispensable for this. I didn't quite understand why 1 month was reserved for creating the virtual platforms, because creating accounts on youtube, zoom and social media is something fast. When it comes to the development of a website and the dissemination of whatssap, telegram and etc channels, I understand that they are a more complex and time-consuming process, it would be important for the proponent to have explained in more detail how this would all work. What would be the steps, how would the site be developed? We noticed that the team is composed only by him, would he hire a designer and a developer to create this site, or would he do it himself? What tools would you find on the site? When it comes to preparing for the launch of the first series, various activities are required such as “Search for potential participants from the Ghana University of Communication Technology via a key face-to-face presentation / Add observed potential participants to various social media platforms / Create and deliver workshop invitations to potential participants.” The time is quite extensive (about 2 months) for several activities to be developed, so I believe that more detail would be necessary. Now talking about the team, as I already mentioned, we only have the proponent as a permanent member, we have some information about how he acts in the community (he is a previously funded proponent); but it would also be important for us to know your professional background and how to learn about blockchain, how you intend to transmit this knowledge. In my opinion, the ideal would be for the team to also be composed of a developer, to program the site and take care of the technical parts of the project, a designer and a publicist so that the visual part, UI/UX was well assured and that the dissemination was done in the most assertive way possible. The funding requested is split ok, we know how the money would be used, but the parts could be better broken down. For example in: “Website development: 2,000 USD + Marketing and promotion: 2,000 USD + Maintenance cost (12 months): 1,500 USD + Fiber broadband installation cost: 1,000 USD”. Why would each of these parts cost the value that was delegated to them? What would the marketing campaign look like and why would it cost $2,000? In my understanding, for this part to be more adequate, each small value should be better broken down, more detailed. Therefore, we need to know why everything needs such an investment. In general, the proposal is viable, but it will take some small adjustments to make the topic ideal.", "q1r": 4, "q2": "In terms of progress, the bidder states that he will keep in touch with the Cardano community via telegram, through a chat with the catalyst coordinator and also a monthly report (until the site is finalized - and after that, how could we audit the tasks behind the partial results?). He also states that the series of workshops itself is a means of verifying whether the project is having the expected results; in addition it all provides what are the numerical expectations for participants and Cardano portfolio by series. It also takes into account the channel's success in number of views, I believe comments, subscriptions and likes. In my view, it was necessary to clarify how we could follow the actions that do not directly involve the creation and dissemination of the series itself; but aspects such as: the formation of the physical office, the networking being done with students and important groups in the middle, in short, the entire pre-production process that says about what would need to be done for such products to be created. I would like the proponent to clarify whether this type of information would also be posted on telegram and included in monthly reports, for example. When it comes to success, it is defined as “Having a strong network of Ghanaian tertiary sector university students, developers and instructors engaged in the Cardano ecosystem, contributing to Project Catalyst and other areas such as SPO and development”; a good percentage of the participants as active members of the Cardano and Catalyst community (and who perform various roles). Indeed, this is what needs to be measured, but how would such data become likely? How can we confirm that such successes have been achieved? Research with quantitative and qualitative data would be necessary to prove whether these scenarios have come true. A simple way that could generate this would be a direct survey of the participants, in my opinion. Understand where they are, that is, if they are applying the knowledge that was obtained, and if so, in what way; became CAs? bidders? Are those in the tech field participating in Dapps development projects, studying Plutus? In fact, was the knowledge passed on, did they teach people close to them the basics of what was studied, so that the people affected could be multiplied, even if indirectly? In my view, the auditability of progress is good, and that of the final results is well underway, but more tangible ways of dealing with what has been said still need to be implemented. Even so, the amount of information given here is above the average of the proposals that I evaluate.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 13, "ne": 8, "ng": 5, "nfo": 0, "vca_o": 2}, {"id": 12382, "q0": "i strongly agree to this above proposal because the problem needed to be solved has been identified and fallin withen the scope of the challenge because looking at this project it will help promote the tertiary institutions in Ghana because there are people at that level that will add value to the cardano ecosystem and project catalyst with inovative ideas if their being introduce and before they can become a memeber they must  go through trainings   that will help them know how to run on the ecosystem, this proposal scale to address future challenges as long as project catalyst exists ", "q0r": 5, "q1": "the proposal has provide accurate links and evidence on how the project will work out and the links are surfficient enough and relevant for the implementation this project if funded. the proposal has stated well the team structure  and the kind of people to work with  and the budgets of the the proposal is well noted, and once this  proposal always runs available funding will be needed because it must be a continious project to help grow the cardano catalyst  community. the whole plan of the proposal is coll and reasonabilly enough to help make the project a successful one ofcause", "q1r": 5, "q2": "i strongly agree because there are good road maps on how the project will be implemented and tracked successfully. all the websites provided below is a good one with right evidence that shows the proposer is good to go for the success of this proposal if funded.", "q2r": 5, "assessor": "z_assessor_3406", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 12059, "q0": "The proposed solution provide detailed roadmap and activities to propagate Cardano programs and to grow Africa’s participation in the Catayst activities. The focus on tertiary students and the tertiary communicate will have a cascading effect on the adoption rate for Cardano’s programs as these group play key role in the larger community. The medium selected to discriminate the series of programs will get the buy-in from the tertiary sector as majority of people within this target market are actively on the various Social Media Platforms like Linkedin, Whatsapp and Telegram. \nOn the suggested name, I strongly recommend the proposers adopt the name “Time with African Catalyst” instead of time with Nana Sarfo right from the beginning of the project. This is because it cause a lot of economic resources (money and time) to build brand names. The amount of money, time, networking, marketing and advertising that will go into building the brand name “Time with Nana Sarfo” should be channeled form day one to building and propagating the Catalyst project hence “Time with the Catalyst”. This will also help to reduce the risk of Consistency in Workflow where other participants will perceive the project as centered around one person. In spite of this, the proposers have provided a thought through guide on the perceived risks that will affect the success of the implementation of this proposal and have provided adequate mitigating measures to avert this risk. \n", "q0r": 4, "q1": "The proposers have provided a detailed roadmap on how the project would be executed with specific activities and deliverables. The sis (6) weeks allotted period for the execution of the project is feasible giving that the proposers have outlined weekly activities aimed at growing adoption to Catalyst activities and growing the ecosystem. Also, the various activities outlined in the 6weeks roadmap are in line with the Challenge setting. Regarding the budget submitted, the proposers should look at the allocation made for office furnishing (USD1139) as against that of maintenance (USD1500). Also, a detailed breakdown should be provided for workshop incentivization to cover cost per head for persons supporting the project over the six (6) weeks period. In addition, giving the experience of the persons going to work on the project, coupled with the roles they have played on other projects and previous funds the Wada community in Africa, they should be able to execute this project to a successful completion. However, since the proposers hope to secure future funding, the promoters should provide a detailed self-sustaining plan with timelines on when the project will be self-sustained financially. ", "q1r": 4, "q2": "The KPIs and the deliverables seams measurable especially giving the target number of 10 active participant for each of the series outlined under impact. This includes the onboarding of 10 new Cardano wallets in (yoroi, CC Vault and Nami) which can be easily measured. Though these numbers are achievable, it is important for the proposers to upscale on this number of 10 by replicating their sensitization and onboarding activities at various university campuses. Also, looking at the budget request, this upscaling of the targeted numbers to be on boarded on Cardano Wallet is feasible especially when the proposers hope to access future funds for project sustainability and continuity. The proposers have further outlined various channels to communicate progress of the project and provide accountability. This includes Catalyst Coordinator Chat Group, Project Reporting Website and the submission of monthly report to the community. In spite of these deliverables, I will recommend, the proposers add to their deliverables the total number of persons they hope to sign on at the end the project. This should include the number of proposals to be submitted from this target market, the number of Proposal Assessors to be on sign on etc. \t", "q2r": 4, "assessor": "z_assessor_3352", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12055, "q0": "This is the kind of project I highly support!Catalyst should fun individuals who wish to make a business out of building Cardano.\nAdditionally, doing so within the African continent is surely to be beneficial. The idea is incredible and directly in argument with the objectives of the challenge, as this is looking forward to setup events about Cardano and Project Catalyst adoption in African. The authors clarifies that it is a good place to invest, since it has a high number of technology students graduating annually, it is also one of the countries that most accept and use cryptocurrencies , I know the because I’m from Ghana.This is interesting how the author put it in a circular way, which is they are not just doing this  to introduce and develop the contents with these students, but to accompany and guide them during the process .Checking up on young people is also among , because they won’t only be teaching what Cardano is, but how to launch and execute projects on the blockchain, through funding from Catalyst. This is my understanding of the proposal, and I think this  goes as planned in other proposals for this same challenge.Things that should add up in my opinion to improve will be the understanding of the meetings themselves. I would like to see more detailed facts .the subjects in each meeting, numbers matter , number of students planned in  each meeting and number of meetings that would go into practice , name and occupation of person who will present  meeting... Details. The impact of the proposal is perfectly well with what is asked here.", "q0r": 5, "q1": "The team is quite determining and seems highly qualified. names and functions of linkedin is each provided for every member. But , marketing and design of people to work on the project isn’t available ,however this are extremely important areas for successfulness of the project , as this platform needs to be highly known and having ergonomic and friendly interface to encourage its use. In the implementation phases Amazon is mentioned, but the one in charge for that isn’t stated ? The team proposes a script, but did not outline everything in it , talking about what would happen over time. For example, in three (3)months, the platform would be created with basic tools what tools? Despite that, The team have a detailed plan to add on to the existing  of online work shop and will have the support of a dedicated team with Cardano experience. The idea for seeing this project through is also really solid with budget  and moreover this will motivate students  and educate them to contribute as much as they can to the program in terms of their time and energy. The budget ,timeframe and overall program are all in place and make a great deal of sense considering what the team are working in.", "q1r": 4, "q2": "this is a nice proposal , with the help of onboarding and helping the Ghanaian tertiary institutions by introducing them to the cardano ecosystem and project catalyst as a whole is a good idea.  This can also help Ghanaian to know more about blockchain and how to go about it. I have gained much interest on moving to the tertiary  institutions in Ghana and explaining to them what blockchain and catalyst means, and  with the help of the online series is one of the major source to tell most Ghanaian Blockchain is not a scam as they see it. \nthe description shows the clarity  of the problem, the solution and how the proposal is aligned with them. Roadmap is correctly designed, there are milestones that make auditing the proposal simple. \nThe KPIs and metrics are well taken and I strongly believe they are good indicators for evaluating success. ", "q2r": 5, "assessor": "z_assessor_3344", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12037, "q0": "It must be said that this is a useful recommendation when targeting students and lecturers. This proposal matches the second key metric to measure of the challenge. It is a good idea to offer seminars to guide lecturers and students involved in the Cardano ecosystem. The team plans to create online and offline workshops at a university which has blockchain hubs. At the offline workshop, the team proposed to reach out to lecturers, with online seminars, the team aimed at students. Over the course of 6 weeks, the team wants at least 60 people to have access to this content (at least 10 new active participants for each series).", "q0r": 4, "q1": "I find it a bit difficult to approach the feasibility of this proposal. First of all, the team listed in detail the progress of the project in 120 days, and detailed budget estimates for each item. This shows that the team is very interested in the KPIs to be achieved for the project.  All the processes can complete because of the much-experienced team.\nHowever, the implementation team is experienced in Catalyst projects, but the team does not disclose the relationship of these people to the universities. As a lecturer, I find it quite difficult to attract students to participate in online sessions on a new subject matter from strangers. Will be better if have support from lecturers. Besides, it would be better if the author confirmed the existence of blockchain hubs at Ghana Communication Technology University where the author will hold the live conference because I couldn't find this information on the university's website.\nFor this reason, I have given a 4 because it is detailed but does not specifically represent the strengths of the group in the area of university networking.", "q1r": 4, "q2": "The auditability section of the project is very good. Any criteria that the team released can be qualitatively and quantitatively monitored by the public over time. Creating a youtube channel that updates once a month and a website are great points for an audit from the community. It would be better if the team gave \"A good number of viewers\" of channel viewers which is roughly how many people (not necessarily an absolute number) and how is an estimated \"A good percentage\".", "q2r": 5, "assessor": "z_assessor_3329", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 11639, "q0": "The proposal team has done a marvelous job by glancing the proposal in it's right challenge. The proposal in it's effectively addressed the challenge and has the potential of bringing values to the Cardano ecosystem and the Africa country. \nThe proposal team clearly provide a precise solution to the stated problem by indicating how they will host series of online workshop to engage, guide and mentor tertiary student, develop and instructors on how to become and contribute to not just the Catalyst community but to the Cardano ecosystem at large should they be funded and I strongly believe that, they will do a great job of they are funded to execute their project. The proposal team also capture some important key metrics under the compaign brief by mentioning some of the key metrics on how their project will make an impact and offer solution to infectructure and educational concern, number of new African based user onboarded onto Cardano wallet and platform sign ups,local impact and local participation to the tertiary student in the community to Cardano ecosystem should they be funded to execute their project and I strongly believe they will do a marvelous job in their project should they be funded.", "q0r": 5, "q1": "The proposal team has provided relevant links to members of the team that will help in the project execution. However, the proposal team and Links of the team has proofing that they has the desire skill and experience to able to execute the project should they be funded which I strongly believe this is commerciabl. \nFurthermore, the proposal team has done well by outlining the break down into Identifiable on how budget or funds will be use and also provide the timeline that will be use to execute the project should they be funded. The proposal also outline the milestone and roadmap course structure and also provide the timeline showing the duration with which the project will be executed.", "q1r": 5, "q2": "The proposal team has provided clear outline on how to measure the progress of their project should they be funded. Moreover, they have shown how their success will look like should they be funded to execute their project by elaborating on some key metrics to look out for such as, active participant,, active participant would be onboard to project Catalyst,new Cardano wallet would be created etc, which I strongly believe they will be able to achieve their goal should they be funded. The proposal also indicate how their progress will be reported back to the Cardano ecosystem community making reference through Wada which is a reputable organization in the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 11539, "q0": "The project aims to increase Cardano and blockchain adoption in the tertiary sector, early stages with Ghana and gradually expanding to other African countries, with a focus on the educational sector, instructors, and development. This is a key pillar of the current grow Africa campaign, where one of the key metrics of Cardano adoption progress is the number of African-based users onboarded, as well as the increase in awareness and knowledge of blochain-related terms. Furthermore, participation in the organized workshops is open to all students, and the proposal anticipates opportunities for participants to become trainers - all of this is consistent with Cardano's fundamental goal of enabling open participation for all. The expected impact is both local - focusing on the Ghanaian tertial sector - and global, with the potential to expand further both in physical and virtual space (online workshops), with scalling opportunities expected over time. The proposal, on the other hand, focuses more on the description of the first steps required to build the physical environment and virtual platform required to launch the workshops and less on the broader picture that would necessitate translation and transformation of the workshops for other African communities and countries. However I would expect the later to be a goal requisted in the further stages of Cardano funding.", "q0r": 5, "q1": "To begin, based on the details provided in the proposal, this project is likely to succeed with a detailed step-by-step roadmap describing first how the workshops will be set up, including the need for office space, and later focusing on social media platforms, such as YouTube. Furthermore, the roadmap specifies the exact timeline and topics related to the Cardano-blockchain, Catalyst project throughout the workshop. Second, the team members come from diverse backgrounds (IT, education, and graphic design), which is critical for project execution, and the team members are WADA affiliates with extensive experience from previous funds. From a formal standpoint, the proposal also included contact information and LinkedIN information. The requested budget is reasonable for the plan, primarily including expenses for office setup and maintenance, as well as digital media subscriptions with a detailed price breakdown per item. ", "q1r": 5, "q2": "The Catalyst community can easily monitor progress through monthly reports on social media, and the created product is expected to be online and accessible to the entire Catalyst community, indicating high transparency and auditability. Furthermore, KIPs are clearly defined in the roadmap because they will be tracked as individuals participating in the workshop and, as a result, how many of them will become members of the Catalyst community. The delivery dates are defined on a monthly basis, and there is also a breakdown of the risks that could potentially prevent delivery, with solutions explained for each point.", "q2r": 5, "assessor": "z_assessor_3256", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10778, "q0": "After reading over your proposal, I only have one compliment: \"Time with Nana Safo\" is a promising online workshop. You define essential roles and a structure for your workshops based on critical Cardano and Project Catalyst topics. I'm impressed by how you construct a framework with specific details (how it works, exchange objects, desired goals, and especially a detailed schedule for 6 episodes of the series). As a result, you will have a clear project roadmap.\nA workshop or a user-friendly educational method, such as the \"Time with Nana Safo\" project, will, of course, fit this challenge. I believe that future students at Ghana universities will contribute significantly to the Cardano ecosystem's prosperity, as you stated, \"focus on getting things done from one stage to another.\"\nFinally, your 5 main risks are the final component that allows me to give you a 5-point impact rating. You foresee the danger and devise a highly practical solution. I see you have a solid understanding of the circumstances for your workshops, from the broad, such as participant preferences and inflation, to the specific, such as the internet situation in Ghana and proposed telecommunication firms that can offer fiber broadband.", "q0r": 5, "q1": "Determining the increase in adoption rate per series aided you in presenting your Feasibility section in a clear and concise manner. Each phase of your comprehensive plan has a defined timeframe for each activity item, and the budget is coordinated with the detailed plan. I was relieved to see the name of Ghana Communication Technology University in your plan because I was curious as to which university you would be offline scouting when you were simply talking about ghana universities in general in the Impact section. Further, I want to congratulate you on your success with Cardano because, thanks to it, you are able to secure mini office space for this project for the next four years ahead. You are committed and knowledgeable blockchain community members, so I believe you deserve these 5 points.", "q1r": 5, "q2": "The three key aspects that I use to evaluate the Auditability section of a well-presented proposal if it gives enough information are how the community tracks project progress, KPIs that stick with the project, and a clear image of project success. Congratulations, your proposal has been met. Furthermore, I have had a hard time with ideas that don't have liberalized KPIs, but not with yours because of your obvious explanations. I am confident that I will only be able to view them in the near future. Although the number ten for active participants and new Cardano wallets for each series may not seem like a considerable amount to entice many investors, I believe it is practical and enforceable. Thank you for your continued support of the Cardano ecosystem.\n", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13363, "q0": "I have to give you a Kudo.\nLooking at your profile and proposal I bet you are someone with a lot of experience with the Cardano ecosystem and as expected as a PA before, You are an active and excellent student and full of positive energy.\nWith the help of introducing and helping Ghana's tertiary institutions by introducing them to the Cardano ecosystem and project catalyst, I believe your project will help many students and help those who are in need of an experienced guide.\nI really hope this proposal of yours will be funded because it fits the challenge perfectly, it is a blessing for the students in Africa to have a qualified and understanding companion. know as well as you, and I also believe that your project will be successful.", "q0r": 5, "q1": "A pretty perfect roadmap for the success of your project, you are passionate and really enthusiastic about the project because you are willing to spend your own money to maintain the office space for the next 4 years, I respect you.\nA very detailed plan, I see that you have almost prepared this project step by step. And your experience described in the proposal shows that you are in complete control of this project and take it to the next level.\n- The budget table is also broken down into subcategories and it seems reasonable\n- The project roadmap has been carefully prepared by you for the workload and budget for the project.\nI only have a small contribution to the website if you do not have much experience in web management, you can use the WordPress platform because of its simplicity and ease of use, domain names can be purchased at Namesilo, web servers then you can buy hosting at Hawkhost or if using VPS then buying at Vultr is perfect for website combos.", "q1r": 5, "q2": "As a veteran advisor and now a proponent, you describe the problem in great detail and succinctly, very professionally.\nWhile setting up your own website, you report to the community on the progress made so far through the monthly report form on Telegram and follow the videos on the Youtube channel once funded, This proves that you are completely transparent and open to the community about your activities.\nMetrics and KPIs are clearly quantified with specific numbers on the number of participants, the number of new Cardano wallets created, and the number of youtube viewers to evaluate the success and development of the proposal over time.\nI have one more suggestion, why don't you set up a Group on Facebook because on Facebook there is easier, faster, more flexible interaction and students use Facebook a lot, in addition, Facebook also has Linking similar topics, maybe you will get more friends and exceed expectations.", "q2r": 5, "assessor": "z_assessor_3616", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 10531, "q0": "The author seeks to further engage ghanaian and african community engagement through a series of workshops available for everyone. The courses that the author offers look well-rounded and concise, basics for any beginner to take a first step into the crypto world and a great introduction to project catalyst as well as the cardano eco system. The project structure is very well written, detailed. Episodes are already planned, with detailed schedule times. I think this is a very meaningful project that will bring more accessibility to ghana and the rest of the african population. ", "q0r": 5, "q1": "The author's an established member of the community, and the work he has already published is very helpful and educational. His planned schedule and timeline is incredibly detailed and looks comprehensive enough for any new member to understand the basics of catalyst, blockchain technology and cardano. If he continues to put out this quality of work the project will be very helpful and successful. The budget seems reasonable in the purchase of equipment and proportional to the amount of work the author has planned. I have full faith that this proposal will be delivered sucessfully.", "q1r": 5, "q2": "The author offers progress reports on the telegram group every month. We can also easily compare the content that has been put out to the timeline provided to see if the content is being put out on schedule. We can also easily track success by looking at the community engagement on the chat groups, and views and comments on the youtube channel. This project is all in all easily auditable.", "q2r": 5, "assessor": "z_assessor_3189", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7387, "q0": "This is a very brilliant proposal from a highly experienced person in the catalyst community. I was thrilled and highly impressed after reading this proposal. This proposal if implemented will be a revolution in the cardano community. It is also a great approach to growing cardano in Africa especially in Ghana where people are skeptical about Blockchain and it's opportunities because they do not understand much about it.  Most people assume Blockchain issues are scam and therefore are not motivated towards issues concerning Blockchain. This proposal which seeks to diversify the cardano and project catalyst adoption rates in the African tertiary sector through a series of online workshops for university students,developers,instructors etc where they will be mentored on cardano and its blockchain clearly addresses and aligns with the challenge. This idea will encourage mass adoption of cardano by youths and students in the tertiary institutions. These students will,at the end of the day gain some knowledge on Blockchain technology and hence removing any misconception they have about it,and  project catalyst which will mean having new member onboarding on project catalyst to take up roles like PA,VPAs,proposers etc and this goes a long way to bring cardano to light in Africa.All risks pertaining to this project are stated and positive measures are put in place to mitigate these risks.with all these said,I believe this proposal addresses the challenge effectively.", "q0r": 5, "q1": "For feasibility,I will start with the experience of the team . The proposer clearly has a lot of experience to be able to handle this project skillfully per the detailed \n description, links  and images in the proposal. Being a proposal assessor since fund 4,veteran proposer assessor since fund 5, proposal mentor since fund 6, challenge team lead since fund 7,co-proposer and proposer since fund 6 and 7 respectively,and an advocate for cardano since 2020 is a whole lot of experience for one individual. I personally have been on his workshops and those workshops have actually encouraged and motivated me to be part of the cardano community. I believe if this proposal is funded,it will have the ability to scale through since the proposer from time to time usually hosts workshops on zoom,I think the author just needs a little push.for the rest of team and the detailed description given in the proposer,their links and social media handles,I believe they are very much familiar with the cardano community and I think they are genuine and have the required skills and experience to collaborate with the proposer.\nSecondly,the budget to me is quiet large but reasonable in a way due to the high cost of living these days, especially with the current high inflation in Ghana,prices have increased and this makes sense to me. The budget provided for stable internet connection, incentives and physical resources which makes a great deal of sense and the timeframe was clearly laid out,we get to know when the project commences and it's duration and when it ends and as such I believe this project is very likely to be implemented.", "q1r": 5, "q2": "I found this part of the proposal interesting and complete. Interesting because the KPIs are clearly laid out for us to understand if the project is achieving what it intends to achieve. The author has an excellent situation here,that is in relation to everything that will be happening in the best possible ways which includes  how the project will be self-sustained through some funds from their YouTube channel ,that is if only this project is funded and is commenced.\nAlso,there will be some sort of communication between the team and the cardano community since the proposer will be reporting the happenings and success of the project directly through the catalyst co-ordinator chat group on telegram,I believe this is a direct way of reporting evidence of the success of the project to the cardano community.\nWith all the above said,I think the project's verifiability is very good,it just needs to be entertained by the community for us to see results.", "q2r": 5, "assessor": "z_assessor_2890", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6802, "q0": "Blockchain entirely is seen as a complex space for the common man and we can only create a level play ground when we are down to educating and enlightening people. The proposer is proposing to create a level ground between the Cardano blockchain and people from various tertiary institutions in Africa focusing on Ghana as it's first experiment point. The team has vast experience in the Cardano ecosystem, 2yrs mentorship and guiding most of the new African community members through Wada and also some personal workshops, they seek to provide a Cardano based learning and onboarding ground for students, developers, instructors in different tertiary institutions through various social media channels by creating/organising series of workshops. The proposer clearly articulates a sustainable plan that relies on catalyst funding since each series will last for 6 weeks. Risk that could hinder project success are clearly outlined some which includes poor internet access, inconsistent financing and also provides measures to mitigate the risks.", "q0r": 4, "q1": "The team has secured a physical office space for a period of 4yrs. Furthermore, i was provided with a monthly post funding timeline (i.e if eventually the project gets funded) which is further broken down to office furnishing, gadget purchase, website development, setting up virtual platforms as well as the first series launch which is timed to happen between the 61st to 120th day after funding. The budget is reasonable and it clearly broken down although an item in the budget (workshop incentivazation  cost (3months): $3000) which is not quite clear to me. Details about the team and their experience is provided and to reiterate,  the sustainability of the project solely depends on subsequent funding from catalyst project until the project devise a self sustaining means/strategy.", "q1r": 4, "q2": "The proposer provided detailed information that will enable optimal evaluation and tracking of the projects progress. For example, team will be reporting to the community through their social media channel, also will be sending monthly report to catalyst until the website is fully functional. Some key metrics also include atleast 10 active participants for each series, a good number if youtube views etc. The success of these proposal can be measured by having atleast 10 individuals participate in the workshop and are aware of Cardano and project catalyst and also if a good number of participants have signed up to become part of Cardano as well as project catalyst. ", "q2r": 5, "assessor": "z_assessor_2831", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6781, "q0": "I believe the proposal addresses the challenge. The problem identified is clear and with straightforward direction. The structure of the project outlined by the proposer indicates a comprehensive plan for the project's execution. The future challenge/risk identified by the proposal have been well explained as to how they will be mitigated. In addition, the proposer's proposed solution to address the challenge answers all the eight key metrics to measure so far as Fund9 challenge is concerned. The proposer has clear intentions for the project's future sustainability.\n", "q0r": 5, "q1": "I believe the proposal is likely to be successfully implemented when funded. This believe is so because, the proposer provides evidence of relevant skills and experience needed to implement proposal. Pictures and links provided have been verified and it reflects the skills needed for the project. The proposal clearly spellls out a roadmap (in detail) for the execution of the project. The timelines provided are feasible. The budget provided is feasible. However, a little breakdown for the Marketing and promotion, and workshop incentivization will help. In addition, specific roles have been identified, defined and allocated to individual members of the team who eill be working on the project. there will be absolute checks and balance\n", "q1r": 4, "q2": "An accessible public channel \"Catalyst Coordinator Chat Group\" was identified by the proposal for regular updates. It is also suggested that regular updates also be done on the \" Project Catalyst Monthly Reporting Sheet\" which is well known to the community. There is a well-thought out KPIs that define the success of the project.\n", "q2r": 4, "assessor": "z_assessor_2830", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4351, "q0": "I see the proposal that has raised the issue that needs to be addressed which is to increase the acceptance of the Cardano and Catalyst ecosystems within the university sector in Africa. If this problem can be solved, it will have a great impact on the education of students - the continent's current young intellectuals, and teachers in universities, and indirectly increase the value of the ecosystem. Thai Cardano. Thus, the proposal is seeking to solve the goal set out in the Challenge, although it only solves a small part of the many problems that still exist in Africa, but has a great impact. Proposed objects of direct impact are university students, teachers, and school leaders. Because they are the intellectual class in society. If this proposal is successfully implemented, it will open many opportunities for Cardano and Catalyst. In the long term, it is possible to scale up and solve many challenges in the future. Because young people in universities have access to the door of knowledge. I strongly agree with the author of the proposal when it comes to a direct impact solution, which is to create webinars for college students, developers, and instructors.", "q0r": 5, "q1": "I'm impressed with the proponent's work experience in many positions: consultant, educator, etc... You have 2 years of experience in advocacy. This is very beneficial for the implementation of the proposal. Because this proposal when implemented is highly educational and motivating for people to be able to recognize and absorb new technologies (blockchain Cardano, Catalyst). Although the number of team members listed in the proposal is not much, everyone has full experience related to their major and everyone makes their identity public through social networks. Especially, there are members from the Wada organization - an organization representing Catalyst that stands out for its activities that benefit society in Africa. These factors contribute greatly to the feasibility of the proposal and build the significant trust of the community in the team. Based on the detailed budget analysis, I can see that the team has carefully calculated to request the amount of funding. In my opinion, that amount is reasonable, not much, not less, and completely consistent with the current price and current work if the proposal is approved for funding. I believe the proposal is workable once you have considered all the factors to come up with this budget analysis. Budgets are broken down by items from the smallest things (costs for tables, chairs... to social media). I commented that the plan and implementation method has become simple with members who have experience in advocacy and in organizing the implementation of Wada's proposals. I find it very reasonable that you choose the first development point in your home country of Ghana, then if successful, continue to proceed in other countries. However, can you explain to me why you chose to implement the proposal by creating introductory videos about Cardano and Catalyst? Organize online and offline seminars... Is this the way you've used in the past in education and advocacy? When I ask this, is it because the above jobs require a large investment in human resources, but can it be done in a team with a limited number of human resources at the moment? If so, do you have any solutions to ensure the number of human resources to implement the proposal? I mean the resources needed to implement (the number of people must be qualified, qualified to implement the proposal). I strongly urge you to review your personnel situation to be eligible to implement the proposal if funded. In terms of technical aspects to implement the proposal, I consider it not superior to have a full grasp of blockchain-related knowledge of Cardano and Catalyst, and skills to create videos and organize webinars, offline. Regarding risks and challenges, I agree with the possible risks mentioned by the team (internet, attendees, consistency, inflation...). If inflation risks occur, how will the team manage them? Is additional funding required? In summary about the feasibility of the proposal, I fully agree and affirm that the proposal is feasible when applied in practice. However, I still offer my ideas to contribute and you can review them to create a more comprehensive proposal. I vote 4 stars.", "q1r": 4, "q2": "The roadmap is clear, the milestones are divided according to the order in which the work is done. I still want to add more comments on the route you outlined that you can put the route on a certain month of the year. Do this to demonstrate to the community the auditability of the proposal. The community can rely on it to more easily check the work progress. Although I have researched very carefully, I still do not see the KPI in this proposal. Why didn't the team include KPIs in the proposal? I have advice for the team to add more KPIs. Because that is the basis for proving transparency and making it easier for the community to audit. On the other hand, the team has provided key metrics, I recognize this, I consider it a standard to evaluate the success and evaluate the team's work completion level. If you have both KPIs and key metrics, that's great. I wonder about the number of At least 10 active participants for each series. Is the standard too low for the scale of implementation of the proposal? On what basis does the team choose the number of 10 active participants? Why not more than 10 people? The rest, the clear and understandable problem description with the solution was well done by the team. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4141, "q0": "In preparation for Africa for a widescale of Cardano adoption in the future, it is essential to have the tertiary which comprises mostly the immediate next generation of leaders educated and involved in the activities and opportunities that Cardano offer. I see that impact in this proposal clearly. \nThe idea of using the online workshop methodology to implement this project is very useful and indicates that the proposer clearly understands the rate at which lifestlye is translating into digitalisation. I see this to be  very impactful as it would allow participants from any location to be able to join the workshops. All they need is internet access and they are good to go. However, the proposer is unable to indicate whether or not he there's going to be any form of motivation for participants and I think it could have been addressed as a form of risk mitigation for \"Attendance\". This doesn't compel me to deduct a score though as I still see that the challenge has effectively been addressed by the proposal.\n\nUpon reading the proposal, I could hardly find loopholes that need to be filled up by the proposer as far as 'impact' is concerned and hence I give it a score of 5.", "q0r": 5, "q1": "Nana Safo who has been a member of IdeaScale since March 10th, 2021, and having risen through the various catalyst ranks makes me believe that he has the requisite experience to be the main host of this project. I can personally attest to his experience as I have attended some of the previous workshops and events hosted by Wada where he presented on Cardano Project Catalyst. He does his presentations with a whole vibe that is rich in the African culture and well understanding too. \n\nWhen I visited the Wada website for the first time, I loved it. The interface and reactions to button clicks were amazing. I was wondering who that creative person is and I never knew until I read this proposal only to realize that Daniel Lezu is the engineer behind that awesome website. I don't mean to praise him but per his profile and previous work done as far as the Wada website is concerned, I have no doubt that he will be able to handle the website management position being assigned to him on this proposal.\n\nRichmond Oppong on the other hand who is the marketing and design lead for Wada as indicated on their website and in this proposal also does a great job as far as marketing and designing are concerned. I have had the chance of seeing some of his designs and they were amazing. Further research conducted on him also teaches me that he's the designer for the Catalyst African Town Hall and also has hands in their marketing sector as well. This and many other findings leave me with no doubt he is able to deliver his role on this proposal.\n\nWrapping the experience needed for successful implementation, the proposer clearly understands what experience is needed to aid the successful implementation of the project and hence has formed the right team. This team has the requisite experience to implement the project successfully.\n\nThe budget looks feasible to me. This proposal has a well-broken-down budget that details exactly what would be needed and at what rate(price). For purchases that will be made, the proposer has done a good job by providing links to the shops purchases would be made from. These two shops; Telefonika which is based in Ghana and Amazon which is international are by far, one of the best e-shops you can trust with the quality of goods. I have personally done some shopping from these shops and I loved the products!\nThe budget and its breakdown are reasonable for successful project implementation and hence feasible.\n\nWith a simple but detailed roadmap with clear milestones, the level of project implementation understanding for the team is very high. It depicts clearly that the team knows what to do and when to do it. A 30-day period for workshop preparation is indeed needful as of course, a lot of people are skeptical these days and require further engagements to accept an activity.\n\nThe proposer also indicates that he will further require funds from Catalyst for subsequent iterations and I think his reason for that is absolutely fair. however, he discloses that he is also open to suggestions and I would like to suggest that he can make use of YouTube monetization to gather some funds to help the project’s self-sustainability.\n\nAll links in the proposal are functioning and lead to the appropriate content. A YouTube link in the proposal, after clicking taught me that \"Time With Nana Safo\" has been done before. The contents were on point but I realized that there were technical hitches that could be due to poor internet or digital gadgets. This makes me believe that a portion of the budget being allocated to cater to the problem is essential. Once the workshop has been hosted before and is evident to the YouTube link provided in this proposal, it shows clearly that this proposal is doable.\n\nAll of the information above helps me to confidently conclude that this project is feasible.", "q1r": 5, "q2": "The proposer has done a good job by answering the two fundamental questions under this criteria. He has answered the question of how and what would be measured to determine project success. He provides clarity in his answer by mentioning exactly how the community can get along with the project’s progress which is to report the initiating progress upon commencement of implementation via the Catalyst Coordinator chatroom on Telegram which is open to all funded proposers. The inclusion of the monthly reporting to Catalyst through the form means that the community will have direct access to information on progress regarding the project.\nThe idea of developing a website to report progress is a good idea which I think will help the community be educated in style on what's happening with the implementation.\n\nThe metrics to measure are quantitative and well explained where not. This indicates that the proposer knows his expectations of the project and thus has helped him to state clearly what success for this project looks like. Therefore, I rate the auditability of this project 5.\n\nGood job and good luck!", "q2r": 5, "assessor": "z_assessor_2518", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3958, "q0": "I Strongly Agree to this proposal because it will help add a good impact to the cardano ecosystem and project catalyst as a whole; why, the reason is there are soo many student at the tertiary institutions in Chana especially loaded with innovative ideas that will help grow cardano and the catalyst team but have no idea on how to go about it, so am very sure that looking at the experiences of the proposer for such a project it sounds well that if the proposal is funded he has all the qualities to implement it successfully. also the problem needed to be solved has been identified in the challenge brief and the key metrics/ milestones of the proposal is being stated clearly because as long as catalyst runs all individuals introduced as a new members to the system in Ghana will benefiting from this project if funded . ", "q0r": 5, "q1": "I I agree to this proposal on the feasibility aspect because the links and evidences provided are really relevant and clear hence their sufficient because I have tried them, the proposer has also shown the kind of experience people that can work in the implementation of this project and I have been able to have one on one contact with this people and truely they deserve to work on this project because for me being in catalyst community today is their mentoring and training so far and that’s “Richmond Opong & Dave Daniels.  The proposer has a good budget for the proposal because in Ghana here the challenges or problems we normally face is getting access to the internet easily so looking at the detailed budget, is cool and will help in the implementation for the growth of the catalyst community and there’s a time table for the project to on when and how the work will go.", "q1r": 5, "q2": "The proposer has all it takes to show how the project will be tracked if funded because reporting monthly to the cardano catalyst coordinator chat group on how the work is being done so far is even one major source. And the success look like of the project is good also with good links and websites with videos  that proves that the proposer can implement this work successfully if funded ", "q2r": 5, "assessor": "z_assessor_2500", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 3442, "q0": "Idea is valid, as it has potential to onboard new members in Ghana, that might discover Cardano and Catalyst by these workshops and is aligned with Challenge, addresing challenge kpis as \"Number of new Africa-based users onboarded onto Cardano (wallets, platform sign-ups)\" and \"Number of new Africa-based Catalyst members (proposers, voters, CAs)\". Proposal and project is also very well stuctured telling exactly what will be developed (online series/workshops about catalyst), how new members will be scouted and engaged and what is its target audience. It's very good to see there's already a sort of course syllabus with an already pre-defined topic for each session, including a necessary introduction to blockchain and cardano at the begining, before deep diving into catalyst. Risks are properly identified as well. The main challenge, the internet availability in Ghana, was already perceived by proposer, which is key for this project to work. A demo video on a introduction to ideascale is provided which helps to illustarate the course (sound quality is not so good but proposer says in feasibility section he intends to buy new equipment)\nAs minor suggestions, there were already other funded proposals , in past funds for creating cardano/catalyst workshops. It would be nice if proposer could get in touch with these funded proposers to collect their lessons learned and apply already to his reality in Ghana. Moreover, it is also essential to collect feedbacks from attendees at the end of every section to improve/adjust as it goes, not just at the end. Last, I understand the content will all be in english, which ius Ghana official language. Maybe for future proposals, it could be considered to have the content translated (or subtitled) to other (local) languages spoken in Ghana, as Akan, 2nd most spoken language in Ghana, after english (according to wikipedia, about 80% of Ghana can speak Akan and 44% of Ghanaians are native Akan speakers). This is just food for thought though and considering the population that does speak english (probably most of the target audience), it might not even be necessary.", "q0r": 5, "q1": "There's a fair plan in place with acitivites listed in a good level of detailed and time-framed in a 30-60 days period. The only thing it would be nice to see here is the expected duration of the acitvities, in weeks. The plan matches project scope stated in impact section and its nice to see new equipment will be bought at first.\nOne person already committed to run the project is enough to run this project. Proposer has experience in Cardano and Catalyst past funds and should have the necessary competencies to make workshops about it. Contact info and a linkedin link is provided, giving transparency and helping to attest the mentioned capabilities.", "q1r": 5, "q2": "Proposer suggests good ways to track project. It included regular reports to public and the series will be available on youtube, which anyone can verify. The metrics suggested are also good and most of them have targets. As suggestion, I'd also include a metric related to feedback from attendees (could be a NPS, for instance), to check their satisfaction with the content/format. It would be nice also to measure how many students will propose in catalyst (or becoma a PA) in the subsequent fund, to verify further engagement/interest.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 9822, "q0": "The problem stated in this challenge is closely linked to the main aim/objective of the challenge. Thus, helping to seed, grow and adopt Cardano in Africa in 2022 and beyond. The main challenge restricting the growth of blockchain technology in Africa is awareness of the opportunity. Many African youth are hungry for opportunities to break the poverty cycle but access to relevant information is a major problem. Bringing Cardano to them, especially tertiary students who are the country's future generation, seems to be a laudable approach to help grow Cardano and project catalyst on the continent. \nThe proposal also answers most of my questions, especially on attendance, since this is going to be solely an online program, because youth in Ghana are very skeptical about attending workshops online, especially if it's about a topic they have little knowledge on. But the organization of in-person workshops as proposed by the proposer, to raise enthusiasm for the online classes is commendable. \nThis project seems to be led by only one person, I highly propose that if this challenge gets accepted the presenter will be willing to bring onboard more experienced presenters in the various catalyst roles that his topics will be centered on, to help dissect the various topics.", "q0r": 4, "q1": "The proposer provides us with detailed information about the composition of the team, their experience and their history of work on previous catalyst projects. The lead clearly has amased much experience being a previously funded proposer, and also having been with the community since Fund4. With the experiences stated, I think the team is well equipped to successfully implement this project if funded.\nThe budget has been clearly broken down into several segments, although certain aspect seems vague to me.   For example, \"Workshop incentivization cost (3 months)\", I think more information could have been provided on the target number of participants and the type of incentivization. Also, more information could have been provided on Marketing and promotion, thus, the type of strategy they intend to use and how they plan to promote their content to get the maximum participation.\nThe roadmap has been clearly stipulated running from the 1st day to the 120th day(thus from furnishing till launching of the series). I believe the timeframe is quite sufficient for the implementation of the project.\nAll in all, since most of the work will be done online, I see less hindrance to the implementation of this project, and deem the team capable of addressing any challenge should it arise, considering their experience.\nThough I have less knowledge on website creation and maintenance, I believe the quoted amount is quite feasible.\n", "q1r": 4, "q2": "Important metrics for measuring the progress and success of the project has been clearly stated. Also, the timeframes given are sufficient to measure the progress of the project. Moreover, progress of the project can be followed up on the website and youtube channel that willl be created. Key figures in the budget looks somewhat feasible, although I will recommend an expert to look into the software development and monitor its progress. ", "q2r": 4, "assessor": "z_assessor_3106", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14289, "q0": "\"Time With Nana Safo\" is a series of online workshops to engage, guide, and mentor tertiary students, developers, and instructors on how to get involved in the Cardano ecosystem. The first stage is to start with Ghana, where he reside. A WhatsApp platform will be created to onboard and engage potential participants for the workshops. For online scouting, he plans to host meetings with potential participants who live on the outskirts of Accra. Each series would have a time span of 6 weeks and iterate prior to the launch of the government phase of the project. Ghana's tertiary sector should be exposed to the accuracy of information revolving around blockchain. This solution will increase the number of Ghanaian tertiary folks interested in the growth of the Cardano Community. It will also result in an increase in the quality of projects coming through from the Ghanaian sector. This proposal will effectively address the challenge.", "q0r": 5, "q1": "The goal is to increase Cardano and Project Catalyst's adoption rate in the African tertiary sector. To achieve this, both a virtual platform and a physical space (office) are required. Nana Safo will use 95% of the rewards he has earned from his CA and vCA to secure mini office space for the next 4 years. In the 31st to 60th days post-funding, Nana Safo aims to set up various virtual platforms for the project. Each series would have a time span of 6 weeks and iterate prior to the launch of the government phase of the next fund. The people working on this project have the experience to carry out this project with the plan presented above by Nana Safo", "q1r": 5, "q2": "The actual series of \"Time With Nana Safo\" can be tracked through the website and YouTube channels. 10 new Cardano wallets would be created for participants of each series (Yoroi, Nami, CC Vault). A good number of viewers for the YouTube uploaded version of the series. The information above is sufficient to audit the progress and the success of the proposal", "q2r": 5, "assessor": "z_assessor_3957", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "Diversify the Cardano and Project Catalyst adoption rates in the African tertiary sector through a series of online workshops for university students, developers, and instructors.", "experience": "\nTwo (2) years of Cardano advocacy experience in the sub-Saharan region.\nRisen through the various ranks of Cardano community roles, except for CC rep and dRep.\nMentored, educated, and guided most of the new African community members onboarded through Wada and personal workshops.\n"}