{"id": 416375, "author": "karofiguy", "title": "Catalyst Resources in WaZoBia", "url": "https://cardano.ideascale.com/a/dtd/416375-48088", "category": 26600, "amount": 10000, "description": "More than half of Nigeria's 200million people are connected to the internet. However, 70% of the entire population is living in abject poverty. The internet can be a tool to lift them out of poverty.", "f6_no_assessments": 10, "f6_rating": 3.7333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1646, "q0": "The proponent claims that most of the population of Nigeria lives in extreme poverty, and using the internet and the opportunities that Cardano offers are certainly a very efficient way to change this situation. This would be done by translating some of Catalyst's features into the three main languages ​​spoken in Nigeria: Hausa, Yoruba and Igbo (WaZoBia). With this, the aim is to “educate, clarify and elevate the status of people”. According to the proponent, this is especially interesting for Cardano as well because Nigeria is a country that widely adopts cryptocurrencies (it would be interesting if some research was attached to confirm this information). Another positive point here is that the project would be carried out in partnership with a company called “Poetic Wednesday Initiative”, which works in the area of ​​education. The idea then would be to create a forum to educate people and clarify doubts that could arise, hold online and offline workshops introducing Cardan and Catalyst. Due to internet access limitations, the proponent claims that various contents will be made available via CDs and pen drives (I found this to be a very practical and inexpensive way to solve the obstacle!). In theory, the proposal is perfect, as it works directly on the two main objectives of the challenge: to benefit the inhabitants of Africa, through a study that can generate employment opportunities (even as CAs and VCAs), helping these people to leave from the poverty line; At the same time, the initiative would introduce many people to the Cardano universe, increasing the number of active members of the community, because, from what is said, these people would certainly grab every opportunity that arose to work, qualify and improve of life, which in my opinion can generate a dedicated and very beneficial workforce for Cardano, working for the growth and popularization of our blockchain. However, I found some problems in the impact of this proposal, related to the lack of explanations. Let's enumerate, because there are several doubts. 1) how would these online meetings be done, does the target audience have computers? And how could the issue of connection be circumvented, as it would probably be necessary for some live meetings to be held, for debates and studies? 2) How would the target audience be attracted? Blockchain is probably not such a widespread topic in the country, how could we draw these people's attention to the opportunities that Cardano has to offer? 3) What issues specifically would be addressed here? 4) How often would the meetings be held? I believe there was a lack of detail to develop the idea, in general.", "q0r": 4, "q1": "The project script is very superficial, it is only mentioned what would be done in relation to the passage of months; but such information is not properly explained and detailed. Very little is said: “This project is expected to last for 11 months. We aim to translate at least 4 documents per month, that is 12 documents per month looking at it will be in three different languages. In ten months 40 cardano resources will have been translated and a total of 120 resources in Hausa, Igbo and Yoruba. All workshops will be done within that period. The final month will be to distribute the offline learning tools”. No phases or details of the activities that will be proposed. For example, we know that in the translation part there would be 12 documents in total, which we can divide as about 3 documents per week, in 1 month. What would the translators' work routine be like? What is the approximate size of the documents? Where do they intend to get the documents to be translated, how can this selection be made? Now talking about the workshops: how many will be held per month? Where? How many online and how many in person? How many people are expected per encounter, and how would you go about getting their attention? What content would be taught in each workshop? Unfortunately, the way the script is presented, the level of detail is very low; we do not have an adequate understanding of what would be done, how, when and by whom. Speaking of budget, in turn, the information provided is also very basic. The total amount of US$10,000 is divided into parts, such as the payment of the translators (how many hours of work would they dedicate monthly, how much would the hour be worth?); the payment of facilitators (how would these people act?); why would offline materials cost 2 thousand dollars, how much would it be? In addition to flash drives and CDs, would there be printed material as well, for those who don't have a computer? How would the traditional media be activated, how would the 10-month publicity be done, why does it cost a thousand dollars? We only understand what the funding would be used for; but not because these values ​​are required. Even if they are affordable values, when compared to other proposals, it is still important that they are properly detailed. The team presentation part is the best on the topic of feasibility, a lot of information is given about the duo Salim Yunusa and Abdulbasit Abubakar Adamu. For example in: “Abdulbasit Abubakar Adamu who is popularly known as AB Wordsmith is a writer, storyteller, performer and journalist living in Kaduna, Nigeria. He is a graduate of Mass Communication from the prestigious Ahmadu Bello University, Zaria. His works by him which cut across fiction, poetry and essays have appeared on Rizal Journal, Guinevere Review, Love Poems Anthology, Praxis Magazine, Poets in Nigeria, Words Rhymes & Rhythms”. Still, I'm concerned that they don't cite much involvement with Cardano. How can we ensure they have the necessary knowledge to teach these topics about our ecosystem? Generally speaking, feasibility provides only very basic information, lacking in the first two topics, with the last one being the best, but still not quite adequate.", "q1r": 3, "q2": "Unfortunately, this topic is quite incomplete. In order to track progress, the bidder only suggests that the released documents be vetted. All we know is “Each month a total of 12 documents will be available in both Hausa, Igbo and Yoruba languages ​​respectivley. in ten months a total of 120 documents will be in both three languages”. And as for the translation process, how can we monitor that the work is being done properly, as promised? How can we be sure that the material would be reaching the public, whether through online posts, or through CDs and flash drives? How can we audit the workshops? We have few details about these, so we also don't know how to follow the development of these moments, and factors such as: if the expected number of people was what happened, if people understood the past knowledge well, how they applied it in practice what was taught, if there were any doubts and how they were resolved, if real opportunities arose from these moments… I think the first step for auditability to become more adequate would be for the script to be better detailed; with that we would have more material to guide us, while we would know what would have to happen, how and when. Second, the proponent could maintain direct contact with the community, providing feedback on both the translations and the workshops, partial results that need to be understood as they progress. Talking about success, he is defined as “A good definition of success on this project to me is to see someone far from reach preaching Cardano in remote places of Nigeria were many will have good knowledge of Cardano and blockchain”. Once again I found a very shallow suggestion, it is necessary that we do a deeper analysis of the consequences of this project, both for Nigeria and for Cardano. Thinking about Nigeria: how many locals have started working on something involving Cardano? Did the project provide them with an extra income, getting out of the poverty line? How many students would be looking to learn about blockchain technology, about Plutus, how to get involved in Dapp development, how to become CAs and vCAs? About Cardano: How many active members has the community received from here? How has the number of digital wallets, smart contracts, Ada in circulation, CNFTs and the like been increased? Did the target audience remain engaging with our community on a consistent basis? In my view, it is necessary for a reformulation to be carried out, for more details to be given and for us to have more content to, in practice, understand whether partial and final results are being obtained.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 11, "ne": 8, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 2409, "q0": "According to the ideas present in the proposal, it is possible to say that it is aligned with the objectives of the challenge. The activity of translating Cardano materials into local African languages has the potential to spread knowledge about blockchain in a region with little access to native language content. Thus, there is the possibility of having a positive impact on Cardano's ecosystem in the medium and long term. The capital being requested seems consistent with the planned activities, taking into account the total time of realization. However, it is worth mentioning that this proposal is not particularly innovative and that no means were presented to substantially differentiate it from similar ones.", "q0r": 3, "q1": "Taking into account what the project proposes to accomplish, we have that the designated actions seem very consistent, in addition to considering local aspects of the region, when planning, for example, the availability of offline materials and printed materials. It is also a positive point that the professionals involved have extensive local experience in the area of ​​communication, which is undoubtedly an essential factor in this project. Additionally, these professionals made their LinkedIns available so that their experiences could be verified. Regarding the distribution of the budget, we have that the expenses are consistent and we perceive a good allocation of capital, making the total amount requested, which is not very high, last a reasonable amount of months. We could also see that the team was concerned with allocating resources for dissemination. Another factor that indicates the organization of the team is that it already has a certain number of documents that will be translated throughout the year. Despite these factors mentioned, which contribute positively to the project's viability, we have that one of the biggest differentials of proposals of this scope is to find ways to differentiate the way of transmitting educational information, whether this differentiation is given by the previous existence of an already existing teaching platform. structured, or an innovative tool to reach large audiences. In this proposal, we were not able to find this differential.", "q1r": 4, "q2": "Regarding the ways chosen to follow the evolution of the project, more details could be provided. In fact, it is interesting to know the objectives that must be achieved, however, it would be nicer if the ways or tools used to know if the project is moving in that direction were exposed here. For example, some online visualization tool like Trello could be used so that the achievements are gradually seen by the community. Regarding the team's perception of success, we have that the definition of new quantitative metrics would fit well here to understand if the project reached the desired objectives. These metrics could be complementary to those defined previously (number of documents translated) and would help to understand the impact that the production of these materials caused.", "q2r": 3, "assessor": "z_assessor_2306", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3449, "q0": "The idea of translating catayst education content to the 3 main language is good as it can expand Cardano outreach in this country and is aligned with the challenge, potentially addressing \"kpis as Number of new Africa-based Catalyst members (proposers, voters, CAs)\". However, proposal could better a bit more detail on how this would work to fully assess proposal potential impact. For instance, it is mentioned that \"imporant Cardano documents\" will be translated but its not clear on what documents are those - at least some exampels could be provided. Moreover, it says that workshops will be held in 3 different regions but it doesnt explain the content to be approached in these workshops. I liked though that proposer will make the content available offline as well in order to overcome Nigeria challenge on internet access.\nOther point that could be improved is the risk section in impact. It says there's no risk because everything will go as planned but it is not possible to know this upfront. There plenty of challenges which included not having enough engagement, the already mentioned internet infrastrucutre (but also computer access), delays on the project, issues on the distribution of the offline content, not finding the translators and so on. The target audience (for instance, university students) and cities could also be clearer.\nLast, a small detail, the source of the information \" Nigeria is one of the countries with the highest use of cryptocurrencies and other blockchain initiatives\" could be provided too.", "q0r": 3, "q1": "There's a plan splited in the number of documents that will be translated by month but it could also have a deeper level of details (saying which documents will be translated). For the workshop part, which involves a need for a higher degree planning and organization, a better timeline should be provided, including the preparation, advertsing/engagement, material construction and etc. \nRegarding the budget, it is fairly brokendown, matching project scope but the amount of hours that translators and facilitaros will work could be provided. \nRegarding the team, it has 2 people already committed with good experiences and links to verify the info provided. However, the roles of each one in the project are not clear. Also, it seems that translators and/or facilitators will need to be hired as in the budget it says there'll be 3 for each of these roles.", "q1r": 3, "q2": "Proposers suggest to use the documents translated to the 3 languages to audit the project and that is a good start. However, it should not be limited to that. Some KPIs could be measured to understand the reach of these documents. For instance, it could be tracked the number of people accessing it, the number of people who joined catalyst because of this work, feedback from the people reached and so on. Also, it could have metrics for the workshops in the same sense (e.g. number of attendees, quality of the workshops measued via survey and etc).", "q2r": 3, "assessor": "z_assessor_2461", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3662, "q0": "Voters, this proposal consists of translating the contents of the catalyst project into Hausa, Yoruba and Igbo – the three most spoken languages in Nigeria. The impact of this proposal tends to be quite large given that Nigeria has 200 million inhabitants and half of them have internet contact. From these translations, we will create the potential for these people to learn more about Cardano and Blockchain and be part of our ecosystem. Furthermore, some of these languages are not only spoken in Nigeria but also in other countries in Africa, which could make the impact of the proposal even greater. An important point that I believe should be considered is that the proposer claims that the proposal poses no risk. I think this is a delicate point, I work with projects and business and I don't see how a proposal can not have risks that must be mitigated and managed. For this reason I am giving 4 stars for the impact criterion.", "q0r": 4, "q1": "The feasibility of the project can be affirmed by the proponents explaining how it will happen in practice. The idea of the project is very simple, the focus is only on translating content that already exists and not creating it from scratch. The goal is to translate 12 documents per month (translate 3 documents each into the three mentioned languages) For this reason, there is no need for many people or other resources. The project team was well presented and the members have the competence and experience to make it happen. These experiences are linked to writing, translation, journalism, storytelling. The budget is reasonable for the translation service for languages that are not so common and it was well explained and “broken” into smaller items.", "q1r": 5, "q2": "The proponents presented a way to measure the progress of the project, which can be audited by measuring how many documents translated into the three languages are being generated per month. I suggest that this be done with a metric that compares the predicted translations with the translations performed each month. Overall, it's an easy project to audit. Once again, I am concerned that the proposers do not present risks or challenges inherent to the proposal and how they will mitigate them, I believe this is very important to ensure more security for the proposal. For this reason, once again I thought it best to assign 4 stars to this criterion.", "q2r": 4, "assessor": "z_assessor_2466", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4356, "q0": "I admire your intention to help the country out of poverty. Even a small act like translating the manuscripts of the Catalyst or disseminating knowledge to improve the people of Nigeria. The team's idea has solved the goal set in the Challenge. The team has done great work for Africa and Cardano. If this proposal is taken seriously, its impact will not be small for the community and it will also increase the value of the Cardano ecosystem in the future. It is still very early to think of a team that can scale and tackle challenges in the future, but I fully hope that the team can do it out of love for their country and their love. passionate about the Cardano blockchain. I confirm the obvious impact of the proposal on the community. I highly encourage you to implement this proposal, because it raises the morale of the people of Nigeria. Raising people's knowledge will lead to good results in hunger eradication and poverty reduction, although this still takes a very long time. Regarding the increase in value under the Cardano ecosystem, I understand that it will not increase immediately, but it will take a long time. But I still encourage the team to implement the proposal. In short, the proposal is completely impactful, but the most impactful is to contribute to the growth of Africa, in the long run, if done well, will contribute to the growth of the Cardano ecosystem.", "q0r": 4, "q1": "I read the proposal and was surprised that the author is 2 people - both a journalist, a writer, and a translator. Thus, you have certain expertise and experience in translation. Including your relevant information on social networks has partly demonstrated the feasibility of the proposal. However, I have a question about the team you built with only 2 people, or are there other people? If there are others, why not have their information and identities? I think you should enter the full information and identities of all members and make the number of team members public. This makes the community fully believe in the feasibility. The budget has been presented by you in reasonable sections, in the budget section some additional people support you to implement this proposal, are the members of the team or not? In the proposal, the team clearly stated the plan and implementation method, which was simple and not complicated, but very clear and demonstrated the feasibility of a proposal beneficial to the country of Nigeria. I just wonder if the number of personnel (resources needed for implementation) that you plan to deploy to implement the proposal (all about 8 people: 2 members and 6 translators) is enough to do that workload or not? Think about whether it's the risk of this proposal in terms of resources compared to the team's opinion in the proposal that there is no risk. Another thing I wonder about is the difficulty of the specialized Cardano and Catalyst documents containing many highly academic words. With the ability of two members to translate documents, is there enough specialized knowledge of Cardano and Catalyst blockchain to be able to translate properly and sufficiently? That is the technical and technological aspect that I want to cover when reading the team's proposal.", "q1r": 4, "q2": "With a project lasting about 11 months, I would like you to be able to clearly state the roadmap by months in a year instead of just stating the general goals to be achieved through the milestones. I strongly recommend the team to do this because it increases the auditability of the proposal. It makes the community more confident in auditability and PAs more convenient in evaluating proposals. In the key performance indicators (KPIs), the team pointed out indicators related to education and people's knowledge. This is also a measure that reflects the success of implementing the project in the Nigerian community. And I want the KPIs to be high because it shows that the people's intellectual level has improved. The nature of the problem is quite easy to understand after being clearly described by the team and a possible solution. What remains is that we must act to turn the proposal into reality, contributing to improving the people's knowledge and developing Nigeria. One more opinion of mine to confirm the auditability, in fact, during the implementation of the project (in the case funded by Catalyst), does the team intend to develop a progress report? I think the team should do this. If you can, that's great. That's my input on the proposal.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7288, "q0": "The problem is that many people in West Africa especially in Nigeria, participate in the cryptocurrency market, but are not well educated due to many factors but including language barriers, as most of the material Blockchain related use is in English, so many people fall into unclear projects and lose their hard-earned money. The team proposes to tackle the challenge by creating re-usable documents by translating languages ​​from Catalyst resources into three major languages, Hausa, Yoruba, and lgbo, including webinars and videos, and then saving hosting several online meetings following a face-to-face meeting for the growing local Cardano community at a Blockchain conference in Nigeria, helping to make more people aware of and knowledgeable about Cardano, showing the It adds value to the cardanor ecosystem. Through these training sessions they will establish a solid base among the participants they learn the basics, and the depth of Cardano will be very helpful if the proponent knows how to encourage them to become recommenders, providing them with the necessary materials so that they can only teach what they know to those who don't know, so the dissemination becomes more effective. With the above clear information showing that this proposal is suitable for the challenge presented, it can solve the challenge in the future by updating more content and knowledge over time. The proposal has a positive impact on the Cardano ecosystem with increasing knowledge and awareness through relevant documents translated into the mother tongue for the people of Nigeria.", "q0r": 5, "q1": "The subject provided the information, experience and skills needed to successfully accomplish the goal. A reference to my LinkedIn profile was provided, however no details were provided regarding the organizational structure of this group. There is also a detailed description of the implementation plan, allowing the review community to understand the actions required relative to the timelines. The team then broke the budget when counting for 3 translators and 3 facilitators, while the information about “people working on the project” only listed 2 people. To be more clear I think regarding the \"Detailed Team Budget\" section, the community will need to know the number of people assigned to the project, their role description and the hourly, or per lesson translation must be paid per person. As for risk management, in this project the proponent says there is no risk, I ask myself is there really zero risk? To answer this question, which we analyze together, this proposal would need to start with looking at existing educational resources related to the Cardano ecosystem, and translate it. Here it seems they are evaluating on both a recommender “Abdulbasit Abubakar Adamu” and a member of the education staff “Salim Yunusa” to make sure they are on the right track. It is not clear how many current downloads of educational resources will meet the needs of the sessions they plan to conduct, but it is worth noting that there is a lot of material out there that they translate correctly, they have really understood the right blockchain knowledge to translate and communicate, who can vote that they are correct? Those are some of the risks that I want to say, to reduce risk and increase persuasion, I think it is necessary to have an additional unit to stand in control of that issue. At this point, for me there are many risks involved that have not been screened. Therefore, I cannot agree or disagree on feasible at this time. I recommend that you clearly add, provide proof of personnel, organizational structure, or partner. I am sure that the community will fully agree and support you, so that you bring value not only to the Nigerian community but also to other regions that speak the same language.", "q1r": 3, "q2": "The proposal presents a clear roadmap, together with timelines, and a plan to translate 4 documents per month, i.e. 12 documents for 3 languages, along with the progress of workshops, online education, until the last month piles of packages that redistribute offline lessons. This is pretty easy to audit and they are also easy to report after funding. Success metrics, as well as KPIs are explained clearly enough to track the progress of successful project implementation. The proposed team also successfully summarized what the project looked like, clearly understandable, consistent with the results of successfully solving the challenge.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10537, "q0": "This proposal aims to make cardano ressources more accessible to the nigerian population that speaks Igbo, Hausa and Yoruba. This answers the challenge well as it will help more people break the language barrier and learn about the cardano ecosystem. The longterm and shortterm goals of ensuring that men and women get quality, affordable education is a very meaningful project, and will help grow the cardano technologies, with more educated people involved. ", "q0r": 5, "q1": "The author has previous experience in teaching and translating blockchain related courses, and seems to have a very well planned and thought out curriculum ready. Partnering with a local organization will also help reach the more marginalized people who are eager to learn. As nigeria has a big community of crypto currency users, I think there should be no problem finding interested learners, which would be the main challenge in this project. Offering both online and offline classes will really help reach people with technological and financial challenges. Distributing the ressources through flashdrive and CD will also help people with time constraints have the opportunity to learn. I think this project has a very high chance of success, considering the very motivated author, and the planning that has been put into this. I think the budget is reasonable for the amount of both online and offline events planned. ", "q1r": 5, "q2": "The author has a clear goal of 12 translated documents every month, and as these ressources will be publicly available, we will be able to track the progress completely and know if the products are being delivered on schedule. There is also a forum planned for the community to ask questions/engage in, so it will be easy to see how successful the project was to engage users speking Igbo, Hausa and Yoruba. I think this project is highly trackable.", "q2r": 5, "assessor": "z_assessor_3189", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10780, "q0": "I must mention that this project has a commendable purpose in wanting to help increase awareness of the Cardano and Catalyst blockchains in Nigeria. You specify the company to work with, the audience the initiative wishes to reach, and a precise roadmap for document translation. Although, that is still insufficient for an excellent instructional project.\nFirst, you shouldn't include information regarding SDG goals, subgoals, and KPIs in the Impact section because it is already supplied at the end of the proposal and is already publicly available.\nSecond, I visited the link you supplied and discovered a Hausa text. This is a negative for your proposal because this document was in ONLY ONE LANGUE, and you did NOT even provide a quick summary of the document's substance.\nThird, I don't believe investors will appreciate your simplistic response to the main risk question. If there are no potential risks with the project, you should briefly describe why you came to that conclusion. \nFinally, I'm curious about the origin of the documents you want to translate and whether they are from a reliable source and are guaranteed to be correct. Alternatively, do your team members themselves edit these documents? Since this is VERY IMPORTANT for an educational endeavor, let's be more precise.\n", "q0r": 3, "q1": "You provide a lot of data in this Feasibility section, including the quantity of translated documents available within the project's operating timeframe of 10 months and the costs associated with four activities. Yes, you provide a lot of numbers, but your presentation needs more WORDS. The member introduction, in my opinion, took up even longer than the plan and budget presentations. Tell everyone what content you'll translate (such as the Cardano introduction, the proposer's role, PA and vPA, etc.) and how you’ll run workshops (where held, during what period, etc.). I believe you can develop a better proposal than this one because you have members with talent and expertise in the field of literality.\nP.S. If your team member has blockchain experience, you should mention it to increase everyone's level of trust. Everyone needs to know if you are informed about blockchain because this is an educational project about it.\n", "q1r": 3, "q2": "ABSOLUTELY not enough information regarding your project's Auditability can be conveyed to the reader in just two lines per answer. You restate the figures from the Feasibility section without providing any additional key metrics, making it difficult for anyone to use them to follow the development of your project. How will you know whether your education has been successful? How many will more people join Cardano as a result of your project? Can this project be implemented throughout Nigeria? I have too many questions because I don't understand what you mean when you say about \"A good definition of success on this project.\"\n", "q2r": 2, "assessor": "z_assessor_3193", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10810, "q0": "One of the first things to do to help grow Cardano is to educate. Accurate and reputable documents, and information about blockchain, and the Cardano ecosystem will be translated into 3 native languages ​​of Nigerians. This will remove the language barrier, making it easier for them to learn and research. Nigeria is one of the countries with the highest use of cryptocurrencies and other blockchain initiatives. I believe that the success of the project will contribute to the development of Cardano in Africa. ", "q0r": 4, "q1": "Unfortunately, this part of the project is very superficially presented. The author only presents the number of translations done in 1 month and the total number of translations in 10 months. From what source will the translated material be obtained? How will the translation work? Where will the seminars be held? Who will be responsible for each part? Analysis of the project's budget, the proponent provided unclear information. Example: Three content translators for ten months @ $6000. How much time do they spend translating? Will wages be calculated by the number of hours worked or by the number of words translated? A plus point in this section is that they also provide quite complete information about the members. ", "q1r": 3, "q2": "Similar to the previous topic, this one leaves a lot to be desired. The author measures progress through the number of documents that have been translated. I think that is not enough to evaluate the progress of the project. How can we verify this information? Where can we track progress? It's hard to imagine a project's success without a detailed roadmap. ", "q2r": 2, "assessor": "z_assessor_3196", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 11733, "q0": "Nigeria has a lot of population that is living in poverty so the internet can be a tool to help them out of poverty and the aim of this project is to educate the blockchain for Nigerians, which makes perfect sense, it can change the foundation of education, enlightenment and empowerment of people, bringing great benefits in improving the living conditions of indigenous communities.\nI think these solutions will be very effective if implemented into the project. The underdeveloped network technology makes it difficult to communicate information to everyone so we need to have reasonable solutions like creating a local Cardano forum and blockchain, and cryptocurrency issues, These solutions can improve the quality of life of many Africans while promoting economic development and facilitating trade and the exchange of goods while maintaining the anonymity of many Africans identity and confidentiality.\nBecause investing in anything has its benefits and risks, if all problems bring the results you want, then no one is a failure. In my opinion, we should put the risks to the project before we can see the solutions. Reading documents on books, on paper will be boring and inconvenient anytime, anywhere. Transmission via offline sessions is also not frequent and also costs a lot to travel to local areas.", "q0r": 4, "q1": "The proposal has given important milestones and specific timelines of the work to be done, with such an arrangement that the progress of the work will be carried out. With an expert per month translating a document with today's technology is possible\nThe budget has also been broken down by the work of each participant and the costs associated with the project. However, as mentioned above, we should not invest a lot of money in printing documents but should invest more in dissemination in the media.\nTo successfully achieve the stated goal, there must be the presence of journalists and writers so that documents can be translated smoothly and articles have deeper content. The project has clearly stated their names and achievements and what they have done, the community will feel more confident about the project. If funded I think with the said budget we won't need any more funding. Because this project is not too invested in technological equipment or machinery to have to spend a larger cost.", "q1r": 5, "q2": "The proposal has specific measurements and a clear KPI, and the work goals are clearly defined by each day and each number, so it cannot be unsuitable for the solutions anymore.\nThe success of this project is to see people in a remote part of Nigeria who have a good understanding and knowledge of Cardano and Blockchain. They can do it if the project is delivered to them according to the plan\nThis is a brand new proposal that will succeed and we should invest and continue in the following campaigns", "q2r": 5, "assessor": "z_assessor_3273", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "By translating Catalyst resources into the three main languages spoken in Nigeria which are Hausa, Yoruba and Igbo (WaZoBia), we intend to educate, enlighten and elevate the status of people.", "experience": "Translated over 20,000 words for organizations such as world health Organization, Near Protocol, Doctors without boarder, Translators without boarder. And currently a content creator in news media in Nigeria. "}