{"id": 417142, "author": "thiago.ouros", "title": "Business Strategy for African Proj.", "url": "https://cardano.ideascale.com/a/dtd/417142-48088", "category": 26600, "amount": 25000, "description": "African community projects need more guidance to match the goals of growing Cardano in Africa and they will have a hard time finding time from experienced community members to leverage their projects.", "f6_no_assessments": 5, "f6_rating": 3.7333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1053, "q0": "The proposer has put forward this proposal, with the scope of offering his skills and knowledge to project creators and developers from the African continent or when possible facilitating connections with other chain leaders - though not clearly specified which chains or leaders. The way he will find the projects and developers in need is by monitoring what he calls the “African channels”, participating in town halls and keeping up-to-date with the African community.\nOverall, I feel there is a lack of knowledge regarding the African community, the descriptions are vague and general, and from what I gather, he is not involved with them. As such, how can I know that there is a need for his services if he is not part of their discussions?\nHowever, if the proposer is serious about dedicating his time to African creators, the safest bet would probably be to get in touch with WADA, DIT Cameroon or others, their experience and connection both in the Cardano/Catalyst space as in the African developers/creators communities is very wide and their openness is genuine. Maybe, together, they can come up with some better ideas, as their approach is more grounded and hands-on. I’m suggesting this, as the proposal doesn’t offer a clear direction, and doesn’t offer sufficient details to have a good grasp of what the proposer’s intentions are. They seem to be based on good intentions. Yet, I feel that the lack of direct contact and communication with people from the African community has rendered his knowledge about it to become too superficial and without having a clear purpose and need.", "q0r": 3, "q1": "The detailed plan contains a lot of steps, yet they are somewhat general “Announcing to the African community the possibility to book calls”, “Query all the projects that could be interesting” or “With some data in my hands, I will go around the ecosystem and establish a relationship with more leaders”. While there seems to be a main direction for this project, clear paths have not been established and as such, from the perspective of a project manager and creator, the lack of so many details makes me uncomfortable in considering the plan to be successfully implementable.\nThe budget is detailed and has clear hourly rates and the number of hours needed for implementation. However, what I fail to understand is why the proposer is requiring a budget for 12-20 months of counselling when he isn’t even sure if the African community is actually in need of his services. For such an experiment, a timespan of 3-4 months would have been sufficient in assessing whether the proposal made sense and if so, then it could have been resubmitted with the success of this first one clearly described.\nThe proposer has answered “Yes” to both questions regarding other proposals from this fund and previous ones, but, even though it was clearly requested, he hasn’t mentioned any of his other projects in the proposal text. \nWhile the proposer seems to be involved in the community and possess the right skills in development, the lack of knowledge regarding the African community and the large budget required for a very long period of time is putting me in a position, where I cannot agree that the plan and funding required are feasible at the moment.", "q1r": 2, "q2": "The auditability section is well drafted. The proposer has mentioned how he will be tracking the progress of his proposal, by using the services of the Treasury Guild (although, this was not accounted for in the budget section and there was also no mention of the guild working pro bono on this proposal), Dework, GitBook, and on top of which he will be creating spreadsheets to track meetings and surveys.\nAs for the success question, most of the answers provided are reasonable, yet there is one that doesn’t seem connected to any part of the project, namely “A project MPV is implemented and explicitly contains the contribution discussed in a call”. I assume the proposer meant an MVP and not MPV, and it is only a typing error. However, in the context of this proposal, since it hasn’t been mentioned before, what exactly does an MVP entail?\nOverall, I find the auditability section to be well drafted, but only if taken out of context, as some of the details mentioned here, do not have a connection with the rest of the proposal, like the Treasury Guild not being accounted for in the feasibility section or the MVP not being mentioned anywhere else in the proposal. As such, I can neither agree or disagree that the proposal can be successfully audited and thus I will rate it a 3.", "q2r": 3, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4318, "q0": "This proposal recognizes a lack of guidance for African projects to emerge, and proposes to identify incoming projects, mentor the teams, and help them to emerge and connect with the ecosystem. \n\nThis proposal fully addresses the challenge's main theme, and can help by augmenting the efficiency of team members and by improving the number of successful projects.  \n\nMy main concern about this idea is scalability. Indeed a project with a single team member, which requires human interaction might have a hard time dealing with a growing number of projects. My suggestion would be to plan for expansion via a franchise-like network of mentors, identified among the mentee. \n", "q0r": 4, "q1": "This seems a large project to be handled by a single person, and \nThe team is made of only one person who is committed to the community, and seems knowledgeable, despite the provided links don’t demonstrate much activity. \nThe time frame is not detailed enough past the second month of operation, and seems the project should last between 10 to 20 months. This clearly needs to be addressed. \nThe 25000 $ budget is not clearly explained. I’d like to see how much the monthly cost is, and for how long the operations are going to proceed. \nThe risk assessment seems optimistic. understaffing and dependencies on third parties are not addressed properly. (I would like to see what would be the team response in case a risk materializes).\nOverall, I see an average to low likelihood of success.\n", "q1r": 3, "q2": "The community can check the progress only through a manually filled google sheet. Other auditing tools are mentioned, but none is linked nor explained.\nKPIs are not completely clear. I would expect measurable, objective data, in a consistent time frame. I suggest reworking the timeframe, e.g. monthly, and add quantifiable objectives for each month.\n", "q2r": 2, "assessor": "z_assessor_2548", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4361, "q0": "This proposal post deals with what every project needs - guidelines to align with Cardano and Africa's development goals. So it has a big impact on the goal set in the Challenge. I think this is a great idea. I wish that there would be more such good ideas for projects to be supported, because only when the project is supported can they succeed and make Africa grow. Thereby increasing the Cardano ecosystem. If done well, it can be scaled up in the future. Not only support projects in Africa and can support projects in other continents. Make the world a better place. Save time searching, to spend time doing other useful things, this is very good support, especially for businesses in the start-up stage. I appreciate this. I understand you intend that you want to build a \"bridge\" between the projects to be consulted and the experts/leaders/developers with sufficient expertise and techniques to advise the project. there. You can even become a consultant if your specialty is suitable for the project under development. As I said at the beginning, being a \"bridge\" is very important, what we need to do is to build a good \"bridge\".", "q0r": 5, "q1": "You have an impressive record of the work you've done and are doing with Cardano. I can verify my identity through the social networking sites you are using. Your name and identity are made public which is great for the feasibility of the proposal. I have a question about the team you're working on to develop this proposal: Is the number of members on the team unique to you? If you are alone, what solutions will you have if during the implementation of the proposal something happens that prevents you from continuing to implement the proposal, then someone will do it for you? this proposal or not? I want to clarify this because it is directly related to the feasibility, and the implementation of the proposal is funded. Because the budget is quite clearly divided with the expense items attached. I am convinced: For hours of advisory and research, you stick with the average hourly price of the software industry for a project manager or software developer, which is around $64/h. This seems quite reasonable. It sounds like you have a well-thought-out division of items. However, I think this needs to be scaled up in a very mainstream way, and it should be measured against the actual hours worked by you and the consultant. To demonstrate feasibility, you already have the necessary resources, but I would like you to explain more clearly that there is a technical or technological aspect to be used in the proposal? And if so, what role does it play in the development of Cardano's ecosystem? As for the risk and the risk remedies, I fully appreciate the tax remedial properties you mentioned in the proposal. I just have a small idea to contribute, that is during implementation if more funding is needed, how would you come up with a verifiable plan? To summarize in the proof of feasibility, what I am most worried about is the implementation staff, this is also the factor you mentioned in the risk section when implementing the proposal, that is when you are exhausted or If you are tired but can't work, the work will be piled up without being resolved. Therefore, I always look forward to another possible solution to completely overcome this risk. Example: You find another member to work on the project with the same role as you so that he or she can help support you when you are exhausted or tired of not being able to work. I vote 4 stars.", "q1r": 4, "q2": "I've seen the roadmap, but unfortunately, I haven't seen the timelines in your proposal. I strongly recommend adding roadmap timelines to increase the auditability of the proposal. If this is done, the reader community will have much more confidence in the feasibility and auditability of the proposal. As for the KPI, you have raised three main points, which I think are reasonable. Also, I wonder why you don't set a quantitative indicator of reports related to new projects starting from the African community. You can present these reports at the Town Hall. This is your measure of new businesses and I understand that new businesses will be the ones that need the most guidance from experienced leaders/people. I am satisfied with the problem described, it is quite clear and easy to understand and you also provide some highly practical solutions. These are my comments and assessments about the auditability of the proposal. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9010, "q0": "Overall, this proposal would positively impact the challenge goal of helping to grow Cardano in Africa. The proposer sees a need for mentoring those who need help creating proposals in future project catalyst funds. Mentoring would improve proposals and increase funds going to projects in Africa. This would not only help the Cardano ecosystem but it would also improve future development within the continent. It would do this is a way that is consistent with African values. Giving African proposers the help they need to succeed at receiving funding would mean local projects meeting needs in a culturally-specific context. Recognizing the specific needs that exist in helping to meet those needs by pairing experienced mentors with new developers and proposers from Africa should increase the effectiveness of new projects and those working on them. It should have an exponential impact as more experienced teams and developers within Africa would be able to then recreate the mentoring process and mentor newer developers there.", "q0r": 5, "q1": "There are some potential risks inherent in this proposal and the proposer has done a god job of identifying them. Depending how well they are mitigated, this proposal is highly feasible. \n\nBeing from industry prone to some of the highest levels of professional burnout, I have a slight concern as to the availability and potential burn-out of the propose. I also wonder about a lack of interest from the target community. This seems like a large project to tackle alone. However, considering the proposal's consideration of utilizing a similar approach to SWARM of using discord and dework, I believe these risks can be mitigated. \n\nThe budget is clear. The hourly breakdown is appreciated to help assess. There are also clear metrics that are being targeted. Overall, I feel this is a valuable proposal that has a slight potential for failure, but a higher likelihood of success. The proposer is skilled, and qualified, with the right experience and connections with the ecosystem to make this effective and very likely to create a positive impact toward the challenge goals.", "q1r": 4, "q2": "This proposer is a public and visible member of the Cardano and Catalyst ecosystem. He is connected and able to report on the impact of this project. The plan is clear and auditable. There is a clear and workable timeframe indicated in the proposal that will help the community gauge the progress of the project. The  budget has a clear goal for the number of hours worked. The plan to account for time and resources spent is also clear. There will be public records of meetings held, and projects impacted. These are positive, healthy, and verifiable metrics. This reporting will help the Cardano community keep track on the success of this project to determine the need for more projects like this. Overall, I think this proposal should be approved. ", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9243, "q0": "The author presents very clearly the context and relevance of the problem he intends to tackle. In addition, it is worth noting that the problem identified by the author is strongly related to the challenge in question.\n\nGiven that the author has strong proven experience leading community discussions and managing projects in this regard, his contribution will certainly generate value for the projects that receive his advice.\n\nA point worth considering is fragility in terms of scalability. Due to the nature of the activity, your consulting hours will be punctually used by a privileged few.", "q0r": 4, "q1": "As previously mentioned, the author demonstrated through his reports and attached links his consistent experience both in regional leadership of the Cardano community and in the management of projects of this nature.\n\nAs the proposal is focused on its consulting hours, it is not appropriate to assess the competence of a team or other members here.\n\nAs for the budget, it was clear the costs and calculation logic used to price the consulting hours. As well as detailing the action plan that the author intends to execute. In this case, the author has well balanced reactive initiatives, according to the demand for his advice, and proactive initiatives, acting to facilitate his proximity to eligible projects.\n\nRegarding the risks, the author was clear about the different types of risk he sees as potential and how he intends to mitigate such risks.", "q1r": 4, "q2": "Within his action plan, the author indicated milestones he intends to achieve in the coming months. This can be a sore point in the project's progress, as success does not depend solely on the project, but also on adoption by the local community.\n\nTo facilitate the audit, the author indicated reasonable ways to control the project with due transparency for the community, mentioning adequate tools for this.\n\nAn interesting thing and a positive point is the author's view on the success of the project, which was able to present different levels of success and KPIs that can confirm the achievement of results with precision.", "q2r": 4, "assessor": "z_assessor_3035", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "Advising new growing African projects by providing guidance and advice and the right connections for individual growth and success. Coordinate multiple advisors with different specialties.", "experience": "Cardano Ambassador, Developer and SPO. Highly engaged and committed as well as experienced in the Cardano Ecosystem. Mentored several projects in the past on their way on building on the Cardano Blockchain ecosystem\nAbout my History in Cardano"}