{"id": 417392, "author": "shirogat", "title": "Cardano needs Math Teachers", "url": "https://cardano.ideascale.com/a/dtd/417392-48088", "category": 26600, "amount": 10000, "description": "Object oriented programming is commonly used in normal programming ", "f6_no_assessments": 9, "f6_rating": 2.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 1779, "q0": "The problem stated by this proposal is not really a problem : \"Object oriented programming is commonly used in normal programming \". However we understand from the solution that this proposal offers to learn Math teachers to teach Haskell (goal of 100 teachers trained).\nHaskell can be learned by any developer by online courses, and Plutus can be learned also online (PLutus pioneer program). \nThis proposal does not show enough how it is aligned with \"Grow Africa, Grow Cardano\" challenge settings. In a coming application, I recommend elaborating and providing evidence about how \"math teachers not knowing Haskell\" is 1) true and 2) a barrier to development of Cardano. ", "q0r": 1, "q1": "The budget is very roughly described (7 steps, 4000 USD for the first step and 1000USD for the next 6 steps). \nLow details are given on how 100 maths teachers will be teached Haskell. One step of the plan is \"select 100 teachers\", it would be helpful to elaborate on how this process will take place.\nThe author claims to be an experienced haskell developer, but does not provide any evidence of it : this is the main point that needs to be adressed for a further application in a coming fund.", "q1r": 1, "q2": "This proposal does not include any means for the community to monitor its progress. It could have included for example a publication of online courses, and updates with students showing their progress.", "q2r": 1, "assessor": "z_assessor_2264", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 3383, "q0": "Offer training in Haskell is a way to make people better adopt the cardano blockchain. The approach used with the proposers is to train the trainers. Teachers being trainers as they will share the knowledge acquired with their students.\nThis is an answer to one of the challenge objective around onboarding and training new Developers onto the cardano.\nThe strarting targets 100 teachers, but this number may increase by time, and based on its success.\nIt aligns with the challenge and may be expanded globally.\nMy rating is of a 5 star.", "q0r": 5, "q1": "This project is simple, and straight forward with results that are tangible: train the math's teachers on Haskell, so they can teach the students the coding using Haskell. Simple approach and feasible.\n100 selected teachers selected is a good number to start with as it may represent various schools, However what is not mentioned is the process by which those teachers will be selected to be part of the cohort to get trained. And once trained, how will that training be included in the schools curricular. details on these elements would clarify the success of this initiative.\nThrough the school clubs teachers will attract the interest of more students to take the training. \nThe timeframe is not well detailed, even though the training duration is clear.\nFor these few reasons am rating this proposal with a 4 stars, but am convinced it's very feasible.", "q1r": 4, "q2": "100 teachers trained and a number of clubs created, are the main indicators of success of this project. It would have been better to also learn more on how will the progress of this initiative be followed by the community.\nReason of my 4 star rating.", "q2r": 4, "assessor": "z_assessor_2458", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 4367, "q0": " Math is essential to new technology like the Cardano blockchain. Therefore, the training of math teachers is suitable to solve the set goals of the Challenge. Haskell programming is the foundation of Cardano. The more students and teachers that learn and teach the Mathematics related to Haskell programming, the more the Cardano blockchain will add value. I found this team proposal to have a very positive impact on the Cardano ecosystem. Of course, this will take time when this proposal is implemented. But in the immediate future, we can see its impact on the people's knowledge of some African teachers and students mathematics. We easily understand that once the Cardano ecosystem develops, it will help a lot for Africa - a continent that is being considered less developed and backward than the rest of the world. I appreciate the impact of the proposal because it identifies the problem that needs to be solved. This number of proposals is considered as the first brick laying the initial foundation for the future development of Africa, if implemented well, it can scale up and solve many problems of Africa. I vote 5 stars.", "q0r": 5, "q1": "I was really surprised at the disclosure of the identity of the team member. To me, this is very important to demonstrate the feasibility and build community confidence in the proposal. I have read the proposal and understand that the team has 2 members but I don't see specific evidence to prove the identity of these 2 members (Angela and Anne), I don't see you posting links to social networks to show biographical profiles of two team members. If the identity is not disclosed, the community will not appreciate the feasibility of the proposal. So when I advise you to quickly add identity information about the member. Regarding the allocation of policies, it is quite detailed and clear, with the goal of training math teachers. I wonder if your team has any other members besides the 2 members, Angela and Anne? Because I see that the plan is made and the way to execute it is clear that requires more than 2 employees to do it. I am very interested in practical resources, especially human resources. Technologists have a very good idea of using the Haskell language. Haskell is a difficult programming language, it requires a lot of student thinking, but students who have experienced it successfully will be the ones who can contribute greatly to the development of Cardano. The risk is already in the proposal (you have difficulty with blockchain), I see it as an obstacle to implementing this proposal. Because the Cardano blockchain is closely related to the Haskell programming language. But you have difficulty with blockchain, so will this proposal work smoothly? In summary, I would love to have the team add what is left unfinished to create a more viable proposal. I vote 2 stars.\n", "q1r": 2, "q2": "According to the implementation roadmap, teachers will be trained in Haskell programming language for 3 months. I consider this to be a basic level of training, used for general education. To raise to the level of expertise that can impact the Cardano ecosystem in a significant way will probably take a lot more time and learning. I asked if the team has considered a long-term plan to improve Haskell programming for the time of writing proposals to apply for funding in the next Funds? The milestones for the implementation of the proposal are clear, but in my opinion, the team still lacks a roadmap of steps to carry out the work associated with the months in a year. I continue to recommend adding this because it increases the auditability of the proposal. Then the community and PAs will trust the proposal and the team more. You have listed the necessary KPIs (standards for recruiting teachers and students). What I like about this suggestion is that the problem description is easy to understand and the solution attached. However, these do not make me completely confident in the auditability and feasibility of the proposal. Therefore, my opinion is both for and against auditability. I vote 3 stars.", "q2r": 3, "assessor": "z_assessor_2552", "no_vca": 10, "ne": 4, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7296, "q0": ". The goal of the project is to provide an online course that will support the training of 100 Mathematics teachers in East Africa to teach Haskel programming to children, education is a leading national policy in all fields especially in the field. need as much brain as the Blockchain technology field, it is really necessary, it is great that the team has grasped this core element. The creation of 100 teachers with enough professional knowledge and skills, to teach Haskel programming about Cardano to children, the generation of the future, the generation that determines the flourishing and sustainable development of the Cardano ecosystem. By training teachers I think will increase the number of solutions, use cases of Cardano blockchain technology as more and more people have knowledge capacity, this means that developers can be created. new development. Therefore, it is certain that the project will promote the interest, sharing and participation of the people of East Africa in particular. And also in Africa, the Proposing Team does mention risk but it is very short for a project involving Regarding the high gray matter, and the consensus of the educational institutions, I think it still has some risks that need to be known to come up with a plan to reduce the risk. The proponent did not state the criteria for selecting teachers while the teacher is the core element of the project, the proponent should provide some selection criteria, possibly in terms of experience, qualifications, Their level of interest and interest in Blockchain technology does not. The establishment of clubs in schools, how the school supports and encourages students to participate, how to ensure the number of students participate, as well as the policy to maintain the club in the future. future.", "q0r": 4, "q1": "The proponent of the proposal presented a plan with contents to achieve the goal but did not clearly present the important milestones to achieve the results, to successfully implement the challenge a lot of work must be done. implementation, so it is better for the proposer to divide the monthly timelines to complete each work item, and should clearly show how to complete each of those work items, the Proposer only talk about team members' work experiences, without providing their information through LinkedIn, sites that increase credibility and make it easier for voters to evaluate proposals. The project management team is only two people, with a relatively large amount of work, including marketing, teacher selection, teaching content creation, club development, I think. There may not be enough resources to make the project run successfully. Budgets are listed by tasks but do not include timelines and are not analyzed in detail, e.g. Teachers who founded a Cardano club where they teach and practice coding in Haskell 1000, it is recommended. specifying how much money it takes to establish a club, and how much time it takes, the proponent makes the budget as detailed and meticulous as possible, which will make it easier for the constituency to evaluate and follow. track.", "q1r": 3, "q2": "The project has provided a schedule by listing the activities in a certain order and according to the development roadmap of the project, However in my opinion if the proposer attaches with the content a time period If you are certain to nominate the community, evaluate the development of the project and easily follow it, it will become more perfect. The given KPI is just \"Completing the task is being trained teachers and establishing clubs in schools\", I think some more indicators are needed to properly evaluate the effectiveness and quality. of the project, for example, the teacher's knowledge acquisition index after each lesson and after the course, as a percentage, the number of teachers successfully completing the course, the average number of students that each teacher training after completing the course, number of clubs was established. The proponent does not provide a tool such as a Web site or direct written reporting method, etc. voters can access and measure and track project success.", "q2r": 3, "assessor": "z_assessor_2886", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9015, "q0": "This proposal seeks to incorporate Cardano and coding into the schools and curriculum that is being taught in Eastern Africa. This proposal could help bring in more adopters of the Cardano system by making it familiar with children from a young age as well as making their teachers and families more knowledgeable about the system. However the answers given to these questions are lacking details about location and connections that exist between the proposers and the people they are trying to reach. I think that this is a great idea but cannot give it more than a 4.", "q0r": 4, "q1": "This proposal has very clear steps and budget details for what needs to be done to complete this proposal. It is thought out from beginning to end and the people who are being asked to do the work seem to have the experience needed to get this done. The problem that I see is that there are people from this team who are working on other proposals and may see their time split and pulled away from this project. I appreciate the team’s honesty in recognizing that there may be unforeseen issues towards the completion of this project. This could be addressed in the budget for those unforeseen costs.", "q1r": 4, "q2": "The answers provided are short and simple. They answer what success would look like and a measurement. However there is no place where progress and success would be available to the Cardano community. While the steps toward getting to these goals are clearly outlined in the sections above there is no way provided for anyone to know that those steps have been completed or how well training and recruitment are going. That is why I am giving this proposal a score of 2 in audibility.", "q2r": 2, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11863, "q0": "The problem is that object-oriented programming is often used in normal programming. The solution offered for this The proposal is to train 100 math teachers in functional programming language named after the mathematician Haskell Brooks to in turn train their students in the use of Haskell, including teaching methods for ease of learning and student motivation.The proposal aims to boost adoption and increase the capacity to grow the cardano developer ecosystem. This proposal will certainly add value to the cardano ecosystem.There may be a risk of adoption blocking the chain as this is not well understood, but efforts will be made to make it clearer by working with other members of the community.", "q0r": 4, "q1": "The team members with relevant experience have been communicated in the proposal, namely Angela: Haskel Plutus course designer from European Business University and PBL course creator from Gimbalabs and Anne: Microsoft in Education global training partner, Microsoft Certified Educator, More than 5000 teachers trained in ICT and education. However, there are no links in the proposal where you can look up those people. It is clearly defined who will do what in the implementation of the proposal, namely Angela will design the course and put it on Moodle and she will also train and Anne will mobilize the teacher. The budget is USD 10000 and a very clear and detailed budget analysis is presented in the proposal with the breakdown of recognizable items. The implementation of the proposal may require additional funding, but this will only become clear during the training. The risk of this project is especially the difficult to understand. Another risk will be to find enough math teachers who are interested in Haskell.", "q1r": 4, "q2": "There is a roadmap with milestones and also a timeline for the realization. Everything is well described. Clear KPIs and SDGs (Sustainable Development Goals) are also described in the proposal. The completion of the task is when the teachers are trained and clubs are established in the schools. The project will be successful when 100 math teachers are trained to use Haskell and children start using Haskell to code. The petitioner has cited the shortage of Haskell programmers. By teaching mathematics teachers to program in Haskell, this shortage can be partly compensated. It is also good to introduce children to Haskell from an early age.", "q2r": 4, "assessor": "z_assessor_3308", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12405, "q0": "The idea of this proposal is to conduct course to train math teachers of the Haskell programming language. I think the idea itself is pretty interesting, especially the decision to target math teachers, because having a mathematic background can give competitive edge to understand several mathematical concepts that are central to certain subject of Haskell. And the overarching goal of the project is definitely beneficial to the Cardano ecosystem by growing the talent pools of developers with the competency and skills to work on Cardano projects. However, at the moment, the proposal is very general on what it’s trying to achieve. What I mean is, there were no further explanations on what the contents are specifically. A syllabus going over the content of the coursework would definitely be appreciated (e.g. using basic functions, record types, algebraic data types, standard libraries, functors, monads, and the list goes on). ", "q0r": 3, "q1": "The team members claimed to have experience designing a Plutus course for European Business University and working as a certified educator, which are relevant skills needed to implement this project. However, there were zero links providing evidence to back up their claims. The plan of implementation does provide the milestones of this project however there were no roadmap at all detailing the start, length, and end of the project as well as the specific timeline for each milestone. The budget was broken down into several items, such as fee for creating courses, training, documentation, etc. However, there is no explanation regarding the justification for these numbers. For example, information such as total workhours for each item, the requested hourly rate, and number of people involved on each item were not touched on at all.\n\nOverall. with no links providing evidence of the team members experience, lack of project timelines, and the lack of justification regarding the budget breakdown, I can’t see this project being feasible.", "q1r": 1, "q2": "The success metric chosen for this project is that “the teachers are trained to use Haskell” which is a relevant criterion for the goal of this project. However, there were no explanations regarding how this metric will be measured (e.g. will it be measured via test? or via project’s done by the participant? or by the number of participants joining a project? or will be measured via a different way?). Without a concrete way to measure the metric, the project performance can only be evaluated qualitatively. Additionally, there were lack of mentions on how or where the metric will be reported. Therefore, I do think that the auditability aspect of this proposal is still lacking.   ", "q2r": 2, "assessor": "z_assessor_3408", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12540, "q0": "After reading this whole proposal, I think that it has been written incompletely as Catalyst guidelines/ requirements for a proposal (maybe this is the first time the proposer writes a proposal). I can understand that Math teachers are the type of people who can learn Haskell easier than others, but the proposer did not explain why Cardano needs them particularly/ especially. \nThe idea of training Math teachers to learn Haskell is a good start, but the whole proposal does not show a strong link between it and Cardano. As a PA and I think also voters, we expect to see how these teachers would contribute to Cardano after learning the new coding language.", "q0r": 2, "q1": "The team should have attached the reference/ profile of each member. \nThe detailed plan should have informed:\n- Which countries/ regions in Eastern Africa will be applied?\n- What level of Math teachers?\n- How to approach the teachers?\n- Specific timeline of the project\n- How possible it is for only Ms Angela to design the course and teach everybody herself when she has been in charge of other proposals last fund and this fund?\n\nThese are some of my suggestions for the proposer to enhance the feasibility. I hope this help. ", "q1r": 2, "q2": "This proposal only has a KPI for 100 Math teachers who have been trained. I don't see the metrics that are relevant to the criteria of this challenge or Cardano (like how many people onboard/involved). \nThere are steps to do the project but there is no roadmap with a time horizon and milestones.\nThis proposal does not provide me with enough information to audit its progress to success.", "q2r": 2, "assessor": "z_assessor_3427", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 13750, "q0": "Train math teachers to teach Haskell programming online in East Africa through MoodleDocs. Implementing the idea of adding more developers in Africa is in line with the challenge. Implementing the proposed proposal has an impact on Cardano's ecosystem that increases developers. There is not too much information about the solution to implement the proposal, the attraction of math teachers willing to participate in the training course has not been mentioned. Math teachers after the course will be about training students how to use Haskell is difficult to do. As we know knowledge of Haskell is not simply reading the material, but this is a whole process of practice that makes up the smartcontract from simple to complex. Starting with Haskell is a month-long or even year-long process, Haskell is quite abstract without a serious learning process that will be difficult to master. Students of different ages have different perceptions, so it is difficult to practice using Haskell. How should the proposal set specific objectives for Haskell's application? What role haskell played for Cardano? When you are really interested in Haskell, the learner will have the right perceptions, research and practice, now bring real value to Cardano. The way to solve the problem of the proposal is not really convincing. The proposed risk is the author's ability to implement blockchain application, and the risk reduction is not really convincing. This proves that the author's ability to implement the proposal is not really high.\nI rated: 2\n", "q0r": 2, "q1": "We haven't seen the resources needed for the implementation of the proposal, Angela is the one who designed the course but there is no information about her yet. Learning Haskell isn't as simple as you might think, it's even harder to train Haskell learners. We have an opinion on the proposal to add additional resources to implement the proposal, have full experience and skills in this. The implementation plan of the proposed proposal is general, there are no timelines for implementing the proposal. Details of the implementation process have not been given, registration is being made but there is no timetable for training sessions. Selecting 100 math teachers for training doesn't seem to be based on the willingness of teachers to learn, which will be difficult to create new developers. The required amount can be spent properly, the budget analysis needs to be more detailed. We haven't seen people who do the training have money for labor hours.\nI rated: 2\n", "q1r": 2, "q2": "The roadmap for implementing the proposal is unclear, the success of the proposal given by the author depends on the completion of the tasks of the trained teacher is not yet grounded to determine. The proposal needs to identify specific objectives: Has the trained teacher achieved the full capacity of Haskell? Is it possible to teach Haskell to students? The number of clubs at the school established? The proposed index/KPI cannot be audited, the author does not give reports on the implementation of the proposal. We can't determine if the proposal is being implemented.\nI rated: 1\n", "q2r": 1, "assessor": "z_assessor_3777", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Train Math teachers to teach Haskel ", "experience": "Angela: Haskel Plutus course designer of European Business University and PBL course creator of Gimbalabs \nAnne: Microsoft in Education global training Partner, Microsoft Certified Educator, More than 5000 teachers trained in ICT and education "}