{"id": 417579, "author": "fatousowmali", "title": "EDUCATE SENEGAL INNOVATORS - DI/FI", "url": "https://cardano.ideascale.com/a/dtd/417579-48088", "category": 26600, "amount": 300000, "description": "Young Senegalese regenerative innovators need to learn about intellectual property and digital and financial identity-building, towards using a new monetisation model linking ADA with Financial Tech.", "f6_no_assessments": 5, "f6_rating": 3.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2708, "q0": "This proposal's impact aligns well with the Challenge in some respects, particularly in its aim to address the \"poor inclusion of local knowledge\" for African projects, and to redress bias and lack of understanding of the specific issues that African entrepreneurs face. Its aim to recast the \"story\" that is often told about Africa aligns well with the Challenge goals; and I like that the proposer is taking a wide-ranging apporoach, and covering not only the need for individual support for individual entrepreneurs, but also looking at the wider regulatory and governmental framework. The proposal is clearly aiming to address some very significant and impactful issues - the need of entrepreneurs to know that their ideas have value and can be protected by intellectual property rights, and their need for access to training, capacity-building, and support - but I am a little unconvinced by the proposal's focus on supporting \"young\" entrepreneurs only. First, it's not clear what \"young\" means, or what the age cut-off is - and second, it's not clear if the team would actually exclude a promising entrepreneur who happened to be older than whatever age limit they had set? If they would, it's hard not to see that as deliberately choosing to limit the proposal's potential impact. Ageism doesn't mesh well with the proposers' explanation of the barriers faced by African entrepreneurs - after all, since would-be entrepreneurs in Africa are facing all the barriers described so well in the proposal, it's not surprising if, as a consequence of these barriers, some of them are unable to attempt to pursue their dream until they are no longer young. Another problem in this Impact section is in the fact that the proposal's risk assessment is missing (it reads \"See measuring systems section\", but there is no such section in the proposal). I feel that particularly for such a multi-faceted, high-budget proposal, we do need to see a risk assessment to properly evaluate impact. So although I agree that the project, if it was delivered as planned, would clearly have some degree of positive impact, I think there are some concerns.", "q0r": 4, "q1": "There are some issues with the feasibility of the project. First, there's the question of the unnamed, celebrity \"award-winning Senegalese singer-songwriter, farmer, educator and activist\" who will spearhead it. From the description given of his career, it seems likely that it is Baaba Maal - if so, his involvement would certainly draw attention, and contribute a lot to the success of the project; but the difficulty is that we don't know for sure that is *is* him; and if it is, we don't know how far negotiations have progressed to secure his definite involvement. I can, of course, see reasons why his name might need to be confidential at this point - but this makes some aspects of feasibility hard to assess, because a significant part of the proposal rests on promoting and showcasing the project via a large-scale event featuring this celebrity's name. Even if he can't be identified as such in the proposal, I would like to see some information about what the situation is - has he merely been thought of as someone to approach, or has he been approached, or has there been some expression of interest or even agreement in principle? And crucially, what is the plan for what happens if he is not on board after all? There is a similar issue with the launch of the project being \"in conjunction with a globally-known brand content release\". If these elements are not in place and could possibly fall through, it could badly damage the level of publicity and interest that the project will generate. This relates back to the issue in \"Impact\" of the lack of a risk assessment. Another feasibility issue is that no budget breakdown at all is given - the use of \"TBD\" suggests this is probably an oversight and the proposer meant to include it, but it's a pretty big oversight for such a high-budget proposal, and does not give me confidence in the proposer's project management skills, attention to detail, or level of commitment to Project Catalyst. There is a large and varied project team, which is very positive - but none of them mention having any knowledge of or interest in Cardano. This is not necessarily a problem in itself, as the project aims to use \"vetted members of the Cardano community\" to deliver training - but it is rather unclear what this means. How will they be selected and who will \"vet\" them, if there is nobody on the team who can do so? Generally, I feel a project whose main  focus is \"seeding and growing Cardano in Africa\" should have at least one team member who has some links with or interest in Cardano - the fact that nobody on the team has this, raises questions for me on how feasible it is. The time plan is also a little confusing - the project may actually have already begun (the proposal says it started in July) and yet several basics are not yet defined. for example, I can't see anything about how many young entrepreneurs will be selected to take part in the acceleration programme, and who the stakeholders are seems poorly defined for a project that is starting imminently:  \"Partnership development with Senegalese and international collaborators, including domestic and international agencies, non-profit organizations, and other stakeholders\" - I would expect to see one or two possibilities named, even if they are not already in place. Overall, the vagueness and lack of clarity on things that have a strong impact on feasibility (budget, timeplan, who will be doing what) makes me feel that the project is not feasible, or at least, that it faces too many feasibility issues that are not acknowledged and addressed.", "q1r": 2, "q2": "The proposer gives a lengthy answer to the question on what they will measure to track their project - but unfortunately, without giving much information about what they actually will measure. There is little here that could enable the community to track the progress of the project, apart from two reports that the proposer will deliver - but it's unclear how and where those will be shared. In general, it's unclear where the proposer will store information about their progress to enable the community to access it; and a lot of the information is fairly vague - for example, the proposer says they will \"implement project management processes\" to \"enable coordination\" but doesn't say what exactly those project management processes will enable us to track. Some of the sections appear to start mid-thought, or even mid sentence, giving the impression that the information has been cut and pasted from some other source, perhaps not a particularly suitable or relevant one. Overall, most of this section is essentially additional description of how the proposer will work, and what they will do, rather than information on how that work can be audited. It seems possible that the proposer may have misunderstood the question a bit, which is unfortunate, but still makes it very diffocult to assess this section positively. The section on \"what does success look like\" is considerably clearer and more focused, and actually very helpful in the way it summarises what the proposer hopes to achieve - but there is still an overall absense of any clear metrics or deliverables we can track, apart from the two reports. On balance, I can only say that as it stands, this proposal is not auditable.", "q2r": 2, "assessor": "z_assessor_2343", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3463, "q0": "Proposals is really well strucutred, providing an articulated overview on how the mentoring programme in blockchain and De-FI wil work and what its value proposition is for Seneral. It also solves (at least partially) the problem stated here. I really appreciate how the phases of it are devidied, helping to understand how the program will work and making it easier to assess its full impact. Mentorship initiatives like these are always imporant, specially considering when they have a local impact. It is so because the program can adapt to the reality of each place and collaborate with existing organizations in the country, as proposed here. Other nice thing here is that the programme will be designed to be scalable to other regions, which can increase its impact in the future. Other good point is that proposer is already considering the development of a proper communication strategy (though some insights on it could be brought here already)\n\nAs for the challenge alignments, it fits well here, addressing several challenge kpis and helping to answer the challenge question of \"How do we continue to seed and grow adoption in 2022 and beyond?\"\n\nIn conclusion, I'll rate as 5 as this is a high potential project and proposal brings most of the imporant information necessary to understand how it will work,", "q0r": 5, "q1": "There's a very complete plan provided, time-framed, containing activities with a nice level of details and clear deliverbales in each part. Althoguh the duration of each phase is the project plan itself, it can be found in the second attachment provided. I liked proposer described the objective of each project phase before listing the activities and also informs the critical path.\n\nFor the budget, unfortunately no breakdown is provided (it says TBA). I saw on the comments that proposal was not able to submit this part on time, so, next time, I'd suggest to include this as a comment. Althoguh it is not ideal, at least it is possible to assess from there.", "q1r": 3, "q2": "As the scope of this proposal is only the Design and Planning parts, and not the full implementation of the project, I undeerstand its hard to set some metrics right now (though they are essential in the upcoming parts). \nHaving said that, the plan has plenty of good deliverables and milestones that will help to assess project as it goes. The auditability section also provides good outcomes that will be the results of this proposal. For instance, I liked a lot proposer already considers feedback here. The reports that will be produced will also help a lot to scale the solution.\n Its just important that all this information are properly communicated to community in a public online space (an online gantt chart would help a lot). ", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 3860, "q0": "A great idea, it identifies many of the problems that need to be solved in this challenge, it covers almost all of the problems the challenge poses, it can expand rapidly and large to many other places, they can also solve problems that arise in the future, this is a very good proposition, it brings great development value to the Cardano ecosystem. I would like to see this project again in the next Foundation if this proposal is not Funded in this Fund. Not only young Senegalese but all over Africa need to learn about new monetization models linked with ADA through Financial Tech, this is an issue that global youth need to pay attention to and research and develop.\n\nThe impact of this project is quite large, the solution of this proposed idea is huge, and it identifies almost every problem to be solved in this challenge, in addition to the author's argument through a realistic description. reasonableness, clarity, and completeness. Key lessons learned: implement by exploring the use of existing technology tools like Cardano's Atala Prism system, and draw inspiration from references like the Esusu model, tied to Fintech platforms like Wave, a mobile payment provider similar to Paypal (with mobile money accounts, not bank accounts), also operates a network of merchants that use their cash transfers to Wave users and cheaper for users than mobile money transfer services provided by telecom companies\n\nThe description of this proposed idea does not measure risk in execution, I look forward to seeing the addition of risk management details in the next Fund if the idea is still alive.\n", "q0r": 3, "q1": "The proposal to introduce unclear and detailed work implementation timelines compared with limited implementation resources will affect the project audit process. The proposal only estimates the project completion time and the goals achieved in general, the community needs a more detailed implementation plan corresponding to the implementation timeline, the author can refer to the Microsoft Project tool Management (or a similar tool) to support a more detailed and methodical schedule.\n\nThe required project budget exceeded 50% of the total budget of this challenge, compared to the project information provided, the author did not have any detailed explanation of the project budget. . The budget of a project is very important, it reflects the experience of the project owner, I need this information to add in the next Fund should I come across this proposal again.\n\nHuman resources to implement this project have been assigned specific jobs for each item, and the experience of the members shows that they are entirely suitable for the project. However, the identities of the members are also difficult to verify. clear. The author of this project, Fatou Sow, and his collaborators Yann LeMoel (LLF), Herland Cerveaux (LLF), Jean-Louis Robadey (RDG), and Tammy Tullis (RDG), suggest that this is a group that has experience in implementing this project, however, the author please provide more reputable identity verification links such as LinkedIn, Facebook, Twitter, Discord, ... for the community to verify identity easily and correctly reality.\n", "q1r": 2, "q2": "This project does not provide KPIs to accomplish project goals, idea creators please provide more complete project KPIs. Based on the schedule that the author has provided, please provide the KPI corresponding to that timeline, how long will the project achieve the corresponding goals? Thus, the community will easily track the progress of the project.\n\nThe scheme has clearly defined success, the information from the scheme shows what is being done and how it is being done and the testing has achieved considerable initial success which is amazing.\n\nBrand new idea information on Cardano platform, never received any funding from Cardano ecosystem.\n", "q2r": 3, "assessor": "z_assessor_2489", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4040, "q0": "This is a thorough and substantiated proposal. However, the parts with TBA (such as budget breakdown and sustainable development goals) sadly hamper the quality of the proposal because it gives the impression the proposer has abandoned it. Despite that, the idea described is that Africa Grain will promote mobilization to support and amplify a regeneration led by young entrepreneur people in Africa. They intend to organize events, form partnerships with Senegalese and international collaborators and invest in marketing and branding of Cardano. As can be seen their goal is to boost Cardano and blockchain-related technology knowledge coupled with attracting and supporting entrepreneurs in Africa to create a positive social and economic impact. That strongly aligns with the goals of the campaign. Additionally, the team has also discussed how they plan to scale their plan. By designing from the beginning a solution with a replicable and scalable mindset they possess a higher probability of achieving success in this area.", "q0r": 4, "q1": "The proposal describes the experiences of five people and two companies but unfortunately fails to provides evidence to support those claims. The only links they provide are from IxSA and Living Labs and IxSA is only mentioned because Living Lab’s founder is a co-founder of it. There is no budget breakdown so it is impossible to assess if they can identify how many and what type of members will be necessary to implement the plan and if the estimated values are reasonable (because there are no values, only the total amount requested). Moreover, the team is asking for USD 300k which is completely disproportional to the plan described. Also, in the detailed plan there is no timetable so again it is not possible to judge if the planned actions are realistic.", "q1r": 1, "q2": "The team has constructed a roadmap with clear milestones in the form of deliverables. For example, for part B of the plan the deliverable is a mapping assessment report. However, there are no time horizons in the plan which is a severe fault. Additionally, there are no clear KPIs defined in the proposal. As a suggestion they could have defined number of Africa-based users onboarded onto Cardano, number of the wallets created, number of people attending their events and number of new businesses started after they have offered their support. All in all, their plan is understandable and it is an effective solution to address the problems of lack of visibility and adoption of Cardano in Africa but the downsides previously mentioned are concerning. Additionally, the team has not provided a public channel to update the community regarding the progress of the proposal.", "q2r": 2, "assessor": "z_assessor_2513", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5229, "q0": "Learning about intellectual property and digital and financial identity-building is a way for young people to start a business in this field, and the project also has a pretty good approach that combines the above topic with using a new monetization model linking ADA with Financial Tech. This is a pretty new and unique idea.\n\nBut looking at your proposal, the application of Blockchain and ADA is described quite briefly, the main content is that you will use Cardano's Atala Prism system to generate digital and financial identities. But specifically how to use it is not mentioned in detail.", "q0r": 4, "q1": "Regarding the action plan to implement this proposal, it is described in detail by you, but it is not tied to specific timelines, so it is difficult to assess that these tasks can be completed in time or not.\n\nIn terms of budget, your proposal is $300,000, which is quite a large number compared to the total budget of this challenge of $500,000, but it is not listed in detail and is left as \"TBD\". This is quite vague and the number above is completely unconvincing.\n\nThere are 05 project participants along with 02 organizations participating in this project, described as having quite a lot of experience in social and educational activities. However, there is still a lack of members with technical experience related to Blockchain and especially Cardano.", "q1r": 3, "q2": "Rate 4\n\nThe way to monitor the project's activities is described in detail in the proposal. However, there is still a lack of effective metrics to know if the project is successful or not. For example, you can let the number of people participating in training (KPI: 100 people), the number of ADA wallets created (KPI: 100 wallet addresses),...", "q2r": 4, "assessor": "z_assessor_2678", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Africa Grain is an acceleration and communications program to support youth regenerative entrepreneurs on the Continent through mentoring and impact investments, and using innovation and amplification", "experience": "Working -w- key informants at national & regional level through public & private sectors. Integrated management planning, governance, & developing funding & investment instruments & their transition to investable project portfolios. Network of partners for impact & amplification."}