{"id": 418257, "author": "wada", "title": "Nurturing Roots in Africa", "url": "https://cardano.ideascale.com/a/dtd/418257-48088", "category": 26600, "amount": 55000, "description": "Wada hubs are off to a great start, but are not yet able to fully self sustain themselves. The next level of support is needed to continue their 3 year path to financial independence.", "f6_no_assessments": 33, "f6_rating": 4.757575757575758, "videos": [], "media": [], "f6_assessments": [{"id": 450, "q0": "Having experienced an offline Cardano effort myself, I have had first hand experience on how direct communications are more effective. For it inspired multiple direct communications that lead to having the city I visited setting up their own Cardano Hub. It seems the allure of direct meeting still can not be replaced, this perhaps is even more prevalent in the African culture, where the sense of community is still very strong.\n\nAs part of a online organization also that spans thousands of kilometers, boots on the ground coordination unfortunately still get things down quicker than online efforts. For having continuous physical presence, subliminally forces us to continuously work.\n\nPerhaps an added bonus, is by being in close proximity, more can be achieved and talked about. Potentially creating a better and cohesive work culture.", "q0r": 5, "q1": "The individuals are active community members of Catalyst, one heavy consideration I have regarding using funds to set-up brick and mortar hubs is the transparency, management and effectiveness of the use of funds and of the solution. Especially since in there offered plan, for the first and second year, the funds use would mostly go to infrastructure. Seeing the number of hubs the team seek to set-up, I assume this potential 2 (two) year duration incorporates all hubs. I am assuming this duration is due to anticipating the legal permits that need to be applied for. Because other than that, 2 (two) years to setup hubs is a bit time consuming. \n\nThough having going through their available Linked profile. There are multiple individuals who have been in key positions of their respective companies does instill confidence that this duration discrepancies perhaps has been anticipated and is as assumed, which is to accommodate the legal aspects of things.\n\nAnother consideration, regarding the end-goal of having a brick and mortar hub, which is to foster frequent discussions, initially I had concerns that being focused on setting up the physical hubs that the virtual Africa Town Hall might be neglected but after recollecting my assessments this would not be the case. They have grown their initial team to support all their efforts simultaneously.", "q1r": 4, "q2": "Although they have provided a detailed budget, their experience in setting up a propoper time table falls a bit short. There is only a general budget accompanied by a general timeline. There is also no specific PIC for each action taken and for each hub. Perhaps I might be too meticulous for what they seek to achieve is not 100% a brick and mortar hub but more towards renting a property. Though it would have not hurt to have a detailed reporting to assist in accounting and potentially setting up a new precedent/practice for proposers seeking to set up their own hub.\n\nBeside that, I am 100% for giving the WADA team opportunity to execute this idea. There were previous proposers that requested something similar but was unclear on their focus. Knowing WADA's track record, I am confident their heart and mind is truly for the development of Cardano in Africa.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 19, "ne": 2, "ng": 17, "nfo": 0, "vca_o": 1}, {"id": 13713, "q0": "Just as mentioned in the brief of this proposal, the nurturing roots in Africa which is about \"Funding the next level of support for new and existing Wada hubs across the continent. This will enable them to better collaborate, coordinate, educate and initiate building out local use cases.\", presents immense opportunity to cardano blockchain adoption.The proposal will also grow cardano by ensuring a good solution on the grounds by focusing more on infrastructure. ", "q0r": 4, "q1": "[FEASIBILITY] \nGiven that the equipments for the proposal has been clearly stated for that of infrastructure, education and the creation of the Dapp which will be financially independent from Wada, and also the budget has been outlined in the best possible with everything and its cost, so yeah it is highly feasible. The only problem is the time duration for the implementation. ", "q1r": 4, "q2": "[AUDITABILITY] \nSince the proposal seek to identity existing developers and businesses, new developers and new start ups, then it aligns with the challenge grow Africa grow cardano which focuses on Africa getting some backing, commercial projects that are already building up in Africa to get the original support from the community and cardano getting encouraging environment for mass adoption leading to the success of the project from the proposal.  ", "q2r": 5, "assessor": "z_assessor_3759", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 13569, "q0": "The proposal describes problems that is preventing Africa from undergoing a full-fledged adoption. The proposal tackles the real problems faced  in Africa especially the absence of certain infrastructure that will help users, developers, teachers, students engage fully into cardano  blockchain, the internet  connection issue and others. These actually affect the flow of information and communication in most parts of Africa. The proposal has the potential of upbringing new PAs , vPAs ,referrers and more as far as caardano blockchain is concerned. The proposal is also focusing on using infrastructure and education to outreach the people in Africa (that is sub Sahara region) as it addresses the challenge and in so doing will ensure that many future challenges are taken cared of. The proposal addresses the challenge very effectively.", "q0r": 5, "q1": "The proposal has a careful layout plan to achieve the set goal of the proposal. The timeline drawn to carryout  the steps in the proposal is feasible  as phase 1 focuses on preparations (that is the acquisition of resources) towards the project and phase 2 focuses on the actual impact that is the training and educating and then the last the results of the project. The budget is reasonable to achieve the set goal and the broken down of the budget is also clear though many things having variable prices. The proposal has links and references which shows they (the proposal and the team) have the necessary experience and relevant skills to implement the proposal successfully. There has been a proposal implemented before so it is easier to undertake this with the gathered experience from the previous fund which was a success.", "q1r": 5, "q2": "With Wada membership portal activity (track number of users, number of posts per day) etc. will ensure the progress of the proposal as well as the using the media to record activities during the project and making reports. The success of the project is aimed at identifying existing developers and businesses willing to create on the Cardano protocol, new developers recruited and/or for the Cardano ecosystem, new start-ups willing to join Wada as Hub or Partner and create on the Cardano protocol and increase in Cardano protocol transactions originating from Africa. The records and reports made to the community will also help track down the progress of this proposal. The proposal is very brilliant and the information provided is sufficient to audit the progress and the success of this proposal.", "q2r": 5, "assessor": "z_assessor_3696", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12340, "q0": "The problem in the proposal aligns with the challenge setting. The idea of Wada seeks support to continue a 3-year path of financial independence. The activities of Wada contributes to the cardona ecosystem. This is continuation of a project in fund 6. A brief statement of what was achieved in the fund 6 is provided. The current proposal has provided a clear picture of activities what it intends to do and how the project will continue to carry out the listed activities, if the project is funded. The Wada hubs in providing many youths in Africa immense opportunities in several areas. The project seeks to grow Cardano in Africa through building an infrastructure, education and outreachs. The proposal considers risk to its implementation and how these risk can be addressed. An example is the issue with the unregulated nature of cryptocurrencies in many countries. WADA seeks to ensure adherence to local regulation to any extent possible.", "q0r": 5, "q1": "The team members are hub leads from their local hubs of jurisdiction. This shows links with the experiences and relevant skills of the members on the team. The project plan outlines a timeline of activities and what is expected to be done during the stated period of time. The project has been put into 3 phases to be executed showing what is to be expected at each phase of its execution. However, I'm not too sure about the budget provision which has been left out of the proposal. I think detailing out estimates to this effect can be realized. This will show how the project intends to use the requested amount stated in the proposal. I believe if the project receives the needed funding it  can be implemented.", "q1r": 4, "q2": "There is clarity of information that has been provided. The proposal has provided detailed information on how it intends to address the problem which is in line with Cardano's objectives. There is a clear roadmap providing details on how this project can be achieved showing a timeline of activities with deadlines for the listed activities. The project has provided information ", "q2r": 5, "assessor": "z_assessor_3401", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 12083, "q0": "The proposal describes the proposed solution to the challenge of preparing Africa for a future of mass cardano adoption. How do we continue to seed and grow adoption in 2022 and beyond? By ensuring best-in-class solutions, we highlight Cardano's cutting-edge solutions in sub-Saharan Africa. Focus on infrastructure. Education, Outreach to address specific goals The proposal also identifies the key risks that could prevent you from successfully implementing your project and how each of these risks will be mitigated. The proposal can be scaled to address future challenges. as it is a sequel to their successful fund. Proposal 6: Rooting in Africa aims for its centers to be fully self-sufficient after 3 years of Wada/Catalyst support. This proposal would provide the next level of support for existing hubs as well as the first level of support for newer hubs, clearly presenting a plan for future sustainability.\n", "q0r": 5, "q1": "\"getting the work done. to gain independence for the centers.\n\nHaving provided a detailed budget breakdown clearly outlined and broken down into identifiable items, Wada through Planting Roots in Africa and now the proposal is providing the following support to the centers, based on their maturity.Proponents provide evidence of the relevant skills and experience required to implement the Wada proposal: A skilled team of Cardano Community practitioners and entrepreneurs, located in centers across Africa and the community. Wada Center: Foundation Center: Cameroon (DITC), Ghana. First Year Center: Nigeria, DRC (2 locations: Goma and Kinshasa), Ghana (North). The proponent knows, in a definable way, the type and number of team members required to implement the proposal.If additional funding was needed to implement the proposal, the proponent provided a verifiable plan on the issue as this would support the next 6 months of the three-year plan towards independence. The establishment of the center should anticipate returning to Catalyst for more funding. The plan describes all the resources needed to implement the proposal. The proposal clearly explains technical aspects such as architecture, language, and the like. language, and technology if they are critical to performance.\"\n", "q1r": 5, "q2": "The proposal offers a road map with distinct objectives and deadlines for completion, assessing the project's progress regularly. Wada will experience considerable Cardano market expansion now and in the future in all of the nations where Wada operates thanks to design solutions and the development of dApps, as well as ongoing capacity and capacity building. In Sub-Saharan Africa, Wada will have a network of hubs or hubs that are linked to Cardano and the digital economy locally, nationally, and internationally. Give a precise description of the issue and a workable solution. a channel that is open to the public that regularly updates the neighborhood on developments. Proposal This is an extension of the profitable fund. The Sixth Amendment: Establishing Roots in Africa This will establish a strong basis for Africa's future and prepare it for more.\n", "q2r": 5, "assessor": "z_assessor_3356", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11669, "q0": "The proposer has done a great job by outlining this key issues that effectively addresses the challenge.  Africa presents itself with immense opportunity for cardano adoption however well documented barriers  of the continent can hinder this adoption and the proposer has dealt with the problem from the root providing great solutions to this problem hence cause an increase in the adoption rate in Africa which would be a great impact on the continent for cardano. Furthermore, a problem is well handled from the root cause of which  the proposer has done so well by identifying this fundamental causes of why adoption of cardano in Africa is a problem and I believe if funded this project would produce great results for cardano blockchain in Africa and the globe.  Also future challenges have been scaled up and suggested solutions outlined incase it arises which is a great work by the proposer.", "q0r": 5, "q1": "The proposal is superb.  A well outlined plan has been  given to follow in achieving the objectives of the proposal.  Also a time line is attached to the plan to measure progress and success of this project.  All resources needed to accomplish the proposal has also been given which is a good work by the proposer.  In as much as the proposal need to be funded and executed, without a budget it would be difficult . And the proposer has done so well by providing us a budget and further breaking it down into identifiable items reasonable for achieving the objectives of the proposal.  Whoever works on a proposal is as important as the proposal.  And so the proposer again did so well by carefully selecting well resourced team members for this particular proposal.  I therefore believe that with the details captured the proposal is likely to be implemented successfully if funded. ", "q1r": 5, "q2": "Indicators have been outlined by the proposer to be used in measuring the progress of the proposal which is a great work done by the proposer.  Key metrics has also been outlined under the heading how success would look like, and with yhis metrics,  success of the project can be measured. With this few information provided by the proposer,  I believe that the proposal can be audited  successfully. ", "q2r": 5, "assessor": "z_assessor_3265", "no_vca": 12, "ne": 1, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 11642, "q0": "The PROPOSER has done a great job by placing it on its right challenge. The effectively addresses the potential of bringing values to the community in the African countries and to the Cardano ecosystem. The proposal team clearly provide a precise solution to the stated problem by indicating the purpose of the project proposal such as, Internet access that will support inter hub and interaction cyber meeting as well as stoke pool operating that must be presure and acquired,etc, the proposal also done well by indicating that, the proposal is a continuation of fund 6. \n      To add to these,the proposal team also able to capture some important key metrics under the compaign brief which will make impact in the Cardano ecosystem should they be funded to execute their project which I strongly believe they will do a great job if they are funded to execute their project.", "q0r": 5, "q1": "The proposal team has done well by providing the timeline and key milestones to deliver their project such as, emphasis on infrastructure, education, Dapps creating and timeline of 3years plus should they be funded. To add to these the proposal is able to provide details of Budget breakdown of funds to ON how it will be used should they be funded which I strongly believe it's COMMENDABLE. In view of these the proposal also identify some risk challenge that could prevent them from executing their project, but are able to navigate solution to them .\n   Furthermore the proposal team is able to provide details of team members who will help in the execution of their project and I strongly believe they have the Desired Skills and experience to carry out the project if they are funded", "q1r": 5, "q2": "The proposal team has done well by indicating the measure to track their progress through some key metrics to look out for such as community engagement (Wada members and other Wada social media), Events, Development, engagement, infectructure and business plan and specialization should they be funded to execute their project which I strongly believe is commerciabl.\n     In view of these, the team is also able to indicate how success and progress of their project will be monitored and reported back to the Cardano ecosystem through their website and community response. Some of the key milestone are . Three years path independent for Hub\nFirst year (1-2years), \nEmphasis on infrastructure (physical space, furniture etc).\nSecond year (2-3years)\nEmphasis on education\nThird year (3+years)\nHub will be able to financially independent from Wada as they will now have the tools and knowledge to create their own Dapps.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 11626, "q0": "The proposer and the team have done a good job by placing effectively the challenge to address the problems that pertains to Africa in the Cardano blockchain ecosystems in correct challenge category, which most African countries are undergoing. The proposer has done well by outlining and listing  many benefits this will bring to the Cardona  ecosystems in Africa and has also given some success they have had in some of the funds they participated that is linked to this new proposals, the proposal seek to scale up Adoption Cardano a ecosystems in Africa but these will be possible only when basic infrastructure, internet assess and basic needs such Hardware are required to create the opportunity for Africa to scale up in Cardona ecosystems. The proposal key metrics that is linked to this challenge has been well focused on Infrastructure, education and outreach to help in rooting CARDANO ecosystems in Africa. The proposer and the team have collectively collaboration with others partners working on addressing future challenges and also working on sustaining their projects in future and ongoing projects by this partnership there will be a future for this proposal too if funded. ", "q0r": 5, "q1": "The proposer and the team have shared links, references and ongoing projects that shows their skills and experiences needed to implement the proposal. The proposal has also indicate who the team members are and their country they are link to and their roles in the proposal implementation. The proposer has a budget, it has break down on how funds will allocated at various Countries in Africa and they are itemized for each allocation and the budget is quite reasonable to the set goal. The proposal has also elaborated the time needed for this implementation ranging from 1year to 3years which are in phases with the first phase of six months, the proposer indicates it Will need additional funding to complete the other phases. The proposal has in it a master plan of how the proposal will be implemented, the work ongoing that this project is built on, how it will be implemented and those it will benefit when funding is made available and how much value it will add to the CARDANO  ecosystems in Africa.The proposal has a detailed plan on on the six month project on how much resources is necessary to make progress a successful. The proposal has cut across both English and French speaking countries with their representations to make easy to understand and also has list persons with their expertises in it that will help in the implementation stages at their levels. The proposer with the team  has outlined various possible risks CARDANO blockchain ecosystems faces in Africa such as legalization, coordination/standards and costs over runs and has clearly given workable solutions to the above risk which can minimize and mitigate the risk pose to the success of the proposal. It will impact and add value to project catalyst on the CARDANO blockchain ecosystems in Africa if funding.  ", "q1r": 5, "q2": "The proposer and the team describes how the progress of the proposal will be measured and this will done the tracking the community engagement through the WADA membership portal activity by new users, number of Events held and how many attendees, and by developer engagement. The key metrics for success of the proposal were community engagement, Events Developer engagement infrastructure and business plan and specifications were their driving forces to the success of the proposal. The proposal has a targeted problem within Africa that hindered blockchain technology in Africa in relation to infrastructure, internet assess and basic hardwares needed to scale up Cardano Adoption in Africa. The proposal has also has clearly defined specific solutions to the problem identified and those solutions when implemented one can measure the outcome of it relating to the success. The proposer and the team have shared links and other channels of communication to the community and one can engage them, and also see their updates. I believe this should be funded to help scale up projects catalyst in Africa.", "q2r": 5, "assessor": "z_assessor_3262", "no_vca": 10, "ne": 3, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11599, "q0": "The proposer has identified a problem in Africa which serve as a hindrance to the Spread of cardano ecosystem in Africa of which they have decided to use wada hubs to establish offices in strategic regions in order to bring to bare the activities of cardano to the general public of Africa. The proposer and his team have intentionally plan to set up offices at strategic points in order to be able to win people into the cardano ecosystem. With the establishment of wada hub offices across the length and breadth of Africa will make cardano ecosystem visible and attractive to the youth and tertiary students. The problem or the challenges facing Africa has been identified buy the proposer and his team such as infrastructure, education, outreach. The proposer with his vast knowledge in cardano ecosystem after having gone through the fund6 successfully has brought to bare plans they intend to carry out which will see a successful flow of cardano ecosystem in Africa. The proposer and his team has identified a number of risks involved in the carrying out of this cardano ecosystem Project and so have also identified risk management plans to deal with any unforeseen risk that will emerge in the course of implementing this project. Going through the project I realise the proposer had an in depth knowledge of what his projects is about and I agree that the project if funded will be a game changer in Africa by making Africa a lead participator in cardano ecosystem and not a follower as usual,I therefore say the project be funded to enable the proposer and his team carry out their project successfully. The proposer and his team deserve a commendation for the great work done.", "q0r": 5, "q1": "The proposer and his team has given a detailed budgetary allocation to the projects above, they have also gone ahead to break the budgetary allocation down into bits for easy understanding. The proposer has set up lead hubs in every country to disbursed of the funds. The proposal has also indicated the timelines they will take to accomplish these projects. The proposer and his team are optimistic that by the end of the year 3 year period If funded will be self sustainable and will not rely on either wada or project catalyst for funding if this project is funded. Going to the budgetary allocation I realise that these are the things that the funds, if funded are allocated to for judicious use during the course of the  three-year period Infrastructure, physical space, furniture, electricity, Utilities, music equipment, Lead hubs, education, educational programs, wada branding  and coordination these if sum up makes the requested or the demanded budget feasible for this project and this will help in the execution of this project if funded.", "q1r": 5, "q2": "Information provided above is sufficient enough for auditability the proposer having been a member of the project catalyst and cardano ecosystem in the fund6 who is also a member of wada is in good standing. Wada as a reputable blockchain organisation will track the usage of these funds through its membership portal activity track, that is number of users per day, number of post per day, number of events shared across hubs, attendance at events that is both in person and online these are all channels that will be available for verification so the information provided above is worth funding for this project, other things that the proposer has provided includes developers that would be enrolled in Wada's education program developers activity on Github. The proposal if funded with  the aforementioned channels it will be easy  audit this project and so I agree with the proposer that this project be funded to execute the agenda of the cardano ecosystem by making Africa the lead hub of cardano ecosystem and project catalyst and not a follower as usual.", "q2r": 5, "assessor": "z_assessor_3260", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10783, "q0": " Wada, an organization that has been around for a long time and has a good name in the blockchain community, always makes me feel satisfied and appreciative when I read your proposal. Your team always puts their excitement and attention into every job, big or small. And I see more of your meticulousness and professional experience with this project. The proposal introduces the solution in a very logical sequence, beginning with presenting the purposes of the project proposal so that everyone can see the long-term direction of the project and ending with showing the successes already achieved by fund 6's project to instill confidence in the subsequent hit. All of your arguments demonstrate that this project is inextricably linked to the challenge and that Wada can \" grow Cardano by ensuring the best solutions on the ground.\" But what makes you unique, and what fascinates me the most, are the risks you have prepared in advance. You predict what the primary problem is and devise strategies to conquer it as thoroughly as possible. Every word of yours shows how hard your team has worked and how much knowledge you have learned from past initiatives in Africa. I'd like to express my gratitude for everything you've done for this place.", "q0r": 5, "q1": "3 years isn't too long, but it's also not too short for a hubs independence effort. This project necessitates a precise plan to carefully monitor hub operations as well as an adequate budget to keep development moving forward. And clearly, the Wada team accomplished everything exceptionally well. The 3 years of the project correspond to 3 phases focused on different objects (infrastructure, education and dApp creation), where you precisely describe what the project needs to offer, support and manage. Hubs are also properly defined and grouped into distinct groups to have a budget allocation strategy and a suitable operating organization. This easy-to-understand Feasibility section makes me feel good. Still, I'd want to remind you to include a paragraph about management workload because your team has many different projects in this fund 9, so make sure you guys keep up the fine work.\n", "q1r": 5, "q2": "Compared to the Planting Roots in Africa proposal in Fund 6, it appears that the key metrics for the project have been enhanced this time. Because, like the growth of hubs, the initiative necessitates stricter success criteria in all aspects (Community Engagement, Events, Developer Engagement, Infrastructure, Business plan and specialization). With a strong vision for the future, I hope Wada will continue this three-year journey and bring significant improvements to Africa and Cardano.", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 9590, "q0": "\"What WADA has achieved in Africa is impressive. However, the Wada Centers are not yet able to sustain themselves. Need additional fees for branches already operating from fund six and opening new attachments.\nThe implementation plan to continue maintaining and developing Wada is the center established in the first phase focusing on building infrastructure. The following stages of educational development and Dapp building. Establishing and maintaining new centers is necessary to continue expanding influence and impact in Africa. Based on the project's results from fund 6. This proposal should be welcomed.\nEstablished centers attract regional developers to spread knowledge and support developers building on the Cardano platform. This is very good. It achieves two goals simultaneously to help develop Africa and increase the Cardano ecosystem.\"", "q0r": 5, "q1": "\"The group risks stated quite exhaustive. Team solutions are set out to address detailed risks. Be considered from many aspects and handle the risks well. One risk I think is important but hasn't been managed by the team. That risk is not having good control over the cost of infrastructure construction. That can lead to a lot of unnecessary expenses.\n The Wada group is active on the catalyst, and they have many funded exports. Team leader Wada is the person who directly distributes finance and overall oversight. Besides, six other people are directly responsible for the construction of the centers. Article members are provided with a link to the complete profile page. Based on their other projects, I believe they will do well on this recommendation.\"", "q1r": 5, "q2": "\"The required budget is 55000$. The allocated funding is provided in great detail. Ten centers will be allocated capital. Capital is divided into specific categories and flexible according to each type of center. I appreciate the detail in capital allocation. It gives me a better view of the project.\nThe implementation plan is divided into 3 phases. The first stage (1-2 years), Second Stage (2-3 years), and the Third Stage (3+ years). Each stage has specific tasks. However, Phase 1 lasts 1-2 years but only focuses on building infrastructure. Less workload for the too long time. They need to focus on working to be more effective.\"", "q2r": 4, "assessor": "z_assessor_3067", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9160, "q0": "The proposal, Nurturing Roots in Africa has really addressed the challenge effectively.  The proposal contains an elaborate plan to help hubs it created in Fund 6 to be financially independent.  \n\nThe proposal intends to provide physical infrastructure, education and outreaches among others to serve as incubation tools for this hubs. This plan when will see an incredible increase of participants from Africa in project catalyst. \nThis proposal has without doubt addressed the challenge for that matter it deserves a 5 star rating. ", "q0r": 5, "q1": "Considering the fact that this  proposal is a continuation of a previously funded project in Fund 6, it is obvious that the team will want to achieve their dream and for that matter, will ensure the successful completion of this project. \nThe team working on this project have some admirable accomplishment which lives no doubt that they can successfully implement the project.\nThe budget of this project is realistic and reasonable taking into consideration the volatile economic situation in most African countries. A 5 star rating is what I will give this proposal. ", "q1r": 5, "q2": "This proposal aims to measure progress and success by using data from its website and other social media channels to assess the the number of engagements on these sites.  \n\nThe proposal contains pragmatic milestones as well as key metrics which will be used to audit the progress and success at every stage.  In lite of the above I will give the proposal a 5 star rating ", "q2r": 5, "assessor": "z_assessor_3027", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8274, "q0": "If successful, this project could have a huge impact on Cardano and hubs in Africa. It is definitely an ambitious idea, but the proposers seem to have accomplished great things for African hubs in previous funding, so they seem capable of carrying out this project as well with the resources they have already gathered. The risks are relevant and well-thought, and the team came up with clever ways to mitigate them.", "q0r": 5, "q1": "The milestones seem feasible and, because the project will be developed in a large span of time, I believe it can be done and adjusted as it goes. However, I would like a more detailed plan, with some of the activities in each year. The budget seems to be well-planned, but because this is such a big project there should be a significant amount dedicated to unexpected expenses. I would have liked more information from the members outside of LinkedIn, especially their experience with Project Catalyst, but I think it is very positive that the Hub Leads will collaborate in the project.", "q1r": 4, "q2": "I believe the metrics chosen could be broken down into smaller ones, considering some metrics do measure the project's progress while it happens, in order to understand if the project is on the right track and make adjustments along the way. I would also like to see some expected numbers. However, I think the overall idea for the auditability will help measure the project's objectives.", "q2r": 4, "assessor": "z_assessor_2971", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 8237, "q0": "The stated problem is directional to the challenge. The concept of the project “Wada” focuses on promoting the usability of the Cardano blockchain by creating decentralized terminals described as Hub to expand users of Cardano protocols. The crypto ecosystem is full of perfective competition relating to how accessible and efficient a particular blockchain is. The Wada project intends to increase local partnership to improve user enrolment on the Cardano blockchain. The project strengthens its arms on infrastructure, education and outreach as the way to empower its users hence expanding its usability across the continent of Africa.\nThere is a bright future for the Cardano blockchain because of its efficiency and transactional speed and therefore, the Wada project would explore all of the opportunities to achieve its aims. The project’s risk management procedures are well documented as it has taken into account brilliant ideas on mitigating major risks likely to prohibit its implementation and scalability concepts. The project would satisfy most of the key metrics or indicators required\n", "q0r": 5, "q1": "The time span given to the project is feasibility such a way that ample time is given to all the milestones outlined for successful development and implantation of the project.\nA detailed budget is provided for items stated in for project execution. Some African countries are identified for the project as well as cities or towns. Upon looking at the budget provided for the first six months of the project, some hubs are not given itemized budgets or their budgets are incomplete. If the 0-6months budgets stated lack the capability to complete the first phase of the project then the financial reward expectation from the project to finance itself will turn out to be a problem.\nThe human resources provided to handle the project is enough but details are not provided for individual unit of work or work segregation and specialization are not explained", "q1r": 4, "q2": "The team provided activities to track the success of the project. The engagement of users in the project will form a community whose activities will give details on the success of the project", "q2r": 5, "assessor": "z_assessor_2968", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 7632, "q0": "I strongly agree that the proposal effectively addresses the challenge. They are taking a bold look at the need for more hubs and why the time has come for Hubs to play their core duty to pushing Cardano into Africa and for Africans. This is because the African continent faces a lot of challenges that can not be solved by one person, it needs the will and help of all to make it right. That's where these hubs serve a special need in the lives of the people, providing them a safe place to collaborate, learn, and interact with one another. The proposal seeks to build on its already existing foundation by building multiple hubs across the African Sub-Sahara region to work in unison as one but functioning differently from each other.  Seeking out this prospectus agenda is at the core of something unimaginable. \nMoreover, they have boldly highlighted the timelines for their project which starts from Phase one to phase three. By phase three they expect the project to be fully independent and weaned of external support.  But currently, they are from phase one to phase two which signifies a huge leap in terms of commitment and determination looking as far back as they started.", "q0r": 5, "q1": " I strongly believe that this proposal will be implemented successfully, looking at the level of experience across the board. That is if key decisions are taken when they need to be taken or not. Through WADA Planting Roots in Africa, they are still maintaining the core team of people whom they started, which means consistency of thought and they are thinking of bringing more people on board as they scale up their operations. Also, they have separated financial leads from WADA leads to ensure accountability and oversight over all operations of WADA in Africa. \nMoreover, they have provided a meticulous timeframe of all activities that will be carried out from 1 -3 years until their independence. ", "q1r": 5, "q2": "The information provided shows a huge map of people who will get to know Cardano in Africa at a huge scale looking at the various places they are going to open new hubs. Implementing the existing hubs with an influx of further resources will ultimately help it grow even more. The proposers also show the various mediums they will follow to achieve milestones for instance they will recruit new developers into the Cardano ecosystem to increase the number of developers, and also through community engagements and events, many people will hear of Cardano, therefore, marketing the ecosystem to a broader audience.", "q2r": 4, "assessor": "z_assessor_2908", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 13822, "q0": "Funding and supporting this proposal is fundamental to develop strong developer hubs across Africa. Nurturing Wada hubs all over Africa will strengthen opportunities for Cardano Catalyst in this continent and open up opportunities for new developers and entrepreneurs that can certainly establish the ground roots in this territory. Education and hardware are basic assets for developing a healthy Developer Ecosystem and will lead into new communities and interesting business environments for Cardano Catalyst. Basic infrastructure needs that western world takes for granted may nurture and show the true African potential that is still waiting to be unleashed. Having diversity of developers will widen our horizons of needs and challenges and will certainly strengthen our projects and community. So yes, this proposal effectively addresses the challenge of Nurturing Roots in Africa. ", "q0r": 5, "q1": "Considering this proposal is a follow up of this experienced and high calibre team already funded and successful proposal Planting Roots in Africa in Fund 6, it is highly likely this proposal will be successfully implemented. The attention this team is giving their main risks, in legalization, coordination and standards and costs over-run highlight the professionalism and seriousness they are at the time of implementing their ambitious goals. They are prepared, aware and have all the human resources for overcoming these hurdles. Considering Wada success and their long-term planning, this team of entrepreneurs are certain to transform the African Developer Ecosystem.", "q1r": 5, "q2": "Being a continuation of Planting Roots in Africa, the information provided is already sufficient to audit the progress and the success of the proposal. Monthly measurements and sharing with the Cardano Catalyst Community may help a great deal. Nevertheless, considering the challenge ahead, it is not just a question of number measurement, track number of users and number of posts per day, but of the quality of concrete human experience. Nurturing the Developer Ecosystem in Africa may need other kinds of measurements different from projects elsewhere. One on one work may be more needed than ever.", "q2r": 4, "assessor": "z_assessor_3833", "no_vca": 13, "ne": 0, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 7470, "q0": "This is exactly what we need to grow Cardano in Africa! The fact you guys are building out hubs and establishing businesses in order to self sustain is absolutely brilliant. The way to get the unbanked the support they need is to teach from inside the community. I cannot think of anything beyond what you have written here that could make this better suited for the fund! Kudos!!", "q0r": 5, "q1": "The only thing that worried me was that one of your linked in profiles has the wrong person's name on it \"Oshama\" is actually somebody else. This could be a simple error by the person typing up the proposal, so I will not take any rating away for it. The fact you have already gotten this plan working and established makes me a lot more comfortable extending funding beyond your first funding at round 6.", "q1r": 5, "q2": "I would like to see a physical walk through of the facilities that you are building at each stage to make sure that funding is going where it should be. I think that kind of transparency will make catalyst voters a lot more likely to continue to fund your project. Bless you guys for what you are doing for the world, this is as good as it gets as far as money well spent.", "q2r": 4, "assessor": "z_assessor_2895", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 6594, "q0": "This challenge is all about getting involved in Africa´s development while taking advantage of the tools that Cardano provides, and it requires not only direct engagement but also indirect. This project seems to cover them both. Providing physical hubs to have direct contact with people from the country is the best way to be aware of the situation and be empathic. But the impact is not just a “one-time link” with African people, since Wada shows to be involved in education and infrastructure which clearly establishes the funds for a healthy growth of blockchain and more specifically, Cardano’s scope. In regards to success, it is clear that their objectives are lined up with Cardano´s main goal in Africa, which means that if the team manages to achieve them, Cardano would be succeeding too. ", "q0r": 5, "q1": "The proposer team has been participating in the Cardano community for a long time and they have proven the effectiveness of their plan´s early phases with already 3 hubs successfully deployed. It Is fair to say that the team developed a detailed plan, with a clear risk analysis on what could prevent the accomplishment of their goals. The proposer has also written a budget breakdown in which they show how the money would be spent depending on the maturity of the different, which shows their awareness of how to use the funding provided by Catalyst. It would be better for the transparency of the budget to show how much money will be associated with each activity, for example, how much the salaries are going to be, how many hours per day are going to be taken into account for that job, etc Since this money is going to be used to develop new hubs and to continue the maturation process of the deployed ones, the amount accurately looks accurate. If one object should be done, it should be referred to what plans they have about education and how the team is planning to use the money to grow Wada´s education program.", "q1r": 4, "q2": "The proposer provides a 3-year detailed plan on how the team will act and implement their idea. There is clear evidence that proves how they managed to accomplish their goals in terms of infrastructure, yet there is no information related to the education progress. Therefore, if done well, the chosen metrics to measure success are well orientated and will show in the near future a wide view of the program process.", "q2r": 5, "assessor": "z_assessor_2822", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 5829, "q0": "Community hubs are very critical to achieving the vision of Cardano in “Grow Africa, Grow Cardano”. To increase awareness and adoption, and to also sustain the impact that has already started in Africa, there must be serious investment in the hubs to sustain them for continual education. \nThis is what WADA intends to do in this proposal. \nThe infrastructure need presented is very legitimate. All the resources presented are very imperative for sustaining any organization that will thrive and I hope this proposal is funded so that these things can be put together for the hubs to be sustained. \nI believe WADA also seeks to answer one of the biggest program in Africa - sustainability. \nThis idea will lead to sustainable community hubs, maximizing impact, increasing reach for Cardano, and sustained growth for the ecosystem in Africa. ", "q0r": 5, "q1": "WADA has presented a detailed plan with milestones and timelines for execution. The propose that this is a 3 year project and I think their timelines are realistic. \nThe team has been in the Cardano ecosystem for a long and has gathered a lot of experience around hubs. I think they have the relevant skills and experience needed to execute this project successfully. The proposers do well to include links to their relevant experience and skills.\nThey have outlined all resources needed to achieve this job in a very comprehensive budget indicating all amounts to be spent. \nThe proposers have said that they will return for more funding since the funds requested are for 6 months of the 3years of work towards sustainability of hubs.\nI think with the details presented by WADA, this work will go on unabated when funded. \n", "q1r": 5, "q2": "The proposers have defined key progress indicators that are clear and easy to understand. The deliverables as stated in the “what does success look like” section of this proposal are well elaborated and can be used to audit the success of the project. \nI think their budget is well written and all these put together make the proposal auditable.", "q2r": 5, "assessor": "z_assessor_2754", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 5762, "q0": "Wada has consistently showed maturity in exposing African youth to cardano blockchain and have expanded into other countries on the continent. It is therefore imperative to sustain WADA to continually educate, onboard and expand into different countries. The proposal is aligned to the challenge further grow cradano in Africa. \n\nPutting up structures to coordinate in Africa is quite difficult and that, a support like this will cushion Wada to rapidly grow the base for cardano adoption.\n\n", "q0r": 5, "q1": "The framework put in place to be sustainable in the next 3 years and beyond sounds good. This will wean them off from the catalyst ecosystem while they become self-sustainable to drive for change. The capacity building of wada personnel is a great tool build Dapps for innovations that generate income. There is no ambiguity in the action plan for success and looks achievable.  \n\nThe budget has descriptions that support each item to support why that amount is needed. This clears doubts in the usage of the funds. \nI however suggest, wada should try buying land and to put up its own office space to avoid rentals since rent cost/prices are skyrocketing. It will therefore be the best to be more independent to operate. \n\nThe team members are well known in the catalysts space with much credibility in running wada stake pool for success. There experience of the years are enough to vouch for a successful implementation of the project.", "q1r": 4, "q2": "The proposal has clear KPIs with expected outcomes. The developer discord and related developer channels are important to have cardano blockchain developers in Africa. \n\nThe tendency to create other hubs in Africa is also a great tool to ensuring a measurable number of people in Africa joining wada. \n\nThe details provided are enough for the community to audit for success. ", "q2r": 5, "assessor": "z_assessor_2749", "no_vca": 13, "ne": 0, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 5615, "q0": "This proposal is a good one, and also a continuation from successful fund six, shows that the idea is such a good one, the proposal seeks to provide hubs accross the continent of Africa and to ensure that block chain technology is deeply rooted in Africa and that will get Africans acquainted with blockchain and the Cardano ecosystem. It is also a great job to have affected and imparted to some African countries already, good job! The proposers therefore intend to create different hubs across  the African continent.", "q0r": 5, "q1": "The plan is structured,detailed and clear with each significant milestone. A rasonable budget is broken down and detailed according to each stage of work,and an established time Combined with a team of highly skilled personnels, the links provided to each of the personnels show competence amongst them.\nI am sure with the experiences the team members have, this project will get more strengthen.", "q1r": 5, "q2": "A transparent,coherent plan and easily measures the success of the project. Funds are divided into reasonable, transparent determination of the scheme. I forwardly look  to the success of the project because of the deep insight and experience from fund 6, Good luck", "q2r": 5, "assessor": "z_assessor_2722", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 5482, "q0": "It's pretty evident in the community, that WADA has been an irreplaceable member considering the amount of work they did to improve the Cardano outreach in Africa. And they have been submitting successful ideas. This proposal is an ancillary proposal to support their previously funded venture. It is important to recognize that many previously funded proposals are losing track when it comes to implementation, hence it's equally necessary to support the older proposals as it is to fund new ideas, and WADA having its roots across all corners of Africa might do wonders, especially in this challenge \"Grow Africa, Grow Cardano\". The proposer here requests funds to support the already existing hubs across Africa which were set up from the fund6 proposal. The proposer is aware of the various risks involved and already faced, and they expect to mitigate them through the funding they receive. And the proposer specifically mentions using the funds to improve the Sub-Saharan region's infrastructure and education. All in all, impact-wise the proposal seems complete considering the fact that this is to nurture the roots that were already planted long ago and are in dire need of support to continue the growth.", "q0r": 5, "q1": "The proposer makes no mistake in providing their detailed budget breakdown for the considerable fund of 55000. The funds seem practical and reasonable considering the number of hubs WADA maintains across different nations. The proposer also briefly introduces the members involved in the project, including the Hub Leads responsible for the various hubs and the co-ordination leads from WADA who overlook the entire project. And the fact that this fund is only for the 6 months of the 3y plan shows their step-by-step approach, which is commendable from the community funding perspective. However, the one factor that I as a reader would have loved to see more clarity was on the 3-year path to independence that the proposer mentions about. I agree that it is a far-fetched goal and it's hard to look that far into the future, but a quick detail would have done the trick. Apparently, the game plan is very elucidated and transparent as to how and upon what amenities the funds will be used upon. The team being part of various other proposals adds more credibility and confidence to the feasibility metrics of the project.", "q1r": 5, "q2": "The proposer is very much aware of the auditing process of the community and having been successfully funded in previous rounds, the team shall be very much familiar with the process and can be assumed to provide full assistance during the audit. The proposer jots down very lucid and simple metrics such as attendance, events, and increased engagements over various platforms (social and coding) that the community can monitor to keep the project's progress in check. The success story of the proposal is also very much aligned with the challenge's requirements whose final goal is to see the Cardano expand across nations of Africa. The increase in developers and businesses' Cardano blockchain adoption is an evident success. The WADA hubs could be one way to go about that. Again to reiterate, the proposal being a continuation of the Fund 6 proposal, there lies very little doubt with regards to the auditability of the project. Therefore, I make no reservation in providing full marks to the auditability metrics too.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 15, "ne": 1, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 5257, "q0": "The proposal as mentioned is a follow-up to Fund 6 proposal titled \"Planting Roots in Africa\" which was successfully funded after missing narrowly in Fund 5. The previous Fund 6 proposal has been clearly documented and the outcome has been listed down. This proposal is put in to continue their 3-year-long plan which has an end goal of bringing Cardano adoption to Africa and accelerating the process of creating Dapps and thus making it a self-sustaining system. This clearly shows that the proposal is sure to create an impact in a phase-wise approach thus showing results in the future. Their focus is set on 3 main things which are Infrastructure, Education, and Outreach and these are very crucial to creating better adoption. With all these in mind, the proposal also has clearly assessed their risks and provided their risk management ideas. For the legalization risk mentioned, they have another proposal in Fund 9 titled \"Scale-UP Hubs' Legal Framework\" which plans to create a legal and financial template for their hubs. Hence I highly agree the proposal will create an impact in this challenge category.", "q0r": 5, "q1": "A detailed timeline and key milestones have been laid down for their 3-year plan divided into 3 phases. This is very clear and well thought out, but it is mentioned that the fund requested is for investment costs and 6 months of recurring costs and this 6-month timeline would have given better clarity for this current proposal and the funding requested. Given that it is a previously funded proposal, a timeline with the continuation of what has already been done in the last 6 months to what is expected to be done in the upcoming 6 months would have strengthened the proposal from a voters viewpoint. It is also stated that the funds will be made available to individual hubs according to a phased deployment process which they have clearly specified in the detailed budget breakdown and the excel sheet attached. The team involved in the project has been clearly given with each of their Linkedin profiles attached. The team has made great efforts to provide as much information and adding the 6-month timeline would have added more insight.", "q1r": 4, "q2": "As already established, the proposal is focused on creating hubs that will eventually bring more adaption to Cardano from Africa. In this line they are focused on community engagement, events (offline and online), and increasing developer engagement. They have mentioned tracking metrics on their portal and social media platforms. I was unable to find the link to the membership portal though (Checked the official WADA website as well). Adding a hyperlink to the portal would have been easier for assessing. As for the events, the attendance and number of events are taken as a metric that is definitely auditable. But how they intend to show real-time attendance for both virtual and IRL (In real life) events is unclear (Is it an RSVP system or an online registration process?). I suggest that introducing POAP would be a better way to get real-time attendance (This is a suggestion and if this was already the idea then great). Developer engagement also is clearly auditable given they are using registration for their education program, discord activity, and Github activity as the criteria.", "q2r": 4, "assessor": "z_assessor_2681", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5088, "q0": "The name of the organization behind a great deal of Cardano's building inroads into Africa is known as WADA - West African Decentralized Alliance. Funded in Fund 4 this organization has focused on organization and developing networks. After funding in f6 the focus in part turned to building out \"Hubs\" in Africa, most notably in Ghana, DRC and Camaroon to collaborate, coordinate, educate and initiate local use programs. If you have been involved with Cardano for awhile you probably understand why it has chosen to focus on Africa and why it is important to Catalyst.\n-------------------------------------------------------\nThis follow-up funding request is a $55,000 request to bring the WADA Hubs both extent and new ones to the next level in support. The WADA organization is working to bring minimum standards of infrastructure to each of its hubs including: Physical space and utilities, furniture, Insurance, etc. The proposal has a break down what each of the hubs require.  The Nurturing roots initiative is also working towards becoming a self sufficient organization after the three year mark. This proposal is for Investment funds to organize hubs plus 6 months costs that will be administered by WADA to be made available to the individual HUBS.\n--------------------------------------------------------------\nWada is an umbrella Community platform for the continent of Africa. It is in tune with one of the prime or rather - strategic goals of Catalyst. That is to Prepare a group of people willing and able to make contributions to the ecosystem. They are also focused on a second of the strategic goals of - build real-world solutions based on the Cardano blockchain.\nMy assessment of this proposal is that it is a 5 (strongly agree that it meets the objectives laid out in the Challenge) star.", "q0r": 5, "q1": "Wada has shown its strength of leadership and the depth of its technical and administrative capabilities since the f4 funding. It has the team members and skills needed to make this proposal feasible. The budget in my assessment is clear and well explained. The needs and allocations per HUB is explained in a straightforward fashion. Time tables are realistic with an admirable long term view. And, finally there has been a good Risk Management assessment done.\n___________________________________________________________\nMy assessment rank of the feasibility of this proposal is 5 star - strongly agree it will be successfully implemented.", "q1r": 5, "q2": "The audit and metrics statements of this proposal focus on engagements, involvements and other such KPIs. Which to certain projects is the only audit metric needed. It may be one that served WADA as a startup but the group is growing and maturing and the proposal dollars may be increasing. The old method of using engagement numbers should evolve to an actual audit structure for dollars in and dollars out. As the number of Hubs grow, administrators, complexity and budget the internal auditability requirements will become more important.  My suggestion to WADA is to develop an audit construct for self use or consider using the Community team for accounting and auditing. A suggestion for f10 is to propose developing a blockchain audit SSI Dapp for WADA and other Catalyst Community platforms.   \n----------------------------------------------------------\nMy assessment of this proposals auditability, identifiable measurements and KPIs is a 3 star rating in that I am neutral- neither agree or disagree.", "q2r": 3, "assessor": "z_assessor_2671", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 4964, "q0": "WADA is one of the communities that understand the core of this campaign. The idea of self-sustaining nodes around Africa in the Fund 6 was a good start for the project and I'm so happy to see Ghana & Cameroon functioning hubs. As this is a follow-up proposal in this fund, it does address the challenge without a doubt. The way WADA focuses on the problem with Infra, education, and outreach is the most effective approach that I feel. ", "q0r": 5, "q1": "I see the risk analysis and the solution to it is elaborate. The roadmap and the budget breakdown of each location are clear. I'm guessing the $500 for branding includes all the locations. With previous experience in setting up hubs, I don't see why the community would choose not to fund this project. With the history of tangible results from the previous funds, this project is most likely to be implemented successfully.", "q1r": 5, "q2": "The detailed budget breakdown and the timeline for each hub are very clear. But it would have been nice to see if the proposer had included the timeline specific for each hub. The community and the developer engagement can be measured. If there was a provision to measure the conversion rate of the events would have been even more promising. I wish all the best to the WADA team and collaborators in their future endeavors.", "q2r": 4, "assessor": "z_assessor_2644", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 4269, "q0": "Africa is a continent of contrasts: it is very rich in raw materials and very poor economically. It faces several challenges, notably the training of its very young population and its unemployment. \nThis project fits right into the \"grow Africa, grow Cardano\" challenge, it aims to create a chain of hubs across African countries to train young people on crypto-currencies and Cardano in particular.\nThe student developers will then be employed to create apps that take into account African realities in order to solve problems in the Cardano environment.\nThe relevance of this project lies in the concern to make these hubs financially independent after only 3 years and tend towards a growth that means more training and jobs and less unemployment.\n", "q0r": 5, "q1": "The budget requested is very reasonable and the details show that everything is allocated to operating items that will allow developers to put themselves in decent conditions to work.\n\nThe choice of collaboration with local start-ups is very relevant, as many of the initial steps will already be ready and therefore it will only be necessary to focus on training and then application development.\n", "q1r": 4, "q2": "The planning of the project is very clear, it is foreseen in three distinct phases: \nA first phase in the first year of implementation where all the logistics of setting up the company, renting the office, equipping the office, recruiting the staff etc. are planned.\nA second phase in the second year dedicated to training.\nFinally a last phase of operation and production of personnel in order to create applications in the Cardano environment.\n", "q2r": 5, "assessor": "z_assessor_2539", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 4045, "q0": "The proposal describes how they intend to support existing and develop new hubs across Africa. The idea is to teach and disseminate the blockchain and web3 related technologies to introduce developers in Africa to the Cardano ecosystem. The deterrent is very clear, the lack of resources to invest in these hubs prevent the African communities to educate developers that could be building technologies focused in their communities. The metrics provided in the proposal strongly align with the outline challenge. Number of events, social media engagement and follow-ups in the hubs to assure infrastructure is adequate are all factors that if evolved will mean progress is being made. Also, with the target of having the hubs self-sustained within three years they address the scalability issue because if they hubs do not need additional external funding it means they are able to generate enough revenue. And if that is the case, they will be able to use the extra revenue to invest in themselves and expend.", "q0r": 5, "q1": "All of the team members described have links to support their claimed experience. Also, they are part of the Wada group which has been funded in the past and has conducted successful projects as can be seen in their website. They have already set up who is going to be responsible for each region and for each leadership. The budget is provided within a spreadsheet via a link and organized by hub and by need (furniture, electricity backup and equipment, for example). The amounts sound reasonable and are focused on the goals treated along the proposal. Additional funding will be required in the future and they have already showed interest in coming back to project catalyst for additional funding until their hubs become self-sustainable (which should happen around a three-year timeframe). The plan described is very detailed and sensible. It is divided in phases and each phase has a focus, infrastructure, education and dApp creation. Additionally, they have also considered the main risks and provided ideas to mitigate them. They are based in three pillars, legalization, coordination and cost over-run. These mitigating ideas are sound and will probably have to be implemented at some point.", "q1r": 5, "q2": "The team has provided a clear roadmap with reasonable milestones. It is divided in three phases and each phase has a priority, infrastructure, education and dApp creation. The time horizon of each phase seems pretty fair and achievable and the order they have been placed is logical. Besides that, the KPIs traced sound like a good measure of success. They will track social media engagement, number of events and attendance to these events and developer enrollment in Wada’s educational program. They have also metrics regarding infrastructure that needs to be built but I would suggest using a more objective metric. For example, if they want to build a building or acquire a number of equipment for a hub, they could estimate how much of that has to be done and how much has already been done, and reach a percentage so the community can better grasp their progress. Finally, they could also provide regular status of the project's progress in a social media platform as well as their site.", "q2r": 4, "assessor": "z_assessor_2513", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3386, "q0": "WADA is  an international organization with local footprints that aims to equip local developers and entrepreneurs to build decentralized applications and businesses of the future.\nThis organisation has partnered with the Project catalyst to facilitate the implementation of cardano in Africa on various front ends.\nThis proposal intends to strengthen existing hubs in Ghana, Cameroon, DR Congo, Nigeria and support the expansion of new one's in Ivory Coast and Burkina-Faso. This shows the potential of scalability of this proposal and how it may go from local to global.\nBy providing more needed equipment's, the hubs would be able to serve more people and attract many others who would be able to onboard and have the cardano expanded and known by various communities.\nThis aligns totally with the challenge objecyive.", "q0r": 5, "q1": "The budget is well detailed, but with my experience is project management, I would like to see the team plan on a contingency fee of 10% of the total funds since it's a large project  that will cover many countries with various realities.\nWADA has acquired a lot experience working the project catalyst, which is an asset for them to be successful this time again. And this proposal is a continuation of the one submitted in Fund-7 cycle ''Planting Roots in Africa'' , so the needs for a better progression of those particular hubs have been identified by the proposers and this constitute the basics(Infrastructure, education and outreach) of the current application.\nThis application would have a high potential of success based on the team experience and expertise, outcomes from the previous phase around planting roots in Africa, and also the plan presented and the timeframe, which is reasonable.\nI rate it with a 5 stars.\n", "q1r": 5, "q2": "The road map well explained and presented, with the delivery dates divided into phases, from 1 year to 3+ years.\ndeliverable are well defined with the goals to strengthen the work which is already taking place in those various locations (Countries). The idea being to assure the self-sustainability of each hub in the long run.\n5 star is my rating about the auditability based on the clarity and concision. ", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 3202, "q0": "Proposals like this are adding a lot of value either to the challenge Grow Africa, Grow Cardano, and to Catalyst. As one can see from their previously funded proposal in F6, there’s a lot already done and still a lot to be done. And this proposal shows well that the team is committed to do it with transparency and steadiness. They know well their context, the risks that might affect the implementation and the needs to keep funding the Hubs already created in Ghana, Cameroon, Nigeria, and DRC. With an impactful proposal and well-presented problem and solution, I strongly agree that it will bring positive impact to Catalyst and the challenge. ", "q0r": 5, "q1": "The proposal is feasible in its roadmap and plan to build independence for the hubs already established and for the one that are still being implemented. Although they have a very long-term plan, it’s actually good because this proposal is focusing on the sustainability of the WADA hubs and this requires a long-term view. The proposal brings the experience of people coordinating the proposal and the budget is detailed in an external link. The amount required for each item is reasonable and they are necessary resources to implement the proposal. Therefore, no issues were found in the budget description, nor in the plan to deliver the proposal.", "q1r": 5, "q2": "The proposal is easy to audit because it has provided metrics and KPIs that are directly related to its scope, which is not something that all proposals always provide. They could have provided some specific targets for some items, because this would allow us to see where exactly each indicator is trying to reach. But this does not affect much the ability for the proposal to be audited using the combination of all the metrics. Their view of success is clear and represents a good understanding of the problem and ability to present a solution. The problem being the need of the hubs to reach sustainability, and the solution being the promotion of financial sustainability to these hubs in a long-term plan of three years. This financial sustainability gives not only the ability for the hubs to survive, but also create more engagement, bring more developers, enthusiasts, business and technology to the Cardano Ecosystem in Africa. ", "q2r": 5, "assessor": "z_assessor_2409", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 1351, "q0": "The problem statement is clear, precisely explaining the desire for WADA hub to be financially independent. This corresponds with the challenge with the aim of bringing this project to a higher level and the goal of ​​sustainability. As this proposal is a continuation of a successful project at fund 6, its impact for the community is reinforced and verifiable, but also clearly articulated and aware. This project coincides in many ways with the KPIs of the challenge, by its desire for independence it makes it possible to support the need to place Africa as a Leader of the movement, but also the establishment and maintenance of infrastructures and educational development for having an impact on a local and global scale. Its deployment project and its long-term vision give it the ability to address future challenges. ", "q0r": 5, "q1": "All team members are clearly identifiable, as are their skills and backgrounds, links are given to their website, as well as explanation videos. \nThe fact that this team has been active in the community for a while with successful projects is something to consider. The budget is clear and seems coherent, just as the long-term plan developed in 3 different phases seems realistic, as well as the more precise chronological plan of the stages of implementation and technical details. Understanding could have been improved by clearly writing a break down budget linked to the action plan, to better understand how the budget would be used. But this is compensated by the detailed explanation of the plan and its coherence. The risks are addressed, they are aware and the team gives different solutions to mitigate them.\n", "q1r": 4, "q2": "The road map is clear with a time of horizon for achievement of 6 months for this proposal and overall of three years for this independence project. KPIs make sense and provide easily verifiable indices of success. The community will be able to follow the progress of this project thanks to their website, GitHub and it is specified that “Wada will have a network of hubs or centers in sub-Saharan Africa connected locally, nationally and globally to Cardano and the digital world economy ”.", "q2r": 5, "assessor": "z_assessor_2232", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 781, "q0": "Great proposal and continuation of the previously funded 'Planting Roots in Africa' project. The impact of this work is clear and your breakdown of the three main risks identified are sound. I believe that your approach to dealing with legalization, coordination/standards & cost over-run risks are well thought out and a logical and proactive strategy in attacking these areas is acceptable.", "q0r": 5, "q1": "It is obvious to me that the need for continued funding is typically required and in the spirit of adhering to community feedback, it is always valid to break your long term proposal vision into multipe parts and to attempt funding in subsequent funding rounds. You have done just that and as far as I can see your \"Three year path to independence for hubs\" is sound. The various elements that you are looking to fund are reasonable and required for your vision. Your budget breakdown is thorough and is clear in it's explanation of what the funding amounts are being used for. Lastly, your team list is present and so I feel that this proposal ticks all the boxes.", "q1r": 5, "q2": "I feel like there needs to be more work put into the success metrics and KPI's with respect to rough figures. I appreciate this is a difficult thing to estimate but as an assessor I guess I am confused about what these 'Metrics' actually translate to? Your measures are clear and the succeess descriptions have been considered and noted but again some success metrics would improve your proposal. Lastly, I feel I have a clear understanding of the problem and solution and I applaud your efforts in translating that into layman's terms for CA's like me. Great work.", "q2r": 4, "assessor": "z_assessor_2127", "no_vca": 15, "ne": 1, "ng": 13, "nfo": 1, "vca_o": 1}, {"id": 7306, "q0": "As proposed, it is a follow-up to the successful proposal at Fund 6: Rooting in Africa. Wada aims for its centers to be completely self-sufficient after 3 years of Wada/Catalyst support. For Wada's new and existing hubs across the continent of Africa to move towards their own financial independence, more funding is needed to enable Wada to collaborate, coordinate, educate and initiate construction If the project is successful, it will create a network of local community centers in Africa, which will increase its ability to influence and accelerate the growth of Cartalyst and the Cardano ecosystem. in the future. I found the solution proposed to be quite good, solving the problem from the root to the tip, the proposed team clearly oriented the vision and goal in line with the stated challenge, and the proposal also mentioned update what the centers have achieved, after the success of fund 6, showing the efforts and efforts to successfully implement the project. Advice, because the final product to feed the centers is technology products, with the creation of dapps, in my opinion, the human factor is the core and most importantly it determines the success. of the project, so in order to ensure the roadmap, and to shorten the time of financial autonomy, I think the team should focus on promoting recruitment and education and training of developers, center heads. , can be through online form or combined with online sales. After the infrastructure and facilities are guaranteed, the work can begin.", "q0r": 4, "q1": "Wada is a name no stranger to the Cartalyst community. With the achievements that have been achieved and have had a great influence on Cartalyst Cardano such as Wutana, Wallet and Empowa or the successful establishment of the Haskell African education component, this is a follow-up to the success of the project. at fund 6: Planting roots in Africa, through which Wada's experience and prestige is very high. The project team is experienced, good at the right skills to be able to successfully implement this proposal, easily known through the Linkedin links provided by the team, The members are clearly assigned jobs. clear. The project implementation plan is clear, listing each job and how to do it according to the timelines so it is easy to evaluate and track, each center is developed divided into 3 very clear stages and details, if possible I would like the proponent to be able to describe in more detail the criteria for achieving each goal of the stages so that it is easier for the community to assess, the Budget provides very detailed outlines of each category investment of each center should be easily determined. Such a clear budget table shows that the proposed team has calculated and planned very carefully, spending the budget in accordance with the current situation of the project. The proposed team has also calculated and proposed the risks that will be encountered in the implementation of the project, and has carefully analyzed and calculated to come up with solutions to minimize risks. lowest possible level. With the experience of the team along with a good plan I think the project can be done successfully.", "q1r": 5, "q2": "The solution and goals of the project are very clear and easy to understand. The roadmap with work contents corresponding to specific milestones should be easily evaluated and followed by the voter community. The KPIs are clear, complete, and the success of the project can be transparently tracked through the tools that the proposed team has provided such as Wada's social networking site, website, Github. The advice I think the team's proposed KPIs should be to attach specific numbers, so that the community can easily grasp and track the success of the project. The proposed team detailed the project's success as the expansion of the Cardano market in all countries where Wada operates now and in the future through solution design/dApp creation, education & marketing. outreach and ongoing capacity/capacity building. Wada will have a network of hubs or hubs in Sub-Saharan Africa that are connected locally, nationally and globally to Cardano and the digital world economy. The project promises to raise capital and help Wada in particular and the Cardano ecosystem in general to grow strongly and sustainably in Africa.", "q2r": 5, "assessor": "z_assessor_2886", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 14360, "q0": "The proposal is addressing the challenge to educate through outreach programs is to help people to understand cardano and it related opportunities. This can be done if there are also infrastructures to support such important program. It is also important to note that cardano is not known to many Africans and that such education is needed.", "q0r": 5, "q1": "The timeline giving is good this is  said because the activities in the feasibility are understandable and clear enough to be implemented. The budget details in the feasibility is showing how the money is going to be used on the proposal suggested therefore,the amount requested is good enough to support the proposal for implementation. the team has the experience to facilitate the smooth implementation of the proposal.", "q1r": 5, "q2": "The information provided are details enough to measure progress and make it easy for the community to audit the proposal. The indicators are also clear to  see how people are being onboarded into the cardano platform.", "q2r": 5, "assessor": "z_assessor_4001", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "Funding the next level of support for new and existing Wada hubs across the continent. This will enable us to better collaborate, coordinate, educate and initiate building out local use cases.", "experience": "Wada: Skilled team of Cardano Community practitioners and entrepreneurs, located in hubs across Africa and the diaspora.\nWada Hubs:\nEstablished Hubs: Cameroon (DITC), Ghana\nFirst Year Hubs: Nigeria, DRC (2 locations Goma and Kinshasa), Ghana (North)"}