{"id": 418308, "author": "emile.schoemaker", "title": "EcoCashew.com & partnerships", "url": "https://cardano.ideascale.com/a/dtd/418308-48088", "category": 26600, "amount": 70000, "description": "People & potential partners are not aware of the EcoCashew ECO Fair Trade Project in West Africa. A sustainable cashew project that aims to bring Cashew Processing to the Cashew Farmers. ", "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 1055, "q0": "The problem statement of the project doesn’t really provide us with a concrete problem. The fact that potential investors are not yet aware of this project doesn’t constitute a general problem. Perhaps a description of the issue that the team wants to tackle by building their project - supporting African cashew farmers and reducing CO2 at the same time - would be a better presentation of the situation. Then, by offering the solution of marketing the project to increase its adoption will solve the stated problem.\nThe same applies to the impact section as a whole. A short description that the project wants to solve would have provided a lot of information at a first glance. Otherwise, the information is quite clear on the website and whitepaper provided, but offering a better context as to how to tie the project to the Catalyst ecosystem better would have been essential. \nNonetheless, I find the project conceptually interesting and with potential value long-term (Who doesn’t like cashews?). West Africa is already the leading exporter of cashews, so tackling the supply chain with time savings and increase in payout to the farmers directly will lead to better products overall and an increase in well-being across the agricultural sector in Africa, as more and more companies will tend to adopt this solution. To get there, would mean assisting projects like this one with the funding required specifically for the marketing side. The more people would have a chance to find out about this project, the more will buy the token and thus support the development of the farm. However, I do not necessarily agree with the listing on a CEX, and I will point to the current success of the NMKR token, which has started going up in price after the listing on SundaeSwap and MinSwap. The Cardano community is not particularly attracted to CEXs, as they enforce KYC and a minimum of tokens bought - those were some of the complaints when the NMKR token launched on a CEX. As such, I’m suggesting to the team to also look into other potential directions, as the Cardano Community is welcoming to interesting and impact-driven projects.\nConsidering the information from the website, namely the whitepaper, tokenomics model and team composition amongst others, I find the project to be in line with the challenge brief as it can be valuable to both the African economy and to the Cardano ecosystem, however, I do not entirely agree with the approach taken by the team regarding the marketing side of it, as such, I rate the impact section a 4/5.", "q0r": 4, "q1": "The provided plan and timeline offer a concise version of the project’s implementation roadmap. While not very detailed, the amount of information is enough to get a good glimpse of how the project will unfold.\nHowever, the budget does not offer enough information, especially for the bulk of the amount of $60000 named “Platform Internal Marketing”, that does describe briefly what it entails, however, there are no clear metrics, and the amount is not further broken down for easier assessing of its feasibility and as such, I cannot judge whether it’s realistic or not.\nWhile in the proposal the team has not provided us with detailed information about its members, if we look at the provided whitepaper we can find a short description for each member involved and a LinkedIn profile to verify his provided skills.\nAnother missing aspect I have noticed in this segment is the fact that the team have provided us with a positive answer to the question of having another proposal in this fund, yet they have offered no comment or link regarding it/them, thus I am unable to judge the team’s time management in regards to all submitted proposals.\nAs such, although the team members provide confidence in their abilities to implement the project, the fact that the budget does not offer the requested details needed for an objective assessment and considering all the missing details, leads me to rate this section a 3.", "q1r": 3, "q2": "The listing on a CEX is by nature public information. However, the specification of which CEX and some explanation on why that specific one has been selected, were not provided. It would have delivered some additional confidence in the team’s decisions and their auditability and transparency to the community. I would consider this to be the first measurement of the progress of this proposal. The announcement could be either in a blog post, on the project website, on social channels etc. but it should be taken into account and provided to the community. The rest of the provided measurements are relevant to the proposal, especially the part where it’s mentioned that the team will provide measurements on how many tokens were sold at which specific average price point.\nThe success definition is well described, and I like how it ends with the fact that the first containers of cashew will arrive from Africa to the Netherlands, thus describing the start of a potential successful endeavour.", "q2r": 4, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 4, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2422, "q0": "From what is described in the proposal, we can say that it fits well with the goals established for this challenge, as it opens the door to solving a local African problem through technologies from the Cardano ecosystem. Perhaps the biggest benefit brought by this project, if successful, is the idea that blockchain can be used to replace poorly optimized processes with great environmental waste. But analyzing this specific case, we realized that the project is well structured and it is well understood what its impact would be. That said, the budget being requested seems reasonable, but it should be noted that there is considerable inherent risk, as the total amount is large and the project is still in its early stages.", "q0r": 5, "q1": "Regarding the execution plan, we note that the need for the project to be known is well understood, so that considerable engagement is achieved. But we are left with the general impression that marketing is being prioritized perhaps a little too much. We have this impression because when we look at the detailing of the budget, basically all the capital allocations are being used to publicize the idea. But as stated in the proposal itself, the project is still in its early stages. With this, we cannot say that the feasibility is so well built, as a very broad spectrum of actions was not considered to make the project more concrete.", "q1r": 3, "q2": "We note that the perception of success is quite consistent with what was worked on during the proposal, that is, bringing fairer prices and conditions to African farmers. However, regarding the parameters used to monitor the project's evolution, we feel that more technical details could have been provided. For example, a way of conveying information regarding developments to the general public could have been explained, as well as which tool was being used. In addition, it would be interesting to establish some numerical goals that would help us better understand the levels of engagement that the project is reaching, such as a number to be reached for sharing on social networks.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5830, "q0": "We have a number of cashew farmers in Africa who actually struggle to get fair value for their labour. This has for sometime now, especially in Ghana discouraged a lot of farmers from producing cashew. \nThis team seeks to bring fair value in cashew farming by making farmers and partners of Ecocashew aware of the Cardano native token and as they transact cashew on Cardano blockchain they stand to get more value from their products. \nI think this will lead to increased participation in the Cardano community. \nThe farmers and investors will also be impacted as they transact on the blockchain technology. ", "q0r": 5, "q1": "The team members are all experienced people who are already working on projects from previous funds. This is evidence of their competence and ability to deliver. They also do well to give links and videos of relevant skills and experience. \nThe funds requested are within reasonable limits and the budget is well broken down to include all resources and activities. \n  The plan presented is clear, simple, and understandable. It will be easy to follow through to execute this project. There are timelines stated against milestones. The team specified risks that may arise and formulated mitigation plans. \nThis proposal can be implemented successfully if funded. ", "q1r": 5, "q2": "There is clarity in the presentation of this proposal. The key progress indicators are clear and measurable. This means reports can be given to the community when milestones are completed. \nThe budget also allows accountability. ", "q2r": 5, "assessor": "z_assessor_2754", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11545, "q0": "Sustainable food production and related logistics are critical components of attempting to address the climate crisis. The proposal introduces ECOCASHEW.COM, project which seeks to build a Cashew nut processing plant in Western Africa while reducing the carbon footprint by 90%. With this AIM, they hope to first introduce a Cardano native token and raise funds for the factory while incentivizing Coin holders. The current proposal aims to list the CashewF toke, market it, and raise awareness through AMA.From the perspective of Cardano's main pillar, I see a huge convergence by focusing on the sustainability goal and using the blockchain to improve a food production supply chain. However, the proposal does not go into detail about how the project will encourage greater Cardano adaptation in Africa. Furthermore, the proposal lacks information on how the project would affect the local African community, as well as information on whether the project is likely to scale - for example, whether the solution could be transferred to other types of food production. ", "q0r": 4, "q1": "I find it difficult to estimate whether the project is likely to succeed. While their websites have a very demonstrative roadmap with past and future events, the roadmap also shows that since 2017, only the idea, market research, and the bluepriment have been established - what I personally consider a very slow process. Furthermore, the whitepaper was released in Q2 2022, just prior to the F9. Given the large amount of work and funding (2.2 million USD during ISPO) required for such a project, I find the timeline unrealistic - token creation in Q2 2022-factory installation completion in Q4 2022. The team members, on the other hand, appear to be solid to increase the chances of success, including an engineer, an entrepreneur with 30 years of experience, an accountant, and so on. While the Team members' experience is detailed in the whitepaper, the specific roles in the current project are not clarified in the proposal. Furthermore, I am missing a member with food production/processing experience. The schedule is broken down into weekly plans for the next five weeks. What I find most confusing is the budget breakdown. First and foremost, 70k USD spent primarily on marketing is, in my opinion, excessive in comparison to the total amount of FUNDS allocated in the \"Grow Africa section.\" But apart from that, the marketing budget is incredibly vague, with no details on which items will cost how much and how the calculation was made.", "q1r": 3, "q2": "The project aims to be transparent about website traffic and the number of tokens purchased/available. What I'm missing is a platform where they'll publish data from website traffic and other sources (on which specific accounts on social media/their own websites?). They only mention the  KPIs related to the Sustainable Development Goal, missing metrics the proportion of token holders that are involved also in the Catalyst community or using other Cardano assessts.  Most of the milestones are defined well, but the milestone from the week one - legal/contract - is independent work of the from team and, in my opinion, cannot be guaranteed. In the risk managment part they only mentioned one specific risk related to marketting payment and mention the challenges related to funding problems but don't consider sollutions ... for instance they could mention other opportunities to cofund the idea (maybe sustainability grants, fundraising platforms ... ) ", "q2r": 3, "assessor": "z_assessor_3256", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12341, "q0": "The idea addresses the problem in the  challenge setting. The proposal addresses a lack of awareness of an Eco cashew Fair Trade in West Africa. The proposal, identifies a sustainable cashew project that aims to bring cashew processing to cashew farmers. The proposal seeks to address the problem by building partnerships, list cashew F, a cardano native coin, create awareness using  marketing tools. These will go a long way to promote cashew trade among  West Africa countries using Cardano  token coin. Furthermore, the proposal falls in line project Catalyst objectives. The idea articiculates how it will add value to the cardona ecosystem. Furthermore, the proposal brings out the key metrics and goals of the proposal align with the challenge settings. As such the use of crypto CEX platform to organize marketing, and with and AMA to bring their message to the public. The use of social media to reach a limited reach in the world of crypto enthusiast. I believe the proposal addresses the challenge and outlines sustainability of the project.", "q0r": 4, "q1": "The team demonstrates experience in the project, I believe the information provides the experience and expertise of the team involved to the implementation of the project. The proposal has shown in an identifiable manner, the type and number of team members required to implement the proposal. The proposal provides a budget for the project. However, I'm not sure if it provides a clearly broken down items, which I think needs to be provided for the stated project. The plan describes the resources necessary to the implementation. The plan provides the resources necessary to implement the project. The information provided platforms for the E-cashew project. Furthermore, the proposal has considered challenges and risk relevant to the implementation of the project. Despite, the stated risk of the platform not executing marketing and listing after payment. The use of Cryptocurrencies and Bitcoin is nothing new to this part of the world. Though some parts of West Africa countries are yet adopt to the use of Cryptocurrency trade and business. The team must consider an appopriate team using due deligence in selecting partners for the stated project. I believe if the project receives the necessary funding it can be implemented.", "q1r": 4, "q2": "The information provided shows descriptions of the problem and how the solution addresses the challenge. However, I'm not sure if the proposal has provided a clear roadmap with milestones and clear time horizon for achievement. The proposal has provided metrics and Key Performance Indicators (KPI's) for the succes of the proposal. As such, these metrics provided seeks to measure the succes of the project, the number of token distribution of cashew F, the percentage of E-cashew community that supports the E-cashew goals, the number of farmers who have received fair trade prices for their harvest in West Africa.Futhermore, the proposal provides an understanble solution that addressess the problem. I believe the proposal has provided clarity of information.", "q2r": 4, "assessor": "z_assessor_3401", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Build partnerships, list CashewF, a Cardano Native Token, on a platform & create awareness using marketing tools, AMA, as suggested by the launching platform.", "experience": "Ronald, CEO & Founder, 20+ years experience in West Africa.\nAdriana, Accountant Controller, 10+ years experience in accounting.\nEmile, CIO 30+ years experience in entrepreneurship. Discord: DutchSpirit#3077\nSee whitepaper link below for the complete team"}