{"id": 418305, "author": "ihelper", "title": "North Africa Cardano Community Hub", "url": "https://cardano.ideascale.com/a/dtd/418305-48088", "category": 26600, "amount": 3950, "description": "Most North Africans (Morocco, Algeria, Mauritania, Tunisia, Libya, Egypt, Sudan) native language is Arabic, many speak french but most Cardano materials are in English.", "f6_no_assessments": 9, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 1686, "q0": "In terms of impact, the proposal is excellent, as it suggests that a community hub be created especially for the Arabic-speaking community, so that there is a better adoption of Cardano/Catalyst for this target audience, promoting awareness and adoption of the technologies of the our ecosystem. The creation of this hub would perfectly meet several of the specific objectives present in the challenge description, increasing the number of: “proposals that address the fundamental issues that impede the adoption of Cardano in Africa; new Africa-based users integrated with Cardano (wallets, platform subscriptions); new Catalyst members based in Africa (proponents, voters, CAs); new Catalyst members based in Africa (proponents, voters, CAs); African projects launched in 2022 and finally from African developers”. Proponents argue very well for the need to translate content into French and Arabic, since most of the population in several countries, such as Morocco, Tunisia, Egypt, etc., speak these two languages, and it is It's an old problem that most of the content related to Cardano is in English and that means a big problem of accessibility for people who don't speak the language natively. Proponents also argue how large the number of people will be reached: around 255 million. My observations, however, are that the proponents could have been more specific in some explanations. For example, in the following two passages: “We propose the creation of a community center in Arabic and French to help North Africans embark. Biweekly meeting with educational content will help inform about the Cardano Platform and Catalyst projects” - what would that educational content be, exactly? Would it be something created from scratch, or would they translate previously existing content from Catalyst School, or even from well-established youtube channels like the IOG channel and Catalyst Swarm, for example? In the other excerpt: “we also propose to translate introductory educational material into Arabic and organize events on Cardano and Blockchain”. It would be very beneficial for them to explain more about this introductory content. What would be the specific issues addressed and through the approach they would be commented on? How could we make content that is often predatory, simple and accessible to our target audience? Returning now to the positive points, it is quite valid that the proponents have already thought about the main problems they may face (the lack of funding and the lack of engagement of new members) and have already proposed solutions, I think it is quite coherent to ask for a smaller amount of funding so that they can succeed more easily and get the project off the ground. In general, the proposal is highly impactful (but the explanations I mentioned would complement even better what is being presented).", "q0r": 5, "q1": "The topic is great and will receive full marks, but I would like to offer some constructive criticism. Speaking specifically about the script, I believe that the information is not conveyed very adequately. The timeline is not so clear, how long is the project planned to last? 3 months, how long would it take for the next fund to be established (between the release of results from f9 to f10)? It is said that some meetings would take place every fortnight, but as I mentioned in the impact part, it is not known exactly what issues would be addressed, nor do we have information about the pre-production process of these meetings. It would be important that some more details were explained, such as: who would participate in each meeting, among the members presented in the team; how the meetings would be publicized, how the North African community would be informed whenever there was a new event; how the organization of these meetings itself would be (how long would they last, if by chance the first hour was for exposing content and the second for questions and answers, for example…). Likewise, could more details have been provided about the other parts of the roadmap (planning meetings, what content would be published on the blogs, how support would be provided - individually or in group sessions? In my view, the way the roadmap was presented to us, we did manage to have an understanding of what will be done, but this one is not so detailed. Speaking of expenses, the asking amount is very affordable compared to other Catalyst proposals, and it is divided into two large parts: the costs for maintaining the site and the zoom license and the incentives for the team; from what I understand the workers' hour would cost 50 dollars, but for example in the translation part (that would be 6 documents translated, right?), and in the management of Telegram and Discord, it could be explained better how this management process would take place. From what I understand the cost would be 100 dollars per month, but it would be important for us to understand the role of this pr professional in the project. When it comes to the team, we have Elias and Ayoub as active members of the community, which is super important. I believe that more basic information about who they are is passed on. I would like a slightly more extensive resume on each. However, trust is passed on, as we know the most essential thing about each of them, their linkedin profiles and who has some kind of previous experience with our blockchain. With this, I believe that the proposed feasibility is good, and can be improved in the aspects mentioned above, so that our level of understanding can improve even more about all parts (especially in script).", "q1r": 5, "q2": "Finally, thinking about auditability, the proponents tell us some really useful and valid data, but not my view that still need to be worked on better if we are looking for perfect auditability. Talking first about how we could monitor the periodic progress, the suggestion would be through “Meeting recordings + Community members + Number and quality of translated content”. In addition to understanding how many meetings would be held, I would like us to be able to monitor the pre-production process of these meetings, that is, what would be done to make them possible. In other words, the team planning meetings, the content translation process, etc. The use of funding would already be demonstrated to the community, which indicates that the proponents already have an intention to keep all of us updated on what is happening, so I believe it is necessary that we also know what is happening in relation to these other two variables (the pre-production process of the meetings and about the meetings themselves). That way we would have a more complete monitoring. Such information should be reported to our community, I believe, at least at the end of each month. About success, this is explained very succinctly as the integration of new members (North Africans) both in the general community of Cardano and in the catalytic project; and the goal is for 20 participants to attend these fortnightly meetings. In addition to analyzing numerical data, a direct survey could be carried out with the target audience so that we could understand how they were relating to the various parts of the community. Would they have joined project teams, would they have been using Dapps, would they have registered identities at Atala Prism, would they have been participating in other groups such as the Catalyst School, would they have become PAs, vPAs and so on? In other words, it would be necessary for us to be able to understand the most tangible results of this project both for Cardano and for the North African community, so that we could be sure that the objectives of the challenge were indeed supported. Having said that, I think the proposal is indeed auditable, but some points could be improved, especially in relation to the analysis of the success scenario. More careful research could be carried out and the result of which should reach the knowledge of our entire community (for example, a debate could be opened in some breakout room, post Town Hall). Therefore, I will give a score of 4 for the auditability of the proposal, as it is good, but not yet excellent.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 11, "ne": 7, "ng": 3, "nfo": 1, "vca_o": 2}, {"id": 451, "q0": "As the headlines suggest, this proposal is straightforward, it seeks to provide a hub where it accommodates the regions in North Africa. Before dwelling deeper, a basic geographic education should be continuously reminded to the Cardano community. Africa is a huge continent, it is not correctly displayed in our typica globe, we must understand that Africa's land mass is enough to fit in the U.S., China, India, Japan, Mexico, and many European nations, COMBINED. That is why having multiple African hubs is crucial. That is why this proposal is important.\n\nAlthough it only seeks to create an online congregation for North Africa and nothing else, it is a must needed start. Eventually through the collaboration with other various Town Halls/Hubs, the effectiveness of this hub will exponentially increase.", "q0r": 5, "q1": "Since the goal is to create a hub, a critical experience needed would be involvement in a community building effort which one of the team members have. That team member is the Arabic Team Leader of African Town Hall. One other core team member that would be need is a person who technically understands Cardano, whom can always be a trusted reference on the latest updates in the Cardano ecosystem. Lastly, again at the very least, there should a dual speaker, either Arabic and English or French and English. These bare minimum core team requirements are are existing.\n\nThough, these core team members do need more collaboration with other Cardano communities, most specifically the Catalyst School. How the structured this proposal does not help them at all in receiving good assessments from Proposal Assessors (PAs). The structure is more that of a article than a proposal. PAs are forced to shuffle to all data.\n\nWith that said though, in comparison to what the core team wants to achieve with the budget asks of only $3,950, we could say that despite all it's writing inadequacy, this is such a small risk to take for such an important onboarding proposal.", "q1r": 4, "q2": "The information provided is borderline bare minimum for what a community hub should prepare for and what they intend to deliver on. One aspect they could improve on is to be more detailed in terms of explaining what to expect in these bi-weekly meetings, what education materials will be created and in what format to future efforts to develop this hub after identifying the potential risk it may face, such as difficulty to recruit members.\n\nAs an experienced Arabic Team Leader for the African Town Hall, the proposer could have coordinated with at the very least Catalyst School to have workshops in this hub. Catalyst School and all it's teaching is an effective early onboarding tool.\n\nIt terms of roadmap, information provided is a stop-and-go structure where there is no explanation of the continuation of this proposal. Though it is not mandatory, it does send a signal to the community that these individuals are committed. Such as the attitude of the LATAM community. Even though not funded last fund series, they have continued to maintain their hub, this can then be a persuasion tool to the voters to vote on them in future funds.\n\nIn terms of budget and their usage, it is as earlier mentioned, straightforward and clear. Though, it would have again, be beneficial for the proposer to be more detailed therefore making accounting easier to achieve. For example, the proposer mentions budget for translation, translation for what exactly? Although it is implied briefly in another part if this proposal, it shows how this proposal is not structured to be PA friendly. I myself is quite patient but not all PA's might be the same as myself. ", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 15, "ne": 3, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 3387, "q0": "Access to information about the Cardano ecosystem and the blockchain in their own language will allow more people to join the project and to increase interest about it, and have some people who would be more active and end up playing important role in within the Catalyst community.\nThe North Africa is a region where Arabic is the main spoken language and having information around Cardano translated and community session held for that community, will for sure attract individuals from this region to get onboard. A region in which the demographic is considerable, around 255 million population, and on average, formed by young.\nThis initiative would definitely be aligned with the challenge objective by onboarding new members, but also make more people adopt Cardano and share information about the ecosystem to get it known by more and  more people in the region.", "q0r": 5, "q1": "By providing information about Cardano and the blockchain in Arabic for people in the Nothern region of Africa who mainly speak that language allows them to be exposed to that information and access it. This becomes an asset for outreach within this community. As the basic of this initiative, it represents some potentiality to be successful. On this, the team of proposers is formed by people who are familiar with the project catalyst and has been involved for a while, with various background in technology, customer service, web development...However an important aspect of the proposal is the translation of cardano and blockchain information in Arabic, what it's difficult to specify is whether among the proposers if there's a translator, since this may be needed to have those tolls to be well translated. What's presented, it's, team members who are multilingual which is not a guarantee that those people would be  able to translate. It would be more efficient to get some translation expertise from internal or external; and if there's from within the team, it is not clearly mentioned.\nThe team is planning on converting the fund in stable coin, what's less clear is whether is it the funding that will be converted, and if yes, in what type of stable coin? \n6 sessions in 3 months, 3 educational blogs on Cardano and a Telegran channel as results of this proposal are ways to spread the information about Cardano, but also this would help to onboard new people.  I'm giving 4 stars as I pointed out out above some clarification around the translation process, but the proposal is feasible.", "q1r": 4, "q2": "The proposers have to provide ways by which the community may follow the proposal progression, but in this case the team has mentioned how would the success look like, without providing the follow up and evaluation mechanism. This would be helpful knowing that there will be a website up , a telegram group and Whatsup group that may be used for the community access. Among the indicators, the team is mentioning onboarding 20 unique participants and onboard new members. It would may be necessary to mention a projection of how many would be involved actively and play some key roles as PA/VPA or Proposers.\nBut overall the road map is detailed and how to overcome the potential challenges. ", "q2r": 4, "assessor": "z_assessor_2458", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5746, "q0": "Africa is become more and more integral in the growth strategy of Cardano. Onboarding new users in Africa will be faced with many challenges (language, geographical localization and interest in solving their unique problems) \nThe team and North Africa community hub is proposing to create an active user base that focuses on the North African countries that mainly speak Arabic. \nThis will bring in a new set of tools and ideas to discuss. Their approach to onboard the Arabic group is a key strategy and can show be fruitful as the scaling can reach further out of Africa to other countries worldwide. \nGrowing cardano with a new user base and reaching to new frontiers are key strategic goals and this proposal will answer a few elements for the Arabian user base. ", "q0r": 5, "q1": "Following this proposal in depth I have been exposed to already a 200+ user base that have started. This is a strong indicator that the team behind the proposal is serious to generate interest and activity. \nLooking at the team members description they all are located in North Africa and have experience within the cardano space and have animated tow halls and are active productive members. \nThe budget is very small and shows that the team is not seeking to personally benefit from the funds but rather provide additional resources to an existing project they hold dear to themselves. \nSuch group of motivated members and contributors will leap higher with the small fund request but more importantly the moral support the voters will offer the group for the efforts they are placing.  The timeline for this proposal is well\nDetailed and has some key factors to guide the project to success. The achievable and quantifiable points are listed clearly and will show the success of the projects progression. ", "q1r": 5, "q2": "The team behind this proposal have listed the key milestones and progression track clearly. Since the goals is to create an active community and publish development material. The deliverables can be audited with ease as They are present within the public internet domain and can be tracked with confidence. \nFinally the team seem to operate with a trustful environment and based on the low fund budget are simply looking for voter support rather than considerable fundings. \nIn addition to the documented material there will be recorded meetings done on social media platforms and be attended or reviewed for the closing of this project upon auditing. ", "q2r": 5, "assessor": "z_assessor_2745", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6808, "q0": "Laguage tend to be a major setback in Africa which also hinders economic and technological growth. Providing Cardano centric community hubs in African local native language speaking regions is an added advantage. These proposal seeks to address language constraints preventing startups from North Africa (Arabic and french speaking regions) to benefit and adopt the huge benefits of the Cardano ecosystem. The hub will be used to educate, orient and familiarize individuals from those regions about Cardano in their native languages through discord, weekly zoom calls and eventually boost adoption in those regions. These uniquely identifies the bottleneck of new entrants into blockchain/Cardano and as such fits the Grow Africa challenge category.", "q0r": 5, "q1": "As stated in the proposal, the team members are active members of the Cardano community as well as members of Cardano Africa townhall who are equipped with experience in education and community management, IT and blockchain enthusiast and speakers of both Arabic, french and English langages which clearly fits their mission, a biweekly timeline as major milestone. Furthermore, the budget is fairly reasonable although i have little concern about what functionality will (website) provide as one of the budget items. The proposer provided details of four team members but budget calculations was for 6 team members, one item in the team incentivessubsection of the budget tagged \"Translation\" is a bit vague because previously, i read in the proposal that team members speak various languages needed to run the hub, why then is translation charged?. Also it was mentioned in the proposal that these proposal will be a recurrent proposal to the catalyst proposal and these led me to imagining if it will really be a sustainable project and if catalyst does not exist anymore, it cannot continue. Team need to devise a mechanism/means for the project to be self sustaining longterm.", "q1r": 3, "q2": "The proposer provided me with informations relevant to tracking the success and progress of the project. There'll be regular meetings and recordings although it is not stated how often the meetings will be held, financial reports will be submitted to whom (not mentioned), there'll be adequate records of translated contents. Also the success of the project can be tracked by the number of unique participants in biweekly events. It'll be an added auditability feature to report progress to the project catalyst team in intervals that suits your schedule.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 7633, "q0": "The problem described in this proposal is closely aligned with the challenge.\nThe team has done a great job by putting the proposal at the right challenge. \nThe proposal clearly provides a precise solutions to the main problem of this challenge. They proposers believe that what impedes Africa from becoming a leader in Cardano adoption rather than a perennial follower is technology skepticism and language barriers. They aim to tackle both barriers through evangelizing Cardano in the Arabic and French languages in north African countries who mainly speak Arabic and French as their official languages. \nThe proposal clearly articulates how it will add value to the Cardano ecosystem by sensitizing and translating introductory educational material to Arabic and organize events about Cardano and Blockchain to draw more people into the ecosystem.\nThe key metrics and goals of the proposal align with the outlined challenge settings\nwhich is to drive and increase the number of active participants of Cardano numbers in Africa. \nThe proposal is able to scale to address future challenges through their north African hub and the proposal clearly articulates a plan for the project's future sustainability. \n", "q0r": 5, "q1": "The proposer have been able to provides evidence in the form of references, links, amongst others  of relevant skills and experience of members of their team. The proposal and team from the links provided have the desired skills and experience to be able to execute the project should they be funded. The proposers have also done well by providing a detailed budget, broken into identifiable bits and how they are going to be used to execute their project and the budget is reasonable to achieve the set goals should they be funded.\nThe proposal offers a realistic timetable to complete the work.\nThe proposal provides a sensible and conductible plan for implementation which is also commendable. \nAnd the proposer has considered the challenges and risks relevant to a successful implementation and how to mitigate them.", "q1r": 4, "q2": "The proposer have provided a clear roadmap with milestones and metrics to measure the success of their project. They measure the progress of the project through, meetings recordings, community members\nand number and quality of translated contents. Furthermore, success for the project will look like onboarding new members to Cardano and Project Catalyst and 20 unique participants in the biweekly events.\nThe main accessible public channel for delivering regular updates to the community for auditing progress is their Discord server which they have provided. ", "q2r": 5, "assessor": "z_assessor_2908", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8466, "q0": "I like the idea of this project, which aims to build a for the Arabic speaking community to allow individuals to join in and connect with one another and increase awareness of Cardano and blockchain. The team has made research on the current demographic situation of North Africa countries. Creating online meeting through zoom is an appropriate choice in the current covid 19 situation. However, I would be more convinced and better understand the project's impact if there are additional information. What is the current community's degree of blockchain understanding? If there is a lack of awareness of blockchain, what is the incentive for the community to start learning and joining the hub? And what specific educational material will the team provide to raise their interest?\nOverall, more information should be delivered to better assess project's impact. ", "q0r": 4, "q1": "The plan lays out a timetable for the main tasks that will take place during the next three months. Team members have the necessary experience to carry out such a project. The money's usage is clearly indicated in terms of how it will be utilized. However, the team should demonstrate sub-activities in each main activity more thoroughly.\nFor instance, what are the main contents of a session, as well as educational blogs (unique to the sort of information they plan to give. This will allow them to be more specific about the audience they should target)? What marketing plan will be implemented to acquire new customers?", "q1r": 3, "q2": "This proposal includes general metrics for tracking the project's development. However, I feel the team should share more quantitative indicators so that the community can better understand whether or not the team is meeting the KPI. As an example:\n- Comments/feedback on the events\n- Group chat interaction level\n- An increase in the quantity of proposals in Arabic.\nThe team should update the progress of each work on a weekly or monthly basis, document it, and make public it so that the community may maintain track and review it.", "q2r": 3, "assessor": "z_assessor_2985", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10834, "q0": "The language barrier is a challenge to knowledge transmission as well as the opportunities the Cardano ecosystem can bring to Africa. The proposed goal is to establish a community hub in Arabic and French to assist North Africans. I believe it fits the challenge goal. However, not too many details about this community hub are shared, about the name? How does it work? On which platform does it work? I don't really see what it will do to address the challenge. I think this section has a lot of things that need to be clarified. ", "q0r": 3, "q1": "Unfortunately, this part of the project really needs more information. The project plan and budget are presented very superficially, lacking details. A concrete example: Publishing 6 Arabic educational blogs on Essential Cardano. What will the content of these blogs be? Does the content in these 6 blogs link to each other? Who will do it? Similarly, we know 3300$ team incentives. How much time do they spend planning, and participating in the workshop? About the project team, the information is also quite good, it is enough for us to believe. ", "q1r": 3, "q2": "Similar to the previous topic, this one leaves a lot to be desired. They will measure project progress based on: Meetings recordings, Community members, Numbers, and the quality of translated content. A financial report detailing activities and expenditures will also be sent to the community. But, where will it be sent, how often. The indicators given are only related to the success of the community hub. I think there need to be more specific measures of its impact on the Cardano community. Example: Number of new Africa -based Catalyst members, Number of new Africa -based users onboarded onto Cardano,... ", "q2r": 2, "assessor": "z_assessor_3196", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 12719, "q0": "The stated problem and solutions are well-presented and correctly address the Challenge Topic of \"Grow Africa, Grow Cardano\". It is very easy for analysts to tell that the Team is building a Community in North Africa to solve the existing problem.\n\nThe Team has presented a well-prepared proposal with supporting materials and contents, a detailed budget, and a well-thought-out action plan. They have also put effort into presenting this proposal in a clearly written manner with bullet points, spaces, and paragraphs.\n\nIf this project can be carried out successfully, it will add value to the Cardano Ecosystem and Community by promoting Cardano to a potential audience of 255 million users in North African countries. Having access to a big community will eventually bring about financial benefits to Cardano.\n\nFor the above reasons, I give the Proposal a 4/5 score for Impact, given this Project can be executed with success.", "q0r": 4, "q1": "I find the Team's quoted materials and contents trustworthy. While their action plan is well-presented, their budget needs to be better formatted with units of cost items in order to make it easier for readers to keep track of. In addition, cost items should be broken into smaller items to make audit activities possible.\nIn addition to a very well-presented proposal, the Team has successfully provided members' credentials with LinkedIn profiles. I find the Team capable of delivering the project successfully with both social networking and technical personnel. Given that the Team's credentials can be verified, I believe that they will be able to carry out the proposed actions successfully within the timeline.\nI agree with the team's findings on potential risks associated with this Project. They should, however, consider other possible risks such as the underwhelming impact of the Project or the Team's inability to control costs to be better prepared after they are funded.\n\nFor all the reasons above, I give the team a 3/5 score for Feasibility.", "q1r": 3, "q2": "While I value the team's stated solution, their only objective of reaching only \"20 new participants in the bi-weekly events\" does not justify the USD 3,950 amount of the proposed budget. In addition, the Team failed to mention how other activities in their plans are reflected in the corresponding KPIs.\nWithout more specific goals, there is impossible for analysts and the community to assess the feasibility or the auditability of this project. Moreover, the Team has not provided information on their reporting system or audit method for the Cardano Catalyst Fund to track their spending and progress.\n\nThe Team has been able to provide information on how to track their progress, but not on how to track their expenses. They should provide more information on this to be transparent to the Cardano Catalyst Fund.\nAs a result, I give the team a 2/5 score for Auditability.", "q2r": 2, "assessor": "z_assessor_3470", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Creation and animation of a community hub for the Arabic speaking community to drive awareness and adoption around Cardano in North Africa, mainly, weekly meeting, Discord server.", "experience": "Active members of Cardano an Catalyst ecosystem with experience in education and community management. Cardano Africa Town Hall members, Sustainable ADA and Cardano4Climate.\nIT and Blockchain enthusiasts. Arabic, French and English speakers."}