{"id": 418706, "author": "redtaged1", "title": "MCA: A Model School in SA - Part II", "url": "https://cardano.ideascale.com/a/dtd/418706-48088", "category": 26600, "amount": 60000, "description": "Utilization and adoption of the Cardano protocol is extremely challenging for faculty and students in SA with limited computer experience and inadequate internet connectivity.", "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"id": 10153, "q0": "The proposal is aligned to the challenge because it benefits both the South African community and the Cardano ecosystem by taking action from the ground up, which is to invest in the education and dissemination of Cardano to increase its adoption. \n\nStarting with the Treasury and Incentive System, which includes designing smart contracts to motivate students to contribute to the website and students' blog, receiving incentives in ADA, as well as linking school donors to their students, providing confidence in a recurring donation, and at the same time encouraging the use of our cryptocurrency. \n\nFrom my point of view, both the incentive system and the generation of trust in the ecosystem are key factors in communities like SA, considering the high levels of corruption it has, with a score of 44/100 in the Corruption Perception Index (Source: bit.ly/3AwO8hP), which make potential donors and investors decide to provide their money elsewhere due to distrust of the proper use of their resources. By using smart contracts, it offers transparency in transactions and ensures that disbursements are made only on the desired terms.\n\nThe proposal also hopes to create a stake pool for which they have already identified individuals willing to delegate a minimum of 2,000,000 in ADA for this pilot project, which will also help increase Cardano's participation in the country's economy.\n\nThe metrics that the team set out to evaluate its success, such as the number of students and teachers at the MCA school with Cardano accounts, the number of smart contracts or projects implemented, and the operability of the stake pool mentioned above, are also aligned to the challenge as they are concrete ways to identify the impact of the project in bringing new users to the ecosystem and its positive influence in the community.\n\nFor all of the above, my impact evaluation is a 5.", "q0r": 5, "q1": "Having been funded in Fund 6 (bit.ly/3AwTiur), the team clearly describes the plan and resources needed for this second phase of their project, bringing evidence of their achievements. This gives me confidence that the team is prepared and has the necessary skills to implement this proposal. Even so, they remind us who they are and their background, with a brief description of each one of them. Both the photos from the events, the presentations and the documentation of the teachers' profiles provided in the proposal, give us a good summary of the objectives completed so far. But beyond the photos, the most relevant thing for me is that the team was able to identify (and show us in this new proposal) the main learnings of Phase I. A project can be a success or a total failure, but whatever the outcome, the most important thing is to capture what was learned and leverage that learning in the following projects, both what went well to continue to do so, as well as what did not end as expected to take corrective actions. This team has also identified the main risks that may affect the success of the proposal: at a financial level, such as the possibility that the price of ADA will fall and not allow them to fully fund themselves, at a technological level, that the continued development of the protocol and smart contracts will stall, and at a personnel level, that they may lose key people such as their smart contract developer. While they took the time to list the aforementioned risks, I believe that at this point the proposal could be more robust by identifying other risks and especially what actions they would take upon their eventual occurrence, so as to strengthen their preparedness. For example, in their Fund6 proposal, they mentioned poor connectivity and lack of internet as a problem, for which they requested $5000 in Capital Expenditures. However, in the current proposal script, they comment that internet access at the site continues to be an issue, finding that MCA stopped purchasing internet data. Given issues like this, is that I suggest to include it in the list of potential risks, and describe what can be done to correct or mitigate them, because if the problem persists, it may affect the success of the proposal. Finally, we can see in the attachments a detailed budget with each line item and its monthly disbursements that seem in line with what is needed to carry out the proposal. What I could suggest, going back to the internet topic, is that I see an item for investment in connectivity equipment, but I do not see that they have considered the monthly cost of data consumption or an Internet data plan. It would be interesting if they could clarify where they will get the funds to maintain the service on a monthly basis. In summary, I strongly agree that it is highly likely that this proposal will be implemented successfully, I just recommend a few small adjustments so that there is no doubt.", "q1r": 5, "q2": "The team provides us with a clear roadmap of what they expect after receiving the funds, starting with the implementation of the incentive system through the Math Performance Project, as well as the treasury system with the Website Treasury Pilot Program. They then plan to initiate the governance system with the introduction of the FirstRoot.co Pilot Program. Each of these milestones has clearly defined who will be responsible for them and what is expected to be achieved. Subsequently, they hope to initiate their own stake pool and the implementation of the Smart Contract linking individual donors to MCA's treasury account. \nAs there are multiple challenges, I think it is right that the team has contemplated that the following months will be dedicated to the sustainability of the challenges through continuous improvement, innovation and experimentation, an issue that other proposals do not consider and is extremely important to ensure that ideas do not die after the kick-off. \nRegarding the proposed metrics of having at least 1/3 of the student body involved in smart contracts or related projects, a minimum of 5 donors in a smart contract with MCA students and the establishment of the stake pool, these are achievable goals and at the same time challenging enough to demonstrate the success of the proposal. These are KPIs that can be easily measured without any subjectivity.\nIn terms of auditability, I would only recommend to make a public channel available for delivering regular updates to the community of the progress made, so that we can determine whether the proposed objectives were met in a timely manner. Although the web page www.amodelschool.com is under construction and the theory explaining how the pilot programs will work can already be visualized, the proposal does not mention that they will publish there, or through any other source, which specific objectives have been achieved and the KPIs at the moment. It is of utmost importance that the community has access to this information both for auditing purposes, as well as to promote the success of the project, in order to motivate other schools to do the same, as well as the general public about the different use cases that can be attributed to Cardano with its infinite possibilities.", "q2r": 4, "assessor": "z_assessor_3161", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 4387, "q0": "I feel very interested in the group's proposal. A proposal that has a high impact on young people in Africa in particular, students who are still facing difficulties in learning and living conditions. If this proposal continues to be implemented, it will improve the performance of schools and students in the educational environment. It solves the current urgent problem of people's intelligence that the African community is facing. We all know that improving knowledge and raising people's knowledge is a key conditions for poverty reduction and national development. You have specifically stated the goals you need to achieve success throughout the day. It has a great impact on the Cardano ecosystem now and in the future. It makes sense that even Charles Hoskinson himself was interested in doing work to help developing countries in Africa. I believe that a proposal raised in Fund 6 will continue to be implemented in Fund 9. It will not be difficult if the group is supported to have the conditions to disseminate knowledge about Blockchain Cardano to each student. teachers and other interested people and not just encapsulated in at least a third of the students, 40 students, the board, faculty, and staff... Key indicators and goals are also relevant to Challenge.", "q0r": 5, "q1": "I found the team members to have the expertise and experience to implement the proposal. However, I would like to comment on the listing of the members' identities, which is the group that needs a quote with a link in the social network for the community to easily view and follow. It is also a way to improve the community's confidence and feasibility of the proposal. Regarding the photo quality of the members, I completely trust and support them. For the budget is also listed in detail, reasonable. I like how you laid out the plan and how it was done. It's a continuation of what you did from Fund 6. Just keep the impact, feasibility, and transparency of the proposal plus the quality of the resources needed to do it (including resources). about human resources), then you continue to have support from the community. The group also saves quite a lot of martial arts and related risks: finance, technology, and human resources. I haven't seen you document how to tackle the challenges. These are challenges that any proposal can face. Technologically, it's a pity that I haven't seen the team specify the Cardano protocol used. For me, the team needed to complement the presentation on the technical side of the technology.", "q1r": 4, "q2": "The team has outlined a specific program. I wish the team could show the whole way through the 6th Fund proposal so far so that the community can be full of people, what the members have been doing so far. It is also a way to increase the transparency of the proposal. I have no doubt the problem is well defined, to understand. I've seen you measure project success or not. Thereby, I would like to comment on how to measure the project, that is, based on the progress of the work completed and the results for the community after the work is completed. The team can also invite the community to participate in filling out the reference sheet to get a better idea of ​​the community's feedback on what's good and bad. From there, the team has a basis to recover and improve the things that exist or do not work well. Another thing I'm concerned about is that although you already have a way to measure job completion, it doesn't show metric KPIs. You should consider adding numeric KPIs only to the proposal because digital KPIs are just a great way to get the job done. In the end, I have full confidence in the success of the proposal and a good future for the children of Africa.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7636, "q0": "The problem described in this proposal is closely aligned with the challenge. The team have done well by putting the proposal at the right challenge. Moreover, the proposal identifies a problem within the challenge which resides in the utilization and adoption of the Cardano protocol in the school system in South Africa (Africa) especially by faculty and students. Also, the proposers solution for he problem is to use their model school of vulnerable children to create a pilot project that will merge Cardano’s treasury, incentive, identity and governance systems. \nThe proposal articulates how it will add value to the Cardano ecosystem through showing how the utilization of the Cardano protocol can improve school and student performance in Africa such as in STEM- Science Technology Engineering and Mathematics  education\nThe project will also demonstrate how Cardano can be used to fund schools by using smart contracts to link donors with the school and finally, the project will increase Cardano's adoption by providing ADA accounts to students and teachers both at MCA and in other schools that might adopt this model in Africa.\nFurthermore, the key metrics and goals of the proposal align with the outlined challenge and what its needs to make Africa a global leader and not a perpetual follower. \nThe proposal is able to scale to address future challenges that has to do with issuing smart contracts and sending donor funds to schools, NGOs etc. And it shows a plan for the project's future sustainability since it falls   within the United Nations Development Goals #4 Quality Education.", "q0r": 5, "q1": "The proposer provides evidence in the form of  links, past projects etc. of relevant skills and experience needed to implement the proposal if funded. The proposer knows, in an identifiable manner, the type and number of team members, they have also showed areas they are lacking knowledge and the fact that they are training some members of the team to be abreast with some functionalities of Cardano to be able to implement the proposal and the team from the links provided have the desired skills and experience to be able to execute the project should they be funded who also appear to be experts at their job. \nThe budget is also stated and outlined  clearly and broken down into identifiable items which is reasonable to achieve the set goals and it offers a realistic timetable to complete the work. The proposal provides a sensible plan for implementation that shows not only what is being done but also how and by whom such as the team members who will be teaching the kids, teachers and administrators. What I like about this proposal is the plan describes all the resources necessary to implement the proposal.\nAnd most importantly, the proposer has considered challenges and risks relevant to a successful implementation and how to mitigate them such as the issue related to financial, technological and personal. \n\n", "q1r": 5, "q2": "The proposers has describe and stated clearly a roadmap with milestones and a clear time horizon for achievement with regard to this proposal. They have stated specifically when the project will start which is in August and end somewhere in November and beyond, with clear plans highlighted for the project with respect to measuring the project including the number of students and teachers at MCA with Cardano accounts involved in smart contracts or other identified projects, the number of smart contracts or identified projects implemented and  whether we have established an operational stake pool.\nFurthermore, \n\nuccess for this project will look at least 1/3 of the student body, 40 students, have been or are involved in smart contracts or related projects, they have a minimum of 5 donors in a smart contract with MCA students through which donations are flowing to MCA and involved students and many others.  \nThey are working on developing their own website which is www.amodelschool.com which is an accessible public channel for delivering regular updates to the community for auditing progress.", "q2r": 5, "assessor": "z_assessor_2908", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10103, "q0": "The proposal will provide a solution to the current problem which is a difficult problem for the use and application of the Cardano protocol with lecturers and students in South Africa in terms of computer skills and experience as well as problem for internet connection\nThis output fulfills Cardano's goal in Fund 9 to get a team ready and able to contribute to the Cardano ecosystem and is very suitable for the challenge in Fund 9, Grow Africa, Grow Cardano\nThe proposal offers a model field that unifies Cardano's treasury, incentive, identity, and governance systems.\nThe product here is to provide the infrastructure, utilities as well as pay the staff to be able to build and train a young team capable of contributing positively to the Cardano ecosystem in the future. future, increasing Cardano adoption by providing ADA accounts for students and teachers at MCA and other schools that can adopt this model\nFree users or beneficiaries of the Proposal are Education Members and approximately 120 students studying in a model school in South Africa. I believe this is a very promising Proposal that can train a workforce to contribute to Cardano.", "q0r": 5, "q1": "The Proposer detailed and convincingly presented the solution for this second funding round of this Fund 9 of the Proposal. I believe that with this very scientific and effective implementation, the Proposal will achieve the set target and possibly exceed expectations.\nThe proposed implementation plan is divided into two very large phases. Phase 1 to build the foundation, solve existing difficulties such as making internet connection, Upgrade basic equipment at MCA, provide tools for trainers, open training programs, prepare training courses, legal issues, creating websites, developing smart contracts, building management systems... Phase 2 will focus on developing in detail the objectives set out in phase 1. With a very detailed presentation The detailed and reasonable from the implementation programs shows the thorough preparation of a large and long-term plan by the implementation team.\nThe proposal is made by a team of 7 key personnel, they are all experts and experienced people from the fields of Education, business, finance, application developers... These members have been very active from previous Funds, can be verified and can be contacted. Through the re-uploaded photos and videos, we can completely trust the Proposal implementation team, they not only do their job well, but they are also very enthusiastic and very kind people.\nThe proposal has two funding sources, one from Catalyst and the second from private funding. I think this personal donation is very welcome.\nThe proponent presented the possible risks very honestly. Through concerns about key personnel, it is recommended to have a method to retain this key person to avoid future loss.\nAs this is a further development phase from the success of previous Funds, I believe the Proposal will continue to operate successfully.", "q1r": 5, "q2": "Estimated budget proposal is 67,500 USD Used mainly for Operating expenses, Capital expenditures is very clear, specifically by the public Excel table showing that the budget has been carefully calculated, the expenses are reasonable, fair and transparent.\nSpecific roadmaps are also clearly presented for August, September, October, November and the following months.\nThe definition of Proposal success is also very specific, with a measurable number of at least 40 students, who have been or are involved in smart contracts or related Proposals, at least 5 sponsors support in a smart contract with MCA students, set up a stake pool and have a board of directors... This Proposal is a Follow-up to 1 Proposal already funded from Fund 6 so I believe the team has enough experience and can excecute Proposal successfully", "q2r": 5, "assessor": "z_assessor_3153", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 11389, "q0": "Ethiopia's minister of education confirmed the government is working with IOHK, the company behind the Cardano protocol, on a blockchain based system to track student performance in the African country's schools. Africa has been fertile ground for crypto experimentation lately. Adoption and utilisation of Cardano protocol is extremely challenging for faculty and students in SA with limited experience and using MCA will help creating model school by merging cardanos treasury, incentive , identity and governance systems. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The project has detailed plan with convincing timeline in an identifiable manner, type and number  required to implement the proposal. The budget is outlined clearly and broken down into idenfiable items. It is reasonable to achieve set goals. The proposer has provided evidence of relevant skills and experience needed to implement the proposal. The project offers a realistic timetable to complete the work and provides a sensible and conductible plan for implementation. The people working with the proposal has good experience in it. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by measuring number of students and teachers at MCA with cardano accounts involving smart contracts or identified projects, number of projects implemented, establishment of operational stake pool. The budget breakdown is very feasible and team is having very good experience. The proposer clearly explains technical aspects like architecture, language and technologies for implementation and consider challenges and risks in it. This information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "Use MCA, our school for vulnerable children with a 12 yr history & 120 students, as a test case for creating a model school by merging Cardano’s treasury, incentive, identity & governance systems.", "experience": "Ed Rettig, Ph.D, Behavioral Psychologist, co-founder of MCA\nKeith Brown, entrepreneur, architect, real estate developer\nIsaac Maleke, Chairperson of MCA\nTravis Carney, applications & blockchain developer\nRoscoe Lamontagne, art director\nAustin Rettig, co-founder & CFO of startup"}