{"id": 418944, "author": "bradleymheather", "title": "The Story Bank", "url": "https://cardano.ideascale.com/a/dtd/418944-48088", "category": 26600, "amount": 23090, "description": "Indigenious wisdom is being lost at an alarming rate in both Africa and further afield. Local communities lack the access to the technology that could help preserve their stories.", "f6_no_assessments": 9, "f6_rating": 4.037037037037037, "videos": [], "media": [], "f6_assessments": [{"id": 457, "q0": "I understand this proposer and your mission. Please do contact Robert O'Brien. He is working on something like what you are proposing but more advanced. Please note, his project is ongoing meaning he might not have a slot for a new team member. But what is encouraging for you Bradley, he is a strong believer of the \"Why\". Which means, you already the perfect candidate for this project.\n\nWith that said, knowing what this proposal is all about and what they seek to achieve, in terms of the greater strategy of Grow Africa Grow Cardano, this proposal is too advanced. For at this current stage, education on Cardano, creating developers is more essential. You could say, the \"How\" is still more important than the \"Why\".", "q0r": 3, "q1": "From the credentials given, the proposer seems to not have the soft skill needed to achieve his intended target, which includes coordination with village elders and such. Though the proposer did mention that he will collaborate with SWC, it is not mention where this delegation of responsibilities takes place. It is unclear who does what, who is the team leader, who is the coordinator and etc.\n\nThis is essential for as mentioned above, having similar experience in my local community, approaching village elders potentially involves emphatic cultural nuances. Which I assume should be initiated or at the very least brokered by the SWC team.\n\nPerhaps this is just a matter of proposal writing but it does unfortunately effects on how the likely outcome will be.", "q1r": 3, "q2": "Besides the issue of task delegation, the other metrics provided are in place. You have a clear concept or plan of what the proposer seeks to achieve conceptually, which is accompanied by clear numerical metrics. This continues also into the budget. One added critique, is regarding the use of NFT. It would have been more impactful if it were explained in more detail that the use of the NFT's here are more than just being an image.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 1061, "q0": "The Story Bank Project seeks to discover local, traditional stories from within the African continent, told by the elders of a village, that will then be recorded and minted as “lineage holder NFTs” on the Cardano blockchain. The team intends to capture these unique stories in a genuine way, to be able to transmit the authenticity through the recordings as much as possible. They have devised a plan on how to accomplish that, by frequent visits to the selected villages and “offerings” of food and celebrations to the elders, as to gain their trust and approval.\n I think preserving traditional knowledge is vital to every local community, and blockchain is definitely the best way to achieve that. NFTs have the power to bring people together, familiarise them with new ideas and create involvement within forming communities.\nAs such, I find the proposal to be well within the challenge parameters and to have a positive impact upon the local communities, by offering them the chance to have their stories heard around the globe and upon the Cardano community, by offering a new and exciting NFT project that provides valuable information.", "q0r": 5, "q1": "The implementation plan is divided into the two main developments of the project: “The Story Bank platform” and “The Pilot Program”. Each of the developments has its own timeline and tasks, with comprehensive details about each.\nThe platform should be done 6 months after funding, the design, smart contract development, frontend, wallet integration and minting capabilities will be ready by the time the ”The Pilot Program” will be finalised. The Pilot program is non-technical and revolves around the social part of the project, in which the team will be gaining the trust of the elders of 3 different villages, over a period of 4 months and on the 5th they will be able to gather the recordings to be used on the platform.\nIn conclusion, I find the plan to be well structured and presented in a clear way.\nThe budget is also clearly described. The platform development will have a total cost of $12000, as the proposer evaluates the time needed to implement it at 20 hours/week for a period of 6 months, with an hourly rate of just $25. From my knowledge, the hourly rate is very small for a blockchain developer, however, the proposer is the one who will be building the platform, as such, he is free to estimate whatever amount he is comfortable with, and probably wishes the project to succeed more than anything else. \nAs for the costs for the pilot program, the budget looks reasonable. Each meeting has its unique requirements, there is a small budget set aside for the project manager as well. Overall, I find the budget to be reasonable and realistic.\nThe proposer has provided some details regarding his experience and skill and the NGO he will be partnering with to finalise the Pilot program. He has also provided us with a GitHub link, in which we can observe the amount of activity to be consistent with what he has been describing. He has also started working on the website for the project, that he has also provided us with and that for now looks very promising.\nAs a final conclusion, I find the feasibility section well drafted, with all the information needed to be able to assess the potential successful implementation of the whole project. As such, I will rate it a 5/5.", "q1r": 5, "q2": "For the project tracking, the proposer has described posting the code on GitHub with a bi-weekly status report. I must say that I highly appreciate that the proposer has chosen to post the code as open source, as well, as it provides the Cardano community with the possibility of creating similar projects without starting from scratch. He will also be monitoring the visits to the project’s website to gather data about progressions and success at the same time.\nFor the Pilot Program, he has provided a different set of progress tracking. The number of community members engaged, the attendance numbers, people employed through the project, and the minutes of all meetings held are the points he will be measuring and monitoring, all valid methods to assess the development of the proposal.\nFor the success definition question, the proposer has provided a well-drafted answer, as well. The communities recorded would be able to earn a small passive income from the sale of the NFTs and will become incentivised to protect their culture and traditions. The success of the initial part of the project will possibly lead to other villages becoming interested, not just in themselves being recorded, but in the technology of blockchain and Cardano.\nI find all the information provided throughout this segment to be thoughtfully composed and to the point. As such, I will rate this section with a 5, as well.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 15, "ne": 6, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4108, "q0": "This project presents an interesting blockchain use case for tokenization, which involves minting indigenous stories as NFTs to retain ancestral knowledge from African tribes.\n\nWhile the concept is clever, I'm neutral on the impact of the solution due to a variety of factors:\n\n1) The revenue generation for local communities in exchange for the sale of stories has a slight cringe factor in that it essentially means these people are \"auctioning\" their knowledge to the highest bidder rather than retaining it in any meaningful way, and with no long term benefit from those sales.\n\n2) The lineage for the stories is difficult to envision, in the absence of a decentralized identity solution that would authenticate or provide traceability that has meaning to the market/buyers.\n\nWhile I generally agree that preservation of rituals, wisdom, and knowledge is an important concern in the evolution of humanity, I wasn't compelled by a strong use case for blockchain in the delivery of that promise in this proposal.", "q0r": 3, "q1": "While the roadmap/milestones present a thoughtful analysis of the workflow based on the scope presented by this solution, it was my evaluation that one of the key risks overlooked by the author is communication.\n\nIt would be anyones guess to imagine how open these tribal communities would be to an outsider coming into their spaces and asking for detailed knowledge about their customs and rituals in exchange for potential revenue from the sale of NFTs.\n\nBesides the openness factor, there's also the problem of translation.  How to even understand that knowledge?  And then to turn it into an NFT?  Then how to communicate it to the market of potential buyers, and via which channels?\n\nThese are some of the many challenges that I for-see based on my experience working in less developed foreign culture.  And while I do think the proposal offers a reasonable and genuine offer to offer a meaningful benefit, I question whether the author has the capability to anticipate and overcome the complexity of the delivery as described.", "q1r": 3, "q2": "The promises for change that this proposal intends to deliver revolve almost entirely around reduction of poverty by generating revenue through the sale of knowledge.  However the KPIs described in auditability section almost entirely focus on the collection of that knowledge, with limited concentration on building the distribution to the market to deliver on the promises made in this early phase activity.\n\nThe pilot program offers a results-oriented approach that embraces open source results delivery, however my slight disagreement in auditability also lies in the difficult of determining the beneficiary of funds that may be generated by any NFT sale -  a core element of this proposal which is not addressed in the auditability section or comments indicating a requirement for additional funding in the future.", "q2r": 2, "assessor": "z_assessor_2517", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4638, "q0": "Good idea, but need to consider the impact on the development of the Cardano ecosystem and community in Africa. Because this is a proposal about applying blockchain technology to store stories handed down from time immemorial, and transfer ownership and donations through NFT. The idea is novel, but does hosting these stories really contribute to user acquisition for the Cardano ecosystem? And how to educate the African community, and the elderly to use blockchain technology when the technology is not widespread in Africa? It seems difficult for Cardano to penetrate the community through this proposal. So the impact might not be as high as expected.", "q0r": 3, "q1": "The plan is specific and clear. The project is implemented in 6 months with 2 main parts taking place in parallel: (1) establishing a story bank platform and (2) piloting story collection and transferring data to the blockchain.\nHowever, it has not been shown how to attract African users to use story banks regularly and effectively.\nThe budget includes detailed items, the cost seems reasonable compared to the workload. The budget makes up about 4.6% of the Challenge's total budget.\nThe project is developed by Bradley Heather, an active developer on the Cardano Blockchain. However, there is no information about the members in charge of each part of the work, evidence of experience, or links to check the experience of the main people in charge. The proposer needs to add more detailed development team information so that Catalyst and the community can more easily assess the feasibility of the project.", "q1r": 3, "q2": "The roadmap and the project progress report items are stated in detail. And the community can track and check the progress on GitHub.\nHowever, it is necessary to have a target quantitative index to be able to clearly see the effectiveness of the project. For example, how many community members are expected to participate? How much % increase in awareness about Cardano? such as. If there are quantitative indicators that will clearly see the impact, will the success of the project really have a big impact on Cardano? From there, we can see the power to penetrate the African community through this story bank.", "q2r": 3, "assessor": "z_assessor_2578", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5238, "q0": "This is a pretty human project, your proposal wants to record stories about the indigenous culture of Africa and convert it into NFT to store on Blockchain.\n\nThis is also a pretty good solution to demonstrate to the community that besides the mission of Cardano is bringing technology solutions to improve lives, it also helps promote the cultural and spiritual values ​​of humanity. .\n\nHowever, to make it easier for the community to visualize this proposal, you should describe an example of the story you want to record. After reading the content of this story, we will better understand the true value of these stories and agree that we must find a way to record and turn it into NFT.\n\nAnd these NFTs also need to state whether it is for sale or not and what the proceeds of the money from the sale of the NFT will be used for.", "q0r": 5, "q1": "The implementation plan of this proposal is 06 months and has 02 main work items which are: The Story Bank platform, The Pilot Program. In each category, there are tasks that need to be done each month. In my opinion, this plan is quite clear. However, it is necessary to add a plan related to the management and use of NFT after it has been minted.\n\nThe total budget of this proposal is $11 090, with a fairly detailed breakdown of costs. This budget is reliable, but given the size of this project, this budget is a bit low, so you need to consider asking for more funding sources other than Catalyst to ensure the project is completed according to the planned schedule.\n\nThe project has only one member, Bradley Heather, whose experience is described purely in technical terms, however, the proposal also involved SWC, an NGO in the Local Wild Coast. So I believe that the organization of activities to record the stories for the project can be guaranteed.", "q1r": 5, "q2": "The 02 main phases of this proposal are described with appropriate performance indicators. At The Story Bank Platform stage, it is the number of users visiting the The Story Bank website. At the stage of The Pilot Program, there are Number of community members engaged, Attendance of public gatherings,... However, there is another important indicator that you have not mentioned that is the number of NFTs minted on the platform Cardano.\n\nTo judge the success of this proposal, the indicators need to be accompanied by specific numbers. For example, 1000 users visit the The Story Bank website or 10 NFTs are minted on the Cardano platform,.. These specific numbers make it easy for the community to decide that this proposal really has an impact on the community along with the degree of that influence.", "q2r": 4, "assessor": "z_assessor_2678", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5834, "q0": "Stories hold a significant part of human culture. They are fountains of knowledge and wisdom and must not be allowed to fade away with passing generations. This proposal presents a solution to preserve the rich culture of Africa embedded in our stories. By recording these stories and storing them on the Cardano blockchain, they are preserved for posterity. Through this, the global world can have access to the stories and as they purchase them the communities gain, and the Cardano ecosystem also begins to gain roots among native Africans. It will lead to possible onboarding and adoption of the Cardano blockchain in African communities where this project will be executed. \nIn these two ways, the proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The team for this proposal has been participants in the Cardano ecosystem and have a great experience. For an experienced developer in the Cardano ecosystem, I believe there is competence for the execution of this project. I suggest that the team be expanded because the task is cumbersome for just 2 people. \nThis proposal has details of possible risks which I think were carefully considered and the mitigation plans are practical. \nThe funds requested are reasonable for such a project and the budget is also well elaborated. The team state that a portion of sales of NFTs will be allocated for the future recording of more stories and that is a sustainability plan. Resources needed for the implementation of this project have been provided as well. \nThe plan also includes a roadmap with timelines allocated. I like that an MVP will be run for piloting before the full product is released. \nI'm excited about this proposal and I believe if it is funded it will be successfully implemented. ", "q1r": 5, "q2": "The proposers have indicated that user visits to the story bank will be tracked through a git-hub website as a status report. They will also provide monthly status reports on community engagements, meeting attendants, etc. The milestones with timelines are also stated to help track progress. Success metrics are also given to ease auditability. This project is auditable. ", "q2r": 4, "assessor": "z_assessor_2754", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6811, "q0": "The proposal respectedly fits into these challenge category. Knowing fully well that Africa is a place of culture, tradition and history and undoubtedly these defining attributes are fading out. These proposal seek to build a Story Bank to preserve those cultural traits by leveraging NFTs powered by Cardano to provide immutable storage for verified cultural race for as long as the blockchain lives, however, been an African indigent and knowing the diverse languages and cultural histories contained in Africa, i wonder how language barrier will be tackled because sustainability of such project depends on how language barrier is handled. ", "q0r": 4, "q1": "I was provided with a monthly timeline which clearly describes key milestones and KPIs like website design, NFT marketplaces development and integration, however, looking at the Cardano ecosystem, i don't see the need for another NFT marketplace owing to the fact that we have top class marketplaces already where Story Bank NFTs can be listed and traded, also how will revenues be generated and shared among participants to ensure \"potential income\" as stated in the proposal (I suppose the aim is to preserve history and culture not for resale). The budget is fairly reasonable although items like (The Story Bank Platform: 25$/hr @20hrs a week over 6 months) is vague to me, also budget total of $11090 and requested amount of $23090 does not add up, core team details is not provided which does not align with fund9 goals (Only 1 team member was mentioned and some SWC as partners). Implementation plan is ok but yet there's no information as to who and how it will done. I hope that if eventually these project apply in future funding round, the proposer should make available the information lacking in these proposal.", "q1r": 3, "q2": "The project will open source all it's codes on github biweekly and as such progress can be tracked biweekly, user interaction on website will also be monitored and recorded. Also users will be able to track project's success when there's multiple rural areas in different locations sharing knowledge and histories using the Story Bank NFTs as well as global recognition.", "q2r": 4, "assessor": "z_assessor_2831", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 11392, "q0": "Storytelling takes us on a journey that inspires to learn about ourselves and the world around us. It reflects social values in culture that motivate people in their pursuit of a meaningful life. The Oral tradition of storytelling makes it possible for a culture to pass knowledge, history and experiences from one generation to the next. Many cultures in Africa have rituals of storytelling. As indigenous wisdon is being lost in Africa the local communities lack access to preserve the stories. Story bank can preserve stories of our ancestors into local communities and continues the chain that can last for generations. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The feasibility part has a detailed plan including smart contract development underway for simple NFT marketplace and MVP pilot program stories listed on the story bank and successful user engagement experience. The budget is outlined clearly and broken down into idenfiable items. It is reasonable to achieve set goals. The people working on the project have a good experience who worked as an active developer building on Cardano blockchain and fluent in both plutus and plutarch. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by measuring public GitHub repository with a biweekly status on same repo . The bank website will be monitored and posted in status report and gaining traction to stay on track. The pilot program includes attendance of public gathering, number of community members engaged, people successfully employed part time by project and meetings held. As the local communities of wild coast can gain global footing that tell stories and traditions they re-ignite the traditions of their own culture.  This information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 12574, "q0": "With the problems in the formula to be solved here comes unique wisdom that is being alarmingly lost both in Africa and beyond. Local communities lack access to technology that can help keep their stories alive. Rural and traditional exposure to Cardano's technologies has the benefits of the Cardano ecosystem as well as the potential revenue streams they provide, thus, increasing user adoption and knowledge about Cardano. I believe the project will be able to scale to solve formulas in the future.", "q0r": 5, "q1": "The proponent provides information on the relevant skills and experience required to implement the proposal. the proponent provided a total budget of $11 090. The requested budget amount is reasonable. The budget is clearly outlined by the proponent and broken down into identifiable items. The proponent has provided details of the project's plan. The proponent has outlined 2 processes, 1st is the Story Bank platform, it will take place within 6 months and has the specific details. possible for each timeline in 6 months. The second pilot program, this program proposed by the proponent is that it will be carried out within 5 months. But I still wonder if the two processes are happening at the same time or not? Or will it follow each one? According to the Story Bank platform, is January in it the start of the year or the first month of the project? I hope the proponent can give a specific time to make it easier for people to follow. The proponent considered the risk challenges associated with the project and found a solution to each of the risks. example (Risk: The project is not accepted by the local community and does not meet their specific needs resulting in stories that are not truthfully told Solution: Use local organisations. was established to build strong relationships with the community to ensure their needs and desires are addressed first.). I think this project is quite good, but unfortunately, the time part is not clear, so I rate this project 4*.\n", "q1r": 4, "q2": "Indicators determine the success of the proposal.(Wild Coast's local communities will gain a global foothold to tell their stories and traditions and earn a small passive income from it. the sale of NFTs by their \"lineage holders.\" At the same time rekindling the traditions of their own cultures. The Story Bank will become an integral part of the Cardano community reaching far into the countryside. villages in many locations, bringing knowledge of Cardano and blockchain technologies in general to these areas.) When the project is successful this is a big positive for the project. The solution is clear. easy to understand problem solving. As I said on the feasibility side, the roadmap with milestones and time to achieve is not clear. So I rate clarity 4*.", "q2r": 4, "assessor": "z_assessor_3438", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "The Story Bank provides a way to preserve the stories of our ancestors by going into local communities and bringing those stories on chain and ensuring they last for generations to come.", "experience": "Plutus Pioneer Graduate Cohort 2. Blockchain developer and serial entrepreneur actively developing projects on the Cardano Blockchain for over a year. Partnered with Local NGO with 20+ years experience in sustainable development and community outreach programs"}