{"id": 419493, "author": "cardano4climate", "title": "Cardano4Climate Africa", "url": "https://cardano.ideascale.com/a/dtd/419493-48088", "category": 26600, "amount": 14500, "description": "While climate change is probably the biggest risk for Africa today there is no community platform focused to support Africa related initiatives promoting climate resilience into everyday activities", "f6_no_assessments": 18, "f6_rating": 4.703703703703703, "videos": [], "media": [], "f6_assessments": [{"id": 3208, "q0": "There’s a small impact offered by the proposal when we take into consider the problem: “While climate change is probably the biggest risk for Africa today there is no community platform focused to support Africa related initiatives promoting climate resilience into everyday activities” and the proposal deliverables, which are pretty much concentrated in participate in the African TH and establish some other meetings. It’s also worth saying that the proposers ignored the fact that there are thousands of platforms and community promoting climate resilience in Africa – Cardano is an example, we don’t need to look too far. To improve this aspect in the proposal, it’s advisable that proposers should refine the problem statement and try to make it as related and realistic as possible to the solution that they are presenting. ", "q0r": 3, "q1": "The proposal is feasible because it’s too simple – I’m refraining from applying penalties in the sessions that they shouldn’t be applied. One can find information about detailed budget, a timetable to complete the proposal, and the evidence about expertise of people behind the project. However, it does not present relevant risks that would prevent them from completing the proposal, but rather philosophical questions “where to start” and the fact that Africa is a diverse and multilingual continent. Asking where to start should be a question that has to be clearly answered in the proposal design, not presented as challenge in a proposal where proponents know exactly what they want to do. And they didn’t present any solution to the multilingualism and multiculturalism, apart from saying that they will work with WADA. So the solution is still not a solution to the specific risk. ", "q1r": 4, "q2": "The proposal presented about 10 KPIs and only one of them mentions briefly the main topic of the proposal (climate change). Some of these KPIs are related to onboarding members (developers and Catalyst members) or creating network. However, they are not presented in relation to what the proposal is trying to solve: the lack of communities working in climate action. And some KPIs (for example: Number of proposals offering solutions to infrastructure and education concerns”) are not related to this project. They could check this number of FUTURE proposals submitted that are related to climate action. To improve the chances of this proposal to get funding, it’s recommended they review the KPIs and try to keep they as close as possible to the execution and to the problem that they are trying to solve. ", "q2r": 3, "assessor": "z_assessor_2409", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12060, "q0": "The proposed impact of this proposal addresses the Cardano Community’s guiding principles on Cardan4Climate. That is Engagement, Reliability and Sustainability. The report adequately provides plans on getting everyone a consumer of climate change initiative. That is, the proposal adequately looked at how Blockchain Technology of Cardano can be used to address the challenges of climate degradation and how this will impact on the Cardano Community by positioning the community as a blockchain that bring better world all people, animals and the living planet. The proposal also addresses the socioeconomic benefits of using blockchain technology to address climatic problems. The Catalyst community will have a unique economic opportunity in onboarding global industries in the agricultural value chain, green energy, carbon market and food tech. Developing economies in Africa would benefit enormously from the adoption of blockchain technology in solving global climatic problems as they are largely impacted by global climatic degradation. To make the requisite impact, the proposers should further define the targeted market to limit the scope of the project and focus on a section of the wider community eg. University Students, Market Women within the local community as these markets generate a lot of plastic waste that degrade the environment this will help to mitigate the perceived risk from as outlined by the proposers. Also, partnering with WADA and other Cardano projects will help give much focus to the project. ", "q0r": 5, "q1": "The project provides detailed roadmap on how the promoters hope to achieve the KPIs and the deliverables. The engagement with the Catalyst and the Cardano Community to promote climatic related issues is laudable. Also, coordinating with other C4C hubs and the Wada community in Africa would give Cardano4climate a more broader coverage in Africa. However, the proposers should provide a bit of details on the type of research and information gathering on climatic change they will be focusing as issues of climatic change is broad. Given that the team members include seasoned members of the Cardano communities with vast experience from other projects and a professor who has a specialization in climatic change. He should help bridge this research gap and help the team limit their focus to specific area of climatic change with the adoption to blockchain technology. The roadmap provide a timely arrangement of activities with corresponding deliverables. This can be implemented given the level of experience from the proposers. However, the budget breakdown of the budget gives a total of USD14,900 compared to total budget request of USD14,500. This gives a budget of overstatement of USD400 which has to be addressed. Also, the budgetary allocation for promotional materials and promotional activities doesn’t communicate details of whether is advertising, flyers, market activations etc. Again, the budget fails to provide details on remuneration and allowances project members. This has to be addressed.  ", "q1r": 4, "q2": "The project provide detail KPIs which is aligned with the Challenge setting, the proposers should quantify these KPIs to make it more measurable. That is, each of the KPIs should include a quantifiable number to make measurability of the projects progress more feasible. For example, at the end of the project implementation, 50 proposals would be submitted to address the fundamental issues preventing Cardano adoption in Africa. Twenty (20) of these proposals would address climatic issues and the adopting of blockchain technology to addressing climatic challenge. All the KPIs should have quantifiable numbers for us to be able to determine the project success. Also, the various social media channels outline for providing transparency, networking and information sharing should be monitored and access for usage, comments and views from the Catalyst community and from other non-Cardano members as a means of monitoring the project acceptance and feedback which would help improve Cardan4climite in Africa. ", "q2r": 4, "assessor": "z_assessor_3352", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11906, "q0": "The proposal takes a well thought innovative approach to support Africa with initiatives promoting and increasing climate resilience. As climate change is probably the biggest risk For Africa and if a community platform focuses to support Africa then there will be and immense impact on Africa as well as on cardano and thus this proposal dialogues very well and is aligned to the challenge statement. \n\nAs mentioned there are already very active communities in the catalyst and cardano ecosystem like WADA, Africa Town Hall and now 'cardano4climate hub' and their joint collaboration will definitely create a huge impact on climate change. \n\nThe proposed solution , cadano4climate hub, provides space to everyone to speak out and give a collective Voice with same purpose through their social media channels, meetings and events. \n\nMoreover, they are trying to combine the evolving block chain technology of cardano with solutions and models for climate change action, this will result in making the needed impact now and for decades to come and thus adding value to the cardano ecosystem, as this unique opportunity helps cardano to continue and be positioned as the block chain that brings a better world for everyone around the planet. \n\nAs the cardano for climate is a global community we can think of it having a global impact, but we can clearly see that people's activities are local as local Hubs created here are highly adjusted to the local time zone, language and cultures supporting local community and local solutions . So it is uncertain as to how well it might have a global impact. \n\nIt is interesting that the proposal has outlined very well local hub activities and regarding the need of supporting Dapps in the process of achieving their mission.\nThe proposal has clearly mentioned possible risks within the project but I think there should have been a detailed  explanation or information regarding mitigation. \n\nAll in all, I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer  provides with few details regarding the team . Also the team will be supported and collaborated with other community hubs like WADA and Africa Town hall which are based in this area since a very long time and  developed a long term vision for how they could benefit this challenge. \n\nIt would have been better with the proposal if we could know more about the core team members and their individual activities and experience within the actual proposal. \n\nTaking into account that the team already has a working and well received project, it speaks for commitment, understanding about community and team competency .However, I believe they should have provided at least some useful links like LinkedIn profiles of team members so that would make real the possibility of making direct contact and getting to know them better. There is lack of necessary proof of activities and experience in detail. \n\nThere is a detailed plan with several key activities to be undertaken which look sensible and conductible with relevant details as to what and how things are done .\nA clear road map and all the deliverables are provided which shows how concerned the team is with execution of the project . \n\nThe mentioned  budget is reasonable and divided into identifiable categories of tasks to be undertaken . The proposal will require additional funding in future for supporting, reshaping the ecosystem and their mission. They can come again to catalyst for this additional funding. \n\nRisks and challenges has been considered by the proposal however I believe there should be certain information regarding technical aspects to the execution of the project. \n\nBased on the reasons stated above I agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal includes a list of very clear and measurable KPIs. All the deliverables are declared clearly but the delivery dates are not certain. \n\nI believe it would have been better if the road map would have been a lot more detailed, breaking down the time frame on two weekly basis so that we would be able to follow the intended progress step by step. \n\nThey have initiated public git hub repository where we can track regularly ongoing tasks and actions. For this they provided links to their social networks like Telegram, Twitter, YouTube and Discord . \n\nThe fact that the project is active on their social media channels speaks of a good relationship with the community. Also they rely on the feedback they get from the community and local hubs. \n\nOver all there is clarity in the problem, solution and in their alignment with this challenge and there is a pretty good auditability plan. \n\nHence I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining it's stated goals.", "q2r": 5, "assessor": "z_assessor_3312", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 11647, "q0": "The describe proposal has done a great job by placing it in its right challenge. They  effectively addresses the challenge and it potential of bringing values to the community in African countries and to Cardano ecosystem.\nThe proposal team clearly provide a precise solution to the stated problem by indicating that it will make the world works a better for all people, Animals and planet, making Cardano being a leading force in working on having a centralized Hub to help promote internals and external organization should they be funded to execute their project which I strongly believe they will do a great job if they are funded .\n       The proposal team also capture some important key metrics under the compaign brief indicating the benefits it will bring to African countries communities and to Cardano ecosystem should they be funded to execute their project. The proposal is also able to describe who they are to by indicating that, Cardano4climate, we are a community building of the principles of engagement, reliability and sustainability which I strongly believe they will do a great job should they be funded to execute their project.", "q0r": 5, "q1": "The proposer is able to provide relevant links and details of team members who will help in the execution of their project and I strongly believe per their experience they have the Desired Skills and experience to carry out the project should they be funded to execute their project.\n       In view of these, the proposal team has done well by outlining the budget breakdown funds on how it will be used should they be funded to execute their project which I strongly believe it's COMMENDABLE.\n      Moreover, the proposal team has done well by identified some risk challenge that could prevent them from executing their project and able to put in measure to overcome them should they be funded to execute their project.\n   Furthermore the proposal team is able to provide details plan including timeline and key milestones and roadmap to deliver their should they be funded which I strongly believe will do a great job if they are funded. The proposal also done well by indicating that the will be returns in future funds to support reshaping the ecosystem and the mission of the Cardano making the world works better for all", "q1r": 5, "q2": "The proposal team is able to describe the measure to track their project progress by  using the key kpis suggested in the the challenge setting which are very relevance for the Hub, Number of proposal addressing the fundamentals issue preventing Cardano adoption in Africa, Number of proposal offering solution to the infrastructure and education, number of new based user onboarded into Cardano wallet and platform sign up,etc should they be funded to execute their project which I strongly believe they will do a great job should they be funded.\n      Moreover, the proposal team is also able to indicate how their success for their project look like through measurements of success, key performance such, African telegram and discord membership over 100 members, Database of project over 50 ,local use case 10 , etc which I strongly believe they will do a great job should they be funded", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 11629, "q0": "The proposer and the team have placed the proposal in the right challenge category on the CARDANO blockchain ecosystems to help address the problem that needs to be solved. The proposal has as very well laid a clear values this proposal will add to the Cardano ecosystems in Africa, Africa is one of the continent that is facing the biggest problem on how to tackle climate change now and in the future and if a common platform like Cardano is made available to Africa for Climate change issues it will have a common grounds to share problems and experiences and best practices on how to manage climate change. Once this platform is created many African countries and their citizens will be hooked on it their by increasing in the number, awareness and the opportunities on the CARDANO ecosystems will be utilized by this countries. The proposal key metrics and KPIs are the same as the key metrics of this challenge category where this proposal is placed. The proposal has long term goals of how to start and be able to scale up in future to address future issues and challenges and the proposal also talk about set up hubs in Africa which I think will serve as centers for future sustainability of the project if funding is made available for the proposal.", "q0r": 5, "q1": "The proposer and the team have shared links and references which are useful and relevant to the project implementation in the proposal. The proposal has assembled a team with technical skills and experiences, who have also worked on other funds in the cardano ecosystems and are expected to have collaboration with WADA and the African town hall who will also support the operation and coordination of the proposal. The proposal has a budget, the budget is broken down, the budget is itemized to various activities and the needed resources to implement the proposal are also allocated in the budget. The proposal budget is reasonable with regard to the quantum of work to be done. The proposal has a timetable which contains pre activities to start with and and roadmap to the timetable for the main proposal. The proposal has well coordinate plan for implementation of the proposal which make sense regarding the proposal implementation, it has show how the implementation will be done, what to target and who are to benefit and those who will ensure the work is done. The proposal has indicated the needed resources to help implement the proposal successfully. The technical requirements for the proposal implementation are also well articulated in the proposal, it has also anticipated some challenges and risk regarding the proposal implementation which were challenge 1 talking about where to start and second challenge was about Africa is big and diversified in terms of language and culture and has provided a realistic and timely solutions to help mitigate this risk.", "q1r": 5, "q2": "The proposer and the team have outline roadmaps in the proposal clearly with time zone for which the proposal achievement can be measured. The proposal has a well defined key metrics and KPIs which are that of the GROW AFRICA, GROW CARDANO which will be measure to the success of the proposal. The proposal has clearly explained the targets problem which can be measured against the proposed outcomes of the proposal in the challenge category on the CARDANO ecosystems. The problem the solution in proposal is addressing is very understandable because once this is scale out in the CARDANO ecosystems Africa and for that matter it citizens will benefit and this makes it easy to measure the impact the solutions suggested. The proposal has in it various medium and channels of communication for their updates to the community. The proposal has a positive outlook into the future of CARDANO ecosystems in Africa if funding is made available to help implement the proposal successfully. ", "q2r": 5, "assessor": "z_assessor_3262", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11603, "q0": "The proposer and his team has done a very good job and deserve praise for they have identified a major problem in Africa which need to be dealt with immediately through  cardano ecosystem. It is said that Africa is one of the most populated continent in the world with 60% of it population being people under age 25 and so a continent of this nature whose climate and Environment is fast depleting by the works of the locals  needs urgent measures as enumerated by this proposer and his team. This project is funded will bring the much-needed resource for African climate making Africa a cardano hub which will help in restoring the climate of Africa through the experience of the proposer and his team as they are members of Wada and African Town Hall organisations. The proposer identified some of the challenges that Africa is one of the Continent going to be most impacted by the climate change and the African economy is linked or is directly connected to the climate and so urgent steps are needed to mitigate this canker. The proposer therefore suggested that cardano ecosystem should support the dapps for agriculture, supply chains, green energy and construction, nature conservation efforts and financial inclusion are all needed. The proposeraccording to His projects if funded cardano should be a leading Force in working on centralised hubs which will help promote internal and external organisations. The proposer and his team were also able to give a number of risk one of such is where to start? The problem is so big that we feel powerless by having local hubs we will be able to better identify key areas and prioritise them and support them through the global hub.\nThis project if funded will yield the immediate resource Africa is looking for from cardan ecosystem in Africa. The second challenge is that Africa is big and diversified in terms of culture and languages so the need to start where cardano related work is already in progress to the work of wada and African Town Hall and collaborations with them, this project iffunded will be the game-changer for Africa cadano ecosystem which will be a win-win for both Africa and cardano ecosystem.", "q0r": 5, "q1": "Given the roadmap by the proposer and his team it is obviously no doubt that this project will be implemented successfully. The proposer and his team having been part of previous funds and have gotten the requisite experience in carrying out projects like this, this project will be successful if funded. The proposal has been able to give a detailed account of everybody that will be working with him.The proposer has been able to give a breakdown of his budgetary allocation to various sectors of his project, just that the final summation does not tally with  what he requested for. In a nutshell the program if funded will bring the needed resource for cardano ecosystem.", "q1r": 5, "q2": "The proposer and his team has outlined a very simple way of auditing this project. That is the number of people on boarded, number of people creating new wallets, number of voters, proposers, PAs and so on and so forth the project also seek to post videos on YouTube and other social media handles like Twitter, telegram and all these are viable areas where auditing can be done. Number of participants in a telegram group number of participants who seeded in 2022, number of people opening their wallets. Proposer and his team have also  provided several links which will aid in the auditing of this project if funded", "q2r": 5, "assessor": "z_assessor_3260", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11549, "q0": "The proposal addresses both one of Cardano's major priorities and the current challenge mission by facilitating collaboration between relevant actors in Africa participating on climate-related questions through the development of online meetups and community hubs. As stated in the proposal, the collaboration between WADA, C4C, and ATH would have an impact on both a global issue that the world is facing and local actions that must be taken as soon as possible.As far as I am aware, climate change is a particularly significant problem for  equatorial countries, further motivating the need to establish a platform for debate and solutions to the climate crisis. Furthermore, blochain serves as a link between agricultural supply chains, financial systems, and individuals who can directly influence their impact on the climate. The project intends to establish and join the already existing efforts of WADA and ATH in making the work more complementary and to maximize the effectiveness of the institutions.", "q0r": 5, "q1": "Given the previous activities of the project's interested parties, success is likely, and it is a beautiful and important project to carry out in my opinion. WADA, C4C, and ATH members have already proven their ability to deliver a number of significant outcomes, some of which were related to climate change. Academics with expertise in environmentalism and sustainability, as well as engineers with blockchain knowledge, make up the team, indicating that it is capable of delivering on its promises. What I'm missing is the description of exact roles of the mentioned team members at the proposed project. In the proposal the linkedIn profiles are not listed directly that would help to navigate through the expertise of the team members however those are easily searcheble through the linked websites of WADA ect. The timeline with the planned activities is mentioned with sufficient details. the budget breadown contains all the necacery details for the product delivery with information how was caltulated.", "q1r": 4, "q2": "The activities associated with the project's execution will be monitored on several levels: 1)recorded meetups/TH presence, 2)telegram and community forms, 3) public record of tasks, actions on github, and so on. The milestones/deliverables are defined and include sufficient details about how the meetup will look, what topics will be discussed, and what other activities will be present - for example, information gathering regarding climate change/cardano/blockchain (I assume they mean surveys). The delivery dates are, in my opinion, only estimates and not specific enough (\"ongoing operation sep-dec 2022\"). The risks, in my opinion, are defined vaguely - i.e. they relate risks to climate change and Africa alltogether in the really abstract sense - but what I'm missing are the risks related to plan execution - what risks will arise during the lunch of the local hub/when facilitating collaboration between the three involved parties- WADA, C4C, and ATH? ", "q2r": 4, "assessor": "z_assessor_3256", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11488, "q0": "This proposal thoroughly indicates how it will increase the drive for sustainable future innovations in the climate sector within Africa. All while in collaboration with the cardano blockchain ecosystem, local community experts and ideas within project catalyst. By creating a centralized idea-action hub, the community is provided with a platform for meetups and deliberations on solutions that can mitigate climate problems using cardano influenced technologies. The proposal includes a clear problem statement and an excellent solution, which not only places cardano at the front as a leading sustainability platform but additionally works on successfully onboarding varied global industries that uphold the same vision. Having several experts and like-minded individuals working on models for climate actions, will steadily create a continent ready for economic progressions. I agree strongly that the proposal effectively addresses the challenge stated. \n", "q0r": 5, "q1": "The proposal team has mentioned its affiliation to the global Cardano4Climate hub; an existing ecosystem implementing the cardano technology and models against climate change. This strengthens the likelihood for a successful project implementation. Team leads for the local African hub also happen to be active catalyst members supported by credible communities like WADA and African town hall. It is also very commendable that the team has a key experienced professor with 27years expertise in climate change, sustainability studies and biodiversity/ecosystem services, as his extensive experiences will improve how efficient the project implementation can be in real time. The proposal includes a very detailed roadmap of the activities post-funding (a year plan, data gathering stage, meeting schedules etc.) and the expected deliverables after a successful campaign. As it stands, the project has begun implementation, July, 2022, I believe that the required funding will be useful to the overall project implementation and success. The time provided, specifies each activity, an assigned budget and for how long that applies. The budget provided looks very reasonable and I strongly agree that the project will be implemented successfully. ", "q1r": 5, "q2": "The proposal mentions various KPI markers suggested by the challenge it plans to follow, like the number of new African projects seeded in 2022, number of African based users onboarded onto cardano etc. The team's reasoning to stay on track with the challenge guidelines is a good motive to check growth that conforms to the Grow Africa, Grow Cardano initiative. If the team measures its growth indicators based on the challenge, it will surely be successful in measuring its reach and likely local partnerships with new African users. For project transparency, the team has provided multiple active platforms that the community can use to track the reported progressions. Also, the stated biweekly African town hall presence and successive meetups provides a strong basis for project auditability. In all, it's a 5 out of 5 on auditability. I believe strongly that the has clear roadmaps to achieve success. ", "q2r": 5, "assessor": "z_assessor_3252", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 11128, "q0": "There no doubt that Africa is not on top of global climate change and its related matters. The discussion around this topic has been kept on the low throughout the continent and thus the continent has not been able to handle the effects of climate changes. The proposal in my view addresses the challenge of growing the Cardano ecosystem using climate change and related matters. The more the discussion on this topic is giving importance within the ecosystem and a lot more people come onboard, the higher the growth of Cardano in Africa. ", "q0r": 5, "q1": "The proposal presents a solid team with enough experiences to ensure the execution of the proposal. The proposers also present a well laid down plan of implementation and usage of funds that are measurable enough. Also with support from various Catalyst Communities that are already roped into the  project, I strongly agree that the proposal will be successfully implemented.", "q1r": 5, "q2": "The proposal presents a well laid down plan of activities and funds usage along with the expected results. It also ropes in various reporting channels and also provides enough information on the report formats that will be deployed in the various channels and this is a great way to ensure that the project progress is tracked by the wider Catalyst community. The roadmap also takes care of how the Cardano Ecosystem growth in Africa will be improved if funded. I strongly agree that the proposal provides enough information for auditing.", "q2r": 5, "assessor": "z_assessor_3224", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10789, "q0": "In recent years, as society has progressed, it has resulted in environmental deterioration, making climate and global challenges continuous conflicts among countries. As an ecological lover, I always pay attention to projects that protect the environment and the earth. Cardano4Climate is the organization I highly appreciate, not only because of their contributions to the world environment and the Cardano community but also because they have proven to everyone that “ The world can absolutely develop sustainably with the environment.” The proposal expresses what Cardano4Climate offers, what they hope to achieve, and why they care about Africa. With the difficulties in this vast region, Cardano4Climate decided to launch a project to develop a local hub to organize and assist activities in resolving the issues that hamper Africa from accessing Cardano and other environmental problems. Furthermore, working with WADA and the African town hall is an excellent way for C4C to ensure the smooth and efficient operation of the local hub.\n", "q0r": 5, "q1": "The plan details the activities required for C4C to reach Africa, conduct research, and disseminate environmentalism through blockchain. Parallel to this, there is a precise work schedule for the last four months of 2022, as well as the necessary budget to support the increase in research, coordination, and promotion activities. With an organization like Cardano4Climate having 7 repositories available, I have no reservations about the feasibility of this project since you have the necessary expertise, preparation, and talent to make it the best it can be. However, I have one piece of advice for you to help make this proposal more thorough following the new fund 9 layouts. Remember to include a management workload after answering yes to the question about group member participation in various proposals of this fund 9. Because this is the part where many proposals in this fund are lacking, it will not affect the score I give you, but if possible, please add it so that everyone can see your seriousness and effective organization.", "q1r": 5, "q2": "Cardano4Climate, WADA, and Africa Townhall worked together to create a viable idea and a flawless plan. Many KPIs are provided to enable the community track the project's progress, as well as particular quantitative values that help define the success your team is aiming for. As an organization with extensive expertise in the Cardano blockchain, C4C understands how to demonstrate transparency by releasing project information and interacting in other practical actions (weekly meeting, form contributions and feedback, youtube videos,...). Thank you for your ongoing dedication.\n", "q2r": 5, "assessor": "z_assessor_3193", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9346, "q0": "PoS blockchains like NEAR Protocol have demonstrated energy efficiency and the ability to unlock sustainable decentralized finance (DeFi) for climate change initiatives. With the ease of participation, anyone with a crypto wallet can invest in projects that fight climate change, through a blockchain smart contract that allows investors to track and verify their investments. projects they invest in easily, without being faked. Therefore, it can learn to grow on the above successful projects and Cardano4Climate also needs to create supply chains of Dapps for Agriculture, green energy and construction, nature conservation efforts and resource inclusion. main. Ensure that resources are going into the platform and have a truly measurable impact.", "q0r": 5, "q1": "It is proposed to list the main activities and have a monthly development roadmap. You have come up with a reasonable budget, enough team member information Professor Erasmus Henaku Owusu has more than 27 years of experience in the field of Biodiversity Management/Conservation and is an advocate strong services on Climate Change and Biodiversity / Ecosystem. With experienced members, hopefully the project will develop well to help Cardano carry out its mission of bringing goodness to life.", "q1r": 4, "q2": "\"I see the proposal mentioned that progress will be measured by KPIs, you list them out in great detail. Besides the progress reporting is also indicated there are Weekly Meetings , presence at Catalyst Townhalls , Video uploading to YouTube\nOrganize information in Telegram & Discord channels available to everyone, create forms for the community to contribute and respond to. Overall, I think the audit is okay, 5 stars.\"", "q2r": 5, "assessor": "z_assessor_3046", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7890, "q0": "The proposal identifies a problem within the Grow Africa challenge that needs to be solved. There are few resources for people within Africa to learn about, develop or support climate change initiatives within the African Continent.  It is clearly articulated how the proposal will add value to the Cardano Ecosystem, as there are multiple projects already building and innovating in Africa, it is also important to focus on climate change support, education, and awareness; this proposal does that. I strongly believe the proposal will work towards growing Africa, as more people, as well as businesses, will get involved in the programs set up by this challenge for climate change over time. This leads to those involved in these climate change initiatives not only becoming aware of Cardano but also actively being involved through the proposer's programs. The program scaling will be Cardano’s presence on the continent scaling and directly addresses the challenge of Growing Africa and Cardano. ", "q0r": 5, "q1": "\nThe team does have broad experience within Africa and understands what Africa's situation is when it comes to Climate Change as a whole. While the team does appear to have the appropriate size of the team as well as the type of team members for this challenge. The project budget is clearly outlined, and detailed, and does seem appropriate for what the team is trying to achieve in this challenge. Some constructive feedback I have is that the project needs more clear goals and metrics that will make it easier to understand how it will align with the outlined challenge settings.  One concern I do have is that the proposal states\" Where to start? The problem is so big and we feel so powerless.\" The team has various members that are from Africa or have worked in Africa for quite a while yet no clear risks were stated that would prevent the project from having an impact on this challenge. While it is great to want to dive in and get further information to identify key areas, the team should have a general sense of the risks this proposal would have before submitting the proposal. My suggestion here would be to think about the risk that could derail the overall impact of Cardano4Climate Africa. \n", "q1r": 4, "q2": "With the information presented in the proposal, I find that this proposal does not provide much information that would lead to the ability to accurately audit the progress and impact of the project. The suitability portion of the proposal is very vague, and there are no clear milestones as the proposal states they will first need to research more to develop goals. This portion of the proposal does list out what success would look like for the project but beyond that, the details are a bit vague. I would recommend for the team expand a bit in the Auditability portion of the proposal. ", "q2r": 3, "assessor": "z_assessor_2933", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7557, "q0": "Climate change affects Africa but there is no community base to support Africa related initiatives none of their day-to-day climate resilient actors. This is a serious issue that needs to be addressed in this challenge. This proposal could scale up the challenge in the future. The author's way of solving this problem is to work with WADA, African Townhall and Cardano4Climate to support climate initiatives that help address the challenge. It would be great if this solution could make it clear and easy to understand for the participants to have a better overview. With insight the proposed risk strategies also raised a lot of solutions and navigated towards solving and providing a lasting solution to the relevant problems. Those issues are directly related to the world and the ecosystem.", "q0r": 5, "q1": "I appreciate this recommendation for auditability given that it provides a roadmap or milestones, timelines for development, or KPIs. It will be easy to determine if the proposal delivers on its promises based on the timelines outlined as the project has outlined. The timeline is perfectly reasonable the quality and quantity of the content would be easily identifiable as the product produced by this proposal would be public content. The progress of this project is easy to test this proposal looks workable and I believe the given team can come up with this proposal. If successful, the project will become a reference center for the Cardano community in Africa to help better climate change in this place. The project's success has the potential, in the long run, to bring greater visibility to the Cardano ecosystem. It is well defined and the team appears to be highly competent and well-connected in the community it is trying to serve. The proponent certainly identified the problem to be raised and provided an easy-to-understand solution to give the visitor a better overview. The solution reaches the highest level in human-to-human cooperation to address humanity's greatest challenge, climate change. Proposing to combine Cardano's growing blockchain technology with climate change solutions and action models, we will make the impact it needs, now and for decades to come. clarity in the alignment of problem and solution with challenge.", "q1r": 5, "q2": "The project provides specific indicators to measure the proposed future implementation plan which is very detailed and complete. The performance metrics are pretty clear. This recommendation is provided by the author with a clear roadmap of the proposed key KPIs in a very relevant challenge setting. The work assignment is very detailed so that the community can easily check the project in a certain task. The proposal is comprised of people with experience related to the proposal, the team will be supported by the Cardano4Climate global hub along with a dedicated WADA team and the African town hall will provide operational and coordination support for the issue. this. Initial team leaders include: Afia Owusu : currently leading CATH for the past 3 months, Elias' Arabic community leader, Professor Erasmus Henaku Owusu with 27 years of experience in management and Conservation Biology. Their profile shows the right skills and experience to undertake this project. The author provides full information about the team members skills necessary for the development of the project. The project's funding request is now $14,500. The funding request is less than 20% of the challenge. The author's budget is broken down into reasonable expenses. With the amounts listed for each item the roadmap and budget are sufficient to audit the progress of the proposal. I think if the project is funded, the project will be successful.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7067, "q0": "The problem as it is stated in this proposal aligns with the challenge objectives. This proposal details how working with the Cardano ecosystem, local community expertise, and concepts within Project Catalyst would strengthen the drive for long term sustainable breakthroughs in the climate sector across Africa. The community is granted a forum for meetings and discussions on solutions that help reduce climate challenges using technologies influenced by cardano to develope a centralized idea-action hub.\nThe proposal comprises a crystal-clear definition of the issue and a great solution, which not only establishes Cardano community and entire Catalyst ecosystem as a leading sustainability platform but also successfully integrates a number of different international companies that share the same values. A continent that is prepared for economic advancements will gradually emerge as a result of many professionals and like-minded people working on climate action models. I firmly concur that the proposal successfully meets the outlined challenge.", "q0r": 5, "q1": "There is no doubt that the project can be managed successfully by the people engaged. They appear to have many ties to the global Cardano4Climate hub, an ecosystem that already uses Cardano technology and models to combat climate change. This increases the possibility of a project's execution being fruitful. Team leaders for the local African hub are also engaged members of the catalyst, who receive support from reputable organizations like WADA and the African Town Hall.\nA very thorough roadmap of the post-funding activities and anticipated deliverables has been provided. The project has already started implementation, thus I think the necessary funds will be helpful for the overall success of the project. With the amount of time allocated specifically for each activity budgeted and the duration of that budget, I concur that the project will be successfully carried out because the budget seems very reasonable.", "q1r": 5, "q2": "In order to adequately audit the project, the plan includes different KPIs, such as the number of new African projects established in 2022 and the number of African users onboarded on Cardano. The team's rationale for adhering to the challenge's requirements is a good idea to keep economic growth that follows the Grow Africa, Grow Cardano effort in line. The team will undoubtedly be effective in gauging its exposure and likely local collaborations with new African users if it bases its growth indicators on the challenge.\nThe team has supplied the community with a number of active platforms that can be use to track the progress of the project in the interest of transparency. Project auditability is strongly supported by the biweekly African town hall presence and subsequent meetings. I am confident that the project has a clear success path laid out for it.", "q2r": 5, "assessor": "z_assessor_2869", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6127, "q0": "Africa is the third largest continent in the world, with an area of ​​more than 30 million square kilometers, has the harshest, driest and hottest climate in the world. However, there is no community platform to support Africa-focused initiatives promoting climate resilience. The proposal is a partnership between WADA, Africa town hall, and Cardano4Climate to support climate initiatives related to the Cardano blockchain. Recommended detailed description. A community hub that supports the collaborative development of recommendations, moderated discussions, and connects experts and teams in the Cardano and Catalyst communities. A global online meeting venue to connect, educate, provide support, and collaborate with other community centers throughout Project Catalyst... Propose specific solutions to prevent degradation and harm to the planet, providing regeneration as the socioeconomic underpinning for present and future generations. This is an opportunity for Cardano to move on and be positioned as an eco-friendly Blockchain that brings a better world. This is a rather large and risky problem. It is very positive that the proposed research team poses challenges that need to be met here. Show that they have enough experience to recognize the downsides of the field they decide to work in, eg where should they start, Africa is so vast and linguistically diverse... Same With those challenges in mind, the team outlined a number of disarmament ways to reduce risks while the project is underway. They will work together so that their efforts will be more complementary and effective. Shows a lot of preparation and planning, which will increase the chances of a proposal.", "q0r": 5, "q1": "In my opinion, the feasibility of the proposal is fine. Competency Strengths: The proposal is a partnership between WADA, Africa Town Hall and Cardano4Climate. In theory, the idea is to support climate initiatives related to the Cardano blockchain. The plan is outlined in 3 specific parts: Key activities, roadmap and deliverables. In the main activity section, the group clearly presented what activities will be carried out. The roadmap is presented with tasks over time (months). And the products will be delivered. However, could the team be more specific, where will the meetings be, who will attend and how many days, hours/weeks? Overall, from the plan we have laid out, we have a clear understanding of what will have to be done to get to the desired end result. Next is the budget. The team suggested $14,500. That's a pretty low percentage of the total budget challenge, and it's well explained. Funds are allocated to each job hourly (monthly). The team also provided further details that they will start operating in July supported by the C4C global hub. Finally, about the team of core team members who will take care of the work that needs to be done in the project. We know who they are, their identity, their role in the project and a small text about them, and some attached links to reveal their history. The team is technically very good, having all the skills and experience needed to perform the assigned tasks. It is very positive that there are some team members who have a lot of experience from fund 6 and are active members in the Cardano community, with close links to Blockchain, which in my opinion is very necessary. . About the team is almost perfect. All create sustainability for the success of the proposal.", "q1r": 5, "q2": "The proposal involves Cardano4Climate, however this is a new proposal from the team. Besides, the auditability of the project is very good. One of the most detailed parts of the project. The team provides us with a wealth of KPIs that can measure project progress and are presented in depth. complete and satisfactory information has been established. I believe it's completely safe to audit the project. We know what to expect and the proposed final product. The team has initialized a public Github repository where all the tasks and activities that take place will be tracked on a regular basis. We have all the links about the participants: Cardano4Climate, Telegram, Discord... everything fits here, what we need to monitor and specific goals to achieve: support the initiatives on climate change, renewable as socio-economic foundation, and widespread adoption of Cardano, popularize Blockchain, meet the requirements of the challenge.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 3, "ng": 1, "nfo": 2, "vca_o": 1}, {"id": 5092, "q0": "First an assessor disclosure. I have attended C4Cs online meetings, I am not on the board. I am an Environmentalist with a couple of degrees. I have no Environmental proposals in F9 but did F8 - it was voted in but there were insufficient funds. nuff said!\n--------------------------------------------------\nThe broad Challenge statement is how to prepare Africa for a future wide-scale Cardano adoption and how to continue to seed and grow adoption beyond 2022.  The success statement is pretty simple in \"looking for practical innovations .. on tackling the unique challenges faced... [with] a clear roadmap that points to increased adoption.\n--------------------------------------------------\nAccording to World Vision International - WVI.org and echoed by other reputable NGOs the top crises in the world in 2022 are 1. Hunger, 2. Conflict, 3. Climate Change, 4. Child Abuse ,5. Covid. Many have put the argument forth that Hunger and Conflict are in large part due to climate change. As quoted from the WVI report \" At the center of this are children who are forced to abandon school to find work, who go hungry or who become climate refugees\".\n----------------------------------------------------This proposal is a collaboration $14,500 ask by three well known Catalyst/Cardano Community Organizations(CCCO): Wada, African Town Hall and Cardano4 Climate (C4C). The project is to continue in part the mission that C4C has been dedicated to for about 1 year within the Cardano ecos - putting Cardano foremost in blockchains effort to fight climate change. This proposal is extending the effort by initiating an African continent CCCO that will focus on the climate issues in Africa.\n_________________________________________________With the many initiaitives Cardano has started and assisted in Africa it is clear there is an underlying strategy to be a leader. SSI, WMT, and so many other social strategies. This proposal is on par, to place Cardano as a climate leader in Africa and to help effect social change. It addresses the major Challenge statement and mirrors the Success statement.\n---------------------------------------------------\nMy Assessment is this Proposal is a 5 (I strongly agree this effectively addresses the challenge ) star.", "q0r": 5, "q1": "In assessing the feasibility of a Collaboration project like this, though a small proposal dollar amount with its great potential to grow, first look at the teams and the people behind the teams. What has their track been? How is their commitment? Are they Principled? Will they see the project through?\n____________________________________________________ \nCardan4Climate has grown to be a stellar CCCO over the last year. With a depth of talented and dedicated environmentalist, business persons, techies and smart leaders. They will be one leg of the three legged stool stabilizing this project and they state there will be a dedicated team.\n\nWada will be the second leg of the stool with several of their leaders involved, along with the African Town Hall as the third leg. While some of the team leader may revolve the initial leaders will be Afia Owusu, Elias Arabic community lead; and Prof. Erasmus Henaku Owusu is an Associate Professor in Conservation Science. Prof Owusu is the current Director for the Center for Climate Change and Sustainability Studies in Ghana and a former Executive Director of the Ghana Wildlife Society. The team is solid and they appear to have the needed skills, dedication and Principles to see this project through for the long term.\n---------------------------------------------------\nThe project has a very well laid out timeline with a Roadmap and Deliverables that are very straight forward and not complex. Their budget ask is detailed with solid explanations and as an added benefit they will utilize the Treasury Guild for Administrative and Accounting services. This increases transparency.\n\nThe project states it will return to Catalyst to ask for more money as it is growing and looking to continue to make the world a better place. The implementation plan looks solid.\n---------------------------------------------------\nMy Assessment of the feasibility of this proposal is a 5 ( strongly agree it will be successfully implemented) star.", "q1r": 5, "q2": "Being familiar with C4C I know how transparent they are and how hard they work as an organization to maintain that. They record their weekly meetings, they publish all the activities and planning on a myriad of social media including Discord, Telegram(s), Twitter and they have several Github repositories. They are using the Treasury Guild as stated early for Admin and Accounting on this project.\n----------------------------------------------------\nThe milestones are clearly stated and align strongly with the Challenge brief. In fact the proposal get deeper into deliverable and KPIs with this: \"Measurement of Success, Key Performance Indicators\n\nAfrica Telegram & Discord membership over 100 members \nDatabase of projects - over 50 \nLocal use case - 10 \nSupporting over 20 proposals and 10 new proposing entities \n20 new CAs\".\n-------------------------------------------------------\nThe Assessment score for the Auditability of this proposal is a 5(strongly agree this has identifiable measurements of success with related KPIs) star.", "q2r": 5, "assessor": "z_assessor_2671", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 12960, "q0": "The proposal Cardano4Climate is the initiative\nto support climate- initiatives related to the Cardano Blockchain,Making the World Work Better for All People, Animals, & the Planet .\nThe proposed solution will address the Challenge with the help of  Dapps for Agriculture supply chains, green energy, and construction, nature conservation efforts, and financial inclusions are all needed. Make sure resources are getting to the ground and having a real measurable impact on agriculture by maximizing the good outcomes .\nThe main issue is the problem is so big that is when small local hubs come into the part in which the better identify key areas and \nprioritize them and support them through the global hub by this the proposed solution to the challenge is more effective . The key matrices and the goal of the proposal align with outlined challenges , The proposed proposal is able to scale to address future challenges.", "q0r": 5, "q1": "The budget is outlined clearly and broken down in identifiable terms . The proposal has mentioned clearly how every fund is used and it is very much reasonable ,The budget is reasonable to achieve the set of goals and Timeline for the proposal is mentioned clearly , The proposal offers the realistic timetable to complete the work .\nThe timeline consists of weekly meet ups ,\nMaking guidline , Research etc which is broke down very nicely . The team looks very experienced and they have even participated in the previous funding looks like they have made some progress . The proper links to team members have been given .", "q1r": 5, "q2": "The roadmap to the challenge is very clearly mentioned and the metrics and the KPIs mentioned in the proposal define the success of the proposal . The proposal has clearly mentioned the detailed explanation how the roadmap or the proposed solution will help to achieve the targeted problem . This proposal provides me the sufficient information to access the progress in attaining it's stated goals .", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13830, "q0": "Having a local hub that focuses on climate solutions seems to be the next natural step in boosting the African Developer Ecosystem within Cardano Catalyst solutions and technology. A centralized hub will help to enhance projects and entrepreneurs that are willing to address African climate solutions. This proposal effectively addresses the challenge of boosting the African Developer Ecosystem. Climate resilience for African communities will be central in a few decades, as this might be the most damaged continent due the climate crisis. Effective communication and productive dynamics between different initiatives that address this issue is the fundamental to develop a good strategy of resilience and urgent response. Cardano 4 Climate in Africa can really transform and help already working in field initiatives and entrepreneurs with their blockchain technology application. ", "q0r": 5, "q1": "Having big and experienced friends as Wada and experts of The African Townhall is a guarantee this proposal is highly likely to be implemented successfully. Funding and boosting this hub of African initiative with wide experience and trajectory is a safe way of taking care of Cardano’s treasury funds. Roadmap, deliverables and budget breakdown are consistent and clear. Cardano 4 Climate is an already active member of Cardano Community and are sharing their work and progress constantly. Considering they are a growing community within Cardano Catalyst Community it is to highlight their engagement with the real human purpose of social transformation. ", "q1r": 4, "q2": "Their constant presence in weekly meetups and Catalyst Town Halls will help a great deal the auditability process. Even Though, numbers are also important. Receiving numbers and data from monthly surveys can help Cardano Community develop a database of African entrepreneur and Developer Ecosystem. Developing quality and successful implemented projects, under Catalyst mentoring and by Cardano developers might be the most important figure if we dare thinking in the long term as Cardano 4 Climate certainly aims. The information provided is certain sufficient to audit the progress and the success of the proposal. \n", "q2r": 4, "assessor": "z_assessor_3833", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "We appreciate the PA time and review. However, there is no supporting data and reasoning why Feasibility and Audibility has 4 stars. "}], "solution": "A joint collaboration between WADA, African Townhall, and Cardano4Climate to support climate- initiatives related to the Cardano Blockchain, thus piloting of nature-based solutions as adaptation", "experience": "Cardano4Climate, WADA, and Africa Townhall are very active communities in the Catalyst and Cardano ecosystem, with shared values. "}