{"id": 419449, "author": "faakor", "title": "Seniors Ideate", "url": "https://cardano.ideascale.com/a/dtd/419449-48088", "category": 26600, "amount": 22212, "description": "New technology is usually targeted at the youth. Seniors are left out although they have the brainpower and free time to ideate and develop projects to improve the communities they live in", "f6_no_assessments": 20, "f6_rating": 4.65, "videos": [], "media": [], "f6_assessments": [{"id": 11602, "q0": "The proposer and his team has done a very wonderful job by placing this very proposal in this right challenge, I therefore say that this proposal would effectively address the challenge and have the potential of bridging the gap between all classes of people and ages of people.  I think this has the potential of bringing value to the cardano ecosystem and the project catalyst itself. If we say that we want to make Africa the hub of cardano ecosystem then I think this is one of the right proposal for us to pay our attention and commit our resources into making it a success. The senior professionals are also Africans who are retired of their jobs and a lot of them are wallowing in poverty just as the youths are also struggling for employment. This project brings to bear the need to look at the fundamentals that would promote Africa from being a cardano adoption leader rather than the perpetual follower we have seen in the past. The proposer and his team deserve  a sound applause because this project has got what it takes to include the long-forgotten people with experience.\n\nIt is always said that they are retired but not tired they are left alone to while away time with their experience and so this project having identified this quality materials and source of experience which I think if sorted would add value two cardano ecosystem and project catalyst is the swift steps to assist these people. Though a lot of them are not ICT inclined and may not want to get themselves involved in this modern-day specially the threat of cyber crime and blackmailing of people, but it's not too late with the experience of the proposer and his team in person meetings meetups and explanations of the work of project catalyst, cardano,ecosystem and wada will be good tools to use to convince them.\nTo add to these, with the untapped but experience knowledge available for Africa I think if a good look is taking at this proposal it will bring the needed results to the African Community and from the Communities where these senior professionals are going to be picked and taking through lessons to become conversant with the cardano ecosystem and project catalyst. I am optimistic that this project if funded will see the light of the day and which is going to bring out one of the best results expecting and yet may not be found yet. Experience they always say is the best teacher and I want to believe that the vast experience of these senior professionals would add flesh and wisdom to project catalyst and cardano ecosystem if these projects is funded.\n\nPerusing through this proposal Project I have realised that a good number of fine brains are being left at the mercy of retirement in the name of attaining a certain number of age, over here in Ghana that is 60 years, which is the right time and without considering the kind of service you can render to your institution or whatever organisation you belongs to the deal is you have to go home and rest. But in some instances most of these senior professionals are engaged and they provide due diligence services to the institutions and organisations where they are engaged and so the coming of this proposal is like a novel and an eye-opener to every African country and to the world at large. These  Amalgamation of senior professionals is going to bring on board diversity of knowledge and experience which would help build a standard Society and community as that which cardano ecosystem and project catalyst is looking for. Teachers, Bankers, Civil servants, Police, Soldiers and other organisations forces of professionals always retire but not tired and I think agreeing with this idea is one of the good and wise choice one may have ever made in the course of the program if funded.\nAccording to this proposal research Ghana's statistical service said the population of people age 60 years and older in Ghana is projected to reach a 2.5 million by 2025 and a whooping 6.3 Million by 2050 this is only in Ghana, imagine combining other African countries what the numbers would look like and so if this used in Ghana as a pilot Project in order to replicate same across the African continent is commendable and I think this project should be funded with immediate effect.\n\nThe proposer and his team with their expertise, expect to implement this project in in a pragmatic way, so they said that they intend to grow a core group of professionals and gradually onboard them into the cardano ecosystem using a series of deliberate interventions is designed purely and purposely for the older generations In order to assist them realise their potentials  and their place in project catalyst and cardano ecosystem.\nThe proposer and his team has ropped in some key metrics by way of monitoring the progress of the work and a number of them include the number of proposals offering solution to infrastructure and education concerns, number of new African Based useer  onbordered onto cardano ecosystem, number of new African-based catalysts members,number of new African projects seeded in 2022, local imparts through user activity reached and partnership formed.\nWith the in-depth knowledge of this proposer and his team concerning the senior professionals I agree with them and I pray they get the needed funding to carry out this project successfully.", "q0r": 5, "q1": "Given the research and the experience of the proposer and the passion and plans put in place to carry this project, there's no doubt that this proposal will be implemented successfully. The proposer and his team intend to carry this program in phases.\nThis project according to the proposal is expected to last for six months and within the six months a number of activities will be executed. One of such includes a number of preparatory activities need to be undertaken prior to the actual onboarding program and this is estimated that a timeframe of 5 weeks will be required to complete them. The proposer and his team I have brought in a number of ideas as to how they  intend carrying out this program, one of such is the tasks estimated time required. The proposer and his team intend to develop and /or compile a relevant material for the projects, the project is also going to be using a tool for identification and contact with professional bodies to obtain contacts of the retirees, then by contacting retirees via telephone, email, WhatsApp, to provide an initial overview of the project and receipt of feedback. The proposal also intimated the initial project meetings with interested candidates to screen and select core group senior professionals and thereby onboarding them into the cardano ecosystem and project catalyst. According to the proposal there's going to be a bi-week meetings which will be held twice each month except in the month 2 where there will be only one meeting and this is because the preparatory activities will continue into month 2 and only with 3 weeks remaining which may not be prudent overbearing this retired professionals with so many meetings that would bored them.\nOn the area of budget the proposal has presented a detailed budget allocating a sound amount of money to every activity he intend to carry in the cause of the six months and how every bit of the money is going to be spent as spelt out in the budget and at the end of the day it tally with the overall requested budget. The experience of the proposer and his team if funded this proposal  a good work will come out of this project. The details of every individual and organisations, blockchain companies the proposer intend to Work with they have provided their links and details and has made it public in this proposal for easy tracing and reliability purposes.\n\nIn the area of risk it is said that the fear of resistant maybe part of this but none the less the proposal and his team were not going to relent in their effort to mitigating these there by taking serious education campaign to educate this senior retired professionals for a good and successful result to come out of this. Some of the risk alluded to are lack of interest in and/or difficulty in learning to use new technology, the other thing is distrust associated with cryptocurrency and nonetheless technology difficulty and or power outage in the land which are always facing this proposal, But with determination and the passion of the proposer and his team if funded this project will see a brighter light of the day.", "q1r": 5, "q2": "The proposal has a genuine  plan as to how this projects ought to be audited, some of the ways this program is to be audited is, number of professionals organisations, trade unions contacted, number of senior professionals present at initial project meetings and initial meeting with core group include pictures, output from end of workshop questionnaires completed by participants are also ways of providing sufficient information to audit this projects. The other thing is the number of seniors attending the in-person bi-week meetings will also be obtained and compared over the period to ensure that each candidate is present at every session. The proposer and his team also intimated that post of meetings/workshops, feedback from participants will also be obtained and shared to provide the community with information which is necessary.\nProposal has an elaborated way of simply auditing this project of which I do agree, in conclusion the project also has it that, links to proposals  submitted by participants on ideascale will be shared with the cardano ecosystem and the number of new members obtain for the next round of onboarding will also be shared. All senior professionals who participated will understand to a large extent blockchain technology particularly cardano blockchain and how to use it to solve the problems of their continent, lastly all participating senior professionals between 25-30 \nseniors will have yoroi wallets and be able to use them. With the precise lay down procedures given which are tangibles that you can see I agree that enough and sufficient information has been provided concerning the auditing of this program if funded the results will be mind-boggling.", "q2r": 5, "assessor": "z_assessor_3260", "no_vca": 8, "ne": 6, "ng": 1, "nfo": 1, "vca_o": 2}, {"id": 459, "q0": "Though very noble, Cardano at it's current development stage is challenging enough for general public, young developers and minds to understand conceptually let alone seniors.\n\nOnboarding the general public even onto being a PA or vPA is not as straightforward as one would expect. One would expect dangling the possibility of compensation would attract rows of people but the reality is, the general public experience hesitancy due various factors ; from the dominant use of advanced English, the complex processes involved Project Catalyst, the user interface to the topic of blockchain/crypto itself.\n\nThere is indeed potential in tapping into the experienced minds to assess proposals but we are in no shortage of non-technical individuals. As we consistently see this fund round there is a huge disparity of proposals receiving 1 to 5 assessments between non-technical and technical proposals. That itself should be indication we should focus on developing education for developers. And it is only natural that the developers come from a younger demography.\n\nIndeed there are hidden gems, such as Masako Wakamiya, but it is very rare seniors are willing to take time to learn new skills. The time and funds invested would be better of educating the future for as the Challenge Setting mentions, Cardano has stiff competition for adoption in Africa in the form of China the nation.", "q0r": 3, "q1": "Seeing that WADA is partially involved in this proposal, given their wealth of experience and local insights, they would most likely be successful in implementing this proposal. Results though I expect to be not as rosy as this proposal proposes. The mental barrier to entry for the general public is high enough, you can see this from the current growth throughout all Project Catalyst and various Town Halls where it has seemingly decreased or had minimum advances. Seniors or advance mentally individuals takes more time to accept new concepts, very rare are they willing to change or add new perspectives in their lives.\n\nThrough a recent public offline workshop that I have held with the intent to educate on Cardano for the general public, those that came are a healthy mix of young professionals in their late 20s and stable individuals in their 40s. What was interesting is those individuals in their 40s has asked for the young generation to step-up and be more active in the blockchain/crypto industry. Of course this is a small sample, but an interesting one to take note.", "q1r": 5, "q2": "The proposer have indeed provide almost all the information needed that comprise as a complete proposal but what it is missing is the compelling reason why should there be a focus on elders. Yes, numbers wise they are untapped resources but there is no data or survey that shows that these untapped resources are actually needing this solution. There is a quick mentioning of it in a paragraph but other than, this solution is not supported by data.\n\nWithout the initial database of seniors they would like to onboard it becomes challenging to gauge what is success for this proposal. The proposes mention numbers, but what kind of numbers are we seeking here? What pool are you attempting to persuade? Perhaps some initial ground work by approaching Senior Healthcare Facilities and organizing a survey would do these proposers well in the future.", "q2r": 4, "assessor": "z_assessor_2088", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 12256, "q0": "I strongly agree that this proposal concretely addresses the objectives outlined. I am of the believe that, when retirees which include professionals are given the opportunity to bring their vast experience into the cardano ecosystem, the number of proposals that offer solutions to infrastructure and education concerns in Africa will surely increase as well as the number of Africa - based users which aligns perfectly with the key metrics of this challenge.\n\n\n\n\nThis proposal will provide a greater potential to the cardano ecosystem, since i am of the view that, the education of the older generation in the opportunities of the cardano ecosytem will have a ripple effect on the younger generation. Because they willl rely on the experience and expertise of the older generation to take advantage of this opportunity in the long run.\n\n\nI believe this proposal will provide a greater impact to the cardano ecosytem and provided a win - win scenario for both Africa and the Cardano blockchain.", "q0r": 5, "q1": "I strongly agree that this proposal can be successfully implemented without any serious concerns, given the relevant skills and experience of the team members.The combined number of experience(50yrs) in blockchain processes and the fact that some members have been vCAs, the project is in safe hands and can be implemented without any serious concerns.\n\n\nmoreover, given the detailed presentation of the budget for successful implementation of the proposal, provides me with the adequate information to have no doubts about its successful delivery.\n\nTo add to, the timelines provided are surly within realistic and reasonable range ,considering the fact that those involved are the aged or retirees who deserve longer duration in order to grasp the various processes of the education.\n\nThe risk and challenges posed to this project are very relevant , however the strategy proposed by this proposal to use in persons meetings for this category of the population provides a better alternative to mitigate these challenges.", "q1r": 5, "q2": "I agree that, the proposal can be evaluated without any challenge, given the clarity of the roadmaps provided which is in alignment with the milestones and time horizons provided, especially when dealing with the older generation. \n\nThere is no vagueness in what the problem is about and thus, the outcomes of the solution can easily be measured.\n\nThe key metrics provided were carefully selected which gives me direct ways for measuring the success of this project and providing a yardstick to measure the impact to the cardano ecosystem keeping in sight the goal for this specific challenge.", "q2r": 4, "assessor": "z_assessor_3371", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 12040, "q0": "I think this proposal is good. The team reaches out to retiring and educated seniors such as teachers, bankers, etc., and encourages them to become a member of the Cardano ecosystem as CA , vCA, or voter. The compilation of documents in many forms such as videos, and documents to make it easy for the seniors. While the authors did not specifically talk about the language used in the document, I think it's highly likely that the local language is meant to make it easier for seniors to access the Cardano ecosystem. Ghana, is a country in West Africa, a country located in the geographical region of the challenge, the project also aims to increase the number of users participating in the Cardano ecosystem, so, I think this project is suitable for the requirements of the challenge. The team also shows that the project is scalable in the future and can be independently and sustainably viable because of the benefits and ways of building a community of project participants.", "q0r": 5, "q1": "The team gave very detailed explanations on how to access seniors data through reliable data channels. They also suggest how to approach this group of people through two methods that are online and offline. This combination is optimal for increasing focus and understanding in face-to-face sessions and saving time and money in online sessions. The implementation roadmap and budget allocation are very detailed by weeks, days, such breakdown shows that the project implementation can be completed according to each schedule. I am just a little concerned that in the schedule section, contacting the seniors is up to 2 weeks but in the budget estimate is 7 days, I think a more detailed explanation is needed for this difference. The filtering of potential participants by survey questions will be better if the team provides some evaluation criteria such as age, information technology-related qualifications, etc. The team is experienced in Catalyst projects, however, the person connecting to the user data is not very experienced, but I think this is easy to improve.", "q1r": 5, "q2": "Finally, on auditability, the proposal details the number of workshops, documents, and people that will participate in the Cardano ecosystem. They are also ready to provide evidence of what they have done so that the community can check and monitor. This shows that the team cares about providing criteria for the community to monitor the progress of the project. Thus, the community can fully track the results of the learning goals set by the timelines given by the group (for example, papers related to the collection of elderly data, the number of seniors participating at the meetings, the number of seniors registering as members of the Cardano ecosystem. It would be greater if the team could provide an estimate of the number of participants in the offline and online sessions). In short, I think this is a transparently auditable proposal from the community.", "q2r": 5, "assessor": "z_assessor_3329", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11905, "q0": "The proposal is about to encourage and sustain the adoption of cardano in Africa among seniors who mostly are retired and this proposal fits perfectly into this challenge and it provides a great workable plan to do so. \n\nThis is a great proposal because it provides cardano community with people of 60 years of experience and not wasting that experience this proposal is trying to get them on to cardano which will benefit to seniors there by Africa as well as cardano community. \n\nIf the retired seniors are rightly chosen and rightly trained then this will have an immense influence on both cardano ecosystem along with seniors to improve their life and increase their income because seniors are professionals who worked for many years solving complex problems in their work place. \n\nThe idea of on boarding seniors is something new and great because we have encountered many proposals that target youth but this proposal is unique and very promising and definitely will be impactful. \n\nWith this proposal seniors can get involved in a great community doing a variety of things like ideate to develop projects, participating as CAs and thus it is clear that it adds value to the cardano ecosystem as well because with this there will be great number of people from Africa involved in the ecosystem.\n\n\nIn my opinion for a continent like Africa this proposal will leave a great impact on their long term development. \n\nThe proposal has clear Idea regarding implementation. All the essential information regarding on boarding seniors which look realistic  justifiable and surely will have a great impact on seniors within Africa  and cardano ecosystem. \n\nOverall I believe this proposal here fits very well with the challenge statement as this proposal stands to immensely benefit both cardano and Africa. \n\n\nHence I strongly agree that this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The proposer has provided details of the team members. I would have liked to see more in detail regarding the team members because they have not provided LinkedIn profiles of all the team members and how experienced they are is also not specified. I believe it is uncertain as to how well qualified or experienced the team is because there is no such evidence of proof like any useful links. \n\nThere is a very detailed plan provided in the proposal. A clear six months planning has been outlined along with all the key activities that will take place. The proposal has specified all the tasks to be undertaken in the first month on weekly basis and rest of the tasks are on monthly basis for the next 5 months. They are clear and justifiable and looks doable. \n\nIn case of monetary terms there is a clear and detailed budget breakdown. It has been divided into sub categories of tasks to be undertaken which is reasonable and justifiable . I found this budget part of the proposal very detailed and accurate enough and  sustainable. The proposer will require further funding after completion of this proposal subsequently to expand this project within Ghana and Africa and so they will return to catalyst for further funding.\n\n\nThe proposal has also made a note of the possible risks the proposal could face while executing it however, all possible mitigation strategies are also outlined to overcome them which definitely speaks teams credibility. \n\nI believe one aspect of the feasibility which would have been great is to provide a bit more detail of the team with respect to their experience and expertise along with some useful links to verify which would been a form of evidence to be certain about them. \n\nConsidering the above facts I agree that this proposal is highly likely to be implemented successfully.", "q1r": 4, "q2": "The team is very much concerned with the auditability as the auditability here is pretty good. \n\nThey provided all the Crucial information that would help the rest of the community to monitor the progress of the project. \n\nA detailed road map with measurable deliverables on a time frame of 5 months has been provided which helps to follow the progress in a step by step manner. \n\nAll the provided key metrics are solid and achievable. There is clear understanding of the problem, it's solution and their alignment with this challenge. \n\nThis part of the proposal is very complete and clear as we have sufficient information to understand and monitor as to what is promised is being accomplished or not. Moreover as stated they will provide all the information to audit for community on monthly basis . \n\nHence I strongly agree that there is sufficient information provided to audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_3312", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11646, "q0": "The Proposer has done a great job by glancing into the problem and placing it it's right challenge by explaining how it will bring impact to community in African country (Ghana) and Cardano ecosystem through multidisciplinary team of professional including service with combined work experience of over 50 years, active in the Cardano ecosystem as funded Proposer, facilitator of the town hall,PAs , VPAs, challenge team members should they be funded.\n        The Proposer effectively addresses the precise challenge and it's potential of bringing values to communities in Africa countries Ghana and Cardano ecosystem by perfect provide a workable plan to encourage and sustain the adoption of Cardano in Africa among senior starting from Ghana since most senior are not aware of Cardano blockchain technology and it's benefits should they be approved funds in adoption of their project and I strongly believe they will do a marvelous job should they be funded.\n   The Proposer done well by clearly capture some important key metrics measure under the compaign brief such as; Number of proposal offering solution to infrastructure and education concerns, Number of new African based user onboarded onto Cardano ( wallet, platform sign ups), local impact through user activity and reach etc which will bring values and impact to the community in African and Cardano ecosystem should they be funded.", "q0r": 5, "q1": "The Proposer has done well by outlining and identifing some risk challenge which could prevent them from executing the project but are able to mitigate solution to overcome them should they be funded to execute their project. Moreover; the Proposer is able to provide details plan including timeline of 6 months and key milestones such as; preparatory activities, onboarding activities, proposal development and peer screening which is well aligned with the challenge and I think they will do a great job but also think they should have added Roadmap to show how it will work it will have perfect.\n    However, the proposal is able to provide details budget breakdown funds to how it will be used should they be funded and I think it's COMMENDABLE.\nFurthermore, the proposer has done well by providing details of team members and relevant link who will help in the execution of the project and I believe they have the Desired skills and experience to carry out the execution of the project meanwhile I think they should have added links with other two members for referencing. The are also to indicate the returns to catalyst for more funds since the project is the first of number and it targeted at senior in African.", "q1r": 4, "q2": "The Proposer has done a great job by describing measure to track their project progress by ensuring that the Cardano community able to audit the project by collecting and sharing information on a monthly basis which I strongly believe they will do a great work should they be funded.\n    Furthermore, the proposer is able to outline how the success for their project will look like through the key metrics that the Communities will report and monitoring back to Cardano ecosystem by; All senior who participated will understand to a large extent blockchain technology, particularly the Cardano blockchain and how to use it, All senior participating will learnt how to submit well research and developed proposal to catalyst and all participating senior between 25-30 senior will have Yoroi wallet and be able to use them should they be approved funds to execute their project.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11616, "q0": "I must comment the proposer for having the mind to transform our  fathers and mothers who have served the nation with their youthful years and are now sitting with very great ideas but who will listen to them after all the young ones will say what do you know or your time has passed. \nThe key metrics about grow Africa Grow Cardano includes creating awareness, participation and taking control in the blockchain space in Africa and beyond. \nThis is exactly what this proposal seeks to achieve if funded and I believe it be funded because \nThe seniors which have great experience should not be left out of the Cardano ecosystem and the benefits that many are enjoying. \nThe proposal has also identified instructions in Ghana that has a greater number of membership such as   Ghana National Association of Graduate Teachers (NAGRAT), Ghana Registered Nurses Association (GRNA), Ghana Association of Bankers (GAB), Civil and Local Government Staff Association, Ghana, (CLOGSAG) etc. \nthese associations if there members are onboarded to the Cardano ecosystem it will be a massive win for The Cardano ecosystem.The proposal is aligned to the challenge, meaning there is alignment.\n\n", "q0r": 5, "q1": "Reading many proposal I have released that in detail the proposer has done a great job .\nDealing with the elderly most especially those who were once professional in one way or the other might have the motive that the blockchain technology is scam but the proposer has illuminated beyond doubt that they are well prepared to improve in the live of the seniors by providing them with materials though face to face interaction and the use of videos from an acceptable platform which is the WADA team Africa to create their awareness and to give them assurance of the genuineness of the Cardano ecosystem. \nIn addition the timeline provided by the proposer is very reasonable I am so confident in the team that they will be able to successfully birth this idea.", "q1r": 5, "q2": "For the purpose of the proposer stipulating that there will be the need to continue the project and  to establish it for the long term goal in Ghana and replicating it to other parts of Africa and the others the proposer has ensured that the progress of every stage is shared with a link to every part concern.\nThe team has excellent expertise such as Afia Owusu: Currently lead in organising CATH for the past 3 months. Wada West Africa Lead, Environmentalist, CA for funds 6, 7 and 8. vCA for fund 7&8, Idea Fest Host for funds 6, 7, & 8, active in most Catalyst meetings (C4C, Town Halls, Idea Fest programs).\nWith her and others in the team will see to the implications of the proposal if funded.", "q2r": 5, "assessor": "z_assessor_3261", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 11127, "q0": "The growth of the Cardano Blockchain in Africa hinges on the successful onboarding of a wide spectrum of range of people from all backgrounds and training them to understand the blockchain and how to utilize it to solve societal issues and this proposal perfectly fits into this challenge. The focus on senior citizens who are retirees is in the right direction as these group of people have enough time at hand with a lot of experience to learn more and use past experience to ideate and solve social issues.", "q0r": 5, "q1": "I strongly agree that this proposal is likely to be implemented because the plan presented is straightforward and only demands a conceited effort in making it happen. The combined experience also looks fit for the targeted participants and are very likely to create a good linkage between the Cardano ecosystem and roles retirees can play in growing it in Africa. The proposal is also scalable enough as there are a lot retirees in Ghana and the African continent at large. The Cardano ecosystem as well as the Catalyst project stand to benefit immensely from this project too if funded since it has a high probability of success.", "q1r": 5, "q2": "The proposal provides enough information for auditing of progress in both funding and timelines. There is enough breakdown of usage of funds and reporting of same on the Catalyst communities. The proposal also presents a well laid down timeline and expected results at the each of each stage and the likely risks with it mitigating techniques. I strongly agree this proposal is auditable at every stage.", "q2r": 5, "assessor": "z_assessor_3224", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8359, "q0": "Seniors who are retired professionals will have lot more experience than freshers and their knowledge can be put to use to make huge differences and advancement in the present blockchain market but as the proposer as mentioned the challenges stand out to be prominent in this proposal as adaptability of the new technology or trusting the crypto currency chain might be a huge task for them to convince the senior people. As they grow old they tend to believe less in new innovations and technologies and require more time to adapt than others. Though the proposer might have good intentions in bringing the experienced people into this field the challenges stand more prominent than the success of this proposal. This proposal will be successful but not for a major level as many people will not be interested in this after their retirement age and would like to spend more time with their family. Hence the proposed has addressed the challenge but the challenge is not success oriented.", "q0r": 3, "q1": "The given experience might be sufficient to implement the proposal but the success of the proposal depends on a lot of factors. The budget required for this proposal is only attract elder people into this blockchain and cardano whereas that budget is not required for younger people as they are already getting involved or enrolled in this cardano ecosystem without have to make any campaigns or spending money. Hence i feel investing money just to make campaigns and educate the elder people and creating interest in them is a good thing but a waste of time and money which can be utilized elsewhere. Hence I neither agree not disagree with this proposal.", "q1r": 3, "q2": "The information provided is sufficient to audit the progress of this proposal but the proposer does not define the success of the proposal clearly as it involves lot of efforts just to bring in the idea of seniors to the cardano ecosystem wheres the same budget can be used for improving the present ecosystem. The proposer has a clear understanding of the problem statement but has failed to deliver the plan to implement the proposal.", "q2r": 3, "assessor": "z_assessor_2976", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7835, "q0": "The idea is great and correlates well with the challenge. The aim is to grow a core group of senior professionals (retirees) in Ghana through a gradual on boarding process to participate in Cardano Community I various capacities and to replicate the process among their peers. Statistics shows that the ageing rate is increasingly outweighing birth rate and therefore,  the Proposer has noted the drive to expand Cardano  in Africa and the focus on everyone including the elderly population.  The elderly population,  also , present a huge resources that could be placed at the disposal of the Cardano Ecosystem. Their rich experiences, abundant ideal time and readiness for community networking will bring alot of benefits to Cardano Ecosystem in areas like Projects Mgt.  PAs to which will enhance. Proposal refinement and assessment processes. Getting all hands involved will be a win  win for Cardano in Africa and beyond \nRisk factor that may hinder the full impact of the Proposal and mitigation measure to be taken are clearly stated. ", "q0r": 5, "q1": "The plan for the program is well defined and presented.  It's in 4 stages, the first is the Preparatory Activity -5 weeks, the Onboarding Activity -2 -5mths and in mth6, Proposal Development and Peer screening. \nThe budget breakdown describes thoroughly what goes into session of  event to arrive at a total of usd22,212 which I think is justifiable and therefore reasonable.  However, am expecting to see total number of seniors  targeted under this budget for this phase..\nThe Team behind the successful implementation are cleatly mentioned and they are,Wanda Ghana Team, Afia Owusu,  Fasko Fiadzigbey. These are high intellectuals with indepth in Cardan.", "q1r": 5, "q2": "There will a monthly update on every event held for the five month period  where records of output,  completion of questionnaires, feedbacks from participants,  pictures of workshop participants , sharing of links of proposals submitted by participants  etc.\nThese will enhance the seniors understanding in Cardano blockchain, impact on quality of research proposals etc. All these information indicates easy auditability of the proposal ", "q2r": 5, "assessor": "z_assessor_2927", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 7637, "q0": "The problem described in this proposal is closely aligned with the challenge.\nThe team has done a great job by putting the proposal at the right challenge. The proposal clearly provides solution to a problem that has to deal with the aged people not participating in Cardano as the young ones, Cardano is an open space that does not discriminate in any form or color. But yet it is highly unlikely to find the aged especially sitting down and discussing issues of cryptocurrency when they can offer enormous ideas on how best to push the adoption of Cardano in Africa. Most of these aged persons can get more of themselves onboarded on Cardano if they know that most of their years spent idling during pension can actually be their best years ahead.\nThe proposal also captured key important metrics under the campaign brief by mentioning some of the new participants who will come in as users onboarded onto Cardano (wallets, platform sign-ups). The first 20-25 retirees will serve as the core members who will go ahead to register more numbers as they scale up. Cardano is looking at getting a huge adoption rate of Africans into the ecosystem, and I see it's as a gold mine if it is carefully mined.", "q0r": 5, "q1": "The proposer has provided relevant links to members of the team who will help in the proper execution of the project. A careful look at the proposal will show a seriously methodical sketch schematics, carefully played and string to make it coherent to achieve the desired effects that it's planned for from the various worker's unions to where they are based showing what they can bring on board the ecosystem. \nMoreover, the proposal and team from the links provided have the desired skills and experience to be able to execute the project should they be funded and taking their past experience with the sector and what it entails which is quite remarkable.\nThe proposers have also done well providing a detailed budget, broken into identifiable bits, to accommodate all the nitty-gritty of all resources to be used for the proposal. And they go further to outline the milestone by providing the duration with which the project will be funded.\n", "q1r": 5, "q2": "The proposer and team have provided a clear outline on how to measure the progress of their project should they be funded. That is by providing the data of the number of professional organizations and/or trade unions contacted, and the number of seniors present at the initial project meeting just to mention a few. They have provided key milestones, and information on how success will look like should they be funded. ", "q2r": 4, "assessor": "z_assessor_2908", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 7388, "q0": "The idea in this proposal is a unique one. I think this proposal stands out from the rest of the proposals I have assessed in this challenge so far. Most of the proposals in this challenge are focusing more on the youths but this proposal is rather focusing on seniors(retired professionals). Growing a group of senior professionals who already have expertise from different ventures in life and gradually integrating them into the cardano ecosystem is a smart way of onboarding more Africans into the cardano community and creating the awareness of cardano across Africa ( Ghana to be precised). Most senior professionals in Ghana are retired,yet strong enough to venture into other opportunities and I believe catalyst is the opportunity for them and this will prevent them from being idle,but rather be engaged. I believe after these seniors are trained and onboarded into catalyst ,they will begin to contribute in roles like PAs, VPAs,proposers and others. And by so doing,they are engaging themselves and in return may receive some rewards for participating in these roles which in turn will support their meagre pension salaries. I think this proposal effectively addresses the challenge because at the end of it all,,the success of this project will measure the key metrics of the challenge. Throughout the existence of this project,there will be onboarding of Africans (retired professionals in Ghana) into catalyst ,we will have these seniors write and submit good proposals via ideascale to seek funding to solve problems in their societies,we will also have these seniors opening cardano based wallets and operating them and I believe all these match the metrics of this challenge and are capable of measuring success of the project,I believe these outputs clearly solves the problem in the challenge, therefore cardano will be seeded and grown in Africa (Ghana).", "q0r": 5, "q1": "I will start with the experience of the team for this part of the proposal,I believe from the description presented in the proposal,the team is very much experienced in the cardano community and are capable of handling this project and I believe with wada Ghana as part of the team,this project is highly likely to be implemented if funded. Yet,it would have been much convincing if the author provided us with relevant links to their team's previous works and experiences,it would have been much better.\nSecondly,there is clarity in the expression of the timeline and when we should expect the delivery of the project. From the proposal,we know that the project is scheduled to begin and end in the space of 6 months,we also know the tasks to be carried out in each month. The roadmap is well designed and caters for all milestones hoped to be achieved.\nLastly,the budget is a planned  and detailed one with an explicit cost breakdown. We know the components of the budget and how the funds requested are going to be spent. With all these said,I believe this proposal is likely to be implemented.", "q1r": 4, "q2": "This part of the proposal is not very much complete. Nevertheless,the proposer listed clear milestones to be achieved at the end of the project . The key performance indicators are clearly stated and I feel they are good guidelines to measure the progress of this project. The proposer stated numerous informations to be shared to the community in order for the community to keep track of the project. But where?the proposer did not give us direct clues to where such informations will be submitted. For example,the author should be able to write monthly reports concerning the success of the project,the  feedbacks can be shared on the catalyst coordinator chat group or discord where the community can closely monitor the success of the project. Apart from this,I believe the milestones are achievable and hence this project can be audited to an extent. ", "q2r": 4, "assessor": "z_assessor_2890", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6862, "q0": "The idea definitely fits the challenge because the involvement of the seniors could significantly increase the number of  Cardano blockchain users and attract proposers,CAs and vCAs to Project Catalyst in Ghana and Africa overall as well as solve many problems on the African continent.\n\nThe proposal is written in a complete, clear and accessible way with milestones and expected goals. Possible difficulties are taken into account as well as ways to eliminate them, such as a distrust of cryptocurrencies and difficulties for seniors to use modern technology. \n\nTherefore the proposer considers to provide gradual education of Cardano ecosystem in in-person meetings combined with using online communication tools (online meetings and chat groups). I find this method more suitable for people 60+.\nThe project is considered to be sustainable in a longer run as “graduated” participants will involve and teach new groups of their peers. I find the provided goals of the project quite realistic and achievable\n", "q0r": 5, "q1": "I strongly agree because a step-by-step scheme for the implementation of the project with clear and understandable tasks, as well as time frames for their completion is given. Experience of the team leaves no doubt of its ability to succeed and pass knowledge to the seniors as all members had taken an active part in previous Catalyst funds and were very well familiar with Cardano. \n\nThe budget looks quite reasonable. A breakdown into three main parts (Preparatory Activities, Onboarding Activities, Proposal Development & Peer Screening) and a more detailed description of their components gives a clearer idea of ​​the stages, deadlines and costs of each task. \n\nWhat seems really nice to me is that by the end of the educational process each participant will create his own proposal on the Project Catalyst platform. That will indicate the progress and understanding of Cardano Community principles and methods by participants.\n", "q1r": 5, "q2": "The team of proposers provides a structured, described in detail audit system and intends to show progress on a monthly basis. The metrics are adequate and capable of indicating the status of the project and success of its implementation.\n\nFurthermore, the audit includes such metrics as links of proposals made by each senior by the 6th month of this project. Which shows the real success and involvement of participants and their ability to use Cardano blockchain and crypto wallets. \n", "q2r": 5, "assessor": "z_assessor_2840", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6599, "q0": "For a long time, blockchain unwillingly relegated a segment of society that is not usually used to deal with technology, the seniors. This project is a clear response to that. Including adults from +60 years old is a great idea that shows that there is huge potential for those who are considered out of this whole new system. This group of people is the one who has the most experience on this planet, and they are the ones who are the most aware of the actual problems that could not be solved with previous systems. Anyway, it is not an easy task to achieve these goals, since blockchain is still not that user-friendly. If it is handled slowly and gradually, as it is mentioned in the proposal, it is possible to fulfill the potential of these people. This project's success is also the Cardano Community's success in every aspect. Including not only African people in a new economic system is a priority for Cardano, and at the same time, including seniors is a great plus to achieve the long-awaited financial inclusion of the continent.", "q0r": 5, "q1": "The former team in charge of this project is adequately experienced for this task. Having people with human resources expertise is vital for the project to subsist. It is also very helpful to have the Wada team behind since they have direct contact with African people and years of work done there. The budget is well broken down, it has specific information, and it also provides details of the time that needs to be spent for each activity, which is something really valuable. It is also mentioned that the team is looking forward to developing a self-sustainable program, which is always a plus for the project.", "q1r": 5, "q2": "The two most difficult challenges for this project are related to convincing seniors to join the team and being able to hold them across time. Developing metrics that show the attendance at every meeting is key to ensuring that. This is very well explained in the proposal, and I consider that the way they are willing to measure engagement is accurate. There is also a detailed roadmap for the next six months, in which it is explained how long the team thinks every activity will take. If an objection should be made, it should be related to the lack of as far as time is concerned. What this means is that perhaps the team should take into account a potential failure in any of the activities, since they are so close to each other in time.", "q2r": 4, "assessor": "z_assessor_2822", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5091, "q0": "There are four F9 strategic goals with the very first one stated \"Prepare a group of people willing and able to make contributions to the ecosystem\"; the third one \"build real world solutions....\"; and the fourth \"improve tooling to support human processes in Ccatalyst.\n\nIn addition the Grow Africa goal is \"to prepare Africa for a future of wide-scale Cardano adoption, with the open question of how to continue to seed and grow adoption in 2022 and beyond.\n---------------------------------------------------------\nThis proposal for a Senior training hub in Ghana is a $22,212 request to work with Seniors who face compulsory retirement at age 60. Many are professionals - teachers, scientists, medical, financial and business with talents that go unused.  This proposal plans on training and onboarding these retirees into the Catalyst system as PAs and possible Proposers. This is exactly in line with the goal of the Challenge and the first f9 strategic goals.\n-----------------------------------------------------\nMy assessment on this Proposal is that it is a 5 ( highly agree that it meets the objectives laid out in the Challenge) star.", "q0r": 5, "q1": "The team lead is Faakor Fiadzigbey who is a Human Resources Management Practitioner, member of the Wada Ghana team, Challenge team member and Proposal Assessor for fund 8. Also involved is Afia Owusu who has been organizing CATH for the past 3 months is the Wada West Africa Lead, a CA for funds 6, 7 and 8; a VCA for fund 7 & 8, Idea Fest Host for funds 6, 7, & 8, active in most Catalyst meetings (C4C, Town Halls, Idea Fest programs). Beside these two very active Catalyst members WADA members will also be there to assist.\n_____________________________________________________\nThe plan, implementation schedule and longer term objectives are well thought out. The proposal is to ultimately build a Community platform similar to Cardano4Seniors by recruiting the seniors, onboarding them into Cardano, teach them how to write (and assess) proposals, reward them for setting up a Cardano wallet and other activities. The training will be virtual via WhatsApp over a six month period. The budget is realistic with hourly pay scale and is well explained. The consideration for risk Management focuses on the issue of Seniors and tech (using Whats App, etc) but is handled through a mitigation plan.\n__________________________________________________-\nMy rating for this proposal is that it is a 5(highly agree that it is likely to be successfully implemented) star.", "q1r": 5, "q2": "The goal of the Proposal is to have 25 to 30 Seniors onboarded, using Cardano wallets and putting in proposals to Cardano with a good understanding of the Cardano Blockchain and ecosystem. The real goal to develop a group of people willing and able to make contributions to the Cardano ecosystem, give them a new life interest, a purpose, a way to earn income and to contribute.\n-----------------------------------------------------\nThe milestones towards those goals are well laid out, reasonable with solid KPIs. My assessment is this is a 5( strongly agree it has identifiable measurement of success.\n---------------------------------------------------\n\nThis is a post assessment add on, for full disclosure purposes as an organization I am involved with is mentioned in the Proposal as a possible future path for involvement from the Seniors in this project. I wanted to be clear that I am not involved in this Project, I am not involved with WADA and the organization mentioned has no ties or affiliations with any of the proposal parties. I am not a CT or proposer in this category and I after full contemplation do not feel there is any conflict or principled issue compromise. I did feel though since the organization I am involved with was mentioned that it be brought to the communities attention. If this is or becomes an issue please feel free to filter my assessment out. Peace!", "q2r": 5, "assessor": "z_assessor_2671", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 4966, "q0": "This proposal effectively addresses multiple problems of the challenge. 1) Opportunity for seniors 2) Education for better adoption of Cardano 3) Increasing the participation in Catalyst and the ecosystem 4) New projects in Catalyst to create an impact and solve local issues. Thus, I strongly agree with this proposal.", "q0r": 5, "q1": "I like how the proposer has curated the onboarding strategy with different mediums and methods of approach. Consideration of a hybrid model (both online & offline meetings) is the key to this. The plan to build the core team and then slowly expand makes sense. The risk analysis and the solution provided answer the questions. The ADA rewards for the quizzes are attractive for the initial involvement and give them a taste of decentralized earning. The timeline and roadmap are clear. But I suggest the proposer mentions the roles of the parties involved, which will give us the chance to check if the mentioned person or the organization has the capability to complete the intended task of the project. Finally, I agree that this project will be implemented successfully if funded.", "q1r": 4, "q2": "The plan of submitting the outputs of each milestone and the tasks helps the community to effectively track the progress of the project. This will also provide data for people doing research on the adoption of Blockchain among seniors. I do strongly agree that this project will be successful if Funded. I personally thank the team for taking the initiative to involve & empower the elderly of our socity. ", "q2r": 5, "assessor": "z_assessor_2644", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 3390, "q0": "Outreach to various group ages allows more people to learn about Cardano. And what's particular with this proposal is that number of Seniors is growing by time, and if they can be educate about the blockchain and cardano, they would refer to it when looking solution to their daily problems. I support what mentioned by the proposers when saying that this proposal fits perfectly into this challenge because it provides a workable plan to encourage and sustain the adoption of Cardano in Africa among seniors, starting from Ghana.", "q0r": 5, "q1": "Senior, aged 60+ years and who are retired have professional experience, time, lived experience, wisdom and social connection.\nIn Africa, these people are well respected and the message the want to pass to the community are mostly well received and perceived. This may help this project to succeed once the core group is formed and becomes active.\nThe proposers team should be more specific about the age, they mention 660+, and other under 60 who may show interest, but it would be important to specify up to which age under 60?\nThe selection questionnaire that will be shared to potential participants will based on what to select the selected candidates? Indicate some elements of that questionnaire would be informative to evaluators and voters. The idea to plan for rewards is great for this proposal, but what will be the basics of the rewards distribution? This information would be enlightening.\nThe budget is well detailed and reasonable, and the idea feasible and realistic.", "q1r": 5, "q2": "In order to attract more people, especially Seniors, the mechanism and strategy to reach  out them should be important and may constitute a big risk of failure of such initiative; especially as the blockchain information is not known enough yet.\nBut the mechanism in place where the community may follow the progress of this initiative as the report will be shared on a monthly basis.\nIndicators are described, and having a proposal prepared and submitted by the group of Seniors will be a major proof.", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 784, "q0": "This proposal is near and dear to my heart given that I not only find that seniors in many countries are both neglected in terms of harnessing their vast experience but also in a lot of case bored and wanting some engaging activities to feel connected and needed. This is a great concept and as far as I am seeing bvery well thought out. I really like the solutions you are presenting and various groups you are targeting to collaborate with. Clearly due to the category you have entered the African aspect is crucial, however, I can wasily see this applied so next South East Asia and further to the rest of the world's senior population. The risks you have identified are valid and well considered.", "q0r": 5, "q1": "The plan, timeline and milestones provided are sound however I would like to see more detail around the key milestones, specifically some metrics to make these milestones tangible. Your budget breakdown is clear and understanble as well as extremely reasonable for what you are attempting to achieve. The team seem right and well placed and have enough experience to get the job done.", "q1r": 4, "q2": "It appears to me that you have the majority of the success metrics that I like to see as well as a suite of other milestone KPI's that will provide great measures to how you are both tracking and performing. One thing I wouild add would be to maybe consider having a scaled approach to the success metrics like for example, instead of stating \"All seniors who participated will understand to a large extent block chain technology, particularly the Cardano block chain and how to use it solve the problems of our continent\" Maybe consider something like: \n1. 80% of seniors who participated will understand to a large extent block chain technology, particularly the Cardano block chain and how to use it solve the problems of our continent.\n2. 15% of seniors who participated will understand to an average extent block chain technology, particularly the Cardano block chain and how to use it solve the problems of our continent and will require some further refined education. \n3. 5% of seniors who participated will not quite understand the concepts of block chain technology, particularly the Cardano block chain and how to use it solve the problems of our continent and will require further education. \n\nWell done.", "q2r": 5, "assessor": "z_assessor_2127", "no_vca": 13, "ne": 2, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 13802, "q0": "Clear and concise descriptions of the issues in the problem statement have been presented and the problem statement matches the challenge that needs resolution.  In summary, the proposer specifically indicates how new technology is targeted at the youth, leaving the Seniors out. I would want to add that, Seniors are mostly not interested in getting involved in new things and especially technology. This is mostly the reason for which they are left out and not necessarily because the technology emerging targets the youth. This is not to say that, sponsorships existing to advance the use of technology do not at times only cover the youth.  The proposer should beef up the problem statement with how the Seniors find it difficult if left alone to match up with new or advancing technology, thus even with their 'active brain', they are not able to affect their communities, thus there is the need to bring them on board to equip them with knowledge through the cardano system.\nThe problem has a positive impact on the cardano system.  The proposer indicated that the project has a  workable plan to encourage and sustain the adoption of Cardano in Africa among seniors, starting from Ghana because they have the combination of professional expertise and abundant time to create workable solutions to problems using the Cardano blockchain. \nThe proposer also provided adequate information on the fact that the project if implemented would add value to the Cardano System. The proposer provided that, it is a win-win project as Cardano and Africa stand to benefit immensely from this partnership. The KPIs provided are also relevant for measuring the challenge.\n\n\n\n", "q0r": 5, "q1": "It is feasible to implement the project as it clearly states:  the experience and skill set of the project team relevant to the proposed project; budget and resources required for implementing the project.  Key risks which may also affect the smooth implementation of the project have also been provided. However, there is the need to present a provisional budget for additional funding needs; there is also the need to design a process architecture that provides an opportunity for identifying areas of improvement over the implementation period.  Other key risks include not finding names of people who have retired in the published lists of the professional associations as most of them would stop paying their dues at the retired age and it may be difficult for the proposer to also obtain names of retirees from professional bodies as it may be regarded as a breach of confidential information. We propose the promoter uses pensioners associations for identifying the project target groups. It would also be prudent to rather use retired educationist for this purpose as they are more project and research-focused than other groups of pensioners; Retired CHASS Associations; Takoradi, Technical University Pension Association, Ghana University Pensioners Associations, Ghana Pensioners Association etc. are examples of such pensioner groupings for consideration. Another risk that may be encountered is the death of some of these pensioners immediately or not too long after joining the community and commencing a project. There is the need to scan the history of these pensioners based on well-developed checklists, so as to gather pensioners that although sixty (60) and above and still brainy, have the energy and good health to go through the training and make contributions to Cardano for a longer period. The risk that pensioners would not be in the cities but in remote areas is also high, making it difficult to implement face-to-face meetings continually as planned. \nWe propose additional days for search and analysis for pensioners and additional budget costs for transporting and accommodating them in case they are out of the city of the meeting.", "q1r": 4, "q2": "The project is clear and auditable. It clearly presents; milestones and road maps, KPIs necessary for measuring the success of the project, KPIs necessary for quantifying the success of the project, and a system of feedback for the community to track the implementation of the project. ''The number of seniors attending the in-person bi-weekly meetings will be obtained and compared over the period to ensure that each candidate is present at every session this system for tracking and monitoring of the progress of the project is key to the success of the project however the objective should be improved to include actually accessing the sustainability of the project based on the behavioural patterns of the attendees.", "q2r": 5, "assessor": "z_assessor_3823", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13829, "q0": "Senior potential is often left aside when designing Developer Ecosystem development strategies. And, as this team claims, they can be of great help in regards to Community improvement and expansion. They often still have the intellectual and physical capacities of producing fruitful projects and sharing with other members of the Community their life experiences and gathered wisdom. The elderly population still presents a huge resource although they might be forced to retire from their active working life. Onboarding sessions and physical meetings for senior newcomers can be really groundbreaking for our Community. It might be fruitful for this challenge to face a one to one strategy between young and senior developers and active members of Cardano Catalyst Community. This proposal does effectively address the challenge of growing the African Developer Ecosystem and thus Cardano Catalyst Community. This will grow significantly the number of new Africa-based users on boarded onto Cardano.   ", "q0r": 5, "q1": "Having members of the Wada project in this proposal is a guarantee of certain success as they already know the dynamics of the Cardano Community and their good job is an example of a good administration of the treasury of Cardano Catalyst. Plan presented seems consistent and clear. Timeline will end in further funding and in a continuous work within Cardano Community that assures a fruitful exchange and productive long-term project that shows real compromise and engagement with the problem to solve. Given experience and the plan presented it is highly likely this proposal will be implemented successfully. ", "q1r": 5, "q2": "Numbers of seniors presented at the initial project meeting might be sufficient but yet not enough to audit this proposal efficiently as a Community. Further quality information might also be of great help to understand senior African newcomers. Interviews and surveys can be more efficient than just plain numbers as we are intending to work with people behind the ideas. This process might inspire team members new approaches to make Cardano Catalyst more attractive for the selected segment. Nevertheless, the information provided is sufficient to correctly audit the progress and success of this very interesting proposal. ", "q2r": 3, "assessor": "z_assessor_3833", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Grow a core group of senior professionals in Ghana through a gradual onboarding process to participate in the Cardano community in various capacities and to replicate the process among their peers", "experience": "Multidisciplinary team of professionals including seniors, with a combined work experience of over 50 years, active in the Cardano ecosystem as funded proposers, facilitators of town hall, PAs, vPAs, challenge team members"}