{"id": 419831, "author": "humanbeing", "title": "Boosting Cardano In South Africa", "url": "https://cardano.ideascale.com/a/dtd/419831-48088", "category": 26600, "amount": 27410, "description": "The evolution of the Cardano ecosystem and the project catalyst in the African region is moderate but is barely adopted in South Africa. Thus, it requires boosting.", "f6_no_assessments": 21, "f6_rating": 4.761904761904762, "videos": [], "media": [], "f6_assessments": [{"id": 460, "q0": "Another great effort by the African Cardano community to onboard university students onto Cardano through Catalyst School. Catalyst School is a natural progression/introduction to Cardano for the processes inside seeks to educate. It would seem as these university students were attending an additional course.\n\nAdd to that this event is happening offline. There is a different nuance of interaction and focus when education happens offline. There is more attentiveness, there is more focus, there is more opportunities to gauge whether our communications are effective. This is a finding I can verify after various discussions with lecturers. Zoning out on Zoom frequently happens and is something educators complain about.", "q0r": 5, "q1": "A group of accomplished individuals whom have built a strong reputation amongst the Cardano community. Their experience throughout Project Catalyst as active contributing members of WADA, where the majority of the proposers are accomplished individuals themselves in the education field and add to that their collaboration with Catalyst School are a force of reputable individuals that most likely will guarantee the successful onboarding and education on Project Catalyst.\n\nTheir plan at its current stage is a very well thought out plan, as mentioned in their proposal, it is a refinement of their efforts in Fund 7 which for some reason did not receive funding. You have all the makings of an excellent event for they have covered all the planning that spans from understanding what they will deliver, understanding what needs to happen to have an event such as this to understanding how to determine a achievable onboarding target.", "q1r": 5, "q2": "This is the beauty of having a persistent spirit. Everything on this proposal can be gauged. Starting from the contents of what will be educated on.The content itself is a development from the syllabus of the proven Catalyst School teachings where it is broken down into 5 (five) \"bite-sized\" categories.\n\nIn this proposal there are numerous numerical metrics, starting from the intended target of participants, to details of what will be done once there is a clear indication of success in receiving funds. Though in this section it could be improved even been improved further with an attachment that details their action plan.\n\nThis should be common practice for what they seek to achieve is one grand event. Preparation and follow-up should also have a clear timeline. Although this is an educational effort it does fall into the category of hosting an event. And time management and constant communication is essential for the success of an event.\n\nWhat is impressive of this proposal is their humbleness to actually provide a range in regards towards the targets they seek to achieve. All targets are provided an achievable estimate. This is called proper management.", "q2r": 5, "assessor": "z_assessor_2088", "no_vca": 15, "ne": 2, "ng": 13, "nfo": 0, "vca_o": 1}, {"id": 13571, "q0": "The proposal identifies problems that led to an unsuccessful project in fund7 and the proposer thoroughly taken into consideration  all factors of which covid-19 protocols being included and the Friction from government bodies. The proposal clearly articulate how it will add value to cardano ecosystem by diversifying education in all directions ; the awareness will stretch to university students, developers, businessmen and women, and government officials residing in South Africa through both online and offline sites and media .The key metrics and goals of the proposal align with the outlined challenge system which is focusing on adoption of Africa as part of cardano ecosystem. Making face-to-face events  will increase the number of South Africans interested in the growth of the Cardano Community. And at the end of a successful implementation, there will be an increase in the number of catalyst participation, the quality of Project Catalyst projects coming through from the South African region which will add  value massively to the colonization of cardano ecosystem. The proposal is clean and it will also address future challenges by establishing a sort of connection with the government officials that will continue to ensure sustainability therefore the proposal effectively addresses the challenge. \n\n", "q0r": 5, "q1": "The proposal contains links and references which proves that the proposer and his team have the experience and the relevant skills required to implement this project. The proposal also clearly states the type and the number of team members to undertake this proposal which is a very reasonable number. The proposal explained precisely and detailed how funds are going to be allocated to ensure a success in the project. There is a clear plan which take effect 60th day after the approval to undertake the project before which all arrangements and preparations will be done to ensure a smooth-sailing project.The project is quite possible and I think given the experience and plan presented, it is highly likely this proposal will be implemented successfully. ", "q1r": 5, "q2": "With wada; an international organization with local footprints , they aim to equip local developers and entrepreneurs to build decentralized application and business for the future is  monitoring and tracking down the progress and the success of this project. The proposal also has a targeted problem that can be measured against the proposed outcomes such as allocating a  1,000 USD as miscellaneous to handle any price increment on goods and services that may occur as they proceed with the project. Including public channels and social media  to the the proposal to deliver regular updates to the community for auditing progress will also ensure more checks and make a successful project therefore the information provided is sufficient to audit the progress and the success of the proposal.\n\n\n", "q2r": 5, "assessor": "z_assessor_3696", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12964, "q0": "The proposal is about to the Boost Cardano ecosystem in the south African region ,The adoption of Cardano eco system in the in the African region is very moderate By educating on Cardano and Project Catalyst through a grand outreach event for university students, developers, and business personnel we can help the youth to get interestd in the Blockchain system mainly focusing on the cardano .The proposal will increase the number of South Africans interested in the Cardano System as a result more people will be interested in the catalyst participation .By this their will be more number of real time projects will be implemented in Cardano ecosystem .This proposal clearly adds the value to the cardano ecosystem .The key metrices and goals of the proposal align with the outlined challenge settings. Upon reviewing the proposal I strongly agree that the proposal effectively addresses the challenge .", "q0r": 5, "q1": "The proposer have provided the detailed plan ,including timeline and key milestones for implementing the proposal . The proposer have provided the evidence of the work experience and skills which are required to implement the proposal. The Budget outlined is bit too high can be reduced the proposal needs to work on that other then that, the goal of the proposal is great .\nWhich is to boost the cardano ecosystem in South Africa . The proposal offers the realistic time to complete the project , The proposer have also considered the risks and the challenges to a successful implementation of the proposal.\nThe links of the works of the team is described in the description Upon assessing the proposal I agree that the proposal is likely to be implemented successfully  .", "q1r": 4, "q2": "The proposer have described that how we can  measure the progress of the proposal in the description . As per the goal of the proposal to boost Cardano and Project Catalyst's adoption rates in South Africa the growth or the success of the proposal can me measured by looking at the total number of workshops conducted , Hackathons etc. The Proposer have provided the clear understandable  description of the targeted problem and also described the solution to that project .  The described Kpi's and Metrices of the proposal define the success of the proposal . Upon reviewing the proposal I agree that the proposer have provided enough details to assess the proposal .", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12847, "q0": "The proposal is aligned with the objectives in the challenge briefing. Hosting events to grow the community in Africa is of undisputable importance. The quality of the events is key to having the biggest impact. Also the amount of events and having a continuous process of hosting these events will increase the impact. A single-held event is proved to be less efficient than a series of events. The risk of attendance, as correctly mentioned in the proposal, could be reduced by improving the marketing, mini-seminars and media coverage. At the moment these aspects seem a bit vague and could be written in more detail. However, it is important to mention that the team is well-known by the Cardano Community and have been successfully completing multiple funded proposals.", "q0r": 4, "q1": "The details of the event as shown in the section 1st to 58th preparation of the event is a tiny bit vague. The key points are hitting the spot, but they could be elaborated in more detail to raise the quality of the proposal and convince voters of the impact of the project. The KPI to attain at least a 10% growth in adoption rate could be supported by showing the number of attendees in previous events. What are the guidelines for the “community journey” as mentioned in the proposal. There is a risk of attendees losing contact with the organization who held the event. How is the proposer planning on mitigating this risk. Adding these things will increase the quality of the feasibility section. \nFeasibility is about the coherence between the budget and the team. The team is of high quality and well-explained in the proposal, also the teams working on this proposal are well-known in the community and have been completing a lot of funded proposals. However, the budget in the proposal seems to not be on the same quality-level as the team description is. A more detailed budget would increase the chances of this proposal being voted on. I will list some examples. The costs for one outreach event seem a bit high and vague. In order to raise the transparency and really showing the community the quality of the budget I would suggest adding a financial breakdown (budget pre-event vs. the actual costs that incurred) of previous held events. 9.000 dollar for a return flight from Accra to Cape Town seems a bit much. Google shows me that 1 flight for 1 person is about 1000 dollar, so I assume there are more people coming over from Ghana? Having a more detailed budget will help to decrease the amount of questions being raised by the community when reading the budget. ", "q1r": 3, "q2": "The auditability section is in line with the feasibility. If the feasibility lacks details then so does the auditability section. Having a YouTube channel and being a well-known name in the space will greatly help the community by auditing the process in a more informal way. I understand it is hard to make estimates, but “A good number of” seems very vague. The KPI’s as stated are only truly measured after the event is held. KPI’s and deliverables which can be completed during the process are a good addition to the currently stated KPI’s. For instance, during the 1st – 58th day period at stated in the feasibility section is missing some KPI’s. Examples are: amount of universities to reach out to, amount of attendees per background, amount of emails sent out to 3rd parties etc. Adding different KPI’s and a roadmap will greatly increase the quality of the proposal and will give voters more confidence that they are using their voting power on the right project. ", "q2r": 3, "assessor": "z_assessor_3490", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12842, "q0": "An awesome and great proposal to be paid attention to. The idea of boosting Cardano and the Blockchain in South Africa is lucrative to the community and the people as well. The idea of educating students, developers, and personnel in South Africa will help individuals to acquire knowledge on  Cardano, Project Catalyst, and blockchain and is very essential to the metrics of the chosen challenge. The use of mini-seminars to engage and market the grand event is a good approach for me. I see this as a solution for individuals who may be quite skeptical as they are likely to at least grasp some understanding from the mini-seminars to help them erode their doubts. Once their doubts are eroded, they will surely have the zeal to attend the grand event. I see a lot of impacts in this project and I just want to wish the team good luck with my score of 5 for impact.", "q0r": 5, "q1": "In boosting the project catalyst and Cardano in South Africa, training like the person will greatly expose him to the project and what to do to be involved. Then the workshop, seminars, and group meetings will also help in better understanding. The detail on the budget is clear and accurate for the project to be successfully implemented. The team looks great and with their experience as stated in the proposal and confirmed through the available links, I am convinced that the necessary man-force and knowledge-force needed by this proposal to ensure success is surely met. I love the project structure as it indicates completely a conductible plan with well-mitigated risks.", "q1r": 5, "q2": "With quantified metrics, the picture of what to measure is clear. This is helpful for the community to know upfront what to expect from the team as a report. Also, the community can just compare reports from the team to the given metrics and roadmap to easily identify whether or not the team is on track to reaching success. The team looks pretty much transparent with this initiative and I will say kudos to that effort.\nThe identified problem has been given an understandable solution in this proposal and it sets the expectation right for every community member. The team did well to indicate that the community can track the progress of this project if funded through the project catalyst reporting sheet and also for those of us who may not be able to attend the face-to-face event in Cape Town, a recorded version would be available on the Wada YouTube channel. This clears my doubts about where the progress of this project can be tracked hence I give it a score of 5 for auditability.", "q2r": 5, "assessor": "z_assessor_3489", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 12576, "q0": "The problem in challenge to be solved here is the growth of the Cardano ecosystem and the project catalyst in the African region is moderate but almost unacceptable in South Africa. So it requires strengthening. The way it will add value to the Cardano ecosystem is by organizing a tailored outreach event where South African students, business staff, and developers will feel welcome and learn about all that they need to know about Cardano and Catalyst at a basic level. In addition to education, participants will have the opportunity to interact and socialize with tutors and themselves. The proposal's key indicators and objectives are consistent with the stated challenge settings, with the objective being to ensure that South Africans, particularly university students, business personnel, developers and stakeholders government institutions, are exposed to the accuracy of information revolving around blockchain. Upon successful implementation, there will be an increase in the number of participating catalysts, the quality of Project Catalyst projects coming from the South African region, an increase in the number of Cardano Dev participants, and an increase in the number of participants. number of individuals from South Africa, interested in blockchain. I believe the proposal can scale to address future challenges. I rate this impact 5* and I believe this proposal addresses the challenge effectively.", "q0r": 5, "q1": "Given the feasibility of this proposal, I appreciate it. The proponent clearly provided information about the relevant skills and experience required to implement the proposal. The proponent stated that this project was supported by a collaborative effort from a diverse group of people. cultural and technical experience in the Cardano community as well as in Africa. (includes Wada: Community Network based in Cardano. Bernard Sibanda: BSC Computing, BTech Education, MCP, Plutus Pioneer...).The budget is reasonable to achieve the set goals and is clearly outlined and broken down into identifiable items.(2,000 USD: Project management 5,000 USD) USD: Event cost 3,000 USD: Presenter incentive (600 USD x 5)). The proponent has given a 70-day implementation timetable to complete the work and has established a clear and detailed timetable. Proponents have considered the challenges and risks associated with successful implementations. (Diligence: People are naturally skeptical about things they don't understand. This can affect participation forecast. Inflation: the current state of the global economy is affected by a number of negative factors, of which the Russia-Ukraine war is pivotal). I strongly agree I rate the forecast. This project is 5*, and I believe that this proposal will be implemented successfully.", "q1r": 5, "q2": "As mentioned in the feasibility roadmap with important milestones to implement the project in 70 days. the success of the proposal will bring a lot of benefits, there will be a strong network of university students, developers, business staff and government officials from South Africa. At the end of 3 months must at least 100 individuals (university students, developers, business personnel and government officials) in South Africa attended the event and knew about Cardano and Project Catalyst.\nIndividuals approach the core team with their innovative ideas to be refined into project-catalyzed proposals for submission. Aimed at ensuring inclusive and equitable quality of education and promoting lifelong learning opportunities for all. With the solution driving Cardano and Project Catalyst adoption through a follow-up event A great approach for university students, developers and business people in South Africa. The solution proposed by the proponent is easy to understand and clear. I appreciate this project and hope it will win a sponsor, this project I rate 5 *.", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 11648, "q0": "The describe proposal has done a great job by placing it in its right challenge.. the proposal team effectively addresses challenge and it potential of bringing values to the communities in African countries and to the Cardano ecosystem should they be funded to execute their project. The proposal team clearly provide a precise solution to the stated problem by stating, solution will increasing the number of South African interested in the growth of the Cardano community and successful implementation to increase in the number of catalyst participation, the quality of project catalyst project coming through from South African region, etc with the aim of ensuring that South African especially university student, business personal, developer,etc are exposed to the accuracy of information revealing around block chain should they be funded and I strongly believe that they will do a great job if they are funded to execute their project.\n  The proposal team also capture some important key metrics under the compaign brief indicating benefits to the African countries communities and to Cardano ecosystem should they be funded and I strongly believe they will do a great job should they be funded to execute their project.", "q0r": 5, "q1": "The proposal team is able to provide relevant links and details of team members who will help in the execution of their project and I strongly believe they have the experience and the Desired Skills to carry out their project should they be funded.\nMoreover, the proposal team has done well by outlining the breakdown budget funds on how to use it should they be funded which I think is commendable. Furthermore the proposal team has also done well by identified some risk challenge that could prevent them from executing their project and able to navigate solution to them, risk such as Attandence and inflation, should they be funded to execute their project.\n      Lastly, the proposal team is able to provide details plan including timeline, milestone and roadmap to deliver their project should they be funded which I strongly believe they will do a great job should they be funded.", "q1r": 5, "q2": "The proposal team is able to describe their project progress and how it will measure to the Cardano ecosystem and to African countries communities through community progress through project Catalyst monthly reporting sheet and under Wada YouTube channel when they recorded version of the ground event will be published should they be funded and I strongly believe they will do a great job should they be funded.\n           Furthermore, the proposal is able to indicate their success for their project will look like such as;. At least 100 individual student, developer, business etc in South African who attended their event will be awere of Cardano and project catalyst community should they be funded which I strongly believe they will do a good job if they are funded.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11299, "q0": "This proposal is very good and completely in line with the objective of the challenge. In this challenge, we seek to fund proposals that help expand the Cardano ecosystem to Africa. With this, we will benefit, because our blockchain will become popular, and attract more investors, and more participants for Catalyst. And about the country of South Africa in particular, the African Continent, in general, will benefit as well, as its inhabitants will be presented with possibilities, both in terms of investment, employment, and source of income (PA, vPA, or something more stable like becoming a designer or developer of some Dapp for example). In the proposal mentioned, the team will organize an outreach event tailored for South African students, business staff, and developers to learn all they need to know about Cardano and Catalyst at a fundamental level version, participants will have the opportunity to interact and communicate with tutors. The proposal clearly stated the time, place, and way of organizing the event. The team's proposed solution effectively addresses the challenge. The solution will increase the number of South Africans interested in the development of the Cardano community, there will be an increase in the number of catalyst participants, the quality of Project Catalyst projects coming through from the South African region, and an increase in the number of Cardano Dev participants. In conclusion, I believe in the potential of this idea and I think it will have a very positive impact on the Cardano ecosystem.\n", "q0r": 5, "q1": "In my opinion, the feasibility of the project is high. We know what will need to happen for the project to happen (the tasks), and they are broken down by date (in the delivery section). That way, we have a great view of the process, knowing what will need to happen and in what timeframe, which will help us test later. From day 1 to day 58: the group will do tasks to prepare for the event, after 60 days: the group goes to organize a big outreach event, and from day 61 to day 70: the group organizes an online exam to evaluate the attendees. My only suggestion is \"attendants scoring below 80% will be contacted by the team to encourage them\", but I think if the team can give them small rewards (money, gifts,..) I think those people will be very excited about the group's project. Now talking about budget interpretation, the total amount is 27,410 USD divided into several parts; these parts can be explained better, in the case of budget, I think the details provided are not enough. For example: \"5,000 USD: Event Costs (Event Center, Catering Services, Media Coverage)\", I think the proponent should have mentioned more clearly, hire an event center How about the cost? How many events do you organize? How does food service cost?...I don't think we can understand how the money will be used, because the explanations are very superficial, the proponents only mentioned to the vast majority of funding will be divided without delving into every single one of them. Finally talking about them, the team, they clearly explain who they are and what their field of activity is, and provide a link to their website where we can better understand the group. The project will be supported and mentored by Catalyst School and Wada, so there is great confidence in them and their willingness to successfully implement this proposal. So I think this part of the feasibility is very good. Some parts can be better explained here, mainly the budget division.\n", "q1r": 4, "q2": "I find the ability to check progress very good. Many milestones are identified, which can be seen as partial results and small advances to be made in the proposal. With them, we know if the process is going on the intended path or not and if the expected achievements are being achieved. The community can track the progress of this project through the Catalyst Project Monthly Report Board and the Wada YouTube channel, where a recorded version of the major event will be published. The group also mentioned the indicators/KPIs to determine the success of the project. \"The number of potential attendees, actual attendees, number of people participating in the Cardano Development community, number of Project Catalyst participants, number of new wallets created\" is estimated by the team using fairly specific numbers, clear. The project's success matches the challenge, as the project concludes there will be a strong network of university students, developers, business staff, and government officials from South Africa engaging with the ecosystem. Status Cardano by becoming a Community Advisor and submitting Catalyst Proposals is appreciated. So I think audibility is good.\n", "q2r": 5, "assessor": "z_assessor_3235", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9876, "q0": "The proposal aims at growing the ecosystem and the project catalyst specifically in South Africa. This seeks to be accomplished by reaching out South African students, business personnel and developers by hosting an outreach event to discover all they need to know about the Cardano and catalyst. With this,the proposal focuses on enlightening participants on the basics of Blockchain, Cardano, it's development tools as well as wallets. There proposal is targeting not less than 100 people. Social media pages like WhatsApp, telegram and discord will be created to onboard and engage attendees for subsequent workshops. It'll also provide assistance for participants to create Cardano wallets for token purchase and delegation. The aim of the proposal is also to ensure that concerned members are exposed to the accurate information revolving around Blockchain, it's capabilities and available opportunities.", "q0r": 5, "q1": "The proposal is hoping to be implemented 60 days after funding which includes a budget breakdown I indicating that there'll be external presenters. The plan of the proposal is to host workshops outreach events among others to ensure that they adaptation rate of Cardano and project catalyst in South Africa is boosted upwards by at least 10% per event. As part of the plans to make this proposal a success an online exam will be conducted to evaluate the attendees with regard to understanding grasped from the presentation on the already mentioned areas. The results will determine whether participants fully understand and extra workshops will be provided for participants who didn't perform well. The people to implement this proposal are well endowed with information and have experience in the field of Blockchain and catalyst.", "q1r": 5, "q2": "The Project Catalyst Monthly Reporting Sheet and the Wada YouTube channel, where a video of the major event will be posted, can be used to follow the development of this project. Additionally, all pertinent resources that can be shared will be made available to the community via the various Discord and Telegram community channels. about 150 or more potential attendees are predicted to participate. The proposal estimates 75 and more attendees to be onboarded to the Cardano development community. As well as about 75 nee Cardano wallets should be created. Thus, Yoroi, Nami CC Vault.\nThere'll also be follow up calls, emails and messages for guidance and more inquiries.", "q2r": 5, "assessor": "z_assessor_3123", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13766, "q0": "- The \"problem statement\" says it all and straight forward  \"Boosting Cardano In South Africa\"\n\n- At the end of a successful implementation, there will be an increase in the number of catalyst participation, the quality of Project Catalyst projects coming through from the South African region, an increase in the number of Cardano Dev participants, and an increase in the number of individuals from South Africa, interested in blockchain. \n\n- It involves tutors around South Africa and Ghana. \n\n- This project will be supported and monitored by a very active team in Catalyst School and Wada with the goal of Boosting the cardano adoption rate in South Africa\n\n- It prepares Africa for a future of wide scale of Cardano Adoption by booting the adoption Cardano and Project Cataltyst through a Grand Outreach event for university students,developers and business personnel in the region of South Africa and continues to seed and grow adoption in 2022 and beyond by the proposed solution that is addressed the challenge that has been submitted that desribed as it will be a solution to increase the number of South Africans interested in the growth of Cardano community.\n\n", "q0r": 5, "q1": "- \"The beautiful images in the attachment section of the proposal confirm our experience and past successes in terms of events and outreaches\".\n   this is a proof for me that this proposal looks successful because of the previous successful events took place\n\n- As the proposal solution states that this current proposal is an improved version of their Fund 7 proposal from the previous one even though it never got funded but got good rates and approved by the community this shows me lot of hard work and committment through thier passion of being good and succefull entreprenuers.\n\n\n- Yes the structure of the proposal states relavent information from dates to activities and locations concerning this specific project this event will take place in Cape Town November on the 60th day of funding \n  1-59th day post funding\n\n- Theres  a list of the budget with details provided of Grand Total = 27,408 USD rounded to 27,410 USD (per Catalyst recommendation)", "q1r": 5, "q2": "-The community can basically track the progress of this project through the Project Catalyst Monthly Reporting Sheet and the Wada YouTube channel, where the recorded version of the grand event will be published.\n\nAlso, all relevant resources that are shareable would be shared with the community via the various community channels on Discord and Telegram.\n\n-Yes\n The KIPs, roadmaps and key milestones are stated with details defined\n\n-All risks concerning this proposal are taken into considerations \n\n from covid 19 regulations \n Attendence and inflation", "q2r": 5, "assessor": "z_assessor_3787", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8905, "q0": "As we South Africa is one of the well developed countries, and it is very sad to hear that cardano is less known in South Africa than Other African countries hence some awareness or workshop must be done is such places to boost the ADA and other blockchain project. Hence developing an idea to outreach event for university students, developers, and business personnel in South Africa 🇿🇦 is a great idea where it can create more awareness among South African people and connected with block chain by creating their own project in the future , Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposed plan doesn't involve much of a risk as it just needs one good speaker to handle the crowd and make them engaged towards the him, the proposed plan has already a team where they have been conducting such meetups.\nThe team has combined with wada and the catalyst school where it contains lot of members who have been working in Cardano eco system for very long time , and have done many such awareness program in the past ,The proposer's team has also outreached to people and have done such programming of creating awareness where this is showcased by some of the photos in the audit , hence with minimal risk involved and with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clearly explained its main goals of the project and has measured the rate of people that have adopted cardano in South Africa. The audit has introduced all the team members of the project with their expertise field and even  partnership with teams like Wada and The Catalyst School.\nThe proposal has presented us detailed budget breaking idea and well structured timeline of the project , the audit has showcased excellent key indicators to measure the success rate of the project , by keeping the motive to widen the cardano in South Africa , The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 7891, "q0": "From the information provided in this proposal, I strongly believe this properly addresses the Challenge to grow Africa and Cardano and meets all challenge criteria. The key problem that is addressed is the lack of education and assistance for blockchain adoption. The proposer's plan would grow both Africa and Cardano. The plan the proposer has outlined will increase users, as well as developers entering Cardano. Many Africans do not have many opportunities that developed nations enjoy. An overwhelming amount of people living within Africa are unbanked, unconnected, and locked out of finance due to a lack of identity; Cardano solves all of these issues and will help Set the stage for blockchain adoption in Africa will help the country move towards prosperity as blockchain aids the country's development. There are key metrics where the impact this project will have on the fund challenges goals by measuring the number of new wallets as well as the number of new developers onboarded through the program. The proposal does outline the project will need a few rounds of funding to be sustainable, so that information is accounted for within the plan. I find this proposal does align with Fund 9 Strategic goals. A group of people are coming together via the proposal and will attract more users and developers to Cardano, creates a real-world solution, and improves the tools we will have in the Cardano ecosystem to support human processes.", "q0r": 5, "q1": "From my assessment of this proposal, I can conclude the plan will be successfully implemented. The team has the relevant experience and team members needed to effectively carry out this proposal as they are supported by WADA and Catalyst school. The proposal clearly states who will be doing what responsibilities; roles are assigned to each team member and both overseeing organizations.  The team and both supporting organizations have an abundance of experience in blockchain and supporting programs within Africa. The team also has blockchain developers that are plutus pioneers which will be beneficial for onboarding and further training developers in plutus. The proposal breaks down all costs including project management, event costs, presenter costs, marketing, etc, and also established this through research not just assuming how much the cost would be. The proposal has also taken into account inflation, so the project does not end up being short on costs, as inflation within Africa is high.  ", "q1r": 5, "q2": "I strongly believe from my assessment of this proposal, that this project can be sufficiently audited to track the progress of the implementation and success towards stated goals by the proposer. The Metrics are well thought out and would be effective as the number of people onboarded onto Cardano is clearly measurable and the data can be easily audited by on-chain data. The challenge's objective is to help Africa and Cardano grow, the measurable metrics that would help successful audit implementation are users and developers onboarded onto Cardano. This can be easily audited to ensure the proposal is being implemented effectively. The proposer does plan to provide regular updates on social media and may host a Twitter space where the community has a chance to speak with the team.", "q2r": 5, "assessor": "z_assessor_2933", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7390, "q0": "I believe this project seeks to reach out to as many people as possible in south Africa. It is opened to a wider audience. The idea here is to organize a grand outreach program for university students, developers and business personnels in south Africa to bring their focus to cardano.I think this is a smart way of bringing cardano to spotlight in south Africa and creating it's awareness and also getting people involved and integrated into the cardano community. This proposal clearly addresses the challenge effectively and I hope it gets funded this time around. I strongly believe by the end of this project,it's impact and outcomes will be great and match the key metrics of the challenge. There will be a mass adoption of cardano in south Africa which boils down to Africa,new member onboarding into catalyst,we will have a number of students, entrepreneurs, developers contributing to various roles like PAs, VPAs, proposers and many others in catalyst. All these outcomes will therefore measure to the key metrics of the challenge and as such the idea in this proposal solves the challenge perfectly.", "q0r": 5, "q1": "The roadmap is very clear and well prepared and the team seems to have well laid plans for this project. I think they know what they are about. We get to know the plans of the team before the main event.\nSecondly, based on the descriptions portrayed in the proposal,the team is very much experienced and are certainly skilled and qualified to handle this project. The author provided relevant links to  to their social media handles and we got to know them in more details and personally. I think the attractive images at the beginning of the proposal and at the attached section validates their experience level and other previous outreach programs organized by the same team. We also have Wada and the catalyst school as part of the team and I believe this duo are capable of mentoring this project to success.\nThe budget is reasonable to some extent and the amounts allocated to each item is rational. The budget is explained in details so we understand why such amount which is quite high and justified (we can blame it on the upsurge of prices in Africa)is  requested. I therefore believe this proposal is highly likely to be implemented.", "q1r": 5, "q2": "The team has an excellent auditability here. The author provided us with direct ways to monitor this project. We can get to audit and monitor the outcomes of this project through the catalyst monthly reporting sheet,the Wada YouTube channel where their recorded version of the event will be uploaded. I believe these are accurate and safe means for the community to audit this project and monitor it. The author listed a good number of key metrics hoped to be achieved and I think they are clear ways to measure success. Also the key performance indicators are clearly defined and makes alot of sense to me,they are good guidelines on how success of the project will look like. We already know the team has embarked on previous outreach programs and this is not new to them,this is based on the proves I have seen in the pictures in the attachment part of the proposal and I have no doubt this project will also be a success if funded. I strongly believe this proposal is highly auditable by the community.", "q2r": 5, "assessor": "z_assessor_2890", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6601, "q0": "Cardano´s African community is the main stakeholder of this challenge, and every project that aims to develop and provide help in growing Cardano´s scope in the continent is welcomed. The purpose of this project seems to be lined up with what it is expected. Creating places and events where direct contact can be established is one of the best ways to assist the expansion of the community. If this series of events manage to introduce blockchain and Cardano correctly to more than a hundred people per event, it would start a snowball effect that will introduce a significant portion of the African community to life-changing technology. Anyways, hosting events is not an easy task, since it requires experience in engaging people and making sure they leave interested in what was shown there. The team should also be aware that constancy is needed to ensure that the community grows healthy. A single and isolated event would not create the same impact as a series of correlated events would. If the team´s objectives are accomplished, we will be in front of a win-win situation, in which the African and Cardano community would benefit from each other, as the main goal of the challenge is well lined up with what the project is trying to do.", "q0r": 4, "q1": "The proposer team is formed by experienced people who have direct contact with people from Africa and people who are aware of their needs and expectations. Therefore, it is fair to say that the content of the events is going to be accurate and focused on the Cardano development in the African community. About the budget,it may not be transparent enough. It is clear that research has taken place in order to build it, but more information could be presented. It could be way more specific and transparent if the name of the event center, the hotel name, and more, were there so that it opens the possibility to check the information. Moreover, the proposer mentions the sustainability of the projects, yet it does not mention their ideas on how to achieve them.", "q1r": 3, "q2": "Since the project consists of a series of events, it is easy to measure its immediate impact. It is accurate the way the proposer plans to track the project's progress. Having metrics related to interactions through social media and physical attendance is a great approach to measuring the success of the event. Another way to estimate it is by calculating the level of attention the speakers got, by analyzing the results of the tests that are going to be made after the event.", "q2r": 4, "assessor": "z_assessor_2822", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 4143, "q0": "From my perspective, one of the greatest impacts to ever realize as a community is a boost in adoption rate in some regions where lacking. South Africa is by far one of the greatest countries on the African continent with lots of developmental activities going on. Recently I had a conversation with a South African friend who is Blockchain enthused and he was just informing me that the South African bank is placing a ban on the usage of visa/credit cards to buy crypto. This problem clearly is a result of a lack of education on blockchain in the country. It is of course true that a lot of people have used crypto in fraudulent activities and thus reserved banks want to take certain actions to prevent continuous issues like these. However, I don't think that's the right solution instead, it's education. The populace needs to be educated in order to have their level of vigilantism raised. This is one of the major challenges that the Grow Africa, Grow Cardano challenge setting seeks to find solutions to as far as the wide-scale of Cardano is concerned. \nScouting for solutions, I think one of the critical solutions is what this proposal provides. The idea of targeting students, developers, and business personnel is definitely going to yield a great impact. For instance, if business personnel are able to understand the Cardano ecosystem through this event, then Cardano will start receiving a boost in business proposals. The same will go for the rest of the target group and it will be a marvelous impact.\n\nI strongly agree that this proposal effectively addresses the challenge and hence my score of 5.", "q0r": 5, "q1": "With the identified problem, the details provided in this proposal are feasible for a successful implementation of the described solution. The team provides the community with links to verify their profiles and expertise. This is great and the various profiles confirm to me that indeed the team has the requisite expertise. The proposing team knows in an identifiable manner the type of team members needed to aid in successful implementation. This has helped them assign roles to those with the requisite experience and I think this will save them the headache of who's doing what during the implementation even though they indicated that the team will collectively act as the organizers of the event.\nThe budget statement makes sense and its breakdown convinces me that it will be enough to ensure a successful implementation. The fact that the team has consulted agencies to provide a clear budget and as well made room for contingencies certifies that the team is aware of the cost needed for the successful implementation of the project.\nThe proposing team does well to provide a conductible plan. Even though it may look broad, it is understood exactly what would be done and by whom, and at what time. \nThe team also indicates that it would need some round of funding from Catalyst to ensure that the adoption rate of Cardano in South Africa is being boosted and this is essential for the community’s expectation in subsequent funds to come.", "q1r": 5, "q2": "From the roadmap of the project, there are clear milestones that can be tracked by the community. For example, the bookings to be done by the team in the first few weeks, the marketing and mini-workshops, etc are all milestones that the community can look out for in the project's progress report. Also, quantifiable metrics that help to define the success and the impact it would have on the community have been provided and I give the team credit for that. At least they have some sort of clear performance indicators to help them assess their performance and further advice themselves for subsequent iterations.\nThe team does well by informing exactly how the community can track the progress of the project. This will save the community the hassle of moving from one document to another all in the name of finding progress reports on the project and hence increase good use of time for productivity.", "q2r": 5, "assessor": "z_assessor_2518", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4053, "q0": "This proposal has strong synergies with the campaign. Through the event they are planning to promote, the proposers will be able to disseminate knowledge about Cardano and blockchain. As a consequence, they will onboard new Africa-based users onto Cardano, increase the number of African developers onboarded and enlarge the number of Africa-based catalyst members. That in turn has the potential to produce local partnerships and incentivize the creation of proposals offering solutions to infrastructure and education issues, for instance. Additionally, the metrics described in the proposal firmly align with the challenge settings goals. The number of attendees in the event promoted, number of people onboarded to project catalyst and number of new wallets created are exactly what the campaign is aiming for.", "q0r": 5, "q1": "This proposal is promoted by two very powerful and active initiatives in the Cardano community: Catalyst School and Wada. Besides them, four people are described in the proposal, Kaelo, Nana, Richmond and Bernard. Only Kaelo and Bernard do not have LinkedIn pages but they have other communication channels. Anyways, the four have relevant skills whether related to education or computing and blockchain. The budget is clearly outlined and it is broken down into identifiable items. The final amount requested is a little excessive but I understand they will build a high-quality event. The only suggestion I would make is if they could replace the presenter from Accra as the transportation cost from there to Cape Town accounts for 32.5% of the total budget. Moreover, the time horizon of two months chosen is very reasonable and realistic as it is enough time to prepare all the arrangements for the event. Finally, the two risks raised of attendance and inflation are indeed the most relevant. But their mitigating solutions should be enough to alleviate the problem if they actually turn out to be a burden.", "q1r": 5, "q2": "The roadmap provided is straightforward and very organized. They divide it in three parts, the days leading to the event, the day of the event and the days after the event. There are milestone and relevant steps in each of the phases. Before the event, for example, there is a lot of preparation to be done such as book of catering service for snack preparation (it is important to have as an extra incentive to promote higher attendance), marketing of the event and preparation of the presenters and the presentation itself. The KPIs defined in the proposal are well-thought and align with the challenges of the campaign. They are, for example, number of attendees, number of people onboarded to the Cardano ecosystem and number of new Cardano wallets created. By the use of a clear and well-structured presentation the proposer was able to provide an understandable and effective solution to the problem of lack of visibility and adoption of Cardano in Africa. Lastly, the team has provided channels to keep the community updated regarding the progress of the project (Wada YouTube channel, project catalyst monthly report and social media like discord and telegram).", "q2r": 5, "assessor": "z_assessor_2513", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 3868, "q0": "The idea of ​​​​the proposal has identified part of the problem to be solved for this challenge, but the scale of the project's impact is so large that we can extend it to many different areas. conditions are the same around the world. The growth of Cardano and Catalyst in the last two years has been very strong in other regions of the world, Africa has always been a key place in the heart of Cardano that needs to drive growth from day one, as it is still in its infancy and has many difficulties and idiosyncrasies of this region, not only in South Africa but network consolidation and expansion must be done in other parts of Africa.\n\nThe impact of this project is quite large, the solution of this proposed idea is huge, it identifies almost every problem to be solved in this challenge, in addition to the author's argument through a realistic description. reasonableness, clarity and completeness. A great event that reaches a wide audience: South African students, business staff and developers first organized by the team to spread awareness about Cardano in the South African region, where they can get information Useful news from Catalyst and Cardano is a simple but extremely effective way The idea, having no less than 100 participants show up at the event, will be the first steps for Cardano to gradually become a reality. more popular in the country, setting the stage for other events to take place shortly.\n\nThe project has detailed description of some implementation risks, in addition to some suggested solutions by the author to overcome them, but the community needs to be informed for more solutions to these problems. . That risk if the Scheme funded. Besides financial risks (related to disbursement, inflation) and technical risks, the author needs to list more things that could affect the progress of this proposal if it is funded and implemented as follows: Human resource risks (long-term with the project or ignore it), necessary personnel to implement the project, and macro risks such as political instability are almost universal. Of course, in Africa, the author needs more solutions to limit those risks.\n", "q0r": 4, "q1": "The proposal to introduce unclear and detailed work implementation timelines compared with limited implementation resources will affect the project audit process. The proposal only estimates the project completion time and the goals achieved in general, the community needs a more detailed implementation plan corresponding to the implementation timeline, the author can refer to the Microsoft Project tool Management (or a similar tool) to support a more detailed and methodical schedule.\n\nThe project budget required less than 20% of the total funding of this challenge, compared to the information provided by the project, all expenditures for the project were clear and explained very clearly and transparently. White. The budget analysis table is quite complete but needs more details, in addition, in my opinion, the author should watch out for price slippage, which is when the price of ADA at the time of proposal and the time of disbursement. Consider the project. The feasibility of this project is quite good when the human resources to implement this project have been assigned specific jobs for each item, and the experience of the members shows that it is completely suitable for the project. In addition, the members' identities are easily verified using the links listed above. The scheme is very clear, complete, and transparent.\n\nThe author of this project is Kaelo Lentsoe: Blockchain Education Network Ambassador in South Africa, with associates Nana Safo: University Ambassador for Wada and Blockchain Education Network (BEN) in Ghana, and Richmond Oppong: Richmond is a graphic designer with over 10 years of experience, Bernard Sibanda: BSC Computing, BTech Education, MCP, Plutus Pioneer, along with support from Wada and The Catalyst School, shows that this is an experienced team. like LinkedIn, Telegram, Twitter, Email ... for the community to verify identity easily and practically.\n", "q1r": 4, "q2": "Project transparency is very good, this project provides KPIs for accomplishing project goals, all goals are easily measured thanks to the indicators provided by the project, and they are also easily tested in an implementation. Indicators like: (<= 150) actual attendees, around 100 attendees should join Project Catalyst, (<= 75) new Cardano wallets to be created (Yoroi, Nami, CC Vault), and metrics This can be easily checked through the Wada YouTube channel or the various community channels on Discord and Telegram.\n\nThe scheme has clearly defined success, the information from the scheme shows what is being done and how it is being done and testing has achieved considerable initial success which is amazing. With https://www.wada.org, the community realizes that what they are doing is good and effective for Africa, the success of this proposal very much depends on the experience and reputation of the organization this.\n\nHere's a brand new take on this challenge, recommended by an experienced Catalyst author.\n", "q2r": 5, "assessor": "z_assessor_2489", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3393, "q0": "Boosting Cardano is a goal to get it adopted by more people and be adopted for use by different community groups, developers , businesses and corporations.\nThis proposal intend to realize that by organizing a community event on the Cardano blockachain and the project catalyst to students, businesses, public officials and developer, which aligns with the challenge objectives, under few topics: Number of new Africa-based users onboarded onto Cardano (wallets, platform sign-ups)\nNumber of new Africa-based Catalyst members (proposers, voters, CAs)\nNumber of new African projects seeded in 2022\nNumber of African developers onboarded in 2022", "q0r": 5, "q1": "This proposal is based on the pervious one submitted in Fund-7 by the same initiators. Their previous experience in the past cycle and the feedback they got from the community (PA's) have provided them with some elements to adjust the current application.\nMost proposers team members are well involved in the project catalyst on various roles, and some have knowledge in programming, computer technology, marketing.\nThis application is also backed up by the WADA and the Catalyst school, 2 organizations full of expertise to support initiatives and projects initiated around the Cardano ecosystem. And for this proposal it's an asset.\nOn another note, the target group is the students in South Africa, but on this It would have been better to be more specific about what university the team is focusing on, even though it'll be in in the city of Capetown.\nSince the goal is to have more people onboard the catalyst, some incentives activities would have been to undertake during the event, for instance, organize the raffle of prizes in ADA (5 to 10 prizes).\nThe breakdown of the budget is reasonable and clear and also  putting aside $1000 contingency cost is a great strategy that may help to cover budget costs  in future due to inflation.\n", "q1r": 4, "q2": "While the problem and solution presented through this proposal align with the challenge objectives, the outcomes and indicators are well defined and are demonstrated by the KPI's cited, including the number of event attendees, number of people involved in the catalyst ecosystem on different roles, number of new developers working on the cardano blockchain.\nThe progress of the implementation would be followed by the community through the catalyst monthly report and other platforms.\nAll this demonstrates how auditable this proposal is, and I think  the rating should a 5 star", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2091, "q0": "This proposal responds well to the challenge as it wants to accelerate the adoption of Cardano and Project Catalyst in South Africa. An appropriate outreach event where South African students, business personnel, and developers will feel welcome and learn about all they would need to know about Cardano and Catalyst on the basic level. Aside from education, participants will have the opportunity to interact and communicate with the tutors and themselves. The proposal also outlines what topics they will focus on in education. I find that extremely positive. The proponent, in addition to explaining what he is going to do, provides a lot of details on how it will be done. This solution, if successfully implemented, will increase the number of South Africans (especially students) interested in the development of the Cardano community, thereby increasing the number of participating catalysts, the quality volume of Project Catalyst projects coming from this region.", "q0r": 5, "q1": "The proposed roadmap is very detailed, several periods are defined and with them, we know the activities to be developed in each phase. The proponent listed the necessary work to be done within an identifiable period. The budget is also very detailed, $27,410 is requested and we know very well what these expenses will be used for.\nAnd finally, about the project team, This Project is supported by a collaborative effort from a group with a wealth of cultural and technical experience in the Cardano community as well as in Africa: WADA (https://www. wada.org/). All team members are very active in Catalyst, and in this project, WADA acts as a project supervisor along with The Catalyst School (which was created to enhance the impact of the project). Catalyst in general by improving the contribution of all its different players and roles). Now talking about the project members: Kaelo Lentsoe, Nana Safo, Richmond Oppong, and Bernard Sibanda we are provided with a lot of information about these 4 members, we know their roles in the project, their field of activity, and experience as well as the relationship with Cardano. In addition, members' LinkedIn profiles are also provided through which we can verify the information they describe. It conveys complete trust in the team. For all the reasons above, I think the feasibility of this project is great.", "q1r": 5, "q2": "This part of the proposal is perfect, I think the project is highly testable, the community can track the progress of this project through the Catalyst Project Monthly Report Board and the Wada YouTube channel next door It is also shared with the community through various community channels on Discord and Telegram. Proposals provide us with KPIs that can be used to measure the success of progress, such as :\n-Estimated (<= 150) actual attendees.\n-Estimated number of attendees (>= 75) should be introduced to the Cardano Development community.\n-An estimated 100 attendees should join Project Catalyst to contribute to a variety of roles...\n And about the result, the success of the project is mentioned as having a strong network of university students, developers, business staff, and government officials from South Africa, where ideas get discovered while educating them about Project Catalyst and getting them involved with the Cardano ecosystem by becoming a Community Advisor and submitting highly rated Catalyst Proposals. It is estimated that after 3 months at least 100 individuals in South Africa will attend the event and know about Cardano and Project Catalyst and some of them will sign up to be part of the Cardano and Project Catalyst community. It can be seen that the success criteria and metrics are very well implemented. I am very much looking forward to the success of this project, hoping that it will be approved by the community. Good luck", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 8468, "q0": "The proposal's stated goal of hosting easily accessible events for students, developers, to learn more about Cardano and Catalyst is in line with the objectives of the challenge. South  Africa is a potential developing center for the Cardano ecosystem and Project Catalyst, though the adoption rate in South Africa currently is low. The idea is to organize a suitable outreach event where students, and developers from South Africa can understand the fundamentals of Cardano and Catalyst. Besides learning, participants will also get the chance to talk to the instructors and one other. If accomplished, this project will enhance the number of catalyst participants and the quality of Project Catalyst projects, both of which will be to the benefit of South Africa and the Cardano ecosystem. The solution is clear and comprehensive because it meets all of the requirements of the challenge.  The benefits to the Cardano community are evident, and this framework has the potential to be expanded.", "q0r": 5, "q1": "This proposal is quite specific on the time period and the strategy has been given in an excellent manner. The crew has already meticulously planned out the events and activities that will take place. The budget that is discussed in this proposal is given in great detail with logical items, such as the charges for organizing, presenter incentive, marketing, administration. The requested budget of $10,200 was given in a straightforward manner, with a clear explanation of specific items to assist the community in performing a comprehensive audit of how the funds were being used to fulfill the request. In addition, the core team members' LinkedIn profiles and any other relevant references that were requested were supplied by the team in order to demonstrate the individuals' respective levels of knowledge and experience in the relevant fields. Wada professionals with years of industry expertise and extensive professional connections make up the team. It is commendable that The Catalyst School is a part of the team, as this helps to ensure that the proposal will be well-suited for successful execution. In addition, the proposal discusses the two risks that may arise during the execution of the project. These are referred to as attendance and inflation respectively.\nThe outbreak of covid-19 in South Africa is a further concern that, in my opinion, ought to be taken into mind. There are still new cases appear in the country and it could bring difficulty for the team to organize large events.\nOverall, my conclusion is that it is probable that this proposal will be successful.", "q1r": 4, "q2": "This proposal includes a detailed road map that specifies the important metrics that are necessary for comprehensive auditing by the community. The team delivers a clear idea of what should be expected about audits based on the information that is supplied under the roadmap and key metrics of this project. In the proposal, various metrics, including the number of actual attendees, number of new wallets, and number of followers and viewers, are used to evaluate the event's level of success. Additionally, the team has many options for the community to easily keep track of the work through the various community channels on both Discord and Telegram. These community channels can be accessed via multiple means.\nIn conclusion, the auditability aspect includes a lot of specifics, and the key performance indicators that were established are reasonable and feasible.", "q2r": 5, "assessor": "z_assessor_2985", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 13831, "q0": "Boosting the Cardano adoption rate in South Africa is an effective way of addressing the challenge. Events can expand outreach of newcomers and widen our horizons as a Community and also be very successful for consolidating dynamics and social interactions within our Community members. Getting the chance of meeting tutors and developers might be really inspiring for South African students, entrepreneurs and developers. This would help fight against reluctance blockchain technology and projects usually awake in the wide audience. Knowing there are real people doing real things behind numbers and blockchain can be an exponential boost for South African interest in Cardano blockchain technology. It might be more than a productive educational instance, a first impression that might draw in the attention of a wider audience within the South African community.", "q0r": 5, "q1": "As this proposal enjoys mentoring from Catalyst School and Wada and given the experience and presented plan it is highly likely to be implemented successfully. Also it is to highlight this is an improved version of the unfunded proposal they presented at Fund with advice and suggestions from members of the Cardano Community. Continuous work on the same problems is always fruitful and inspiring. Images shared of previous outreach events guarantee that this team knows how to put up high calibre events. Nevertheless, the roadmap and budget breakdown are consistent and clear. ", "q1r": 5, "q2": "Project Catalyst Monthly Reporting Sheet and the Wada YouTube channel will be the platforms where this proposal will be tracking their progress. Publishing the recorded version of the event and opening a Twitter space for discussing experiences and impressions will be of great interest for the Cardano Community, as to gather data and audiovisual content for further events and outreach strategies. This team already knows Cardano Catalyst dynamics and as their strong alliances with Wada and Catalyst School is to expect that the information they have already provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Boost the adoption of Cardano and Project Catalyst through a grand outreach event for university students, developers, and business personnel in South Africa 🇿🇦.", "experience": "The project will be supported and mentored by Catalyst School and Wada with the goal of boosting the Cardano adoption rate in South Africa.\nThe beautiful images in the attachment section of the proposal confirm our experience and past successes in terms of events and outreaches."}