{"id": 420235, "author": "makdavid92", "title": "Gateway of blockchain-Learn to earn", "url": "https://cardano.ideascale.com/a/dtd/420235-48088", "category": 26600, "amount": 4450, "description": "Students are mostly motivated by incentivized Learning system. Therefore, how do we provide a learn to earn platform that would help onboard them into the Cardano ecosystem.", "f6_no_assessments": 7, "f6_rating": 4.428571428571429, "videos": [], "media": [], "f6_assessments": [{"id": 6131, "q0": "The team proposes to develop an incentive learning platform to reward participants for learning Blockchain and learning different concepts in the ecosystem. to provide a learning and monetization platform for them to participate in the Cardano ecosystem. Ghana on the African Continent has a population of 32,381,607 (in 2022) with more than 50% of the population using the internet, a growing economy. However, the young population lacks interest and knowledge about Blockchain and related cryptocurrencies, and has misconceptions about Blockchain. solution that provides web-based, standardized and easy-to-understand video lessons about Blockchain and the Cardano ecosystem accessible to all young people. The course content will cover many areas: Blockchain, Cardano, NFT, Dapp, Dao… At the same time, the incentive program will be divided into 2 types: education-based incentives and referral-based incentives. . And finally, the marketing strategy. The team proposes a clear solution, the group establishes a vision with short-term and long-term goals, explained in detail. This proposal aims to provide the young Ghanaian community in Africa with a platform to learn, earn and participate in the Cardano ecosystem. Impact on the challenge posed. At the same time, the proposal presented challenges and solutions to minimize risks when the project is implemented.", "q0r": 5, "q1": "Proposals provide us with background information for evaluation. First about the route. The research team said that the project implementation lasts in phase 1. And the project implementation will be carried out in 3 phases. We are told that the project will start phase 1 after being funded. But why only phase 1. While the team has provided information that the project will be implemented in three phases. The team can explain in more detail: Once Phases 2 and 3 are done, how to plan all the work that needs to be done, or suggest another project to do phase 2 and 3? We know what will be done in phase 1 with a period of 1 to 2 months. and jobs are analyzed by week. The team explains phase 1 will take 1 to 2 months. That's 4 to 8 weeks. However, the team only provides job information for 1, 2 and 3 week periods. In this regard, the team can provide more detailed information and timetables. Example: The project will be implemented when it is funded. The jobs are arranged by week, i.e. which week of the month (1 to 2 months). A clear detailed roadmap will increase the probability of the proposal's success. Next is the budget. Proposal asks for $4,450. This is not a very high amount and has been clearly explained. We know how the budget will be allocated, what work needs to be done in the project. In my opinion, the proposal will need more budget to ensure the sustainability of the project (when the detailed roadmap of works). Finally, about the team of team members. The team introduced us to each team member and a short presentation about each of them and attached some links so that we can understand more about their background, past and present work. their. we know the group has 3 members, their identity, ability and experience. In general, the overall plan is feasible but not high, the roadmap can be improved in more detail. I will take 1 point in this section.", "q1r": 4, "q2": "The team paid great attention to this part of the proposal. The team provides a lot of metrics so we can measure the progress of the project. The team will deliver and report on their main social media channels and online pages. One positive thing is that they will provide reporting for Cardano social media channels (WhatsApp, Telegram and Youtube). about the end product is the success of the project, what we expect is success in this project. Open Blockchain portal for students (learn and earn) and develop Cardano. Since we have a lot of information provided and explained in detail, it is easy to make an audit transparent", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 6, "ne": 3, "ng": 1, "nfo": 2, "vca_o": 1}, {"id": 13572, "q0": "The proposal is about using incentives learning platform that reward participants to attract many people in all walks of life in Africa to participate fully into the  learning of cardano blockchain to increase the adoption of rate in Africa. The proposal's key metrics and goals of creating more awareness on the cardano blockchain Network, highlighting the potentials and the opportunities within the cardano ecosystem, onboarding more students into the Cardano community, by providing a general knowledge of the Cardano ecosystem so that each member can decide where to get involved and contribute, as a PA, VPA, voter,Drep or a proposer clearly aligns with the challenge setting. Issues related to multiple accounts can potentially affect the proposal from accomplishing the designed goal of the project. The proposal is critically thought to be executed to contribute to the growth of the blockchain in Africa. The proposal clearly resonate with challenge and it also addresses the challenge effectively. ", "q0r": 5, "q1": "The proposal has detailed information on the proposer and his team involved in this project and they have the experience and relevant skills required to implement the proposal. The budget is reasonable to achieve the set goal and the budget is broken into identifiable things which is recognised to be needed to accomplish the proposal successfully. The plan of the proposal is well designed in such a way to be able to tackle future challenges and the timeline for the proposal is also well structured. Given the experience and plan presented it is highly likely this proposal will be implemented successfully. ", "q1r": 4, "q2": "The proposal's progress will be tracked down by making frequent reports to the community on the various activities in the project.  The success of this proposal will be measured by the number of student trainees, the number of students who visit the page, the number of students on boarded and the number of new cardano wallet account created. Using channels and social media will keep the project in check. The information is sufficient to audit the progress and the success of this proposal. ", "q2r": 5, "assessor": "z_assessor_3696", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 14997, "q0": "The idea is excellent. First we need to be honest when it comes to getting involved with the crypto world, people are often afraid of losing their money – be it traditional currencies or cryptos; Blockchain is poorly understood and lack of public interest, generated precisely by fear of financial loss, is a problem that urgently needs to be resolved. So the proposal suggests that modules be created with classes that deal with basic issues about blockchain (it is positive that these topics are already mentioned); by attending classes and completing blocks, say, submitting assessments, students would receive a reward of about 15 adas per block (at least I understood it that way). That is, there would be an economic incentive that will certainly enhance the involvement of the target audience. The proposal serves well the objective of both popularizing Cardano in Africa and benefiting its local inhabitants, as introducing them to the cryptographic environment can generate positive fruits and opportunities.", "q0r": 5, "q1": "The script is great! We know what would happen in general in the months and also what would be done in the specific weeks, so we have a very solid view of the project development process. The total amount requested is very fair and it is also explained in a clear way, it could be explained a little better about, for example, how the graphic design would be built, the price of the designer's work, etc. And the part of the team is also perfect, we have a lot of data about those involved, their resumes, training, jobs, the way they are presented, a lot of confidence is transmitted. For these reasons I believe it to be a totally viable proposal.", "q1r": 5, "q2": "It is said that the metrics of partial success will be disseminated through social media and several examples of what is expected in the course of development are also cited, numerical data such as the amount of students who visit the page, who create accounts, who attend classes, integrate and etc. Here we have the expected partial success notions (“Train at least 30 students, Expected number of students viewing the page - 50 At least 10 students on board in the Cardano community, Create Cardano wallet accounts for at least 10 students” and etc) . And about the final success, what is expected in the short and long term is explained – my only suggestion is to clarify the means of communication on how these more in-depth researches would be presented to the Cardano community. However, the topic is as good as the previous ones.", "q2r": 5, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15052, "q0": "This is a pretty good proposition, clear, and easy to understand. The idea is not new, but the proposal is different about setting up a Learn to Earn website that publishes videos to teach students Blockchain knowledge, has a good incentive program, and attracts members. If this proposal is successfully implemented, the number of young people in Ghana, Africa who know Cardano Blockchain will increase and create a community of PA, VPA, dRep, Vote, and young developers for Cardano. The Impact Proposal corresponds to the Challenge requirement. One point that is very appreciated is that the proposal poses a problem and offers a very logical solution, it seems that the proponent did a lot of research before writing this idea. The proponent also thinks about the short-term and long-term goals of this project, as well as risks and solutions to reduce risks when implementing this project. The risk presented is the user creating multiple accounts and execution budgets. The option to reduce risk is KYC and calling for more funding from other capital sources.", "q0r": 5, "q1": "The implementation plan is divided into 3 phases, and in Fund 9, the proponent wants to receive funding to implement phase 1. Phase 1 mainly researches content, prepares processes and documents, and designs the web. Therefore, the budget in phase 1 is only USD 4450, equivalent to 0.89% of the total Challenge budget, which is not a large amount compared to the work in phase 1. The proponent is very cautious in planning and implementing the project. There is a concern that with such a budget, will it be enough to implement the works in phase 1? For example, web design costs only 1500 USD for both interface and hosting. The cost of forming a partnership is also only 500 USD. \nAbout the development team, there are three members: teacher, developer and financier, and marketer. Members have enough experience to implement this idea. Contact information and Linkedin are also provided. This is a well-planned, well-informed, clear proposal.", "q1r": 5, "q2": "Roadmap with clear milestones. Quantitative KPIs measuring the success of the project are also evident. The KPI doesn't seem too high in the start-up phase (training 30 students, ten students joining the Cardano community...). The proposer will report project progress on the Cardano media channels and the project's online pages.", "q2r": 5, "assessor": "z_assessor_2578", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15054, "q0": "The team behind this proposal intends to develop a Learn-to-Earn online platform focused on Ghanaian students to attract a larger group of students into learning about Cardano and possibly incorporate them into the Cardano community. \nThe team has determined 2 possible risks to their project, yet I see another one: how to combat the unwillingness and misconception about blockchain. Is learn-to-earn a sufficient stimulant to bring students into learning and staying, or will only the financial remuneration attract them and as soon as the workshops are over, they will sell their rewards and leave?\nFor the most part, however, I find the scope of the proposal well thought out and absolutely in line with the challenge of Grow Africa, Grow Cardano. From the description of the workshop themes to the reward mechanism, I find the proposal to have a potentially positive impact on the Cardano Ecosystem, and as such I will score it a 5.", "q0r": 5, "q1": "The project will be lasting for a year and is separated into 3 distinct phases, the scope of this proposal being the first phase that will last for approximately 2 months and will deal with the research part of the project that will help determine the direction of the entire endeavour.\nThe main tasks of this first phase are the drafting of legal documents in coordination with legal experts, research of the content, website design and formation of possible partnerships. I find the last task of “Partnership formation” to be too short of a period, considering the task at hand, and as such, I would have assigned a longer period of 2-3 weeks, taking into consideration all kinds of unforeseen events and long replies when dealing with other people.\nOtherwise, the plan looks detailed and makes sense.\nIn regards to the budget and the team, I find that the information provided is also well articulated and I see no lack of detail that would raise a question.\nAs such, I find that the team and budget are well defined, and the plan for the most part is also well thought out, except for the last task, which could turn out to require more time than anticipated, but I do not see it impacting the implementation of the proposal too much.\nIn conclusion, I will rate this section a 5.", "q1r": 5, "q2": "The plan and scope of this proposal is developing the first phase of the project that is focused mostly on research, as the team has described it numerous times “This first phase is mainly research-based”. The budget is structured around research only, as well, but the auditability measures for tracking the progress of the proposal contain metrics that are related to a possible future phase of the project (the other two phases have not been described at all) when students are already on-boarded on the platform and start learning. But there is no budget set aside for this entire task, there are no incentives calculated, the team is not being paid for this part of the project, and the plan does not describe this intention at all, as such, I find the metrics and success definition provided to be completely irrelevant to the scope of this proposal. For the entire project as a whole, it would have made sense, but since this proposal is dealing with the research phase only, the metrics should be dealing with this part as well. For example, where could the community verify if the legal documentation is drafted, the website is being worked on or that partnerships are being done etc.?\nUnfortunately, the auditability section does not cover the scope of this proposal, in conclusion, I will rate it a 2 and hope the team will resubmit the proposal in a future fund with the correct Auditability section. ", "q2r": 2, "assessor": "z_assessor_2192", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15105, "q0": "This proposal aims to create a learn to earn platform which will help Ghanaians get educated about blockchain and Cardano. In a nutshell, they will incentivize people to learn these blockchain lessons. I think that it can work but I have some concerns. My first concern is that the incentive might not be high enough to attract people. $1,5 doesn’t sound like a great motivation, even in Africa. My second problem is that I cannot see how this can be sustainable. I mean where does the money come from? How are you going to keep funding this if there is no monetization scheme in place? Enough questions that are not clearly answered in this proposal. However I have to say that if the project works it should add huge value to the Cardano ecosystem and, at the same time help Ghanaians be more aware of the blockchain technologie and its benefits. I give 4 out 5 for the impact.", "q0r": 4, "q1": "The proposal is well written and the proponents have put a lot of effort into providing detailed informations about the project. They have a solid plan of 1 year which includes 3 phases which consist of project research, documentation, website design and partnership. I think that they have done a good job here. Moreover, the budget is broken down into identifiable items which are easy to understand. However, I think the budget of $4450 sounds too small for the project. I think that the proponents should explain how they can survive with this amount. Regarding the team, there are 3 people who have provided links to their linkedin profiles (one link returns not found). The only concern that I have is that I did not see any previous blockchain experience. I think that it would be helpful if proponents include their level of blockchain knowledge. Other than that, I think that the proposal can be implemented successfully.", "q1r": 4, "q2": "The proponents have provided a roadmap which lasts one year and we have discussed in the auditability section. Moreover, they have included some interesting key performance indicators such as the number of students trained, the number of visitors of the website, and the number of onboarded students. I think that they should add the amount earned by the student. Altogether, it’s a well thought proposal which is also well explained. ", "q2r": 5, "assessor": "z_assessor_2332", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15247, "q0": "Impact \nThe proposers look at developing a learning platform with provision of rewards as incentive for learning about Cardano ecosystem. \n\nThe solution is to tackle the lack of interest especially among the youths who due to misconception and misunderstanding of the blockchain technology coupled with the complexity of the ecosystem deter the youngsters to venture into learning of the technology. The attempt to arouse interest through workshops, meetups and town hall meetings gained no traction. This is an alternative approach to address the problem. \n\nThe means of achieving this is to create a website with video accessible to anyone using a hand phone and with an internet. There will be 10 lessons. Participants will sign in with an account and upon completion of each lesson, there will be an assessment and a reward of 1.5 USD in Ada will be given. \n\nThe 10 lessons stated are the entry point to more complex areas of the ecosystem with the ultimate aim of making the participants play active roles in the Cardano community. \n\nThe proposal will collaborate with Opportunity Summit, a platform that seeks to educate the Ghanaian student population on the Cardano Network.  They will also market and promote and create a community on social media, WhatsApp, Telegram and YouTube. \n\nThe proposers believe that this proposal will have impacts :\nCreate more awareness on the Cardano blockchain \nOnboard students into the Cardano community \nCreate opportunity for students to actively involve and contribute the Cardano community\nCreate a career opportunity in the blockchain industry. \nIn the longer term, groom  Cardano developers. \nEncourage adoption of teaching materials in the STEM classes. \n\nThe proposers consider following risks:\nStudents create multiple accounts to earn more rewards (use of KYC as a security measure) \nFunding may be limited. (apply for funding from organizations and request for donation). \n\nI understand the problem statement and am clear about their proposed solution. I also agree that the impacts which the proposers clearly stated will create on the Cardano ecosystem.   They are in line with the Challenge and the campaign brief that looks for creation of Cardano adoption, seed and grow future adoption.\n\nI do not know  who the Opportunity Summit is.  I am not provided with a  link. I couldn't find this platform in the Google search as well. I am not clear how the proposers are to make collaboration arrangements. What will the arrangement bring about to the goals of the proposal?\n\nWith that observation, I settle for a 4 to agree that this proposal effectively addresses the challenge. \n", "q0r": 4, "q1": "Feasibility\nDetailed plan and budget \nThe proposal talks about 3 phrases in their plan. Phase 1 will take about 2 months and will be embarked once funding is received. (The next two phases are for further funding. )\n\n2 weeks for registration of the website and getting legal advice /services. \nBudget USD 1000\n\n3 weeks for research on contents and target audience; gather information on resources and materials for educational contents, also collect data on target audience about reaching them when launched. \nBudget USD 550\n\n2 weeks on web design. \nBudget USD 1500\n\n1 week to negotiate and form a partnership. \nBudget USD 500\n\nMiscellaneous \nBudget USD 400\n\nTeam fees for administration cost\nBudget USD 500 \n\nTotal budget USD 4450 (representing 0.89% of the allocation for this campaign.) \n\nThe proposal team  consists of 3 members: \na teacher, education background, Fund 8 Community Advisor and a member of WADA\na developer, MSc in computer science & technology, founder of a web hosting company, skills in web design, software developer, computer networking and security \na finance and marketing manager, banking and finance degree holder, Fund 7 and 8 Community Advisor. \n\nAt least one of them is involved in another project in fund 9 and from previous funds. \nI had a problem at first, understanding why there is only phase 1 of the plan and phases 2 and 3 are missing. When I came down to the last segment of the auditability then I understood why. Phase 2 and 3 will be subject for separate proposals in the future funds. The write up of this proposal is about the whole project, phase 2 and 3 included. The plan and budget given here now are only for phase 1. Phases 2 and 3 are left out. I wonder what will the proposers do with this phase 1 if phase 1 is successful in bidding for the fund whereas 2 or 3, or both are not funded. Will this phase 1 plan be abandoned and so the whole project is abandoned? Will the whole project be delayed indefinitely? \n\nI also notice that the team members are involved in the projects from Fund 9 and from the previous funds. The work involved in phase 1 has a lot to do with research and gathering of information and web design which I think are time consuming.  I wonder whether the team has the time and resources to handle this proposal, although I understand that they have the capability to execute the phase 1 plan.\n\nThe proposal does not mention how to assess the participants on their understanding and on what basis. \n\nWhilst I understand the whole project would bring about a lot of benefits to the Cardano community, the above reservations have prompted me to settle for a 3, that I neither agree nor disagree that it is highly likely this proposal will be implemented successfully.", "q1r": 3, "q2": "Auditability\nProject progress reports will be made available for public consumption through Telegram and Discord. They are looking at these KPIs \nTrained at least 30 students \nExpected 50 students viewed the page \nOnboard at least 10 students into Cardano\nAt least 10 students take up Cardano wallet \nAt least 20 active followers of WhatsApp, Telegram and YouTube (combined?) \n\nSuccess stories have been told at the impact (how the proposed solution will address the challenge that you have submitted in). \n\nThey are reporting the project progress through Telegram and Discord.  The KPIs listed are, to me, more related to the success and which clearly are related to the whole project. The targets should have come with timelines to effectively measure the success. \n\nI should see the project progress of this proposal in line with the plan, but the progress is not stated in this proposal. \n\nWith that I neither agree nor disagree that the information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 3, "assessor": "z_assessor_2631", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Develop an incentivized learning platform that reward participants for learning blockchain and for learning the various concepts within the Cardano ecosystem.", "experience": "Combined 20 years’ experience in Software Development, Risk and Compliance, Research and Marketing expertise and Teacher.\nFund 7 and Fund 8 Proposal Advisors , one funded catalyst project and active participant in WADA events\nin Ghana."}