{"id": 420354, "author": "nzola8", "title": "Lokole to Grow Africa Grow Cardano", "url": "https://cardano.ideascale.com/a/dtd/420354-48088", "category": 26600, "amount": 48129, "description": "It is very difficult to grow Africa grow Cardano efficiently because less than 43% of the African population is connected to the internet and the majority of the people do not have electricity.", "f6_no_assessments": 14, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"id": 7642, "q0": "The problem described in this proposal is closely aligned with the challenge. The team has done a great job by putting the proposal at the right challenge. \nThe proposal clearly provides a solution to the problem that is fundamentally affecting the continent and preventing Cardano adoption in Africa through the provision of \"Box Lokole Numerique\" which to the proposers is an on/offline portable server device to bridge the digital divide. This will address internet connection, power consumption, and infrastructure space for more than 60% of students who can readily access Cardano over a long period of time.\nThe proposal also captured key important metrics under the campaign brief by mentioning how the equipment will be used to connect people all over the world over the internet which is very expensive therefore making it impossible for the youth to go online and take part in blockchain and cryptocurrency education at the comfort of their homes and participants of these value chain will go on to enjoy the full measure of knowledge on the Cardano ecosystem.\nThis I think is a game-changer, if it's able to be mass-produced in every part of Africa to reduce the cost of data and the cost of internet gadgets. \n", "q0r": 5, "q1": "The proposer has provided relevant links to members of the team who will help in the proper execution of the project if it is funded. The team lead is a professional electronic technician and technological enthusiast who has already developed workable prototypes across the sub-region with an able team who will assist him with developing a better model. \nMoreover, the proposer and team from the links provided have the desired skills and experience to be able to execute the project should they be funded looking at the amount of work that has already been put into its development. \nThe proposer has done well by providing a detailed budget, broken into identifiable bits, and making mention of how they are going to use the funds to execute the project. Each item was properly identified and costed. \nThe proposal also outlines the milestone by providing the duration with which the project will be executed highlighting building 100 Box Lokole Numeriques within 6 months which is feasible if all things are equal. That's the have the technology, know the materials which will be used, and have the technical know-how to develop the gadget.\nThe potential risk of this project will be how much cloud it can generate to compete with already existing brands in the market. The proposers have to undertake research into this part to establish a clear path of marketing and how to make it appealing to the ordinary African considering the price of the gadget. ", "q1r": 4, "q2": "The proposer and team have provided a clear outline on how to measure the progress of their project should they be funded.\nThrough their GitHub page, people can follow to get to know what they are doing and the project. \nAlso, Organizations in remote areas can send attachments to their headquarters instead of having to travel to deliver documents by hand and many others.\nMoreover, through consultation with the users of the Lokole device and email app themselves, people can interact with the device and learn how to use it efficiently. This is mainly because they offer several services on the gadget when are part of a general-purpose tool that can positively impact the lives of people in many ways in Africa.\nThey have provided key milestones as can be seen from the above and information on how success will look like should they be funded. \nThe proposer has also indicated how their progress will be monitored and reported to the Cardano community through constant updating on their GitHub, \n", "q2r": 5, "assessor": "z_assessor_2908", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1167, "q0": "The proposal addresses the challenge because it provides help to people in Africa, allowing them to have access to a tool to get connected to Internet. \nThe tool goes under the name of Lokole, and it has been improved via a previous Fund (7). \nThe Lokole tool provided email, online content for schools, without the need of permanent access to internet. \nIndeed, the Lokole device will connect periodically to the internet to update the contect that is available online on a cloud, by leveraging on existing cloud technologies (e.g. Send Grid). It is still not fully clear how the email would be send offline (does it need to be queued until the device is connected to the internet again ?)\nMoreover, the range of the device is claimed to be around 30 m., which is a quite poor range to serve a large amount of people. I would suggest to design a more powerful antenna for further developments. ", "q0r": 5, "q1": "This is a very simple proposal to describe and assess. \nAs stated in the section above, the proposal has high possibility to succeed because it has been funded in the previous fund and this proposal is to produce new devices and spread them to scale up the project. The funds will be almost totally dedicated to build the new devices, at a cost of about 480 USD (a 50% markup has been added to the manufacturing costs: is that to cover marketing expenses ?) \nThe team counts on experienced resources (for web development, project managers, electronics assembly) and a prototype is already up and running. \nThe future funds could also serve for amelioration of the device implementing new technologies on it. ", "q1r": 5, "q2": "The budget and the timeline are clear (construction time is 6 months). \nHowever, there is one uncovered cost/unexplained item:\nthe team is mentioned the kiosk to help people in using the Lokole device. But there is no plan to setup those kiosk, and no general explanation about the revenue stream coming from it.\nMoreover, it would be nice to understand if this project is going to be cross-country or just focused on Congo . ", "q2r": 4, "assessor": "z_assessor_2215", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3395, "q0": "Lokole is a device created to facilitate connection to internet and share of information by email. This may be used in areas for Internet connectivity is difficult  and/or unaffordable by the community members. This is mostly the situation of people  in many areas in Africa, being myself from that continent I know how challenging may be the access to Internet and electivity.\nBy providing means to access those two services, a lot of things may be done and it may be an opportunity for people and organisation that want to promote information around the Cardano blockchain and project catalyst, to be able to  do so.\nLokole would be a great device to help spread information about cardano, and it's, accessible, event to low income population since it's not expensive. It would allow some people to learn about cardano, others to onboard, and to expand some services that may be offered through the cardano ecosystem.\nThis would be another project around Cardano in Africa, which is one of the objectives of this challenge. My rating will be a 5  star\n", "q0r": 5, "q1": "The budget is succinct with a clear breakdown. It could have been important to have some contingency funds as the big part of budget is allocated to buy parts, and with the inflation price may vary at any time .\nThe team is involved in this project for long time and has experience with results tested with success. The only gray area would be how to well connect this initiative to be more useful for the catalyst project?\nHanding out 100 devices to people involved in catalyst community is a great idea, but what's the counterpart? I would see it being more impactful if those devices are handed to cardano community Hubs well identified, since those one's are already working with the  community, or and some Developers who are working on the Plutus/Haskell; with cardano students or community groups. These will be identified as points of relay for use of Lokole.\nI would rate this with 3 as even not being hesitant about the feasibility of the project' I still see it more successful if the collaboration and partnership is well framed around the project catalyst and cardano ecosystem.", "q1r": 3, "q2": "GitHub would be the main platform to be used by the community to follow the progress of the implementation. The KPI's as indicators of success have not been clearly described. They are presented like goals pursued other than practical indications of success.\nIdea on how to mitigate risks have been raised by the proposers, but I still see the challenge about the maintenance, especially for the devices that would be used in remote areas, far from cities, where expertise (technician) may be easily found.", "q2r": 3, "assessor": "z_assessor_2458", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3964, "q0": "I strongly agree to this particular proposal because bringing into a reality the lokole numerique on/offline device that will help in the bridging of digital devise is really helpful to the cardano community in Africa. How the lokole works as minimizing the consumption of internet Data is good because the economy level is Africa is very bad and not favorable for everybody to afford but there are many student and business mens that runs their staffs online and must need the use of internet data the proposal scales to address future challenges because the Box lokole numerique is the tool that resolves 3problems : Internet connection, Power consumption and infrastructure space for than 60% for the africa countries facing financial difficulties  can benefits form the device and this can grow the community and enthuse new members that will join the community.", "q0r": 5, "q1": "The team has provide links and webs needed to show the feasibility of the project, the team is focused on building 100 lokole’s numerique sun 6months that will be given to any catalyst community member as a sample is a great price to show the reality of the project if funded. Budgets are break down from the material cost to the Sam up cost of and the price of a single lokole Box that’s 481.29 USD with good team structure and full experience memeber but I think this is a hard work project so am questing if the team can add more member to help in the implementation of the project.  This project is a continuous one in Fund 8 cause I have joined meeting on the Africa catalyst team and ths particular project was discussed.", "q1r": 5, "q2": "There are roadmaps and milestones that show the implementation of this project if funded for and the device lokole is going to inspire many people in the rural areas that finds it difficult to get access to the internet because of the Data  purposes.. the team has stated a well solution to the Targeted  problems facing Africa in this Grow Africa Grow Cardano challenge.", "q2r": 5, "assessor": "z_assessor_2500", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 4054, "q0": "This is a brilliant proposal that aims right at the heart of the campaign goal. It is proposals like this that inspire the community. The proposer is offering an innovative solution to a unique challenge faced by the African continent. The lack of electricity and internet access to a relevant proportion of the population in Africa is a serious matter that can be tackled with the Box Lokole Numerique device. It enables people within a thirty-meter range of the device to access the internet in an affordable way. This in turn not only will enable more Africans to have access to Cardano educational content but also to actually use the Cardano network. The metrics used however are focused on the usage of the device and direct benefits they will provide to the people such as improvements in education, health and social issues. Instead, the team could have focused on metrics more aligned with the challenge settings. For instance, they could have set metrics regarding the dissemination of knowledge about the Cardano ecosystem.", "q0r": 4, "q1": "The team of four people is highly competent and have a lot of experience with electronics and software development. Moreover, they have provided evidence of their skills and past experiences through links to LinkedIn pages. The budget is composed only of the Box Lokole Numerique costs but despite that it is pretty transparent. That is so because the team has broken down the cost of each device in its components, manufacturing costs and markup. All things considered the total amount requested for the 100 devices is reasonable. Regarding the plan outlined, the timetable seems realistic but its description could have been more thorough. The team has only designed two phases and have basically listed the macro activities to be implemented in each of them. Instead, they could have explained in more detail when exactly each activity will be performed, in which order and how they intend to do them. Finally, the risks raised are very pertinent and the proposed mitigating solutions sensible. For example, for theft or damage they have designed the device with cheap parts and in a modular manner, this way maintenance is facilitated.", "q1r": 4, "q2": "The roadmap provided has a list of activities to be done but no clear milestones. The team could have at least written down what are the deliverables or outcomes expected from each phase. Additionally, they could have broken it down into more granular steps. The time horizons for each phase, however, seem reasonable. In terms of the KPIs, as mentioned before, the team could have focused on metrics more aligned with the campaign. The proposal could have defined metrics related to the dissemination of knowledge regarding Cardano and blockchain technologies, for example. Lastly, I would suggest them to provide a public channel to communicate their progress to the community enhancing the auditability of the proposal.", "q2r": 3, "assessor": "z_assessor_2513", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5774, "q0": "Africa is facing significant rationing of electricity and an offline device like Lokole is causing the change by living one behind in the catalyst space. This means communities without electricity become part to explore and get involved in familiarizing themselves with blockchain. \nThe proposal is aligned to the challenge with the focus on of ensuring everyone is able to get access to internet and participate in online workshops and read materials of the blockchain. This device could be a game change to for individuals with electricity or not. ", "q0r": 5, "q1": "A 6 month timeline to produce 100 samples with software and branding is a great deal to enhance a the growth of cardinal in Africa. The import part is to give it to the cardano community to test and use would drive testimonies to grow both the manufacturing of the device demand for it use. The timeline for successful implementation is a cute one and very promising. \n\nThe Budget for the manufacturing for the 100 device sounds good including the other peripherals. The team also look poised for their project and I think they would achieve success.", "q1r": 5, "q2": "The use of Github is a important and credible place to monitor progress. However, the proposal should state clearly the demand for the device and testimonies that should drive for more production. The proposal has no clearly stated metrics to help in auditing. \n\nThe expected impact and success had are been stated but should have made known how the KPIs could lead to that success. ", "q2r": 3, "assessor": "z_assessor_2749", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 5841, "q0": "From my standpoint as an African, I will say Lokhole is a brilliant and worth-the-fund idea. Internet connectivity is a major challenge. This difficulty cuts out a lot of people from the digital world and the world of technology. Not to even talk about places where electricity has not reached. \nLokhole's solution are fundamental indeed to this challenge. With this, brilliant young people who for the reason of electricity and internet connectivity have been cutout from the marvelous opportunities that tech world presents will now get connected. In addition, since it is a Cardano powered program, users will get to be educated on the opportunities presented by Cardano ecosystem and Project catalyst. \nThis proposal solve problems raging from illiteracy, to poverty and information dissemination. It is effectively addressing the challenge. \n", "q0r": 5, "q1": "The proposal indicates building 100 Lokole boxes in 6 months. The team has already worked on the project in a previous fund and that is assurance enough that they can deliver within the stipulated time.\nThe proposers indicate with timelines the activities that would be undertaken from ordering if materials, assembly and marketing and that is great. \nExperience and skills of the team members relevant to this project is detailed by the proposers. Links and attachments are given as evidence to the relevant experience. \nThe possible risks are stated and the mitigation plans are brilliant. \nWhat I wish would've been included is how to make Lokole affordable for the average African in deprived communities since a single box will cost like $481.29.\nThe Budget is well written. I think the requested amount is reasonable. The proposers do indicate they will come for more fund later. The reason given is justifiable, that is, for equipment upgrade to keep up with growing Technology. \nThis proposal will be successfully implemented if funded. ", "q1r": 5, "q2": "To track the progress and impact of the proposal, the proposers have indicate number of sign ups, feedback from users through surveys, feedback from ambassadors among others and that is good I think. What success looks like has been outlined for easy auditing. In all I think this proposal is auditable. ", "q2r": 5, "assessor": "z_assessor_2754", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6604, "q0": "This proposal aims to solve one of the most difficult challenges to address if what we, as a community, want Africa to develop by the side of Cardano. The lack of means to access connectivity is a huge barrier to accomplishing this, but the proposer states that there is a temporal solution. The solution consists of a device that “minimizes the amount of data that is required to be transferred over an available internet connection which thereby reduces the cost of bandwidth on users and allows them to combine monetary resources to achieve better economies of scale when purchasing bandwidth”. The footprints the proposal can leave will set off the spread of Cardano and Blockchain across various African countries so they could be later provided with full-data connectivity. This is why this proposal is absolutely aligned with the challenge settings. The team also provides a detailed risk management report, which seems to be realistic since it is based on actual facts that could possibly happen. (Rating given: 5)\n", "q0r": 5, "q1": "The team is formed by experienced people in different areas who have large careers in the field which this proposal is aiming to help. They provide evidence of their expertise in tech-related topics, which is crucial if what they are looking for is to provide African people with access to connectivity. A roadmap is also described, where it is specified that the team plans to reach their goals in a 6-month timeframe. The roadmap is realistic and it is time-limited, but at the same time, it provides the team with a sort of flexibility so that they could be able to solve any type of problem during the course of their tasks. Regarding the budget, it is clearly broken down since it consists of the prices of every component of the devices, but it could have a little more detail related to where these values come from. (Rating given: 4)\n", "q1r": 4, "q2": "The team also provides a series of ways to measure not only the progress of the project but also the impact it will make in people's lives. They propose ways to directly communicate with the beneficiaries so that they can get feedback and then act according to it. Measuring the number of people using the devices and doing several surveys will help the team and also the community to check and track the progress of the project. Each installation of a device could be counted as a milestone accomplished, which is another way to do what it was mentioned before. (Rating given: 4)\n", "q2r": 4, "assessor": "z_assessor_2822", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6864, "q0": "The proposal fits the challenge as it provides the solution to spread awareness about Cardano to remote and unconnected to the internet population of Africa (over 60%) and make the cost of data affordable. It could also help to solve a big number of socio-economic and educational problems.\n\nThe idea and plan of implementation are clearly described with attached links and presentation and give a good insight of the solution of the stated problem.\n\nProposer considers 3 key possible risks for the project and provides easy and logical actions to mitigate them.\n\n Shared ownership and use in public places of the Lokole hardwear will not only prevent damage and theft but also will give access to the bigger number of people. Technical solutions for security and data privacy and possible cellular failures as well as battery powered indicate safety of the software and usability of the device.\n", "q0r": 5, "q1": "The proposal target is to build 100 Lokole hardwear within 6 months and give them as samples to the Cardano community for testing. The plan of development is divided into two stages ( the duration of each is 3 months) and consists of detailed milestones, which give a clear understanding of how the proposal is going to be implemented. \n\nThe budget of 48129$ looks realistic. The detailed breakdown shows the costs of materials, production and market price. \nThe team is highly qualified and experienced to deliver this project successfully, besides it has been already running in Kinshasa in the DRC. This leaves no doubts in the capacity of the developers.\n", "q1r": 5, "q2": "Proposer provides sufficient metrics to measure the progress as a GitHub page, amount of created accounts and activity, a digital email-survey among Lokole users and tracking economics of this business-model and its impact for the local community.\nVersatile methods of quality assessment will give a complete vision of the success of the project and its impact on the life of society.\n\nThis proposal is a variation of the project  funded in previous F7. This speaks of successful implementation and promotion of the idea which definitely aimed to improve many aspects of social life and strengthen Cardano in Africa.\n", "q2r": 5, "assessor": "z_assessor_2840", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8362, "q0": "The proposer's idea of bringing Internet to the areas where there are no network stands out in its own unique way. This is going to be a major change in the lives of many people who are based remotely and away from the internet and online social life. The proposer is supporting a social cause in developing the country and needs to be supported to do such an amazing and impressive project. The proposer has addressed the challenge in a very effective manner and has also understood the project very will and the representation of the proposal is very impressive without any flaws and deserves to be implemented. The key metrics mentioned the proposal are realistic and aligns with the goals of the proposer and after implementation the proposal can be scaled world wide to help a lot of other people who are in need of such a good initiative.", "q0r": 5, "q1": "The proposer has provided several links of relevant skills and experience needed to support their proposal and has also mentioned about their team members which is commendable but the only thing they have to take care of successful implementation is whether the people in remote areas will be able to afford the communication devices to link with the Lokole integration device. The budget is outlined clearly and broken down into identifiable individuals and is very much reasonable to achieve the goal. The time schedule proposed to implement the plan seems to be realistic and will meet the goals in the proposed time. The proposer has mentioned and foreseen almost all the difficulties or challenges they might face during the implementation of the proposal and is ready with the solution required for them as well which is very impressive. ", "q1r": 5, "q2": "The proposal is very effective and impressive and the information provided can be audited from time to time to note down the progress and the success of the proposal. The proposer has provided a clear outline of the roadmap with milestones and the time intervals required to achieve the goal which is realistic and has also pointed out several key metrics which will define the success of the proposal. The proposer seems to be very well versed in the subject and has all relevant resources to complete this proposal successfully and has provided a description of the targeted problem clearly and has mentioned the solutions to the targeted problems which is commendable. I feel this proposal is going to be successful and the success of the proposal is required for the improvement of many lives of the people living in such remote areas and shall have a global impact. ", "q2r": 5, "assessor": "z_assessor_2976", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8912, "q0": "There is no way cardano can grow without digital connectivity , hence to set up the device which is portable and will be an offline server is a great idea, where it can be even charged with solar power to power up the batteries.\nThe presented plan helps not only to develop the cardano eco-system it will even help people to improve the lifestyle of the people, the presented box \"Box Lokole Numerique\"  will also use the bandwidth provided most efficiently and in most distributed manner, which also help African people to reduce the cost over bandwidth, it has even good range to maintain the wifi where community people can enjoy the data efficiently. Hence his proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer has proven experience where he has built \"Box Lokole Numerique\" successfully ,The idea of setting the up the device where people are denied of internet can be achieved easily, the main task here is finding the right places and transporting the device,\nThe setting up of device is also easy where it just needs one click to on , and then user nearby can get connected to it easily and now he can register his device on the browser.\nThe device even uses the bandwidth in most efficient way which will help people to reduce the cost over internet , where data cost is very high in Africa, with the device ready already and with proven experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has displayed the proven experience of the proposer from fund 8 , the audit has even introduced other teams that will be involved in the project and their experience and passion towards development of the project.The proposal has mentioned each step in proposed solution how he's idea will help to counter the problems of African people.\nThe presented plan has detailed budget breaking system to make the project more efficient and it even,the proposer even wants to get connected to the students of Africa and help them to complete the project .With decent timeline provided information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9982, "q0": "The information given in this proposal, I believe it addresses the challenges, the introduction of the lokole box is to connect the unconnected people to the digital world and we all know that it is good for the people that is living without knowledge about Cadano ecosystem to also get much information or equipment to help them access Cadano and other block chains wherever they are in Africa or outside Africa. It is believe that people living without the Internet can access Cadano trade with the help of the lokole box. This will also help them to learn much about computer and get more opportunities, I greatly recommend that,if the proposal if funded,the team has the experience and knowledge in technology to help achieve the success of this proposal. Also if this proposal is funded it will lead to the success of Cadano ecosystem set goals ", "q0r": 4, "q1": "Showing the experience levels of the team, I believe it is greatly likely that the proposal will be successful when funded. The proposers have also taken time to draw to the time schedule for the training days and ways to help the people sign up for Cadano ecosystem, also the activities stated and the budget drawn shows that the proposers have what it takes to help spread Cadano ecosystem to the people who don't even have access to the internet. Also the experience level of the team shows the capabilities and interest of them to help spread Cadano ecosystem to the blind world thus people living without internet and has never heard anything about Cadano. I believe the stated experience when this proposal is funded it will lead to success, this is why I think it is a good proposal. ", "q1r": 4, "q2": "The information given is enough to strongly and quickly grow Africa and grow Cadano to the people who don't have access to Cadano or internet. Also the knowledge and experience level of he proposer in technology will be another way to help teach people that don't have internet service with much problem, the time schedule for the first 3 months be greatly inspired and lead to success of this project. The lokole box wi help grow Africa and grow Cadano ecosystem. This is why I think it is a good proposal ", "q2r": 3, "assessor": "z_assessor_3140", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 14031, "q0": "The Box Lokole Numerique is actually a very good initiative that could lead to a massive Internet access increase in Africa, which combined with education materials about Cardano could lead to an interesting growth of Cardano too.\n\nA good thing is the solution is ready and working, minimizing risks of unsuccess of the project. The project overall is well designed with risks well addressed. However, it could be more interesting if the 100 units of Lokole would be given to Cardano Catalyst community members from Africa as the aim is to grow Africa and grow Cardano out there.\n\nAdditionally, it would place the proposal in an even higher level if there was a cardano wallet application integrated among the Lokole apps, in which transactions would be realized when Lokole gets to Internet. That would definitely make Cardano grow even higher out there.\n", "q0r": 5, "q1": "This a mature project and it is reflected on its feasibility. The breakdown of tasks is well balanced and seems pretty reasonable in order to produce 100 unit of Box Lokole Numerique. In the same way, the breakdown of costs is well described in the level of component prices, which is very important for the cost traceability of the project. The fifty percent markup was observed and in the first place it sounded a lot, but if we keep in mind the company works out at Africa it is reasonable to think it needs to take some profit in order to increase their operation, growing their company, but also contributing Africa to grow as well as Cardano.", "q1r": 5, "q2": "As mature project the team behind the Box Lokole Numerique prepared themselves to track some important KPIs in order to asses the growth of their system, such as monitor the increase in number of boxes, e-mails, active users, surveys, etc. Such information will help them to assess the health of the product and also they will receive some feedback which will be keen in the evolution process of Lokole. \n\nSomething I missed in their well-structured project are ways to measure their impact on Cardano ecosystem and that is definitely something which could be improved (maybe count the Cardano related courses finished, Cardano transactions made through Lokole in ase they integrate a wallet in future, etc). That said, the project is pretty well structured and will definitely have impact on Africa growth.\n", "q2r": 4, "assessor": "z_assessor_3872", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14303, "q0": "The 100 Lokole wireless access point and server units will be distributed for free exclusively within the Cardano ecosystem. This provides a tangible benefit to the device operators, and incentivises continued participation in the Catalyst Community.  The endemic barriers of powering, environmental hardening, and Internet backhaul challenges are addressed in the proposed project’s implementation. Further, the data model utilized by the system will keep costs low for end-users who might otherwise be left out.  Removing this barrier to entry is another incentive for operators that contributes to their success, encouraging continued involvement with Cardano.", "q0r": 5, "q1": "Each critical component in the system has already been field tested and benefits from a real-world deployment, suggesting the technology is already proven in a harsh environment with different sources of power and RF distribution. The off/online web and email interface is a novel approach to leverage off-peak data rates, making access affordable to low-income end users.  The units will be provided free to operators, eliminating their startup costs which greatly encourages project success. The timeline is reasonable assuming no supply-chain delays, and the team has proven skills given prior deployments. The budget is also reasonable for the parts listed, though some additional detail around how the 50% markup is used would be helpful along with details on how the back-office costs (Azure, Sendgrid, etc.) fit into ongoing operation of the Lokole.\n\nPrimary risks are detailed along with sufficient mitigation plans.  Specifically, security is stressed in the stated design and operation, and additional funding will be sought in future funds to keep up with changes.  If maintenance access and patching is part of this initial effort, then that should be described along with those related costs.\n", "q1r": 4, "q2": "The team proposes methods to solicit success metrics from end-users, and the use of github to aggregate issues and resolutions of operators.  Other measures are listed for volumetric measures of success like account creation. However all of these measures happen after the 6 month period described in the project timeline.  They will show the eventual success of the project after launch, but since the funds are specifically for the first 3 months obtaining the parts, planning and marketing, and the second three months of assembly and testing, then there should be a method to measure and report progress against these milestones as described in the proposal.", "q2r": 4, "assessor": "z_assessor_3963", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "We built the proven solution to Grow Africa Grow Cardano. We call it; \"Box Lokole Numerique\" An on/offline portable server device to bridge the digital divide. It operates on Battery and solar power.", "experience": "I am a professional electronic technician, born and raised in Africa, conducted many radio communications projects in many African countries.\nA Group of Open Source developers, software engineers, coders and electronic techs using Python, Microsoft Azure, Flask, GitHub, RPI."}