{"id": 420525, "author": "oswald", "title": "Crypto and blockchain adoption", "url": "https://cardano.ideascale.com/a/dtd/420525-48088", "category": 26600, "amount": 50000, "description": "For Africa, cryptos and the blcockchain represent a great financial opportunity. But users lack tools to buy, sell, exchange, learn, build... Tools adapted to our realities for easy,healthy adoption.", "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1109, "q0": "- The proposal has a great impact in Africa because it proposes an easy and comfortable way to exchange fiat money for cryptocurrencies, to this we must add that the project is already underway, that is, it does not start from scratch, points are deducted from the proposal because it does not it is clear how he intends to incorporate lines of business in Cardano.\n- 19% of the requested budget is aimed at injecting capital into the exchange; recruit and train people 14%; advertising and physical communication 18%; beta releases 15%; final releases 10%,... and only 5% are destined to \"Continue the development of the ecosystem on the CARDANO blockchain\",", "q0r": 3, "q1": "- The project is already underway and there are several financial components that will contribute to the development of the proposal, but it does not indicate whether these products are created in Cardano.\n- I recommend that for future funds the work plan be better detailed\n- Although many countries do not have regulations for the use of cryptocurrencies and the forms of exchange; the project indicates that they are preparing to address legal and regulatory issues, however it does not specify how it will be addressed\n(*)I recommend that you consider the possibility of implementing ATALA PRISM to strengthen the security regarding the identity of the people who currently use KYC", "q1r": 3, "q2": "The indicators are reasonable even though they are not quantifiable; I recommend that the indicators be established based on an example number: x new users in y months; x new products in y months.\nBy having subjective indicators, it will not be possible to adequately measure progress, much less success.", "q2r": 2, "assessor": "z_assessor_2199", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3396, "q0": "people may be interest to the Cardano, hold ADA and stake it, but if there,s no a mechanism  for them to convert it into local currency, it'll still be a challenge for the. Especially in Africa, ,where the banking system is still limited.\ncreating an exchange adapted to the African financial environment would be very helpful, which is the case for this proposal.\nIt take into consideration the use of the mobile money, knowing that the mobile phone is very popular in Africa, even among the rural population.\nThis initiative would increase the number of proposals offering solutions to infrastructure and education concerns in Africa as for people to be able to use, they'll also have to learn, and there's training section on the exchange.\nThe proposal totally aligns with the challenge objective.\n\n", "q0r": 5, "q1": "The proposers team is comprises by people with a background in software development, digital solutions, blockchain and financial technologies.\nThey have already created the exchange and is operational. The goal of initiators is to improve the platform and add liquidity, while hire a large team that would be working on the project. This is already a sign that there is chance of success for this project as the basics are solid enough.\nThe originality of this platform is that operations may be done through the mobile money, which so popular in Africa and very familiar to a lot people, and also user-friendly technology.\neven though the chance of success of this project are high, the application has been to the project catalyst with main goal to promote the cardano ecosystem. But reading through, I don't see where the proposers put an emphasis to the ADA or cardano. It's important to have that so the community can feel that the funds allocated to the project will have a real impact to the ecosystem.\nThe budget in detailed, but some sections should be detailed with labor cost in time duration for each action item.", "q1r": 4, "q2": "KPI's and the roadmap are detailed, while the progress may be followed by the team through the Exchange (BRYO Exchange).\nRisks are taken into consideration and plan to mitigate has been mentioned.", "q2r": 5, "assessor": "z_assessor_2458", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4403, "q0": "The team intends to build an exchange that accepts mobile currency payments, which is considered an investment and development tracker and a blockchain-based e-learning platform. This is an effective and necessary solution when the team determines the problem is that currently in Africa, there is a lack of tools to buy, sell, exchange, and learn. That's the problem the team identified that needed to be solved. I think that if the problem is solved by this proposal, it will have a great impact on the lives of the people of Africa because cryptocurrencies and blockchain are great financial opportunities for everyone. If successfully applied, this proposal will improve the economic life of the people of Africa - which is considered a less-developed continent compared to the rest of the world. As such it directly adds value to the Cardano ecosystem, and with this massive impact, it can scale and tackle future challenges. Electronic exchanges have not only a strong impact in Africa but also have an impact around the world. Many see this as an opportunity for great economic growth. This is a good idea, I have identified its importance to the economy and life of the whole of Africa. I agree - vote 5 stars.", "q0r": 5, "q1": "Through the presentation in the proposal, I see that the proponent has experience in the field of blockchain, interface design, web editing, communication, etc... These experiences are very valuable and suitable for making the proposal feasible. What I like about this is that the members of the team have made their identities public via social media links (Linkedin, etc...). This is very convenient for the community to look up to and know each member, thereby increasing the prestige of team members and the feasibility of the proposal. The budget details are broken down by categories and reasonable with the goal, the team clearly stated the cost to create BRYO Xchange, the cost of launching the BTerminal & BFinance versions, plus a bunch of other activities. I find this very reasonable to show professionalism and expertise when performing the work of the team. This detailed budget analysis is essential to determine the feasibility of proposals. If Catalyst has not yet received funding to implement the proposal at Fund 9, will the team continue to intend to implement this proposal? The plan and implementation method were clearly stated by the team, quite specific, step by step in chronological order. Along with that are the necessary resources to implement. Regarding human resources, I want the team to name other members behind implementing the proposal. I know that your company has been operating effectively in the past 2 years, exists and develops with its strength, proving the human resources to perform is important for the community to recognize the feasibility of your company. offer. If there were only 3 members, it would not be possible to implement such a large electronic exchange proposal. That's my advice to increase feasibility. The team did not make any proposals in parallel with this proposal at Fund 9, which is favorable for the team to concentrate all its human resources to solve the problem. In summary, the team should list as many people as possible who are involved in the proposal and project when funded. In terms of engineering and technology, I believe that the team with developers of software and Blockchain technology can complete this complex job well. My opinion is that the team can hire more outside experts to complete the job in the best way. Reaching out to the experts out there, and hiring them to work for me is also something that I think is good because it's a way for us to access the best people in their fields. . The team outlined the risks and challenges involved. For example lack of staff, competition on an international basis, or government restrictions on operations. I am particularly concerned about the issue of government permission in the operation of electronic exchanges, I recommend that you research this carefully before implementing the proposal. Clarifying the risks of the snail challenge and providing solutions proves that the team was very well prepared for the feasibility of this proposal. I strongly agree with the feasibility of the proposal. I vote 5 stars.", "q1r": 5, "q2": "The team raised milestones in all the steps of the proposal. I was pleased by what the team did in creating milestones and integrating them with the budget breakdown. Presenting the specific month and year at the milestone is essential for the team to increase the transparency and auditability of the proposal. The team has done this well, creating favorable conditions for the community and the PA and being able to make a quick assessment for calculation. I feel sorry for the transparency of the proposal when the team does not provide KPIs and key metrics. I suggest that the team should add to the proposal these two important indicators because it is a necessary tool for the community to rely on to verify the transparency and auditability of the proposal. That's my positive advice. For the rest, I am very pleased with how the team has successfully defined an Africa that uses crypto in all activities, in all fields (in French). Achieving this success takes time and effort on the part of the team and the community. I believe it will be possible in the not too distant future. Throughout the proposal, the problem was clearly described with a solution. I completely agree when you guys make this clear. After all, I'm just waiting for the addition of KPIs and key metrics from the team. I vote 4 stars.", "q2r": 4, "assessor": "z_assessor_2552", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11395, "q0": "The evolution of blockchain applied to supply chains has been mapped from the inception of technology, utilising primarily public data sources. Analysing blockchain projects on parameters such as their inception dates, types of blockchain, status, sectors applied to and type of organisation that founded the project. Shift of market interest from private companies to public companies and consortia and change in blockchain adoption from Ethereum to Hyperledger. Building an exchange that accepts payment by mobile money, blockchain based learning platform is an ongoing development to our roadmap. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The project plan includes timeline and key milestones which has improving communication, advertising, marketing and face to face training and achieving weekly transactions and paying trainings to current team continuing development of ecosystem on Cardano blockchain. The project has detailed budget breakdown which is reasonable to achieve set goals. The proposal offers realistic timetable to complete the work and provides a sensible and conductible plan for implementation. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by keys including number of active users on each product, transactions on tools, training courses followed on blearn, smart contracts deployed on BTerminal. French speaking Africa understands and uses cryptos other blockchain derivatives in several fields of activity in payment with ease. The plan describes the resources necessary to implement the proposal and has considered challenges and risks relevant to a successful implementation.This information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 13574, "q0": "The proposal is about building an exchange that accept payment by mobile money, investment money tools and others to enhance the African Market on cardano blockchain. In order to mass influence the youth and the people of Africa to involve in blockchain to become Africa adoption leader rather than a perpetual follower,  there is a need to interact with them with things they are very clear about and understand( example is mobile money). About 87% of the population in Africa uses mobile money (e-money) for their daily transactions. So building an exchange to include mobile money will lead a big percentage of people in Africa to immerse themselves fully into cardano blockchain because through mobile money they will find cardano blockchain familiar and simple. The proposal is aimed at making it possible for cardano blockchain to be trusted in Africa. This proposal resonate with the challenge setting and it also seeks to increase the adoption however the inadequacy of staff is a problem which needs an immediate response. ", "q0r": 4, "q1": "The proposal has a clear outline on the plan and the timeline. The proposal will be advertising about cardano blockchain to increase their readiness for the blockchain. The proposer and his team have experience that is relevant to undertake the project successfully. The budget of $50000 for this project is sufficient and reasonable. The budget is also broken into identifiable things.", "q1r": 5, "q2": "The proposal has detailed information about the project which will track down the progress of the proposal however there should be reports made to the community about progress which will ensure an easy going and sure success of the project. The expected number of users on each tool, number of training courses created and others is some of the definition of success of this project. ", "q2r": 4, "assessor": "z_assessor_3696", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We have built an exchange that accepts payment by mobile money, a blockchain-based e-learning platform, an investment tracking tool and other ongoing development according to our roadmap.", "experience": "We are a fintech specialized in software development, digital solutions, blockchain and financial technologies with +2 years of experience. The current level of development of our project without outside help is proof of our qualifications."}