{"id": 420551, "author": "wims", "title": "WIMS Cardano Girls Education", "url": "https://cardano.ideascale.com/a/dtd/420551-48088", "category": 26600, "amount": 22553, "description": "Girl education in Africa is very low due to poverty, cultural gender preferences, religious beliefs and due to lack of resources. Cardano lacks firm roots in Africa and worse lacks utility value.", "f6_no_assessments": 10, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 462, "q0": "This is beautiful proposal, but it was quite challenging to dissect for the readability was a bit hard. Word of advice to proposers, for future iteration, please do take more notice on readability, perhaps further attending Catalyst School workshop would be beneficial. Please understand some of the Proposal Assessors go through around 100+ submissions. It is quite a taxing job and we take our efforts very seriously.\n\nWith that said, this proposal seeks to empower women to be able to code on Cardano. The extent of the capability of their coding though is limited only to have created wallets (I assume creating an account and not a wallet itself), moved assets and learn about IT security and cryptography. The intended outcome of this proposal is low. From what is explained it does not actually provide applicable skills to build on Cardano.\n\nIt would seem that this course is only a basic introduction into Cardano although the proposer has gone into lengths to explain the syllabus that they would design. There is a confusing disconnect between the weight of the program and the intended outcome.", "q0r": 3, "q1": "One of the proposer have a strong background in education, specifically related to Cardano for they are graduates of Plutus Pioneer cohort 1, 2, and 3. This is very impressive for there are numerous reports on the difficulty of this program. The drop-rate is also high for the Plutus Pioneer program. Graduating from 3 cohorts itself deserves a massive round of applause.\n\nThough from what is stated in the proposal it does not translate well into a comprehensive and understanding action plan. The proposer attempts to address simplifying the Plutus Pioneer program so that it can accomodate newbies of Cardano. The simplified syllabus only goes for 1 (one) week. From what I understand, this course is extremely hard, and to be condensed into only 1 (one) week of training is asking the students and the educators too much.\n\nIt would be best practice prior to launching this program and it's syllabus, to first have a test-trial within the Cardano community. For there is a community that has developed a syllabus to educate on Plutus in a project based learning system. This project based learning system is created by Gimbalabs, and to my understanding it is open-source. Even if the proposer is reluctant to use Gimbalabs materials, they can collaborate with Gimbalabs to find insights that perhaps can ease the work of the proposers. ", "q1r": 3, "q2": "From the information provided, there are many holes that need to be addressed. Some of these holes I have gone over lightly in my assessment above this.\n\nFrom my understanding, there might be a chance of oversimplifying the education material learnt from the Plutus Pioneer program. This can be detected by the output expectations of the students participating in this program. From what is shared, the students will have limited applicable skills to build on Cardano, for they are only expected to produce 2 (two) smart contracts. It does feel like a stop and go program where although there is effort to address continuation, there is not solid plan on it.\n\nThe proposers also although consider the risk of having no/limited number of students due to the prerequisites to attend these classes. There is limited effort to explain in detail how to mitigate this. Which is key for it effects their main metric of producing 100+ girls that can create smart contracts.", "q2r": 3, "assessor": "z_assessor_2088", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3209, "q0": "The impact of the proposal is clear and compatible with the challenge and Catalyst’s goals. On the other side, the proposal gives an extensive list of risks that it might face, but they didn’t consider a very common risk in such ideas of clubs and courses tailored to a certain group: the risk of not having enough students enrolled or the high chance of drop out. Anyone who has experience with educational programs is aware of this issue. Therefore, foreseen the main risks involved and representing them in the proposal would make it stronger in the impact section.", "q0r": 4, "q1": "This proposal leaves open one question, that is how will they make sure that they will be able to reach their targets? To assess the feasibility of the proposal, it would be necessary to have a contingency plan in case they don’t have enough students interested or fully participating in the clubs. In addition, the budget has some unclear points. For example, the proposals say that they require 13500 USD for a “3 Girls support Materials and Incentives”. However, the proposal does not explain what are these incentives, nor why it applies only for 3 girls, if their target is more than 100. And this part of the budget is more than half of total budget. Therefore, the execution of the budget and the plan could be improved if they provide more details on what was pointed above. ", "q1r": 3, "q2": "The information about the metrics to follow up the project and to measure its impact is missing in the proposal. Instead, in the section that asks for them to indicate what will be measured, the proposals have inserted information about the timeline. The proposal has no KPIs clearly indicated, which makes it difficult for the community to audit it. It’s advisable that the team provides clear indicators to measure its progress and also that they explain how they will measure them. Taking this issue into account, a score of 3 is appropriate, as this is the main aspect of the auditability in the assessment. ", "q2r": 3, "assessor": "z_assessor_2409", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5775, "q0": "The proposal is aligned and within the parameters of the challenge to see cardano go beyond 2022. Setting up Girls clid on a cardano is a great opportunity for ladies in the universities to explore for new ideas on the blockchain. Having ladies with smart contract being launched on the cardano blockchain in the medium-term would be a beautiful milestone for the community.\n\nThe solution of the problem is vividly explain with interesting background description of why girls are important in growing the  cardano ecosystem. The team showed how this proposal would benefit the cardano community. ", "q0r": 5, "q1": "The team has great experience to deliver and prepare the girls for them to be trained in the plutus language. Looking at the team, they do have the quality and credibility to ensure success. \nThe team has also put together a comprehensive step by step approach and timelines to guide the flow and implementation of the project. The activities are simple to follow, and showing the number of girls at each stage that could benefit. \nLooking at the team intend to achieve for the African girls, the requested budget is reasonable and fits into the implementation plan. This depicts that the information provided is sufficient to help in a successful implementation of the proposal. ", "q1r": 5, "q2": "The proposal has not expected KPIs and metrics to measure the outcomes of the proposal.  This would be difficult to audit the proposal's progress by the community. The team is to train 135 girls and at the number of people that could complete the program and number of participants demonstrating profound understanding of lessons taught would make the proposal easy for auditing.\nAgain, I did not see any sustainable plan to continue this important initiative apart from coming back to catalyst for more funding. \n\n", "q2r": 1, "assessor": "z_assessor_2749", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7643, "q0": "The problem described in this proposal is closely aligned with the challenge. The team has done a great job by putting the proposal at the right challenge. \nEducating Africans especially girls using Cardano ecosystem tools and strength brings value and need to Cardano and the  community.  \nCardano community will benefit in the long term adoption, it will also become a kind of utility for communities to develop especially women who will directly benefit from Cardano ecosystem. Moreover, teaching of subjects like finance, math's, IT and science will boost the adoption rates and bring on board parents, schools and  countries under the Cardano ecosystem. The benefits to girls will  be enormous and provide them opportunities for further skills development under the Cardano ecosystem. The proposal also captured key important metrics under the campaign brief, the goals of the proposal align with the outlined challenge by mentioning some of the key values participants (girls) will bring on board to the Cardano ecosystem.  \nAnd, the proposal is able to scale to address future challenges with respect to girls education using Cardano. The proposal clearly describes a plan for the project's future and its sustainability.\n\n", "q0r": 5, "q1": "The proposer provides evidence that is references, links, and web addresses of relevant skills and experience of key personnel who will be involved in the project if funded. One important element about this proposal is that the proposer knows the type and number of team members required to implement the proposal and the proposal and team from the links provided have the desired skills and experience to be able to execute the project and this is commendable about the strength of the team.\nFurthermore, the proposer has done well by providing a detailed budget, broken into identifiable bits and know how they are going to execute the project should they be funded. The proposal also outline the milestone by providing duration with which the project will be for \n funded and the potential risk of the project has been included such as Project mismanagement, funds abuse, funds hacked etc. \n", "q1r": 4, "q2": "The proposers have provided a roadmap with milestones and a clear time horizon for achievement which mainly involves \nto train and certify 45 girls every month. With that, the second and third will be a repetition of activities of the first week but with new group of girls.\nA Well-thought out Metrics/KPIs that is, train 45 girls every month for three months consecutive. \nThe proposer have stated and describe the targeted problem which is facing girls who are not empowered and need to be trained with employable skills that they can use later to explore and develop further the ecosystem. At the end of the project there will be a Group projects and presentation (expo) measured against the proposed outcomes at the beginning of the project. Also, at the end 135 girls will have graduated with certificates and their success will be shared on the various social media networks across the Cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_2908", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 11651, "q0": "The problem describe in the proposal related to it's right challenge, so the proposal team has done a great job by placing it in its right challenge. The proposal in it's effectiveness address the challenge and has the potential of bringing values to the Cardano ecosystem and communities in Africa countries by trying to introduce Girls education and education African especially girls using Cardano ecosystem tools and strength bring values and needs of Cardano to communities and their attention become less obsessed with crypto volatility with misconception that block chain is only a financial technology, should they be funded.\nThe proposal clearly provide a precise solution to the stated problem by giving reasons for the approach such as Woman have great influence on children and targeting girls is in foot building strong roots for growing Cardano for many years to come and I strongly believe they will do a great job should they be funded.\n    The proposal team has also done well by capturing some of the important key metrics measure under the compaign brief such as Cardano community will benefit long term adoption, will have utility for communities, women directly benefiting from Cardano ecosystem,etc, which addressed the challenge in the Cardano ecosystem and I strongly believe they will do a great job should they be funded to execute their project.", "q0r": 5, "q1": "The proposal team is able to provide relevant links and details of team members who will help in the execution of their project and I strongly believe they have the Desired Skills and experience to carry out their project should they be funded to execute their project. Furthermore, the proposal team is able to outline the breakdown budget funds on how it will be used should they be funded to execute their project, which I strongly believe is commendable.\n    To add to these, the proposal has done a great job by outlining some risk challenge that could prevent them from executing their project and able to navigate solution to overcome them should they be funded to execute their project. In view of these, the proposal has done well by providing a detail plan including timeline and some key milestones to deliver their project should they be funded which I strongly believe they will do a great job should they be funded to execute their project.", "q1r": 5, "q2": "The proposal team has done a great job by indicating the measure to track their progress through, training, Evaluation, practice and feedback of their project should they be funded to execute their project and I strongly believe they will do a great job should they be funded.\nMoreover, the proposal team also did well by indicating how their success and progress will be monitored and report back to Cardano ecosystem through communities involved will know WIMS Cardano and service they do should they be funded to execute their project. The proposal is able to indicate that they will return to catalyst Cardano ecosystem should they be funded. The relevant and description of the key milestone and key metrics make me strongly believe that the team will do a great job if they are funded to execute their project.", "q2r": 5, "assessor": "z_assessor_3264", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 11677, "q0": "The proposer and team members have done a great work.  The proposal effectively addresses the challenge.  The goal of cardano and blockchain is that proposers should be able to identify issues preventing the adoption of cardano in Africa and also get new African based users on boarded.  Furthermore the proposer has done a great job by outlining how important the female education is and the influence it would bring on cardano if considered . I believe if cardano must get more African users on boarded then we must stop been biased when it comes to gender because we believe some things are meant for the male gender and not the female and because of this mind we have deprived the female gender from actively participating in some issues such as cardano blockchain.  And if more users must be on boarded,  the we must learn how to mitigate this problem of which the proposal have dealt with into detail . I trust that this proposal would be fully funded so that we can meet our key metrics on the campaign brief. Furthermore every set goal of the proposal clearly aligns well with the outlined challenge settings of which is a plus to the proposer. The proposer also did well by scaling to identify future challenges that needs to be solved as long as the future of the cardano ecosystem is concerned.", "q0r": 5, "q1": "The proposer have outlined  a detailed plan to carryout the project if funded and I believe planning is the roadmap to achieving anything.  The proposer also did so well by putting a time line to achieving the goals of the project which already suggest diligence in work if funded. Furthermore, the proposer also provided a budget and has been able to break it down which reasonable in achieving the goals of the project in fully funded because I  believe resources would not be wasted since the proposer understands what is needed to complete the work. Also some relevant skills and experiences such as teaching provision of girls support incentives which is needed to successfully implement the project were clearly outlined which is a plus. Finally I would say that every project requires well resourced persons and the proposer did so well by carefully selecting team members for the success of the project if fully funded. ", "q1r": 5, "q2": "The proposer has provided a roadmap with milestones and a clear time horizon for achievement for example the proposer stated what number he dreams to achieve at the end of first month and has divided the work into weeks and also does reviews at the end of each month to see if the aim will be achieved before setting out for the second month which is a brilliant work.  The proposer has provided well thought out metrics that define the success of the proposal . For example the proposer stated that that at the end of the 3months 135 girls should have graduated and known how to create Pluto's and contracts on the cardano ecosystem which is a good thing. ", "q2r": 5, "assessor": "z_assessor_3265", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 11907, "q0": "The proposal is about promoting girls education in Africa their by creating cardano firm roots and increase its utility value. As it is trying to establish different types of clubs like math, Finance ,Haskell, Plutus, small contracts development etc for girls in schools, community and online, it will promote girls education and social and economic development in the country and also further cardano adoption by respective governments and thus it is aligned  to the challenge statement.\nThis proposal will have an immense impact on girls opportunities for getting high end paying engineering jobs and entrepreneurial ventures because WIMS-Cardano aims to train girls to be productive practical problem solvers using Cardano strengths in today's high-tech world. \n\nThe proposal has clearly outlined the cardano tools and training materials which will definitely help in external cardano growth and providing platform for Plutus pioneer talents to practice, produce, and grow and thus this will help in Africa and world to have skilled Cardano engineers. \n\nThe proposed solution will lead to long term cardano adoption and growth in communities. In addition to this it will also contribute in expanding cardano talent pool along with adoption of future coming inventions and thus it clearly enunciates how it will add value to the cardano ecosystem. \n\nIn my opinion this proposal will not just influence the growth of Africa and growth of cardano but also this will break the stereotypes against girl's pursuing engineering, math, science careers. This solution will lead to generate skilled cardano engineers in Africa and in the world. \n\nThis proposal will benefit not just it's WIMS-cardano community but also catalyst and cardano community and of course Africa as it will reduce poverty and unemployment in the long run.\nAll the mentioned key metrics and goals of the project are well aligned with the challenge statement. \n\nI found it interesting that the proposal has clearly specified all the possible risks that could prevent the project to execute in the planned way however, there are solutions provided clearly for all the possible risks which shows their ability to scale to address future challenges. \n\nHence I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposing team is qualified to carry out the  feasibility study laid out in the proposal. I believe the proposer's team is an apt combination because there are members like one with expertise in technical area ,one with expertise in finance, accounts area and the other one in  Education Training and Development.\n\nThere is brief description of all the core team members that include their name, experience and their LinkedIn profiles which helps me to give conclusive opinion that their experience and expertise will ultimately help them in  executing the proposal .\n\nThere is a very detailed plan provided in the proposal. The plan and the time frame is stated for 3 months on weekly basis with the tasks to be completed. The ultimate target is to train and certify 135 students within 3 months which looks doable.\n\nThere is budget breakdown provided. The mentioned budget is reasonable and divided into identifiable sub categories of tasks to be undertaken which is justifiable. The proposal may return for the funding after this project only in case if they don't get any further funding from schools and universities.\nThere is a brief discussion on risks and solutions which strengthens the teams credibility in understanding the project. \n\nTaking into account all the above facts I strongly agree that this feasibility study proposal is highly likely to be completed. \n", "q1r": 5, "q2": "This part of the proposal is clear and objective.\nThe team specifies in great detail what expected outcome would be like so we clearly have a lot of content to track and monitor.\n\nThey provided a clear road map and milestones which is clear and achievable. This also helps in checking deliverables and performance in an easier and simpler way. The metrics and KPIs described will help for auditing the performance and checking the success of the proposal . \n\nIn my opinion what would need to be done would be that the team should participate in some town halls so that they can get some assistant with the delivery of the project and it helps in ensuring the project remains on the track.\n\nApart from this everything else seems to be clear. The problem and the solution is clear and is in alignment with this challenge. The deliverables are declared clearly along with the delivery time.\n\nConsidering the above facts I strongly agree that this proposal provides sufficient information to audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_3312", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12967, "q0": "The Proposal focus on empowering the women in Africa , By providing the education about the cardano ecosystem , By making clubs and providing them resources like how the smart contracts works , By training and monitoring and rewarding the girls which will increase their interest . The project will engage the schools , Colleges and universities by opening the girls clubs \nWhere they will compete against each other . \nThe proposal likely to solve the problem statement . The proposal have made a complete flow of works which is interesting and likely to be successful . The approach to the problem statement looks good and according to proposal the within 3months the a some of the girls from the girl-club will enter into the \ncardano ecosystem which seems interesting by this the girl is not only getting educated, but the education is leading the Africa to get rid of poverty . ", "q0r": 5, "q1": "The proposal has given a complete guide to how the problem can be resolved including timeline and key milestones for delivering your proposal .\nIn 3 months 135 students are certified .\nThe timeline is pretty accurate and but can be increased/student because the students may find hectic . Other then that the approach is top notch and The budget breakdown is good explained everything perfect and we can clearly see how funds can be used . The team looks very experienced and have proper approach , the proper description of the team member is given with the links of their works . \n", "q1r": 5, "q2": "The proposal has given proper audit like how the to track the project's progress, and how the progress can be measured in which they proposal has mentioned that 45 students are trained in every month .135 girls will have graduated with certificates of attendance after 3 months training and will know how to create smart contracts using Plutus and Marlowe on Cardano blockchain .\nThe success of the proposal may lead in educating the students which increases their employment and which leads to decrease in poverty , and they can have gender equality and quality of the education will be increased. By looking the approach and audit of the proposal and with great experienced team the proposal will have a high success rate .", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 13836, "q0": "Educating and funding female projects is the most groundbreaking initiative we can fund as a Community. If we want to make social and economic transformation, we have to work and empower African women.They are the real unleashed potential. When empowered women will be creative, efficient and transparent newcomers for our Cardano Catalyst. Women grow with a cultural barrier that prohibits us to really develop our intellectual and rational thinking. Getting women into the blockchain technology universe is the biggest social and economic transformation we can enhance. Nevertheless, we should be careful with funding projects that try to only profit from these noble causes. The website and audiovisual content this team shared looked unprofessional and poorly designed. The proposal does effectively address the challenge but further information might be requested in order to guarantee professionalism and real engagement with the problem to solve. ", "q0r": 3, "q1": "Team experience is wide in the financial universe but poor or non existing in social entrepreneurism. This might be a big flaw in this proposal. Social entrepreneurism is a whole different world from the finance universe with different rules and challenges. In order to successfully implement the presented plan this team should develop strategic alliances with social targeted organizations and experts. The enormous challenge of educating women should never be taken lightly. Given the information in experience and plan presented it is highly likely this proposal won't be implemented successfully. Big structural changes are needed in order to improve the proposal and deserve funding from our Community. ", "q1r": 2, "q2": "This proposal has not presented any auditability or communicational channel or tool for the Community guarantee. The information provided is insufficient to audit the progress and the success of the proposal. If funded, this team has not provided any way or shown in this proposal presentation any interest in demonstrating progress in their working development. Big structural changes are needed in order to improve the proposal and deserve funding from our Cardano Catalyst treasury. ", "q2r": 1, "assessor": "z_assessor_3833", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 14256, "q0": "This proposal seems to be very interesting, because I believe that through the project the identified problem will be solved in its various points, mainly and of great relevance, two central points of the problem, which would be to improve education with new opportunities and projects, spreading Cardano and the Catalyst community at the same time\nFrom what I could observe, the strategies fit well in the proposed challenge. The proposed dissemination and learning tools are clearly described and will use in different ways to approach the topic, include in education and thus, arouse students' interest, initiating thus a cycle of creating opportunities and disseminating Cardano in the communities.", "q0r": 5, "q1": "The proponent makes it very clear how he will develop the project. Apparently, the team was well structured, with professionals from different areas of expertise, experience with the target population and I believe it will be enough to address the proposed themes", "q1r": 5, "q2": "The project is well explained, structured, with a diverse content approach, a well-structured schedule, well-defined time and goals.\nHowever, it was not clear how such success will be observed and measured, I suggest to the proponents some time after the end of the project.\nI suggest to the creators of the project, develop some way of evaluating the success and how the content taught is being applied. The volume of projects developed by the students, as well as the evaluation of the importance, functionality of such projects within the Cardano community would be a good thermometer for such an evaluation. Another central point is to observe if the knowledge acquired by the students is being disseminated within the community, since this was one of the central points within the proposal presented", "q2r": 3, "assessor": "z_assessor_3951", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "WIMS-Cardano will establish and successfully run Maths, Finance, Haskell, Plutus, Marlowe, Smart Contracts Development, etc clubs for girls in schools, communities and online to promote girl education", "experience": "We are +10 years experienced developers, finance and educational professionals with these qualifications: BSC Computing, BTech Education, BSC Finance, Accounting and National Diplomas(Analytical Chemistry, Education). Did 1st, 2nd and 3rd Plutus Pioneer and blockchain training."}