{"id": 420829, "author": "paulmcolaka", "title": "AFRICA BLOCKCHAIN YOUTH AMBASSADORS", "url": "https://cardano.ideascale.com/a/dtd/420829-48088", "category": 26600, "amount": 50000, "description": "Development, deployment and adoption of blockchain in Africa continue to encounter challenges such as inadequate skillset, negative public perception, varying level of blockchain literacy.", "f6_no_assessments": 9, "f6_rating": 4.148148148148149, "videos": [], "media": [], "f6_assessments": [{"id": 13889, "q0": "This proposal fits perfectly within the Grow Africa, Grow Cardano challenge framework. It offers a solution to education concerns and provides an opportunity for further Cardano adoption in Africa.\nAs mentioned in the challenge brief, the impact of Cardano gaining traction in African markets is worth a potential $1 trillion. Through this proposal, training and equipping up to 1 million students on blockchain and cryptocurrency in the next 4-5 years, has an enormous potential impact. Through the detailed proposal, the proposed method of education is through university clubs, at accredited universities. Beginning in Kenya, where contact and plans have already been laid, then developing to scale throughout the region.\nBy providing this educational framework, students who may not have this exposure currently in their university undertakings may be motivated to learn more, investigate blockchain or join Cardano communities. This in turn will build the skills and understanding of the community as a whole. As these students graduate, enter the workforce, business or politics, they bring this shared understanding of blockchain to their communities and employers. Although a rather lengthy process, targeting students who are most adaptable, looking for future success and motivated to learn guarantees a good prospect of future uptake and connection for Cardano.\nAs well as the direct university program, the proposers plan to work with strategic partners of an online learning management based system. Once materials, and programs are tested and confirmed, this will allow the project to scale exponentially and allow students in regional or remote areas (with internet access though) to learn and contribute to the project. The project itself, and this possible outreach help achieve at least 3 of the main SDG goals, and many more of the subgoals listed.\nOverall I give this project 5 stars for impact. \n", "q0r": 5, "q1": "The detail given within the project timeline, budget breakdown, team member biographies and even the impact risk assessment, lead me to feel confident about this proposal’s feasibility,\nThe project timeline gives specific details for the 6 month long program, broken into two key milestones. The initial seemingly achievable goal of 5 universities, online modules completed and applications developed may be a little ambitious. However, with the team of 9 people listed, each with impressive and complementing skill sets, I believe they can achieve this goal.\nThe second three months of the timeline sees 10 additional universities added and the initial students from the first phase ‘graduate’ from the online course and are awarded a certificate. It’s excellent that they acknowledge these students will continue to be mentored after ‘graduation.’\nThe planned budget appears to cover all areas needed, I’m assuming that the ‘Salaries for secretariat’ refers to the team’s salaries. A modest contingency of $2,000 is included, which is vital for unknown expenses, definitely the case when living and working in East Africa. Having spent 4 years in Tanzania, and traveled numerous times to Kenya I have first hand experience of difficult situations that needed contingency. However, for the proposers they have the substantial backup that they can eventually deliver the course content virtually online, possibly even asynchronously to avoid the nightmare traffic that often plagues Nairobi and surrounds. \nFurther information from the team notes their plan later to enroll non-university or fee paying individuals to increase the sustainability of the program. This leads to confidence in the long term vision and ability to scale this proposal.\nOverall, I rate this proposal 5 stars for feasibility, due to a dedicated team on the ground already, with experience in all the necessary areas and a thorough plan to begin immediately. \n", "q1r": 5, "q2": "The proposal team has supplied outcomes and measures of success to allow the public to accurately audit the development of their program. They have certain deliverables, student enrollment and success data that they will publicize through a website and social media.\nWithin the deliverables, the learning management system, including web, iOS and Android apps will be required early on in the project. This will be obvious from the developments online, and the beginning of the classes.\nThe proposers have listed detailed student data they plan on collecting, to analyze success and completion rates of the courses, but also events and meetups to further build the Cardano community. In addition, they plan to document partnerships with NGOS, the private sector and academia.\nOne addition that would be beneficial to this proposal would be a clear plan for financial accountability. It’s not mentioned, perhaps they plan to have an expenses reportting sheet, or Github linked, but it would be a confidence boost for potential investors to know that the money that’s been earmarked for specific items has been spent accordingly. Also, to know how the contingency money is distributed, and in case of future funding needs (as they have specified they might need) it is good to have expenditure clearly accounted for publicly.\nLastly, their ‘end goal’ for auditability will be having 1 million + students complete the course, and hopefully many of the alumni students emerging from Africa as future blockchain and cryptocurrency experts.\nOverall, I rate this project 4 stars for auditability.\n", "q2r": 4, "assessor": "z_assessor_3840", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2, "reply": "Auditability:\nFor financial accountability purposes, we plan to provide to the community a google link with quarterly updates on expenses."}, {"id": 3397, "q0": "Target the university students by providing them a possibility to take a course on blockchain and cryptocurrencies is the main idea of this proposal.\nAfter completing the course, the students will be become the Blockchain Ambassadors, and part of the AYB (Africa Blockchain Ambassadors) to promote, use, play a role, support the ecosystem on various capacities. The proposal teams plan on promoting this within universities with a goal to reach 1+ million by 2027. By reaching out this number of people who would take the course, would be a great number and some of those will get involved, which is one of the objectives of the challenge.\nScalability and globality, the proposal is designed to start with 5 universities offering the course, and then 15 by November 2022, and this will increase as time goes on. This may reach out to many other universities in Kenya and beyond.\nThe project aligns clearly with the challenge ", "q0r": 5, "q1": "The success of this project is possible and its large-scale implementation. However they are few factors to be taken into consideration:\n- the goal of the proposers is to have reached around 1 million students by 2027, but this should start gradually by targeting, even a least 1 university for the pilot phase. A university may count thousands of students who may be interested. This would help proposers to minimize the resources, and make a focus on evaluation of the outcomes, and be able to adjust for the next phases;\n- the sustainability of such initiative would be well planned ahead of time to allow evaluators to have a projection on short, mid and long term success\nThe budget breakdown is general on various sections without giving enouth details on how the funds would be used.\nThe proposers team is formed by people from diverse backgrounds, which is an asset. Also, the ABYA website is up and some work going on that can help to promote this new initiative.\nEven if the idea is feasible, it's success may be challenging based on the elements as currently presented with these same goals.\nI'll rate it with a 3 star and would like to see proposers decrease their intentions to be more realistic.", "q1r": 3, "q2": "The audit mechanism presented is feasible where the community may be able to follow the progress through the ABYA website, but also the course materials would be online. Meantime to also add a possibility to share the outcomes through the community social media platforms would also help other community members to learn about the work conducted around the project. ", "q2r": 4, "assessor": "z_assessor_2458", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Feasibility:\n1. The bootcamp will be delivered online, therefore making it possible to reach as many students and universities as possible with very minimal cost.\n\n2. Budget lines clarity\n    - Design, development, hosting, security (web) LMS (2yrs) @ $7,000\n    - Android and iOS @ $4,500\n    - Design, development and quality assurance of the online training \n       course module @ $4,700 (Beginner Bootcamp and Intermediate \n       Bootcamp modules)\n     - Salaries for Secretariat @$5,812.5 per month for 6 months\n\n\nAuditability:\nProject outcomes like the number of students graduating from every cohort will be shared through ABYA website and social media handles and community social  media platforms . This will also include feedback from the students about the bootcamp.\n\nTo track KPIs such as target enrollment and completion rate per cohort, number of PoCs, blogs, and articles derived from work streams, and Number of meetups, hackathons, and social events held quarterly, we plan to provide to the community a google link with quarterly updates."}, {"id": 3872, "q0": "A great idea, it identifies many of the problems that need to be solved in this challenge, it covers almost all of the problems the challenge poses, it can expand rapidly and large to many other places, they can also solve problems that arise in the future, this is a very good proposition, it brings great development value to the Cardano ecosystem. I would like to see this project again in the next Foundation if this proposal is not Funded in this Fund. The level of ignorance, negative perception, and lack of knowledge about Blockchain is a common problem in the industry and a common problem all over the world, not just in Kenya or Africa.\n\nThe impact of this project is quite large, the solution of this proposed idea is huge, and it identifies almost every problem to be solved in this challenge, in addition to the author's argument through a realistic description. reasonableness, clarity, and completeness. Setting KPIs for 1M+ students who will be successfully trained in Blockchain by 2027 across countries in Africa and the other overall goals of the project is an ambitious project, showing that the author will attach long term with the project. . The formation, development, and implementation of the Online Learning Management System is a good and reasonable solution with the 4.0 era trend.\n\nIt's great that the idea of ​​this proposal details so many risks when it is implemented in practice, and the idea's author has outlined solutions to all of them. That not only keeps the project on schedule but also helps the community manage risks from the project when it is put into practice, thereby considering whether to vote in favor of the project or not. with ideas. The impact of this proposal is enormous. The risks related to financing, source, culture/behavior, politics, and climate have been listed in quite detail along with mitigation solutions and ways to solve the problem reasonably and easily. understand.\n", "q0r": 5, "q1": "Great when a project provides a clear, logical amount of timetable information for implementation and completion. The goals that the project is aiming for are also very specific and completely achievable. Totally reasonable with 6 months of implementation corresponding to the set goal, the proposal shows that it has been implemented in practice with or without funding, this is not only a project applying for funding from Catalyst but also is the trend of African students. .\n\nThe proposed project budget is less than 20% of the total budget of this challenge, compared to the information the proposal provides, some project expenditures need to be clarified if it is to be funded. A detailed budget should list hourly wages for workers in each locality, corresponding to the tasks of each person in the project team, the community needs to know, this helps to make the project transparent. better project. Compared to the information provided, it is a bit general and not yet a detailed budget.\n\nThe implementing personnel have not been assigned a specific job, but are listed with relevant experience for the project, besides, the identity of the members is easily verified clearly by the listed links. above. It is proposed to provide only names and links (LinkedIn) this makes it easy for the community to verify the identity of team members, but the author of the project has not specifically assigned members to do it.\nThe author of this project is Paul McOlaka with cast members Kevin Kihara, Joy Otieno, Gordon Otieno, David Otieno, Agnes Omondi, Wayua Musyoka, Zawadi Mboya, and Isaac Ler. \n", "q1r": 4, "q2": "This project provides KPIs for accomplishing project goals, all of which are easily measured thanks to the metrics provided by the project. With target enrollment and completion rate per cohort, number of PoCs, blogs, and articles derived from work streams, and Number of meetups, hackathons, and social events held quarterly, .., the goal is completely measurable, however, the author is pleased to provide the community: where and how we check that number.\n\n  The scheme has clearly defined success, the information from the scheme shows what is being done and how it is being done and testing has achieved considerable initial success which is amazing. With https://abya.africa The site is complete and provides the necessary information for the visitor, rolled out to completion, making it a good proposition.\n\nBrand new idea information on Cardano platform never received any funding from Cardano ecosystem.\n", "q2r": 4, "assessor": "z_assessor_2489", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Feasibility:\nIn terms of the wage rate, in tis part of the world, it is a standard practice to use monthly rate and not hourly rate. The former model is more sustainable than the latter model. For clarity purposes, specific responsibilities and monthly rates are as follows:\n1. Paul McOlaka - Coordination, Partnerships, Fundraising & Launch @ $800\n2. Gordon Otieno - Programmer - Technical Support @ $400\n3. David Otieno - Community Manager & Student Mobilization @ $400\n4. Zawadi Mboya - Content Development, PR & Social Media Management @ $300\n5. Agnes Omondi - Programmer - Technical Support @ $400\n6. Wayua Musyoka - BD, Fundraising & Launch @ $400\n7. Isaac Ler - Design, Media and Video Production @ $300\n8. Kevin Kihara - Programmer - Technical Support @ $400\n9. Julian Rowa - Strategy, Partnerships & Quality Assurance @ 800\n\nAuditability:\nTo track KPIs such as target enrollment and completion rate per cohort, number of PoCs, blogs, and articles derived from work streams, and Number of meetups, hackathons, and social events held quarterly, we plan to provide to the community a google link with quarterly updates."}, {"id": 4114, "q0": "I believe ABYA characterizes the spirit of the Grow Africa, Grow Cardano challenge by proposing a project that aims specifically at tackling education concerns, building partnerships, and ultimately growing community through early activation of students - representing the next generation of proposers, developers, users, and all-around contributors to this ecosystem.\n\nA 5 year, 1M+ student goal is a great way to envision the scope and scale of this proposal, considering Kenya (MVP market) has just under 600k university students currently, in a continent where access to education severely lags other geographies (740 African universities serving 660M African students vs. 5,300 US universities serving 323M American students according to one resource).\n\nA variety of learning methodologies also offers many ways for this project to grow, between e-learning, university partnerships, and other group/assessment based initiatives.", "q0r": 5, "q1": "A timeline with milestones is present for this project, detailing the scale of the first phase staffing, partnership, development, and launch initiatives - although the target partnership volume of 5-20 universities in the milestones does not match the stated goal of 60+ universities in the Solution section, perhaps a more broad goal for later phase achievement.\n\nThe budget breakdown is presented with limited detail of how the proposer arrived to determine those numbers, but the core elements of the financing plan exist with the restated target of achieving ABYA chapters in 20 universities initially.\n\nThe team's linkedin profiles seem heavy on blockchain and tech/IT experience, with limited backgrounds in traditional education.  Even though the team's experience may be strong in the areas of platform content focus, they might benefit from a team that also has skillsets in traditional educational or admin for help on design and delivery of that content.\n\nThe ABYA website is already built in basic form and limited functionality, indicating some initial investment of time thinking through and presenting this opportunity, although like the proposal, the team roles are not well defined, and the sections designed to advertise board members, secretariat, and  leadership are still undefined.\n", "q1r": 4, "q2": "The key milestones stated for measuring the projects early stage rollout are clearly defined, although they include the 5 year mission of impacting 1M students - a great vision but perhaps an ambitious target that overlooks the importance of more near term goals.\n\nProgress tracking according to metrics defined by the team will be possible from this fund to the next, but only on a comparison basis or the determination that the team was able/unable to achieve some traction, since they didn't specifically define an impact goal for this stage.\n\nWhile I think it will be clear to the community whether or not this proposal is a success, and ultimately worthy of additional resource allocation if funded, I would challenge the proposer to think critically about the scale-up plan in terms of setting goals that can be used in terms of advertising success and planning resources for later phases based on early stage number.", "q2r": 4, "assessor": "z_assessor_2517", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1, "reply": "Feasibility:\nAppreciating the fact that our team has limited backgrounds in traditional education, we plan to employ the services of people with expertise in this area to help us standardize and quality assure our learning modules."}, {"id": 5064, "q0": "The main goals of the challenge are to grow Cardano in Africa by increasing the number of users and developers. This proposal addresses those goals well by building Cardano learning centers in universities. It makes sense to target the university population as that is where many developers will be trained. By introducing Cardano in universities new developers will feel comfortable with the technology and be more likely to choose Cardano for projects. \n\nMany new technology business are born from students meeting at university. By introducing Cardano to this population we increase the chances of Cardano being adopted as the chosen technology for new applications developed in Africa. \n\nComputer science students do not live in silos, they will introduce Cardano to friends, family, and acquaintances who work in many fields. This seems like a very direct way to appeal to the population with the most potential to grow Cardano long into the future.", "q0r": 5, "q1": "The proposal has a large, experienced team. They certainly have the knowledge and connections to be successful in setting up a system to train youth ambassadors. \n\nThe hesitation is that the the budget and timeline seem tight and rushed. Simply looking at the budget for laptops it looks like the budget is too small for this large of a project. Allocating $500 per university chapter for setup also seems too small. \n\nThe feasibility sections lists more risks than I have seen in other proposals. Most of the resolution plans can be summed up as we will work harder. The shear number of risks raises concerns about the success of the project. \n\nEven though this is a five year plan, it seems overly ambitious to reach one million users.", "q1r": 4, "q2": "There are a number of objective milestones and goals which can be measured along the way to assess progress and success. \n\nThe proposers have identified a lot of SDG goals which shows consideration for the impact of the project. While not officially part of the proposal, these SDGs offer more ways to track progress. \n\nThe proposal calls for measuring numbers of users, meetups, apps, partnerships, and more. This kind of objective set of metrics gives a lot of confidence that progress and success can be audited by anyone in the Cardano community", "q2r": 5, "assessor": "z_assessor_2669", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Feasibility:\nEven though allocating $500 per university chapter for setup seems too small, when actually implementing this, we plan to consolidate the launch by bringing together universities within a given region, which will make it very cost effective"}, {"id": 5240, "q0": "Your proposal is quite meaningful when you want to bring Blockchain and Cryptocurrency to many young people in Kenya in particular and Africa in the future. However, with this Challenge called \"Grow Africa, Grow Cardano\", we should focus on introducing Cardano to young people, it will be more appropriate because it is Cardano who will sponsor our project, not other platforms.\n\nYour solution focuses mainly on educational activities for students at universities. However, because Blockchain and Cryptocurrency is a fairly broad field, you need to be more specific about what you want to train: basic knowledge of Blockchain & Cryptocurrency or knowledge of programming, suitable for students who specialize in the information technology to build projects on Blockchain,...\n\nOne of the reasons I see in your proposal that you raise too many risks is because your proposed activity is still general because the proposed solution is not specific, there will be many risks. something that is easy to understand. However, it is also appreciated that your group also has solutions for the risks mentioned.", "q0r": 4, "q1": "Your plan will be implemented within 06 months and divided into 02 phases, from Jun-Aug 2022 and Sep-Dec 2022. However, at the time this review was done, it was already July and if your project gets a fund, it's already August. So it seems that this plan is somewhat illogical.\n\nThe tasks will do in the plan are described in quite general and do not include specific timelines and possible outcomes. The lack of the above information makes your proposal less feasible and it is also difficult to assess whether it can be completed on time as committed or not.\n\nThe budget you are applying for in this round is $50,000. But if I add up all the costs ($11,500 + $4,700 + $34,875 + $10,000 + $4,000 + $2,000) = $67,075, this is a big difference from your suggested budget, which makes your budget is not reliable.\n\nThere are a total of 09 members participating in this proposal, but only provided with a Linked In account. Failure to clearly describe the skills and experience of the people involved in this project will make it impossible for the community to know if your team is qualified or suitable to undertake this project.", "q1r": 3, "q2": "To measure performance, the proposal also provides appropriate indicators for a purely educational project such as: number of students registered, Number of campus meetups, hackathons and social events held per quarter,...\n\nHowever, to evaluate the success of the proposal, you should add specific numbers. For example, 1000 registered students, or 100 campus meetups, hackathons and social events held per quarter, etc. These numbers will help the community know if the project has been completed according to what was committed or not.", "q2r": 4, "assessor": "z_assessor_2678", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Feasibility:\n\"Our plan will be implemented within 06 months and divided into 02 phases, from Jun-Aug 2022 and Sep-Dec 2022. However, at the time this review was done, it was already July and if your project gets a fund, it's already August. So it seems that this plan is somewhat illogical. The tasks will do in the plan are described in quite general and do not include specific timelines and possible outcomes. The lack of the above information makes your proposal less feasible and it is also difficult to assess whether it can be completed on time as committed or not. The budget you are applying for in this round is $50,000. But if I add up all the costs ($11,500 + $4,700 + $34,875 + $10,000 + $4,000 + $2,000) = $67,075\"\n- This is still logical because there are milestones that we have already achieved even without the funding e.g website is almost completed, recruitment of students is ongoing \n- We are using other sources of funding to take care part of the difference between $67,075 and $50,000\n- Also, we are using part of our personal resources to fund our initial start up"}, {"id": 5776, "q0": "Blockchain literacy among students is important grow the knowledge and interest in adoption and development of innovation on the cardano blockchain. The proposal therefore addresses the challenge to educate, scale-up and promote adoption of the cardano coin and ecosystem participation. \n\nThe proposal is focusing on building entrepreneurial blockchain mindsets among tertiary students in Kenya to build cardano blockchain products. This milestone will onboard many graduates and student into the cardano ecosystem for growth. \n\nHowever, I think the proposal is doing so may things at the same time including engaging with regulatory agencies for a favorable legal environment is a huge medium to long-term task. The team should not be scared of the ban  on cryptocurrencies because cryptocurrencies are not ban on paper with words announced to the public to desist from its use. Rather, when more people understand and adopt blockchain and explore its benefits, the government would have no choice to embrace its use. \n\nI will suggest that, the team should focus on the students/university outreach programs to support and nurture their thinking and innovations to embrace catalyst to be the biggest ecosystem in the blockchain industry. \n\n", "q0r": 4, "q1": "The proposal has scanty details of the action plan. Though there's a less tight schedules, the training plan together and its related timelines did not include the content of the course modules. The content of the curriculum forms a significant part of the course training. The team should elaborate further on plan of work should they win funding. \n\nThough the team members seem to have the experience to implement the proposal successfully, the team again did not or give enough details of the budget. For example how many hours would the team work and how many workers would be at the secretariat that, $34,875 should be allocated for salaries alone and the purpose of the laptops were not explained. A project like this could also have a sustainability plan of action to continuously keep the course running. \n", "q1r": 2, "q2": "The team has provided a number of milestones to monitor progress and evaluate for success, the are no KPIs on the number of students in the cohort and how many are expected to be onboarded. This could guide the community measure the possible achievement of of the 1+ million students being impacted by the training. The information provided are not that sufficient to audit the progress of the proposal. ", "q2r": 2, "assessor": "z_assessor_2749", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Feasibility:\nIn terms of the wage rate, in this part of the world, it is a standard practice to use monthly rate and not hourly rate. The former model is more sustainable than the latter model because it is cheaper to use a monthly rate than an hourly rate.  For clarity purposes, specific responsibilities and monthly rates are as follows:\n1. Paul McOlaka - Coordination, Partnerships, Fundraising & Launch @ $800\n2. Gordon Otieno - Programmer - Technical Support @ $400\n3. David Otieno - Community Manager & Student Mobilization @ $400\n4. Zawadi Mboya - Content Development, PR & Social Media Management @ $300\n5. Agnes Omondi - Programmer - Technical Support @ $400\n6. Wayua Musyoka - BD, Fundraising & Launch @ $400\n7. Isaac Ler - Design, Media and Video Production @ $300\n8. Kevin Kihara - Programmer - Technical Support @ $400\n9. Julian Rowa - Strategy, Partnerships & Quality Assurance @ 800\n\nLaptops will be used by the secretariat to support the project activities on a day-to-day basis.\n\nAuditability:\nTo track KPIs such as target enrollment and completion rate per cohort, number of PoCs, blogs, and articles derived from work streams, and Number of meetups, hackathons, and social events held quarterly, we plan to provide to the community a google link with quarterly updates.\n\nOur Workplan include\n1.\tRecruitment of university coordinators and their assistants - June (done)\t\t\t\t\t\t\n2.\tSetting up and operationalizing the secretariat - June (done)\t\t\t\t\t\t\n3.\tOrientation for the university coordinators and their assistants - July (done)\t\t\t\t\t\t\n4.\tDevelopment of ABYA University LMS - June to July (web application - ongoing), (Android and iOS Apps - August to September) \t\t\t\t\t\t\n5.\tDevelopment of learning course modules - June to July (ongoing)\t\t\t\t\n6.\tEnroll the first cohort of students for the bootcamp course - June to July (ongoing)\t\t\t\t\t\t\n7.\tLaunch the bootcamp - July (to be done in the last weekend of that month)\n8.     Setting up of workstreams - August \n9.     Setting up of ABYA chapters in 20+ universities in Kenya - August \t\t\t\t\t\t\n10.\tFirst cohort of students in the online bootcamp graduate and are awarded certificates - November\t\t\t\t\t\t\n11.\tFirst cohort of students continue to be mentored after being awarded certificates\t\t\t\t\t\t\n"}, {"id": 11737, "q0": "The idea of ​​training and equipping students in blockchain and cryptocurrency universities in Africa in the future is quite relevant, given the difficult challenges that are happening in Africa such as the skill sets that are not full, negative public perception, and varying degrees of blockchain understanding. While the government still has little interest in this area, several countries are said to be taking steps to promote blockchain adoption. Kenya has partnered with the private sector to take advantage of the benefits that can be gained from using blockchain. This proposal also builds on the success of a pilot in Kenya. And from there it will be replicated to expand operations in other countries of Africa. The proposal sets out the goals that the project must achieve, and these goals are what make the project successful. There is no denying that the problem of this proposal will be completely relevant to the challenge facing Africa.\nThe solution to the problem is that organizers come up with ideas to develop and deploy an online learning management system to reach and work with strategic partners. The aim is to provide students with the opportunity to enroll in fundamental and graduate courses in blockchain and cryptocurrencies, which provides an opportunity for students to advance and develop their careers upon graduation, becoming future blockchain entrepreneurs.\nAlthough the project has a solution to build it, it is still impossible to avoid risks, technical and operational risks can slow down the progress of the project, and the project does not receive financial support for the project, students' permission and cooperation, and the government's prohibition on the use of cryptocurrencies, the project failed to achieve its goal because of the failure to raise funds and other risks that the proposal presented. However, the proposed group has come up with solutions to overcome and minimize those risks, which has convinced the community.", "q0r": 5, "q1": "The proposal gave important milestones and also a specific time of the work to be done. However, currently, this proposal is being appraised for funding, the time starting from June to implement the project is not reasonable, we should push back the project and speed up the work progress. Propose to show specific works every month so that the community can assess the progress of the works more accurately.\nThe table budget proposal I have not seen is transparent and clear. The group should be more specific about the costs, not give numbers without going into details, a fairly large cost but only declare a project diagram that we can evaluate for these numbers. . For example, the salary for those who work includes who and how many people are paid in time.\nThe people involved in the construction of the project are listed and publicly identified, moreover, the proposal also has their Linkedin evidence from which we can know their working capacity and experience. I believe with the information of this group of people they will do their job well. But I also need to know the individual work of each person in this project because there are so many people involved, which also leads to the lack of transparency about the budget mentioned above.\n", "q1r": 3, "q2": "There is no doubt about the success of this project. Since the proposal team has provided an indicator to measure the success of the project, and also provides a KPI, the proposal has a clear goal to be achieved through the number of students enrolled, and the level of interaction. of students at work, relations with partners, student meetings at the university, and events held each quarter. Those are indicators that are consistent with the solutions outlined earlier and are also relevant to this challenge.\nThe success of the project can be easily seen through the above metrics and the proposed team has determined this.\nThis is a brand new project but I think it will be active forever because it has a great impact on the study and working environment of university students, however, it requires a fee to increase the calculation. sustainability of the project, so we still need support from Catalyst.", "q2r": 5, "assessor": "z_assessor_3273", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Feasibility:\nOur Workplan include\n1.\tRecruitment of university coordinators and their assistants - June \n        (done)\t\t\t\t\t\t\n2.\tSetting up and operationalizing the secretariat - June (done)\t\t\t\t\t\t\n3.\tOrientation for the university coordinators and their assistants - July \n        (done)\t\t\t\t\t\t\n4.\tDevelopment of ABYA University LMS - June to July (web application - \n        ongoing), (Android and iOS Apps - August to September) \t\t\t\t\t\t\n5.\tDevelopment of learning course modules - June to July (ongoing)\t\t\t\t\n6.\tEnroll the first cohort of students for the bootcamp course - June to \n        July (ongoing)\t\t\t\t\t\t\n7.\tLaunch the Beginner Bootcamp for non-technical students - July (to be \n       done in the last weekend of that month)\n8.     Setting up of workstreams - August \n9.     Setting up of ABYA chapters in 20+ universities in Kenya - September \n       to November \t\t\t\t\t\t\n10.\tFirst cohort of students in the Beginner Bootcamp graduate and are \n        awarded certificates - November\t\t\t\t\t\t\n11.\tFirst cohort of students continue to be mentored after being awarded \n        certificates and become our Blockchain Goodwill Ambassadors\n\nIn terms of the wage rate, in this part of the world, it is a standard practice to use monthly rate and not hourly rate. The former model is more sustainable than the latter model because it is cheaper to use a monthly rate than an hourly rate.  For clarity purposes, specific responsibilities and monthly rates are as follows:\n1. Paul McOlaka - Coordination, Partnerships, Fundraising & Launch @ $800\n2. Gordon Otieno - Programmer - Technical Support @ $400\n3. David Otieno - Community Manager & Student Mobilization @ $400\n4. Zawadi Mboya - Content Development, PR & Social Media Management @ $300\n5. Agnes Omondi - Programmer - Technical Support @ $400\n6. Wayua Musyoka - BD, Fundraising & Launch @ $400\n7. Isaac Ler - Design, Media and Video Production @ $300\n8. Kevin Kihara - Programmer - Technical Support @ $400\n9. Julian Rowa - Strategy, Partnerships & Quality Assurance @ 800\n\nThe bootcamp will be delivered online, therefore making it possible to reach as many students as possible with very minimal cost and universities.\n\n2. Budget lines clarity\n    - Design, development, hosting, security (web) LMS (2yrs) @ $7,000\n    - Android and iOS @ $4,500\n    - Design, development and quality assurance of the online training \n       course module @ $4,700 (Beginner Bootcamp and Intermediate \n       Bootcamp modules)\n     - Salaries for Secretariat @$5,812.5 per month for 6 months.\n"}, {"id": 12351, "q0": "The proposal addresses the problem which aligns cardano's challenge setting.The proposal seeks the need for the development, deployment and adoption of blockchain and cryptocurrency in Africa. However, Blockchain since its inception have gone through alot ups and downs outside the Africa continent to be recognized and accepted. Africa is no exception through this journey. Some parts of Africa recognize its development and  adoption of blockchain. In view this, some Africa countries are yet to adopt blockchain. The proposal seeks to tackle the problem by the help of ABYA that plans to train and equip 1 million students on blockchain and cryptocurrency. The proposal seeks to add value to the cardano ecosystem. In addition, the need to drive blockchain education in Kenya through awareness programs, conferences, research, seminars, and training programs on blockchain. And also,the need to promote the introduction and institutionalization of blockchain and cryptocurrency.\n", "q0r": 5, "q1": "The proposal has provided the needed information to tackle the problem. The proposal gave details of all team on board. This shows evidence (refrences and links) of experience and expertise of the team members. The team presented shows experience in the areas of blockchain and cryptocurrency are going to ensure its readiness to achieved its stated goals.\nThe proposal has provided a comprehensive budget with a breakdown of items if the project is to be implemented. The proposal brings out the resources that the project needs and how these resources are going to be used to achieve its goals. The proposal provides a timeline of activities showing deadlines of completion of work.The proposal plan considers risk to its implementation. These risks need to be addressed and must consider certain laid down plans. The proposal's stated risk such as operational and technical risk will turn to hinder its implementation if appropiate measures are not put in place. I believe if the proposal receives the necessary funding it can be  implemented", "q1r": 5, "q2": "The information provided in the proposal offers clarity. The proposal addresses the problem and points to the key issues of the project. The proposal provides a practical innovations on how Africa can adopt to blockchain and cryptocurrency. The proposal gave a roadmap with milestones that gives resources and how the project can be achieved with clear timeline of activities. The proposal hits on the metrics and key performance indicators which shows how the project will be achieved. These KPI's such as the proportion of youth and adults with Information Communication Technology (ICT) skills. ", "q2r": 4, "assessor": "z_assessor_3401", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "ABYA plans to train and equip 1M+ students on blockchain and cryptocurrency by 2027 across accredited universities in Africa, starting with an MVP in Kenya, then scale to the rest of Africa.", "experience": "Paul is currently a Senior Research & Executive Officer with Blockchain & Climate Institute (BCI) and brings a wealth of experience in managing university clubs, as he was the Secretary General of the Kenyatta University Model United Nations in 2007."}