{"id": 420916, "author": "benzvibenjamin", "title": "Caricatures 4 Africa", "url": "https://cardano.ideascale.com/a/dtd/420916-48088", "category": 26600, "amount": 10500, "description": "There is not enough creative and amusing ways to promote Cardano and Catalyst to the African community", "f6_no_assessments": 8, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 4058, "q0": "The proposal is a creative solution to the issues preventing widespread Cardano adoption in Africa. Through caricatures the proposer can more easily grab the attention of the people and arouse the interest in subjects relating to blockchain technologies and the Cardano ecosystem in general. That has to come equipped with a robust and consistent marketing so the caricatures reach the biggest audience possible. The way the proposer described they will decide the topic of each carticature is by using ideas of the own community by listening to people in townhalls for example and by gathering with Wada, which is a group focused in developing Cardano in Africa. That is a nice solution to this particular issue. However, I believe the marketing part is as important as the caricatures themselves and this point has barely been touched in the discussion. They only mention Raz and Cole will be responsible for it. This point is especially important because is through the marketing that the team will be able to scale the project in the future.", "q0r": 3, "q1": "The proposer has provided enough evidence of the team's skills and experience. They have provided links to previous works and LinkedIn profiles of the members of the team. The budget described is comprehensible and the amounts adequate for each identifiable item to reach the goals of the project. Their timeframe is closely related to the goal of producing twelve caricatures, one each week, which total twelve weeks of project and this is pretty reasonable. The plan is sensible, they have accounted for the tasks beyond the main one (designing the caricatures) which are brainstorming to define the subjects and editing the website to add a growth of Cardano section, for example. They have also discussed and raised two risks of the implementation: setting up a storyline for the artistic creation and being able to generate revenue so the work is long lasting. Additionally, I would add another major issue they have not focused and that I believe is extremely important, the risk of the impact of the project being less than anticipated. In other words, they run the risk of their caricatures not dragging the attention and not attracting as many people as they desire to the Cardano environment.", "q1r": 4, "q2": "The roadmap described has clear milestones and time horizons, one caricature each week. The KPIs proposed are not that clearly explained but can be inferred to be number of media channels and number of views in social media. Particularly I think impressions generated would be a great KPI (gathering all of their social media) and an obvious one is number of caricatures of pieces of art produced. The latter is more focused on the project itself and the former on the context of the challenge which is to disseminate Cardano around Africa. From the proposal it can be seen the problem is understood but I'm not so sure if the solution is very effective (because of the risk I described in the feasibility section). Finally, they have set up a public channel to regularly update about the progress of the project, the Shlomo website and have also mentioned they would also update their social media. However, they could have provided links to their social media for more convenience.", "q2r": 4, "assessor": "z_assessor_2513", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5497, "q0": "The ramifications the above proposal could bring are ample. It is a brilliant idea put forward in a simple yet elaborate manner. We have seen proposals trying to inculcate knowledge amongst the young minds of Africa through courses, videos, workshops, and many more academic ways. But the author of this proposal tries to do the same in a more entertaining way that may not be boring to any. Caricatures are an excellent way to instill concepts into the minds of readers which might trigger further learning interests in them. The author also mentions collaboration with WADA, which already has its roots deep across Africa. The caricatures may reach more individuals at a faster pace and the marketing and outreach factor is already sorted to an extent. If the initiative catches wind, there is the possibility that this can be made to reach a much wider audience, hence giving it a global touch in terms of its impact. But the only challenge that I as a community member can think of is the extent of acceptance from the African community and other viewers. The caricatures are a very sensitive way of communicating information, they are often considered only for humor rather seriously.", "q0r": 4, "q1": "The milestones and the detailed plan provided in the submission look plausible and viable. A successful implementation would really be fruitful for the community as a whole. The team put together to get the project implemented looks paramount. The Caricature artist himself has made a name for himself at the global level. Association with WADA makes the entire proposal more credible. The deliverables are also in alignment with the challenge's expectations. The sense of educating African citizens is still kept intact even though the proposal looks more like an entertaining one. Therefore, I strongly believe the proposer and his mates are completely capable of making this proposal triumphant. The budget requested however feels to have gone a little overboard in terms of the pay for each week. Hence, I would deduct a point for the same. Anyway, monetizing this initiative through NFT or some other means as the author says would be a whole different ball game, making this proposal a great one in every sense.", "q1r": 4, "q2": "Despite having concerns regarding the impact and feasibility to some extent, I have no concerns whatsoever regarding the auditability aspect of the proposal. The proposal's outcomes are well outlined and measurable and are based on a properly defined roadmap. The KPIs are all clearly defined and highly auditable. The customer interactions on the posts of caricatures would be a great way to assess the acceptance of the initiative and consistency of the team in posting new caricatures and different subjects are reasonable enough to track their progress. The success of this venture would be the outreach of the proposal, in turn motivating a lot of newcomers to start using Cardano and become a part of the community. Therefore, I would make no reservations about scoring the proposal a full mark for its clarity and auditability.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5777, "q0": "I strongly think the proposal is aligned to the challenge that, it is educating and creating awareness with humor. This often comes images that are attractive for may to watch and debate out it. Such literature works would spread the information about the cardano platform.\n\nThis will equally expose the catalyst platform to people who are curios to follow up and learn more. ", "q0r": 5, "q1": "The team is experienced and have important information about them showing the credibility in the catalyst ecosystem. Thy have the capacity and well organized to deliver for success. The deliverables of the proposal are clear with important milestones including media engagements. \n\nThe budget is very brief and detailed enough to clear doubts. A very reasonable budget help the proposal in its implementation. ", "q1r": 5, "q2": "There are KPIs projecting the number of viewships and a weekly release and postings of the cartoons. The other KPIs are equally important and realistic to guide the community to evaluate the proposal. There is also the mention of a final report to the community which is also important to justify the impact of the proposal. ", "q2r": 5, "assessor": "z_assessor_2749", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5844, "q0": "This is an amazing project and I am enthused about it. One of the ways to provide lasting and impactful education is to make it fun to receive. This project, uses a hilarious method to educate Africans about Cardano ecosystem and the catalyst community. The goal is to inform, create awareness and increase adoption. \nThe strategy is great, the idea is innovative and if well executed will make a lot of impact. The KPIs meet the setting of this challenge and the impact on Cardano and the local community will be great. \n", "q0r": 5, "q1": "I'm impressed with how detailed this proposal is. To start with, the proposal outlines a timetable of milestones with dates allocated. Key performance indicators are also outlined to help track the progress of the work being done. All team members have been listed with their relevant experience and because the team has already worked on some proposals in fund 8, I believe they have what it takes to execute this one. The budget of 10500 USD is reasonable and the budget allocation is also well elaborate. The proposal also identify risks and present pragmatic ways to mitigate these risks. I think the proposal does well to seal all loopholes. \nI think this proposal is implementable.", "q1r": 5, "q2": "This proposal indicates an elaborate roadmap from start and finish of the project with timelines. Key performance indicators are given to help track the progress of the project. The KPIs are clear and measurable. The budget allocation is also clear. I think this proposal is auditable.", "q2r": 5, "assessor": "z_assessor_2754", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7880, "q0": "The proposal address the major quandary is there is no enough creative and amusing ways to promote cardamom and catalyst to the African community, this proposal provide us with a solution of creating the hoskintoons.com NFT project which also recognised by charles in one of his video and they are intended to look into using my expertise to promote cardano in a unique way and to educate African communities. this proposal is designed in a weekly caricature and  to make African community to aware about amazing cardano and also this proposal is focused on timeframe of 12 weeks and produce 12 caricature but it would be better if they would provide more detailed information about timeframe in a weekly bases they also participate in a few after town hall sessions in order to help to find subject in which they can do caricature, and for the best result they got the help from raz and Cole which are 2 challenge and this challenge that they have submitted this proposal aims to increase the visibility and use of cardano and catalyst with these caricature in an creative way it would stronger enough if they would explained more about the creative things which they would prefer us to do  to promote cardano . The proposer is also aware about the risk involved this will be mitigated 1st by vast experience and to be able to generate revenue and required action to overcome them .", "q0r": 4, "q1": "This proposal comes with an excellent plan that explains the key milestone that the team has planned to achieve the proposer have provided us a time line in a weekly bases which would help us to understand the plan in a better way by sharing an multiple media channels. They start promoting cardano in a different ways like they shall organize with brainstorming session, publishing one cartoon per week , posting in there web site about cardano , process buliding NFT model .the team requested for the total budget breakdown is USD 10500 . And they have explained how they utilise it. The roles of the members are also pellcidly identified and there work experience. The team put together to make this idea into a reality is very reliable.the members carry a lot of experience and skill from there previous year of working in other proposals also the members of there team working on other proposals in this funds and they assured to come back for the later round for further funding to catalyst and they assure to come up with the new ideas and this shows the passion and future plan for this proposal. ", "q1r": 5, "q2": "The proposal along with its wonderfully laid out game plan also comes with excellent ideas to measure it's progress.  the key measurable metrics are all very apt to the challenge expectations and very lucid by definitions.this proposal is highly auditable for deliverables and KPIs , weekly publishing caricature it can generate viewer on social media this KPIs provided by the proposer help the auditors to evaluate the proposal from all aspects be it from the job done by the team to the extent to reach of their work to success metrics are enriched version of these key measure along with a benchmark figure against each of them that the proposer want the community to evaluate their work and success they mainly focus on growth of community and getting to mainstream media and also they have some creative idea to implement .they have some similar proposal on the previous funds but this one firs another challenge so by the experience of pervious funds this proposal may come out with the new and properly satisfied output .", "q2r": 5, "assessor": "z_assessor_2930", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11396, "q0": "The caricature is the art of criticism which is concerned with African cartoon narratives of the realities of African media in the post- cold war era. Yet there is no enough creative ways to promote cardano to the community. Use of cardano has an educative and humoralistic purpose. Ethiopian schools will use Cardano blockchains to track student performance. This technology helps empower remote and hard- to - reach areas across the continent. So everyone gets an equal chance to access services and opportunities no matter where the line. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The proposer has detailed about his 40 yrs of experience in the political cartoons for newspaper which is very impressive and has a proper roadmap having release of each cartoon per week for 12 weeks , brainstorming sessions and sharing them to multiple media channels on weekly basis and more than 5-10 media channels are publishing the cartoon weekly. They have also added a section of growth in Africa in the website. The proposer has provided clear budget breakdown and provides sensible and conductible plan for implementation to achieve set goals . Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "This proposal can be traced easily as they have provided a fantastic roadmap including weekly publishing caricatures and sharing in multiple media channels. Preparing list of media channels to be published and evaluating the process building NFT model for it and trying to reach millions of people on social networks. It is highly auditable for deliverables and KPIs with acceptable budget plan. The information provided is sufficient to audit the progress and success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 11606, "q0": "The proposer of these very challenge deserve a commendation as he said he is an expect  in creating cartoons and caricatures as indicated in his proposal, according to him, that he has created caricatures for big time news papers in Israel's news team for years and that he would like to replicate same in Africa since Africa is lagging behind in the information of cardano ecosystem of which he intend to use his Talent by creating cartoons that will help Africans to get to know more about cardano ecosystem. The proposal as indicated by the Proposer said he intend to design a weekly caricature that is to promote cardano in African community in order to make the African aware of how amazing cardano is and how catalyst is amazing too, if this project is funded. The proposer also indicated that he wants to focus on a time frame of 12 weeks and that he will therefore produce 12 caricatures to tell a story about cardano ecosystem to the African people, the proposer also suggested that he will hold Town Hall meetings to set up story lines in order to get people brainstorm about it. This project if funded through the creation of the caricatures will make Africa the leading hub of cardano ecosystem. The proposer and his team also said the only challenge they  faces is setting up a storyline and if that is so done the next thing is connecting the storylines to the weeks ahead and so with the experience of the proposer having participated in the fund 8 which was funded by cardano ecosystem will help him with vast experience  mitigate the risk involved in the challenge proposed if funded.", "q0r": 5, "q1": "With the experience of the proposer, this proposal will be implemented successfully if funded, why do I say so, the proposer has elaborated on the usage of the budgetary allocation to various activities that are going to be run, that is from the week 1 to the week 12 he has been able to break down the budget into bit for easy understanding. The proposer has also provided details and links of people who will be working with him and this projects if funded and having gonea thorough background check i realized all these people are experience people in block chain business. Some of the people he provided their links include Shlomo Cohen, Assaf Liram, Benjamin Ben Zvi, Cole Bartlett and Razali Samusudin. The proposer has also provided the timelines and some of the strategies map up and the publicity of the Cardano through various Media channels both local and International to catch the attention of not only Africans but also to the world if funded.", "q1r": 4, "q2": "The proposer must be commended for being precise in presenting the measures to track the progress of his Project. According to the proposer and his team the weekly publishing of the caricature will generate Media views, Twitter, RT and other media channels which can be monitored. The proposer and his team also talked about the number of Africans who would be on boarded on the cardano ecosystem, the proposer and his team also in 10 inspire communities through caricature to build Bridges between communities. The proposer having been a member of wada would make judicious use of this money  which will be easily auditable if funded.", "q2r": 5, "assessor": "z_assessor_3260", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 13839, "q0": "Weekly caricatures can enhance and improve Cardano Catalyst outreach strategy in Africa. Effectively addressing the challenge of helping Africa become a Cardano adoption leader, art might be the key element that help us develop a more digestible communication with the wide audience. Considering the reluctance blockchain technology usually provokes in the wide audience, this kind of proposal might help increasing visibility and Cardano awareness in African communities. If education can be engaged somehow in these caricatures this kind of project might be a real changer in Cardano African adoption rate. Strengthening Cardano African onboarding rate might enhance dynamics and transactions and get to enjoy new and creative proposals that face African challenges and hurdles from a really out-of-the-box-thinking and bring real value to our community.", "q0r": 5, "q1": "Participating in Town Halls where community members can help this artist find the correct themes and approaches might be the key to successfully implement the proposal. Knowing Wada is collaborating with this artist is algo a guarantee of being correctly targeted into African audiences. Having this artist work already been successfully funded in Fund 8 and having set up efficient communication channels with different Catalyst members, this presented plan, a twelve weekly caricature, is highly likely this proposal will be implemented successfully. Also, focusing on sharing the material in different media channels will help enhance Cardano Catalyst marketing strategy. ", "q1r": 5, "q2": "Measuring auditability in social media reactions will be simple and easy. Getting into mainstream media will greatly increase visibility and this data will be sufficient to audit the progress and success of the proposal. For onboarding newcomers a more aggressive marketing campaign might be needed. Nevertheless, caricatures might help create an interesting amount of first impressions and a general understanding of Cardano existence throughout the African continent. Auditability process will be super efficient in order to enhance this artist’s project and the Cardano Catalyst challenge of growing within the African continent.", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "A weekly caricature that has an educative and humoristic purpose and that shows the opportunity of using Cardano", "experience": "40 years of experience making daily political cartoons for newspapers, in the largest/most read newspaper in Israel (Israel Hayom) , won multiple awards, NFT designer\nFunded proposer for Fund 8 on similar proposals :\nCARICATOR ADA \nUnited Caricature"}