{"id": 421067, "author": "gloiresalva", "title": "Vaccines and Family Medical Record", "url": "https://cardano.ideascale.com/a/dtd/421067-48088", "category": 26600, "amount": 26965, "description": "The problem of treatment and care taking into account hereditary factors of patients, vaccination and maternity. Reduction in infant mortality and inappropriate treatment", "f6_no_assessments": 6, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"id": 1074, "q0": "The proposers aim to develop a vaccination management system composed of a web app, a mobile app and a USSD (Unstructured Supplementary Service Data - a  protocol that is used to send text messages in a real-time connection) callback and interaction system. This will enable health providers to automatically schedule vaccinations, implement personalised monitoring of the vaccination process, management of medical files and financial transactions in ADA. The scope of this project is to reduce the mortality rate caused by low vaccination numbers or other untreated hereditary factors.\nWhile I find the scope and implementation of the app very powerful and noble, after doing a bit of research I found out that less than 50% of the people in Congo have a mobile phone. While the adoption rate is rising faster than in other countries, I feel it is still extremely low and when in relation to this proposal, I am wondering how much of an impact it can have on the population, if the majority won’t be able to use it? However, I imagine that in cities the mobile users are of a much higher percentage than in rural areas. As such, if the project were to be implemented in a city first and then gradually extended to the rest of the country, perhaps by that time the percentage of phone users will be a lot higher.\nAnother risk they haven’t discussed more in-depth is how can they raise the vaccination rate for people who refuse to take a vaccine shot based on their personal beliefs. Since this is a known problem in western countries, I was wondering how the team would be tackling this situation.\nHowever, I consider the proposal to fit the challenge brief well and to potentially have a wide impact upon the Cardano community. ", "q0r": 4, "q1": "Although in the auditability section, the team has answered the following to the project’s progress question “At this time, we are not prepared to provide this information given the confidentiality of health information. We need unanimous approval of our sample to comply with this requirement”, I feel like the detailed plan they have provided can also act perfectly as a progress checker. The plan is a very detailed table with checkmarks, timeframes and details arranged in chronological order. As such, every time a task would be finished, the team would be able to check it on the table, and the community would be able to verify that as well.\nThe budget, on the other hand, is not as detailed as the implementation plan. I appreciate the fact that each task has a clear amount attached to it, but there is no number of hours or hourly rates provided. As such, I am unable to judge whether the amounts are sufficient or reasonable in connection to the development of the project.\nThe team is composed of 4 developers, front, back and full-stack. They have only provided their GitHub links, but in their case, those can offer more info than a LinkedIn profile. The number of commits is large, proving that they have been actively working up until now. As such, based on the details provided, I would add that the team looks capable of implementing the project. \nI will rate this section a 4, since the budget is not exactly complete, but not incomplete either. ", "q1r": 4, "q2": "As mentioned above, in the feasibility section, although the team has considered that they cannot answer the question regarding the project progress, I find the detailed plan they have provided to be sufficient at the moment as it can act perfectly as a progress checker document as well. However, whenever they will feel comfortable sharing additional details on this aspect, I think it would be highly appreciated in a monthly Catalyst report or any other communication method they will be choosing. \nTheir success definition is very clear and easy to understand even for someone with no technical or blockchain experience. The reduction of infant mortality, the reduction in preventable diseases, mutual health insurance and many others are meaningful statements for anyone.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 15, "ne": 1, "ng": 13, "nfo": 1, "vca_o": 1}, {"id": 2430, "q0": "We note that the proposal adequately fits the challenge, as it aims to solve a historical problem on the African continent by using technologies from the Cardano ecosystem. With the success of this project, we would have a positive expansion of Cardano's visibility on the continent, opening the way for other similar projects to be implemented. Considering these factors, we have that the budget being requested seems quite consistent with what you want to accomplish.", "q0r": 5, "q1": "We noticed a good structuring of the actions designated for the project to be executed. We noticed that they cover several complementary steps and mention not only the development itself, but also the data collection and testing. As this proposal aims to reach a large audience, we also expect information to be passed on in a very visible way, and we have that this materializes because additional documents were made available to understand not only the timeline, but also the budget details. Regarding this detail, we found good capital allocations that even take into account the project's marketing. However, as this project aims to operate in the health market and various regulations will be encountered along the way, it would be interesting for professionals from other areas, in addition to development, to also be part of the project team. In this context, it seems promising that someone specialized in public policy will be part of the team.", "q1r": 4, "q2": "We have that the perception of success is quite consistent with the concepts that were developed during the proposal and really describes a scenario in which blockchain technology managed to make a difference in the health area. However, regarding the ways used to measure the evolution of this project, we unfortunately have a lack of information that impairs the auditability of the project as a whole. Even considering the confidential nature of medical information, it would be interesting if some parameters, even if conceptual, had been stated, such as the number of patients being registered on the platform or the average monthly growth of users.", "q2r": 2, "assessor": "z_assessor_2306", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1, "reply": "We fully agree with the author's assessment of the somewhat unclear auditability of the project. However, we have the impression that the author has not been fully focused on the elements provided with the proposal. In particular, we mention the fact that the idea is based on a duly admitted scientific work, the document of which has been attached (The document of the dissertation). In the conclusion, the author may well realize that the studies done have led to a conclusion such that the platform will have its place in the community. The document thus proves that this platform has a guaranteed auditability in this sense."}, {"id": 4611, "q0": "The proposal has successfully identified a unique challenge facing the African continent, I am referring to the problems presented by the health sector specifically in the field of vaccination, these problems are poor communication that can be presented as very frequent cases of forgetting vaccination appointments, organizational problems, implementation, monitoring and on the other hand the difficulty for doctors to establish the problems of medical history before making a decision for diagnosis and treatment.\n\nThe summary of the solution seems interesting to me because it mentions the management of the consultation processes in vaccines, detection of medical history of predecessors for appropriate treatment and management of medical records by the family.\n\nThese points of the problem and the solution seem to me very strong in the proposal and I expected a much more influential use of cardano blockchain technology in the solution, my recommendation for the team is to further investigate blockchain use cases in issues related to medical records for example, to how to handle sensitive and confidential data in the blockchain. \n\nWhen I started reading the proposal I was very interested because I had the expectation that they would talk to me about how the blockchain can make these kinds of processes more efficient, make them more transparent, make given the nature of Cardano technology, medical records for example digitized and recorded on the network, either as a non-fungible digital token or within a decentralized digital ID wallet. \n\nFrom my point of view addressing all these issues will make for a stronger proposition in the future, exploring the use cases of the technology and not just referring to financial transactions will open up the landscape more, it will certainly improve processes in the vaccination sector which will impact more on the adoption of the technology in Africa.\n\nAs for how it adds value to the Cardano ecosystem beyond carrying out financial transactions I do not see another element, there are solutions already in the ecosystem that allows making very easy payments in Ada, reading the proposal I could not identify metrics that align with the challenge, I can infer the creation of new wallets for doctors, patients, hospitals but it does not specify it, as a recommendation to the team it would be interesting to place metrics that align to this specific challenge.\n", "q0r": 3, "q1": "The proponent has provided links that demonstrate the experience of the people involved in the project, in that sense I found it a little strange that the proponent answered that there are no people in the project working on other proposals, Akilimali Cizungu Gentil is applying on two other proposals within the same challenge, there is nothing wrong with that but it is important to answer the questions honestly because it can affect the credibility of the proponent, assuming that it was a miscommunication between the members of the project or a detail product of inexperience in catalyst, it is important that the team understands the need not to omit these details and explain how the workload will be handled in the proposals submitted.\n\nI can highlight that the detailed plan is quite well done, the format seems to me useful also for the team itself, the tasks to be executed are distinguished, they are divided into phases and those involved in these tasks are mentioned, also the times are realistic and sensible, a strong point is that each task has a specific timeline that should help a lot in the auditability of the proposal. The budget is well broken down, expenses are identifiable and within an acceptable range.\n\nThe proposal could be improved if the detailed plan explains more in depth the phase of the integration of blockchain technology, for example the activity of handling payments in cryptocurrencies I want to understand that it is in Ada although it does not specify it, I am not clear which cardano wallet can be used, if the platform will have a connector wallet or if the platform itself will have the functionality to create the wallets for users, how will this onboarding be, etc.\n\nFinally it is important and I recommend to have an additional plan in case additional funding is needed, if the team believes that the probability of that happening is low it is also good to explain why they believe that, these details contribute to a better score and to me as a PA it helps me to have more certainty of the probability that the proposal will be implemented successfully.\n\nIn conclusion it is necessary to address the workload issue due to other proposals submitted, to detail more technical aspects regarding the integration of blockchain technology and to have a plan if more funding is required.\n\n\n", "q1r": 4, "q2": "The auditability in catalyst refers to how easy it is for the cardano community to see the progress in the implementation of a proposal, for this it is necessary a clear description of the problem, the proposal meets this point, then a clear description of the solution, this point is also met, it is important a roadmap with identifiable milestones over time, and given the format of the detailed plan also meets this point.\n\nNow it seems to me that there was some confusion on the issue of metrics or how the progress of the implementation of the proposal will be measured, the team argues that they cannot provide this information because it is confidential, but the metrics to measure progress are defined by the team and can be both quantitative and qualitative, these metrics depend on the type of proposal and what the team is interested in measuring depending on how they see the success of the proposal.\n\nIn that sense I could give some examples of metrics, I clarify that I do not have the knowledge or experience in the field, but reading how the team sees the success of the proposal, some metrics could be:\n\nNumber of reminders from the system that prevented missed vaccination appointments, this does not require confidential information just that the user gives feedback on whether or not they attended the scheduled appointment.\n\nThe time a doctor takes to identify a family medical record.\n\nAnd related to Cardano adoption, there can be metrics such as number of new wallets created, number of transactions made with ADA, etc.\n\nIt is important to place metrics to measure progress and also tell the community how this progress will be communicated, as I could not find in the proposal any text referring to communication channels, town halls, websites, social networks and taking into account that the metrics are not described, it is very complicated that the proposal can be audited satisfactorily.\n\nOf course the team would have thought about how to communicate the implementation but it is essential to describe it in the proposal and not omit it.\n", "q2r": 2, "assessor": "z_assessor_2575", "no_vca": 8, "ne": 3, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Good and fair evaluations. We confer the evaluator to the careful reading of the document that has been attached to find satisfaction to his fears about feasibility and auditability"}, {"id": 5846, "q0": "Wrong vaccination, failure of vaccination and failure to meet vaccination appointments is among the main issues in this area on infant and maternal vaccinations. A number of infant or newborn deaths have resulted due to some of these challenges. A web based application that will schedule appointments, remind and aid communications in this area is a critical need in Africa at the moment. I like that this proposal seeks to fill this gap. \nThis definitely has a huge local impact on the African health system. Where I am missing it on this proposal is how it will lead to onboarding and adoption of Cardano as a Blockchain of choice. I think it should be made clear. Apart from that this is a great idea", "q0r": 4, "q1": "The proposal outline what experience and skills needed for the success of this project, presents the number of team members and also gives links to the relevant experience of the team members. The plan is very detailed and has timelines allocated to specific milestones. The budget is reasonable for the proposal sort. The tasks and activities to be excited are simply stated by the proposers and very understandable. \nI think the proposers should add a practical plan of onboarding new users to the Cardano ecosystem and ensure adoption of the Blockchain technology. ", "q1r": 5, "q2": "The proposers could not present how to measure progress due to patient confidentiality. But I think information on progress should not necessarily include patient details but rather may include information like when a particular milestone has been achieved. However the team indicates what success for the project looks like in very clear and simple terms to enable auditability. I gave 3 because there are no KPIs to teach the progress. ", "q2r": 3, "assessor": "z_assessor_2754", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10714, "q0": "This idea is humane, if the proposal is successful it will bring a change to the whole health sector, but the proposal is presenting a dream idea because the proponent does not present a specific plan. With ideas like this already present in many other ecosystems, they still suffer from a few problems related to governments, medical facilities, third parties taking control of production health sector,... so activities have not yet been brought to life.\n\nReturning to this proposal, the proposal would create an application for (both website and mobile) Management of the prenatal and preschool consultation process (vaccines), detection of the medical history of the ancestors for appropriate treatment, I appreciate that the team did a bachelor's thesis on general injections for women and children (I appreciate that). But the team must define and describe the idea of ​​this application clearly to the developer team, must at least have a report on the activities in the application, the required features that the proponent wants ( for example, manage immunization schedules, medical information, patient records,...). I repeat again, this idea is very humane, but to create a suitable application and achieve success, it is necessary to clarify the plan description, with just a few short paragraphs describing how the solution is The proposal presented will not bring success from application development to communicating people's awareness and making them use this application.\n\nI rate 2 stars, the idea meets the requirements of the challenge, but the plan is not sufficient.", "q0r": 2, "q1": "This team surprised me quite a bit, because when the proposal was presented, I still thought that the member of the team was in the health profession and especially related to children and maternity, there was even a thesis about Bachelor's Project on Immunization for Women and Children. However 4 members providing profiles here are programmers and developers, I think the proponent should provide more information about the thesis. This is an advantage, so that we can test our experience. If team members are developers, this is an advantage, because they understand very well the feature requirements needed for an application medical apps (but still need to check their relevant experience) github links can only check experience that they are skilled in application programming, and experienced medical or other related experience cannot be verified.\n\nBefore viewing the source of revenue and profit, I will have a little criticism of the budget. This is a humane idea for the people of Africa, if it doesn't request fund for a proposal, the team can still crowdfund or request for a local budget (if possible), but why is the plan implemented? must begin in September, collecting the necessary data for the system. While waiting for the fund approval, the team can redo a report that fully describes the causes, problems and solutions, and also build a website with basic information (vaccine medical problems please propose to present), or you can include articles that demonstrate the knowledge and importance of vaccines for children and pregnant women,... there is a lot of work that can be started right away, why did the team start planning in September?\n\nIn addition, the vaccination will have to be certified by a doctor at the hospital or not? The proponent needs to show how this app will reach hospitals and convince the agencies to agree to this app work? The construction and implementation of the application will have a time limit of 4 months, in the 4th month (December - here the proponent wrote the wrong route) there has been activity for User tests of the functionalities carried out on the mutual health insurance (previous period) and put online, but the proponent has not mentioned such activities (where does the user come from, how will this application be introduced to the people of Africa...) .\n\nThe budget is nearly 27,000 USD, almost 80% is for application development, it is recommended to clarify the roles of the four d?eveloppers, who will be responsible for what application criteria, how long it will take to complete into, Health Insurance fonctionalities - what does this feature include? The Cryptocurrency budget part is $4250, I don't understand here what it represents to support the application, the proponent needs to clarify this section.\n\nThe plan and budget are having unrealistic and interrelated issues, so I rate 2 stars.", "q1r": 2, "q2": "I disagree with the proponent's point, \"At this time, we are not prepared to make this information available because of the confidentiality of health information. We need our sample consent to comply with this request.\"\n\nHere, the main product is an application (website and mobile application), the proponent can measure the progress of the project through the work of setting up the application, and about the information user can not need to publish (because it is a factor security). However, it is essential to provide the progress proposal (this application) to reach the health ministries, this certifies the developing proponent and introduces their ideas to the needy parties (hospitals are where children and pregnant women, and they also need information about vaccines and follow up on their medical records or timing of vaccinations).\n\nI strongly disagree with the proponent's point of view, as there are a lot of metrics, information, or activities that can be published so that the community can track progress. That is why I rate 1 star for the audit of the proposal.", "q2r": 1, "assessor": "z_assessor_3191", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1, "reply": "Good and fair evaluations. We confer the evaluator to the careful reading of the document that has been attached to find satisfaction to his fears about feasibility and auditability"}, {"id": 10991, "q0": "The proposal identifies a problem within the challenge which needs to be solved. This is a serious problem and need to be address by the community. The major concern of this proposal is about what this project can add value to Cardano ecosystem. How managing of the prenatal and preschool consultation process (vaccines), detection of the medical history of the ancestors for appropriate treatment and managing of the medical file by family could add value to Cardano ecosystem. It is a noble project, but as the fund that the project will use is the fund to expand Cardano in Africa. The key metrics and goals should be align with the outlined challenge and I don't think that the proposer provide that explanation in this proposal. This is a good humanitarian project, but the proposer need to think how this could scale and has sustainability in the future. The proposer can use the money to held a fundraising event for example, so that the money that will help people could be more sustainable and invite many people to care about the project. The Cardano can be the main sponsor to held an event, but not to be a money tree to keep providing this problem. ", "q0r": 2, "q1": "The budget is outlined clearly and broken down into identifiable items, but in the link https://docs.google.com/spreadsheets/d/1ls_sgnVOKPH_ltlYwaH0PGpdHtSPnnT4sJd_afSyTy0/edit#gid=0. there are some items in that use another language, like Voyages, hébergements et séjour, Traitement de données. It is better if the proposer can use English, so all the proposer can understand the items in the budget. The proposer provides evidence of relevant skills and experience needed to implement the proposal. They seems like a good team that can run this very well. They also provide good details timeline and budget in the proposal. The most important thing is how this could beneficial to Cardano ecosystem. We want to save lives and help many people, but we also need to be expanded and known to have widely adoption in Africa and worldwide.", "q1r": 3, "q2": "About auditability, the proposer said that \"at this time, we are not prepared to provide this information given the confidentiality of health information. We need unanimous approval of our sample to comply with this requirement.\" It is actually quiet simple to open an accessible public channel for delivering regular updates to the community. The team can use github, since all the member already have github and familiar with that platform. The Metrics/KPIs that define the success of the proposal are quiet detail and well planned. Some percentage will be helpful to measure the measurements of successes for this project. To say that the success means reducing the infant mortality rate in the DRC, reduction in the incidence of preventable diseases through vaccination, etc, is not quiet measurable. The timeline and roadmap are pretty clear and good.", "q2r": 1, "assessor": "z_assessor_3213", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "As noted for other reviewers, we refer to the attached document for a clear understanding of the exact scope of the idea"}], "solution": "Management of the prenatal and preschool consultation process (vaccines), detection of the medical history of the ancestors for appropriate treatment. Management of the medical file by family.", "experience": "I worked on my bachelor's thesis on the vaccination of women and children. I was able to understand and prove that a low rate of vaccination for children and women was at the root of many diseases that lead to the loss of life. The same is true for hereditary diseases. (African)"}