{"id": 421256, "author": "galsen19", "title": "Cardanonization of town halls", "url": "https://cardano.ideascale.com/a/dtd/421256-48088", "category": 26600, "amount": 20000, "description": "Administrative slowness\nIneffective.\nIn Africa, city administrator have great difficulty receiving or recovering their administrative documents in Théo event of an emergency or in the event of need.", "f6_no_assessments": 6, "f6_rating": 1.833333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2518, "q0": "Blockchain technology has shaken the traditional systems of finance, Governance and data management to their core. It has the potential to disrupte many sectors of the economy including the working of the Governments itself. The attempts of Cardano related organizations especially in Africa are testimony of that. IOHK, Emurgo and other Cardano related entities are trying hard to forge partnerships with African Governments to achieve that goal and provide the people of these countries with a better way of life. But all this is a very long term goal and will require years to fulfill. We will need shift in thinking at Government level, acceptance of Blockchain as a medium of Governance and lots of partnerships on institutional levels before we can expect any of such things to be accomplished.\nWhat this proposal is trying to achieve is quite confusing in it self but what I could understand, they are trying to achieve all this with a budget of $20000 and that too in 3 months although at a small level. What I fear is that they themselves have no idea what they are trying to achieve. I mean they are trying to use blockchain to do the tasks in a office which doesn't even have computers! More so for their given example of Birth certificates, it is not even possible to do such a thing with out having clearly defined laws which permit the issuance of such documents through Blockchain.\nIn my opinion this is a very ill thought proposal and lacks any substance to achieve the stated objectives.", "q0r": 1, "q1": "The project is divided into 3 months and activities defined by them to complete this project are as confusing as the proposal itself. Similarly the breakup of the budget of $20000 is quite random and gives no idea about how these activities on which funds are being spent will be able to achieve the objectives of the challenge. There is no details about the team other then just an email ID of one person. No details of number of people required to complete the task or people already working with the project. There are no links, whatsoever, about the social presence of these team members and no information is provided about their educational qualifications and previous work experience. \nAll in all this proposal is impossible to implement, in my opinion, and to be honest I am not even able to understand what they are trying to achieve and how that is possible in the current legal framework.", "q1r": 1, "q2": "The monitoring and Auditability part of the project is as hard to achieve as the previous two criterias. We don't know anything about the team, their previous work and if they possess required skills and even if the team is experienced and skilled enough, what they are proposing, or atleast what I understood of it, is beyond the scope of their Proposal. There is no plan stated in the proposal to provide regular updates about the progress of the project nor any way mentioned to share that data with the community. \n\nI really doubt that the team understands what they are trying to do and I will request them to find some guidance from the people in the Catalyst community through online mediums and try to come up with a proposal which can help in the adoption of Cardano in Africa and help their local population in the area with a better way of  life as is the objective they are trying to achieve. I wish them all the best.\n", "q2r": 1, "assessor": "z_assessor_2312", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 5094, "q0": "This is a proposal that indicated it was auto translated so I will work to explain and smooth some areas my assessment had some comprehension issues. FIRST, this is a $20,000 proposal request without having a Solution, or one that translated properly. In the SOLUTION area a problem was listed that \"in Senegal the Town Halls do not have computer database or intranet\". In the Impact section the proposer listed they would help municipalities with the problem of slowness and develop an information system on the Cardano Block, so citizens can request papers and receive in the mailbox; Integrate 100% of Government transactions in Cardano thru their local start up \"Gal'Sen.\n------------------------------------------------------\nMy take on this is the proposal is looking to develop a system to blockchain information, records and database via Cardano (good concept). However, where i got lost is with the opening statements of \"there is no database or intranet\". If this is in fact true - how would the blockchain be accessed.  There is no information given about this \"local startup Gal'San\" in the proposal so it is not verifiable.\n------------------------------------------------------\nThe problem if I read the proposal correctly could be a powerful issue. The solution could be transformative to administrative processes in Senegal. At issue for my assessment is if there is no intranet then the solution provided in moot. I would suggest to the proposer to re-work the concept and solution. You might consider professional assistance in Proposal development. A reach out to WADA should be considered. \n======================================\nMy assessment would have been a 1 star as it is written. Considering the auto translation feature and potential Language issues my rating is a 2 (disagree the proposal meets the objectives in the challenge) star.", "q0r": 2, "q1": "The proposer and team leader for this project list themself as having a degree in Human Resources. The LinkedIN - non -translated has some information to that profession. The person has 22 followers. In my experience a project of this technical nature would require a team leader with some serious technical and development experience. Especially, considering the biggest budget ask is $10,000 for (unspecified) computers for the (unspecified) team members. There are no budget items for Haskell or Rust or other Cardano-centric developers that should be needed to develop a municipal database issue with Cardano. There are broad budget numbers of 5K for work shops and 4K for \"web development and mobile\".\n-----------------------------------------------------\nThis is a weak and poorly written proposal, aside from the potential language differences.  The implementation plan is sparse, the timetable is not developed, the tech needed or projected is not explained  and the Risk Management is not realistic.\n=====================================\nMy assessment of this proposal is a 1 (strongly disagree that it is likely to be successfully implemented) star. I would suggest to the proposer to reach out to the Cardano Community for help in crafting a realistic and successful proposal.", "q1r": 1, "q2": "The actual audit statement is copied and pasted below for the voters to understand my assessment and critique. To the proposer - the proposal is when you need to have your plan fleshed out, details hammered and about 80-90 % complete. Most PAs understand there is wiggle room and refinements can be uploaded in the comments for everyones consderation.\n-----------------------------------------------------\nThis proposal plans on developing the audit steps after funding, which is not the methodology to get funding . the actual proposal text is: \" Define and respect the deadlines for each defined task.\n        Make weekly reports to know the progress of the project with the members\n        Set monthly goals for each project member\". I submit that as presented this project is not auditable. I strongly suggest as previously mentioned - the basis of your concept appears strong and needed by your African community! Your proposal is in the correct Challenge and meets the needs. Cardano is striving to fund projects that will help African Communities, led by local proposers that understand the ground. Your proposal though, needs to reflect the highest standards with the best solutions, with documented team leaders and members. Please reach out for assistance.\n======================================\nMy assessment is a 1 (strongly disagree that it is auditable) star.", "q2r": 1, "assessor": "z_assessor_2671", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6818, "q0": "I find the proposal very ambigous. The problem statement is confusing. I am not able to comprehend exactly what the proposer has identified as the problem. The proposal talk about recovering administrative documents and in another context, talk about birth certificate. The solution in the other hand, seek to develop an information system that will be launched on the Cardano blockchain where users can request their administrative papers and have them delivered into their mailboxes. The solution in itself is vague and i couldn't understand what way the proposer intends to build such a system by leveraging the Cardano blockchain. There's total inconsistency in the proposal right from the problem statement, solution, impact and possible risks that could threaten project completion is confusing. However, i find it difficult to efficiently and effectively assess these block of the proposal.", "q0r": 3, "q1": "The proposer provided monthly timelines with some milestones. However, there's no realistic timetable and or any conductible plan of implementation that show how and when the project will likely be executed. Not much is provided about the relevant skills required/necessary to implement the proposal, there's no information regarding the technical architectural structure of the final product. All these combined shows that the  team has very limited scope about the project and poor feasibilty research and as such, i have little confidence in the team. \n\nSince i have little understanding of the project/proposal, i cannot effectively assess the budget and then there is not much information about the team except for the project manager's email. The team need to go for an in depth research about the supposed project and try to figure out how to effectively integrate the implementation of same on the Cardano blockchain.", "q1r": 2, "q2": "The metrics and KPIs provided does not sufficiently allow me to determine how auditable the proposal can be. With no proper timetable to show a conductible plan of implementation and no public channel to deliver regular update, no understandable description of target problem, i highly doubt the possibility of attaining the proposers' perceived goal.", "q2r": 2, "assessor": "z_assessor_2831", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 8031, "q0": "The problem that will be addressed here is that Africa has great difficulty in receiving or recovering their administrative documents. The submitter wants to develop an information system that will be placed on the cardano blockchain. By doing this, any resident of any city will have the opportunity to request their administrative papers from anywhere in the world. This proposed problem can certainly be solved by building such an information system on the cardano blockchain. This proposal could have a positive impact on the cardano ecosystem. It will be important to conduct large-scale marketing campaigns to promote this product. Government efficiency will also be greatly improved by integrating government transactions into the Cardano ecosystem. The goals included in the proposal correspond to the outlined challenge. Some important future challenges are included. I still miss the legal risks part, which is the proposal.", "q0r": 4, "q1": "The only person included in the proposal is Mady Dia. You can find the relevant experience via the submitter's linkedin. It states that an experienced blockchain developer from the Cardano community will be called upon. This person is not included in the proposal. A breakdown of the budget is available. It would be helpful to include the number of working hours. The budget is sufficient to achieve the objectives. I find the implementation plan unclear. It could already be included in the proposal in which areas this project will be integrated. Expanding the project across Africa will require more financial resources. A timetable is included in the proposal. I personally think it will be difficult to reach all the milestones within a span of 3 months will be difficult. The implementation plan could be better defined. It should be written in more detail how everything will be done. The proposal lists the resources needed to complete the project. There are a few technical aspects included. A number of risks have been considered. Legal risks should also be included. It might be helpful to work with a lawyer to help with this.", "q1r": 2, "q2": "There is a road map with milestones. The project would be completed in 3 months. It would be better to take more time to finish the project. The milestones have been recorded. I think the milestones should be more spread out over a longer period of time. A number of KPIs are included. I think it would be useful to share these with the community via a website or social media. The petitioner has given a clear description of the problem that administrative documents are difficult to get to the people. (Africa) The solution proposed by the petitioner is a good solution. I just think it will be very difficult to involve the population in this. Not enough thought has been given to the different legislations in Africa. The project can certainly be a success, but I think it is better to collaborate with other teams to carry out this project.", "q2r": 2, "assessor": "z_assessor_2940", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 11260, "q0": "The proposal is asking for funds to build an informatics system that will be launched on the Cardano blockchain. This proposal fails to address the challenge they have raised. It is said that they would improve government efficacy by integrating 100% of government transactions into the Cardano blockchain network, with the goal of transferring cross-government paperwork to the blockchain through a new local start-up called Gal'Sen. This is extremely ambitious for the team. Their team is most certainly not fit for such a challenging task. The timeline they brought up was for 3 months and no one achieve that much in 3 months. In regards to the problem they see in the Town Hall, all those issues can be fixed with computers and web 2.0, there is no need for a blockchain tech there, at least as of yet. It is more likely that the people would adopt web 2.0 there first before jumping straight to web 3.0. ", "q0r": 1, "q1": "Based on the proposal the team is extremely ill-prepared for the task they want to carry out. They have only one web developer and expect said individual to guide the whole team on the technological side. If said individual is guiding the team where does he/she get the time to work? The proposal said they would also call on experienced blockchain developers from the Cardano community, but fails to tell us how many they will they employ. Their Project Manager, Mady Dia is a holder of an HR management degree but the proposal fails to tell her experiences. In regards to the team alone, there is limited to no confidence after reading the proposal. As for the timespan they have set out, it is 3 months long-only, where 2 months would be spent on training, web marketing, and social media, and then in the final month, they plan to launch even organization with the Mayors of Senegal. Personally, there are many obstacles here. The 2 months are they enough? Will the Mayors of Senegal show up? A lot of the plan is very shaky and upon reading it, no confidence has emerged. I also fail to see why the people of Senegalese Town Hall would jump straight to web 3.0 usages when they have not even utilized web 2.0 as there is no computing equipment there.  ", "q1r": 1, "q2": "In the proposal, it is said that the team will have \"define and respect the deadline for each defined task\", weekly reports to view the progress, and set monthly goals for each project member. It seems like the team still has to figure out what they will use to assess their progress. I fail to see how much the team can give in their weekly reports as for the first 2 months it is mainly focused on training and marketing. They do not have a monthly goal yet and based on their plan it is remarkably vague.  As for the audit of the success, the team stated that if the deadlines are met that is one means to assess the success, but what deadlines are they referring to? In addition, another means they provided is not going over budget. A project can fail even if the funds are not fully utilized. Next is the use of the Cardano blockchain for Senegalese Town Halls. Yes, this means can assess the success of the proposal. But as stated before, the likelihood of that is extremely slim as what they need can be accomplished without the blockchain tech. Overall this proposal fails to provide sufficient information for auditing both the progress and success. ", "q2r": 1, "assessor": "z_assessor_3233", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13576, "q0": "The proposal has a priority of cardano ecosystem colonizing Town halls in Senegal. Programming a system which will be launched on cardano ecosystem so that the populace will access their administrative papers is a very good way to ensure sustainability. The proposal clearly identifies a problem within the challenge which is the difficulty of understanding the Cardano blockchain and solving it by organizing blockchain training workshops in partnership with municipalities and promoting the project on social media handles.", "q0r": 4, "q1": "The proposal contains a good project idea however there is no links or references which authenticate the proposer and his team's experience and the relevant skills required to implement the project. Though the proposal mentioned a Web developer and a human resourse manager there were no leads or links to verify their identity. The proposal did not include the precise type and number of team members that will engage in the project. ", "q1r": 2, "q2": "There is no actual agency mentioned in the proposal to monitor and audit the progress of the project. Making reports weekly to track the progress of the project is good however it should be made to an independent body which will ensure that there is no lax but effort and time is put into the project to achieve the desirable results. The proposal did not describe the results to be expected and the effects it will bring on the town halls if the is successfully implemented. The information provided is insufficient to audit the progress and the success of the proposal.", "q2r": 2, "assessor": "z_assessor_3696", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Currently in Senegal for a simple reproduction of a birth certificate at the level of any municipality you will stay at least more than 24 hours without even having it sometimes more.", "experience": "After a few visit to senegalese town halls,i was able to find that most town halls do not have a computer database or intranet which would have facilitated their work,which is why the feasibility of the project is more than probable with all the bases that are already present."}