{"id": 421798, "author": "dynamicstrategiesio", "title": "Workshop 4-days in Angola", "url": "https://cardano.ideascale.com/a/dtd/421798-48088", "category": 26600, "amount": 22946, "description": "Partnerships with local businesses to sponsor education in blockchain technology, Cardano events, networking with developers and employment opportunities for participants", "f6_no_assessments": 6, "f6_rating": 4.722222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 3405, "q0": "Language barrier is one of the factors that can prevent someone to get access to the information , and to not be interested by a new topic or initiative.\nhaving information around the Cardano ecosystem and blockchain translated into Portuguese would allow people speaking that language to be informed. In Angola, the official language is Portuguese. By organizing an community event (workshop0 on cardano and the blockchain in that country and in the local language would attract more residents to attend. This may be a way to get new individuals and businesses to get onboard and be part of the cardano community in various capacities.\nAnother important element of this proposal is the fact that it has 2 parts 9 2 days for basic information, and 2 extra days of hands-on workshop). This would allow people who want to learn more to attend the entire session on 4 days and be able to start operating in Cardano.\nThis proposal aligns with the challenge objective since it may be an opportunity to onboard new members, to expand Cardano and to scale it up to business and individuals beyond the local community participation.\nMy rating is a 5 star\n", "q0r": 5, "q1": "The proposers team is formed by people with different and complementary professional background. Dimitry who seems to be more technical and will take care of translating the workshop contents from English to Portuguese, but also facilitate the workshop; and on the other side, the two other team members who are based in Luanda and who will take care of the promotion and outreach through their networks and contacts in preparation of the workshop.\nAs mentioned by the proposers, this workshop will be developed by taking into consideration some outcomes of the previous proposal funded in the F-8 funding cycle. What may be an asset in preparation of this one.\nThe chances of potential success of the current proposal are high. The budget and timeframe are clear and detailed.", "q1r": 5, "q2": "The roadmap is well presented with the plan to mitigate potential risks mentioned. The KPI,s before, during and after the workshop is conducted have been listed, but what would also be important to see, would have been the mechanism by which the community would be following the progress. reason of the 4 star on the auditability.", "q2r": 4, "assessor": "z_assessor_2458", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 5785, "q0": "I have always maintained that language barrier is slowing the adoption of blockchain and for individuals in Africa to take advantage of the opportunities the blockchain technology present. This proposal is addressing the challenge to ensure the language gap do not further deteriorate efforts and progress made in Africa by catalyst. \nThe proposal's solution is focus and aligned to help scale-up and enhance adoption of the cardano blockchain. This shows the catalyst ecosystem is reducing the huge language delaying the pace to grow cardano and blockchain in general in Africa. ", "q0r": 5, "q1": "From the description of the team, they have the skill, vast knowledge in blockchain and well organized to ensure a successful implementation of the proposal. Since the team have been funded before by catalyst, they have had the exposure deliver on the task. The work plan is brief and have important contents that would drive the understanding of blockchain. These milestones and schedules are not that ambitious to deliver but one that has clear roadmap for success. \n\nThough the budget is quite concise and detailed, it is important to reconsider the travel to Portugal for the translation into Portuguese. There should be local translators to undertake this exercise to reduce cost or translation can be done in Portugal and sent via mail for printing without necessarily taking flight. The travel to Portugal is what is making the budget a huge one. This will be important to divert the funds into a more blockchain literacy works.", "q1r": 4, "q2": "The team has put in place a number of KPIs to guide the progress of the proposal. These are important because it allows to measure every little activity taken to drive this proposal into success. This makes the evaluation of progress easy for the community. The proposal has also put in place a post-proposal implementation KPIs which are good for follow-ups to further track the impact of the proposal. \n\n", "q2r": 5, "assessor": "z_assessor_2749", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6142, "q0": "The point here is to partner with local businesses to sponsor Blockchain education, Cardano events, connect with developers. The team proposed a solution to organize a practical workshop in Luanda to attract funding and promote opportunities and work through local relationships. Geographically, Luanda is the capital and largest city of Angola. Is a country in South Africa. Has a population of 2,572 million (2020). Geographically it is convenient to proceed with the proposal and development of Africa. Propose detailed description and specific solutions. The workshop will translate for 4 days into Portuguese. The educational material will be divided into two parts (4 days). The first day will introduce Blockchain technology, the second day of the Cardano ecosystem, the third and last day: Cardano practice. The seminar days are arranged closely according to specific time. The workshop with the impact of helping people raise awareness about Blockchain in general and Cardano in particular. The training will be held locally and delivered by experienced professionals in the financial and technology sectors. The second part is to launch a Cardano node, interact, create NFTs, and interact with smart contracts. At the same time, the team has also recognized the risks in the project and has mitigation and mitigation solutions for those risks when the project is implemented.", "q0r": 5, "q1": "The team comes up with a clear and specific plan. The document will be translated in November and December 2022 and delivered in February or March 2023. At the same time, the translation into Portuguese will be published on the Web and will be freely used by the community. copper. The workshop document is also divided into two parts. In addition, the team provided a draft schedule presented for two months. And in those two months, the work needed to complete the project was also analyzed and explained thoroughly by the team. The team gave a very clear roadmap, we know all the work that needs to be done, how and at what time. Next is the budget. The proposal asks for $22,946, less than 10% of the total challenge budget. In my opinion, the requested budget is appropriate and clearly explained. The team has come up with a budget table that is broken down in detail through 3 contents: Translation, travel and event logistics. Budgets are allocated to tasks in a clear and coherent manner. Defined specifically for each specific hour, space and time. The team analyzed the Portuguese monetary budget (EUR) and converted it to dollars. Finally, about the team members who will be involved in working on the project. The group has three members and each member has a written introduction about them. We know their identity, skills, experience are suitable to perform the work on the project. At the same time, there are many attached links, they can understand more about their background, past and present work. Especially Dmitry, who will translate the conference content, has many years of experience in the field of technology, financial markets ... active on the Cardano and Cardano Stack Exchange forums, runs the stake group on cardano, is a contributor to the Cardano Developer Portal... all attached with links to access and demonstrate what was presented. The proposal in my opinion is highly feasible with all the presented proposals.", "q1r": 5, "q2": "From the master plan, propose to solve the posed challenge. Besides, the detailed roadmap, the budget is allocated transparently, the team members have many skills and experience. All make up a complete and workable proposal. Introduction to the audit. The research team is very interested in this part. Very good auditability. The team provided us with several KPIs to measure over time. It's a very qualitative analysis, which means we know what to expect and what impact this will have on some aspects of the Cardano ecosystem, especially people. Proposing through the workshop to help the community access, understand and work, develop the ecosystem. If the proposal is successful, it will be a new step forward for the proposed team, the Portuguese community, and the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7647, "q0": "The problem described in this proposal is closely aligned with the challenge. The team has done a great job by putting the proposal at the right challenge. \nMoreover, the proposal identifies a problem within the challenge which is lack of partnerships with local businesses to sponsor education in blockchain technology, Cardano events amongst others.  The solution resides in the organization and translation of a 4-Day   workshop into Portuguese to attract local partnership and development of the blockachain and cryptocurrency ecosystem. To develop a framework through which individuals, businesses and government can partner to push Cardano in Africa.\nThe proposal clearly articulates how it will add value to the Cardano ecosystem through networking, partnership, training and development of the skills and knowledge of people in the Cardano ecosystem. \nFurthermore, the proposal is able to scale to address future challenges by already translating whatever goes on there to other native speakers in Portuguese to undersatnd and follow the same guidelines to also have the same knowledge and training. It also clearly articulates a plan for the project's future sustainability since it is a continuation of an already funded project from fund 8. \n\n  \n\n", "q0r": 5, "q1": "The proposer provides evidence such as references, links, and websites of their work and skills they have accrued over the years  that shows they are more than capable of implementing and executing this project successfully if funded. Moreover, the proposer highlights on the the type and number of team members required to implement the proposal. Also, the budget is clear and also broken down into identifiable items which is reasonable to achieve the set goals.\nAnd most importantly the proposer has considered challenges and risks relevant to a successful implementation and how to mitigate them.", "q1r": 4, "q2": "The proposer shows a clear roadmap with milestones and a clear time horizon for achievement. The whole workshop will run for 4 days but more work will done pre-workshop and post workshop to ensure the community is apprised as and when needed through written reports and documentation of what transpires on the event days and it will be considered a success if it gets participants of more than 100 in attendance. \nIt shows a well-thought out Metrics/KPIs that define the success of the proposal which includes documentation KPI such as Number of slides prepared, number pages in gitbook , \n , and virtual machine image prepared, Event KPI such as event location identified and booked, number of registered for the first 2 days and others. \nThe main accessible public channel for delivering regular updates to the community for auditing progress is through the event GitHub and the Cardano Catalyst ideascale website amongst others. ", "q2r": 5, "assessor": "z_assessor_2908", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9411, "q0": "The Proposal would like to organize a 4-day Workshop in Portuguese, at Luanda, in order to attract local sponsorship and promote networking and employment opportunities through local contacts.  The education content is targeted for a workshop spanning between 4 to 8 days where the basics are covered for those who don’t know what a blockchain is and up to the point where the more tech-minded participants set up a Cardano node and learn how to interact with it and run smart contracts. The main content of the workshop includes: Translating the content of the workshop into Portuguese, Open-source the translation so other communities can use it in Portuguese-speaking countries, Organizing a physical workshop in Luanda, Angola; Attracting local sponsorship and Deliver the Workshop. This model can help Cardano value be raised and the trademark is broaden in scale. I give mark 5 for this criteria.", "q0r": 5, "q1": "This proposal is described particularly into hours of each workshop day. The writer also mention in detail the preparation time for workshop, including 2 months of translation and logistics preparation. In general, the plan is described logically, first month to translate the material for the first and second day of the workshop; second month to translate material for the third and fourth day of the workshop. The budget is described clearly and logically, including fees for translation, travelling from Portugal to Angola, accommodation, logistics fee. Participant into this program have good experience of financial markets and delivering large-scale projects related big technology. The other participants have experiences in marketing some sectors such as telecommunications, banking, oil and gas and services. In conclusion, this team have good competence to implement the proposal. Regarding the challenges, the writer consider the risk of Covid-19/ war impact leading to the absence on the workshop days. However, as for me the writer should also consider the risk people may not enter the workshop when the media does not work well. In this case, the writer should give some specific solutions of promoting media to ensure the number of participants into the workshop; this will affect the success of the proposal. I evaluate mark 4 for this criteria.", "q1r": 4, "q2": "The proposal is clear. Problem solving is easy to understand. This proposal has drafted valuable data to evaluate the success through Documentation KPI (Number of slides prepared, Number pages in gift book, Virtual machine image prepared); Event KPI (Event location identified and booked, Number of registered for the first 2 days - general public, Number of registered for the second 2 days - hands-on, Number of businesses attending the event), Post Event KPI (collected via a poll of participants 1 month after the event). This proposal also has good schedule to implement and follow. I give mark 5 for this criteria.", "q2r": 5, "assessor": "z_assessor_3052", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 11305, "q0": "In terms of impact, I believe this proposal solves the challenge very well. We need to expand the Cardano ecosystem and benefit Africa and indigenous peoples. The team that came up with the solution is the organization a field workshop in Luanda and translated a 4-day Workshop into Portuguese for the purpose of attracting funding and promoting local networking opportunities. I strongly support the view and believe it is a good idea to contribute to the development of the African diaspora in Cardano The team will translate the educational content of a 4- to 8-day workshop from English to Portuguese The content of the educational material is the basics of blockchain and Cardano (first 2 days), hands-on learning how to interact and build on Cardano (last 2 days) seminar to educate the Angolan community, the group effectively tackled the challenge The team proposed to increase Cardano adoption in Africa by discussing the use cases for blockchain and Cardano with local participants and businesses. In addition, the proposed group outlined the schedule of 4 seminars very clearly and in detail from time to content presented in the workshop. The project has identified the desired outcomes. These results often meet the key indicators of the challenge. The proposed content is also quite detailed and easy to grasp. Viewers can imagine the potential that the project will bring to the community in the future when completed.\n", "q0r": 5, "q1": "In my opinion, the feasibility of the project is high. We know what needs to happen for the project to happen (the tasks), and they are broken down by the week (in the delivery section). That way, we have a great view of the process, knowing what will need to happen and in what timeframe, which will help us test later. The roadmap divides each milestone in a reasonable way. Each timeline outlines the tasks and work items to be completed in great detail. In my opinion, the team should add to the proposal specifying the positions and the number of personnel to complete the work. The budget plan is divided into sections corresponding to the items that need to be invested (translating content from English to Portuguese, Portuguese / Angolan tourism, event logistics). Expenditure items are mentioned very clearly and in detail. However, I think in order to increase the transparency of the proposal, the team needs to clearly state the amount of funds used to pay salaries for how many officials to implement the project. The aim is to give the community a better overview of the actual costs of the project. The team members have diverse experience that can make the project a huge success. I can say that the proponents provided evidence (references, links, etc.) of relevant skills and experience required to implement the proposal. The team has done similar projects in the Blockchain space and that is something to be commended for. Therefore, it is very likely that this proposal will be successfully implemented.\n", "q1r": 5, "q2": "Regarding the suitability of the proposal, I think it is very well written. This proposal provides sufficient information to gauge progress in achieving the stated objectives. But I think the team should present more specific numbers associated with the timeline, and the indicators/KPIs of the project will become more transparent. The team mentioned reporting with the following KPIs will be generated at the end of each month, but I'm looking to see how they will go about their reporting. I think they can add it to help the community get a perfect picture of the proposal.\n", "q2r": 4, "assessor": "z_assessor_3235", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Translate a 4-day Workshop to Portuguese, give a physical workshop in Luanda, attract local sponsorship and promote networking and employment opportunities through local contacts", "experience": "Dmitry Shibaev, 20y experience in big tech and financial institutions, runs a blockchain company, speaks at professional events, and builds Cardano tools. Dalmo Silva and Ricardo Silva are local businessmen with contacts in the Telecom, Consultancies and Financial sector."}