{"id": 421871, "author": "dag1", "title": "COMPLETE African Artist On-Boarding", "url": "https://cardano.ideascale.com/a/dtd/421871-48088", "category": 26600, "amount": 20000, "description": "There is not a well defined process for on-boarding new African artists to Cardano, that includes proper considerations to barriers of entry into the Cardano ecosystem.", "f6_no_assessments": 9, "f6_rating": 4.2592592592592595, "videos": [], "media": [], "f6_assessments": [{"id": 2367, "q0": "This proposal intends to help local \"African Artists\" onboard their NFTs through twitter spaces instructions or whatsapp instructions.\nI wish the  application was an app that one can just login and upload images and it does the rest but it is not.This proposal is as manual as it gets and wont scale.\nHow do you handle 1000 Artist a day? how do you avoid scam? will you travel round the whole Africa to onboard Artists? etc\nI will be giving 2 stars for Impact according to the PA guidelines.", "q0r": 2, "q1": "The proposal provided a detailed roadmap with associated timelines of events.\nThe provided budget breakdown is detailed and justifies the requested amount and the information about the team members is detailed with verifiable links to work, bio.\nNow considering that The team will be working on multiple projects in fund9, it would have been great to know how the team will be structured if multiple projects get funded to achieve all the projects \ngoals at reasonable timelines.It is also important to point out if the other projects being worked, if funded are co-dependent on each other. \nConsidering the provided information, i am confident that the team are capable of executing the proposal to success.\nI will be giving 5 stars for feasibility.", "q1r": 5, "q2": "I feel the listed measures provided are not metrics to track the progress of the project as it has no set target (\"We will measure the number of original works the artist has created on Cardano\").\nHonestly, i do not understand how the values you presented will be validated by the community and it wouldn't be faked?\nI can neither agree nor disagree that the provided information is sufficient to audit the progress and success of the project.\nI will be giving 3 stars for audit-ability.", "q2r": 3, "assessor": "z_assessor_2301", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 5247, "q0": "Artists are among the people who can help spread Cardano even further. Because this proposal wants to create an onboarding systems to engage with African Artists with the tools and resources to enable them to become engaged Cardano Members, this is a pretty cool and unique idea.\n\nThe solution of this proposal is to use NFT technology. Specifically, each Artist will create a portfolio of NFTs on Cardano. In some cases, a digital camera will be used to capture an Artists' existing work in other mediums and mint to NFTs, then these NFTs will be displayed on the project's webpage.\n\nIn the process of creating NFT, Artists will be trained on knowledge related to Blockchain and Cardano, the process of creating NFT as well as the value brought to Artists, Artists' fans, and after that can spread Cardano widely to more people.", "q0r": 5, "q1": "This proposal is expected to be implemented within 180 days (about 06 months) and is divided into 03 main phases. In each stage, you mentioned each task to be completed. However, in order to help the community assess the feasibility of the project, the above works need to be described in more detail along with the expected results. For example, for the job \"Determine the Best methods of Communication (Whatsapp, Twitter, Discord)\", you need to clarify which method to use? What criteria to evaluate methods of Communication are appropriate? What is the operational plan for those channels? What are the performance metrics? Based on the above information, it is possible to know if your workload is suitable for that period or not.\n\nThe budget for this proposal is $20,000, but the costs listed and calculated by you are still unclear. So the figure of $20,000 is not convincing.\n\nThere are 03 members participating in this proposal, but the experience and qualifications described are quite sketchy, so it is difficult to assess whether you are qualified to complete this project or not.", "q1r": 3, "q2": "You use the index \"number of original works the artist has created on Cardano\" to evaluate the performance of this proposal, in my opinion, the index should be used as \"Number of NFT created on the Cardano platform” will make more sense.\n\nHowever, to evaluate the success of the project, you need to give a specific number with the above indicators. For example, it could be 500 NFTs created on the Cardano platform, which will make your proposal clearer and the community can easily evaluate the efforts of the members to achieve the KPI that is mentioned in this proposal.", "q2r": 4, "assessor": "z_assessor_2678", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5414, "q0": "As Africa is filled with well skilled developers and artist who can create unimaginable NFTs by there skill. But due to lack of support, Infra and Information they are still lagging behind.\nAs creating onboarding programs which leads to adding new NFT artists and developers will give boost to Cardano community and existing projects. As there is no proper way yet fully to onboard them, Having proper considerations to current problems for entering Cardano should be solved by expanding the current programs and more sub programs like creating wallets and funding them to build new NFTs for Cardano community.\nThe proposer effectively  addresses the challenge and I strongly agree with proposal.", "q0r": 5, "q1": "The links shared by proposer is quite interesting. The risk it all might carry solution provided is satisfactory. the detailed timeline is provided which is satisfying and project is divided into many phases and each month which work timeline also given .\nas project takes 6 month from inductor  to   \nfully operational. \nThe detailed budget  breakdown is provided and explained all cost requirement from \ndeveloper to marketing which is sensible.\nThe people working on this project have quite a experince whom can complete this project.\nAs boarding new artist is very much needed I strongly agree with proposal and with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The Proposer will be sharing number of real artist created for Cardano  and its transaction IDs as report for verification. As it will create jobs surely it will create impacts on there lifestyle . Number of active members and artist added to Cardano in 6 months will make look project successful. \nAs they have new plans to add referral program which inturns create more artist.\nOnce artist understand Cardano Blockchain It will increase and ease the process of onboarding.\nAs New African on boarders have lots of talent I strongly agree with proposal.\nThe information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2702", "no_vca": 9, "ne": 1, "ng": 4, "nfo": 4, "vca_o": 1}, {"id": 6058, "q0": "Aiming some funding towards onboarding African artists is a fantastic idea. Giving artists help in onboarding so they can spread the message of Cardano though art would be a win win win and fits the Challenge perfectly.", "q0r": 5, "q1": "The plan is well thought out and half completed already without funding. I looked at the provided links and tx ids, and they show proof of tasks already being completed.\nThe proposed plan is very clear and shows a good roadmap for onboarding the artists not only to Cardano, but into Catalyst as well; this adds a whole other community to help these artists. This approach is very exciting to me.", "q1r": 5, "q2": "New onboarded artists, ease of use for artists, continued use by artists, and tracking referrals. This should be more than enough to track and audit the progress and success of this proposal. Original art pieces on Cardano was also mentioned and is also a great metric. I would love to see each artist using Catalyst in future funds to gain momentum with this idea! Very well done!", "q2r": 5, "assessor": "z_assessor_2774", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 7650, "q0": "The problem described in this proposal is closely aligned with the challenge. The team has done a great job by putting the proposal at the right challenge. The challenge problem is getting African artists on boarded onto Cardano. The solution they propose is they are going to expand the current on-boarding efforts to include needs which has been discovered during the current on-boarding efforts. This includes wallet setup, funding wallet, and minting artist's work. The proposal clearly articulates how it will add value to the Cardano ecosystem through building a stronger Cardano and Africa by creating the necessary system to onboard Africans and ensure they are properly supplied and can bring Value to the Cardano ecosystem. The key metrics and goals of the proposal align with the outlined challenge settings and the proposal is able to scale to address future challenges by offering easier means through which African artists can get on board Cardano and become active contributors to the ecosystem. The proposal clearly shows a plan for the project's future sustainability.", "q0r": 4, "q1": "The proposer has provided relevant links to members of the team who will help in proper execution. The proposal and team from the links provided have the desired skills and experience to be able to execute the project should they be funded. The proposer knows the type and number of team members required to implement the proposal. The budget is clearly outlined and broken down into identifiable items. The budget is reasonable to achieve the set goals. The proposal offers a realistic timetable to complete the work and provides a sensible plan for implementation. The plan describes all the resources necessary to implement the proposal. The proposal clearly explains technical aspects like technologies that will be used for implementation.  And the proposer has considered challenges and risks relevant to a successful implementation and how to mitigate them.", "q1r": 4, "q2": "First and foremost, the proposers have been able to show a clear roadmap with milestones and a clear time horizon for achievement the objective of the proposal of successful on boarding at least 5 artists. That is to create a robust network of African artist who have the necessary tools to train and onboard others. Also they have a well-thought out Metrics/KPIs that defines the success of the proposal which is, they will measure the number of original works the artist has created on Cardano. They will provide transaction IDs of how the funds were spent and if these resources made a positive impact on the lives of the artist and many others. They have stated a clear understandable description of the targeted problem that can be measured against the proposed outcomes which all resolves around the artists and their work on Cardano. And more importantly, they have provided accessible links to the public for delivering regular updates to the community for auditing progress.", "q2r": 5, "assessor": "z_assessor_2908", "no_vca": 6, "ne": 2, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7873, "q0": "The proposal comes with an elaborate plan that expounds about onboarding systems to engage with African artists. The team provided the steps to be followed for onboarding and with purpose. The technology that aiming to provide everyone with way to engage with growing community. It create an effective onboarding strategy that leverage common obstacles preventing. To implement the project lots of efforts relied for finding artists. The proposer aiming to build a stronger cardano and Africa. By engendered the indispensable system to onboard Africans and ascertain they are properly supplied and can bring value to the cardano eco system. The proposer is also aware of various risks involved and also they have a solution to overcome them. ", "q0r": 5, "q1": "The proposal comes up with an three main phases like introductory period, Assessment of need and stable and growing phases that are measurable. The team request for a total budget breakdown for developer cost 4000, Possible artists needs $2600 per artist and for marketing and community bounties 3000. The budge breakdown is clear and practical. The 2 team member Dogwell and King brown artnft introduce are very clear heavy weight in their respective fields but the team member has no previous year of working experience. The long term goal of funding is to utilize a bounty system for project needing artists , this will be a process that will continue to expand as they onboard new artists. The proposer dire to achieve the goal by onboarding new African artists. ", "q1r": 5, "q2": "The proposal accurately measures number of works that artists has engendered on cardano. If the resources made a positive impact they have a referral system to track. The success and acceptance metrics are also clearly defined. Each success metrics are transparent and compact. This is an entirely new proposal. Artist is capable of onboarding and is now bringing in new artists to Cardano this would help for the project.", "q2r": 4, "assessor": "z_assessor_2929", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 11553, "q0": "The proposal introduces an onboarding program for African artists, providing them with the necessary information and resources to understand how the Cardano Blockchain can be leveraged to create a digitalized portfolio with opportunities to monetize the output of the creative process by minting it as an NTF on the Cardano blockchain.The proposal clearly aligns with the Cardano ecosystem by aiming for open and incentivized artist participation. The main goal also adheres to the challenge objectives of adapting Cardano for providing a virtual space for self-promotion, incentivizing art, and creating a growing community around Art in Africa. Furthermore, the proposal promises inclusion and registration in both Catalyst and ATH. By enrolling local artists, the proposal is likely to have a more local than global impact. However, by constructing a better onboarding system for artists in Africa, the procedure may be transferable to other regions facing similar challenges in the future.", "q0r": 5, "q1": "The proposer's experience is relevant for the project's success as he has previous experience with NFT minting and an active github activity and public repository. The remaining team members are Nigerian artists findable on Twitter. What I'm missing is a clear description of their role in the project, whether it's enrollment, translation, or education. The timeframe is divided into three phases with breadown of the actions undertaking in each including the final phase whre the  artist is expected to join Catalyst icommunity. When the total amount avalilable in the challenge is considered, I believe the total budget  for the proposal is relatively high. including cost for marketing without prior rationale (I guess it's for offering the artists' outcomes) and explanation how it was calculated. Some budget costs are not explained in the proposal, such as artist giveaways as well as community bounties. ", "q1r": 3, "q2": "In the proposal, a number of important KPIs were suggested to track how the network grows after unboarding, such as the referral system and the reach of each unboarded artist. The milestones and roadmap are clearly defined, and their execution is entirely dependent on the team's quality/quantity of work. What I'd like to know is how they will handle interested artists once the expected capacity of onboarded artists is reached. Will they register them and contact them later if some of those who have been onboarded lose interest and drop off? Risk management for deliverables is described in detail to address issues such as not having knowledge of the NFT minting process or assisting with personal issues outside of Cardano. ", "q2r": 4, "assessor": "z_assessor_3256", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13850, "q0": "Onboarding African artists into Cardano is a certain way of addressing the challenge of enhancing Cardano Catalyst Community through the enhancement of African communities. Helping and mentoring African artists and removing common hurdles and obstacles by levering their opportunities seems to be the right way to do it. Having African artist’s NFTs into Cardano will help them outreach a wide range of potential consumers and at the same time will help us increase our internal dynamics and transactions. This will certainly bring more value into the Cardano ecosystem. It is also to highlight that these newcomers will be potential new proposal creators and will bring new creative ideas and business. Getting artists to engage with our community and to know how Cardano foundation process functions can change their life-projects and open up an unlimited potential for them. Creating nodes and hubs of artists in Africa in Cardano will strengthen their lives and communities and will strengthen our Community at the same time. We should not ignore the communicational power art has and how this potential can help us achieve a wider audience and help us fight against the reluctance usually blockchain technology generates.", "q0r": 5, "q1": "Even Though team hasn’t got abundant experience in the Cardano ecosystem and are relatively new in the community they designed a really consistent plan and budget breakdown. Having them working one to one with the artists, interviewing and mentoring them personally will be the key element for this proposal to be implemented successfully. They are conscious that this will be a first experience and that will educate them on future project costs and challenges. Knowing their engagement with their purpose, the onboarding of African artists to a profitable ecosystem that helps their lives in a meaningful way is a guarantee that funding this project will be highly profitable for our Community in the long-term. ", "q1r": 5, "q2": "If the team handles producing audiovisual and narrative content might be the best way of auditing the progress and success of the proposal. Numbers of artwork and NFTs shared in Cardano or asking them how they spent their money might not be the right way to audit artists. Although this team just made a couple of artists onboard Cardano platform but these artists feel engaged and enthusiastic about Cardano’s dynamics this will already be a successful proposal. Strengthening communication channels with the whole of the Community in weekly reports and feedback surveys must be sufficient and enough to the auditability process. ", "q2r": 4, "assessor": "z_assessor_3833", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 14689, "q0": "This is a laudable initiative. The NFT market is still at its infant stage, with several market platforms.  Meanwhile, a lot of Africans still remain new to the NFT ecosystem. Therefore I agree with the initiative of the proposer – to enroll and onboard more African Artist into the ecosystem. This is definitely in sync with the grow Cardano, grow Africa challenge setting of scaling up the number of new Africa-based users on-boarded onto Cardano (wallets, platform sign-ups). The approach would help serve as bridge that enable African  artist navigate the NFT market and help them sell their craft to a larger audience. However, I believe a few things needs to be clarified here. What is the marketing strategy to attract artist for this project? There isn’t a long term sustainable approach to this project.\n", "q0r": 4, "q1": "The information presented on feasibility  is insufficient. Based on the information presented at the roadmap section, I think the framework for roadmap is concise and captures all activities that would be required for project implementation. However, I have few questions on the budget. Why would a provision of $2600 be allocated to  “possible artist needs” be necessary? Why would housing cost be necessary, when it is already captured in the possible artist needs? Isn’t the artist already having a housing facility? Why would budget for wallet funding be needed when there is a provision for giveaways to artist? I wish the author provided more details here. This project failed to provide the relevant justification for some of the amount allocation budgeted for. In my opinion, some items are not needed here (such as housing cost, etc), therefore I suggest the team restructure the project  to downsize the budget allocation. On the team experience, the proposer presents a 3 member team with experience in nft and a attached external links to their profile. But a look at Dagwell profile suggest that he has expertise in plutus and other field, however, from the profile presented from his LinkedIn profile, we see a person with a different name. This cast doubt on the professionalism and the transparency of the team. I suggest the refine the proposal to rectify these errors. 3\nAuditability \nThe information on the metrics to measure the success and progress of project are very precise and represent a more decisive KPIs. The KPIs are easy to identify and assess to monitor and track the progress and success of the project. It is however clear the proposer failed to adopt measures that enable the community access the progress report from these indicators.", "q1r": 3, "q2": "The information on the metrics to measure the success and progress of project are very precise and represent a more decisive KPIs. The KPIs are easy to identify and assess to monitor and track the progress and success of the project. It is however clear the proposer failed to adopt measures that enable the community access the progress report from these indicators.3", "q2r": 3, "assessor": "z_assessor_4093", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We are going to expand our current on-boarding efforts to include needs we've discovered during our current on-boarding efforts. This includes wallet setup, funding wallet, and minting artist's work.", "experience": "Dagwell- Plutus Pioneer third cohort. Extreme supporter of Cardano-Cli. Collaborated with several excellent Cardano projects in designing and minting native tokens.\nKingBrownArtNft- African Artist who is currently being Onboarded\nNnadichristabel6- Newest African Artist Joining"}