{"id": 422378, "author": "mavster04", "title": "Medical Records Ownership Protocol", "url": "https://cardano.ideascale.com/a/dtd/422378-48088", "category": 26600, "amount": 22500, "description": "Who owns a medical record? Who has the rights to access it? Is it the doctors, health facilities, or the patients? This has been an ongoing debate in the health sector.", "f6_no_assessments": 7, "f6_rating": 4.428571428571429, "videos": [], "media": [], "f6_assessments": [{"id": 1087, "q0": "The proposers have built a decentralised healthcare infrastructure on Cardano. It is still undergoing optimisation since it was finalised in 2016. As part of their infrastructure, they want to develop a medical records ownership protocol, a way to give patients their much-needed privacy back. At the same time, it will also provide access and interoperability to health care providers, all achieved through a permissionless health information exchange.   \nThrough the power of blockchain, zero knowledge and smart contracts, patients will be able to decide and set the sharing settings of their medical data and doctors, pharmacists and insurance companies will be able to access the required data only, and not get access to the entire patient’s history and personal details.\nThe research the team has provided on this subject is very extensive. Their white papers describe every angle of medical ownership, with reading, creating, editing, deleting, selling and more rights for each individual stakeholder, from patient to doctor and to medical facility.\nI view the proposal to be comprehensive, perfectly matching the challenge brief and with an incredible impact on the medical system not just in Africa but worldwide, as well. On top of that, the entire Cardano Ecosystem stands to benefit, as well, both from the great increase of transactions on the blockchain to the increase in adoption and popularity following the platform’s deployment in medical institutions.\nIf I could, I’d give this section more than a 5-star rating. Congratulations!", "q0r": 5, "q1": "The provided plan is extensively described. The timeline spans over a period of 16 weeks, and the tasks are well organised in groups of 2-3 weeks, depending on the team’s judgement of implementation. I especially appreciate the fact that the team has structured their timeline in such a way, as to have 2 weeks for quality assurance and testing towards the end, to make sure that everything is working as smooth as possible.\nThe budget is grouped per team member’s job, with a monthly salary ask and a number of months needed to finalise each task. The pay is not just reasonable, but rather on the small side, according to my knowledge in the blockchain space. But I see that the team is working from Africa and their passion is motivating them to have the project finalised. Overall, I find the budget feasible and realistic.\nThe team members' field answer is not as informative as the rest of the proposal, it doesn’t offer clear descriptions and LinkedIn profile links for verification, however, considering the amount of work that has been done so far, and the fact that the team has been selected as part of the Ariob Incubator, developed in collaboration with IOG, I see no reason not to trust their skills and dedication to the project.\nAs such, I will rate the feasibility section a 5, as I have no doubt that the proposers are perfectly capable of implementing the project successfully.", "q1r": 5, "q2": "I find the proposal progress answer to be highly professional. The tracking methods provided are very exact, their publishing location is also mentioned, which is Github, thus providing the community with an easy possibility to verify the proposal’s implementation steps as it progresses.\nThe success definition is also well described, mentioning the fact that each done task is a success, and that the team will be tracking each and every one and ticking it after finalising it. But the deployment of the medical records rights protocol is the final point of success, and after that, as the team mentions “this is considered DONE”.\nGiven all the extensive details provided for each of the two questions, I rate this section a 5/5.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 14, "ne": 4, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 1336, "q0": "The team has chosen a problem statement which belongs to health care domain focusing on the current existing organizational issue of how the medical documents are mainatined in health care sector especially on which entity of the health chain is supposed to hold these medical records (patient/doctors/health care centers) and the solution being proposed focuses on creating a decentralized exchange for medical records which can help managing the ownership enforcement to share and manage the records among all the different nodes of health sector chain. this solution will be integral part of the Hippocrades healthcare infrastructure. Hence this solution effectively addresses the proposed problem statement effectively as it addresses and provide solution of how the medical records' ownership can be maintained in a decentralized fashion.", "q0r": 5, "q1": "The proposer team is the team with prior experience in building decentralized solutions in health care sector as they have been core members in building \"Hippocrades\" (a decentralized healthcare infrastructure). The core team comprises of 10 members led by Dale who is the founder of Hippocrades and has co-authored multiple whitepapers having experience with entrepreneuship along a team of experts in field of software development who will help them build and integrate this protocol into platform backed by number of consultants. They are also backed bu Incubator based out of Africa. They have provided details regarding how they will handle the consensus regarding ownership of the records and have provided phases wise details on how they will be implementing in integrating with their infrastucure parts of which were previously funded bu catalyst rounds. Provided these expertise and implementation details it highly likely that the proposal will be implemented successfully.", "q1r": 5, "q2": "The team has provided all teh required details on how the proposed solution will be implented and have provided a week-wise devided timeline utilized for successfully implement each phases of the solution. They have also provided details of their previous and existing protocol and infrastructure along with links for whtepapers. They have provided descent fund breakdown based on the resources used throughout the process however a fund requirement/breakdown based on each of the phases would have given better provision to see utilization of funds in progress. They have also listed down the KPI Metrics wrt coding part and also based on KT for the same. They have also defined success parameters and mositoring successfully deploying of \"Medical records rights Protocol\" into Hippocrades Infrastructure. These details are sufficient to audit the progress of different phases of the solution implementation and also measure the success of the proposal. ", "q2r": 5, "assessor": "z_assessor_2228", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2373, "q0": "This is a very good proposal trying to reclaim individual medical records as regards to the traditional methods in most countries in which medical records are tied to only\nthe Medical facility visited.\nConsidering crypto access is global, it implies the team will have to address medical records of various regions with different laws.\nHow does the team intend to circumvent the current medical laws in countries with strict medical record laws?\nDo the team comprise of a medical doctor and in what region does the doctor practice.\nprovided link is broken (https://www.hippocrades.org/).\nOne reason i believe why medical records are guided is due tampering, giving those records to individuals can lead to this for whatever\n reasons beyond the control of the medical institution in possession of the medical records(current status in most countries).\nAnother issue is in most sub-saharan countries, Hospitals are not found there.I would have loved the team tackling first the shortage\n of Medical institutions first, then utilise those medical institutions first support to use as an example before expanding.\n I really believe this is a good proposal meant for the wrong region.\n We need more Hospital with good equipments not how to transfer our records(this is not a priority in Africa right now).\n I do not agree that this proposal will impact Africa positively(The target market is too small in the context of Africa) and i will be giving 2 stars\n for impact according to the PA guidelines.", "q0r": 2, "q1": "The proposal provided a very detailed roadmap with associated timeline of events and \nthe budget breakdown provided is detailed enough to justify the requested amount.\nDetails of the team is provided with verifiable link to bio.\nThere is a demo provided https://demo.hippocrades.org/ but couldn't login.It is always good to provide test credentials as regard to expect \ntesters using their information to login(discouraging)\nConsidering the provided information, i am confident that the team are capable of delivering the proposal and i will be giving 5 stars for feasibility.", "q1r": 5, "q2": "The proposal provided several items that can be used to track the progress and success of the proposal.\nI will encourage the team to make available the git links to the community(may a custom branch if privacy is an issue) so that anyone can independently track\nthe progress of work done.\nThe proposal success target is achievable and realistic.\nI agree that the provided information is sufficient to audit the progress and success of the proposal/project if funded.\nI will be giving 5 stars for audit-ability.", "q2r": 5, "assessor": "z_assessor_2301", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"id": 10799, "q0": "It is clear that this is a series of projects aimed at expanding the capabilities of Hippocrades, a decentralized healthcare infrastructure for Cardano. As a result, there are several links to other documents outside the proposal, and the introduction to the project is also noteworthy. I felt as if I were reading a transcript of a brief interview. You clearly define the project's primary substance, the target audience that the Medical Records Rights Protocol wishes to reach, the benefits it can provide to the Cardan ecosystem, and the objective risks that the project will face. However, I regret not being able to offer you 5 points because your solution introduction lacks detail. When the interviewer asked for more information concerning medical records ownership in Hippocrades, your response, \"We have written a white paper on it here,\" left me a little dissatisfied. Even if I know that all of the necessary content is in the offered link, I still look forward to reading a few introductory paragraphs before clicking on the link. So, I'm hoping you can elaborate on this.\n", "q0r": 4, "q1": "The proposal's detailed plan is broken down by week, with a list of specified actions and projected completion time. The detailed budget lists monthly salaries for four essential project positions. Furthermore, the proposal includes excellent team members with careers and vast experience in both the medical and technology industries. There isn't anything I wouldn't give you 5 points for throughout this entire presentation. However, I would like to remind you of one thing: as you have confirmed, your team member is working on another fund 9 projects, please include wording about management workload.\n", "q1r": 5, "q2": "With Hippocrades team's extensive experience and long road, you can easily imagine the success of this Medical Records Rights Protocol project because it is merely the implementation of this protocol into the Hippocrates infrastructure. But I'm curious if you've set goals to measure the project's success after Protocol is released. How many people are going to use it? Can people rate their satisfaction level after using it? And how do I know that the protocol has aided each individual's health care? I have so many questions since I can't see the important metrics that you are devoted to the Medical Records Rights Protocol project; all I see is the team's performance after 5 years of building healthcare apps. Please review and add to be enough.\n", "q2r": 3, "assessor": "z_assessor_3193", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 15070, "q0": "From my understanding, this proposal fits better with the challenge of dApps than with that of Africa. It is not satisfactorily explained why the project would be directly designed for the African continent and how it would especially benefit its inhabitants. It seems to me to be a global initiative, which serves all countries, without being specifically designed for the African context. At least, there is no explanation of this degree of specificity. It is certainly a relevant project for Cardano, to create a platform for enforcing proprietary rights over the medical data of patients/providers/facilities (such as hospitals and offices, I believe); on this platform, end users would have more control over their data and could use it to profit (companies often need this data to do research and develop products). And all of this would be minted on the Cardano blockchain. However, I reinforce that there would need to be more explanations about why this project would be aimed especially at Africa.", "q0r": 2, "q1": "What I like about the script is that the time division is very specific (based on weeks). Even so, it would be interesting to have more details about the activities – we know what would be done and for how long, but we don't have enough information on how. Who would and how. Regarding the budget, it is confusing what the “T” would be, I believe it would be like a thousand, for example 10t = 10k? This would need to be more clear. In my view, the way the financing was explained is very superficial, we don't understand in detail how the requested money would be used since the parts themselves are little commented, there is not a good detail. The team presentation part is very good, we know a lot of information about each team member and we also have several links to work they have already done, which conveys a good confidence in people's ability to successfully execute the project.", "q1r": 3, "q2": "It is said that tasks and deliverables will be posted on github and with that tracking/monitoring/management of what has been done and what is yet to come. We also know about some KPIs, used in projects previously developed by this same team. In other words, the auditability of progress seems to be well covered. When it comes to the final results, we also have some very interesting information about how this project would be considered a real success, but I believe there could be more depth here. My suggestion is that the team keep in touch with patients who used this platform later, how they would be learning to deal with Cardano technologies, how they would be making a more controlled and profitable use of their data, if they would have become active members the community and in what way... Overall as the project would have been beneficial to both Africa and Cardano, this information needs to come directly to our community (I suggest through a townhall presentation).", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15138, "q0": "An important question regarding medical record is that: “Who owns the data? Is it the individuals, the doctor, the hospital, or the government”? This is crucial especially in the developing countries that still lacks medical record structures. The proposal able to explain and articulate clearly on why this is a problem that is needed to be solved. The Hippocrades Team also provide a detailed paper covering how they will conduct the solution, that is to use blockchain technology to store medical records to the rightful owner. The proponent also able to address future challenge which is using this solution to provide Healthcare Information Exchange platform, which then will give opportunity for the owner to earn from his/her data. The risk mentioned for this project is the timeline deliverables, which is understandable in the software development field. All in all, the proponent is able to articulate clearly how they will solve the problem and is aligned with the goals of the challenge (which is to solve challenges unique to African continent, this time about medical health record). ", "q0r": 5, "q1": "The project have their team called Hippocrades Team, that have proven themself to be able to built a decentralized healthcare infrastructure for Cardano. We can check their relevant experience following the link to their website, their documentations, and their white papers. Hippocrades Team have also already built their Health Core system since 2016 along with other works, which further prove their experience and I have no doubt that they will deliver this project. The roadmap for the project is explained in detail in weekly manner, e.g week 2-5 : Right enforcement API for 20 days. Although I’d like to see more detail than just a brief description, I understand that in Software Development cycle it’s not easy to pin-point specific tasks right from the get-go. For the budget, it’s reasonable considering the team has 10 really experienced members, e.g Joff’s web development skill, Nad’s system analyst experience, etc. Improvement would be the budget to be broken down into more detail, such as hourly rate for each department or role. All in all, a highly feasible project that have a great team and experience.", "q1r": 5, "q2": "A clear roadmap has been provided along with the KPIs/Metrics, such as stable code, documentations, etc. Their progress is easily trackable from GitHub for their development, from monitoring, to manage activities of the team. We can track the progress by checking their tasks progress in GitHub. The definition of success is well explained, that is to create a Medical Records Rights Protocol that will enable ownership of health records data to the owner. All in all, a highly auditable project that is easily accessible to the community.", "q2r": 5, "assessor": "z_assessor_2255", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15268, "q0": "It is proposed to build a Rights & Ownership Enforcement Platform that allows users - patients, providers, and medical facilities to manage and check their medical records while still being able to share Share them in a decentralized exchange. I evaluate this solution to solve the needs of many people in the world because this is an individual's private data information, but they can hardly control to make sure this information belongs only to them and no one else has it. permission to view without the owner's permission. Anonymization is also subject to the regulatory policy of each country on medical data, which makes it impossible for outside companies to buy and sell such information without the consent of the owner. The proposed group also provides risks and solutions to these risks. Proposal to grow Cardano in Africa and fit this challenge", "q0r": 5, "q1": "The proposal states a 16-week implementation plan and the to-dos are also described in weekly or 2 to 3 weeks, I highly recommend this route. The proposed cost is also stated by the proponent as $22,500 to pay the monthly salary for 4 positions as reasonable. The references are shared fully and clearly by the team, the team members 10 people and the 3 key members are suggested to have clear information about their professional experience in the proposed area but the team should provide more. the social networking sites of members and other collaborating groups. I also tried to go in and demo at the link https://demo.hippocrades.org/cms/launchpad/main it was quite interesting. The team will also continue to submit proposals in the next Catalyst funding rounds", "q1r": 5, "q2": "The related documents provided by the team are very complete including (the White Paper on Hippocrades Infrastructure, White Paper on Hippocrades Protocol) and also the overall development roadmaps of the project that the team has implemented in 5 years. past year. The tasks and work of the development team are located on GitHub, and the team also has a fully updated project website https://www.hippocrades.org. Success in development is when the modules and features are listed and working, the success of the project is when the Medical Records Rights protocol is implemented and made available in the Hippocrades infrastructure. The project's roadmap is also fully shared by the proponent on the website", "q2r": 5, "assessor": "z_assessor_2714", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Rights & Ownership Enforcement platform that allows users - patients, providers, & health facilities to manage & audit their medical records while making them shareable in a decentralized exchange", "experience": "We are from the Hippocrades Teamthat has built a decentralized healthcare infrastructure for Cardano. We have been selected in the first batch of the Ariob Incubator / Iceaddis program in Africa which is supported by Cardano for high-potential startups."}