{"id": 422439, "author": "defidiscussions", "title": "Outreach/Education Ghana", "url": "https://cardano.ideascale.com/a/dtd/422439-48088", "category": 26600, "amount": 27600, "description": "Interest in as well as engagement with the Cardano community and project catalyst is lacking in West Africa but specifically Ghana.", "f6_no_assessments": 7, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 5788, "q0": "The proposal is addressing the challenge on the path of scaling-up widely and Ghana being the focal point of call is important for the countries to easily accept participation. The solution of the proposal is brief and seek to improve and enhance the education and awareness of cardano in Ghana. \nThe team has in place to organize monthly events to scale up he growth of the catalyst ecosystem. ", "q0r": 5, "q1": "The team looks experience with much knowledge in the catalyst ecosystem but the information about them is scanty. There are no links to check on their profiles to proof of their existence works done over the years. There are no proper action plan of the activities to be carried each month of each events. Sometimes proposed topics and timelines could be shared to make decision by the community. At least expected participants for each months could estimated to have a fair knowledge about how the events would have impact on the beneficiaries.\nThough the budget is reasonable, there's no much details on it. ", "q1r": 3, "q2": "The proposal has KPIs that could be measured to determine the success of the proposal. the milestones are clear with success on getting more participants to learn haskell. This would be easily audited to onboard local developers onto catalyst platform ", "q2r": 5, "assessor": "z_assessor_2749", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7438, "q0": "The project to help organize the monthly Cardano update event in Ghana. This helps to expand the Cardano ecosystem in Africa so it is a perfect fit for the Challenge. IOHK launched a Haskell programming course in Ghana last year, so popularity and interest in Cardano grew rapidly in the country.\nDefi Discussions team has launched in 3 countries Paraguay, Ecuador and Ethiopia through F5 and F7. Those are 2 very great projects, achieving positive results, receiving very good feedback from the community. The group's experience in organizing events is undisputed.\nRegarding risks, the proposal lists 3 issues but does not provide mitigation options. I would like to contribute the following comments, please create a social channel like youtube, facebook to update the latest news from IOG, and at the same time can take advantage of youtube's automatic translation feature, helping to reach more people, more object. From there it is possible to build a community run by the group. We can ask and answer questions on youtube comments, we can create live discussion topics via the Zoom application. It also addresses the three risks of the proposal: speaker, location, and security. I rate this part 4 points because you did not give a plan for the risk\n", "q0r": 4, "q1": "The proposed announcement would hold annual events but did not present a detailed plan, the community did not have enough data to evaluate the feasibility of the project. And also do not know the proposed implementation time. For example, names of implementation cities, speaker contacts, community connections, registration, behind-the-scenes work... How long does each task take to complete?\nRegarding the detailed budget table, I consider it appropriate, $27,600 for 1 year, including 12 events, accounting for ~5.5% of the entire Challenge\nRegarding the team, the proposal lists them as having a lot of experience with Cardano and the Catalyst fund. However, there are 2 issues to pay attention to, the members do not provide social networking links for the community to check. The members who are the project developers of F5, 6, 7 & 8, will they arrange enough time for this proposal? Please clarify the above 2 issues. I can only give 2 points on this part because the proposal lacks a detailed plan, a very important part", "q1r": 2, "q2": "In terms of progress metrics, the project lists three as number of attendees, number of people connecting with other members, and YouTube views. All 3 are intuitive and easy to quantify. Please provide a social network link and link youtube so that the project can update the indicators for the community to evaluate and the development process of the project. Regarding the attention generated from the newly launched Haskel course in Accra, attention is difficult to quantify, I want to replace it with whether the number of Haskel participants should increase or decrease compared to before.\nThe success of the project will help expand the Cardano community in Ghana, while continuing the success of 2 projects at F5 and F7. I rate this part 4 points\n", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 11404, "q0": "Project catalyst is a series of experiments which seeks to generate the highest levels of community innovation. Catalyst is bringing onchain governance to the Cardano blockchain by allowing the community to self determine priorities for growth. It also let's participants deploy funding to the which tackle challenges and capitalise on opportunities that arise in the life cycle of Cardano. As Western African specially Ghana lacks interest in Cardano community and project catalyst, hosting monthly network events to successful networking and discussions in Paraguay,Ecuador and Ethiopia help them. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The project has a detailed plan and timeline and proposer offers a realistic timetable to complete the work. The budget is outlined clearly and broken down into idenfiable items and is reasonable to achieve set goals. The people working with the proposal has project manager , asset acquisition manager , film director and media coordinator. The plan describes resources necessary to implement the proposal and clearly explains technical aspects necessary for it. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by measuring the number of attendees for events, views on YouTube for uploaded content, interest granted in newly launched Haskell course Accra and number of attendees connected with members of project catalyst or greater cardano through social media sites. The proposer provides evidence of relevant skills and experience needed to implement the proposal and knows on an identifiable manner , type and number required to implement the proposal. The proposer has considered challenges and risks relevant to a successful implementation. The information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 12425, "q0": "This proposal addresses the problem about Cardano's lack of interests and awareness in West Africa, specifically Ghana. It addresses this challenge by hosting networking events  in Accra, Ghana that will share crypto news, keynote speakers, as well as discussion session among participants (the events will mostly focus on discussing the Haskel course that has been held in Accra and its students). By having these events, it will bring awareness to Cardano itself, and it will further drive adoption through new ideas and collaborations from the community. However, I’d like more details regarding the topic list that will be brought up in these events because at the moment, the topic that will be brought up in this project (Haskel course) seems very general. ", "q0r": 4, "q1": "The team members have past experience implementing projects similar to this in past Funds (e.g. networking events in Ethiopia) The budget have been broken down into identifiable items, such as speaker fee, venue rent & catering, etc. and seems reasonable as the budget numbers are very similar to the past proposals. However, there is a gap between the calculation and total budget requested, based on the calculation provided in the proposal, the total for hosting 12 events is 24000 USD but the final amount requested is 27600 USD.  Where does the 3600 USD gap come from? There should’ve been explanations regarding this point. I’d also like more explanations on the marketing budget (what type of marketing? the medium for marketing?, etc.), so there’s a justification to judge the budget. The roadmap only stated that there will be an event hosted every month for a year. There were no concrete timeline and milestones regarding the event organizing and creating a schedule for the speakers. There should’ve been a detailed roadmap going over the timeline of the initial phase for organizing the events (e.g. duration or time based roadmap for searching and renting the venue, organizing catering, searching for speakers, etc.). At the moment, the roadmap lacks details and explanations to judge the feasibility of the project completion.", "q1r": 3, "q2": "The KPIs chosen by the proposer are “number of events attendees”, “number of attendees that becomes connected with other members…”, “views on youtube”, “interests garnered for the Haskel course in Acccra”. The metrics chosen are relevant measurement of the project outreach via the “number of events attendees” and “views on youtube” and these metrics are easily measurable. However, there lacks explanation regarding how the “number of attendees that becomes connected with other members…” and “interests garnered for the Haskel course in Acccra” metrics will be measured (i.e. is it through a form at the end of each event?, etc.). There should also be explanation on how these metrics will be reported so that the project performance can be tracked easily by the community.  ", "q2r": 3, "assessor": "z_assessor_3408", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 15075, "q0": "The impact is theoretically very good and in line with the objectives of the challenge. However, there is a lack of detail to understand what will be done, and with that we trust that the initiative will be beneficial for Africa and for Cardano. The idea is to create networking events, divided into 3 parts: the first would be an overview of news and opportunities from the cryptographic world, the second a lecture and the third a networking session with drinks and etc. More details should have been given about each part. 1) how will the news be selected? 2) what would be the themes of the lectures and who would be the speakers? 3) how would the networking moment take place, exactly, how to promote rapport between those involved? Also we don't know how the locals of Accra would be motivated to participate in the event, even though there is already a certain IOG initiative about Ghana (with the haskell course), I believe most people still don't know about blockchain/Cardano. It would be necessary to have security in the dissemination campaign. I think it's a good idea, but it would need more development.", "q0r": 2, "q1": "Unfortunately, this proposal does not have a script, no details are given on how the organization of events would be carried out, the creation of the lecture agenda, how the professional speakers would be contacted, what subjects would be addressed, how the public would be encouraged to participate, the days of each event, locations in the city, a more specific schedule for each meeting, etc. All this would be essential for us to understand the project development process. Talking about the budget, there are 12 events – each one has broken down parts, so we understand well how the requested money would be used. What is not possible to understand is why 27,600 dollars are requested if the expenses of the events are 24,000 dollars: what would the remaining 3700 dollars be? The team's presentation is not adequate because only very basic information about each of those involved is given. It would be necessary to understand more details, for example their professional careers in more depth and how they relate to Cardano.", "q1r": 2, "q2": "Some KPIs are suggested for measuring progress, they are the expected partial results. The data are very efficient for us to understand if the project would be achieving the success that was planned, little by little. However, it is also necessary to monitor the process of creating events, which would be behind the scenes of each meeting. The activities of the organizers, in short. It is unclear how this information would be collected. The success is summarized as “Expanding the network of Cardano/Crypto enthusiasts in Accra, better connecting them locally and internationally, would be a success”. Okay, but how can this be demonstrated to the Cardano community? It is necessary that the team do some type of research/study that can collect qualitative and quantitative data about the practical consequences of the project. Truly understand how all this impacted the lives of those involved and generated positive results for our ecosystem. All information commented here should be accessible to community members in a practical way.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15090, "q0": "The proposal fits well with the Challenge settings, as it aims to promote in person meetings in Ghana (Accra) to discuss relevant topics to the Cardano ecosystem (Crypto news and opportunities - DeFi). The impact of this proposal could be of a higher level as people from Africa (Ghana in special) of various interests (developers, Dapps users, crypto enthusiasts etc.) can be attracted to what the Cardano ecosystem has evolved until these days, thus bringing a lot of opportunities to them, being a win-win situation both for the community and the Cardano ecosystem.\n\nThe chosen location, the City of Accra, is the fertile ground needed for this project as the proposer states that \"IOHK launched a Haskell programming course in Ghana last year for about eighty students\" and with the right networks they can be involved more in the Cardano community. This what this proposal is trying to solve and this idea has a lot of potential.\nThe KPIs/metrics of this proposal seems to be inline with the Challenge settings as they are able to measure the local impact by users interactions with the provided learning materials and also how this community is growing via social platform interconnections.\n\nBased on these criteria I rate this proposal with 5 stars.", "q0r": 5, "q1": "The team consists of 6 members and some of them are briefly presented with their skills and experience necessary for successfully implement this proposal. It is somehow pity that, for this round, the team is presented with fewer details. In the last Fund, the proposer presented the very same proposal (https://cardano.ideascale.com/c/idea/400394) and also included LinkedIn profiles for some of the team members, but this time those are missing. It is relevant for the community to know who are the members of the team and how their area of expertise could be verified from reliable sources and also what is the role of each member in the team.\n\nThe budget is broken down into identifiable items and it covers the necessary expenses to hold 12 events in one year but some questions could arise (the cost for the speaker is an average value or is the same for each event?). We are living in a time with high inflation, so setting a one year budget could be somehow unrealistic related to the growing inflation.\n\nWhat is even more unclear for this proposal is the timetable. Based on the requested budget we can assume that the project will last for one year but a detailed timeframe (monthly preferable) is required to know exactly what type of activities are performed for each event. (speaker onboarding, gathering attendees, promoting the event etc.).\n\nThere are 3 challenges that are taken into consideration but is not clear how the proposer will mitigate them (having a backup speaker etc.)\n\nThis section of the proposal is acceptable but it needs consistent improvement so I rate it with 3 stars.", "q1r": 3, "q2": "he presented KPIs/metrics are helping the measure of success of this proposal but some other are to be taken into consideration (some sort of user satisfaction surveys - to have an insight about how the people resonate with what was presented and how at each event)\n\nThere is no public channel available (Discord, Twitter and even the defidiscussions.com website) for following the progress of this proposal nor a way to periodically present relevant info for each event and for entire year (delivering a monthly or by event report with relevant data to be diseminate with the community is a good way for maintaining transparency at a higher level).\n\nAs the roadmap of this proposal is inconsistent and because of the issues presented in this section I give it a rating of 3 stars.", "q2r": 3, "assessor": "z_assessor_2336", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 15230, "q0": "The problem described in the proposal has got to do with the lack of Cardano and project catalyst engagement in Ghana and this I would see has a very relevant link or addresses the critical points of Grow Africa Grow Cardano. Now, the proposal seeks to hold monthly networking events like similar to successfully funded F5 and F7 projects in Paraguay, Equador and Ethiopia, this I would say if funded will be able to bring on board so many of the Africans into the cardano ecosystem through education and sensitization because most of the times .\nThe metrics and goals of the proposal align with the challenge setting. The proposer has acknowledged the fact that the project currently will not be self-sustaining but envisions to return to Catalyst in later rounds to secure funds to be able to execute the project to the latter Hence I believe that the project will be sustained financially. Considering the nature of the proposal I believe it has the potential of bringing large numbers of African people to the Cardano ecosystem and this I will say has a very high scalability potential in the future.\nI am confident that the proposal makes an impact.\n", "q0r": 5, "q1": "The team (DeFi discussions) have been around in previous project catalyst funds and successfully secured funds in Fund 5 and Fund 7 and networked events in Ethiopia, Ecuador and Paraguay. Considering the relevant experience described about the team, I believe they are capable and possess the required skills to execute the project.\nThe proposal has a somewhat high level of knowledge about his team members and that I will see gives us the impression that the team will be able to deliver the project as required.\nThe budget $27,600 provided is well broken down into identifiable units and I think that makes it easy to access the feasibility of the budget considering the nature of the project, I believe the budget is reasonable to achieve the set goals. However the roadmap or plan provided is not detailed it does not give a clear timeline and key milestones or deliverables at every period. In fact the roadmap is not well explained to fully understand how activities of the project will be carried out this I will say in future proposals, it would be expedient that the proposer captures or describes a very detailed plan.\nThe proposal has stated some of the risks or challenges that may arise during the implementation of the project but what is missing is that the proposal has not stated or captured measures to mitigate this risk or challenges when they arise I will suggest that the proposer takes this into consideration in future proposals. \n", "q1r": 3, "q2": "The roadmap itself is very brief or it is not detailed and the milestones and timeline are not clearly stated. It’s rather unfortunate because it makes it difficult to determine duration of project and the deliverables. The metrics or KPI's provided are well-thought out as they measure the number of attendees for events, number of attendees that become connected with other members of Project catalyst, views on YouTube for uploaded contents from events but however, it would have been best that the proposer assigned specific numbers to the number of people that will be realized at the end of the project execution so that the metrics can be better appreciated. There is clarity in the problem described and I believe that the proposed solution is effective to address the problem described. \nThe proposer seem not to have indicated an accessible means whereby project updates can be communicated to the community. I will advise that for the sake of future proposals, the proposer should capture that and in fact can make use of the various catalyst pages on Telegram, Discord and other platforms such as Zoom etc. so that the community can track the progress of the project. ", "q2r": 3, "assessor": "z_assessor_2713", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Hosting monthly Networking Events similar to successful F5 and F7 networking projects managed by Defi Discussions team in Paraguay, Ecuador and Ethiopia", "experience": "The Defi Discussions team is currently managing an F5 funded networking event Ethiopia and two F7 networking events in Ecuador and Paraguay. Our team is seeking to expand the scope of our project to include west african countries starting with Ghana."}