{"id": 422553, "author": "quad33kpar", "title": "SHiELD Dapp, growing Africa digital", "url": "https://cardano.ideascale.com/a/dtd/422553-48088", "category": 26600, "amount": 255000, "description": "How do we stop corruption while improving the flow of information, plus productivity of the individual, the government, and the private sector in Africa. ", "f6_no_assessments": 5, "f6_rating": 3.2, "videos": [], "media": [], "f6_assessments": [{"id": 1322, "q0": "The proposal is identifying the problem that currently in Africa there is corruption, the flow of information is not good and as well as the productivity of individual & government sector needs to be improved too. The solution to these problem is a Dapp called shield, that will be based on free public-private database across the whole Africa. The Dapp will be developed by Shield.lab that is aiming to improve the whole Africa both by virtual and physical infrastructure, but the aim of this proposal is solely focused on funds for Dapp development. Based on the information in the proposal, it appears, that the application will collect information and create a database, which will be then accessible to everyone? The proposers are enumerating the various benefits such as doctors and healthcare will be using this database, or social security service, virtual identity, education records, labor assistance program and physical infrastructure (which I believe has nothing to do with the Dapp). Overall, the ideas are great, and I am pretty sure that Cardano is already aiming for storing Digital ID (DIDs) for the purpose of storing education records in some African countries, so if the proposer would be able to create such an application, it would definitely have a large impact on the whole continent. What is actually questionable is the Risk part – where NFTs are mentioned, but these were not mentioned prior anywhere in the text.", "q0r": 5, "q1": "Regarding the budget, the total budget requested is 255 000 which is more than a half from the total budget provided for the challenge. The budget breakdown is provided, but it is unclear for what timeframe it is required, because the roadmap is actually set till the end of 2032. Yes, 2032. Regarding the roadmap – it has 5 phases, whereas the first phase is planning – and it appears that it will be till November 2022, Phase 2 is devoted to research till the March of 2023, Phase 3 is for the test run, and it is expected to be done in June 2023, Phase 4 – the Launch is expected by October 2023 and then the Phase 5 till January 2032. Each of this phases are having assigned label (name) + set of tasks that the proposers wants to complete. Unfortunately, these tasks are not having assigned expected time frame, so we have no idea how much time will be spend on them, and we also can not relate them to the budget. Also, there is another thing coming into play – Shield coin. Regarding the team, there are three people mentioned without any bio or links to confirm or verify anything that was stated so far. So it does not actually look very credible. To sum it up – 1. Overall the idea is great, but there is lot of information missing e.g. will everyone has the access to all information? If not, how it will work? Who will be managing the database? Are governments or some institutions already onboard? Is something pre-agreed? What about the security, or abuse of these information? I did not see any risk covering it. What about people being rewarded for sharing their information – how they will be rewarded? Will it be via ShieldCoin? If so, where are the tokenomics? Also, I did not see a hiring process for the number of new members that will be needed anywhere in the roadmap – is it already considered, or will it cause some delays? Unfortunately, the proposal is very large and the funding should have been requested only for e.g. 3-6 months, present a high-level plan with a details for the foreseeable future, because right now, there is too many variables that are not explained or covered, so I disagree that it is feasible in its current form. ", "q1r": 1, "q2": "The problem – solution is clear, and the metrics that are considered as a success for the proposal are as follows: fully builded Dapp (October of 2023), mass adoption in Liberia (which according to the roadmap is set till June 2023), reliable identity system (is not Cardano already doing it?), widespread adaptation of the Shield Virtual Identity, both by states, and institutions and atleast 100 000 VID (virtual identities) by Q4 2023. Well, I think it will be very problematic for the community to keep the track because the roadmap is so long + it does not contain milestones e.g. on weekly or monthly basis. One way around is to develop a shorter-term KPIs, and provide public channels e.g. twitter, discord or telegram as a source of information. Another metrics that are worth considering it partnerships with states and institutions – because I am sure that it will take some time to negotiate terms according which these bodies would agree to cooperate. ", "q2r": 3, "assessor": "z_assessor_2222", "no_vca": 11, "ne": 4, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3368, "q0": "Based on the information provided in this proposal, I think it addresses a lot of the goals for the Grow Africa Grow Cardano challenge setting, but there are some questions I had about the proposal about the proposal’s relation to some of the other goals of the challenge setting. It is important to note that this proposal does not intend to build any platforms or services for Cardano, but rather build their own blockchain in order to fund critical infrastructure initiatives in Africa, such as the African Coastal Railroad Company, which will build rail links between all cities on the coastlines of Africa. Other services will be provided by the Shield DApp, such as healthcare data management, free virtual identity storage, and identity database for student information. While this proposal does address some of the goals of the challenge setting, like “proposals offering solutions to infrastructure and education concerns” and “Number of new African projects seeded in 2022,” this proposal does not address the critical point of the challenge setting which is growing Cardano in Africa. Based on what I read for impact, it did not seem like this proposal was aiding Cardano in any way. However, after reading the feasibility information, I did finally see a very small sentence hidden in the 2nd phase of their development that they plan to integrate with the Cardano blockchain. But I am still confused about whether the proposers want to make their own blockchain or make their own native asset on Cardano. While my point may seem insignificant, it can greatly affect my rating of impact for this proposal. If I know the project will be built on Cardano, then I can give a higher rating for impact. However, since the proposers did not explain too many of the details of where (on what platform) they will be making the project, I am in the middle of whether this proposal does or does not address the overall challenge setting. The proposers said they will be making their own crypto and NFTs to fund the projects, but crypto is a broad term. Does that refer to native assets on Cardano or their own blockchain? If the proposers could answer this question, it would greatly strengthen the proposal’s impact. (score given: 3)", "q0r": 3, "q1": "Based on what I have seen in this proposal, I don’t think it will be successful. The proposers broke down the timeline for the proposal into 5 stages that span 10 years total. The first stage involves identifying the app users, researching the app’s competition, and establishing the goals of the app and overall objectives. They will also conduct market research through hosting weekly zoom town halls. They will establish the ambassador program in Africa and identify hospitals and schools to join the program. The other parts of phase 1 involve developing a marketing campaign, starting a fundraising campaign (apparently the Catalyst funds are not enough, but more on this later),  and recruitment for the development team. The proposers provided a “best option” for their development team, but how do the proposers know that they can recruit the people they are hoping to recruit? I think optimistic planning is not the best idea here because you don’t want to promise something that you can’t guarantee. Having some developers already lined up for this project would have been the best course of action.\n\nPhase 2 involves forming the DApp technical team, coding the DApp, securing integration with the Cardano blockchain, security testing the system, and securing 5.5 million in funding for the first-year launch. Securing partnerships is also a part of this phase. Again, I think this is a bit ambitious, especially the 5.5 million in funding. Phase two of the proposers’ plan is supposed to take 4 months, but what happens if the proposers are unable to secure the funding they need or are unable to get the developers they need?\n\nPhase 3 involves launching the team in Liberia, something called “first 50 Shield backpack in service,” and more fundraising to develop the Shield center (which was never explained). If the proposers could clarify what the last two are and what their purpose is for the overall plan, it would greatly help me rate feasibility. As it is, the proposal does not do a great job explaining all of the details, which makes it hard for me to rate feasibility. Simply saying things will happen does not show me that they will or that this proposal can be successful. \n\nThe 5th phase involves building the Shield center, partnering with the Liberian government, partnering with every school in Liberia, 1 million virtual identities on Shield, and launching Shield in western countries. Again, very ambitious goals, but the proposers listed that this part of the plan will last roughly 8+ years. \n\nBesides the lack of information about some of the plans the proposers have, I have questions about data privacy. In the description of the Shield DApp, the proposers said “A public-private free decentralized application to be utilized by the people, governments and private institutions, with the ability to compensate all users of the Dapp for use of their data for data research.” The only mention of consent by the data owner is a few words in the auditability section. The proposers definitely should have provided more information about this in the other sections of the proposal instead of just a few words at the bottom. \n\nThe budget of the proposal seems pretty high ($255,000 requested in total), especially since it is a majority of the challenge setting funds and the breakdown is a bit vague. The proposers should mention how many of the phases are covered by these expenses. They specifically mentioned that they will conduct fundraising for over $5.5 million during some of the later phases, so I assume that these funds from Catalyst will not be enough. Also, the proposers listed the amount paid to each position, such as $15,000 to the project tech leaders (how many tech leaders will there be?) and $60,000 for the Atala Prism advisor. However, earlier in their plan, the proposers listed 13 different positions, but only mentioned funding for 5-6 positions. Explaining how the other positions will be compensated would help me rate feasibility. In the section about coming back to Catalyst to receive other funds, the proposers simply said “To add SHiELD.Lab to all 54 countries in Africa” without providing any reason why or how this relates to the question. If the proposers could address this, it would also clarify the proposal. \n\nLastly, there are three names mentioned on this proposal, James Chelley, Clarence Saah Cole, and Grace Akel Jallah. Their roles are program and database architect, program director, Africa, and partnership acquisition, respectively. However, no links to LinkedIn or any resumes were included, so I have no way to verify the identities of these people. There are no ways for me to know for certain if they have the necessary skills to complete this proposal successfully. \n\nSince there are many issues I had with the proposal with regards to feasibility, I can only give this proposal a score of 1 for feasibility. The plan is very ambitious, and not many details were given about specifics, like how they can guarantee they will get the necessary developers or raise 5.5 million in funding. The use of funds from this proposal also were not clear in terms of how much of the plan will be accomplished with these funds. (score given: 1)\n", "q1r": 1, "q2": "Based on the information provided in the proposal, I think that it is fairly auditable by the Cardano community. The proposers mentioned how they measure success in a unique way, but then did not go on to fully explain what their method of measuring success is. It seems like the main measure of success is to become the main source of virtual identity used by African governments, institutions, and corporations. The proposers did list some decent metrics of success, such as completing the DApp’s development and 100,000 virtual identities created by Q4 2023. However, all of the other metrics given were a bit vague. The metrics could have been more specific to provide a concrete way for the Cardano community to track success. For example, instead of saying “Mass adoption in Liberia,” the proposers could have said “20,000 users in Liberia.” That way, there is a direct comparison for the Cardano community to track. Doing this for all of the other metrics would have greatly helped me rate auditability. Also, the proposers did not list any website or place they will share the progress of this proposal. A place to share information is a key part of rating auditability, so I can only give this proposal a score of 4 for auditability. (score given: 4)", "q2r": 4, "assessor": "z_assessor_2457", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8039, "q0": "The proposer of this proposal aims to tackle various issues such as stopping corruption, improving information flow, the productivity of the individual, government and private sector in Africa. The submitter describes in 6 dots how SHIELD.lab and the SHIELD FOUNDATION will help the development of Africa. The submitter wants to solve this problem by means of SHiELD.Labs. This is a free fully decentralized and centralized ecosystem for the people of Africa and the African diaspora to use blockchain as a tool for economic growth and stability within the continent. The goal is to build virtual and physical infrastructures that are self-sufficient. SHiELD.Lab consists of 3 main projects. (The SHiELD.Token Project, The SHiELD.Dapp Project and The Capital Interstate Project) The submitter shows through his explanation why SHiELD.Lab can offer a solution to this problem. This project will have a positive impact for the Cardano ecosystem because it is free and can be used for all countries in Africa. (decentralized database) The main goals are included in the proposal and correspond to the outlined baseline settings. The main risk is financing.", "q0r": 4, "q1": "Some names have been included in the proposal who will participate in this project. No links have been added to check their relevant experience and skills. You can track the experiences through the AU.SHiELD Foundation website (https://aushield55.weebly.com/who-we-are.html) The timeline does include a number of large teams that will help complete the project . ( MLabs, IngularityNET, Ptala Prism from IOHK,.... ) By collaborating with these teams it will certainly be possible to implement the proposal. A breakdown of the budget is available. It might be useful to include people's hourly wages. An estimate could also be made about how many hours will be worked on certain parts. In the division there are recognizable items such as legal costs, internet and rent,... . It will be returned for additional funding to add SHiELD.Labs to all 54 countries in Africa. A realistic timetable has been included to complete the work. (5 phases + milestones + date) Sufficient time has been provided for these 5 phases to be carried out. A sensible implementation plan is included that shows what and how everything will be done. The technical aspects are included that are crucial for implementation. The only risk is financing. I think the proposer could perhaps do a more extensive risk analysis to include other challenges.", "q1r": 4, "q2": "A very clear roadmap has been included with associated milestones. The project will be divided into 5 phases with associated milestones. The proposer has also ensured that exact dates are included for the completion of each phase. The blockchain will be considered a success when it is operational and will be used in several countries in Africa. Some KPIs are included to see if this project is a success. (100,000 SHiELD Virtual identity activated by Q4 2023, Mass adoption in the country of Liberia,... ) It would be useful to target these statistics on social media so that progress can still be followed. The petitioner has given a clear description of the various problems that need to be addressed in Africa. (Stop corruption, improve information flow, productivity of the individual, government and private sector in Africa.) By building and using SHIELD.lab these problems can be tackled across Africa.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 11525, "q0": "Proposal targets to solve Africa’s fundamental issue – virtual identity (DID) and its interconnected sub issues like healthcare database, social service, education enforcement, insurance. Part of solution is as proposed building smartphone app (SHiELD dApp) that would be utilized by people, governments and institutions and compensate users for use of their data for data research (with their permission). This is very similar to project Atala Prism and its goals. There also goal of SHiELD organization to build physical RailRoad and Highway infrastructure connecting capital cities in Africa if newly created Cryptocurrency reach $1, in proposal is missing volume for supply of coins – as only price is insufficient for calculating market cap this is very low-quality information. Self-sustainability of project is determined by price of created Cryptocurrency and income from NFTs. Also, project wants to secure $5.5 million in funding (not stated where). Therefore, I see self-sustainability as totally unreliable. Proposal lacks detailed clarification of solutions that address challenge and provides a low of general information/thoughts what will be done. I suggest rebuilding proposal for more specified version with well thought details. Lot of work in this field is done already by Atala Prism so joining their initiative would be better suited. I do not see added value in here as project developed directly by IOHK already exist.", "q0r": 1, "q1": "Proposal contains only one image with names on it and 3 names in proposal feasibility section for proposal team, with no references like LinkedIn account or other. I found website (not referenced from proposal http://aushieldfoundation.org which should be linked to SHiELD Lab. Also, in website, there is no reliable data for relevant skills of proposal team and experience needed for this huge project. Proposal team wants to contract a lot of specialists, but there is no information on who is already up for idea. Budget for this project is immense as it targets $255000 which is half of challenge budget, while this is only of small part of total budget needed to successfully deliver proposal. Budget split is very poor as is only contains money needed for different roles, without time spend estimation, price breakdown etc. Timetable is set for around 1 year with target of 1 million DIDs on SHiELD, partnership with every school, full launch if all west Africa countries, this is unrealistic as building, testing app takes a lot of time, also lot of time and work is needed for making partnerships with government/institutions, promoting it to different places and lots of groundwork in there. Proposal defined only funding as risk, this is huge risk. Proposed solution to mitigate risk, is as already mentioned, to build own Cryptocurrency and NFT – this takes time and resources, needs propagation, adoption in marketplaces (can be good idea if carefully planned, not in this proposal). A lot of unconsidered risk are from inability to contract right people needed to build dApp and cryptocurrency, to efficiently promote it, and ability to reach governments and institutions. No solutions for this are provided in proposal. Therefore, I do not see this proposal as feasible.", "q1r": 1, "q2": "Roadmap with milestones for five phases for auditability is set a progress can be audited by Catalyst. Success is defined as 1 million SHiELD virtual identities activated (in 2 proposal section different KPIs - feasibility 1 million, auditability 100k – big error), which is good tracker. On informational website a lot of data of school/hospital/other adoptions can be shared and therefore audited. Proposed problem is to stop corruption while improving flow of information. Metrics/KPIs do not solve corruption defined in problem statement and cannot track its achievements in solving corruption, but, if project is successfully implemented and used, it is effective solution a lot of problems in Africa (virtual infrastructure/identity, healthcare, social and education improvement).", "q2r": 4, "assessor": "z_assessor_3255", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 13405, "q0": "I think this proposal will go a great mile to improve infrastructure in Africa. Their initiative to put a stop to corruption with suggested means of putting power into the hands of individuals both public and private is a well thought solution. I also think that their effort to improve various infrastructure such as schools and hospitals and make it easily assessable and more comfortable for health worker will greatly improve the standard of living of Africans at large. I like the fact that they want to build or establish companies in most African countries to provide employment for individuals in those countries which will grow productivity and help lives.", "q0r": 5, "q1": "Honestly, from what they provided, I'm very impressed with how they have targeted their aim. It shows how serious they are. They also attributed themselves to the use of technological means to identify and share their work with the public putting themselves and company out there for individuals to know and assess easily. They have a well timed timeline which with the needed support looks like they can acheive their aims. They also plan to partnership with schools and hospitals around the continent to each each other grow. They also seem to have experts in various fields from different parts of the world to share different ideas to help grow Africa.", "q1r": 4, "q2": "I think that their progress and end result provided in their info is ok. They have a nice idea of wanting to establish and spread the virtual identity by use of SHIELD Blockchain around the continent. If their proposal is accepted, it will go on to make strong and solid impacts in the lives of individuals with them basing strongly on healthcare which is underdeveloped in Africa.", "q2r": 4, "assessor": "z_assessor_3619", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "The protocol provides a free hybrid public-private distributive decentralized database for all Nations within Africa. ", "experience": "A.U SHIELD Foundation is an independent body based in Liberia with core responsibilities to oversee & supervise the development of Africa's first public private blockchain and its ecosystem. The non-profit organization consists of local community political and business leaders."}