{"id": 422598, "author": "salmen", "title": "Decentralize Impact", "url": "https://cardano.ideascale.com/a/dtd/422598-48088", "category": 26600, "amount": 25000, "description": "The lack of guidance, support, building and networking opportunities in the Blockchain, Web3 & Crypto communities in Tunisia. These communities are full of talented people, but they are scattered. ", "f6_no_assessments": 8, "f6_rating": 4.125, "videos": [], "media": [], "f6_assessments": [{"id": 3370, "q0": "Based on the information provided in the proposal, I think that this proposal does not fully address the objectives laid out in the challenge setting. This proposal aims to guide at least three teams of participants to “put their business ideas into a realizable and scalable business model, and guide them to find the proposer investment through decentralized funding.” This underlying goal is something that I believe addresses the challenge setting, but only if the projects that are incubated by the program are built on the Cardano blockchain. From what I read in the impact section, it does not seem like the proposers made any specific mention that the projects would be on the Cardano blockchain. I assume it is implied, but still could have been worth mentioning to clear up confusion. \n\nThe proposers have broken down the plan into multiple phases. In the sourcing phase, they plan to create a system where people are incentivized to create content to build interest in the program with tokens of some kind. There will also be some hackathons where the winning participants will qualify for the Catalyst program (as a part of the Catalyst phase). In the Catalyst phase, the proposers will create a DAO where teams’ ideas can be incubated. Advice will be provided to the teams during this phase. Then, the incubation phase involves the incubation of 6-8 projects that are voted on by the DAO. Experts and mentors will provide the team with advice. Then, in the funding phase, community members can stake their tokens to their chosen projects. 50% goes to the engaged community rewards, 20% to the experts and mentors, and 30% to the program partners. The projects are funded by the DAO once they reach their funding soft cap. I do have some feedback on this section of the proposal with regards to clarity of the objectives. Firstly, I think it is confusing for the proposers to use the term “Catalyst phase,” especially when this falls within the context of Catalyst on the Cardano blockchain. The catalyst phase referenced in the proposal does not seem to have any connection to the actual Cardano Catalyst, except for name. This superfluous feedback is more of a semantics thing, which does not factor into my rating of this proposal. It made reading the proposal more difficult, so I am pointing it out to the proposers. Also, there was no mention of how the DAO will be developed or how DAO funding will be obtained. \n\nThe proposers listed some good challenges that they may face, but I don’t think that their solutions to the problems are fully sufficient. For example, “Community growth and management” is not a mitigation strategy for “Ability to bring together a community on the DAO.” There would need to be much more information in the solution in order for me to have confidence that the proposal can address its future challenges. How can the proposers grow the community to overcome the challenge of struggling to build a community? Actionable steps are needed here.\n\nOverall, this proposal could add value to the Cardano ecosystem, but there was no explicit mention if the projects incubated will be built on the Cardano blockchain – all that was mentioned was that the incubated business ideas would be decentralized and that the proposers would promote the Cardano blockchain throughout their 4 stage process. I think the key difference is implied versus stated. I can’t infer too far away from what the proposers said (because I don’t want to make false inferences about the proposal), so my assessment is mainly based on what is and isn’t said. There is potential, but I can’t jump to any conclusions since I can only go off of what was said in the proposal. The proposal can align with the challenge setting because it can bring in new Cardano developers or entrepreneurs from African countries, specifically Tunisia where the project has connections but also in other North African countries where they hope to expand. However, since not all of the characteristics of an impactful proposal were addressed, I can neither agree nor disagree that this proposal meets the impact criteria. (score given: 3)\n", "q0r": 3, "q1": "Based on the information provided, I don’t think that this proposal will be successfully implemented. Even considering this proposal in conjunction with the context of one of its past proposals in a different challenge setting and looking at their slideshow that was only linked in the comments section of Ideascale does not give me confidence in this proposal because there are still gaps that were never explained. There was no place (ideascale, the proposer’s website, the comments section of Ideascale) where DAO formation and funding were never fully explained. How will the DAO be governed? I know that governance is very challenging so how will voting on the incubated proposal work? Are there interfaces for those processes? How will the DAO be sustainable? How can the DAO scale in the future to address challenges as they come up? There are many questions that I have that, if addressed, would greatly help me rate the overall feasibility of this proposal. \n\nThe lack of DAO information aside, the proposers did include a roadmap for one cycle of the 4 stage program from start to finish. It should take approximately 6 months to complete, and it is easy to tell when certain tasks should be completed, such as completing ideation and application submission on October 10th, 2022. I think the tasks are laid out at a reasonable interval, so they are likely to all be completed on time. There is a good budget breakdown for the funds required for the education around Cardano to grow the Cardano community. It is easy to see where funds will be going, such as $9,600 for educational videos, $1,800 for content research and schedule, etc. The budget ($25,0000 total) seems fairly reasonable given the scope of this proposal. For all of the tasks listed, it is unclear who will be taking on what roles. There are four names listed in the proposal, but I can’t tell who will be conducting which roles or if any roles will be outsourced to third parties. The proposers also mentioned that they will return to Catalyst to receive more funding in the future since this event will not be a one-off event.\n\nAll four of the main proposers (Mohamed Mnif, Jaafar Saied, Zeineb Kadhkadhi, and Salmen Slimi) all have years of experience in business development, blockchain technology, and consulting shared between them. As a result, I think that they do have the necessary skills to provide support to the teams that will pass through the program.\n\nIn conclusion, since this proposal is missing some very critical information about the implementation of the DAO, I can only give this proposal a rating of 2 for feasibility. In the future, I would encourage the proposers to provide some more detail in their proposals and link all relevant documents so that they are easier to find. Some more elaboration on the details of the DAO and how it will be governed are definitely necessary in order to give a better rating for feasibility. (score given: 2)\n", "q1r": 2, "q2": "Based on the information provided in the proposal, I do not think that this proposal is fully auditable by the Cardano community. The proposers explicitly listed metrics that are for the Grow Africa, Grow Cardano challenge setting instead of metrics of success that specifically measure success for this proposal. Also, the metrics that are listed are not even metrics of success. Simply listing “2 educational videos, 1 conference, 1 webinar,” etc. with no context are not actually metrics of success. Is the proposal successful if these events are held and the videos are posted? Metrics of success for those would be more like “1000+ views on the educational videos” or “20+ participants in the conference.” In its current form, the proposal is missing more true KPIs. The only two metrics listed that I think qualify as a true metric of success are the 200-400 people educated through the workshops/webinars/hackathon and the three teams guided through the program. Those are goals that can be measured by the Cardano community. There is also no page or place where progress checks can be shared with the Cardano community. In order for me to give a higher rating for auditability, I would recommend that the proposers add more KPIs that are specifically related to the proposal itself (metrics that track success for the 4 stage plan that the proposers want to implement). Since these kinds of metrics were mostly missing, I can only give this proposal a score of 2 for auditability. (score given: 2)", "q2r": 2, "assessor": "z_assessor_2457", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1091, "q0": "The proposers have developed an incubation program called “Decentralise Impact” and want to incorporate and promote Cardano throughout their phases. Their focus, for now, is on setting a foundation for a decentralised ecosystem, both in terms of governance and entrepreneurship, mostly aimed at Tunisia, with later expansions throughout North Africa.\nTheir aim is to find at least 3 teams of participants and guide them on the path to developing their projects into successful businesses.\nThere is already an incubator program on Cardano, specifically targeted to the entire African continent, called Ariob Incubator, built from a partnership between IOG and iceaddis, perhaps this team could get in contact with them and see what knowledge they could draw upon.\nThe proposers have taken the time to write a complete proposal, and I could find no fault to pinpoint in this section. Given also the fact that it fits into the challenge criteria, I am rating the impact section a 5/5.", "q0r": 5, "q1": "While the detailed plan contains the required information, such as key milestones and a timeline, I find it to be very concise, perhaps even a bit too concise. The team could consider expanding on it and providing more detail so it is easier to keep track of. For example, for the milestones containing only “Vote [ON]” and “Vote [OFF]” some additional information would have been helpful in better understanding the task at hand. For instance, if the team added who is voting on who it would’ve helped in better assessing the entire field of the feasibility section.\nThe budget is split per tasks and contains only fixed amounts dedicated to each. There is unfortunately no number of hours needed for their completion and also no hourly rate, that could have helped in better judging the viability of the requested amount.\nThe team has laid down some information regarding their skills. Each member has provided his/her real name and a short description of their knowledge and skills. Unfortunately, they haven’t provided any Linkedin profiles, but while looking on their website, where they also don’t have a team members description, I stumbled upon the website of one of their partners, called Dar Blockchain, and only there I was able to find some photos and names only, of who I then realised that was the same people as the ones submitting this proposal.\nI do not have an opinion on why they haven’t provided a link to another website that could have helped us learn more about them and verify their skills.\nConsidering the missing details, in all three of the required fields, I will be rating this section a 3.", "q1r": 3, "q2": "While the proposers have provided us with what they will be measuring for their project’s progress, they haven’t also provided us with an answer to how they will measure it. \nThe definition of success is otherwise well written and has been stated before during the proposal. From their plan, it looks to be feasible and reasonable.\nConsidering that the auditability section is for the most part complete, but has a small but important missing part of the information missing, I will be rating it a 4.", "q2r": 4, "assessor": "z_assessor_2192", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 3876, "q0": "A great idea, it identifies many of the problems that need to be solved in this challenge, it covers almost all of the problems the challenge poses, it can expand rapidly and large to many other places, they can also solve problems that arise in the future, this is a very good proposition, it brings great development value to the Cardano ecosystem. I would like to see this project again in the next Foundation if this proposal is not Funded in this Fund. Not only the crypto community in Tunisia needs to solve this problem, but other communities in other parts of the world need to deal with such problems as well. The impact of this project is quite large,\n\nThe solution of this proposed idea is very good, it identifies almost every problem to be solved in this challenge, and the author's argument through the description is reasonable and clear. clear and complete. The solution aims to create a decentralized ecosystem in the North Africa region, divided into 4 stages of implementation, I believe the project will bring many benefits to the Blockchain, Web3 & Crypto communities in Tunisia and Africa.\n\nVery good, the idea of ​​the proposal has detailed many risks that the project will face in implementation, but the author only gives some risks, the feasibility of the proposal will be good. then if there were more solutions to all the risks the author put forward, the risk management of the community project would become easier and clearer.\n", "q0r": 5, "q1": "Great when a project provides a clear, logical amount of timetable information for implementation and completion. The goals that the project is aiming for are also very specific and completely achievable. A detailed and date-specific project implementation plan that corresponds to the project actions achieved, makes it easy for the project to be checked for progress if it is funded.\n\nThe proposed project budget is less than 20% of the total budget of this challenge, compared to the information the proposal provides, some project expenditures need to be clarified if it is to be funded. A detailed budget should list hourly wages for workers in each locality, corresponding to the tasks of each person in the project team, the community needs to know, this helps to make the project transparent. better project. Compared to the information provided, it is a bit general and not yet a detailed budget.\n\nHuman resources to implement this project have been assigned specific jobs for each item, and the experience of the members shows that they are entirely suitable for the project. However, the identities of the members are also difficult to verify. clear. The author of this project, Salmen Slimm, and his collaborators Osman Gülmez, Mohamed Mnif, Jaafar Saied & Zeineb Kadhkadhi, said that this is an experienced team to carry out this project, however, the author would like to provide further links. link to identify reputable identities such as LinkedIn, Facebook, Twitter, and Discord, ... for the community to verify identity easily and practically.\n", "q1r": 4, "q2": "\"This project provides KPIs for accomplishing project goals, all of which are easily measured thanks to the metrics provided by the project. With a goal of 2 educational videos, 1 webinar, 1 webinar, 1 webinar, 1 virtual hackathon, 200-400 people trained, this goal is completely measurable, however, Our impact is to provide the community that: where and how we check that number.\n\nThe scheme has clearly defined success, the information from the scheme shows what is being done and how it is being done, and the testing has achieved considerable initial success. Given the actual version of https://decentralizedimpact.com/fr, I believe the author is experienced enough to undertake this project, just needs to provide additional requirements stated above.\n\nThis is a brand new take on this challenge, it was suggested by an experienced Catalyst author when the author had a project registered in Foundations 7 and 8.\"\n", "q2r": 4, "assessor": "z_assessor_2489", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3924, "q0": "The challenge being Blockchain and Crypto communities in Tunisia lack support, guidance and networking opportunities. Even though the communities are full of talented people but they are scattered. The proposer wants to builds a platform which is fully decentralized and community driven where like minded people can network and build innovative things. This will help people to build new projects on cardano and thus helping cardano ecosystem grow. This platform can be extended to support other region as well therefore it can be scaled. By above observation it can be said the proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer has the required skills and experience to implement the proposal successfully. The proposer has given a clear plan with a detailed timeline which will be very helpful. The proposal doesn't consist of a complete fund breakdown without it. It is hard to tell if the fund requested is justified or not. The proposer have considered all possible risks that would effect successful implementation and have given measures to mitigate the risk. With all these it can said that it is very likely the proposal will be implemented successfully. ", "q1r": 4, "q2": "The proposal do consist of a clear milestones to achieve with a time horizon this will be useful to audit the progress of the proposal. The proposal however doesn't have a detailed budget breakdown which would also have helped for auditing. The proposer has given key performance indicators which will be helpful to track the success of the proposal and they has also provided sustainable development goals which also will be helpful for auditing. The proposer has provided how the success of the proposal would look like. All these information should be enough to track the progress and the success of the proposal", "q2r": 4, "assessor": "z_assessor_2496", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5866, "q0": "Decentralized governance, financing and organization is the main idea of blockchain technology. This proposal seeks not to only to create awareness but also increase adoption and participation on the Cardano blockchain. The    proposal if implemented presents a new innovation in running organizations and executing business ideas on blockchain technology. The proposal addresses the challenge in that it will lead to adoption of cardano and participation in Project Catalyst in Africa. The KPIs meet the settings of this challenge. ", "q0r": 5, "q1": "The proposers list detailed experience of team members and the number of the team members required, and I think that is great. They also present links to their website and YouTube video that serve of evidence of their relevant experience. This proposal presents a well outlined and detailed budget, and also outlines a budgeted list of items needed to execute the project. There is a detailed step by step plan with timelines to track the progress. I think with the relevant experience and the plan, implementation is possible. ", "q1r": 5, "q2": "I give a rating of 5 because the proposers presented a practical plan that is easy to track and measure. There are  key performance indicators and milestones with timelines to measure progress. What success looks like is also presented by the proposers and the points are measurable. ", "q2r": 5, "assessor": "z_assessor_2754", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7441, "q0": "The project offers a solution that provides a platform of like-minded people to build a Blockchain community in Tunisia, a North African country. So the proposal is perfectly suitable Challenge\nThe 2-part “[IMPACT] Please describe your proposed solution” and “[IMPACT] Please describe how your proposed solution would address the Challenge you submitted” should be swapped would be more suitable.\nThe methodology of the program is divided into 4 phases including sourcing, catalysts, incubation and funding which are clearly presented. Methods to help participants have a specific plan and be well trained\nAs for risks, the project lists seven issues, all of which have mitigation options. However, the project should show more clearly how to implement the options, whether it is feasible. Make it easy for the community to evaluate and comment. For example, the regulatory framework, the mitigation option is to integrate legal support, the necessary steps are to hire a legal advisor or consult blockchain groups in other countries. Regarding the risk of assembling a DAO community, the option is to grow and manage the community, with specific action being to popularize this solution with the Cardano communities, highlighting its strengths, solidarity, and character. Transparency through the operating process…\nI rate this part 4 points\n", "q0r": 4, "q1": "The plan lasts for 6 months with 14 steps listed by the project. At each step, the project should clearly present the actions to be taken. For example, marketing and sourcing by building introductory videos, promotional content, community connections on media sites, etc. This helps the project stick to specific actions, and when the community has a more intuitive assessment.\nThe detailed budget is listed in detail, with a total application fund of $25,000 accounting for 5% of the total Challenge. All should be estimated in terms of respective hours, which demonstrates the direction and coverage of the project.\nThe team consists of 4 members, with diverse experience, spread in fields such as accounting, business administration, finance and Blockchain entrepreneur. However, the project does not provide a social network link for the community to refer to and interact with when needed. The project has members participating in other projects in F9, does this affect work efficiency? How is the schedule allocated? Project please specify. I rate this part 3 points\n", "q1r": 3, "q2": "With 6 visual KPIs listed like 2 videos, 3 webinar, 1 hackathon, number of people trained. All are very easy to quantify. The project please specify the communication channel the project provides and report the work results, this helps the project synthesize and promote better, easy for the community to monitor and evaluate. The success of the project helps the Tunisian community get closer to blockchain, has strong resources for development, thereby expanding the Cardano ecosystem. The project creates a new mindset, a new foundation for awareness about governance and entrepreneurship. I rate this part 5 points", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10800, "q0": "After reading your complete proposal and this Impact section for the fifth time, I see that your team is looking to construct a platform of like-minded people who strive to build and solve challenges creatively, with the ambition to support Cardano's progress. You are both looking for talent, guiding them, and creating conditions for them to succeed in the blockchain ecosystem, based on the goal of wanting to develop a new awareness platform on governance and entrepreneurship. I admire your team's passion for coming up with such a novel idea. However, your wording is a little confusing, which is why I had to read your proposal several times to figure out what you were trying to express. But, to be honest, I'm still concerned I don't entirely comprehend. (I apologize for not being an expert in your field.)\n\nYour team appears to be comprised of many talented individuals with expertise in blockchain technology and finance, which explains why you use many complicated technical terms for non-experts like me to comprehend. However, I hope you can revise your proposal to make it more understandable. Here are some examples that perplex me:\n1. \"a new perception of governance and entrepreneurship based on decentralization and to empower the existing ecosystem,\n2. \"initiate the DNA of an autonomous fully-decentralized ecosystem supported by a community that is constantly aware of decentralization and its effect on every project and business process\",\n3. \"empowering it with keys and tools to be fairly governed and autonomous in the future.\"\n\n\n\nAlso, I'd like you to explain the main risk paragraph because the way your content is organized makes it challenging for others to understand which solution you're attempting to apply to which problem.\n", "q0r": 4, "q1": "The proposal offers a plan with a precise organized timeline for each month and on a particular day. It is rare for me to come across a proposal that precisely states the time required to execute the suggested activities in a specific manner. And, even if you simply convey the activities briefly with a few nouns, I accept it because you have painstakingly described the project's operating phases in the Impact section. The budget is also detailed, with each spending stated separately. After reading this Feasibility portion, I can easily sense the professionalism of your team. However, let's make it even more transparent through a presentation of your team's management workload to ensure that even though the team has members working on many different proposals at the same fund, you can still provide the quality of your labor.\n", "q1r": 4, "q2": "Firstly and foremost, I must express my delight at the explicit numerical metrics you have established for your purpose of assisting the expansion of Cardano in Africa. Your Proposal has consistently demonstrated to me that you understand what investors want and provide them with trust in figures. However, I am eager to learn more about KPIs related to the incubation program. For example, the number of people in the community who voted, the number of people who interacted with the event and the winner projects, the number of projects scheduled to be financed after incubation, and so on. Finally, I'd like to remind you not to reuse texts inside the same proposal. Consider where it would be best placed and only mention it once.\n", "q2r": 4, "assessor": "z_assessor_3193", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 13493, "q0": "There are a lot of talented people in this world and they are really good at this cryptocurrency market but there are also a lot of people who don't know anything about it. They have no leadership, no support, and no chance to know about this market. They can't connect with the Blockchain community, Web3 & Crypto people in the northernmost tip of the African continent are an example. Figure. The author tackles this problem by providing a platform of like-minded people who are eager to build and solve problems in creative ways to help the ignorant become crypto-savvy. death. The management of this program is completely decentralized and community driven. The author also mentioned the potential risks of this project as: Regulatory framework in certain blockchain use cases, lack of understanding of the technology reducing the trust of participants, ability to concentrate assembling a community on DAO, scalability of supported projects, transition to decentralized decision-making methods, maturity of early Dapp users, summer and holiday influence to project implementation. These are the risks that they may take when undertaking the project. However, the author has also given solutions to solve the above risks. This is a good proposition I find that it can be scaled up to a large institution that will definitely bring more people to Cardano.", "q0r": 5, "q1": "The proposal has clearly defined important milestones, the implementation time is reasonable with the results of the work, the goals are listed in detail by the author for each work to be done. The project implementation period from August 15, 2022 to the end of February 3, 2023 is the project will be successful. The author also clearly states what needs to be done in a certain period of time. This solution aims to create stepping stones for the emergence of a decentralized ecosystem in the region. This proposal aims to make an impact by giving great attention to the community development side, empowering it with keys and tools to be managed equitably and autonomously in the future. With the work done by the project owner, I believe that with this foundation, the local ecosystem can develop in a sustainable way to help local people know more about Blockchain. The success of this project is to create a new mindset, lay the foundation for a new perception of governance and entrepreneurship based on decentralization and empower the existing ecosystem in the region. Success is clearly described by the author and it is entirely related to the campaign of the current challenge.", "q1r": 5, "q2": "The KPIs are clearly defined and the proposed future implementation plan is very detailed and complete. Performance metrics are complete and clear. The success indicators of this project are: 2 Educational Videos, 1 Conference, 1 Webinar, 1 Workshop, 1 Virtual Hackathon, 200-400 people trained through. These are the metrics that the author has provided to carry out this project. The grant budget for this project is $25.000 less than 20% of the challenge total budget. The author's budget is broken down into appropriate expenditures to implement this project. This proposal has a strong team with many years of experience in various industries with backgrounds in auditing, consulting, business development & IT. The team consists of 4 main members implementing this project: Mohamed Mnif, Jaafar Saied, Zeineb Kadhkadhi, Salmen Slimi. These are elite members whose experiences the author has listed indicate that they are the right people to take on the main tasks for this proposal. With the team's existing skills and experience, I believe the project will be successful.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1}], "solution": "Our solution is to provide a platform of like minded people who are eager to build, and solve problems in innovative ways. The governance of this program is fully decentralized & community driven.", "experience": "Our team has years of experience and backgrounds in audit, consulting, business & IT development, and assisting national as well as international organizations in their digital transformation in favor of decentralization through blockchain and Web3."}