{"id": 422690, "author": "gchub", "title": "Mining traceability in a war zone", "url": "https://cardano.ideascale.com/a/dtd/422690-48088", "category": 26600, "amount": 25000, "description": "The DRC has strategic mining reserves: GOLD, Coltan, cobalt, uranium whose exploitation does not benefit the population following smuggling", "f6_no_assessments": 9, "f6_rating": 4.222222222222221, "videos": [], "media": [], "f6_assessments": [{"id": 1092, "q0": "The aim of the proposal is to build a DApp for mining traceability of mining quarries and artisanal small-scale miners in the Democratic Republic of the Congo. By taking advantage of the transparency of blockchain and low transaction fees on Cardano, the DApp can finally provide accurate information about the origin and the movement of the minerals, while at the same time incentivising miners to register and benefit from the ability to sell their minerals for the best price, without relying on third-parties any longer that are usually taking advantage.\nThis is a much-needed product, that could hopefully lead to several changes in the industry, hopefully in time, one of them will be to reduce to a minimum child labour in the mines, amongst others, such as working conditions and a fair income. I have come across another study regarding blockchain and mineral supply chains, I will post it here, in case it offers additional help to the proposer https://www.rcsglobal.com/wp-content/uploads/2018/09/ICMM-Blockchain-for-Traceability-in-Minerals-and-Metal-Supply-Chains.pdf \nIn conclusion, I see the proposal as being very well in line with the challenge brief and on top of that, the subject being tackled is of high importance as it could lead to a positive change, first in the lives of the miners from the DRC and through that have a positive impact on the Cardano ecosystem.", "q0r": 5, "q1": "From the information provided in the detailed plan, I am left with a clear understanding of how the process will function and when each task will be implemented. The chronology is well thought out and the timespan looks reasonable. The team is planning to start with a website design where all mining quarries of Coltan will be mapped, as such providing them and us with a clear overview picture. After this first step is completed, they will proceed to the next ones, ending with offering validation tools for DID certification based on identification. A very important mention is the fact that the DApp will be self-sustainable through the small fees of transfer of ownership of DIDs, as such, a successful enterprise can be forged through this funding.\nThe budget is split into 4 categories, “Design Validation Website”, “Catalogue quarries”, “Onboard Miners” and “Tools and Equipment”, each with an associated amount needed for completion. While all tasks are well described and all amounts look reasonable to me, I have to say that the budget would have been easier to assess if it would have contained numbers of hours and hourly rates, where applicable - for instance for the website, such information would have been welcomed. However, considering the nature of the project as a whole and how well it is otherwise described, I will not be deducting any points for this.\nThe team members are clearly described, all names have been provided and for 3 out of the 5 members they have also included LinkedIn profiles. Considering the information provided and the clarity of the text, I feel very confident that the team can successfully implement the project.", "q1r": 5, "q2": "The team has provided ways to track the project’s progress in ways that go beyond the obvious, minimum needed requirements. They intend to produce a video highlighting the targeted quarries and will continue to upload videos to Youtube for regular updates, which I find to be a great way for the community to monitor the progress in an easy and engaging way.\nThe success definition is very well described and looks reasonable and realistic. It is well based on the goals of the project, and as such, it makes perfect sense. One of the important points, that have been mentioned before, is the self-sustaining of the project through small fees from DID validation.\nConsidering all the data provided, I find the proposal to be easily assessed in regards to progress and success.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 2443, "q0": "We found in this proposal a great example of the application of blockchain technology, as we realized that a latent problem on the African continent can be greatly benefited by the use of Cardano technologies. With that, it is easy to say that this proposal fits perfectly with the objectives of the challenge in which it finds itself. Furthermore, as indicated in the proposal itself, the success of this project would significantly contribute to the visibility of Cardano's ecosystem, as well as possibly open the door to solving other problems on the continent. Bearing all this in mind, we can say that the budget being requested is appropriate, since we have an innovative idea and qualified people to carry out the work.", "q0r": 5, "q1": "For the realization of a project like this, it is interesting that there are actions that reach several fronts of the project. By this I mean that not only the development of Dapp should be focused, but it would also be interesting to carry out a good mapping of the project's area of ​​operation. And in a very positive way, we were able to find this, as the mines in which the project can be implemented are being located, as well as miners to initially participate in the platform. Regarding the team that will develop the platform, we can say that the professionals involved have, together, an extremely cohesive training with the objectives of the project. It is very good to see that his knowledge goes beyond the area of ​​development, also contemplating the sphere of economy and public policies. We see that information has already been collected on miners who can participate in the project. Regarding the detailing of the budget being requested, we see that very correct capital allocations were established, and the activities are concerned both with the development of the website and with complementary actions so that this website has sufficient engagement.", "q1r": 5, "q2": "The ways chosen to monitor the project make total sense in relation to what was developed during the proposal and we realized that the metrics chosen help to measure the impact of the project. It is also interesting to see that a way was devised to transmit the information of this evolution. The perception of success of the project also seems quite correct, but in a complementary way it would be interesting if some numerical goals were established that would help us to define whether or not the project was successful. Such targets could be something like a target number of DID-related portfolios being created.", "q2r": 4, "assessor": "z_assessor_2306", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2997, "q0": "This proposal aligns not only with the challenge but also with the core values of Cardano as an open-source platform that can foster growth within the African continent. \nAccording to the Fraser Mining Potential Index, 80% of investors would invest in mining in the DRC if the country followed best international practices in terms of its regulatory environment, taxation and other factors. It is clear there's a need for such a dApp that offers an authentic chain of ownership of natural resources in the DRC. If successful it could be used as a model for other African nations plagued with similar issues.  Secondly, utilising the security that Cardano offers in creating the Certified Trading Chains (CTC) certification scheme should deliver a positive impact on the lives of the miners and improvement on the entire supplier chain. The plan of employing the Atala-Prism-based identification to miners will reduce smuggling as they can come together and remove the middlemen who exploit these miners due to a lack of proper representation on the international markets thereby increasing profitability. Due to the above reasons coupled with the existing relationship the team has with WADA-a Cardano-focused blockchain Hub fostering young African minds into the blockchain space, one can see a positive correlation between the success of this project and the onboarding of young minds into the Cardano eco.\n", "q0r": 4, "q1": "Most of the pieces required to carry out the roadmap and complete the milestones are already available like designing QR codes for sealing containers holding minerals at storage and transit facilities, and providing DIDs for quarry operators using the Atala-Prism-based identification. If funded I do believe the roadmap can be achieved within the set time given the team's understanding of programming languages and grasp of what is demanded due to experience dealing with small-scale miners in the neighbouring region of Masisi.\nHowever, issues that dampen the feasibility of this project is the lack of a clear breakdown of who will be doing what and how much they will be compensated? An example of this is under Catalogue quarries $4000, it is written\" Road trips for three validators\" Who are the validators, and what are they valuating? \n", "q1r": 4, "q2": "The various KPIs and matrics chosen by the team for the community to follow along with the development and completion of the project are on point like youtube videos, a website map of the various quarry sites that have been onboarded, and showcasing new\n Ada wallets created by miners containing DIDs. However, one recommendation I like to offer the team is to open-source the project, and the challenges they faced once the project is completed as this can be modelled and implemented in other countries. ", "q2r": 4, "assessor": "z_assessor_2381", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4133, "q0": "In times plagued by resource instability and supply chain problems, this proposal aims to use Cardano to improve mineral traceability in Africa by reducing corruption and black market trades in mining.  And in the spirit of the Grow Africa, Grow Cardano challenge, this is a real solution to a well documented problem that presents a win-win use case by not only strengthening Africa, but investing in an economy that trades in resources with a direct link to the economies of the rest of the world.\n\nWhile the proposal does align closely with the challenge at hand, my confidence only lacks in the area where the proposer falls short of providing useful data that could help us to evaluate the scalability and sustainability model for this project.  I understood from the milestones that this project features a revenue model from DID validation and transfer fees, but there is no established model present to evaluate how that may create barriers compared to the existing trade, or what additional financing for later phases will aim to achieve in terms of runway and adoption of this solution.", "q0r": 4, "q1": "The team and plan for this proposal offer confidence of a high likelihood of project delivery.  The proposer has a demonstrated history of participation in Cardano/Catalyst (Haskell/Plutus/Development/Node Operation/etc).  And based on his proposal, he also has a deep knowledge of the mining industry and where the challenges are that this solution aims to overcome.\n\nI rated this proposal 4 out of 5, because although the roadmap, milestones and budget breakdown are present, there is not a great level of detail in the budget breakdown across the 4 investment areas that could help to evaluate the utility of follow-on financing for future phases of this project.  The proposer also states that they are involved in previously funded projects, as well as other project proposals in Fund 9, and given that active level of involvement, the 2 month delivery timeline for this project seems very tight, but not unbelievable.\n\nI liked that the proposer thought in advance about resources needed to present this opportunity in the remote areas mining areas where they will be operating through procurement of presentation and solar tools.  The one thing that could easily help me build more confidence in successful delivery would be to talk more about the challenges that face adaptation of a technology like this.  The mining industry (like agriculture as mentioned in the proposal) has a long history of monopolization and murky trade activity aimed at perpetuating limited access to valuable resources.  \n\nOverall, essential elements of the proposal are present and in enough detail to indicate the proposer's capability and intention to deliver.", "q1r": 4, "q2": "While this is a new project, the proposer has presented a clear roadmap for delivery of this first phase with delivery dates for each phase as well as open source tools for tracking progress (Github).\n\nA clear description of problems in the mining industry is complemented by a logical use of Cardano to deliver a solution with clear KPIs for early stage development, implementation, adoption, and revenue generation - including a promise to provide updates via social media and website content to build transparency in the project and affected industry.\n\nWith a clear overall vision for success and understanding that follow-on funding will likely depend on the ability of this team to deliver results through a variety of public forums, I'm confident that the results will be measurable as defined even though the proposer does not provide exact targets for adoption or use at this early stage. ", "q2r": 5, "assessor": "z_assessor_2517", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4613, "q0": "The proposal identifies a major problem facing the continent as the need for sustainable mineral exploitation for the benefit of small-scale miners, this problem does not address the objectives of the challenge on its own, a strong and interesting point of the proposal is the town hall hubs that are regularly held, promoting general adoption.\n\nIf the proposal is successfully implemented, it can serve as a reference and proof of confidence in the cardano technology to be applied in other use cases, mainly in relation to traceability or decentralized digital ID uses.\n\nIt seems to me that the metrics of the proposal are aligned to the objectives of the challenge. I can infer the creation of new wallets, attract new users willing to invest in technological solutions, a local impact through the activity of these new users, interesting alliances with governments and other institutions in the sector.\n\nThe proposal is very interesting and from my experience working for almost a year in blockchain traceability solutions in the food industry I could give some recommendations to consider: \n\nFirst it would be interesting to explain in more detail what DIDs means since for many it is a concept not so easy to understand. \n\nFrom the little I know about DIDs I understand that they will serve in this solution to identify small miners and quarries as well as to identify product claims. I could be wrong but at first I thought so.\n\nIf the DIDs serve as product identification, a more detailed explanation of how they are linked to the miner is needed, and if there are certifications, how they are linked to the product, near the end of the proposal it touches on a point where miners will not be tempted to extract their product from protected areas, in the future it may help to create certifications linked to the product that prove that the product was obtained from non-protected areas.\n", "q0r": 5, "q1": "\nThe proponent has provided references and links on the skills and experience of the team, also reading the profile of each member it can be said that the number of people needed for the execution of the proposal has been well identified, as feedback I propose to the team the integration of a person oriented to supply chain management and regulatory compliance and certification, if not within the team at least as an advisor on these issues. \n\nI touch this point because I could in the proposal a lack in details regarding traceability, in the future it would be interesting to expand the implementation so that traceability reaches the final customer, from my experience I can notice a challenge in the aggregation and processes specific to minerals, ie trace a product whose characteristics change due to multiple processes and is potentially aggregated with other minerals from different sources, underlines the need for an expert in the management of the supply chain.\n\nAlthough the necessary resources are detailed in the budget, it seems to me that the detailed plan does not explain a little more each of the tasks to be performed, especially who will be in charge or those involved in the performance of each task, I also find that the task of designing the website starts in June and ends in July, for that task have been designated 9000 dollars and does not specify how they will do to cover the expense since by that date still will not be awarded funds to be favored by the community.\n\nWhat happens if they are not favored in the voting? the tasks that started in June, July, how will those expenses be covered? If they already have funds to start those tasks, why include them in the proposal? \nThe roadmap seems fine to me but this inconsistency especially in the dates and not having detailed why they are put that way, time before knowing if they will have funds or not makes it difficult for me to say if the proposal can be implemented satisfactorily. \n\nto be more concrete, most of the tasks in the roadmap end in August, the winning proposals are announced in September, I think that if these tasks need funds (\"detailed in the budget\") it is impossible to carry them out before even having them or at least in the proposal it is not specified how this is solved.\n\nIt was probably a mistake that can be fixed by changing the dates to a later date, but unfortunately I have to evaluate what is written, and in writing is very complicated the implementation by this issue, coupled with the fact that one or more members are working on proposals of the same fund and funds passed without having an explanation of the management of the workload or something that refers to that issue. \n", "q1r": 4, "q2": "Related to auditability I was able to find a lot of information regarding the channels of communication that will be used to communicate with the community and communicate the progress of the implementation of the proposal. It is a variety of communication channels such as videos, a github repository, catalyst meetings and their website.\n\nBeyond the milestones in the detailed plan and what the success of the project looks like, I could not find milestones that would define the progress of the proposal that could be tracked and measured.\n\nIt is important for the community to be able to have clear metrics that will define the success of the proposal and that can be reviewed during the implementation process, the metrics should not necessarily be expressed in quantifiable terms, they can also be qualitative and have to do with how the project stakeholders interact with the solution and what is their response to it.\n\nIn my experience working with small producers in this case small miners can represent a challenge due to the lack of knowledge or the difficulty of handling the technology, the project can include metrics that measure how this process is or how is the learning curve of the users. It would also be interesting a metric that allows the community to see how many stakeholders are involved, the number of products that have been successfully traced, etc.\n\nIf we are talking about a traceability solution these metrics are important, if the idea is to avoid confusion about the origin of the minerals, a metric that allows to know the amount of minerals that have been traced correctly or amount of minerals coming from healthy working conditions or amount of minerals coming from unprotected natural areas.I invite the team to reflect on such metrics and how they can measure them to provide transparency in the mineral supply chain but also transparency to the cardan community. \n\nFinally in relation to the budget, the amount and the budget breakdown seem reasonable to me, but due to this lack of metrics the auditability can be compromised, however the references of the team, the clarity of the solution plus the communication channels can be expected that the community will be aware of the progress of the solution.\n", "q2r": 4, "assessor": "z_assessor_2575", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 5253, "q0": "Your suggestion is “Create a DApp on Cardano for the traceability of minerals through the certification of mining quarries & artisanal small-scale miners (ASM)” I think it would be more appropriate to put it in Challenge Dapps, Products & Integrations.\n\nThe solution you have given is quite general and does not explain why applying Blockchain can remove the confusion about the origin of Congolese minerals and elsewhere sold on the international market. And how do you solve this problem?", "q0r": 3, "q1": "Your proposal is expected to be implemented within 03 months from Jun - Aug 2022, but at the time of evaluation it is already July 2022 and if your proposal is funded, it may be until Sep 2022 to receive capital. So it seems that this timeline is not logical.\n\nYou're keeping timelines and milestones separate so it's hard to keep track of how the plan works. Milestones should be tied to specific timelines so that we can know if the project is on schedule and from there can be adjusted in time.\n\nThe budget you apply for this round is $25000, the work items are described in detail. However, I still haven't seen the cost to make the app is listed because of your solution is to create a dApp, so if it is mentioned, it will help to make the cost clearer.\n\nThere are 05 members involved in this project, with experiences described in detail, especially most of the members have experience related to Blockchain, this is a big plus for the project because it proves that your ability to create a dApp as written in this proposal.", "q1r": 3, "q2": "Regarding measuring project performance, you listed the indicators related to updating Videos to talk about project progress or GitHub repository DID design for industries evaluating on Certified Trading Chains (CTC) certification schemas ,..these indicators are appropriate for your project type.\n\nAs for measuring the success of the project, you have not mentioned the dApp-related indicators, which is the solution that the team wants to come up with to solve the problem related to mining traceability that you want to implement in this proposal. We need to know the metrics such as how many downloads the app, how many users, or how many transactions from the app to Blockchain.", "q2r": 3, "assessor": "z_assessor_2678", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7442, "q0": "The project is driven to create dApps on Cardano for mineral traceability through certification of mines and miners in the Democratic Republic of the Congo (DRC), an African country, so the project is suitable for the Challenge\nThis is an orientation to help improve people's interests. Blockchain helps in effective, transparent and traceable traceability. Therefore, the project should detail the dApp building process, which is the core of the project. For example, what programming language does the dApp use, runs on the sidechain or main chain, is it open source, how many integrated tools are there?\nAs for risks, the project has raised two issues and has an effective mitigation plan. I would like to add the following option, let's focus on small producers and operators to become a cooperative, that will create a stronger, more transparent source of mining products, confirmed market position.\nI plan to take the following extra risk, that no one uses the dApp because they don't understand and don't know about blockchain. The mitigation option is to organize seminars, tutorials on how to use and promote the advantages of dApps, and help build a sustainable cooperative like the one above. I rate this part 3 points\n", "q0r": 3, "q1": "The implementation plan is divided into 6 phases, which seem to last for 6-7 months. The project should present milestones more clearly, making it easier for the community to assess and track. As mentioned above, at the stage of dApp building, website design, project should list more specific steps. If necessary, this project can be divided into 2 small proposals, 1 is a proposal to build a technical dApp, 2 is a proposal to integrate application research. This helps the team focus all their energies on each item\nThe detailed budget table consists of 4 major sections and small steps, if all are estimated in terms of hours worked, it will be more intuitive. The total application fund is $25,000, accounting for 5% of the total budget, an appropriate number.\nThe team has 5 members, of which 3 members are provided with social networking links. After consulting I found a team with experience in computer science, coordination management, Haskell programming and associated miners, with the above competencies to complete this project is possible. However, members have participated in other projects in this fund and previous funds. Will this affect the focus on this project? How will you arrange your schedule? Please exchange for the community to understand. I rate 4 points for this part\n", "q1r": 4, "q2": "The project lists 11 indicators including KPIs and operational progress milestones. It's all intuitive and easy to quantify. I appreciate this. The project should specifically list the update channel it uses to report progress. Make it easy for the community to track and evaluate performance. The success of the project helps to put blockchain into practice, helping employees to optimize products. It also helps to expand the Cardano ecosystem community in Africa, a core continent that Cardano is aiming for. I rate 5 points for this part", "q2r": 5, "assessor": "z_assessor_2893", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8374, "q0": "The idea of creating a dapp using Cardano for mining reserves: GOLD, Coltan, cobalt, uranium would be helpful for registered miners and vendors to locate the resources and make use of it which will also add value to the nation's economy. There are many smugglers who are currently being mining resources without proper license and smuggling the goods outside the country which will not benefit the economy of the nation and this can be prevented by building this application. The proposer has identified the need for applications to locate the nation's resources and prevent smuggling of nation's wealth and has worked towards a solution for it which is commendable. By doing so, the proposal will benefit the nations wealth and gain more users to the Cardano community. The key metrics specified in this proposal defines the success of the proposal and is aligned to achieve the goal. The proposal can be scalable to address the future challenges.", "q0r": 4, "q1": "The proposer has the experience to implement the plan successfully as they have already implemented similar projects in the previous funding rounds. The proposer has provided enough information to support their experience required for this proposal. The budget has been mentioned clearly which is 25000 USD which is required for development of the app and its resources and has also been broken down into identifiable individual units. The proposer also offers a realistic time to complete the proposal as they have the necessary resources for successful implementation. The proposer has also mentioned the challenges or difficulties faced during implementation of the proposal and has considered them and is prepared for the successful implementation of the proposal.", "q1r": 4, "q2": "The proposer has laid out a realistic roadmap with the steps for the completion of the proposal within the specified time and the provided information is sufficient to audit the progress of the proposal after the funding. The key metrics mentioned in the proposal align with the proposed goal to succeed and also defines the parameters for success of the proposal. The proposer has identified the problem and has provided a solution that addresses the problem which is most likely to succeed. The proposer has provided all the necessary information and has analyzed the problem to be solved efficiently. Hence I feel the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2976", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 14383, "q0": "The proposal is consistent with the challenge in which it was submitted. The problem of non-traceability of mining reserves in the DRC is known almost everywhere in the world and this constitutes one of its major sources of its underdevelopment. \nI hope that once this group of proposers manages to create a DAPP application notably on CARDANO for a better traceability of minerals through the certification of mining quarries, it will have a positive impact so that there will be more confusion on the origin of Congolese minerals. The advantage for CARDANO is that all this will happen with the blockchain.", "q0r": 5, "q1": "The business plan illustrated in this proposal confirms by themselves that this project will be feasible.\n The activities mentioned in the budget breakdown prove that this project can indeed be carried out, although the strategies proposed in this stage are convincing.\n Casting a glance at the people who will work in this project, it is revealed that they have compatible qualifications in the realization of the project but also by the fact that they have still worked in a previous project which has been funded by CARDANO according to their confirmation response to this question section in this project. But these proponents were imprecise with regard to the exact number of mining quarries that will benefit from this project, I would ask them to kindly specify how many quarries will benefit and their location for better feasibility of the project. Anyway, I support this group.", "q1r": 4, "q2": "This group of contributors will update videos on YouTube and will be able to design GitHub repository DIDs for industries based on CTC schemas, in order to be monitored and evaluated by the catalyst project system. In addition, this group has links and Sites as noted above, the latter which will serve as means of verification of the smooth running of the activities of this project.", "q2r": 5, "assessor": "z_assessor_4010", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Create a DApp on Cardano for the traceability of minerals through the certification of mining quarries & artisanal small-scale miners (ASM)", "experience": "Goma Cardano Hub:\n\nRegular Haskell and Plutus training since Sep 2020\nGoma Cardano Stake Pool running several Testnet Nodes in Goma\n4 developpers and technical professional\nPlutus and Atala-Prism Project based learning\nWeekly meet-up since Oct 2020 to promote Cardano Blockchain\n"}