{"id": 422620, "author": "salmen", "title": "Cardano Students Hub", "url": "https://cardano.ideascale.com/a/dtd/422620-48088", "category": 26600, "amount": 2500, "description": "Lack of exposure leaves young Tunisian students and entrepreneurs not able to capitalize on their backgrounds to get introduced to Cardano.", "f6_no_assessments": 5, "f6_rating": 3.6, "videos": [], "media": [], "f6_assessments": [{"id": 3313, "q0": "Solution & Challenge: Community hubs are essential to growing people's awareness of Cardano. There is a lot of information available on the internet today. But the information on the internet is still not enough to affect everyone. So offline community hubs at universities are a great idea to connect directly with university students.\nBesides, students are a very important force for the future development of blockchain. Because the students are the ones who absorb new technologies very quickly. They are also young people with a lot of creativity and the ability to change the world.\nCommunity hubs like these will help increase the number of students in Tunisia participating in Cardano and increase the awareness of Cardano in Tunisia.\n\nRisk: The team has also identified a number of risks that may prevent the team from successfully implementing this project and having appropriate solutions for those risks.\n\nSuggestion: I think the team should focus the content on certain specific topics to be able to make a real change in the perception of the students about Cardano. The contents of seminars and workshops are still quite general. If only providing students with information such as tokens, crypto, NFT, .... in my opinion, it is not deep enough for students to take specific actions. There are a few ideas that the team can refer to to build content for their workshops to have a more visible impact such as:\n- What is Catalyst? How to join Catalyst when you have an idea? How to become a PA to get more knowledge and income from Cardano? The students are young people with a lot of ideas. Besides, the issue of income can also encourage them to participate in Catalyst.\n- Future applications of Cardano and blockchain for this world. This topic will help students have a better understanding of blockchain. Blockchain is not just for investing and trading but it can change the lives of everyone in Tsunami. This will stimulate students' curiosity about the future of blockchain even more", "q0r": 4, "q1": "Detailed Plan: The plan of this proposal is the one to be implemented from January 5, 2022 to March 6, 2022. This means that this proposal is complete. Because it's July 2022. I'm really looking forward to seeing a plan in place after that one. I still don't understand why the team submitted this proposal. The team wants funding from Catalyst to pay for what the team did between January and May? If the proposal wants to be funded in fund 9 to pay for an implemented plan, the team should include additional reports on what this proposal has achieved after implementing the project from January to May.\nBesides, the team also needs to have a specific plan to continue implementing that project in the coming months. I'd rather see a specific plan for the future than a specific plan for the past (a report would be better)\nIn addition, the team also submitted 2 proposals in fund 9 but I have not seen the team mention how team members will implement both these proposals in the same fund.\nBudget breakdown: The team has listed a few costs to implement this proposal but it is not really specific. What are the costs for 3 marketing campaigns? Advertisement? Making an intro video? Leaflets?.....\nExperts/Trainers Pay: $1000 is the cost for how many hours of training? Who will be the trainers and experts?\n\nTeam: I looked at the team's linkedin. The team has a linkedin that has a lot of blockchain activities and posts with 261 followers. I also saw some pictures of the team doing seminars and workshops with a lot of participants. Therefore, I have no doubts about the team's propsoal ability. But in the detailed plan and budget break down I still haven't seen the team specifically mention which team member will do what work. Who will do the marketing? Do they have experience in marketing? Who will share in seminars and workshops? What is their experience with blockchain and Cardano?\n\nSuggestion: The team should develop a detailed plan for future goals. The plans that the team has completed should have a report to show the results they have achieved. PAs and vPAs will rely on those reports to assess the feasibility of the proposal in the future.\nThe team should specifically list the name and related experience of each team member to prove that the team members have enough experience to be able to perform the tasks in the proposal.\nThe budget breakdown needs to be more clear about the costs for each specific job. For example, in Marketing campaigns, it is necessary to have expenses such as: advertising on facebook, printing leaflets, distributing leaflets, making billboards, directly contacting universities to share information with classes, etc. ...\nHope these tips will help you to get better proposals in the next funds", "q1r": 2, "q2": "The team has set out specific goals that the proposal can achieve such as the number of seminars and workshops that can be done, the number of people attending events, subscribers on Linkedin and Facebook.\nMeasurable metrics like subscribers, number of participants, number of workshops and seminars. But the goal of \"20 projects introduced to incubation\" I still don't see how the team will measure.\nWhat does success for this project look like: The team has not come up with a really specific goal that this proposal wants to achieve in order to make an impact and solve the Challenge.\n\nSuggestion: The team should explain in detail how the team will measure the progress of its proposal. For example:\n- \"600 event participants\" This index can be measured through images in seminars and workshops or the number of registration forms to attend seminars and workshops.\n- \"6K Facebook subscribers\" the team should attach a Facebook link to prove that the Facebook fanpage is not enough for 6k (Facebook fanpage only has the number of likes, Facebook group will have the number of members. Facebook has no subscribers. have the number of friends and followers)\n- \"1 marketing campaign\": It is necessary to specify which indicators in the marketing campaign can be measured such as the number of ads performed, the number of people attracted in an advertising campaign.\nThe team also needs to provide specific achievable results after implementing the proposal. The results of the proposal must solve the challenge. Example: How many students will create a new Cardano wallet? How many students will become PAs, vPAs, proposers,...? How many students will participate in the Plutus Pioneer Program?", "q2r": 2, "assessor": "z_assessor_2437", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 3925, "q0": "The issue being Tunisia students and entrepreneurs not able to take advantage of Cardano due to lack of exposure. The proposal is trying to resolve this by creating Hub structure between Tunisian Universities and Cardano so that students can get needed support help and scale communities. This will help add new members and also new projects to cardano Ecosystem. This will be helpful in growth of cardano. More universes can be added to the Hub structure thus it can be scaled. Therefore the proposal effectively addresses the issue\n", "q0r": 5, "q1": "Based on the details given on the proposal the proposers do have experience to execute this proposal but the proposal doesn't consist of any details regarding the people who will be working on the proposal which would have been helpful. The proposer have given a clear plan and timeline to execute this proposal. The budget requested of 2,500$ seems very practical for the work needed to be done. They have taken in account of all the risks and challenges that they may face while executing the proposal. With all these above observation it can be said that the proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has given a clear details about the events they will be conducting but it would have been very helpful if timeline or time horizon for these events were added they would have helped to track the progress of the proposal. They have added a complete budget breakdown which will be helpful for auditors. The proposal does consist of what success looks like and will be helpful to measure the success of the proposal. The info provided should be enough to track the development and the success of the proposal", "q2r": 4, "assessor": "z_assessor_2496", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5867, "q0": "The problem identified by the proposers meets the setting of this challenge. I like that the main target audience of this proposal is university students because that is the best platform to scale up participation in Cardano in Africa and also create awareness of of blockchain technology. \nThe proposal is clear on the impact it will make in the cardano ecosystem as engagemnent with audience will lead to massive awareness and participation. \nThe goals of this proposal if achieved will lead to a great understanding of Cardano and prepare people to present great ideas and proposals because of the topics the proposers intend to cover in the webinar sessions. \nI suggest that the hub is also opened to other community members apart from the students. This will lead to a much larger reach. The idea is great.", "q0r": 4, "q1": "Like i stated earlier this proposal is a great, but what is lacking here in the plan is evidence or a link to the relevant skills and experience of the team members. This would've made the proposal richer and also help everyone who reads to easily judge whether the implementation is feasible or not. \nThe proposed outline of the project is awesome and if achieved will lead to a great deal of knowledge and awareness both on blockchain technology and Cardano ecosystem.\nThe budget as outlined by the proposers is within reasonable limit, but it looks small for implementing the project but since the proposers indicate that there is another proposal they have presented it is possible they may capitalize on budget from that proposal if funded. \nThe budget breakdown i think is not enough because the logistic/resources are not listed in detail. \nThese are reasons for my score. ", "q1r": 3, "q2": "The proposers present what success looks like and also details the key progress indicators for each target institutions and that helps in auditing.\nThe proposers are also specific with numbers, for instance number of facebook, linkedIn subscribers and number of proposals expected to be seeded after execution and that will also will auditing. ", "q2r": 4, "assessor": "z_assessor_2754", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 11134, "q0": "Hubs include one great tool in achieving growth in every endeavour. In growing Cardano in Africa, hub creation and their continuous sustenance is one great way to promote growth of the Cardano ecosystem especially when these hubs are run from tertiary school premises where there are active minds at work. The proposal addresses the challenge of growing Cardano's presence in Africa.", "q0r": 5, "q1": "There are errors in the timelines provided as they are backdated which does not provide room for assessment. It neither looks like a typographical error as the timelines span from January to May and so assuming the year in question is an error and should have read 2023, it clearly means the proposer is going to take too long a time to implement the proposal if funded thus not likely for a successful implementation as cost of implementation may go up before the presume period. The project does not also present any viable combined experience that could be used to gauge what experiences are being put together to deliver on the stated timelines. \nI therefore disagree that the project will be successfully implemented.", "q1r": 2, "q2": "The proposal outlines expected outcomes from all the events to be carried out in the proposals but does not however provide clear timelines as to when these results will be achieved.  There are also no clear plan to get the Cardano Catalyst platforms involved in tracking the success of the project besides the expected outcomes from each campus. I neither agree nor disagree that there is enough information for auditability. ", "q2r": 3, "assessor": "z_assessor_3224", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 12063, "q0": "This proposal is aligned with the challenge that it has been submitted. The project hopes to propagate Catalyst/Cardano activities by introducing Tunisians students to blockchain technology. The proposers have targeted three universities to undertake the project. The creation of a student Hub complex on these universities will offer opportunity for expanding programs of Cardano not only in North Africa but Africa at large. This hub complex will offer students the chance to ideate and develop innovative projects on blockchain technology and also to submit proposals to the community for funding. The promoters have targeted the implementation of this project through events, seminars, webinars and incubation programs that will be organized on the selected universities. The project will also create interconnection between the Cardano community, theses universities, the blockchain ecosystem and the professional and business community. Again the proposers have provided adequate mitigation measures to address the risk (not getting enough members in the club, Covid 19 impact to the project and regulatory restriction in Tanzania) envisaged to this project. This includes scaling up the program to other universities, using online campaigns to on board more students and also aligning with regulatory requirements on cryptocurrency in Tunisia and finally inculcating new regulatory measures on blockchain technology in Tunisia to their training activities. ", "q0r": 5, "q1": "Though the proposers have provided timelines on the their Club (Club Dar Blockchain ESB), it is important they provide a detailed plan for this project as the timelines for the Club is not consistent with this project which is likely to be implemented during the last quart of this year if it gets the needed funding. Again, the budget should be aligned to this project as it limits it to Club Dar Blockchain program which as per the program roadmap has been implemented for this year. In spite of the challenge with the feasibility, it is worth noting that the promoters of this project have the requisite skills, experience and expertise to implement this project. They just have to align the feasibility (ie program implementation time and budgetary allocation) to the timetable of Fund 9. This will ensure the project is implemented successful with any funding challenge. Finally, the budgetary request is reasonable but the promoters should make provision for miscellaneous expenses to ensure the project implementation is done successfully without any funding challenge.    ", "q1r": 2, "q2": "The promoters have provided adequate roadmap to measure the success of this project. That is they are already running a Club (Club Dar Blockchain Esprit School of Business ESB) where students are on boarded to the Catalyst/Cardano activities. They hope to scale up this program with the funding from Fund 9. They have outlined detailed marketing programs to on board students from at least three universities. This includes organizing one (1) marketing campaign using the social media, four (4) workshops and five (5) seminars at various universities. Again, the promoters have provided measurable numbers on the people they hope to on board to Catalyst activities. This includes a total of 16000 event participants, 10000 LinkedIn subscribers, 16000 Facebook subscribers and 55 projects introduced to incubation from the three universities. These numbers looks ambitious but is achievable given the background of the promoters and the fact that they are already handling a club that is propagating the Cardano Community’s programs. It is important the promoters also look at the budgetary request for this project and ensure align the project auditability to this budget.  ", "q2r": 4, "assessor": "z_assessor_3352", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Creation of Hub structure between 3 Tunisian Universities (and more) and Cardano, to offer the needed support to allow students to scale & help their communities.", "experience": "Our team has years of experience and backgrounds in audit, consulting, business & IT development, and assisting national as well as international organizations in their digital transformation in favor of decentralization through blockchain and Web3."}