{"id": 423065, "author": "olfayadi", "title": "Powerchain by Lightency", "url": "https://cardano.ideascale.com/a/dtd/423065-48088", "category": 26600, "amount": 29500, "description": "\n1.2 billion people in the world are living off-grid\nCrypto investors lack access to energy related Crypto assets\nEnergy consumers have a passive role and are not incentivized to produce green energy\n", "f6_no_assessments": 10, "f6_rating": 4.300000000000001, "videos": [], "media": [], "f6_assessments": [{"id": 8044, "q0": "This proposal aims to tackle 3 problems. The first problem is that 1.2 billion people live off-grid, crypto investors have no access to energy-related crypto assets and energy consumers have a passive role and are not incentivized to produce green energy. Lighency wants to build a better Africa using the Cardano network. ADA holders will have the opportunity to participate in the mission to electrify Africa while earning attractive returns. Another advantage is that the end customers who usually do not have a bank account will have a digital identity on the Cardano network. This project will have a positive impact on the Cardano ecosystem by addressing a very large target group. People worldwide have the opportunity to participate in the improvement of Cardano. The main goals included in the proposal correspond to the outlined challenge setting. There are a few future risks included in the proposal. (macro risk, economic risks and cryptocurrency risk) It is good that the submitter has always included the extenuating circumstances with a clear explanation.", "q0r": 5, "q1": "A few people have been included in the proposal along with their relevant experience. The linkedin of these people is not included. You can find their experiences and skills via their website (https://lightency.io) (+ linkedin). Their team members have enough experience to achieve all objectives. There is a very clear description of the budget. The submitter offers clear transparency to where the funding will go. It might be useful to include the working hours that the team members will need to get something done. The hourly wage could also be included. The budget seems sufficient to me to achieve the objectives. There will be a return in the future for financing to complete additional functions. A timetable has been included for the next 2 months and a half. The schedule consists of 8 parts to carry out all work. This timetable seems realistic to me to carry out all the work. The proposal provides a clear implementation plan with the steps needed to get it all done. The budget clearly states what is needed to implement the proposal. The detailed plan lists the technical aspects that must be carried out. This plan also includes a number of milestones. The challenges to be addressed are included in the proposal. It is good that these are divided into macro risk, economic risk and cryptocurrency risk. These have been clearly described by the submitter, together with the mitigating risks.", "q1r": 5, "q2": "An extensive road map with associated milestones has been included. The time frame for this proposal is 3 months and a half. The road map is divided into 8 parts. Several well-chosen milestones have been included for each part.\nSome KPIs are included to track the progress of the project. I think there could be a little higher aim in terms of progress. I would go for at least 20 participants in the treasury funds and mint at least 3 energy certificates on Cardano. The submitter clearly describes the 3 issues that need to be addressed. The first problem is that 1.2 billion people live off-grid, crypto investors have no access to energy-related crypto assets and energy consumers have a passive role and are not incentivized to produce green energy. The submitter offers a clear solution to address these 3 problems through Lightency integration.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 7, "ne": 4, "ng": 2, "nfo": 1, "vca_o": 2}, {"id": 3002, "q0": "This proposal intends to create a DAO energy reserve fund and an energy data tokenization platform that allows P2P energy management and renewable-energy certification.\n\nThat's a good idea in attracting the funding energy projects in improvement the electricity access index, especially in taking advantages of cheap and eco-friendly Renewable Energy (RE), help to overcome the governments regulatory frameworks and to solve the energy crisis  in developing countries like Africa. \nBesides, the Lightency is a decentralised energy marketplace using Cardano network to allow energy exchange and RE certification,  leverage the globalising renewable energy adoption while earning attractive passive income. By hence, it could help to grow the Cardano ecosystem and effectively addresses the challenge.\n\nAs an expert in doing research on blockchain in electricity, I found that the Author quitely correct in giving out the correct problems in: lacking access to energy related Crypto assets, and the current passive role of green energy prosumers.\nOne problem I concern about  \"\"1.2 billion people in the world are living off-grid\"\" but has not evidents. \nFor more convince, this is a reference link for Global/Africa access to electricity could help to clarify the number of such as: https://www.visualcapitalist.com/mapped-billion-people-without-access-to-electricity.\n\n\nThe proposer gave out many risks in macro situation, economic and cryptocurrency, and give out ways to mitigate them. It's a positive point.\nIn general, the author has a pretty good view of the current problems and has also come up with a suitable solution, bringing a lot of value to the community and the Cardano ecosystem. Although there still lack an  evident for problem I showed but I could give maximum score for the impactful.\n\n\nThe proposer gave out many risks in macro situation, economic and cryptocurrency, and give out ways to mitigate them. It's a positive point.\nIn general, the author has a pretty good view of the current problems and has also come up with a suitable solution, bringing a lot of value to the community and the Cardano ecosystem. Although there still lack an  evident for problem I showed but I could give maximum score for the impactful.", "q0r": 5, "q1": "The proposal identifies the necessary resources for project deployment but I found it lacks of Cardano Blockchain programmer/developer, almost members are just managers (CEO, CFO, CTO), we couldn't know about what tech background of Ghada Amayri & Khaled Battiche, and we could not find any the reference links for capacity of these members. Meanwhile, there is not any member working on any other proposals in this Fund9 or any other proposals from previous Funds. The community will be more confident  if the Author provide bio and proof of work of each member.\n\nWith the capacity and POW of the team, we are not sure about 3.5 months timeline for completing many works. In my opinion, the Author could consider to invite or hire some Cardano developer.\n\nThe budget is  broken down but it could be more detailed into hourly work and salary for the community to know if it's enough.\n\nTechnical aspects of this proposal are the most important things I concern because data source is very important and the electricity meter plays main role in P2P energy management and renewable-energy certification.\n\nAnd I am very curios about internet of energy startup, Lightency but I just find some information about introduction, gathered members and roadmap. It's better if the proposer provide a whitepaper describe more about the EMS (Energy Management System), energy certification and dynamic pricing mechanism exchange, especially in microgrid situation. So I think powerledger.io  is a very useful referenced website for this proposal.\n\nIt's a pity that I could not find any marketing campaign to engage community and attract the funding energy projects from private sector .\nWith these above reasons, I doubt about the success of this proposal.", "q1r": 3, "q2": "The proposal intends to attract at least 10 Cardano holders to participate in the treasury funds, mint at least one energy certification on Cardano and Link the Defi protocol with the Powerchain project\nBut no ways for community to track progress, it's better if the proposer builds an item for updating progress and project information on the available website.\nThe team have no a convincing communication strategy with the community, so I suggest to make a marketing campaigne plan to attract participation and for increasing the auditability.\nReaching 1 million dollars after 12 months is a perfect vision for increase  access to electricity of Africa community. But it's just a an internal target, and very difficult for the community verifying independently.\nIn common, I doubt the auditability of this proposal and hope for improvement later.", "q2r": 3, "assessor": "z_assessor_2384", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 3881, "q0": "A great idea, it identifies many of the problems that need to be addressed in this challenge, it covers almost all of the problems the challenge posed, it can scale quickly and large to many other places, they can also solve problems that arise in the future, this is a very good proposition, it brings great development value to the Cardano ecosystem. I want to see this project again in the next Fund if this proposal is not Funded in this Fund. Nowadays with the rapid development of materials and technology, but many parts of the world people still do not have access to electricity, the problem still exists with local governments, there is no copper power source. means difficult access to innovative technology.\n\nThe impact of this project is quite large, the solution of this proposed idea is great, it identifies almost every problem to be solved in this challenge, besides the author's argument through a description that is truly reasonable, clear, and complete. An organization that reserves cryptocurrency to implement energy projects is an interesting solution, managed by Lightency with P2P criteria, and certified renewable energy as a DAO organization is a solution Smart, creative, and trendy.\n\nIt's great that the idea of ​​this proposal details so many risks when it's implemented in practice, and the idea's author outlines solutions to all of them. That not only makes the project go on track with the schedule but also helps the community manage risks from the project when putting it into practice, thereby considering whether to vote in favor of the project. with the idea. The impact of this proposal is enormous. The author has listed risks ranging from macro such as the unstable political situation in Africa to micro risks such as Risks in economic activities, and risks in the cryptocurrency industry and has been So for solutions to mitigate the risks, I agree and trust the capacity and experience of this team to put this project into practice in Africa.\n", "q0r": 5, "q1": "Great when the project provides a clear, logical amount of timetable information for implementation and completion. The goals that the project aims at are also very specific and completely achievable. It is estimated that the project will be implemented and completed within 14 weeks and 4 days, which is a reasonable milestone compared to the items proposed by the project.\n\n The proposed project budget is less than 20% of the total budget of this challenge, compared to the information the scheme provides, some of the project expenditures need to be clarified if it funds. A detailed budget should list the hourly payment of labor in each locality, corresponding to the duties of each person in the project team, the community needs to know it, which helps the transparency of the project. better project.\nFor example How many people to manage the project, and how many people is the Dev Team, .. in general, this is just a small request and it would be better if the author provides more details, and I still believe in the suggestion and this team.\n\nHuman resources to carry out this project have been assigned specific jobs for each item, the members' experiences show that it is completely suitable for the project, but the identity of the members is also difficult to verify. clearly. The author of this project is Olfa Ayadi, with collaborators Jaafar Saied, Mohamed Ali gam, Mohamed mn if, Ghada Amayri & Khaled Battiche, showing that this is an experienced team in implementing this project, however, the author Please provide additional links to identify reputable identities such as LinkedIn, Facebook, Twitter, Discord, ... for the community to verify identity easily and practically.\n", "q1r": 4, "q2": "The transparency of the project is very good, this project provides KPIs to complete the project's goals, all goals are easily measured thanks to the indicators provided by the project, and they are also easily tested in deployment. Goals like: Have at least 10 people participating in the treasury fund, have at least one energy certificate on Cardano, These are completely verifiable goals with easy verification thanks to the information display number.\n\nThe ideas of this project have clearly defined success, although they have not been tested in practice, it is still a good idea. A good proposal and the author can completely run the test with a smaller model to check for himself whether the performance numbers are achieved whether the project is funded or not, but it would be great when the communities African communities have access to electricity, which is the primary and initial goal of this proposal. Completely new idea information on the Cardano platform, which has never received any funding from the Cardano ecosystem.\n", "q2r": 4, "assessor": "z_assessor_2489", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3929, "q0": "The issue being around 1.2 billion people in the world do not have access to electricity, crypto investors not having access to crypto assets related to energy and no incentivize for Energy consumers to produce green energy. The proposal is trying to solve this by making a energy data tokenization platform and a energy reserve fund governed by DAO. This would be helpful to execute energy projects and allows P2P energy management also helping with renewable-energy certification. This proposal does addresses the issue.", "q0r": 5, "q1": "Based on the proposal the proposer and their team has more than 25 years of combined experience in renewable energy sectors and also have experience in Blockchain Technology. This will come very handy to implement the proposal successfully. the proposal do consist of plan and clear timeline on how this proposal will be executed. The proposer have also considered all possible challenges that they face while implementing the proposal. With all these it can be said the proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer has given a complete milestones with time horizon that would be helpful to audit the development of the proposal. The proposal do consist of a clear budget breakdown and this will be helpful for the auditors. The proposal do consist of key performance metrics which will be helpful to measure the success of the proposal and the proposal has also given details regarding how success of the proposal would look like. All these will be helpful to track the progress and the success of the proposal", "q2r": 5, "assessor": "z_assessor_2496", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 4074, "q0": "This is such an exciting and well-written proposal. I would love to see it up and running and creating a positive impact for Africa. Lightency is a technology company specialized in blockchain and renewable energy. Their goal with Powerchain is to create an energy data tokenization platform that allows P2P energy management and renewable-energy certification. This in turn would allow more Africans to have access to green and affordable energy while those who are able to produce some can sell their excess of electricity. These goals strongly align with the challenge settings as they would generate a local impact, attract more African users to Cardano and potentially form and foment local partnerships. Besides that, the solution is built in a scalable and bankable way from the beginning.", "q0r": 5, "q1": "The team presented possesses a strong skillset with a lot of experience in renewable energy and blockchain technology. In their website they provide a bio for each one of the team members. The resources needed to implement the proposal are clearly identified and are satisfied by the five members listed. Additionally, the budget is divided by task required and for each the total amount is reasonable given the workload. Doing the math, we find the average hour rate is close to USD 50. Also, the deadlines estimated seem realistic and shouldn't be a burden to be completed in time. In their website they exhibit a timeline of the project as well. Moreover, the plan described is conductible and is explained in detail. Finally, there were some risks raised concerning the implementation. Volatility of their cryptocurrency could be an issue but they will allocate some of tokens to balance the liquidity pool and the treasury fund will be backed mostly by stablecoins. There are also economic and political risks intrinsic to the African continent. To mitigate that the team has picked up the countries with favorable regulation and where the situation is moderately stable. Also, they are incorporating a company in Mauritius as the country has agreements with most African countries.", "q1r": 5, "q2": "The team has designed a roadmap with clear milestones. There are 8 phases and their duration varies from 4 days to 3 weeks depending on the task. Each of them has well-defined goals and are easy to assess if they have been successfully completed or not. The KPIs are implicitly defined but strongly align with the challenge settings and also translate well if the project has been successful or not. For example, number of Cardano holders participating in the treasury fund and number of energy certifications are KPIs that have been defined by the team. Another strong point of this plan are the SDGs aimed. For instance, SDG 7 and SDG 11, which are respectively, affordable and clean energy and sustainable cities and communities, are at the core of the proposal. However, they have not provided a public channel to update the community on the status of the project. Maybe they will do that on their website but that wasn’t mentioned in the proposal.", "q2r": 5, "assessor": "z_assessor_2513", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4426, "q0": "Challenge's goal is \"growth Africa, growth Cardano\", so this proposal can solve the set goal. When it comes to Africa, there are many places where electricity is still lacking, and this proposal helps to solve that. That's one of the ways to help Africa grow directly because we all know the role of the electricity grid is very important in everyday life. If this proposal is successfully applied, it will help Africa grow gradually and gradually get rid of poverty and lag behind the rest of the world. Especially when this proposal is implemented according to high technology based on the Cardano and DAO blockchain. The team calls it Powerchain. I find it very interesting that Powerchain is an energy data encryption platform that enables P2P energy management and renewable energy certification. As such, we cannot deny the impact this proposal has on Africa and it adds direct value to the Cardano ecosystem. Furthermore, I see that in the future, this proposal can fully scale to address challenges in other regions than African countries. I acknowledge the team's strong effort to increase the impact of the proposal. I completely agree with the feasibility of the proposal - vote 5 stars.", "q0r": 5, "q1": "In terms of the feasibility of the proposal, the team presented about 25 years of experience in the field of renewable energy, 15 years of experience in the field of blockchain technology, and leadership and business experience. In my opinion, these are very necessary experiences to put the proposal into practice. The team has shown a core number of 4 people, accompanied by the necessary authentication documents that are the website lightency.io, the specific identities of each member are made public via the social networking site Linkedin, I am very pleased with this because it is very important for the community to be able to publicly assess the feasibility of the proposal and have confidence in the implementation team. However, I only have a small suggestion for the team which is the link in the Linkedin social network, the team can present this link directly on the proposal for all members of the community to be convenient. access to look up and track, instead of having to go to lightency.io web to see.\nThe terms-the budget has been divided into 8 items, I think these 8 items are all reasons for the team's required goals. The amount of salary required is appropriate for the work intended to be performed. I wish all proposals in Catalyst had a clear, detailed, and logical presentation of the allocation budget as the team did on this proposal. The plan and implementation method are also quite detailed like the allocated budget aspect, it includes 8 steps. Through these details, I commented: This is a team with high professionalism, and good expertise, exactly what the team listed about the experience in the proposal. If we have not received Catalyst funding in Fund 9, will the team continue to implement the proposal?\nI wanted to take a closer look at the resources required to execute, I have no doubt about the 4 core members' ability, but to execute on such a high-impact and large-scale proposition I think the team needs more members. Does the team have collaborators whose names have not been made public on the proposal date? I would like the team to be able to publicly identify as many of the participants as possible to implement the proposal. When doing that, means that the feasibility of the proposal will increase and the community believes in the team more. That's also my advice to the team in terms of the resources needed to execute.\nIn terms of technology, Lightency uses the Cardano blockchain network and also issues Token Light. I know that investors can buy and hold the Light token long-term with a high-interest rate of up to 31% APY. I wonder why the interest rates are so high? This is a very attractive interest rate. Can the team explain more about the interest payment mechanism so that the community can understand it better, thereby increasing the feasibility of the proposal? I fully agree with the token creation and release to the community. Because it is also one of the ways to promote the company's brand.\nJust now are my suggestions and the questions that I have asked to further strengthen the feasibility of the proposal. In summary, I completely agree with the feasibility of the proposal.", "q1r": 5, "q2": "To clearly define the auditability and transparency of the proposal. The team has come up with a clear roadmap of milestones, with a duration of 14 weeks and 4 days. In my opinion, to increase auditability, the team can attach the milestones roadmap to specific months in a year, which makes it very easy for the community to audit and evaluate work progress according to actual progress. presently. These tips of mine are only given for the sole purpose of making the proposal more complete, it is completely positive. Through the KPIs, the team has come up with a specific number - 10 people participating in the treasury fund and having at least 1 energy certificate on Cardano. I'm very pleased with these metrics because it makes transparency and auditing a lot clearer. It's a pity that we can't see key metrics. But in return, the team defines very well what success this project looks like. I am convinced by that. Throughout the proposal are a clear and understandable problem description and accompanying solution. This is a good idea, very practical,, and easy to apply in life. It is worth mentioning that when successfully applied it will greatly change the quality of life of African people. I hope the proposal will soon be put into practice and the implementation project will be a great success. I strongly agree - vote 5 stars.", "q2r": 5, "assessor": "z_assessor_2552", "no_vca": 9, "ne": 2, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5106, "q0": "The Proposal is a $29,500 request for two products - “ The first is powerchain, a decentralized marketplace that tokenizes energy data to enable peer-to-peer energy exchange and certification with dynamic pricing. The second solution is a reserve energy fund that interacts with borrowing protocols to fund green projects”. \n_______________________________________\nThe website and background research I could do indicate the team is developing a DAO, a token called Light and a high APY for investing. I  was not able to understand or develop a basis for how the p2p energy green credits worked in. There is a claim of helping African electrification-“ ADA holders will be able to participate in the mission of electrifying Africa while earning attractive Yield.”However, there were no real facts, plans, or details towards electricfication development. \n—————————————————-\nDue to the in depth discussion of tokens, returns and DAO formation, yet none of the flip side of the coin, an actual project developing Electric-green or otherwise, my Assessment is a 3( neutral whether the proposal effectively addresses the Challenge) star. ", "q0r": 3, "q1": "The Feasibility of this proposal is similar in my assessment as was the solution section, in that it addresses one phase of the proposal - the DAO and tokens but not the energy side. The website is well designed and the team listed thru their Bios and background LinkedIn have strong credentials. The company lists 7 employees. The Main Proposers name is not one of the seven as I understand it and only joined Catalyst recently and gave the proposal a high number of Kudos the same day which caused me to raise an eyebrow. \n—————————————-///————\nThe budget is poorly detailed and focused on token issuance with nothing about energy. Every category seems to be at a rate of $2000 per week with limited detail. The implementation plan is also lacking details about the energy product. \n——————————————————-\nDue, primarily to the lack of details as discussed around the energy product side, budget and plan my assessment is a three ( neutral) star. ", "q1r": 3, "q2": "To be in full disclosure I have assessed and backchecked the web, GitHub and all other documents. I do not comprehend what the proposal is trying to achieve, so I cannot connect its audit statement of: “ Answer\nKPIs: \n- Attract Cardano holders to participate in the treasury funds: Get at least 10 participants in the treasury funds.\n- Mint at least one energy certification on Cardano.\n- Link the Defi protocol with the Powerchain project.”.\nI do not know what the Energy Certificate is. And, how can 10 participants of how much $ Be an audit item. \n——————————————————\nMy assessment is a 2 ( disagree this can be audited ) star. ", "q2r": 2, "assessor": "z_assessor_2671", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6621, "q0": "Inside of the main Lightency’s objectives we can understand the need of finding a solution to the lack of access to electricity around the citizens. What I am missing is understanding how Lightency would proceed in the event of a massive crash in the crypto market, it only says that they will allocate 16% of tokens to balance the liquidity pool which it is an ineffective solution in case of the born of new projects during bear markets because of volatility and the fear of future investors. This solution can also  be effective but it is not a warranty. It would be nice to know more about the alternatives the Lightency’s team have in the case of unexpected events, but the proposal is looking for a solution to a huge problem for the majority of citizens, changing their life’s quality and  also adding much value to the Cardano ecosystem during the process. I rate the impact of this proposal with a score of 4.   \n", "q0r": 4, "q1": "The proposer team states that it has the necessary experience combining 25 years in renewable energy, 15 years in blockchain technology and 30 years of professional skills in leadership and entrepreneurial experience with some of the information supported about the team on their official page, it would be fine to support all the information about the team because some members had not linked their profiles. The proposal provides a detailed and reasonable budget with a specific amount, resources, and estimated time for each stage. I rate feasibility with a score of 2.\n", "q1r": 2, "q2": "The proposal provides a rather simple roadmap and milestone at the Lightency’s official page that could be more detailed about some of their stages giving more information. On the other hand, I think that the proposer is aware of the challenges and the solutions for the problem of electricity access are well planned with a great possibility of exit. I rate auditability with a score of 4.\n\n", "q2r": 4, "assessor": "z_assessor_2822", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 7777, "q0": "The proposal addresses the challenge, the proposed solution improves the supply of electricity for Africans. The use of blockchain requires some materials and the electricity is essential for the use of blockchain. Cardano blockchain uses POS as the concensus of algorithm which is more sustainable for the environment because it uses less energy, contrarily to other blockchains like Bitcoin that use POW the consensus that requires more energy, but in all the cases electricity is required to run the blockchain. Delivering this solution will have an considerable impact on the cardano ecosystem.", "q0r": 4, "q1": "The proposed solution requires some special competences and the presented team skills match the needed ones to achieve the work, there's a timeframe broken into weeks and the budget is explained per amount per activity, and potential risks are taken in consideration. i strongly agree with 5 stars.", "q1r": 5, "q2": "The auditability of the project is possible, KPIs are clearly given, milestones are given and relevent links are available to allow the community to audit the progress of project. You should guys provide clear dates for delivering this, anyway with the given informations the proposal  is likely going to be implemented.", "q2r": 4, "assessor": "z_assessor_2918", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 11614, "q0": "The proposer and his team has done a very wonderful job by presenting this proposal in this challenge. It is one of the innovative proposal I have come across in this challenge and I therefore say the proposal effectively addresses these challenges and has a great potential of bringing value to the cardano  ecosystem. The proposer and his team have done a vigorous job and their research proved that in most cases in Africa electricity is monopolized by government utilities agencies who are unable or failed to provide or to Electrify their citizenry. The proposal said that 2 out of 3 Africans have access to electricity which is woefully inadequate comparing with the Global expectation that by 2030 all countries electrification should reach the highest of all communities in the world. The same cannot be said here in the case of Africa, Africa is still lagging behind and so according to this proposer and his team they are channeling their resources time and energy to the provision of electricity through private bodies. A chunk of their innovative ways they intend to do it include, lightency which is to help build a better Africa using cardano network. Ada holders will be able to participate in the mission of electrifying Africa while earning attractive yields. The end customers who are mostly  unbanked will have a digital identity on the cardano network. Macro risk confronting this proposal include operating in African countries present as political uncertainty, to mitigate this there's a need for the local partnership and end consumers to own the physical asset and the urgent need for electricity  lowers the risk in itself these and many other suggestions.  In terms of operating and economic risk, it's said the revenue generation in some African countries is not a granted process the government corporations is sometimes very slow, to mitigate this one too, the proposer and his team suggest that the incorporation of a Mauritius based company which the country has agreements with most of the African countries. This will ease the processes of any profit generation. The proposer and his team also prefer work in countries where Central Bank has issued a digital currency(CDBC)\nIn the area of cryptocurrency risk, the proposer said volatility is a threat to lightency business model, using cryptocurrencies as collateral can create a risk of liquidation considering the market volatility, to mitigate these the proposal suggests that allocating 16% of lightency tokens to balance the liquidity pool in case of big crypto volatility, and also treasury fund will be backed mostly by stable coins. With this innovative ways and in-depth knowledge about all that they are up to, I think this project deserve funding as most African countries are suffering in terms of electrifying their countries.", "q0r": 5, "q1": "Given the experience of the proposer and his team and the link of his team members as provided shows their level of expertise to execute and implement this program successfully should they be funded. The links and details of the team members have been provided. They intend to carry out a number of projects and milestones in the given timeline where they are expected to complete this project. The timeline for the project is 3 months and half, that is 14 weeks 4 days. Project management and coordination, time estimated is 2 weeks. They intend to create tokens unlock tokens, they also intend developing smart contract to create a mint tokens, they want to develop smart contracts to create unlock tokens and also want to do test invalidation. The proposer and his team are also intending to connect and create wallets, interact with cardano SDK to connect wallets these and many others are some of the milestones and  they expected to use to 1,2,3,4 weeks depending on the length of the project if funded. I think with the aforementioned project they are expected to carry out, the proposer and his team deserve commendation. They have also provided a budget needed to be able to execute this program they have taken the pain to break the budget down into identifiable bits which correlate to every activity they intend to carry at the end of the day if funded. It's interesting to note that the proposer and his team saw the challenge and made time with it and their knowledge and expertise to carry wholly if funded ", "q1r": 5, "q2": "This proposal is one of the shortest but problem solving. The proposer and his team has provided information which is sufficient enough to aid in the auditing of the progress and success of this project. The proposer and his team intend to use KPI as a major tool for auditing and this is attracting Cardano holders to participate in the treasure funds get at least 10 participants in the Treasury. Those also want to mint at least one energy certification. What does success of the project look like, the proposer and his team are optimistic that the project will be considered successful if the treasury funds gets bigger exponentially reaching out to $1milion dollars after 12 months, is a target the proposer and his team has set up internally. They also intimated that the growth would mean that African Communities are getting access to electricity which is the main and initial aim of the proposal if funded. For all that has been listed above these are all tangibles that one can trace and track to monitor the progress and success on this project with ease. Therefore agree with the proposal that this project be funded in order to help in the execution of this program that will bring more to Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_3260", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "A crypto energy reserve fund governed by DAO implements energy projects.\nPowerchain is an energy data tokenization platform that allows P2P energy management and renewable-energy certification.", "experience": "\nProfessional experience of over 25 years combined in renewable energy.\nProfessional experience of 15 years combined in Blockchain Technology\nProfessional experience skills of 30 Years combined in leadership and entrepreneurial experience\n"}