{"id": 382562, "author": "yojo", "title": "Distributed Autonomous Accelerator", "url": "https://cardano.ideascale.com/a/dtd/382562-48088", "category": 26255, "amount": 55000, "description": "El modelo típico de acelerador no está adaptado a un sistema global distribuido y estructuralmente infrafinancia a las comunidades infrarrepresentadas.", "funded": 1, "upvotes": 39761550, "downvotes": 8734941, "votes_result": 31026609, "votes_cast": 168, "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "El planteamiento del problema y la premisa de este proyecto son claros, buscan abordar la desigualdad estructural inherente al modelo de acelador mediante la realización de investigaciones sobre el impacto de los equipos que se nutren no por su \"potencial de unicornio\", sino por los resultados de beneficio social. La creación del Acelerador Autónomo Distribuido (DAA) será co-creada por este equipo y se propone ayudar a Cardano a aumentar la colaboración humana para hacer del mundo un lugar mejor. El equipo ha optado por utilizar licencias abiertas para que la ampliación de esta idea también esté abierta a otros.  ", "q0r": 5, "q1": "El proyecto implica una gran implicación de la comunidad, investigación y documentación. El equipo detrás de este proyecto ya ha identificado una serie de proyectos en F7 que les gustaría apoyar hasta su realización y documentar ese proceso. El equipo del proyecto parece sólido y tiene una serie de habilidades complementarias y experiencia en Cardano y finanzas que sería realmente beneficioso para los proyectos a aprovechar.\r\n\r\nEl presupuesto y el calendario son muy claros, hay un compromiso serio con la consulta profunda con la comunidad y la co-creación que, teniendo en cuenta donde Cardano está en la vida sería muy beneficioso para capturar esta investigación y el proceso en su propio derecho.", "q1r": 5, "q2": "La comunidad estaría involucrada e invitada a la creación de esta DAA, por lo que podría seguir el progreso de esta manera. El equipo también se ha comprometido a informar en los ayuntamientos y a participar directamente en las reuniones establecidas, etc. Los indicadores clave de rendimiento y los resultados de este proyecto están claros, así como los hitos del proyecto. El seguimiento del éxito de la entrega no supondría un problema, ya que el calendario está claramente trazado y vinculado a determinados KPI, y podría adaptarse y modificarse fácilmente en función de los resultados o la influencia de la investigación a lo largo del proyecto.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "It's a very ambitious idea to basically overhaul the entire accelerator model. Yet, this is just one perspective - an initial non-academic study with a very limited scope - that MIGHT lead to something in the future.\r\n\r\nProposed solution: \"Conduct a research project for a radical decentralized blockchain accelerator that nurtures teams that are worth investing in any context.\"\r\n\r\nIf I understood this correctly, it means focusing on the team more than their business idea. That is a very wise approach.", "q0r": 3, "q1": "The team is really good but only partly available. Essentially the budget pays for the team's time (in total: 2 people's full-time effort for 3 months). One month per person cost is quite high: $9,167 USD. The actual design and implementation of the DAA is not covered with this; only the research.\r\n\r\nReadiness to collaborate with other teams is admirable. One more initiative missing from the list is the Strategy Framework (https://cardano.ideascale.com/a/dtd/382562-48088), that this and other accelerators will hopefully get to utilize in the future.\r\n\r\nThe linked website http://incommons.love/ is unreachable.", "q1r": 3, "q2": "The plan outlines the deliverables and methods how the study is conducted. It is done in close collaboration with other teams and the community in general so following up on the team's progress should be fairly easy. Definitely an auditable and easy to measure approach.", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 23, "ne": 3, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "Proposal performs research on how to accelerate funded proposals by complementing different information to specific areas and sort of provides guidelines. \r\n\r\nIt is a great idea, yet it is questionable if the research will bring the expected outcome.\r\n\r\nI find this proposal in strong accordance with the challenge goal, yet any type of research proposal is having a question mark on its outcome, thus decreasing the effectiveness score.\r\n\r\nRating given 4.", "q0r": 4, "q1": "The team is stating relevant experience and skills required to implement the proposal.\r\n\r\nThe budget is in accordance with the scale of the proposal, which seems reasonable. \r\n\r\nThe roadmap is provided at a more than sufficient level, which is nice to see and provides a solid base.\r\n\r\nRating given 5.\r\n", "q1r": 5, "q2": "The proposal contains relevant KPIs and the roadmap. Both of these are sufficient for audit. \r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "According to the proposal, the purpose is to conduct a research project for a radical decentralized blockchain accelerator that guides teams. They seek to accelerate and enable projects that intend to deliver public goods with many different kinds of returns, many of which have no place in the current portfolios. The challenge is addressed effectively.", "q0r": 4, "q1": "The team of 4 experts who are Designer, Impact Engineer, Impact Entrepreneur, Mentor, Systems Software Engineer, Business Project Organizer and they are capable of implementing the proposal successfully. The plan mentioned , among others, research and articulate the requirements needed to deliver a Distributed Autonomous Accelerator that acknowledges blockchain; set up project management and framework to communicate ; Create documentation and knowledge resource repository; Describe the roadmap to activation. which will all make implementation successful.", "q1r": 4, "q2": "Some measurable KPIs are recruitment of initial 10 Catalyst thought leaders; 12 meetups; 2 After Town halls; 20 interviews; The road map is 12 months of work duration with different schedules; the budget is broken down effectively, which will make auditing effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The proposal outlines a problem which perfectly aligns with the challenge setting. The solution is broken down into multiple steps in the 'think big, start mall' way. In the short term the funded projects do not benefit from this proposal. In the long term this approach has the potential to become a game changer for Catalyst funded projects. ", "q0r": 4, "q1": "The proposer provides a long list of evidence to show required skills, experience and reputation needed to start with execute and deliver the proposed solution. \r\nThe proposal starts in an agile way and includes in a step-wise approach huge parts of the community. The roadmap is realistic and explains planned activities and results after 1, 3, 6 and 12 months. To open the potential for the long-term it also foresees the licensing of the elaborated solution. The budget is assigned to roles (2 FTEs) and reasonable for people in a very senior level. ", "q1r": 5, "q2": "The proposer provides a detailed insight what they intend to do. The description is understandable and aims to solve the problem. The KPIs are clear and help solve the challenge's setting. What could be improved is a more defined picture of the deliverables, although is is highly depended on the research outcome.", "q2r": 4, "assessor": "z_assessor_737", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Llevar a cabo un proyecto de investigación para una aceleradora de blockchain descentralizada y radical que nutra a los equipos que merecen invertir en cualquier contexto.", "experience": "Llevamos más de una década dirigiendo programas de incubación y aceleración de emprendedores. Asesoramos a startups y cofundamos empresas de tecnología financiera."}