{"id": 384635, "author": "chrisr", "title": "Distributed Digital ID SharkTank", "url": "https://cardano.ideascale.com/a/dtd/384635-48088", "category": 26255, "amount": 26800, "description": "¡La tecnología de identificación digital descentralizada, la gobernanza y las implementaciones requieren apoyo! ¡¡Cardano necesita un filtro/acelerador para promover proyectos!!", "funded": 1, "upvotes": 28698861, "downvotes": 11465470, "votes_result": 17233391, "votes_cast": 109, "f6_no_assessments": 5, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "Sí, la propuesta aborda eficazmente el reto. Los proponentes hacen un buen trabajo al resaltar el problema que intentan resolver y al proporcionar una solución sobre cómo abordarlo. Dependiendo de quiénes sean los \"tiburones\", podría haber un gran impacto, sin embargo, esto no está claro en la propuesta ya que no se han identificado nombres, dejando a los votantes que adivinen el nivel potencial y la sustantividad del impacto. Tampoco está claro por qué se ha optado por este enfoque frente a otro más específico y práctico. Aunque no me opongo al estilo del tanque de tiburones que se propone, me parece extraño que la selección/identificación de los tiburones no constituya un componente clave de la propuesta. Tampoco me parece obvio por qué la sesión de entrenamiento de 60 minutos sería solicitada. ¿No se trata de ayudar a orientar y acelerar el proyecto mediante la participación directa de estos expertos? Aparte de ayudar a perfeccionar las ideas presentadas, ¿cómo van a apoyar los tiburones el avance y la aplicación de los proyectos que critican? ¿Qué pueden esperar los presentadores aparte de una \"paliza\", especialmente para los que no están en el top de cada semana? Para obtener la máxima puntuación, animaría al equipo a considerar la posibilidad de abordar estos puntos.", "q0r": 4, "q1": "Lamentablemente, basándome en el plan y la experiencia presentados, no estoy ni de acuerdo ni en desacuerdo con que esta propuesta pueda llevarse a cabo con éxito. Aunque aprecio las credenciales aportadas por los proponentes, que ayudan a dar cierta confianza en su capacidad de ejecución, el hecho de que no se hayan nombrado los \"tiburones\", y mucho menos se hayan comprometido, hace imposible saber si el proyecto puede estar a la altura de lo que dice que va a hacer. El calendario es aceptable y los objetivos/objetivos después de 3 y 12 meses son claros, pero el objetivo/objetivo después de 6 meses es demasiado abstracto y no proporciona ninguna indicación de cómo se logrará. ¿Qué significa realmente el \"Reconocimiento mundial por el liderazgo intelectual en el lanzamiento de un proyecto/empresa de identidad digital descentralizada\" y quién otorga este tipo de \"reconocimiento\"? El presupuesto también deja mucho que desear para los votantes, en particular, ya que la mayor parte de los 20.000 dólares del presupuesto es sólo para \"comprometer a los tiburones\", pero luego no se proporcionan detalles sobre lo que realmente significa esto. ¿Cómo se separará el dinero? ¿4k cada uno? ¿Se mantendrá un contingente para un respaldo en caso de que un tiburón no pueda asistir? ¿Habrá tiburones alternativos? Como me quedan tantas preguntas que no se abordan ni se incluyen en la propuesta, no puedo dar una mayor puntuación.", "q1r": 3, "q2": "Lamentablemente, la información proporcionada no ofrece suficientes pruebas para demostrar que la comunidad puede auditar suficientemente el progreso y el éxito de la propuesta. Los proponentes proporcionan al menos dos parámetros medibles que los votantes podrían utilizar para auditar el proceso (seis sesiones completadas con tres proyectos/equipos cualificados; y tres ganadores del Shark Tank de Identidad Digital Distribuida que están produciendo resultados tangibles), sin embargo, estos son demasiado amplios y no proporcionan indicaciones sobre si el enfoque del \"tanque de tiburones\" realmente ha dado los resultados que se pretenden. Como la mayor parte del presupuesto es para los \"tiburones\" y no para los proponentes, no está claro cómo la comunidad podría medir y valorar el éxito del dinero. ¿Cómo podría la comunidad determinar qué tiburón o tiburones añadieron valor en comparación con otros que quizá no lo hicieron? La razón por la que doy a esta propuesta un 3/5 y no un 2 es porque mencionan que trabajarán en colaboración con la dirección del IOG para seleccionar a los candidatos. Aunque me hubiera gustado tener más detalles (como se mencionó anteriormente) sobre cómo será este proceso y los criterios utilizados para que los miembros de la comunidad interesados pudieran saber cómo y por qué se elige a quien se hace, la inclusión del IOG en el proceso de toma de decisiones puede dar a los votantes un poco más de confianza en que podrán auditar la propuesta.", "q2r": 3, "assessor": "z_assessor_66", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is to run a SharkTank session every 2 weeks for 5 months from Feb22  focused on Digital ID products.\r\nGiven there is a specific challenge to \"Accelerate Digital Identity\", it feels this proposal would better sit there. Saying that, it is a relatively low cost proposal thus as part of a suite of accepted proposals under this challenge could be seen to meet the brief. ", "q0r": 4, "q1": "The key to this proposal is recruitment of 5 Sharks. Presumably these Sharks will buy equity in projects they like as in the TV version of the SharkTank. These Sharks have not yet been committed, so the whole project relies on that. The proposer has experience in this domain, though the company he is CEO of is has only 3 employees and 7 followers on LinkedIn.\r\nWithout the Sharks, its hard to say if this will be success. There are no details on how this marketed, just a $6k budget line. Zoom is mentioned in the budget, so presumably that's where the sessions will be conducted, but the key strength in the SharkTank concept is viewership. ", "q1r": 3, "q2": "The project has a clear deliverable of SharkTank sessions every two week from Feb 2022. However there is not much detail on what these actually entail or even how long they go for. How to we then audit delivery? As the sharks themselves are clearly integral, a Time line for them committing should be a deliverable, but also probably some sort of metric on their quality.\r\nIts not clear why the KPI for success after 3 months is 6 delivered sessions If they are to be every two weeks, should this not be 12-13?\r\nWhilst the goal for 6 months is laudable, how to you measure \"Global recognition for Thought Leadership in decentralized digital identity project/business launch\"?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 25, "ne": 5, "ng": 19, "nfo": 1, "vca_o": 1}, {"q0": "It's a really nice idea, although the expected outcomes and impact are a bit vague: \"Top teams from each session will be rewarded with coaching and network connections\". Also, unless you have a commitment from the funders you shouldn't make guesses like \"additional funding provided by IOG\" (what exactly is your connection with them and what has Tony Rose committed to?). Finally, if you call it the Shark Tank you set the expectation that it's a TV Show. This, however, is nothing but six sessions in Zoom, right? Even that might be hugely beneficial for the participants but no need to sugar-coat what it is.", "q0r": 3, "q1": "Team seems solid and especially their subject matter expertise with SSI / DDID is noteworthy. The plan, however, is a bit generic/ambiguous and it is not fully explained what \"engaging the sharks\" entails. What are we paying 20K for? Involvement from Tony Rose (IOG Head of Product, Identity) could be elaborated a bit more.", "q1r": 4, "q2": "Although not necessarily under those headings, there is a certain roadmap with milestones and a time horizon for achieving the goals. It's a simple proposal that doesn't necessarily need any more KPIs than what has been stated here (six 60-minute coaching sessions with 5 sharks).  The problem statement could have been crystalized better though. Now it unfortunately sounds a bit like solution is looking for a problem, not the other way around.", "q2r": 3, "assessor": "z_assessor_289", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "* The proposal aligns well with the challenge setting. Our funded projects need a certain audience in order to grow, become investable and attract more developers, mentors, investors, customers. The solution is adressed, but could be a bit more clearly defined. It has the potential to boost many funded projects top the next stage. Therefore the proposal provides scalability for future challenges. What remains unclear is the targeted demographic group. I would love to get more information about it.", "q0r": 3, "q1": "    - [ ] The proposal presents a team incl. linkedin and shows experience in the field of action. The proposal assumes the reader knows who Tony Rose is and what SSI stands for. I don't know either. If Tony Rose has a huge and the right audience which helps our funded projects, please include it into the proposal. The timeline is reasonable and clear. The budget break down could be more specified. Especially the 'engage the sharks' position is responsible for 3/4 of the requested budget and we do not get enough information how to approach and win them. The KPIs are included in the roadmap and indicate that after six sessions we get 3 teams (18 on total) promoted. What remains open if this stops after 3 months or if we can multiply it by 4 in order to have 18x4 = 72 teams promoted with this proposal after 12 months. If yes then the budget/team ratio is pretty reasonable for the case that we reach a certain audience which is not further specified. Adding more details could improve the level of quality of this proposal.", "q1r": 3, "q2": "The problem statement is understandable. There are clear metrics in order to measure the success of this proposal. The timeline is also clear. Unclear is where the money goes to, in detail. A break down which is more easy to follow would help a lot. Unclear is also how to attract the requested qualified, recognized, and respected leaders beyond the project team. It would be great to get an updated version with a bit clearer explanation.\t", "q2r": 3, "assessor": "z_assessor_737", "no_vca": 13, "ne": 3, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "The proposal suggests that the Digital Identity Shark Tank team will be the advisory and accelerator team to deliver results and guide and coach Cardano project teams. This could be a good thing to accelerate proposals with potential and provide them with the necessary mentorship. In the end this will have a positive impact on the Cardano eco system.", "q0r": 4, "q1": "The Proposer has made available links to two team members who will be the project leads. Then makes mention of Qualified, recognized, and respected leaders in SSI from India, Europe, Africa, Central/South America, Asia, and North America. It would have been beneficial to the proposal if these Qualified professionals were identified already with links to their experience and skills. This would make the project more feasible. Breaking down the budget a little more could also help community members and voters see that proper research has been done around the possible cost aspects. The timeline seems realistic. Resources and risks are not mentioned. This would add to the likeliness of the proposal being voted for.", "q1r": 3, "q2": "The auditability of the proposal will be measured by the results which is stated in the definition of success, with a 3, 6 and 12 months timeline and what they expect to achieve. This will also give an idea of the success of the project. A space should be provided where the community can keep track and follow the results of the project. This could really be a good project.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Un panel de 5 expertos en identificación digital, presentado por Tony Rose, revisará los proyectos. Sesiones de coaching de 60 minutos disponibles bajo petición.", "experience": "Experiencia combinada de más de 80 años de experiencia empresarial, inversora y ejecutiva en el ámbito de la tecnología, incluyendo líderes reconocidos mundialmente en SSI."}