{"id": 382468, "author": "fellx27", "title": "The Tipchecker", "url": "https://cardano.ideascale.com/a/dtd/382468-48088", "category": 26250, "amount": 3000, "description": "有时很难理解你的Cardano节点是否与网络正常同步。它卡住了吗？还是它有稳定的欠同步？", "funded": 0, "upvotes": 20231918, "downvotes": 19040444, "votes_result": 1191474, "votes_cast": 106, "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal already has a working prototype, thus the project can have users on day one, in that way the proposal addresses the challenge of having end users within 90 days. The proposal is to improve an existing product, with an improved product, more users will be attracted to the blockchain. ", "q0r": 3, "q1": "The proposal presented a working prototype and link to test the product. I would like to see a link to the LinkedIn of the lead developer to learn more about the 4 years' experience developing for Cardano. The proposal provided a link to a GitHub repository. Although no clear plan was presented for the better algorithm and dashboard, I feel due to the already working prototype that the proposal will be implemented successfully.", "q1r": 4, "q2": "I would like to see the team develop a simple 3month roadmap with milestones to connect the funds expenditure with the goals of the proposal. I would like the team to develop KPI's to help track performance, for example have TG Bot by week 4, 5 dashboard features by week 8 etc. I feel the information provided is might be challenging to audit the progress and success of the proposal.", "q2r": 3, "assessor": "z_assessor_358", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "I understand this proposal builds Tipchecker as a small unix-way tool that can be used to get relative sync status. Benefits when using to increase efficiency, the product has been released. It's even better when the proponent gives real user reviews", "q0r": 3, "q1": "As I stated in the impact section, this proposal has a product. The functions, demos are well described, you should add user reviews and what changes will you upgrade in the next 3 months. I don't see any suggester identity links. The proposed amount is small, but it is not clear how it is calculated, how long does it take you to build it?", "q1r": 3, "q2": "Does the product already have actual user reviews to detect risk issues and instead of relative detection can it detect better?", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The proposal details a script called the tipchecker which looks at a running Cardano stake pool node and checks whether the node is correctly synced with the Cardano blockchain. A website is provided that demos the checker for a specific pool. The proposer doesn't mention if there is anything else in the ecosystem that does this or not and doesn't mention whether this simple script (as it stands) should be integrated into the existing cardano node implementations or similar. It is hard to gage whether this should be a short term work around until a better solution is provided by a node implementation or whether there is good merit and potential impact of this project getting funding and expanding on what has been made. Some information and evidence about their collaboration with IOG and the community on this problem area would be useful to provide more evidence that this is indeed a high impact problem to solve separately as has been described.", "q0r": 3, "q1": "No team information is provided. The proposer has detailed the key features that will be implemented if funded but provides no timeline as to when it would be implemented.\r\n\r\nThe root of the website is the medusa wallet which can be found at https://adawallet.io/ which is a more reputable source that the team behind this project would be able to feasibly deliver the proposal suggested.\r\n\r\nThe page on the Medusa site pointing to this proposal provides some evidence that this team can deliver.\r\n\r\nMore information would be welcomed on the team behind the proposal and more sources to showcase skill sets. A better budget break down would also be appreciated.", "q1r": 4, "q2": "No success objectives or KPIs are provided nor a roadmap of when the proposal would be executed. More clarity is needed on who is already using this project, what the current state is in the ecosystem to help provide evidence of its need and better proof that the team is capable of delivering. The proposer doesn't give a timeline or specific condition for when the proposal features outlined would become open source but says that it would be open source in the future.", "q2r": 2, "assessor": "z_assessor_758", "no_vca": 15, "ne": 5, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Tipchecker是一个小型的unix-way工具，你可以用它来获得你的相对同步状态!", "experience": "4年的Cardano生态系统的开发工作。\n计算机科学和数字安全学位"}