{"id": 380930, "author": "torben", "title": "Trustful Global Projects", "url": "https://cardano.ideascale.com/a/dtd/380930-48088", "category": 26240, "amount": 80100, "description": "Los promotores y los clientes quieren trabajar juntos con éxito, pero llegar a acuerdos o realizar pagos a nivel internacional es complicado.", "funded": 1, "upvotes": 26222273, "downvotes": 19472003, "votes_result": 6750270, "votes_cast": 157, "f6_no_assessments": 7, "f6_rating": 3.6666666666666674, "videos": [], "media": [], "f6_assessments": [{"q0": "Me gustaría felicitar al autor por esta propuesta, además de encajar muy bien con el objetivo del reto, está muy bien escrita, la información se da de la manera que debe ser: de forma directa, sucinta y clara. La propuesta es perfecta para el reto porque busca crear una plataforma que registre una serie de información sobre la ejecución de un proyecto en la blockchain de Cardano, como cita el autor: \"especificación del software, alcance del proyecto, cronograma del proyecto\" y etc. Esto responde muy bien a lo que buscamos en el reto que sin duda aumentará la fiabilidad de las transacciones para aquellos que no pueden contratar a un intermediario externo para trabajar en sus proyectos, y el autor argumenta muy bien la importancia de crear un producto así. A menudo, quienes quieren ejecutar el proyecto no lo hacen por falta de confianza en lo que se presenta, mientras que los desarrolladores también pueden sentirse inseguros sobre el pago que se promete. Estos y otros muchos detalles son los que realmente impiden el éxito de algunos proyectos, por lo que llenar estas lagunas no sólo añadirá valor a nuestra blockchain, sino que también aumentará el número de proyectos en los que participan las distintas instancias del universo Cardano. El autor deja muy claro cuáles son sus objetivos con el desarrollo de esta plataforma a través de temas, con el fin de sintetizar y reforzar lo explicado a lo largo de la primera parte de la propuesta y alineándose perfectamente con lo que se pide en el reto. Además de todo esto, al final de los procesos, se seguiría generando NFT, añadiendo aún más valor a la propuesta.", "q0r": 5, "q1": "Ciertamente este proyecto está en buenas manos, entre otras cosas porque ha sido perfectamente presentado y descrito aquí. Conocemos las áreas de especialización del autor principal y también a los demás componentes que conforman el equipo, sin embargo, sería beneficioso que se detallara más a cada uno de ellos, porque lo que tenemos es sólo y sus nombres y funciones. Siempre es interesante saber cuáles son sus experiencias previas, ejemplos de proyectos que ya han realizado, cuánto tiempo llevan en el área, etc, y esto se podría contar con un breve texto para cada miembro del equipo o incluso adjuntando sus perfiles de linkedin. En cuanto a lo que se va a hacer, durante cuánto tiempo y en qué orden, se nos da un desglose en meses y las principales tareas que se van a realizar en esos periodos de tiempo, pero al ser un proyecto muy extenso y complejo, sería importante que estos pasos fueran más detallados aún. Por ejemplo, pienso en cómo sería la comercialización de este proyecto, es un producto muy bueno y lleno de potencial, pero ¿cómo llegaría al conocimiento de los desarrolladores? ¿Y cómo se presentarían las ventajas de su uso? La parte de la divulgación no fue explicada aquí, la eché en falta, además de detallar las tareas mencionadas. De la misma manera, también sería positivo que se detallara más cómo se utilizaría el dinero de la financiación, sí tenemos un desglose del dinero para determinados fines, pero el autor podría aclarar más cómo se produciría cada uno de ellos. Vuelvo a citar la parte de marketing, ¿cómo se aplicarían los 4300 dólares? El sueldo de alguien que iba a trabajar con ello, además de publicidad pagada en algún canal, si es así, en cuál?", "q1r": 3, "q2": "Para mí, esta era la parte que más se deseaba en la propuesta. El proyecto es muy grande y complejo, por lo que requiere un seguimiento continuo y estrecho. Hay muchas actividades en marcha y un largo período de tiempo, y ya sabemos, de forma aproximada, cuáles son las intenciones de cada cosa que va a suceder a medida que pasan los meses. Así, por ejemplo, se podría determinar la realización de reuniones periódicas con algunos miembros de la comunidad que estén capacitados técnicamente para controlar la marcha del proyecto, con el fin de verificar que todo se está haciendo como se prometió y en los plazos previstos. Y si no es así, detectar los fallos e idear colectivamente formas de resolverlos. Además, sería beneficioso que el equipo presentara los resultados de forma progresiva, es decir, que se mostraran los datos a lo largo de los meses y se explicara el estado actual exacto del proyecto. Es positivo que el autor determine su intención de uso, de 9 a 12 meses 200 desarrolladores fijos utilizando la herramienta y 1000 cuando el proyecto ya está bien encaminado, esta es una forma de medir el éxito. Otra forma que pensé sería darse cuenta de cuántas asociaciones con ID Atala Prism se haría a causa de este proyecto, por lo que sería posible controlar desde otro punto de vista el éxito de la herramienta está siendo adoptado.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Excellent proposal regarding a much-needed application.  Blockchain technology holds much promise but proper interfacing with existing legal and contractual frameworks is an important infrastructural need.  The proposes describe a system that would allow developers and entrepreneurs to find matches and complete contracts in a seamless manner.  Successful execution would strengthen the Cardano ecosystem development environment.", "q0r": 5, "q1": "This is a challenging proposal with many difficult components.  The proposers have clearly described how they will approach the development of the project but even if well executed there may be challenges which are difficult to overcome in the first year.  Nevertheless, this is a worthwhile endeavor to support.", "q1r": 4, "q2": "The team has articulated specific goals for 6, 9, 12 months and beyond.  The team and budget are well described so there is a clear expectation of who will be working on the project and what their responsibilities are for succcess.", "q2r": 5, "assessor": "z_assessor_145", "no_vca": 25, "ne": 3, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": " The idea is not specific for Cardano and can be generalized for any decentralized activity. the software proposed to be built will enable developers and proposers to work in a trust-less environment. The dispute resolution mechanism needs more clarity. If there is a dispute regarding the completion of work. How will the system handles the issue will determine the success of the system. However, the proposal is addressing an important challenge in this ecosystem. ", "q0r": 4, "q1": "The team claims more than ten years of software and blockchain development experience. The idea has been clearly articulated and feasible. There will be a  requirement for a set of smart contracts for performing the role of intermediaries. The requirement of oracles authenticating status update and compliance to specification to work do need clarification. However, the team seems to have enough capability in overcoming the problem. References to past work would have added immense help for evaluating the proposal. decentralized environment. ", "q1r": 5, "q2": "The proposal includes detailed timelines and budget breakup. The work to be done is clear and can be measured in a quantitative manner. The end state is also clear. The project can be audited and successes can be easily measured.", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "This is one of the necessary ideas to help develop the Cardano ecosystem. It will protect the benefit of both developers and product owners to the successful product that both want to get. This idea will not just be for Cardano ecosystem only but also worldwide because of its crises that happens every day on traditional platforms. Hence, this idea will drive a lot of user to join and bring a big effect on Cardano ecosystem. Their goals also can promise about that impact. ", "q0r": 5, "q1": "The team has a very detailed roadmap that divides into 2 phases of implementing their plan, and all the detailed broken-down budget is reasonable for that plan. We can visualize their roadmap through \"Goals\" session in the proposal, and all are clear with the activities and numbers. \r\nHence, the budget they require is fitted with that timeline and be detailed in the field of activities. \r\nThe only thing I advise them is that they should give more info about the team members and some risks that they are aware to control. It will help Catalyst make a high assessment of their plan. ", "q1r": 4, "q2": "The team has enough roadmap detail and key metrics that help to audit this project easily. \r\nThey also have a well aware about the problem context and make a better solution by time to help improve Catalyst development. And that is very easy to understand what they gonna do. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The proposal to help create an environment that connects dapp developers with their customers is an encouraging idea. This helps to accelerate the application of dapps by customers, reduce the cost of advertising projects to customers, and this communication skill is not good for every project or has a professional team. .", "q0r": 4, "q1": "A good idea needs a detailed plan and strategy to make it work, which is what complements your proposal. Having a more detailed plan, a strategy to attract the free community as well as organizations in need should be done properly from the beginning. In addition, you need to have clearer KPIs for each stage that show the feasibility and persuasiveness of the project.", "q1r": 3, "q2": "I see a good profile of the team member, however it is recommended to add the member's public information through the profile: Github, Linkedin or related certificates. In addition, you should officially announce the youtube channel or website so that the community can comment, as well as check the project progress.", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "This is a good idea that could add value and positive impact to the Cardano ecosystem if it comes to life. It's good to have a platform that will connect customers and developers. The plan is described in detail and could have a global impact because that was the idea from the beginning, connecting clients and developers around the world. Again it can operate at the local level ass well, there is no concept.", "q0r": 3, "q1": "The plan is well made, described, but it is not clear when the whole idea will start with realization and when it will be finished in terms of Q1 2022 or Q2 2022 and so on. The plan is divided by months but in my opinion does not give 100% certainty that it will be executed. Although it was suggested in the comments to provide information about the team for some reason that did not happen which further raises my suspicions. It is not clear that the team really exists because they didn't provide any links of LinkedIn or Github page.", "q1r": 1, "q2": "Due to the poorly set roadmap with dates, my opinion it is very difficult to follow the progress of this idea. The amount of money required given that we have no real insight into the team behind this idea i think is exaggerated. If we consider that the budget for this Catayst F7 is $250,000. The suggestion in the comments was that the funds should be brake up and that funds should be reqested in the upcoming Catalysts, but for some reason the suggestion was not taken in consediration. KPIs are missing in this proposal!", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 17, "ne": 4, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The proposal has great idea about connecting the customers and developers. It helps developers having job and customer find what they need and save time. I would like to see more attractive ideas to attract more users in the first stage of the project. ", "q0r": 3, "q1": "In my opinion, the proposal mentions about ways to increase users, but not give a detailed marketing plan to attract freelance developers in the first stage. Therefore, some clear system or procedures should be considered to make this proposal effective and raise prestige. ", "q1r": 3, "q2": "The proposal gives a clear roadmap and goals. However, it should list out the number of developers and customers participating in the platform which makes it easier for auditing. Also, the proposal should give a more detailed background of the core team by putting Linkedin, Github or any related sources for gaining trust. ", "q2r": 3, "assessor": "z_assessor_678", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Proporcionar una plataforma para la ejecución de contratos automatizada, a prueba de manipulaciones y verificada (pagos, hitos, legal). Generar confianza entre las partes", "experience": "Más de 10 años de desarrollo de software, más de 5 años de empresario, pionero de Plutus y Atala, desarrollador de blockchain"}