{"id": 381842, "author": "dvarnas", "title": "Estati - Real Estate Investments", "url": "https://cardano.ideascale.com/a/dtd/381842-48088", "category": 26240, "amount": 11000, "description": "¿Cómo se pueden facilitar las transacciones inmobiliarias en la cadena de bloques mediante contratos inteligentes?", "funded": 1, "upvotes": 73905328, "downvotes": 8982352, "votes_result": 64922976, "votes_cast": 187, "f6_no_assessments": 6, "f6_rating": 3.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Si no me equivoco, ya he relevado una propuesta de estos autores en un fondo anterior, de ese mismo proyecto. Es estupendo ver cuando las cosas avanzan, y significa que el impacto aquí es una realidad. Como el proyecto viene desarrollándose desde el f4, significa que las sucesivas financiaciones fueron bien aprovechadas y por lo tanto renovadas, los autores enumeran una serie de impactos que ya se han logrado en rondas anteriores, aclarando bien lo que se ha hecho. El mercado inmobiliario es ciertamente uno de los más rentables, y también tradicional, lo que requiere mucha dedicación por parte de los autores para romper un poco esta tradición al incluir aquí las transacciones en criptomonedas. La plataforma que desarrollaron y siguen mejorando es sin duda de alto valor y genera impactos positivos para el ecosistema de Cardano. Digo esto porque mezclan las actividades del mercado inmobiliario, primero la compra y venta directa de inmuebles, y luego otro tipo de acciones más complejas (como las inversiones a través de préstamos, etc.) con las tecnologías de nuestro ecosistema. De esta manera, están abriendo nuevas posibilidades que van más allá de las prácticas más comunes en el mundo criptográfico, como la comercialización de NFT, juegos de azar / juegos en general, trayendo nuevos usuarios a Cardano, ya sea a través de la adopción de la moneda o mediante el desarrollo de contratos inteligentes, como es el caso de la propuesta específica.", "q0r": 5, "q1": "En cuanto a la capacidad de los autores para llevar a cabo el proyecto, creo que no hay mucho que discutir. Llevan mucho tiempo haciendo este proyecto, ya tienen varios hitos de éxito que demuestran lo preparados que están para llevar a cabo este tipo de actividades, y lo que me parece positivo de ellos es su conciencia de ir poco a poco, como comentan, su proyecto global es extenso y costoso, pero fueron pidiendo financiación poco a poco. De esta manera, dieron resultados y demostraron su valía en la práctica, despejando cualquier duda respecto a esta parte del proyecto. En cuanto a la división financiera, lamentablemente me pareció que esta parte dejaba un poco que desear. Dividen el importe total en porcentajes, y éstos se explican de forma superficial. Me gustaría entender, por ejemplo, ¿cuál sería la relación entre la parte que va al propio contrato inteligente y la parte que va a los salarios dentro del 90%? Y ¿cómo se produciría la campaña de marketing mencionada en el 10%? Es cierto que ya tienen el proyecto consolidado, pero creo que las mejoras también generan la necesidad de una fuerte difusión. En cuanto a los pasos a seguir, fueron bien explicados, esta parte fue adecuadamente detallada en mi opinión; sabemos lo que sucederá y en qué orden, y las pequeñas actividades que conformarán un todo. Por lo tanto, creo que en este tema de la propuesta sólo se podría mejorar la explicación de la financiación.", "q1r": 4, "q2": "La propuesta está muy bien cubierta en lo que respecta a la auditabilidad. Los autores nos dan mucha información con la que podemos controlar el desarrollo del proyecto. En las \"métricas\", podemos saber qué pasos pretenden dar en relación con la mejora del proyecto, de modo que podamos controlar si dichas acciones se han llevado a cabo efectivamente después de la financiación. También nos explican cómo funciona su plataforma en el día a día, es decir, se explica cómo entrar, navegar, incluso hacer una simulación de transacción para comprobar si todo está sucediendo correctamente. Además, los autores nos dan una visión general de cómo está el mercado inmobiliario en algunas localidades en las que pretenden operar. Esto me hizo pensar que quizás sería interesante que algún miembro de la comunidad, que tenga experiencia en el área inmobiliaria, pudiera actuar como mediador entre este proyecto/sus autores y la comunidad de Cardano, aportando feedback con cierta regularidad, que podría ser presentado en algún Ayuntamiento o simplemente puesto a disposición de la comunidad en general. Dicho esto, los autores nos proporcionan los medios para realizar la auditabilidad, es necesario que lo hagamos a través de un seguimiento constante.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 16, "ne": 11, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "Real estate investment is a high stake high risk endeavor with complicated local laws and procedures. There is a need for innovative abstrationis to overcome the local settings into a smooth business model This will encourage large flow of value across the glob. The proposal has the potential to provide this abstraction using crypto. Therefore Cardano exosystem is ideally suited for hosting this due to its superior security model. ", "q0r": 5, "q1": "The proposing team has experience and are already running an initiative which enables people to invest in property through bitcoin. The team has expertise from three different fields and is likey to complement the balance. The proposal is clear with realistic budget projections along with milestones. The proposal is likely to be implemented. ", "q1r": 5, "q2": "The legal requirements are quite complicated in property ownership across the countries. However, the initiative can be pathbreaking and might provide a better opportunity to unlock the crypto value in physical world. The proposal is requesting a very reasonable amount and have clear milestones. The progress is clearly auditable ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 18, "ne": 2, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "This is a proposal for an application that supports electronic identification and payment in the real estate sector. The team has real estate business experience but has not shown much blockchain-related technical experience before. This is an area that requires multilateral participation: local authorities, land owners, buyers, tax authorities... But the solution has not been detailed yet for the synchronous settlement of dealings with the participating parties. during implementation.", "q0r": 4, "q1": "This proposal is highly practical, implemented in countries that are accepting cryptocurrencies in real estate payments and paying full state taxes. Advantages in some countries such as: Dubai, Austria... But it has not been possible to deploy in countries that have not yet opened the application of electronic money in payment.", "q1r": 4, "q2": "The review and review of this project KPI requires a lot of information sources such as: real estate documents, information on how the agreement on the purchase and sale contract agreement on the application corresponds to the actual documents, how to Verification. Not to mention that user information and private information need to be confidential for customers, so it will not be easy to control the results of implementing this proposal.", "q2r": 3, "assessor": "z_assessor_648", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "How to connect Blockchain with the real world we can read in this idea that is in front of us. The proposal clearly addresses the problem and offers a solution. It is not clearly defined how this project will have an positive impact and how it will increase the value of the Cardano ecosystem. Of course we can conclude when the project is realized and purchases and sales take place through the smart contract of the Cardano system if that happens that will be very useful  for Cardano ecosystem. KPIs indicated in the proposal match the ones indicated in the challenge and proposal is able to scale and address future challenges.", "q0r": 3, "q1": "It would be good to know who is behind Estati real estate invesmennts. We do not have any links via LinkedIn or Github to confirm that the team has the experience, knowledge and skills to complete this project. I guess the team from Estati has experience in selling real estate but not in the blockchain. That is why they put a link in the proposal from a company that deals with blockchain, and their team is professional and transparent. In this proposal, an external associate is taken who will be paid if funds are received. The proposal states a clear reasonable budget from which 90% of the funds will be allocated to external collaborators. But it would be much better to specify in more detail exactly what the funds will be allocated for. There is a clear plan and details of actionable tasks and order of execution. Proposal offer a timetable through which the work would be completed but it would be good if it was a little better worked out. There are details of actionable tasks and order of execution and proposal explains technical aspects. There is no mention of risks in this proposal, nor is there any awareness of the risks.", "q1r": 2, "q2": "The roadmap with milestones and a time horizon for achievement is not clearly presented in this proposal. KPIs have not been properly clarified so KPIs are not relevant in quantify the success of the project. We can believe that the partner firm will make the necessary smart contract but in no way can the community track the progress of the proposal.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 16, "ne": 4, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "This project has the great idea about facilitating real estate transaction using smart contracts on Cardano blockchain. The proposer shows some evidence about project's progress and activities for the early stage. If the initial foundation is complete, this project could bring positive effect on the real estate field and adoption of Cardano in real life. ", "q0r": 4, "q1": "The proposal has two qualified members with many years of experience in real estate and tech and developer team. The proposer gives clear evidence about what they are doing and the progress of the project and a very detailed roadmap, KPI which makes me believe in the success of the project. ", "q1r": 4, "q2": "We could audit the process of the proposal following their given information. I suggest the proposer should add their timeline to their roadmap to make it easier for auditing. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "Real Estate management is a use case Cardano is well positioned to tackle with dapps that combine investing in the asset class with identity and proper legal forms based on jurisdiction. The team has a solid plan/vision and has begun to execute towards building this exact solution on Cardano.", "q0r": 4, "q1": "The plan presented is compelling, the team has established partners, is taking a cross-jurisdictional approach and has already begun building. ", "q1r": 4, "q2": "The team provides a fair amount of information to audit the proposal in there MVP build and metrics section, these could both be expanded upon. ", "q2r": 3, "assessor": "z_assessor_870", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}], "solution": "Interfaz todo en uno para facilitar las transacciones inmobiliarias (compra y venta) utilizando contratos inteligentes en Cardano Blockchain", "experience": "Donatas Varnas - Empresario, Inmobiliaria, +6 años\nCTO - ex-2 startup CTO, +9 años\nClearContracts.io - Socio de desarrollo de contratos"}