{"id": 382035, "author": "jcaso", "title": "C64 Extension Wallet", "url": "https://cardano.ideascale.com/a/dtd/382035-48088", "category": 26240, "amount": 19660, "description": "Extensión de la cartera que proporciona una experiencia soberana y personalizada a los usuarios y a los desarrolladores al admitir P2P, NFT, Identidad y Votación como complementos.", "funded": 1, "upvotes": 77413110, "downvotes": 12201552, "votes_result": 65211558, "votes_cast": 387, "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "He sido asesor comunitario desde el Fondo 2 y vCA desde que recuerdo (vale, no realmente, desde el Fondo 3 para ser exactos). También he actuado como proponente en algunos fondos de ajuste de desafíos (soy lo suficientemente viejo como para recordar cuando se llamaban Community Choice - sí, el nombre apestaba). Pero, me estoy dejando llevar. Esta propuesta es práctica para el usuario final. Pretende desarrollar un monedero comunitario ligero para todos los navegadores con un formato emergente que permita cambiar de red (Testnet - Mainnet - ¡Si!!) y unificarlas todas dentro de la misma herramienta desde la misma cuenta. Lo que lo hace aún mejor es que los usuarios podrán elegir sus propios puntos finales de confianza. El monedero ligero entre navegadores podría tener un gran impacto si tiene éxito - especialmente porque los usuarios de Cardano están cada vez más frustrados con el uso de un monedero de nodo completo (¡sí, te estamos mirando a ti Daedalus!). La idea de utilizar un monedero de extensión modular progresiva que facilite la adición de nuevos casos de uso en forma de plugins (¿alguien dijo P2P, NFT, Identidad, votación, etc.?) es genial y muy impactante. Si eres un votante y no has comprobado https://c64.app/ (el sitio del monedero C64) hazlo. Ni siquiera sabía que existía. Esto es descentralización. Más carteras, más enfoques, más resistencia. Todas las partes interesadas se benefician.", "q0r": 5, "q1": "El proyecto cuenta con un equipo muy competente. Incluye un ex líder de DevOps de Emurgo. El cofundador de Gimbalabs, un desarrollador full-stack, embajador de Cardano, SPO, y un ex-Emurgo Yoroi-mobile, asesor de I+D... El equipo se compone de tres miembros que claramente tienen el conocimiento técnico para entregar el resultado. A menudo me preocupan algunas propuestas - que pueden morir una muerte lenta (o rápida) después de la entrega, pero lo que es realmente alentador sobre la viabilidad y el crecimiento duradero de este proyecto es que el equipo ya ha dado cuerpo a las características futuras que tienen la intención de construir y añadir con la futura financiación de Catalyst (en futuras rondas). El monedero C64 parece ser una idea con un gran potencial de crecimiento, como reconoce el equipo proponente. Han incluido un calendario realista desglosado en tres etapas clave para su realización, mientras que el presupuesto se ha concretado en componentes, lo que permite un examen más detallado del trabajo. Los proponentes han incluido y explicado los componentes técnicos clave en los que se basarán, y me encanta que se trate de navegadores Chrome, Brave, Edge y Firefox (provisional). La idea de incluir demos en la propuesta ha sido excelente, y gracias por incluir los perfiles de Linkedin.\r\n\r\n\r\n", "q1r": 5, "q2": "El equipo proponente tiene una visión clara de lo que quiere conseguir y un camino claro para lograrlo. Incluyeron una planificación electrónica clara y comprensible de lo que quieren conseguir y su propuesta de solución es racional y tiene mucho sentido. El equipo incluyó un cronograma de 6 meses con 14 KPIs que quieren utilizar para la auditoría y el desarrollo. El desarrollo se ha dividido en tres grandes fases y, con el desglose detallado del presupuesto, será fácil de auditar. Este es un ejemplo de propuesta clara y bien presentada.", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "El proponente quiere construir un monedero de extensión y su funcionalidad ser ampliada con plugins. Así que dependiendo de lo que necesites, puedes ampliar tu monedero. Es una propuesta muy interesante e intuitiva que cumple con el reto planteado. También me gusta que el proponente se haya esforzado en rebajar el coste de esta propuesta mediante la combinación de esfuerzos entre la propuesta del fondo 5 y la actual. Hay un valor implícito aportado al ecosistema si esta propuesta se financia y se implementa, pero a juzgar por el historial de este proponente, no me preocupa. Se informará de los KPI cada dos semanas, como se ha hecho hasta ahora. El impacto siempre está relacionado con la ampliación de una solución, y en este caso no me preocupa que el equipo sea capaz de afrontar los retos descritos. Hay muchos esfuerzos puestos en la solución de este proyecto y se nota ya que no hay ningún hueco en la propuesta. Este proyecto beneficiaría significativamente a la comunidad y al ecosistema si se implementa como se describe, pero creo que será aún más beneficioso si es una colaboración entre algunos proyectos con las mismas ideas. Como dev no tengo ninguna preocupación sobre la implementación de la propuesta.", "q0r": 5, "q1": "El proponente ha añadido los perfiles de linkedin de los miembros del equipo, lo que dice dos cosas. 1. Los proponentes están dispuestos a respaldar su proyecto con sus nombres. 2. Esto permite verificar las habilidades declaradas que figuran en la propuesta. 3. (prima) aporta credibilidad al proyecto. 4. El número y el tipo de miembros del equipo han sido obviamente discutidos y están presentes en la propuesta. El presupuesto se maneja muy bien, hay una opción presentada por los proponentes, para utilizar los fondos de la financiación anterior de una manera más óptima iis propuesta se financia también, y estoy sorprendido por la claridad de las tareas del proyecto se agrupan si eso sucede. Hay un calendario realista para hacer todo el trabajo necesario declarado. El proyecto define cómo se ejecutará y qué aplicación se utilizará.  Hay una amplia descripción de los elementos futuros que deben ser apoyados y que tienen sentido como (soporte de trezor, estacas y otros). Hay algunos desafíos y riesgos considerados en la propuesta. Otra cosa que me gustó mucho es la lista de demos, pero tocaré eso en la sección de auditabilidad. No estoy seguro de si el proyecto está en sintonía con otras propuestas similares que quieren construir plugins separados por el standad presentado y ser capaz de implementar con cada uno en un nivel modular, y mi sugerencia como desarrollador sería echar un vistazo a las propuestas similares y ver si no pueden colaborar en algunas características y plugins. En general una gran propuesta con mucho potencial.\r\n", "q1r": 5, "q2": "No me preocupa la trazabilidad del proyecto, ya que el proponente se ha comprometido a dar actualizaciones de 2 semanas sobre el progreso de la solución. Lo que yo recomendaría es tener un canal de discordia o telegrama para obtener retroalimentación directamente de la comunidad si es necesario, pero eso no es de ninguna manera obligatorio. Me gusta mucho la larga lista de KPIs mencionada en el texto de la propuesta. Aportan validez al esfuerzo realizado porque son muy relevantes para el éxito del proyecto. La hoja de ruta y los hitos también están presentes y serán visibles para la comunidad que quiera seguirlos. Veo una clara definición de un problema y una comprensión realmente técnica y profunda de la solución propuesta.   Deseo buena suerte en la fase de votación al autor. ¡Es una buena propuesta!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "There is a need for lite wallets to provide more options to end users and developers for experimentation. The proposal will also provide Cardano Backend tools for the community to use and will decrease the dependency on a single entity for providing backend for lite wallets. ", "q0r": 4, "q1": "The team C64 which is proposing this project was funded for a desktop wallet which can mint NFTs. The same team is proposing to create a cross browser wallet in Typescript which is considered better for security than the javascript. The team also proposes hosting of Cardano Backend suites for the lite wallets. Based on the experience and the demonstrated capability it is likely that the team will be able to complete the project successfully. ", "q1r": 5, "q2": "The proposal is detailed with clear risk analysis. The dcSparks connector has been released and is successful therefore the proposal should not be facing any technical blocks. The proposal has a clear roadmap and it is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This is one of the Cardano wallets that was funded in fund 5 and they still keep developing that proposal. This proposal is an additional part that I think they need to do for more convenience to end-users, increase the user experience is what can increase the results of their KPIs that include both in the old one and this proposal. Therefore, this small project will help the whole bigger project better impact on Cardano ecosystem ", "q0r": 5, "q1": "As I mention, this proposal is an expanding fund for developing their browser extensions, which means that they're running this project and have some results on it. We can check the product through the main website of the project. \r\nAnd the team filled this proposal with the whole project implementation plan that all is clear. Therefore, I absolutely believe that they're doing well and will make this proposal good as they did with the other parts of the project. ", "q1r": 5, "q2": "Info in the proposal is completely enough to help auditing works in this scope of the proposal. They pointed the specific outline in the general roadmap that relates to this proposal clearly and all make sense. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 20, "ne": 1, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "It's great idea to build an extension wallet by adopting the Connector standard from dcSpark for interaction with dapps and Defi services which increases users and devs' experience and the Cardano applicability. Also, this dapps helps Cardano to communicate with other blockchains. The proposer shows a clear roadmap and solutions to build the wallet. This project will definitely help the growth of Cardano community. ", "q0r": 4, "q1": "The proposal has qualified team with experience in developing Cardano, Ermugo and Ardana project which make me believe in the success of implementing this project. The team has a deep understanding of Cardano and their project. They give a clear road map and detailed KPI. Also, I find the requested fund is suitable for their proposal at this stage. ", "q1r": 4, "q2": "It's easy to audit this project as every information related to the implementation of the proposal is clearly stated. They give a detailed timeline for the roadmap,KPI which can be checked on their website and github source. The proposal also gives evidence behind the team backgroud as they are well-known in Cardano community which make this proposal gain more trust. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Diseñar e implementar una cartera de extensión modular progresiva que facilite la adición de nuevos casos de uso en forma de plugins.", "experience": "El equipo tiene una amplia experiencia profesional como desarrollador full stack, procesamiento en tiempo real, aplicaciones móviles, sys admin, devOps, y SPOs."}