{"id": 382311, "author": "lpanchot", "title": "No code, audited Smart Contracts", "url": "https://cardano.ideascale.com/a/dtd/382311-48088", "category": 26240, "amount": 20000, "description": "Las dapps no tienen una forma fácil de crear, gestionar y ejecutar contratos inteligentes. Desarrollar contratos es difícil y las auditorías son caras.", "funded": 2, "upvotes": 126635128, "downvotes": 9785911, "votes_result": 116849217, "votes_cast": 665, "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"q0": "Los proponentes quieren permitir el uso de los contratos inteligentes de forma no codificada. Es decir, que la gente tenga una UX que no implique ningún código por su parte. El problema identifica una oportunidad para introducir a la gente normal en los contratos inteligentes sin siquiera saberlo. Esto tendrá un gran impacto en la adopción del ecosistema cardano si se extiende. Este impacto aportará valor al ecosistema cardano, a través de las personas que corran la voz. Las métricas clave son sensibles para el proyecto y proporcionarán un buen seguimiento para optimizar el proceso y el proyecto en el futuro. Como desarrollador, viendo las personas involucradas y las credenciales y habilidades descritas, no veo ningún problema para que este proyecto se amplíe. Lo único que me gustaría ver más es la forma de interactuar con la comunidad. Es justo decir que uno de los autores ha dejado un enlace de @telegram para que la gente pueda ponerse en contacto con él, pero un canal de discordia puede hacer crecer una comunidad real e involucrada. Esta propuesta aportará una pieza que falta en el ecosistema actual, al acercar a la gente normal a la comunidad de cardano.  Me gusta mucho la propuesta, buena suerte y estaré siguiendo su progreso.", "q0r": 5, "q1": "Siempre me gusta que los proponentes dejen enlaces con sus perfiles de linked in, porque esto aporta algo de tranquilidad y, además, da credibilidad a todo el proyecto. En mi experiencia, a los votantes les gusta mucho que los proponentes se sientan orgullosos con sus nombres detrás de un proyecto. Un equipo de miembros con habilidades específicas ya está listo y trabajando para implementar la propuesta y, según mi opinión, están en el plazo previsto. El presupuesto es lo suficientemente sencillo y se describe de forma clara y comprensible. En los recursos los proponentes han explicado con imágenes (el mejor medio) la forma en que el algoritmo funciona y es bastante sencillo y simple para trabajar sin problemas. Como desarrollador, teniendo en cuenta el trabajo que queda por hacer, confío en que el equipo sea capaz de terminar dentro del calendario que se han fijado. El plan es sensato y tiene respuestas a la pregunta no sólo de qué estamos construyendo sino también de cómo. Los recursos enlazados en la propuesta ayudan a entender los posibles detalles de la implementación, o al menos algunos de ellos. Me gusta que uno de los desarrolladores sea un desarrollador de haskel, ya que es el ciudadano de primera línea en el ecosistema de desarrollo de cardano. Los aspectos técnicos podrían haber sido un poco más concretos, pero hablo por curiosidad. Los proponentes han puesto una buena hoja de ruta ya que sus KPIs son muy ambiciosos. El proyecto está en sintonía con lo que ya se ha hecho, y su proyecto será un bloque que otros desarrolladores podrán pisar para construir sus propias aplicaciones.", "q1r": 5, "q2": "La única pequeña preocupación que tengo es la trazabilidad del proyecto. Ya que tienen un sitio para ello, espero que pongan una sección en la que los autores puedan poner algunas publicaciones en el blog o algún tipo de informes de progreso sobre el proyecto y cómo está avanzando. Las métricas y los KPIs parecen relevantes. Me gusta el hecho de que estén implícitamente conectados a la definición de éxito del proyecto. La hoja de ruta y los hitos a lo largo del camino son lo suficientemente concretos como para que los elementos puedan implementarse de forma secuencial y se mantenga el tiempo establecido para el proyecto. Hay una descripción clara y comprensible del problema que hay que abordar, así como una solución sencilla pero bien planteada.  Mi pequeña sugerencia sería que los autores de la propuesta vieran a través de los ojos de su futura comunidad y pensaran en una forma como un canal de discordia, donde esta comunidad pueda crecer y ayudarles a betar su trabajo. En general me gusta la propuesta y votaré por ella. ¡Buena suerte en esta y en las siguientes propuestas!", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "n order to bring the threshold required to use smart contracts down these kinds of no-code systems are mandatory and they have to be made prolific to improve adoption.  The proposal aims to build smart contract templates for the most common use cases. This will address the core challenges in the smart contract ecosystem. ", "q0r": 5, "q1": "The team consists of more than five people with balanced composition and they have produced a prototype with an open codebase. The experience and qualification is sufficient to carry out the building of smart contracts and the web interface. The work so far is professional. Therefore the team will be able to complete the proposal.\r\n", "q1r": 5, "q2": "The aim of the proposal is to build a system that can be used by people from nonprogramming backgrounds to use deploy smart contracts. This is a must feature and Marlow is aiming to achieve this. Therefore the aim and the outline are clear and the proposal implementation details are sufficient to trace the progress of the proposal. Therefore the proposal can be monitored and success can be measured. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "As information about the capabilities and value of smart contracts disseminates through society, easily deploying smart contracts without the need to write code has the potential to onboard a lot of new users to blockchain in general and Cardano in particular. The more reliable and easy to use \"no-code\" solutions the Cardano ecosystem can provide the better. This is why I believe the impact of the project proposed can be quite significant and matches the goals of this challenge perfectly.", "q0r": 5, "q1": "The team provides full details about themselves with links to their LinkedIn profiles from their website. They seem to be a mix of passionate young developers. Given that they have already started working on the project they are requesting funding for, there is a high likelihood that the project will be successfully implemented. Also, because of this, the outlined timeframe seems realistic and doable. The budget is on the small side, but given that it looks like they have self-funded the project up to this point it is likely that they are going to continue to do so.", "q1r": 5, "q2": "I would have liked to see more attention given to the KPIs, but other than that all the elements are there to make for an easily auditable proposal if funded. The timeframes and metrics are described clearly and would be easy to follow.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "Hemos creado una solución sin código que permite a los usuarios crear, gestionar y ejecutar contratos inteligentes.", "experience": "Llevamos 8 meses construyendo este producto y actualmente lo estamos integrando con PAB. https://clearcontracts.io/team"}