{"id": 382928, "author": "antonioandara", "title": "open source automation for cardano", "url": "https://cardano.ideascale.com/a/dtd/382928-48088", "category": 26240, "amount": 2500, "description": "no hay marcos de código abierto que permitan desplegar y actualizar proyectos de automatización del mundo real en la Red Cardano", "funded": 1, "upvotes": 29018807, "downvotes": 17095067, "votes_result": 11923740, "votes_cast": 174, "f6_no_assessments": 4, "f6_rating": 3.75, "videos": [], "media": [], "f6_assessments": [{"q0": "For me it is not quite clear out of the proposal which problem it tries to solve. It could be also better described what exactly the idea is maybe through an elevator pitch or something like that. It could also be described how the proposal tries to scale in the future.", "q0r": 2, "q1": "It is really valuable if a proposar provides his linkedin after someone proposed that in the comments. The proposer has 10+ years experience as a programmer which makes him suitable to implement the proposal. Unfortunately a budget and a roadmap is missing. While the proposal explains the goals it fails to explain how exactly it will be done", "q1r": 2, "q2": "There are several parts of informaition missing like key succes metrics, a roadmap or an evaluation of risk-factors. In conclusion, the progress and the possible success of this proposal is hard to assess. ", "q2r": 1, "assessor": "z_assessor_41", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The package will reduce the effort to create software that interacts with Cardano and IoT devices. This may act as a catalyst for many innovative use cases for Cardano. Moreover, the supply chain projects in Cardano will require this software. This project will address an important challenge in the ecosystem. ", "q0r": 5, "q1": "The proposer's profile reveals his enthusiasm for electronics and he has more than 13 years of experience in this field. The proposer is requesting 2500USD to create an open-source package that will enable interaction between Cardano and home appliances which has the potential to unlock much innovative use of Blockchain for IoT devices. With this sound experience and the clarity in the proposal, the proposed will be able to compete the project. ", "q1r": 5, "q2": "The proposal includes the features of the software intended to be developed and the proposer's LinkedIn profile. The fund requested is 2500USD and is very reasonable. The software will be open-source and its usage can be measured accurately. Therefore the proposal is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 17, "ne": 3, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "This proposal tries to address the main objectives of the challenge, by proposing a building an open-source automation framework for that can easily deploy and update real world automation projects on Cardano to solve open-source frameworks that allow to deploy and update real world automation projects on the Cardano Network. The team provide more explanation in the github that is helpful but would be better to move it to the proposal too. My suggestion for the team is to complete the proposal with more explanation about the problem statement and solution.", "q0r": 4, "q1": "Given the experience presented, it is highly likely that the proposal will be implemented successfully because deliverables, timeframe, and goals of this project are very achievable. But this proposal lacks milestones and detailed roadmap for three, six, and twelve months which could easily being improved by the team. I am quite confident that this project could be delivered successfully. My only concern is with only one person overseeing the whole project, there is a high risk of failure in case He is unavailable for executing the project (e.g. he got sick). Should this proposal is funded, I suggest him to have a team member as a backup for himself.", "q1r": 3, "q2": "The proposal only has generalized execution plan that in my opinion is insufficient. But Problem statement and solution delivered match and address both the challenge effectively. Success criteria are relevant and feasible, making it not only auditable but also realistic. I would like to suggest the team to provide monthly report on the progress as well as budget spending in their website or cardano forum so it can be more accessible and transparent. ", "q2r": 4, "assessor": "z_assessor_643", "no_vca": 14, "ne": 3, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to deploy open source automation and fits within the challenge of dApp & integration very well. More project detail on github shows the action plans and the impact should the project become successful.", "q0r": 5, "q1": "The proposer has 10 years of engineer experience. The github shows how he plans to modify the open source automation tools for raspberry pi and adapt them to Cardano. The 100 hours required for prohect implementation and rate per hour look reasonable.", "q1r": 4, "q2": "The information provided in github gives voter more confidence that this project is feasible in term of budget and timeline. Some projects I come across only does partially of what this proposal offers and requires 10 times the budget. The success of project implementation will be the reason for community to determine whether the person and this project should require more funding in future. ", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "construir un marco de automatización de código abierto para que pueda desplegar y actualizar fácilmente proyectos de automatización del mundo real en Cardano", "experience": "Ingeniero electrónico y programador con más de 10 años de experiencia.\nhttps://www.linkedin.com/in/antonio-alejandro-andara-lara-ab5453a4/"}