{"id": 383814, "author": "game.changer.wallet", "title": "Project Catapult: None left behind", "url": "https://cardano.ideascale.com/a/dtd/383814-48088", "category": 26240, "amount": 11250, "description": "La mayor parte de los épicos esfuerzos comunitarios realizados por AC, AVC, votantes, organizadores y proponentes en cada Fondo se utilizan una vez. Muchos proyectos se estancan", "funded": 1, "upvotes": 70615355, "downvotes": 5730642, "votes_result": 64884713, "votes_cast": 250, "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "The succinct explanation of the idea is to have a place where the community would be able to fund excellant assessed application that weren't voted in. Basically excellent ideas that didn't make it. This would have an enormous impact over the cardano ecosystem, because more ideas will be realized and funded. Current problem is that whales have power over the voting phase and even if a 1000 community members want a project to be funded 1 whale can deny them. The solution comes from these here proposals with their rightly named Project Catapult which is in the testnet. The proposal has aligned with the challenge settings requirements.  I really resonate with the mentioned KPIs and metrics stated in the proposal, because they directly corespond with the success of the project. As a developer, I don't see a problem for this project to scale with the future demand and future growth is counted on in the proposal already. I don't see any major item missing from this proposal. Right now the communtiy desperately needs a platform of the sort to be able to autonomously fund community favourites and refer them as well.  If implemented this proposal will help a hundred other proposals be funded as well, so it's a no brain-er! ", "q0r": 5, "q1": "The proposers have added their linkedin accounts which is more than enough for me to bring credability to the whole project. I've read acouple of other proposals they have as well and they're all worth supporting, but I'd have to say this one will be the most impactfull of them all. They already have the team set up and ready to deliver as they already have in previous funds. The budget is very specific as all budgets should be, and I couldn't ask for a better funding breakdown of costs. The timtable the authors have presented is realistic to complete the project. There's a slow and steady approach that is a sensible way of doing a platform and I love they follow the same approach as IOHK in doing everything by verifying the metrics on the testnet before moving on. The plan describes the resources necessary to implement the proposal as well and furthermore costing close to nothing. The technical aspects are clear enough in describing the problem and the solution to it. There are several mentioned challenges that the team may encounter, but also has a plan for action in case of any challenge. The project is in sync with the game changer wallet that will be the primary application to work with for funding a project. I love the simple UI design that lets you search by funds for ideas you liked which weren't funded. ", "q1r": 5, "q2": "Project catalyst has a progress check mechanism in place so I don't think the auditability is an issue. Tracability is another thing I wanted to mention. These guys have a site using a decentralized solution already up and running and are active discord and telegram users, so anyone interested in the proposal is sure to be informed and involved if need be. The KPIs are on point to bring the project to its fruition. The given roadmap and milestones are sensible for the time the proposers have given themselves for implementation. A clear and understandable description is given in the proposal for a problem that is anything but simple. Nevertheless the proposers have presented a solution that would make voters happy and enabled to support their favourate ideas.  The proposers clearly see through the eyes of the voters and give them an alternative way to \"vote again\" for their solutions being sure that their vote will count this time around. Overall a great proposal, I wish you all the best. I'll be voting for you!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 7, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This idea will help a lot of un-funded projects in Catalyst with the second change of funding by other mechanisms. There are a lot of projects in the Catalyst voting that is not funded because out of budget and there is a lot of interesting project with well-preparation that people love but weren't approved. So what if those projects will be funded and run on the second change? The Cardano ecosystem will develop faster than before. Therefore, this idea will make an extraordinary impact on the Cardano ecosystem. ", "q0r": 5, "q1": "The team has attached to show their demo, and some of their attached links can help us visualize what they want to do easily. Moreover, they have already coverage since fund 4 that helps them make a great implementation plan with detailed vital features, technical info... \r\nHence, they have a detailed roadmap and KPIs in 3 months, 6 months that can help to assess that the budget is reasonable for them. \r\nI can't think out about any difficulties for this project because they even have a demo for it, but they should be because it will help them avoid a lot of disruption to the deployment public. ", "q1r": 5, "q2": "The info that the team provides is completely easy to audit this project. \r\nThey also take months to dive into the Catalyst problem so they acknowledge the problem context very well, and that makes their solution address exactly what problems deliver. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "As the goal of this challenge is to create Dapps for 2022 to run on Cardano, this proposal is within the challenge settings. The proposal adds value for the proposers that do not have the opportunity to receive funding from the Catalyst. However, I don't see how the dApp could attract new users into the Cardano ecosystem. It would be great if the application could have a feature whereby new users could use the platform as to educate themselves on how to take part into the Catalyst).", "q0r": 3, "q1": "This team has been participating in the Cardano community for a long time and have also mentioned that they have a successful project developed called GameChanger. I believe they have the skills to further accomplished what needs to be done with the clear roadmap stated. KPI(s) and risks are mildly defined on the proposal which would definitely give confidence that the proposer knows what needs to be addressed for users. Though the implementation plan is comprehensible but leaves important questions unanswered : How do you increase new wallet holders into the Caradno ecosystem? This remains uncleared as from my understanding it only adds value to existing community in Cardano.", "q1r": 4, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon. There are also several metrics that measure the success of this project. I recommend adding further metrics like \"growth of distinct addresses mentioned in application transactions\" so that more areas of this project are auditable.", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 17, "ne": 4, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal outlines a website where the community can support Catalyst proposals with donations and staking with a particular focus on supporting those proposals who miss out on funding. The speed of the Catalyst process has been an issue for getting some projects off the ground and has created the need for the rapid funding mechanisms that been covered in the community. If executed well this service could become an effective launch pad for directing small of amounts of funding to projects that need it and that the community want to support.", "q0r": 4, "q1": "The team has three people listed with all of their LinkedIn profiles added. The team has a background in making the GameChanger wallet as well as being core members in Gimbalabs. It is clear that the team has the technical expertise to execute this proposal. A development budget break down is provided that is sufficient for the small budget. Much of the infrastructure such as the wallet and their initial version show this project is already feasible and this proposal will help with allocating more time to polishing and getting feedback to direct the implementation.", "q1r": 5, "q2": "A roadmap, feature set and KPIs have been provided. It is not mentioned in the proposal on whether all the code for this project would be open source for the community. There may be valuable lessons within the code that could benefit other developers so information on this area would have been nice to see. ", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Dejemos que la comunidad salve los proyectos curados y no financiados catapultándolos con donaciones y otros mecanismos. Mejoremos nuestra dApp", "experience": "GameChanger Finance ofrece un gran valor con su cartera y dapps de nueva generación, asociando a Gimbalabs, Dandelion y los colaboradores de Yoroi"}