{"id": 383849, "author": "sucy", "title": "Virtual Billboard", "url": "https://cardano.ideascale.com/a/dtd/383849-48088", "category": 26240, "amount": 60000, "description": "La gente está comprando terrenos y más en la blockchain. Los usuarios pueden anunciar estos activos y más dentro del Metaverso con vallas publicitarias virtuales.", "funded": 0, "upvotes": 14772493, "downvotes": 19810969, "votes_result": 5038476, "votes_cast": 166, "f6_no_assessments": 6, "f6_rating": 1.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta pretende crear una plataforma de venta de publicidad, en la que las empresas puedan anunciar bienes y servicios de forma virtual. No es ningún secreto que los proyectos metaversos han tenido un gran auge últimamente, y esta propuesta parece ir de la mano de ello. Me hubiera gustado ver una formulación más clara o detallada del planteamiento del problema y de la solución, y sobre todo cómo se relaciona con el crecimiento de Cardano. Asumo que la plataforma se construirá sobre Cardano o la utilizará de alguna manera, pero esto no está claro ya que el equipo pretende construir la plataforma sobre una plataforma ya existente. Para evaluar esta propuesta adecuadamente, me hubiera gustado ver una explicación más completa de 1: ¿qué es el proyecto y cómo se desarrollará? 2: ¿Cómo va a satisfacer las necesidades de los usuarios de Cardano? Y por último 3: ¿Qué aportará la propuesta al ecosistema? Si la gran cantidad de anuncios en diferentes plataformas atraerá a las empresas más grandes para que se anuncien en la plataforma, describa cómo el equipo pretende conseguirlo, y cómo aportará valor al conjunto. ¿En qué se centrará? La inmutabilidad de la tecnología blockchain podría, en efecto, revolucionar muchas industrias diferentes, pero para que yo (como consejero comunitario experimentado) pueda evaluar con justicia el impacto de la propuesta, ésta debería contener más detalles. Dado que la financiación solicitada es bastante sustancial, más del 20% del presupuesto total del reto, este tipo de información es importante. No hay nada malo en el concepto central, sólo me gustaría saber más. En general, no estoy de acuerdo con que esta propuesta aborde efectivamente el reto.", "q0r": 2, "q1": "Creo que esta propuesta se beneficiaría mucho de una breve presentación del equipo principal, junto con suficientes enlaces para verificar su competencia y experiencia. ¿Tal vez un enlace a proyectos anteriores, o perfiles de LinkedIn? Si el equipo tiene 12 años de experiencia en el desarrollo de campañas publicitarias de gama alta y en la gestión de Times Square, debería haber mucha información que compartir. Y toda esa información beneficiaría a la propuesta. Dicho esto, el equipo SÍ hace referencia a su proyecto GOTIGER (cuando se le pide información sobre el equipo en los comentarios), pero lamentablemente no hay mucha información relacionada con el equipo ni con este proyecto en particular.\r\n\r\nEsto va de la mano con la asignación de presupuesto, que me gustaría que fuera un poco más detallada. Por ejemplo, saber cuántos Product Managers o Desarrolladores forman parte del equipo, cómo se repartirá el presupuesto entre los individuos junto con cuántas horas de trabajo se estiman para cada puesto realmente aumentaría la viabilidad de la propuesta. Y, en consecuencia, la confianza en el equipo. Por último, para que la propuesta fuera más tangible me hubiera gustado que se explicara más detalladamente lo que pretende el proyecto. Para que sea entendida por los CA y el público en general, tendría que contener explicaciones que digan inmediatamente si la propuesta pretende tener sus Carteleras Virtuales en metaversos ya existentes, o si pretenden albergar sus propios espacios. Puede que me equivoque al cuestionar la tangibilidad de las explicaciones de la propuesta, y me gustaría que me corrigieran si es así. Debido a la falta de información proporcionada en la propuesta, no estoy de acuerdo en que esta propuesta se vaya a llevar a cabo con éxito.", "q1r": 2, "q2": "La propuesta incluye alguna información valiosa sobre las mediciones del éxito, y los KPI, aunque se beneficiaría de más detalles. Si se hubiera incluido una hoja de ruta con hitos y plazos estimados y se hubiera combinado con información sobre los KPI, creo que la calidad de la propuesta aumentaría considerablemente. Por ejemplo: Después de 3 meses de haber sido financiados, pretendemos haber integrado 5 ciudades virtuales en el sistema, después de 6 meses esperamos tener 25 campañas publicitarias activas (como mínimo) en cada ciudad virtual. Después de 12 meses recopilaremos información sobre la presencia de nuestro proyecto en los medios sociales, y mediremos los niveles de éxito según esta escala: [números]. De nuevo, estas explicaciones no son más que un galimatías. Lo que intento decir es que hay que aclarar el concepto y la presentación. Además, un canal en el que la comunidad o los inversores/usuarios de las plataformas puedan supervisar e interactuar con los proponentes aumentaría aún más el nivel de auditabilidad del proyecto en su conjunto. Desde mi experiencia como Community Advisor y trabajando con la tecnología Blockchain, la transparencia es una parte integral de la misma. Si esta propuesta reflejara ese tipo de transparencia hacia sus usuarios e inversores, la beneficiaría enormemente. Una breve descripción de los posibles riesgos y obstáculos del desarrollo también reforzaría la fe en la competencia del equipo, y la prueba de que el equipo tiene un profundo conocimiento y perspectiva de la industria y el proyecto. En general, no estoy de acuerdo en que esta propuesta me proporcione suficiente información para evaluar el progreso en la consecución de sus objetivos declarados.", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 20, "ne": 12, "ng": 6, "nfo": 2, "vca_o": 2}, {"q0": "Estoy de acuerdo en que esta propuesta aborda eficazmente el reto. Hasta cierto punto da una buena idea basada en el dominio de trabajo del proponente.\r\n\r\n\r\nSin embargo, lo que me falta es saber por qué Cardano? ¿Cuál es la visión de la empresa al pasar al espacio de la cadena de bloques y cómo encaja Cardano en este espacio y no cualquier otra cadena de bloques como Solana, Ethereum, etc.?\r\n\r\nTambién habría sido bueno si la propuesta mencionara por qué y cómo el ecosistema de Cardano crecerá o tendrá un impacto positivo si esta propuesta se implementa con éxito.\r\n\r\nCiertamente hay espacio para mejorar la solución presentada aquí, por lo que no estoy totalmente de acuerdo", "q0r": 4, "q1": "No estoy de acuerdo, una de las razones es que afirman que tienen 12 años de experiencia en desarrollo, pero ¿quiénes son estos desarrolladores? ¿Cuáles son sus credenciales? ¿Cuál es su participación en el espacio de desarrollo de la cadena de bloques? Estos detalles no se presentan, por lo tanto no puedo estar de acuerdo en que el equipo tiene buena experiencia para la aplicación de esta propuesta. Sería mucho mejor si la próxima vez el proponente proporciona buenos detalles sobre el equipo para que puedan obtener una mayor puntuación en el proceso de revisión.\r\n\r\nEl plan que se menciona es un plan detallado, y se ha hecho una propuesta genérica de cómo blockchain puede ayudar con su naturaleza inmutable. Pero esto no es suficiente, creo que el proponente debería dar más detalles, sobre qué problemas (con ejemplos del mundo real, ya que son una empresa que trabaja con casos de uso reales) existe y cómo su solución (con ejemplos) ayudará a este dominio.\r\n\r\nAdemás, el desglose del presupuesto no se hace correctamente. Cómo se llega a esta cifra de 60k$, es una cantidad bastante alta, pero no se da más información sobre cuántos desarrolladores trabajarán, cuál es el modelo de distribución del presupuesto, por ejemplo, front-end, back-end, contrato inteligente, pruebas, etc., tarifa mensual O tarifas por hora", "q1r": 2, "q2": "No estoy en absoluto de acuerdo con que esta información proporcionada sea suficiente para auditar el progreso y el éxito de esta propuesta.\r\n\r\nSe mencionan los KPI pero falta totalmente la hoja de ruta, y tampoco hay información disponible del equipo en la propia propuesta. Algún miembro de la Comunidad mencionó este punto en los comentarios y el proponente proporcionó un enlace, sin embargo, no puedo encontrar ninguna información sobre la experiencia técnica de los miembros del equipo, especialmente en el contexto de la programación de blockchain (plutus).\r\n\r\nSi la hoja de ruta en sí no se da con una distribución clara de los hitos, que pueden ser rastreados al menos quincenalmente si no semanalmente, entonces veo que esto no es una buena propuesta escrita.", "q2r": 1, "assessor": "z_assessor_454", "no_vca": 19, "ne": 10, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The problem statement chosen is a very vast area for making provision for the B to B platform where businesses can advertise their assests and and services being provided by them but the platform just focuses on developing a ad selling platform focusing mostly on the virtual assets than the actual scope of it in thecardano based blockchain ar any relevant necessity of using cardano features for the same.  ", "q0r": 2, "q1": "The proposal mentions about having experience of developing ad software and managing campaigns but doesn't provide details on relevant info on either developers with technical expertice for building platform. Also the proposal doesn't provide details on phase wise details of technical implementation and experince/plan to implement the proposal including these informations would have been great way to approach for the fund request.", "q1r": 2, "q2": "The proposal unfortunately doesn't hold the details to how the proposal will be realised wrt to phase wise details or milestones which would have been an important metric to measure the progress of the project. Also there is no details on fund breakdown wrt time of work apart from highleve team wise fund requirement, adding these details would have been plus point for funds to trustfully served to the proposer and audit the project progress", "q2r": 1, "assessor": "z_assessor_16", "no_vca": 22, "ne": 3, "ng": 19, "nfo": 0, "vca_o": 1}, {"q0": "Simple solution to answer the problem. Since metaverse is a hot thing nowadays and Facebook announced that they wants to expand its business into the world of the metaverse, this idea will booming if Metaverse boom starting. But, some things concerns me. While the Metaverse world are already booming in Ethereum platform and Cardano is still working on its ecosystem, how proposer will build the virtual billboard project? Maybe try to build on Ethereum then bridge the code to Cardano ecosystem? Or what will proposer do? I personally, think that this Virtual Billboard project will get great traction from the community IF Metaverse Cardano is up and running. Before that, the proposer should do further research on this project", "q0r": 3, "q1": "Team have 12 years of experiences in real life, this project seems a little ambitious. Although they said it was easier to build a virtual billboard in the metaverse, the proponents didn't say anything about the schedule or what they would be working on. This proposal did not mention anything how much time they will work on, what metaverse they already research and approach to take partnership with, or when they will finish the product. Budgets are only written in general without further explanation. The author replied to some comments asking for information about the team with the link THEGOTIGER.com, but the credentials and or experiences of the members are still nowhere to be found.", "q1r": 1, "q2": "KPIs are clearly written with a simple way. But without a  detail roadmap, this proposal becomes difficult to audit publicly. KPI wanted us to know that the team would be creating a virtual billboard in metaverse cities/lands. But the proposer did not mention what specific virtual cities/lands they would approach. At least the proposer should already have done a little research on what virtual cities/land would be interesting to build a virtual billboard, that would be great.", "q2r": 1, "assessor": "z_assessor_639", "no_vca": 19, "ne": 4, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "This is a revolutionary idea in which the proposer clearly explain the problem and offers a great solution. Definitely such projects have a positive impact on the Cardano ecosystem but it is not explained how this idea would have an impact on the Cardano ecosystem nor is Cardano mentioned at all. The KPIs cited by the proposer partially correspond to the ones indicated in the challenge and proposal is not able to scale and address future challenges.", "q0r": 2, "q1": "The link to the website that the team provided is not transparent. We do not know how many people would work on this project and we do not have a clear insight into whether there are skills, knowledge and experience needed to realize this idea. We do not have information on the website how this idea will be realized and adapted to Cardano and there is no indication that there is experience and skill required for such an operation. The budget is clearly presented but not realistic and is not broken down into identifiable items. The plan was not elaborated in the proposal and details of actionable tasks and order of execution were not presented. It would be great to present a time frame within on how to implement this idea with clear dates and to list the necessary resources and technical aspects of the implementation itself. Unfortunately the proposal does not mention possible risks.", "q1r": 1, "q2": "It would be great if this superb idea was followed by a roadmap with milestones and a time horizon for achievement and if the KPIs where worked out everything would be in place. Unfortunately, the community cannot follow the further development of this idea due to lack of information.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 19, "ne": 4, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposal assumes the metaverse is already in existence, something already running on Cardano, rather than something which will take years, to decades to build. \r\nThe impact of the project presented in the proposal would be non-existent, simply because what is being proposed can't be deployed at this point in time. This will surely still be the case in the timeframe presented in the proposal, of a few months.\r\nIt's this CA's assumption that the proposers are simply trying to play on the metaverse hype, without giving too much thought to the concept.\r\nI would recommend studying the topics of blockchain and metaverse more before potentially resubmitting the proposal. Digital advertising in the metaverse is sure to be an explosive topic once the metaverse is actually implemented.", "q0r": 1, "q1": "Besides the concept of \"billboards in the metaverse\", almost no details are given about how the project would actually work, making it almost impossible to assess if it can be successfully completed.\r\nI would suggest a stronger emphasis on the \"how\" of the project next time.\r\nA brief mention regarding the team behind the proposal is made, however, no actual identifying information is given, even though the \"Included identifying information about all proposers\" requirement was marked as successfully completed in the self-assessment checklist. Not knowing who is behind the project makes it very hard to assess if it would actually be completed. No mention is made about if and what roles would need to be recruited for.", "q1r": 2, "q2": "The KPIs are very vague and don't go in-depth, and no definitions of success are given making tracking the deliverables of the project a very hard task.\r\nThe breakdown of the budget is very shallow in its current form. I would suggest giving it more thought and elaborating more on each budget line before resubmitting the proposal.", "q2r": 2, "assessor": "z_assessor_681", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "Desarrollaremos una plataforma de venta programática de anuncios con una configuración a medida en la que los compradores puedan anunciar activos y servicios de forma virtual.", "experience": "Nuestro equipo tiene más de 12 años de experiencia en el desarrollo de software de publicidad DOOH interactiva de alta gama y en la gestión de campañas publicitarias en Times Square."}