{"id": 384018, "author": "coire1", "title": "Community Tools On Chain! - AIM", "url": "https://cardano.ideascale.com/a/dtd/384018-48088", "category": 26240, "amount": 9900, "description": "El proceso Catalyst se basa en gran medida en plataformas centralizadas para las etapas de evaluación y control de calidad.", "funded": 2, "upvotes": 117263925, "downvotes": 3531801, "votes_result": 113732124, "votes_cast": 685, "f6_no_assessments": 4, "f6_rating": 4.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "La propuesta se esforzará por hacer que el proceso de CA y vCA sea aún más descentralizado y se guarde y procese en la blockchain. Los nombres de los proponentes son bien conocidos en la comunidad de catalizadores del proyecto Cardano y se dan cuenta del potencial del desafío dentro de su propuesta. Esta propuesta añadirá valor a la comunidad asegurando que nadie pueda manipular o censurar el proceso construido por la comunidad de ninguna forma. Las métricas clave son relevantes para competir con otras propuestas en el marco del reto. La propuesta podrá escalar mejor si la resuelven después de la fase de investigación. No veo que falte nada en esta propuesta, pero mi sugerencia sería popularizar su propia propuesta, porque necesita ser votada. Si se implementa la propuesta hará que el proceso de revisión de Cardano sea a prueba de balas. Como desarrollador yo mismo no tengo ninguna preocupación sobre su propuesta. Hagámosla lo antes posible. Buena suerte con las propuestas, ¡espero que su solución sea votada!\r\n", "q0r": 5, "q1": "No me preocupan los miembros del equipo. Han proporcionado los enlaces necesarios y están con sus nombres detrás de esta propuesta y son miembros bien conocidos y respetados de la cmunidad con suficientes proyectos a sus espaldas. El número y el tipo de miembros del equipo para llevar este proyecto al éxito ya se conoce y se menciona en la propuesta. El presupuesto es claro y está lo suficientemente desglosado como para ser fácilmente comprensible y debería ser suficiente para la ejecución completa de la fase de propuestas. Hay un calendario realista establecido para todas las etapas de la propuesta. La mayoría de las propuestas no prestan demasiada atención a la investigación, primero el código, después, y me alegro de que no sea este el caso. Hay un plan sensato para la implementación que establece el plan de implementación y el \"¿cómo estamos construyendo esto?\" se describe tanto como el \"¿qué estamos construyendo y por qué?\", lo cual es genial. Todos los recursos necesarios para poner en práctica la propuesta se enumeran en ella.   El proyecto está en sintonía con lo que ya se ha hecho, porque lo han hecho las mismas personas, así que será una gran evolución de la misma idea que tuvieron originalmente.", "q1r": 5, "q2": "No hay problemas en cuanto a la trazabilidad o auditabilidad, ya que estas personas son miembros muy activos de la comunidad y no necesitan que se les recuerde que deben estar al tanto de lo que ocurre y de cómo avanza el proyecto. Las métricas y los KPIs mencionados son relevantes para el éxito de la propuesta. Hay una hoja de ruta, hitos relevantes y un horizonte temporal para realizar todo el trabajo descrito en la propuesta. La descripción y los problemas están claramente definidos, por lo que no se realizará ningún trabajo que no sea necesario.   Deseo buena suerte a todo el equipo, ¡buscaré su solución a la hora de votar!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This solution will help Catalyst to the next level that closes to absolute decentralization that can help to avoid being be tampered with and censored or controlled on centralized platforms that currently work in IdeaScale, Google drive...Therefore, this idea affects so much on the development of Catalyst project and Cardano ecosystem. \r\nThe KPIs that the team want to concentrate to absolutely align with the challenge ", "q0r": 5, "q1": "The plan shows that this team aims at solving the problem directly that can easily understand by their process example. \r\nThere is a roadmap in about 4 months to implement the protocol into current Community Tools as could be tested from the community during fund 9. \r\nThe team has shown their info and they're the ones that create the Community tool of Catalyst. So for this project, I think it absolutely is high feasibility. ", "q1r": 5, "q2": "They have a clear roadmap and timeline, the deliverable is also clear for the audit. \r\nThe context of the Catalyst problem is acknowledged by them clearly, and the solution is easy to understand what they will do by example process for CAs. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The AIM team wants to move a lot of the catalyst \"paperwork\" out of manually managed gdocs and onto the chain. This is the natural progression for the AIM tools and would be necessary for the proper scaling of Catalyst. This is a proposal for research and proof of concept. ", "q0r": 5, "q1": "The AIM team has already made some great tools that improve the CA and VCA experience. This proposal builds groundwork for the what is the logical progression progression of these tools, to eventually bypass ideascale and the manual processes that are difficult to scale. Since gamechanger wallet is involved, even more technical experience is brought to the table. The goals and timeline are clear and I think the team can achieve what is required.", "q1r": 5, "q2": "The deliverables (POC) are clearly defined, as well as the budget and calendar. The KPIs will be easy to measure. Auditing should be straightforward.", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is about undertaking research to define a protocol to submit assessments and reviews directly on-chain and build a POC integrating it with CA/vCA tools. This is a great and meaningful idea. The problem is clearly described, explained in detail, and fit this challenge. The solution is clearly defined showing the clear impact on the Cardano ecosystem in long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "This team consists of active members of the Catalyst, got a proposal funded in the prior fund [F4, F6], and their profile shows suitable skill and experiences for implementing this work. This is proof of feasibility from the team profile. The roadmap is clear with measurable KPIs. The budget is clear and logical. However, the risk is not defined. Therefore, based on the given information, I strongly agree with this proposal's feasibility, I would rate it with a score of 5", "q1r": 5, "q2": "This proposal provided a lot of meaningful information, with external links for verification. However, for better transparency, the profile's link of several team members, as well as risk (and mitigation), should be provided [ex: Victor Corcino and Phil]. After all, based on the given information, I agree with this proposal's auditability, I would rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 17, "ne": 3, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "Emprender la investigación para definir un protocolo para presentar evaluaciones y revisiones directamente en la cadena y construir un POC que lo integre con las herramientas de CA/vCA", "experience": "AIM + Gimbalabs + GameChanger = herramienta para votantes, herramienta CA/vCA, Dandelion, cartera GameChanger y más. Desarrolladores, diseñadores y expertos en datos."}