{"id": 384071, "author": "keith", "title": "Music NFT Launchpad", "url": "https://cardano.ideascale.com/a/dtd/384071-48088", "category": 26240, "amount": 20500, "description": "Los músicos no son capaces de diversificar y monetizar su música de forma efectiva a través de las plataformas actuales dirigidas por las empresas dominantes.", "funded": 1, "upvotes": 47129533, "downvotes": 9794957, "votes_result": 37334576, "votes_cast": 183, "f6_no_assessments": 6, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta aborda el problema de los músicos que no pueden monetizar su música utilizando las plataformas existentes en la industria musical. Como soy músico, lo sé muy bien. La solución al planteamiento del problema no contiene la solución real, pero afortunadamente ésta se encuentra tanto en el título del planteamiento del problema como en la hoja de ruta. El equipo pretende crear una forma de que los músicos conozcan las NFT de música y las publiquen como tales, junto con un lanzamiento en una plataforma de streaming. Teniendo en cuenta que la industria de la música es bastante compleja, me habría gustado que se explicara un poco más en detalle cómo funcionará su plataforma, pero llegaré a eso más adelante. Integrar la música y los artistas en el espacio de la NFT de forma eficiente se ha propuesto e intentado muchas veces antes (porque es muy necesario), pero todavía no se ha lanzado una plataforma realmente sólida. La idea central es muy relevante y grandiosa, y si tiene éxito y se desarrolla adecuadamente podría ser un gran negocio tanto para el Ecosistema Cardano como para la industria musical en su conjunto. Estoy de acuerdo en que esta propuesta aborda el reto, aunque vagamente en la forma en que pretende ejecutar dicho plan.", "q0r": 4, "q1": "El equipo tiene mucha experiencia en marketing, diseño, ingeniería y consultoría. El fundador principal es un operador de Stake Pool, lo que demuestra una profunda implicación y comprensión del ecosistema de Cardano. Una adición que reforzaría aún más la credibilidad del equipo es la inclusión de algunas otras fuentes que puedan verificar la experiencia y competencia del equipo. Hay un enlace proporcionado a una beta del producto (que es agradable), pero lo que estoy pidiendo es una presentación de los propios miembros del equipo. La propuesta pide menos del 10% del presupuesto total del reto, pero estaría bien ver una estimación de las horas de trabajo incluidas en la parte de la propuesta relativa a la asignación de fondos. Por ejemplo, ¿cuántas horas supone la asignación de 5.000 dólares en un desarrollador web, y durante qué periodo de tiempo? Es muy prometedor que la plataforma de lanzamiento (artistdrop.io) ya esté en funcionamiento, eso habla bien del futuro del proyecto. Si entiendo bien la propuesta, el equipo será el que acuñe las obras de arte originales de los artistas en NFTs, que probablemente serán tanto apreciadas como criticadas por los artistas. Un simple ejemplo de descripción del proceso de uso de la plataforma, tanto desde la perspectiva del artista como del comprador, aportaría mucha claridad a esta propuesta.  En definitiva, estoy de acuerdo en que hay muchas posibilidades de que esta propuesta se lleve a cabo con éxito.", "q1r": 4, "q2": "La propuesta incluye una hoja de ruta que abarca desde el cuarto trimestre de 2021 hasta el segundo trimestre de 2022. Para aumentar la transparencia de la propuesta, en mi opinión (como consejero comunitario experimentado) sería útil incluir algunos indicadores clave de rendimiento en la hoja de ruta. Por ejemplo, ¿a partir de cuándo comienza el \"embarque de 4 músicos al mes para una entrega de NFT cada semana\"? ¿Ya ha comenzado? También, explicar el proceso de eliminación del intermediario del servicio de acuñación y los posibles retos de hacerlo, ya que mucha gente no está familiarizada con los entresijos de la acuñación de NFT.\r\nLo que realmente aumentaría la credibilidad tanto del equipo como de la propuesta son algunas reflexiones sobre los posibles riesgos y desafíos relacionados con el desarrollo de este proyecto. Como músico en activo y con experiencia en ser contratado por sellos discográficos, me pregunto cómo tratará el equipo los derechos de la música si se publica en otras plataformas, pero se acuña en artistdrop.io al mismo tiempo. ¿Será en colaboración con las plataformas de streaming y los sellos discográficos, o sin su conocimiento? ¿O la propuesta se centrará en los artistas independientes? Hay muchos contratos y trampas en la industria musical, y creo que ahí está el mayor reto de crear una plataforma NFT sólida para los artistas. Tener una explicación de cómo el equipo pretende navegar a través de eso aumentaría la confianza y la credibilidad de la propuesta proporcionalmente. Debido a la escasa información proporcionada en esta propuesta, no estoy ni en desacuerdo ni de acuerdo en que esta propuesta me proporcione suficiente información para evaluar el progreso en la consecución de sus objetivos declarados.", "q2r": 3, "assessor": "z_assessor_349", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal defines a problem and introduces a solution to tackle it. It could have been made clearer what exactly makes this marketplace special in comparison to other marketplaces. ", "q0r": 4, "q1": "The proposal is already in the works which shows the commitment of the team. The team has a wide experience in tech and blockchain and the lead founder is already involved in the cardano community since several years. They could have added some more technical aspects to the proposal in my opinion, why I will rate this with a four.", "q1r": 4, "q2": "The proposal provides information about the team, the roadmap and how they will use the budget. In my opinion the roadmap could be more detailed. Also the key-succes metrics could be explained a bit more in detail. Overall the proposal provided more than enough information to asses it and get an idea of the product", "q2r": 4, "assessor": "z_assessor_41", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The problem in the proposal is within this challenge. Their success metrics also fit with the challenge direction. But the team should provide more info about how their event will impact the Cardano ecosystem. ", "q0r": 4, "q1": "The team doesn't have a clear implementation plan that helps to understand what they will do. This project is not simple and they need to think more about the plan to add to the proposal instead of only brief info for each field of activity. \r\nAfter that, they should make a more detailed roadmap. And some relevant risks, that the team doesn't mention here. \r\nAt last, the budget that the team required is suitable with the provided roadmap, but as I mentioned above, they should make a better plan, then a better roadmap to help CA assess it. ", "q1r": 3, "q2": "For the idea of this project, my advice to the team is that they should make a better roadmap. The current roadmap and key metrics are close enough to audit what they will do in the future. \r\nThey don't have any content to show about the well-acknowledgment about problem context and clarify how their solution can address it. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The music NFT launchpad proposal fits well with dApp & integrations by allowing the artist to launch their singles or albums using a NFT along with a release to their streaming platform. This will encourage more artists to use the platform and lead to increasing adoption on Cardano.", "q0r": 5, "q1": "Although the proposer team has no direct experience in music, their technical background (engineer, consultant, and designer) will help them to implement this proposal. It would be quite good for them to locate someone who could look into smart contract development as they will work closely with smart contract developer and it will be a smooth operation when the team can communicate which feature is necessary for the future launchpad.", "q1r": 4, "q2": "The funding allocation looks plausible but the community would appreciate more elaborate response for this part. To create the launchpad ready in 6months is quite an impressive task in itself. Anyhow the community can assess the fund flow as well as monitor the project progress anytime at ease with the mentioned KPIs. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "I see value in creating a platform where creators/musicians can sell their music NFT(s) in the Cardano ecosystem. This will in fact benefit the current users and attract new users, as the problem has been clearly  stated, that musicians in the traditional schemes of this business are being monetized by corporations and not having the true value of their own crafts. ", "q0r": 4, "q1": "The team members are clearly stated, and I have looked up to the website. I am not sure what the proposer means as live, as the current website have only few information about the proposal. Moreover, I have tried joining the discord server but was unable to as the invitation was expired. In addition to this, as a UI/UX designer that uses Figma, the prototype on the given link is only half way done. This gives a lack of confidence for both CA(s)  - to understand clearly the proposer's idea, and voters - to have confidence in which how the technical development of the idea. Though the roadmap has been defined, but vision of expansion, milestones to develop, and risks to be taken are not well delivered. ", "q1r": 2, "q2": "The required funding must be broken down in a detailed manner and take account of risks that will be addressed, as to have better auditability. What's lacking is the milestones and management on the KPI(s) given. For example, how do the proposer intend to increase musician revenue by 20% by Q2 2022. What steps should be taken to put importance and protect/avoid musicians from scammers in the platform? What are the UX features that enables users to adopt the platform easily? ", "q2r": 3, "assessor": "z_assessor_669", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Onboarding musicians to distribute their work through NFTs on Cardano, has the potential to greatly popularise the platform. However, after reading the proposal I'm not convinced that the team behind it is the right candidate for the job. On the other hand, this may be the result of a rushed proposal due to lack of time.\r\nThe idea has a lot of potential, and it would be great to see a CNFT \"record label\" be born, that's why I would hope that the team resubmits a more complete and thought out version of the proposal in the future.", "q0r": 2, "q1": "The description of the proposers' experience is very promising at first glance, but no credentials or links to previous works are given to allow the community to verify and better judge for themselves.\r\nGiven that their landing page is presented as a working platform I have my doubts about the standards of the team at the moment.\r\nI would advise filling in the gaps in the gaps in the proposal, elaborating on the promising concept and resubmitting it to a future fund.", "q1r": 3, "q2": "Not a lot of thought seems to have been given to the KPIs of the proposal, they are present, but are very shallow. I would suggest further elaborating on them in a future iteration of the proposal.\r\nThe proposers are keen to point out that their service is already live, however on inspection of their website I discovered that it is little more than a landing page with a brief FAQs section.\r\nThe budget is broken down, but the figures seem a bit generic, particularly the sum allocated to the smart contract developer. The roadmap is brief and introduces elements not detailed elsewhere in the proposal.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Los músicos podrán lanzar su single o álbum como NFT junto con el lanzamiento a las plataformas de streaming.", "experience": "Nuestro equipo cuenta actualmente con tres miembros con una amplia experiencia en tecnología, finanzas de blockchain y marketing."}