{"id": 384575, "author": "jeffghome2020", "title": "StoryTime - A Writers Marketplace", "url": "https://cardano.ideascale.com/a/dtd/384575-48088", "category": 26240, "amount": 41200, "description": "Los escritores son objeto de un trato injusto a causa de sus opiniones e historias. Su libertad y sus derechos están a menudo en peligro.", "funded": 0, "upvotes": 17281303, "downvotes": 16707663, "votes_result": 573640, "votes_cast": 155, "f6_no_assessments": 5, "f6_rating": 2.466666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "A mi entender, esta propuesta pretende crear un mercado para que los escritores compartan y vendan sus obras, donde los autores pueden elegir ser anónimos, pero manteniendo la transparencia y los beneficios de la tecnología blockchain. Trabajando en el sector cultural y estando involucrado en el espacio de las criptomonedas, diría que no ha habido un desarrollo adecuado con las dApps relacionadas con las artes y la cultura. Los artistas sufren el acaparamiento de la mayor parte de los beneficios por parte de las empresas, y siguen siendo controlados por la mano del medio en cuanto al contenido que deben crear. Esta propuesta sería un paso hacia el desarrollo de un lugar donde los autores puedan crear y gestionar sus obras de forma independiente, si se ejecuta correctamente. El planteamiento del problema es claro en su descripción, al igual que la solución al mismo. A primera vista, esta propuesta parece estar mucho más enfocada hacia los autores, pero después de pensarlo un poco, este proyecto también pretende conectar con los consumidores (por supuesto), lo que lo convierte en una historia totalmente diferente en términos de alcance y adopción. Podría ser un buen uso de la tesorería de Catalyst, con mucho potencial para escalar en el futuro si se ejecuta correctamente. En el mejor de los casos (según el proponente) esta sería una de las primeras bibliotecas descentralizadas, si todo va bien. Estoy de acuerdo en que esta propuesta aborda eficazmente el reto.", "q0r": 4, "q1": "El proponente/equipo tiene experiencia en tener propuestas financiadas en el Fondo4 y el Fondo6, lo que habla de la credibilidad y competencia del equipo. En este caso, sería beneficioso que la propuesta incluyera una serie de enlaces para verificar aún más la competencia de los principales miembros del equipo. Podría tratarse de enlaces a sus perfiles de LinkedIn, o enlaces a las propuestas para las que el equipo ya ha recibido financiación. Hay un video de youtube con el fundador (que es muy bueno), pero me hubiera gustado tener información más detallada relacionada con esta propuesta. La propuesta SÍ incluye información de contacto valiosa para los miembros del equipo principal, algo que rara vez se ve en las propuestas (según mi experiencia como asesor comunitario).\r\nLa afirmación de que el equipo pretende reembolsar los fondos de esta propuesta en el plazo de un año habla de un alto nivel de compromiso con el proyecto y la comunidad, pero estaría bien tener información más detallada de dónde saldrá este dinero y cómo se distribuirá a lo largo del año. La asignación del presupuesto es bastante sencilla e incluye un plan de contratación de desarrolladores con la competencia necesaria, presentado con las horas de trabajo y una estimación del salario por hora en un plazo más largo (aproximadamente 2 meses, 1 dev a tiempo completo y 2 dev a tiempo parcial). Hay una parte de la asignación presupuestaria que irá al fundador por trabajar 30 horas a la semana, pero estaría bien tener un breve desglose de lo que se incluye en ese paquete de trabajo. ¿Se trata de marketing, de la gestión de este proyecto únicamente o de otros proyectos? Si el fundador trabajará 30 horas semanales en este proyecto, ¿significa eso que no participará en los demás proyectos? La viabilidad de la propuesta sería mucho más fuerte si pudiéramos conocer más detalles sobre la dApp en sí, ya que la propuesta presenta principalmente la idea central pero no muchos detalles. ¿Qué funciones tendrá aparte de subir/comprar material? ¿Serán anónimos los compradores y cómo se distribuirá? ¿Incorporará NFTs y cómo funcionará? Sé que pueden ser preguntas \"obvias\", pero si el objetivo es tener un gran alcance a personas con experiencia variada de trabajo con Cardano y la tecnología Blockchain en general, creo que sería beneficioso que la propuesta incluyera esta información. Por las razones expuestas, no estoy ni en desacuerdo ni de acuerdo en que sea muy probable que esta propuesta se lleve a cabo con éxito.", "q1r": 3, "q2": "Para medir la auditabilidad de forma clara y estructurada, sugeriría que el proponente añadiera muchos más detalles sobre el desarrollo y el proceso del proyecto. Sería increíblemente beneficioso si pudiéramos ver una hoja de ruta clara con hitos, y con la inclusión de un calendario estimado. Por el momento sólo podemos ver que el proponente pretende crear un mercado, pero ¿cuáles son los pasos para crear un mercado para los autores? ¿Dónde está el proyecto después de 3 meses, 6 meses, 9 meses y 12 meses? ¿Qué canales sociales podrá seguir la comunidad el progreso del proyecto?También sugeriría incluir algunas mediciones de éxito para supervisar el desarrollo (KPIs y métricas). ¿Cuántos usuarios se esperan durante el primer mes, o después de 6 meses? Si entiendo bien las cosas, Cardano Outreach parece ser bastante activo en las redes sociales, e incluir ese plan o proceso en la propuesta aumentaría aún más la auditabilidad y la transparencia del proyecto en su conjunto. También incluir un breve párrafo de texto que explique los riesgos y desafíos, y cómo el equipo planea hacer frente a estos aumentaría aún más la confianza en el equipo, y mostraría que tienen una visión de múltiples perspectivas y una profunda comprensión de los aspectos micro y macro del proyecto.\r\nBasándome en la falta de información proporcionada, no estoy de acuerdo en que esta propuesta me proporcione suficiente información para evaluar el progreso en la consecución de sus objetivos declarados.", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Estoy de acuerdo en que esta propuesta plantea un problema muy interesante y su posible solución a la comunidad.\r\n\r\nCon un control y un monopolio cada vez mayores si ciertos puntos de vista de cualquier escritor no están en sintonía con las plataformas como Google, Facebook o Twitter, hemos visto que muchos escritores temen ahora expresarse, ya que o bien se les bloquea o bien se les bloquea de las plataformas para expresarse. Por lo tanto, en mi opinión, esta solución, si se aplica, dará por primera vez la voz a estos escritores y les permitirá no sólo expresarse sino también ser recompensados por ello, el factor de anonimato es absolutamente importante cuando se trata de la aplicación de esta propuesta.\r\n\r\nSin embargo, veo un montón de oportunidades de mejora aquí, especialmente dando un poco más de detalles acerca de cómo este dapp funcionará ... al menos de alto nivel de conjuntos de características y flujo de trabajo o información funcionalidades habría sido mejor, ya que la descripción actual es bastante abstracta. Veo un poco de margen de mejora en la escritura por lo tanto 4 estrellas de mi lado.\r\n", "q0r": 4, "q1": "Desde el punto de vista de la experiencia, los fundadores o líderes de esta propuesta tienen mucha experiencia, pero para mí al final del día se reducirá a los desarrolladores que implementarán esta solución\r\n\r\nPor un lado, puedo entender que el equipo no haya podido conseguir que los desarrolladores compartan públicamente sus detalles aquí debido a las limitaciones publicadas por el proponente en la sección de comentarios. Sin embargo, tengo que recordar que hay otras propuestas que lo han hecho, :) así que tiene todo el sentido dar más estrellas/calificaciones a aquellas propuestas que han hecho un mejor trabajo de presentación para que la comunidad tenga mayor confianza en ella.\r\n\r\nA mí me gusta la idea de que el proponente propone devolver las tasas generadas por la aplicación, y eso significa que el proponente está muy comprometido con esta propuesta y quiere poner en marcha esta idea. Por lo tanto, estoy dispuesto a darle 4 estrellas, pero se necesitan algunas mejoras, así que no estoy completamente de acuerdo.", "q1r": 4, "q2": "Lo bueno de esta propuesta es que el proponente de la idea es bastante activo en la comunidad de cardano y por lo tanto proporciona una buena confianza a la comunidad de que estará disponible para la comunidad para proporcionar una buena hoja de ruta en el proyecto.\r\n\r\nSin embargo, puedo ver que hay un montón de mejoras que se requieren para que esta propuesta tenga una calificación completa. Falta el plan, los KPIs y las métricas de éxito. ¿Cómo será el éxito? ¿Cuál es la hoja de ruta detallada para el MVP? La idea es abstracta y siempre es mejor sentarse con sus desarrolladores y elaborar un plan básico sobre el conjunto de funcionalidades que tendrá su MVP, cuándo lo desplegará y quién lo auditará/proporcionará retroalimentación.\r\n\r\nPor lo tanto, desde el punto de vista de las calificaciones, le daré 3 estrellas, lo que significa que no puedo decir con seguridad lo probable que es que esta idea pueda ser auditada y rastreada perfectamente.", "q2r": 3, "assessor": "z_assessor_454", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This idea is excellent! Proposer clearly presents the problem with writers and offers a clear solution. This proposal if implemented, would have a positive impact on the Cardano ecosystem and is clearly visible in the proposal on how it will add value to the Cardano ecosystem. Unfortunately, KPIs are not listed so it's hard to compare KPIs with challenge setting and proposal is not able to scale and address future challenges.\r\n\r\n", "q0r": 3, "q1": "In this proposal it is clear how the proposer is looking for developers who would realize this idea. It would be good to know who is behind this proposal. Maybe some link from a proposer via LinkedIn or a website. The bearer of the idea does not have the necessary skills and knowledge needed for the realization of this idea. But if he could find developers with experience, knowledge and the necessary skills, the project surely could be realized. The proposer clearly communicates how many developers are needed in the team and most of the requested budget that is clearly presented would go to external collaborators aka developers. The budget is reasonable and broken down into identifiable items. An additional funding is required to implement the proposal but the proposer states that they will be borne by the founder and the devs. Proposer does not specify a detailed implementable plan and details of actionable tasks and order of execution are missing. Unfortunately, there is no more detailed timetable to complete the work and the possible risks have not been elaborated. In the proposal we can find the necessary resources to implement this idea but it would be better to present them in more detail. The explanation and technical aspects and technologies required for implementation are missing.", "q1r": 2, "q2": "It would be good to have an elaborate roadmap with milestones and a time frame within which the idea would be realized. It is also necessary to present KPIs with which the success of this proposal could be measured. Unfortunately the community can't follow the development of this project in any way due to the lack of necessary data.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 16, "ne": 3, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "I find it difficult to see an app like this becoming popular at this time. \r\nThe DApps success defined as attracting users to Cardano. The service that this app aim to provide is not appealing enough compered to many other apps proposed in this challenge.\r\nThere are many platforms for publishing, and readers will not pay for more texts that in the current environment.  ", "q0r": 2, "q1": "The experience \r\n of the proposer seems legit, but there is a lack of information about the rest of the team - in the proposal it specified - \"3 Developers \r\n• Front End, Back End, UI\"\r\nBut there are no names. Is those developers are already part of the team or the plan is to recruit them later? It is not clear. ", "q1r": 3, "q2": "There are no KPIs. ", "q2r": 2, "assessor": "z_assessor_871", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The problem stated is the lack of publishing platforms for writers. I assume StoryTime would be the decentralized version of Amazon KDP publishing, instead of a blogging platform. If so, then this proposal fits the Challenge's needs and could drive more adoption. But if it's a blogging platform, then Publish0x and Steemit is already providing a solution. This proposal would benefit from having a clear statement on its unique selling point. What does safe and decentralized environment mean? Amazon KDP publishers face the risk of being taken down and their funds frozen if the subject material does not meet their requirements. Are StoryTime writers protected from this? There is also no KPI on how the success of this project can be measured. The proposal can be much stronger if these details are added.", "q0r": 2, "q1": "\r\n\r\nNot enough time is spent on the technical aspect of the proposal. The proposal has a clear idea on the manpower needed for the job, but comments seem to reveal that the developers are busy with full-time jobs until January. The team's linkedin/github profiles should be shared to add credibility to the proposal. The dev cost for an MVP product is $32,000 and $9,200 is paid to the founder. More details on StoryTime's implementation needs to be included to justify the money involved. The proposal could also benefit from a section on the risks involved: what if there's too low of an adoption? What if no one finds out about StoryTime? How would censorship or quality management of published content be enforced? Just a few questions that come in my mind.", "q1r": 1, "q2": "No roadmap with milestones for the MVP. No metrics to measure success of the project as well. The proposal would benefit from sharing some technical details as well as expected number of users/sales/books published. Maybe a comparison to Publish0x and Steemit would help? Like a chart showing the differences.", "q2r": 1, "assessor": "z_assessor_948", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "Queremos crear un mercado para que vendan su trabajo y reciban una compensación justa en un entorno descentralizado y seguro a través de una DAPP.", "experience": "Fundador de Cardano Outreach, ganador del fondo 4/6. Más de 20 años de experiencia como gestor, empresario y educador."}