{"id": 384625, "author": "dcspark", "title": "Fractionalized NFTs v2", "url": "https://cardano.ideascale.com/a/dtd/384625-48088", "category": 26240, "amount": 50000, "description": "Hemos publicado una dApp de Plutus para fraccionar NFTs. Sin embargo, no ha sido auditada y sólo admite fraccionar NFTs individuales", "funded": 2, "upvotes": 192932440, "downvotes": 4443349, "votes_result": 188489091, "votes_cast": 549, "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "Estoy muy de acuerdo en que esta propuesta aborda efectivamente el desafío.  La v2 de Fracada es muy importante en mi opinión, ya que a muchos proyectos les gustaría realmente tener una funcionalidad NFT fraccionada en sus dapps/proyectos.\r\n\r\nEsto permitirá a muchos proyectos tener una solución ya incorporada para tal caso de uso, y en lugar de centrarse en sus principales reglas de negocio / caso de uso, ya que esta solución propuesta promueve la reutilización, ya que otros proyectos pueden mirar fácilmente en el código (repo público github) y reutilizar la funcionalidad.\r\n\r\nEsta propuesta en sí misma cubre una característica muy buscada, y en mi opinión dará un buen impulso a los desarrolladores que construyen dapps en el ecosistema cardano.", "q0r": 5, "q1": "Desde la perspectiva de la experiencia, estoy bastante seguro de que la experiencia del equipo está bien sincronizada con la base de conocimientos de plutus y haskell para el desarrollo de SC en Cardano. El desarrollador principal es muy activo en el ecosistema de Cardano y el equipo también ha trabajado con Emurgo, el proyecto responsable de proporcionar formación a los desarrolladores y recursos para hacer crecer enormemente el ecosistema de desarrolladores de Cardano.\r\n\r\nEl plan presentado aquí, aunque, no está muy elaborado pero el repositorio de github. ya está en marcha y la implementación ya ha sido terminada. Lo que el equipo está buscando es tener una auditoría pública para la funcionalidad del contrato inteligente y, en mi opinión, el costo de esto debería haber sido detallado también, por ejemplo, al menos algunos enlaces públicos que apuntan a lo que cuesta en general tener este tipo de auditorías. Está claro que el equipo también está buscando algo de ayuda de la fundación Cardano, y en general en mi punto de vista esto es una señal bastante saludable para este proyecto.\r\n\r\nPor lo tanto, estoy bastante seguro de que este plan y la experiencia de los equipos de esta propuesta se llevará a cabo con éxito. Sin embargo, veo algunos desafíos/riesgos en términos de problemas importantes que se encuentran en la implementación ya hecha, por lo tanto, quitando un punto.", "q1r": 4, "q2": "Bueno, creo que la información proporcionada aquí es suficiente para auditar el progreso y el éxito de esta propuesta.\r\n\r\nSi el equipo es capaz de obtener financiación, entonces será capaz de auditar la implementación del proyecto y cualquier problema que se está encontrando o planteado, puede ser fácilmente rastreado por la comunidad sobre la actividad de Github.\r\n\r\nSin embargo, como yo mismo soy desarrollador, creo que habría sido bueno dar una perspectiva más detallada en términos de plan de proyecto / hoja de ruta para este proyecto.\r\n\r\nLos 15 mil para el desarrollo de Fracada v2 se da, pero no se ha dividido en horas de trabajo y lo que los conjuntos de características que estamos esperando en allí? Estos detalles son muy importantes para que la comunidad pueda hacer un buen seguimiento del progreso de la propuesta. Creo que muchas veces los desarrolladores ignoran que los votantes/la comunidad no tienen necesariamente una formación técnica, por lo que es tarea del proponente hacer que la propuesta sea lo suficientemente clara para el público en general. Veo que se necesitan algunas mejoras en la redacción de esta propuesta, de ahí las 4 estrellas de mi parte.", "q2r": 4, "assessor": "z_assessor_454", "no_vca": 14, "ne": 8, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Fractionalised NFTs have huge potential and an open sourced solution to batched NFTs will definitely bring value to Cardano ecosystem and therefore this proposal is well placed and speaks to the challenge of integrations.", "q0r": 5, "q1": "The team is well known and active within the community and capable of performing the proposal. It would be good to see a more comprehensive breakdown of funds for this proposal as it is a large sum requested.", "q1r": 4, "q2": "The proposal does not have a clearly defined roadmap or KPIs listed. However it can be audited by the simple fact of if the SC is complete and it itself has been audited. It would be great to see a more in depth dive into the timeframe and roadmap however", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The proposal describes creating an improved version of an existing open source package they made called Fracada which helps with fractionalizing an NFT. In this proposal the team looks to allow people to fractionalize a bag of NFTs and also audit the code. The proposal team has also found that there is interest in the community already or their existing project and have also outlined in an article why NFTs are a fundamental building block in DApp development in Cardano. Both the evidence of existing demand and future demand there is a high likelihood that this proposal could have a high impact on the existing community projects already but also with new projects that can utilise the code from the start.", "q0r": 5, "q1": "The team has a background of working in Emurgo and working closely with IOG. They have started a company dcSpark to work on infrastructure to be used in the community and have already delivered against previous funded Catalyst proposals already. The team has already implemented a first version of this proposal which is open source and can be reviewed. Due to the background of the team and evidence of the implementation already there is a high chance it is feasible this proposal will be executed.\r\n\r\nA budget break down has been provided between the auditing and next part of work outlined. It would have been good to know more about who will audit their work as this will determine the confidence levels that community projects would have in implementing this work into their own projects. This is a minor concern as the team has the technical expertise to know who to select for this process however the information would have been nice to add for increasing confidence of audit feasibility.", "q1r": 5, "q2": "A basic roadmap is given stating early 2022 for delivery. No KPIs or success metrics were given. There is already open source code provided which allows advisors and the community to audit the code already and will be able to continue auditing that code as and when it gets updated. It would have been good to see here more on success objectives that explore some of the use cases for this work. NFT marketplaces appear to be a clear example given, however some other examples would add clarity to where to expect this proposal to be used and how that could influence what the success outcomes are for this proposal.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 15, "ne": 7, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Queremos publicar una v2 de Fracada que sea auditada y que permita fraccionar una bolsa de NFTs", "experience": "Habiendo trabajado anteriormente en EMURGO, hemos trabajado en Plutus durante años y hemos lanzado Fracada como un contrato inteligente de código abierto del MIT para Cardano"}