{"id": 384826, "author": "albert.feghaly", "title": "OpenScienceNFT Marketplace", "url": "https://cardano.ideascale.com/a/dtd/384826-48088", "category": 26240, "amount": 23700, "description": "El conocimiento científico suele estar encerrado tras muros de pago, a pesar de estar financiado en su mayor parte por el público. La ciencia debería ser más accesible.", "funded": 2, "upvotes": 229711277, "downvotes": 6106817, "votes_result": 223604460, "votes_cast": 1322, "f6_no_assessments": 7, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Una propuesta muy bien articulada y presentada que encaja perfectamente con la configuración del reto.  El planteamiento del problema es fácil de entender y, siendo yo mismo ingeniero de software, he visto de primera mano situaciones en las que muchos buenos contenidos/trabajos científicos no están disponibles para el público en general, aunque la financiación provenga de dominios públicos.\r\n\r\nEsta propuesta, si se lleva a cabo con éxito, trata de abordar este problema y proporciona una mirada profunda sobre las múltiples variantes de este problema.  La propuesta ya ha considerado el marco legal que será importante para realizar el éxito de esta propuesta. Por lo tanto, en mi opinión esta propuesta tendrá un buen potencial no sólo para mejorar la fuerza de la red cardano, sino que también se alinea con la visión y el objetivo de cardano, que es tener un mundo de igualdad de oportunidades en el futuro.", "q0r": 5, "q1": "El equipo de esta propuesta ya obtuvo una financiación exitosa en la ronda anterior, y esta propuesta se basa en el trabajo prometido/objetivo en la propuesta del Fondo 6.\r\n\r\nLa experiencia del equipo está disponible públicamente, y la última actualización del equipo se actualiza de forma rutinaria en el enlace proporcionado en la propuesta.\r\n\r\nEl plan es muy ambicioso, y se ha proporcionado un diseño detallado tanto desde la perspectiva de un pájaro (para tener siempre un ojo en el panorama general) y al mismo tiempo una descripción detallada de las estrategias de monetización de osNFT. Está claro que el equipo ha reflexionado sobre la hoja de ruta y los hitos, y se ha dado un impacto de esta hoja de ruta, con hitos de ejecución en 3-6-12 meses.\r\n\r\nTiene sentido que el equipo haya permitido a la comunidad tener detalles por adelantado sobre la hoja de ruta a largo plazo, pero también que el equipo se haya limitado a esta ronda de financiación en términos de presupuesto solicitado. El desglose del presupuesto está justificado para mí, y estoy seguro de que el equipo tendrá mucho éxito y un bucle de retroalimentación positiva con la comunidad, lo que lleva al éxito de esta propuesta.\r\n", "q1r": 5, "q2": "Estoy totalmente de acuerdo en que la información proporcionada aquí es suficiente para auditar el progreso y el éxito de esta propuesta. El equipo es público y un enlace a su página web, en la que publican actualizaciones semanales de los progresos, es una buena manera de que la comunidad esté al tanto del desarrollo de la rutina.\r\n\r\nAdemás, el sitio web da en las diferentes fases detalles, que cada fase esperando un conjunto de características junto con los plazos estimados a la misma. Esto, en combinación con las actualizaciones semanales, proporciona un buen bucle de retroalimentación a la comunidad, de modo que cualquier cambio en la hoja de ruta prevista se propaga rápidamente a la comunidad.\r\n\r\nEn general, esta propuesta es muy detallada y está muy bien redactada, por lo que me parece muy acertada.", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Los proponentes quieren crear un mercado académico para la investigación accesible, que pueda ser apostada, vendida o prestada. En la propuesta se menciona el problema de que la investigación académica no es tan fácilmente accesible aunque sea mayoritariamente pública. No lo sabía, pero después de investigar un poco veo que el problema es real y se ajusta a la configuración del reto. La propuesta añade una explicación exhaustiva del valor que añadirá a hacer el sistema cardano, trayendo más académicos a la comunidad cardano. Los objetivos de la propuesta son exactamente lo que toda comunidad busca: más gente educada, gente de acción a bordo. Después de leer la propuesta, no tengo ninguna duda de que los autores no tendrán problemas para escalar su solución para estar a la altura de los retos de escalado a los que se enfrentarán. He leído bastantes propuestas que ya superan los 40 y no veo que falte ningún elemento clave en esta. La propuesta incluiría el ámbito académico y crearía un mercado que ayudaría también a algunos académicos desfavorecidos, lo que es realmente noble.  Es una gran propuesta, ¡voy a votar y a apoyarles!", "q0r": 5, "q1": "Los autores han ampliado su equipo desde la última ronda de financiación, lo que fue una agradable sorpresa para mí. Esto significa dos cosas: 1. Han sido votados con éxito y ya han trabajado en una propuesta. 2. Su idea es lo suficientemente buena como para atraer a otros académicos y su impulso. Las credenciales son verificables, ya que los autores han vinculado las cuentas de linkedin de todo el equipo. 3. El equipo se está formando para ser un equipo formable, ya que está formado por miembros de todo el mundo. El presupuesto está descrito y desglosado en detalle. Hay objetivos razonables y alcanzables. No soy un experto ni mucho menos en el ámbito académico, pero en lo que respecta a la codificación y el desarrollo, como dev su hoja de ruta y calendario parecen sensatos y totalmente realizables. El plan de implementación parece solito y secuencial. Se enumeran todos los recursos necesarios para llevar a cabo la propuesta, y se detallan algunos escenarios como la descentralización, la futura gobernanza y la incorporación de más personas. También se mencionan los aspectos técnicos de la propuesta. Los lenguajes y las tecnologías que se van a utilizar junto con la razón de ser. Los proponentes han tenido en cuenta los retos y los riesgos relacionados con la aplicación y el objetivo fijado. Me ha gustado especialmente el hecho de que hayan pensado en diferentes formas de hacer uso de su token osNFT. Estos académicos han investigado sobre lo que ya está disponible, y construirán sobre los ladrillos de construcción de otros miembros de la comunidad, que es la forma correcta de hacer desarrollo de código abierto. En general, se trata de una solución factible y estoy deseando que se haga realidad.", "q1r": 5, "q2": "A diferencia de muchas otras propuestas, no me preocupa la trazabilidad. En su sitio vinculado, los autores han creado una sección llamada \"actualizaciones semanales\" en la que interactúan con todas las personas interesadas en su proyecto y ofrecen actualizaciones de los avances. Más adelante, planean tener una sección con artículos en el blog sobre lo que se está haciendo y cómo se está avanzando. Es un canal excelente para mantener a la comunidad involucrada e intrigada. Se mencionan métricas y KPI relevantes que, en mi opinión, están en consonancia con el éxito del proyecto. Hay una vista de pájaro del camino, así como hitos, todo en un marco de tiempo factible. Una descripción clara y comprensible del problema que se pretende resolver y una descripción académica detallada y bien pensada de la solución.   Te deseo lo mejor. ¡Sigue haciendo lo que haces!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal aims for a continuing of the funding after the project received funding in the previous round. The team has been spending time and funds to research and set up a framework, deal with copyright issues and other relevant topics around creating a science marketplace in combination with an NFT model. One of the objectives is to get rid of paywalls so that more people have access to scientific papers - another objective is to reward scientists and give the opportunity for them to receive funding for future work.", "q0r": 5, "q1": "The team is multi-disciplinary and does include academics as well as developers - so the necessary skillset of the team matches the objectives and enhances the likelyhood of this proposal being implemented successfully. The prior work and the references provided are very positive and on task and it is nice to see how excited the team is about their project, I like it. I think the proposing team has done good work at looking at the necessary issues that come with creating such a marketplace, which is good. I´m an academic researcher with more than 7 years of experience both as a peer reviewer as well as a published academic in peer reviewed academic journals. While I think that the process of reviewing the quality of a paper or a study could be improved, I do not believe that the peer review process is meaningless, I find it important that internal and external validity of a research design is monitored to ensure that . The way that this group of people are brainstorming and creating a framework to include researchers with less access to funding is great and could contribute widely to a fairer system of how science and scientists can use their research. ", "q1r": 5, "q2": "The team is a prior funded team that is now seeking additional funding to continue their work. They are providing several very thorough ways of auditing their progress, the team is very transparent, the roadmap and the goals are realistic and the budget makes sense. The skillset of the team matches the task, the work they have been doing since they got funded is very goal oriented and the project is taking shape while the team seems to be very excited about this project. Overall great.", "q2r": 5, "assessor": "z_assessor_19", "no_vca": 20, "ne": 9, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This proposal spells out a useful tool for the scientific community and a powerful draw for ADA adoption through NFTs.", "q0r": 5, "q1": "The team has made good headway and clearly considered many of the potential stumbling blocks for their ambitious set of goals. This is an already funded proposal that has done good work. The budget and roadmap are transparent and feasible.", "q1r": 5, "q2": "The team's credentials, a plethora of readily available resources such as github, and the well-defined roadmap all point to a transparent and auditable product.", "q2r": 5, "assessor": "z_assessor_501", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "In academic world, we didn't realize how much scientists' hard-work could be overlooked and under appreciated inside this multi-billion dollar industry (scientific publishing). This proposal deliver a solution to give that ownership back to them, the scientist, with building an OpenScienceNFT Marketplace. This project will help the academic world become decentralized and independent from the middleman (that is the publishing firm), and get royalties paid directly to the scientists. This will help not only the adoption of Cardano, but the independent scientific academy to self sustain itself without the need of publishing industries. ", "q0r": 5, "q1": "Previously, OpenScienceNFT project have been successfully funded on Fund 6, and it progressing well and on track. The team is proven to be capable and experienced, looking at the progress have been accomplished, and I have no doubt that it will continue with this Fund 7. The team not only consists of developer and technical people, but also advisors in respective field to further support the project development. The roadmap provided is clear and explained in detail, with the 3-step roadmap of 3 months, 6 months, and 12 months. The budget is broken down into details, to work hours and weeks, and salary is well explained too. This proposal also manage to highlight the challenge and risks by looking at legal aspect, how the governance work, etc. Overall, this is a well prepared proposal and project, proven to deliver after successfully funded on Fund 6, and have a great track record of experienced team.", "q1r": 5, "q2": "Previously, OpenScienceNFT project have been successfully funded on Fund 6, and it progressing well and on track. The team is proven to be capable and experienced, looking at the progress have been accomplished, and I have no doubt that it will continue with this Fund 7. The team not only consists of developer and technical people, but also advisors in respective field to further support the project development. The roadmap provided is clear and explained in detail, with the 3-step roadmap of 3 months, 6 months, and 12 months. The budget is broken down into details, to work hours and weeks, and salary is well explained too. This proposal also manage to highlight the challenge and risks by looking at legal aspect, how the governance work, etc. Overall, this is a well prepared proposal and project, proven to deliver after successfully funded on Fund 6, and have a great track record of experienced team.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 18, "ne": 6, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal speaks directly to the main objectives of the challenge, by implementing NFT for researchers can publish, retain ownership of their work and distribute it to the general population in a marketable fashion. The science innovation often not available for public, despite it being mostly funded by the public. This project will be a solution to make science and knowledge more accessible for the non-scientific community. The use of NFT as main source of ownership is already common and widely accepted in the world. Should this project able to convince science community to join, it could bring more credible credential to Blockchain especially Cardano. ", "q0r": 5, "q1": "Team consist of multiple individuals with significant credential who hold PHD and Post Doc. Given the combined experience presented by its team member, it is highly likely that the project can be a huge success. Team provides clear roadmap and requests a reasonable budget with detailed breakdown. The whitepaper provided by the team has depth technical explanation. Problem statement and solution delivered match and both address the challenge effectively. Success measure of this project is very reasonable, and team has explained clearly their step-by-step execution plan. This proposal is one of the best in Fund 7 and should be voted by the community.", "q1r": 5, "q2": "The success criteria provided the proposal is reasonable and achievable that make the project feasible and realistic. Team does not mention where they will publish the progress of project execution making their web as the only source of monitor or audit the project. So, the team can improve the execution of this project by posting the detailed budget spending on cardano forum so it can be audited by the community member. This project is the one holding most potential in Fund 7 and should be voted by the community.", "q2r": 5, "assessor": "z_assessor_643", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "Publishing scientific research is necessary for the development of human beings, it will help people to learn - understand - develop this world better and faster. And one of the big values that bring to the digital world is preventing info manipulation or fake info that is happening every day. \r\nThis project will have a huge impact on the Cardano ecosystem, not by just its idea that can drive and keep sustainable users, but also as the team points out in the proposal. ", "q0r": 5, "q1": "A part of this project was funded in the fund6 and the team finished it well, now they made this proposal for the next step of their roadmap. There, I absolutely support them in this proposal. \r\nThey have a good vision and detailed info that can help us well know about what the team will do to make the idea come true. For this fund, they have a reasonably required budget that fits with the plan in the scope of 6 weeks. ", "q1r": 5, "q2": "The team provides various ways to track and audit their project. Their roadmap and key results also are clear and detailed, which makes the auditing process easier. \r\nSure that they have a good acknowledgment about the problem context that is detailed in the referral proposal in fund 6, and that helps to better understand their solution explanation. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 22, "ne": 2, "ng": 16, "nfo": 4, "vca_o": 1}], "solution": "Con las osNFT, los investigadores pueden publicar, conservar la propiedad de su trabajo y distribuirlo a la población en general de forma comercial.", "experience": "Bioinformática, Python, JS, Big Data, ML, AI, Blockchain.\nEquipo = 5 + 3 Asesores -> https://intellart.ca/#/team\nNivel de doctorado, nivel de postdoctorado."}