{"id": 385002, "author": "realjosiah", "title": "Thrift Mobile Wallet", "url": "https://cardano.ideascale.com/a/dtd/385002-48088", "category": 26240, "amount": 16420, "description": "Falta de un monedero orientado al ahorro y a la salud financiera a través de DeFi, centrado en los países en desarrollo. Ficha THRIFT.", "funded": 1, "upvotes": 35098440, "downvotes": 14037356, "votes_result": 21061084, "votes_cast": 206, "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"q0": "El proyecto quiere construir una aplicación móvil - un monedero para guardar y manejar todas las transacciones de ada junto con métricas e información útil. Me gusta la idea de que ahorrar significa prever, estoy de acuerdo con esta apreciación como se dice en la propuesta hay tiempos buenos y malos y hay que prepararse para ambos. La propuesta está en la configuración correcta del reto de construir una aplicación para el uso de la comunidad. Este proyecto aportará valor a la comunidad de Cardano en su conjunto, y dado que planean que la aplicación móvil sea sencilla y fácil de usar, podrían atraer también a algunos miembros externos. Los KPIs son relevantes para el reto al que se enfrentan, y como desarrollador creo que el nivel de detalle sobre la implementación técnica es admirable. Con el equipo descrito, no veo problemas de escalabilidad en el futuro. Estoy seguro de que todos los retos se cumplirán. Tal vez una cosa que me hubiera gustado ver más es que los autores echaran un vistazo a lo que ya se ha hecho y lo utilizaran, en lugar de construir todo desde abajo, pero ambos enfoques tienen sus beneficios. No veo que falten partes necesarias de los elementos enumerados en la propuesta.  Como desarrollador no tengo ninguna preocupación sobre esta propuesta e insto a la gente a votar a favor.", "q0r": 5, "q1": "Hay muchos enlaces de linkedin que es lo único que suelo buscar de todas formas. Si se indican nombres lo primero que haría es buscarlos en linin. Me gustan los proponentes que respaldan su proyecto con su nombre. Esto aporta credibilidad al proyecto a mis ojos de votante. Los miembros del equipo ya están agrupados y trabajando, por lo que diría que se comprueba el tipo y número necesario para llevar a cabo la propuesta. El presupuesto podría desglosarse en tarifas horarias para facilitar la comparación con otros proyectos de este tipo, pero aparte de eso está bien perfilado el destino del dinero. El calendario ofrecido me parece realista como promotor para realizar el trabajo descrito en la propuesta. El plan de ejecución es más que sensato, es concreto. Para los que hemos leído más de 40 propuestas, es raro ver tantos detalles técnicos en una propuesta. Como persona técnica que soy, puedo apreciar el esfuerzo por describir la arquitectura y las tecnologías que se utilizarán. Me gusta que haya imágenes de cómo sería el posible diseño de la implementación. Se trata de un esfuerzo adicional que gusta a los miembros de la comunidad porque pueden imaginarse más fácilmente si utilizarían ese monedero en una fase temprana.  Se mencionan algunos posibles retos junto con el proceso que seguirá el equipo para superarlos. La gente con tanta experiencia no debería encontrar problemas para superar los retos. La única pequeña crítica que tengo es la falta de investigación sobre lo que ya existe y puede ser reutilizado, pero eso no es un gran problema ya que cada desarrollador que trabaja en algo nuevo adquirirá un nuevo conjunto de habilidades y cuanto menos código reutilizado, mejor será el desarrollador. Así que es una especie de inversión en los futuros proyectos en los que trabajarán los desarrolladores. Buena suerte a ti y a tu propuesta en la fase de votación.", "q1r": 5, "q2": "¿Cómo podrá la comunidad seguir el progreso de los proyectos? Esta es una de las preguntas que me hago y los autores no han decepcionado en este aspecto. Habrá actualizaciones de los progresos cada dos semanas en las redes sociales, lo cual es estupendo que se prometa explícitamente y se mencione en el proyecto. Muchos proponentes no prestan la atención necesaria al acceso de la comunidad a la información sobre el progreso del proyecto. Los KPIs mencionados son relevantes y describen el éxito de la propuesta si se cumplen. No he visto ninguna métrica como la tasa de adopción, las descargas de la aplicación, etc., lo cual es un poco decepcionante, por lo que sugiero que el equipo las añada en futuras propuestas. Es útil para comparar las expectativas con la realidad en el futuro. Se proporcionó una hoja de ruta y unos hitos razonables, así como un calendario para trabajar en todas las tareas necesarias descritas. En la propuesta se ha enumerado un problema claro y una solución a la altura.   En general, creo que el proyecto es trazable, pero si pueden añadir un canal para recibir comentarios de la comunidad en forma de discrord o telegram chnnel sería beneficioso para ambas partes.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "It is a nice idea to provide some financial education to the people using some savings and costs analysis implemented in the wallet, yet I am not strongly convinced that it will be as successful as predicted.\r\n\r\nTo boost this, it would be nice to see what current wallets are missing and what your wallet will offer that will shift them or attract new people to it. Right now, I feel that there are too many wallets and I think if the only feature would be savings and costs analysis, staking...I do not see a large impact on cardano adoption (which is a challenging goal).\r\n\r\nYou would have to come up with something breaking, but you are facing a large competition. Cardano has already multiple wallets if I am not mistaken.\r\n\r\nRating 3.", "q0r": 3, "q1": "Given the experience and detailed roadmap, I believe that they have a solid idea of how to finish and implement the final product. \r\n\r\nRating 5.", "q1r": 5, "q2": "I am strongly convinced that their progress and the final output can be easily audited -\r\n\r\nwe can audit the progress\r\nwe can audit the final product\r\nwe can audit and measure the number of users\r\netc.\r\n\r\nDetailed KPI provided\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "I believe this proposal effectively onboards new users that aren't typically engaged in defi to the Cardano blockchain, which fits the challenge category well.\r\n\r\nAlthough there are many mobile wallets already competing for this title, this one seems to be targeting Africa, which may give it a local advantage verses wallets more tailored to western audiences. This could fill a very important purpose of onboarding those users better and more seamlessly.", "q0r": 4, "q1": "The proposing team consists of a Plutus Pioneer who has founded previous IT and blockchain startups, and has been working to bridge the traditional financial world. Other team member includes a developer with significant experience in the Cardano ecosystem. \r\n\r\nI think based on the team, and prior works combined this will produce a favourable outcome for both the proposal and project catalyst itself. The plan is very details and includes specifics such as which functions are to be finished and delivered into the end product. This gives me high hope that they will be successful with this proposal.\r\n", "q1r": 5, "q2": "The roadmap really looks fantastic, sensible yet worthy milestones and you have the KPIs listed for the milestones. The detail you have added to the roadmap makes it easy to audit and verify the relative success of the proposal!\r\n\r\nThe team also plans to update their socials every two weeks in order to stay accountable to the community, in addition to the detailed roadmap included.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 16, "ne": 2, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The implementation of a savings wallet is well placed within the challenge and if successful will clearly bring value to the Cardano ecosystem as a whole.", "q0r": 5, "q1": "The team is clearly defined with LinkedIn links and relevant experience of all members provided. The funds are clearly broken down and reasonably allocated. The plan is clearly presented and it is nice to see they are thinking of possible failure points even if none are currently apparent.", "q1r": 5, "q2": "The roadmap is well defined and a large list of auditable KPIs are provided with bi-weekly status reports promised therefore this tells me the project success will be easily auditable.", "q2r": 5, "assessor": "z_assessor_745", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "It seems like a good proposal to me, because today there are many people with difficulties managing their expenses and they cannot find a way to save for times of emergency or when they really need that financial help to solve a problem.\r\nFinancial health is increasingly important in a world where the economy is the basis of everything and I believe that this project can improve the quality of life of many people.", "q0r": 4, "q1": "A team with so much experience has no doubt that it will guide a project that can be developed successfully in the future.\r\nIn addition, that the savings plan is personalized may attract users.\r\nI am missing a detailed explanation of the steps to follow to achieve the objective to be able to decide if this project, indeed, will be successful.", "q1r": 3, "q2": "I think there is a lot of information lacking on the method to achieve the objective and that expanding it would be important to attract investors.\r\nAfter reading the proposal I have continued with the doubt of how to carry it out.\r\nAlthough I support the idea, I think a more detailed explanation is needed to be able to rate it as really good.", "q2r": 2, "assessor": "z_assessor_829", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Desarrollar un monedero móvil de inteligencia financiera fácil de usar para impulsar la adopción de Cardano mediante el ahorro y las finanzas descentralizadas abiertas.", "experience": "Nuestro equipo tiene una experiencia combinada de 35 años en blockchain, finanzas, aprendizaje automático, análisis de negocios, negocios africanos y big data."}