{"id": 385120, "author": "adosiawolf", "title": "P2P Manufacturing with Adosia IoT", "url": "https://cardano.ideascale.com/a/dtd/385120-48088", "category": 26240, "amount": 40000, "description": "La fabricación está centralizada, lo que exige unos gastos de envío masivos que tienen un impacto negativo en el medio ambiente.", "funded": 1, "upvotes": 42600128, "downvotes": 17746744, "votes_result": 24853384, "votes_cast": 247, "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Es una propuesta interesante para el desarrollo del ecosistema de Cardano mediante la aplicación de la plataforma IoT P2P y NFT drop y el contrato inteligente de Cardano para el mercado, el desarrollo de la dApp ayudará a crecer el ecosistema de Cardano. Si esta propuesta se financia y gestiona de forma correcta, se desplegará bien y aportará valor al uso del mundo real y a la utilidad de Cardano, por lo que apoyará el siguiente desarrollo e iniciativas como desea el autor. Creo que esta propuesta tiene un buen impacto para el ecosistema y la comunidad de Cardano.", "q0r": 5, "q1": "A primera vista, el contenido de la propuesta es muy corto sin suficiente información sobre el equipo y las pruebas de los trabajos, pero después de leer la referencia de linkedin, el libro blanco de Adosia y el Github de Adosia, me di cuenta de las especialidades del autor y los trabajos producidos por el equipo. Pero faltaba el enlace para los detalles de los miembros del equipo y los colaboradores.  Además, no pude encontrar información de apoyo sobre Quinn en esta propuesta, me pregunto si él está trabajando con su equipo como un papel importante en el mercado de contratos inteligentes Cardano y por qué no está en su equipo presentado, pero sólo un badajo.\r\nEs una pena que el proponente no haya desglosado el presupuesto en partidas identificables, como por ejemplo: cuántos miembros del equipo van a depoyar los distintos hardware de la impresora 3d, cuánto tiempo se necesita con el salario de una hora de trabajo para cada miembro,... Si se modifica claramente, creo que la viabilidad de esta propuesta será muy apreciada por la comunidad.\r\nCreo que 12 meses es un calendario realista para el mercado, pero albergar miles de diseños y cientos de operadores de impresoras 3d es difícil si el proponente no implica a la estrategia de marketing y por lo tanto el presupuesto para la comercialización también debe tener en cuenta.\r\nEn cuanto a la tecnología, me parece que esta plataforma IoT sólo se basa en la conexión wifi y está bien por ahora, pero sería mejor si el proponente añade algunos medios complementarios como la red celular (3G/4G/LTE), Lora, RFMesh,... para colocar dinámicamente la caja de hardware en algunas áreas.\r\nEl reto/riesgo no está implícito en esta propuesta, como por ejemplo que la sofisticación/calidad del producto de la impresora 3D no pueda satisfacer la demanda de los usuarios finales y las formas de mitigarlo/cambiarlo.\r\nPor último, sigo creyendo que esta propuesta puede llevarse a cabo con éxito si se gestiona de forma correcta.", "q1r": 4, "q2": "La auditabilidad de esta propuesta no es lo suficientemente buena para el seguimiento de la comunidad con facilidad y el autor de la propuesta tiene que modificarla porque no ha dado las métricas medibles o KPIs para evaluar la definición de éxito. Estaría bien que el autor proporcionara métricas detalladas y algo así como: en 1-2 meses desde la financiación, la construcción del front-end para el mercado, en los próximos 2 meses la creación de la red de hardware de la impresora 3d dentro del equipo, etc.\r\nCon la capacidad y el trabajo del equipo, creo que la hoja de ruta y los hitos en 12 meses son viables.\r\nEn común, no estoy ni de acuerdo ni en desacuerdo con la auditabilidad de esta potencial propuesta y espero que el proponente preste mucha más atención a ello.", "q2r": 3, "assessor": "z_assessor_777", "no_vca": 14, "ne": 9, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The project is great. ADOSIA is one of the few Cardano community members dealing with tangible products (like their ag devices). Perfectly matching the Challenge. Integrating digital (blockchain+internet), and physical technology  Normally, a 5 star rating.  However, this rating is 4 starts. Only because the impact of this proposal depends on adoption by two niche groups of customers: People interested in operating 3D printing services as a business (part time or full time) PLUS customers for those kinds of services. So significant impact might take quite a while. But it will come as 3D printing becomes more mainstream.", "q0r": 4, "q1": "ASOSIA's demonstrated performance in the real world building devices, even before CARDANO tells me they can complete the tasks they have proposed to complete. They exist with or without Project Catalyst funding. Different from so many other proposals which have  no life without Catalyst funding. And if unable to produce what they promise, go on to something else. Not ADOSIA. for that reason 5 stars. ", "q1r": 5, "q2": "The whitepaper, links and the Adosia.com website provide all of the needed information to fully grasp the essences of the proposal which when combined with  what is described or explained in the text of the proposal clarifies the proposal. But I did have to use all the sources that were provided. If others do not, they might miss the full understanding. The information is there.", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 18, "ne": 4, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Interesting idea to decrease the shipping and protect the environment by IOT 3D Pritning, If the demand would be high - which I assume will be increasing over time - it can serve as a place not only for solo entrepreneurs but also companies for marketing and sharing via web.\r\n\r\nI think that on a scale 1-5 this can potentially impact cardano on 4. \r\n\r\n\r\n", "q0r": 4, "q1": "the linked in profile is posted, and the website is already running. I have a strong belief they can deliver, yet it would be nice to see more information about the team to increase the creditability. \r\n\r\nI find it strange that the team is 20 members at the top and then15 members below. This would require more clarification and detail about what does it mean. \r\n\r\nrating given 4.", "q1r": 5, "q2": "the progress and the overall product can be audited, yet this information is missing in the proposal, but I can imagine how it would work:\r\n\r\n1. code and interface progress\r\n2. number of users\r\n\r\nBut it would be nice to have it stated.\r\n\r\nThe roadmap is provided in reasonable detail.\r\n\r\nRating given 4.", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is accurately placed within dApps and integrations and successfully highlights a problem and solution whilst bringing value to the ecosystem through a functional marketplace. ", "q0r": 4, "q1": "The team seems to hold the requisite experience  however I would like to see more of the team listed to fully prove this. The funds requested seem reasonable however as it is a large amount I would like to see a more detailed cost breakdown in the future.  and so I can only agree", "q1r": 4, "q2": "The roadmap laid out is reasonable and well spaced however there are no KPIs referenced and. It would be great to see hard figures that can be measured.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "As an IoT technological person, I feel this proposal very interesting, decentralizing market from manufacturer to user/buyer using IoT P2P platform combined with Cardano smart contract and token distribution models is a good way to develop the Cardano ecosystem. It funded and deployed successfully with metrics of Product MVP within 3 months, production software within 6 months and marketplace within a year, I think this is a valued real world use and utility to Cardano that this proposal delivered. By hence, it will support the following development and operational initiatives in the future.", "q0r": 4, "q1": "The proposer provides reference linkedin with specialties to show evidence of relevant skills and experience needed to implement the proposal but I could not find any link for details of team members. The Adosia White paper is so impressed with roadmap and many supporting information and also the Github of Adosia/contracts that some readers could ignore if not read carefully. I think it would positive if the proposer provides some important details of some team members, their works and especially about the relationship and role of Quinn in this proposal because he is a key for smart contract marketplace on Cardano.\r\nThe budget is not broken down into identifiable items, it is better if the Author gives detail number of people and work hours for each work, for example: 2 people * 40 hours * 50$/h for build out marketplace front end, etc.\r\nI think 12 months is a realistic timetable for marketplace but harboring thousands of designs and hundreds of 3d printer operators are a difficult if the proposer does not imply to the marketing strategy and so the budget for marketing also needed to take into account.\r\nAbout the technology aspect, I find this IoT platform just based on the wifi connection and it's ok for now, but it would be better if the proposer add some complimentary media such as celular network (3G/4G/LTE), Lora, RFMesh,... for dynamically placing hardware box in some areas.\r\nThe challenge/risk is not implied in this proposal such as the sophistication/quality of 3D printer product could not meet demand of end users and the ways for mitigating/changing.\r\nAt last, I still believe this proposal is likely to be successfully implemented if it is managed in a correct manner. ", "q1r": 4, "q2": "About the roadmap and milestones within 3-6-12 months are still ok for achievement. But the metrics or KPIs is not appropriate to this challenge, not clear for definitiion of success for community tracking and following. It'd be better if the proposer could give out details like: building out marketplace front end in the 2nd month, enable team members with various 3d printer hardware in the 4th month, execute dynamic NFTs drop using 3rd printers in the 6th month, hardware installation in the 7th month,... \r\nBy this reason, I don't think the auditability of this proposal  is good enough for community tracking easily and hope to see the modifying on it.", "q2r": 2, "assessor": "z_assessor_775", "no_vca": 15, "ne": 6, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "Despliegue de un mercado abierto p2p que permita una nueva oportunidad económica para monetizar los diseños 3d y ejecutar la ejecución de trabajos de impresión descentralizados", "experience": "Adosia ha crecido hasta contar con más de 15 miembros regulares del equipo, que van desde sofisticados desarrolladores de Cardano hasta ingenieros de diseño senior de spacex."}