{"id": 381414, "author": "ranket", "title": "Product Exhibition from Shikoku", "url": "https://cardano.ideascale.com/a/dtd/381414-48088", "category": 26238, "amount": 5000, "description": "Au Japon, il n'y a pas de cas d'utilisation de l'ADA pour le shopping. D'un autre côté, les collectivités locales japonaises veulent créer une nouvelle méthode d'appel pour leurs produits.", "funded": 2, "upvotes": 101629824, "downvotes": 10801155, "votes_result": 90828669, "votes_cast": 305, "f6_no_assessments": 3, "f6_rating": 2.7777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposer is suggesting to support locals accepting ADA payments. He plans on starting with plume wine, which is a Japanese liqueur. This provides a connection between japan and Cardano. This proposal does not really imply to promote catalyst onto Japanese community to encourage them to participate but it stimulates the ecosystem by providing currency flow on the blockchain.", "q0r": 4, "q1": "The team behind this proposal consists of 2 people, Ranket and Makoto. I assume both of them are Japanese given that the original proposal is in Japanese. However, we are not provided with evidence of relevant experience on the team, They state that one of them already supports the Kittamu project which seems feasible. we get a rudimental roadmap explained in a 3,6,12 months format but no real details about what the plan holds are explained. It would be advised to give more details about how you are marketing this in the region and how to plan on establishing a selling way for the Kittamu project?", "q1r": 3, "q2": "Since we have no roadmap or background information it's hard for the community to follow the progress of this proposal. We are provided with a budget breakdown so we know where the funding would be used, but this does not go into detail. How do you plan on providing ADA for distributors? Will you just be handling this out or would you help them with setting up their wallets and transferring the funds? The team has a good idea and this could become a good product but we are missing to much information to assess the progress of the proposal.", "q2r": 2, "assessor": "z_assessor_471", "no_vca": 21, "ne": 4, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "The idea of ​​the proposal is good, it is aimed at getting ADA widely used in Japan, but it does not seem suitable for this challenge. While this proposal presents an interesting problem, it does not provide a valid solution. Proposal does not solve the problem. You can try it with other challenges", "q0r": 1, "q1": "I disagree that the information herein is sufficient to gauge the progress and success of this proposal. It seems that the proponent was very enthusiastic about this proposal, however, unfortunately it is up to the challenge so I can't vote it up.\r\nIf you go ahead with the fund, I recommend that you provide a full profile of the proposed participants later, so that the community has a basis to judge whether your proposal is viable. Don't give up because your suggestion is very good\r\nIt would be better if the proponent had a list of potential future risks and challenges. It demonstrates the promoter's enthusiasm and understanding of the subject matter, increasing our likelihood of trusting you.", "q1r": 1, "q2": "A more robust roadmap with deliverables would be helpful to completely quell any concerns about technical and time constraints that the project might face. The timeline here is quite general, needs more detailed explanation\r\nIt lacks some key details that allow for measuring progress and success. Recommendations provide clear milestones, but no KPI data is shown\r\nThe budget given is very general and therefore I cannot say whether it is suitable or not. Need to analyze specifically what these money will do", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 19, "ne": 3, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The problem of limited use of ADA for shopping and the solution to bring in new users of ADA is clearly depicted. \r\nThe proposer seeks to start from a particular community and extend the block chain education and use of ADA to other areas. They mentioned that current users are over 2400 and this leads to benefitting the Japan economy. The proposer mentioned that they seek to promote sales in their trading, and address the challenge of price fluctuation by the use of ADA in payment.\r\nThe proposal mentioned that the future value of ADA will be regarded as universal and the benefits of accepting ADA will be superior. This is a positive impact of cardano on the Japan community.", "q0r": 4, "q1": "The proposer, Ranket and team are experts and won funding in Fund6 for the Kittamu project in Japan which started to educate the community in Cardano block chain. \r\nWith their plan of one year broken down to 3 months, 6 months and 12 is quite feasible and can be implemented successfully. Contacting people, establishing them, introducing the use of ADA within the stated months is quite implementable.", "q1r": 4, "q2": "The time span and plan as explained and with assessment above all point to the fact that this proposal can be audited successfully. Within the specific months and the task to be monitored is spelt out. The budget is reasonable and can be audited easily. Quite a good proposal that can connect the Japan community well.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "Le prix réduit produit par Catalyst soutient le cas d'utilisation de l'ADA, la nouvelle méthode d'appel et l'effet d'entraînement pour les nouveaux détenteurs potentiels de l'ADA.", "experience": "Nous sommes les membres de la communauté Cardano Japan. L'un des membres soutient déjà le projet Kittamu, qui explore les cas d'utilisation de Cardano."}