{"id": 383421, "author": "jtrube", "title": "Tokyo Cardano Summit", "url": "https://cardano.ideascale.com/a/dtd/383421-48088", "category": 26238, "amount": 25000, "description": "L'intérêt des Japonais pour la crypto et la technologie blockchain est croissant, mais beaucoup n'investissent pas encore activement ou ne participent à aucune communauté.", "funded": 2, "upvotes": 141788746, "downvotes": 5284717, "votes_result": 136504029, "votes_cast": 535, "f6_no_assessments": 11, "f6_rating": 3.575757575757576, "videos": [], "media": [], "f6_assessments": [{"q0": "Je pense que la proposition est directement liée à l'objectif du défi. Grâce à la foire en ligne, nous fournissons des informations sur l'univers de la cryptographie d'une manière gagnante et éducative. J'ai vraiment apprécié qu'ils aient déjà apporté l'idée avec une identité visuelle. Le public visé est celui des Japonais qui ont déjà entendu parler de ces questions, mais qui n'ont pas assez d'instructions, au point de faire confiance à ces technologies et donc d'adopter Cardano ou de participer activement à des projets comme Catalyst. J'ai trouvé cela très positif car l'auteur de la proposition a fait plusieurs recherches pour prouver son point de vue, c'est-à-dire que comme il est nécessaire que de telles campagnes soient promues, il souhaite que la \" graine \" de la blockchain et de la crypto soit déjà plantée dans le pays (par exemple, certains commerçants et entreprises adoptent déjà comme technologies), il est maintenant nécessaire de conduire cette vague. En effet, le Japon est un pays qui se distingue beaucoup en matière technologique, et si là-bas l'adhésion de nos crypto-monnaies et blockchain devient une habitude, Cardano aura une croissance exponentielle, et cette proposition fonctionne bien en plus de cela. En d'autres termes, par rapport à l'impact que cette proposition va provoquer, elle est sans aucun doute très positive et correspond pleinement à ce que le défi cherche. En ce qui concerne le financement, il est compliqué pour les auteurs de demander pour une seule proposition la moitié de l'argent alloué pour ce défi. Malheureusement, cela rend cette proposition très compliquée à financer, bien que l'idée en elle-même soit géniale et que les résultats possibles correspondent à ce que nous attendons pour le défi. Si la valeur est réajustée, elle sera beaucoup plus adaptée.", "q0r": 3, "q1": "L'équipe est un duo avec des antécédents pertinents et intéressants, mais je ne sais pas s'ils sont prêts à diriger ce projet, ils n'ont montré aucune sorte de connexion avec l'univers Cardano dans leurs descriptions. Ils nous fournissent une courte description de qui ils sont (cette description pourrait être plus détaillée), un site web qui démontre déjà certains de leurs travaux et nous donne des exemples de certaines marques pour lesquelles ils ont travaillé. En ce qui concerne le pas à pas qui permettra de réaliser ce projet, je l'ai trouvé très superficiel. Il y a peu d'informations sur ce qui se passerait dans 3, 6 et 12 mois, nous avons même réussi à avoir une idée de la façon dont le processus serait ainsi, mais pas une compréhension profonde qui ne serait atteinte qu'avec la présence de détails. De même, la répartition de l'argent a été faite de manière relativement superficielle, le montant total est divisé en plusieurs parties, mais seul le sujet \"gestion de projet\" est mieux expliqué. Je pense que, malheureusement, ce sujet de proposition a laissé à désirer à plusieurs égards, j'aurais aimé que les auteurs clarifient leur rapport avec le monde de la cryptographie et surtout avec notre blockchain et qu'ils fournissent plus de détails à la fois dans la partie script et dans la partie division financière.", "q1r": 2, "q2": "L'auditabilité de cette proposition est insuffisante. La seule chose que les auteurs fournissent pour suivre l'évolution de ce projet serait le nombre de participants/visiteurs des événements. Mais il est nécessaire d'aller plus loin. Je suggère qu'un membre de la communauté, qui vit à Tokyo, participe à la foire et prépare ensuite un rapport sur la façon dont les choses se sont passées, afin de le présenter plus tard à la communauté. Les auteurs eux-mêmes pourraient établir une certaine connexion avec les participants à l'événement, afin de comprendre comment, après les événements, ils se sont impliqués dans la communauté cryptographique. Si ce projet a réellement suscité leur intérêt et leur curiosité pour étudier ces technologies, investir dans la crypto, adopter l'utilisation de NFT, participer à Catalyst, etc. Je pense que les auteurs pourraient également créer des infographies transmettant les informations qui nous permettraient de comprendre si les objectifs du projet ont été atteints, puisqu'ils font déjà preuve d'une grande maîtrise dans la partie graphisme. Je pense donc que l'audibilité ici reste à mieux construire, c'est une proposition très coûteuse, ce qui renforce encore l'urgence d'être suivi avec précision et fréquence.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 22, "ne": 14, "ng": 6, "nfo": 2, "vca_o": 2}, {"q0": "C'est une proposition indispensable pour l'avenir. Les proposants veulent montrer Cardano dans toute sa gloire mais nous ne sommes pas encore prêts. La raison pour laquelle cette proposition est pour l'avenir est qu'il n'y a pas encore beaucoup à montrer de Cardano. Les DApps qui sont en ligne sur Cardano sont limitées, les créateurs de contenu NFT de premier plan sont également limités, mais nous sommes en pleine croissance, c'est comme un pot refoulé qui attend d'exploser. En effet, les proposants ont l'intention de créer leur propre NFT, mais sans construire une communauté, ce NFT n'est qu'un NFT. Il n'a pas de valeur sociale contraignante. Il n'y a pas d'objectif derrière lui, si ce n'est de commercialiser Cardano. Plutôt que de créer un NFT, travaillez avec la communauté Cardano. Il y a des artistes ici, il y a des histoires de belles souffrances qui attendent d'être racontées, il y a des communautés passionnées qui se battent chaque jour pour réaliser leurs rêves. Bien que cette proposition permette effectivement de présenter Cardano à sa clientèle, l'effet de masse recherché par l'auteur de la proposition pourrait être manqué. Je recommande vivement aux auteurs de la proposition d'être patients et de se rapprocher de la communauté japonaise de Cardano et de la communauté en général. Patience, attendez, puis livrez ce kesi giri qui tue. Votre heure viendra.", "q0r": 3, "q1": "Après avoir parcouru tous leurs liens LinkedIn, tous leurs messages sur les médias sociaux Instagram, la majorité de leur site Web, il s'agit d'une équipe d'individus de grande valeur et très compétents en dehors de l'écosystème Cardano. C'est un excellent indicateur pour l'écosystème Cardano, qui attire de plus en plus l'attention. Ils ont travaillé avec de nombreuses marques de premier plan, notamment l'agence YF. Eggworm pourrait être tout aussi important, mais d'après les mesures des médias sociaux disponibles, il est derrière l'agence YF. Néanmoins, les deux entités ont une équipe et un portefeuille solides derrière elles. Je suis assez confiant dans le fait qu'elles seront à la hauteur de leur future proposition. Le budget fourni est clairement ventilé, bien que seulement avec un post adjacent et non un plan d'action détaillé. Le calendrier présenté d'un an est logique et, étant donné les ressources humaines à leur disposition, il est logiquement réalisable. Il est un peu surprenant qu'ils n'aient pas pris en compte le risque et le défi auxquels ils pourraient être confrontés en organisant ce type d'événement. Il est fort probable que ces deux (2) entités n'aient pas suffisamment étudié leur clientèle cible. N'hésitez pas à consulter les tonnes de vidéos de la réunion publique sur la chaîne YouTube de IOHK, les vidéos du sommet Cardano également sur la chaîne YouTube de IOHK et à rejoindre le canal Discord de Project Catalyst pour vous faire une idée de l'activité intense de l'écosystème Cardano. Encore une fois, soyez patients, établissez d'abord des relations.", "q1r": 5, "q2": "Il y a 2 (deux) sections de feuille de route. L'une présente la décomposition étape par étape de l'événement, tandis que l'autre présente les plans généraux de mise en œuvre avec les jalons. Les indicateurs clés de performance (KPI) sont également disponibles dans 2 (deux) sections, l'une est une section KPI en soi qui ne peut pas être mesurée car il n'y a pas de métriques, tandis que l'autre est intégrée dans leur feuille de route. C'est une série de succès et d'échecs avec leur proposition en général. Je pense qu'ils devraient également se rapprocher de l'école Catalyst pour apprendre comment créer et soumettre une proposition solide. Si les proposants sont trop occupés, ils peuvent regarder les différents ateliers de l'école Catalyst qui sont sur YouTube. L'énoncé du problème et la solution sont bien pensés, ce qui fait qu'ils sont bien interconnectés. Pour le proposant, intégrez-vous davantage à la communauté, votre proposition et vous-même en tirerez profit.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 22, "ne": 12, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "The team proposes to set up a virtual summit for the japanese market/ community. The proposal states that the intended audience is beginners and the summit wants to display a variety of usecases for blockchain/crypto/ Cardano and show things that are \"cool\". The term \"cany popup\" sounds interesting and this might be interesting for other projects to find out about this concept and to also use \"visually appealing\" ways to display information and maybe educational content.", "q0r": 5, "q1": "Behind this proposal is an agency that is specialized in brand-marketing. This makes it very likely, that the team will be able to set up a summit and connect it with Cardano and blockchain. However, the information provided in the proposal is lacking clarity and content. The word \"cool\" is used too often and should be substituted with examples to demonstrate that the team has a wide knowledge-base of the Cardano ecosystem and the blockchain technology. The team gives a broad overview that it intends to focus on merchandise, NFTs, but also about blockchain technology, developers and futurism. While this might be a good starting point, the team did not provide relevant information on the content of the summit at this moment. The roadmap is a good example, as the first sentence reads \"complete planning, preparation and launch within 3 months\" but it does not give any indication on what content they are planning on doing. I think, mostly, that the team has a strong marketing background and so it points towards a fun branding event that they might be planning, which could attract and onboard new users for sure. ", "q1r": 3, "q2": "The roadmap is relatively broad and does not include some necessary information about possible contributers and how to make the process transparent and auditable for the community through github or discord or statistical tools that would be able to audit the program. I´m not sure and the proposal does not mention if the team is already active in the Catalyst/ Cardano/ crypto space and has a following that would be the targeted audience for their summit, or if they have to plan for outreach and marketing from scratch which would make the intended KPIs more difficult to achieve. It would have been a good information to add to the proposal. The budget is broken down well and would be able to cover all parts of setting up a summit. ", "q2r": 4, "assessor": "z_assessor_19", "no_vca": 24, "ne": 9, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "This proposal meets the challenges very well. It clearly addresses a possible issue in the challenge. By creating a hybrid event, this establishes awareness of the Cardano ecosystem in Japan. By including talks of developers and gaming this event can address a large group of people who can mean a lot for the ecosystem.", "q0r": 4, "q1": "The proposers give some information about themselves. We know that they are the creator of Eggworm, which has a website that is included in the proposal, and a brand designer as background who is now a director. Business wises this proposal has solid team members. However, we are missing information about their other team members. I think a bit more exposure to this network was necessary. The budget breakdown is missing information. A clear breakdown is mentioned for what they need the funding for but there are no numbers and statistics given. How much do you need for the design, ART, management? These are all clear budget-consuming parts of the proposal but the proposer does not explain the amounts needed for these.", "q1r": 4, "q2": "For auditability, we are provided with the essential details. The proposers have a clear understanding of what they plan to do and how they will manage this. The roadmap gives insight into what they are going to do after funding is secured. The roadmap also gives a good baseline for follow-ups. KPI's that are offered are relevant to the proposal and critical to address after the summit is done to see if the goals are reached and where refinement is needed.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 20, "ne": 4, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "This proposal aligns with the challenge as it'll be an opportunity for people who are interested with Cardano to talk about, but also a way of attracting new one's, since interest to crypto currencies in growing in that country as mentioned by the Proposer.", "q0r": 5, "q1": "The proposal has a highly chance to be successful, sine it's focusing on promoting the crypto currencies, the blockchain, and the Cardano ecosystem in Japan through an online tools & information, but also a live event.\r\nHowever am questioning  myself about the budget amount, which is half of the challenge proposed budget. Being 11 proposals in this challenge, it may seem unreasonable to allocate half on that amount on one .\r\nAlso, I would like to see the input form current Cardano & Catalyst community members to support this proposal and take on some tasks as volunteers to reduce the budget cost.\r\nAn idea like this will really help promote the cardano. Touch on the budget may allow the vote for this proposal, and for that think on implementing this by phases on different Funding cycle. \r\n", "q1r": 5, "q2": "The community may follow the progress through what will be realized : online presence: produced, youtube video, and the live event.\r\nThe KPI and a realistic road map are presented. ", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The Tokyo cardano summit will increase exposure to Japanese community by introducing an online trade fair event suitable for beginners under the theme of Candy pop up. It fits within the challenge of connecting to Japan community well. While the pop art culture theme is very creative but to dispel the opacity of blockchain and crypto currency some other themes should be considered. The execution of the proposal should adapt to the local sentiment.", "q0r": 4, "q1": "The proposer team is very well experienced as event organizers and brand PRs (eggworms). While the number of attendees and views are good KPIs, there should be additional measures that quantify local adoption. Also the cost of equipment is a fixed cost, it would be a good idea to elaborate more in term of what they are, what is their usage in this event and the future usage for the event.", "q1r": 4, "q2": "To audit this project, more information is needed as some costs are not fully elaborated. The Japan cardano summit is a great idea for the Japanese community but the proposal needs to be delivered with clarity as it supposed to deliver the full impact and promote Cardano in Japanese perception. ", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "There is clarity in the problem description and the proposed solution. Developed and produced an online tradeshow in Japanese, showcasing the most exciting things Cardano has to offer, appealing to beginners.\r\nThe proposal is geared towards helping the Japanese community to interest and adopt Cardano. Proposals fit the challenge.", "q0r": 4, "q1": "Despite the foregoing information about the team's experience, there are no sources to attest to the team's qualifications. The team is described as having experience in various fields, but not related to Blockchain technology. In order to increase the credibility of people, I suggest that the proposal needs to provide more information to check\r\nIt would be better if the proponent thought of a list of potential risks and challenges. To increase the probability of success of this proposal.\r\nConsidering these things, I do not think this proposal will be successfully implemented, I believe it requires more work, a clearer roadmap, a more detailed budget as well as a team. Team of experienced people", "q1r": 2, "q2": "A roadmap with discrete steps is given, there is a proposal to give a roadmap with timelines of 3, 6,9 months but also general, not divided into phases.\r\nRecommendations that mention KPIs will be based on the number of attendees and the number of visitors to the events. Can be easily checked because of KPI with timeline\r\nIt is a relatively high cost and without a clear and detailed plan it is difficult to see how feasible it is. The proposal requires half of this challenge, as the budget requires quite a bit, I need to know more about how to allocate capital", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about developing and producing an online trade fair in Japanese, showcasing the coolest things Cardano has to offer, appealing to absolute beginners. This is an interesting idea. The problem is clearly described, and explained in detail. The solution is clearly defined, supporting with convincing arguments and external links. As a result, a clear impact on the Cardano ecosystem can be seen. Therefore, based on the given information, I strongly agree that this proposal effectively addresses the challenge, I can give it with a score of 5", "q0r": 5, "q1": "Team profile is fully and clearly described [in attachment] that shows suitable ability, experiences for developing and producing such an online trade fair, however, each member's profile should to be provided [be external links,...] for verifying. The budget is given with structure but without explanations of calculation base [ex: how \"Project management\" costs  $6,500,...]. Risk (and mitigation) is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal is written in a scientific way [in some aspects], at least in the way that research links are provided along the way. Team profile is fully and clearly described [in attachment] that shows suitable ability, experiences, however, each member's profile should to be provided [be external links,...] for verifying. Besides, the information provided in the attachment does not look like KPI/metric. Instead of KPIs which are specific numbers, some kind of direction is provided, the proposer should reconsider this. The budget explanations of calculation base and Risk (as well as mitigation) should be provided.\r\nTherefore, based on the given information, I can agree with this proposal's auditability, I can rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 19, "ne": 5, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to have more online trade fair in Japanese language to develop and grow their interest in crypto and blockchain technology. They want to take advantage of the increasingly positive climate in Japan, and produce a campaign of hybrid events that will inform, entertain and motivate. The challenge is well addressed.", "q0r": 4, "q1": "The team is made up of experts who are designers, developers, marketers and over 10 years event production and content creation in Japanese markets such as Google, Porche, Ralph Lauren, etc. and they are capable of implementing the proposal successfully. The plan outlined, among others, online events; talks by developers; Art and NFT exhibitions, etc. to make implementation successful.", "q1r": 4, "q2": "The road map is clear for 9 months work schedule detailed in the proposal. The budget is well broken down and comprehensive. for effective auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "As my reading, the proposal states that it aims to organize a virtual event which is a intro to Cardano and Catalyst. However, I cannot find any Cardano contents in the KPIs, roadmap, as well as in the cost. I highly recommend the team should re-consider the success of the proposal (and milestone as well), it needs to show how to add value for Cardano community more clearly, rather than (just) number of attendees the live event and number of views. For example:\r\n-\tNumber of attendees\r\n-\tNumber of feedback from attendees\r\n-\tNumber of attendees that become active community advisors\r\n-\tNumber of attendees that become proposers.\r\n-...", "q0r": 2, "q1": "The team describes clearly their experience of creation content in the Japanese market and provides link as evidence. However, I expect the team's experience and skills which engages in Cardano ecosystem for a successful Cardano event implementation.\r\nI would recommend the team should add more details about Cardano contents (in details) in the plan. \r\nBudget is outlined clearly and broken down into identifiable items. However, $25000  (=1/2 total budget of the challenge) is not reasonable since the impact of the proposal is limited.", "q1r": 2, "q2": "As the roadmap and milestone focus on the number of attendees and number of viewers, the proposal is easy to be audited. However, (again) I highly recommend the proposers should make it more 'Cardano' because of the Cardano community development.", "q2r": 3, "assessor": "z_assessor_714", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "I think it is effective. There are many ADA holders in Japan, but many of them have little involvement in the community. Therefore, it is necessary to hold an event to activate their involvement. However, I don't think it is an issue that needs to be resolved immediately. In conclusion, I give a rating of 4.", "q0r": 4, "q1": "The feasibility is high. They have excellent team members, which can be understood from their work. Also, they are foreigners but have a good understanding of the situation in Japan. But I don't think there are enough issues to solve to demand half the budget for the category. In conclusion, I give a rating of 3.", "q1r": 3, "q2": "The auditability is high. Roadmaps and KPIs are also clearly set. However, the general approach is not sufficient to attract the Japanese community and Japanese ADA holders. If you write it more concretely, it will be easier to get approval in the next Fund. In conclusion, I give a rating of 4.", "q2r": 4, "assessor": "z_assessor_867", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "Développer et produire une foire commerciale en ligne en japonais, présentant les choses les plus cool que Cardano a à offrir, en attirant les débutants absolus.", "experience": "Plus de dix ans de production d'événements et de création de contenu sur le marché japonais pour des clients tels que Google, Porsche, Ralph Lauren, etc."}