{"id": 366916, "author": "", "title": "Spanish News, Insights, Onboarding", "url": "https://cardano.ideascale.com/a/dtd/366916-48088", "category": 26111, "amount": 6200, "description": "日常生活に必要なカルダノの教育やリソースは、どの言語でもほとんどありません。スペイン語を話す人にとっては、その差はさらに大きくなります。", "f6_no_assessments": 7, "f6_rating": 4.714285714285714, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is to convert an existing library of Cardano information into Spanish along with continuing new Spanish content for the next 6 months. For the relatively small budget this is a great project that could become a great resource for the Spanish community.", "q0r": 5, "q1": "The proposers have already have website and a back catalogue of content to convert, and the language skills to do the translation. They have the expertise to deliver this project which is well set out with milestones and goals. ", "q1r": 5, "q2": "The project has clear milestones set out which against which progress can me audited. In addition to the delivery of the content, they have set a success metric based on google analytics of usage of their content in Spanish speaking parts of the world. It might be nice to set some goals on what sort of user numbers they would view as success for the project to be compared to.", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "- It's a great idea. I am not a native english speaker and, since the Cardano is still embryonic, it is quite difficult to find materials in other languages (although I am starting to find some materials in Spanish). And the plan to develop alternative ways to propagate the content (audio, video, etc) is essential in order to reach more and more people.\r\n- One point that I am not sure about is the scalability. As the community grows it is more probable that the quantity of content created grows exponentially, and since there are only two people doing it, although you talk about Spanish community participation, I imagine if this is enough.", "q0r": 4, "q1": "-\tOne point that caught my attention is that you ask $1500 to translate 20 existing articles, however you've fixed a words price. I'm wondering if that will be enough or if you will stop if it pass the total words funded (10K words).\r\n-\tActually, all the metrification is quite complicated. How are you going to choose the article, by its impact to the community or by its total number of words?\r\n-\tAfter the 6 months period, how will this project continue, how are you planing to be funded in order to translate more videos, articles, etc? Since you're asking for these values, how are you planing to keep motivating people to participate and creating content in the website? Are you going to continue without fund?", "q1r": 3, "q2": "-\tI know that the release of the contents could be used as milestones, however it could be added in the actual roadmap, using the dates or weeks that you intend to do it. \r\n-\tOne point that should be added are some metrics of success. Since it is easy to know how many clicks and the traffic in the website, this information should be added to evaluate if the site is being used, which format is being more requested, what kind of content they're reading, how many people are in, etc.", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 11, "ne": 7, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The concern of this proposal about making Cardano content and news accessible for lay people is a big need because many times, we don't have only the language as a barrier but also the technical terms and information in general. There is a big risk of Cardano be a world where only people who know English, programming and cryptocurrencies have a place - and we must fight this risk is we really want to generate a huge impact. Despite that, considering this proposal, how much scalable is it thinking of only 1 person translating the content? Isn't necessary to think about increase de amount of articles and news translated per week aiming to produce even more impact? \r\n", "q0r": 4, "q1": "The co-proposers put the ideas in a understandable way, mention the price of each step and explain the proposal step to step. As this proposal is about only the launch, I really think the requested amount (USD 6200) is enough and its continuation could be covered by Cardano Community Support and Stake Pool Rewards.\r\n", "q1r": 5, "q2": "It's known that's nowadays there are many possibilities of metrics and performance indicators to measure the success of a website of platform (like numbers of views or likes). Considering that, I think it's easy to audit this project progress.\r\n", "q2r": 5, "assessor": "z_assessor_409", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposal identifies the problem of few educational resources about cardano for everyday people available especially in Spanish. The proposer presents the solution of translating materials published on an existing website into Spanish that produces educational resources for everyday people. The project objective is aligned with the challenge and the proposer presents indicators of success. The proposer presented a plan to keep the project sustainable after the Catalyst funding ends.", "q0r": 5, "q1": "The proposer has attached a link to its website with educational content about Cardano and with options for translations into other languages, demonstrating that it has the necessary experience to achieve the proposed objective. The budget is reasonable and makes it clear how much content will be delivered, facilitating the assessment of the proposal's success. The proposal offers a realistic timetable to complete the work. The proposal does not pose major risks to prevent its implementation.", "q1r": 5, "q2": "The proposer presents a roadmap with milestones throughout the development. It also presents metrics to assess de success of the proposal. The proposal is expected to have an impact on the community and present sufficient information to monitor the success of the work. ", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "In describing in the proposal that the main objective of the online library is \"resource for anyone who wants to learn what Cardano is, why they should care, and how they can participate\", the authors were right on target. This proposal perfectly meets the objectives of the challenge, taking relevant and simplified knowledge about the Cardano ecosystem to Spanish-speaking people. It's very positive that the project actually already exists, it's already happening. We are provided with the website link, which is very well organized, by the way, with a great interface design; and we are also told that there is already some content translated, as well as a team of translators into Spanish. When things are already underway even before funding is provided, it is a great sign that the project is consolidated and has a future.", "q0r": 5, "q1": "The authors seem to be well able to carry out the project, and have well-defined ideas in mind, as can be seen in the excerpt \"We are building a network of contributors who break down complicated technical ideas for everyday people, and provide relevant news in quick bites\". There are 2 people, an engineer and a teacher, and according to what was described, the engineer has many years of experience with Yrs Software & Cloud Engineering, in addition to Blockchain development, which are essential knowledge for the consolidation of this project. Although everything is apparently right, it would be even more interesting if we had access to their social networks, such as lindekin, for example, to see exactly what their trajectories are like, where they graduated, worked and so on. Despite this, the fact that the site is already available shows us the main thing: they know how to do what they promise. In this way, there is a lot of credibility with the authors. Regarding the roadmap, here we have a good detail on how the project will happen going forward, providing a solid vision for us, readers as a whole, and also allowing the community to follow the progress of things, as I will detail in more detail below.", "q1r": 5, "q2": "Regarding the explanation of how the idea will be put into practice, I found this proposal to be exemplary. It meets the 3 requirements that I always look for to fully understand how things will happen next. First, the authors list, in a direct and didactic way, each of their minor goals. Small actions that need to be done for the ultimate goal to be achieved. Afterwards, we have a detailed explanation of how each part of the funding money will be used; each part has a destiny, and we understand very well what they are. And for me, the authors provide us with information about the temporal notion, that is, what they intend to achieve in a matter of 1, 3 and 6 months. There is really nothing to criticize here, everything is excellent in this part of the proposal.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 11, "ne": 8, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "They have a clear plan to translate their existing success full website into Spanish. This would be a great resource for the Spanish community.", "q0r": 5, "q1": "This proposal will be highly likely successfully implemented because the proposer/s have a well written plan, reasonable budget, many ideas with good reasons to back them up as well as experience in this area. Their plan has good reasons such as the fact that their is more people speaking Spanish than English.", "q1r": 5, "q2": "It will be easy to audit the progress because they have clear and concise steps in their plan. The proposer/s have stated what 'success' which is to have the same content on their website but in Spanish instead.", "q2r": 5, "assessor": "z_assessor_585", "no_vca": 11, "ne": 3, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "This is a great proposal, and spanish being one of the big native tongues out there and Crypto being really a big interest in crypto in the wider spanish speaking countries is very important to have Cardano being educational and marketed in that native tongue as well to increase mass adoption in that demographic.", "q0r": 5, "q1": "The experience is very clear and the plan of execution shows a great level of organization in delivering the proposed solution. Perhaps add and example video to highlight the process could incentivize more people to vote.", "q1r": 5, "q2": "The proposal has great kpis, stage by stage development and transparent use of funds. Good luck is a great proposal.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "カルダノの基礎知識、時事問題、新規参入者のための洞察など、オリジナルの教育記事やニュースをスペイン語で収録したライブラリーです。", "experience": "14+ Yrs ソフトウェア＆クラウドエンジニアリング、ブロックチェーン開発、ビジネスコンサルティング、世界の言語、テクニカルライティング、教育。"}