{"id": 366946, "author": "", "title": "French & Arabic resources &trainers", "url": "https://cardano.ideascale.com/a/dtd/366946-48088", "category": 26111, "amount": 12000, "description": "アフリカの起業家の多くは、最初の情報が英語で伝えられるため、カルダノに触れることができません。", "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a solid proposal for outreach in Africa to bring developers to Cardano and build materials in multiple languages and raise exposure to Cardano and blockchain as a career path.", "q0r": 5, "q1": "WADA in general and the proposers in particular have the experience and networks available to deliver on this plan. It would be nice to have more clarity on funding. Whilst the plan goes out to 12 months, the budget only covers 3 months. Is that the first three months of the plan? Is so, how will the rest of the project be funded?", "q1r": 3, "q2": "The proposal includes a detailed set of metrics and deliverables with associated timeframes which will be easy to audit. It would be nice to see some goals which would define success. I.e, what is the number or trainers developers they are aiming for at the end of 6 months? How many developers do they expect those to train by the end of 9 months?", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 14, "ne": 3, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "- This is an awesome idea. At first, I thought that it might be on the wrong challenge. However, training multilingual developers to allow them to create content and cooperate with entrepreneurs which don't speak English is amazing.\r\n- I have no idea how the African's countries in relation with English language, but I imagine it might be a bit like Brazil, which it's not the majority of the population which speaks English. Therefore enabling people to dev in it's own language and obligating the trainees to train  is a good starting point.\r\n- It's quite scalable as well, since the course is going to be in English, therefore, the more language the better.", "q0r": 5, "q1": "- One point that I'm imagining is that the marketing might be thought differently to each country and, therefore, it might get hard. I wonder if the non-English speakers devs might not know how is the best way to advertise in their country and this might be a problem. Since this is a crucial point in this project (it'll worth nothing if the devs can't create awareness about DLT in their countries to offer the service), it might be good to add a marketing specialist in the team. That said, maybe you'll need more money to make this done.\r\n- How are you planning to continue with this project after the funding? How much the course will cost and how many students it must have to cover all the costs? Imagining that the currency in some African's countries are not favorable compared to dollar, it might be hard to find a worthful value to them.\r\n", "q1r": 3, "q2": "- I think it's pretty auditable since we'll be able to see the attendance and the number of different languages involved in the course (info that should be displayed in the platform together with the countries attending (portugues from Portugal is a bit different if compared with Brazilian one, e.g.).\r\n- The only point that might be hard is the individual marketing, since it must be done in each country to each specific public.\r\n", "q2r": 4, "assessor": "z_assessor_25", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "This proposal identifies a big problem within the challenge which needs to be solved. I hear lots of talk about banking the unbanked, but we keep making decisions without consulting the unbanked. This translation plan begins to build a bridge. I would love to see support for an extension to the plan that would increase the translation to Swahili, Amharic, Zulu, Shona, and Portuguese. ", "q0r": 4, "q1": "Linkedin profiles would help voters verify whether they are capable of developing and implementing this solution. ", "q1r": 4, "q2": "The proposal team provides adequate documentation. Milestones are clearly set out and voters would know what to expect.", "q2r": 4, "assessor": "z_assessor_311", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "The proposal was able to identify the problem of the difficulty of access to Cardano by many Africans due to the language barrier. The solution was to train multilingual developers and create materials in their native languages. The proposer presents metrics for evaluating the impact of the proposal. The purpose of the proposal is aligned with the challenge. The proposal does not have any financial planning beyond the Catalyst so it is not possible to assess whether it will be financially sustainable in the future", "q0r": 4, "q1": "The proposer presented relevant experience to implement the project. The budget was very detailed and seems reasonable for the proposed work. The suggested deadline for the proposal is realistic. The proposer presents a plan of how the training and re-creation of materials will be carried out. The proposal does not offer greater risks that prevent its implementation. ", "q1r": 5, "q2": "The proposer presented a roadmap and milestones in the development of the proposal. It also presented key metrics to enable proposal auditability. The proposer provided sufficient information to assess the success of the proposal.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "They have stated that they want to be able get more Italian, french and Arabic speaking users in their network. This was well-written and had a good plan and was detailed.", "q0r": 5, "q1": "They already have a network but they want more French and Arabic speaking users/employees to work for them. Their plan of how to get these people to join is clear and they have already started getting more individuals. ", "q1r": 5, "q2": "They have a clear and concise plan showing what they want to do and how they will get the individuals. One thing to maybe improve on would be some more information on how they going to get the individuals, just some more details. It will be easy to audit the success as they have a plan and set of goals.", "q2r": 5, "assessor": "z_assessor_585", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "マルチリンガルの開発者を英語でトレーニングし、フランス語とアラビア語を中心とした母国語で教材を作り直す。", "experience": "カメルーンからのトレーナー／チーム：マルチリンガル（英語＋フランス語＋イタリア語） スーダンからのトレーナー／チーム：バイリンガル（英語＋アラビア語"}