{"id": 367046, "author": "", "title": "Pull strategy for Spain", "url": "https://cardano.ideascale.com/a/dtd/367046-48088", "category": 26111, "amount": 2000, "description": "スペイン社会はウェブページを翻訳するのに十分なリソースを持っています。スペインでは、誰か教養のある人がカルダノについて話してくれることが必要です。", "f6_no_assessments": 10, "f6_rating": 1.5333333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is to conduct a tour of Spanish universities and talk about Cardano. There is little detail on the plan however and how it would be focused, what it would present and who the target audience specifically is.", "q0r": 2, "q1": "The proposer only claims to be a good public speaker. Do they have experience in the topic of Cardano and Blockchain? What will the budget be spent on? How many lectures will be given at how many universities and over what time frame. Please provide more evidence of expertise on the topic, content which will be delivered and a timeline for when it will be delivered.", "q1r": 1, "q2": "There is no plan which can be audited here other than did the proposer give some talks at some Spanish universities. How many universities and when? What is success? How many people will you reach? What further interaction with Cardano will they have and how can we measure it?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 13, "ne": 2, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "Valid idea but value proposition not clear and no defined plan.It would be nice to give na overview on what information will be visited, how many students you intend to reach, which univerisities will be visited and what kind of guaretee will be given to students. how to guarantee non english speakers impacted by this iniative wont back down once they see nearly everything is in eglish and not spanish? The name of the proposal refers to strategy but what is the strategy here in the end?\r\nIts also important to engage with local staff from this univerisites as lecturers, professors, administrators, students unions/representative, in order to create a commnity.\r\nIt would be nice to have a proper schedule also. Also consider other educational places in addition to only universities.", "q0r": 2, "q1": "only one person with very vague qualifications. No plan or budget breakdown. It would be nice to have a fuller description on what kind of experience the proposer has with public speaking and cardano how they can penetrate in universities world. No budget breakdown (it could be said how much it is intended to be spent in each university, how much in travel expenses, etc.) or a defined plan (it should be mentioned the way the universities are going to be chosen, what will be talked about, how to engage with students and everything brokendown by weeks/months)", "q1r": 1, "q2": "No kpi or milestone. It would be nice to have a roadmap and metrics to monitor the number of univerisites visited, how many students reached, how many of them engaged in Cardano becuase of this initiative (conversion rate), etc.", "q2r": 1, "assessor": "z_assessor_298", "no_vca": 10, "ne": 7, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "This proposal can have a good impact because of the interest of some specific courses in cryptocurrencies, for example the ones that teach programming. Despite of that, the proposal is very short and doesn't explains well how generate this impact. Furthermore, the proposal has the barrier of language for the Spanish students that get interested in Cardano world because of the tour but doesn't understand all the content produced until today because they're in English. So I think this proposal doesn't explain very well how to solve one problem and will come across with other barrier soon. \r\n", "q0r": 2, "q1": "The proposer doesn't give enough information about how the tour would happen neighter about how many universities participate. It's not clear how the proposal wil add value to the Cardano Ecosystem, what's the goal? There are no presentation of key metrics neighter step to step explanation about how the project will happen, even less about how it could continue after this tour. It's also missing the proposer knowledges description about Cardano and the exact issues that would be tracted on the tour. \r\n", "q1r": 1, "q2": "It's not clear the ways to audit this project. There is no separation of phases to make easier to audit the project.There aren't goals settled down to compare to what wil be done (how many universities will be visited? What courses will be contemplated? What is the estimative of students that will be reached by the tour?).   \r\n", "q2r": 1, "assessor": "z_assessor_409", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "There is no clarity in the problem statement. Draft proposal. There is not enough information for impact assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 11, "ne": 1, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "I think a speaking tour could be a great idea for growing knowledge and enthusiasm for Cardano in Spain.  However, I feel that creating specific \"scalable\" approaches would be more effective, reach more people, etc.  Perhaps a proposal to create such assets, e.g., videos, slide sets, exercises, tutorials, etc., along with a speaking tour to promote them and encourage engagement would better address the challenge.", "q0r": 2, "q1": "The proposer may be a great and engaging speaker, and have the ability to really generate enthusiasm and participation in Spain.  Unfortunately, however, the proposal does not contain sufficient detail for us to assess this.", "q1r": 3, "q2": "Some suggested ways to make it possible to audit the progress of the proposed project would be to specific accomplishments and engagements.  For example, create x video, y presentations, arrange and deliver z presentations in with w attendees, etc.", "q2r": 1, "assessor": "z_assessor_499", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "Proposal is vague.  How is this multilingual?  ", "q0r": 2, "q1": "What public speaking experience or marketing experience do you have?  How many colleges do you intend to visit?  Do you have contacts at universities or is this cold call?  Would any other venues be considered?", "q1r": 1, "q2": "No measurable success.  How many speeches would be delivered over what type of time frame?  How do you propose to report reaction to your work or engagement with Cardano?  ", "q2r": 1, "assessor": "z_assessor_521", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is a good idea and the proposed solution would add some value to the Catalyst community. I'm just not sure about how much value it would add. There is no real articulation of how the proposal relates specifically to multilingual resources besides the Spanish connection. Having said that a more detailed plan of what universities and content to be covered with projected attendances might cast a new light on the actual value of this proposal. ", "q0r": 3, "q1": "There simply is not enough presented in this proposal to assess the experience or skillset of the proposer(s) and whether they could deliver a quality project. It would have been good to detail a little more on the team experience in terms of knowledge of the Cardano ecosystem and perhaps even gaps in translation from English to Spanish that may exist. Further a plan that detailed the intended audience with the content that might assist multilingual resources would have been great. ", "q1r": 1, "q2": "Insufficient information was provided to assess this proposal any higher than 1 star. The proposer needs to review what they are hoping to achieve and detail that in a plan that advises how the budget will be spent and why that will add value to the community. There are no metrics/KPI's attached so that the success or otherwise of the project can be audited. The team would do well to seek out collaborations with community members as the scale and scope of multilingual resources has much potential to value add to the Cardano community.     ", "q2r": 1, "assessor": "z_assessor_53", "no_vca": 8, "ne": 4, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "A great initiative, the comments by @Olmansju covers most of the missing parts of the proposal.", "q0r": 4, "q1": "With no concrete plan, the chance of success is generally low. Try to add some milestones to your project.", "q1r": 2, "q2": "It is important for the community to audit proposals and measure their success. To audit a proposal, a list of deliveries and success criteria is needed.", "q2r": 1, "assessor": "z_assessor_543", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Did not understand the title \"Pull strategy\". More details needed of what to speak about and what trying to acheive. ", "q0r": 2, "q1": "no kpi provided nor credentials of the speaker. Is it common to go to universities to speak. does it pay money?", "q1r": 1, "q2": "none provided. no fund request breakdown.", "q2r": 1, "assessor": "z_assessor_562", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "They don't have a plan of how to achieve this, how are they going to speak about it, how will they get people to listen and  they don't explain what they will use their budget for. Next time the proposer/s should include these.", "q0r": 2, "q1": "Since they don't have a plan of how to reach their success it will be hard for them to succeed. If they don't have a clear a concise plan of how they will reach their goal it most likely won't work. Instead of just saying  that they want to carry out a speaking tour in multiple universities in Spain, should include their plan to reach the goal. The proposer/s does say they are a good speaker and that they are a marketing professional, so they have some experience in this area.", "q1r": 2, "q2": "This plan is great idea but it needs some more detail because the information provided makes it hard to audit as there is no plan, timeline, goals or metrics for success.", "q2r": 1, "assessor": "z_assessor_585", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "スペインのいくつかの大学を訪問し、大学生に質の高い情報と保証を提供します。", "experience": "私は人前で話すのが得意で、経験も豊富です。"}