{"id": 367616, "author": "", "title": "Multilingual Cardano Chatbot & KB", "url": "https://cardano.ideascale.com/a/dtd/367616-48088", "category": 26111, "amount": 28380, "description": "カルダノについて学ぶのに、英語は必要ありません。世界では、83％の人が英語を話せず、他の58の言語には2,000万人以上のスピーカーがいます。", "f6_no_assessments": 5, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "If this could be executed effectively this would be a great addition providing information about Cardano in many languages. There are two big questions. 1) What current sources of information about Cardano will you leverage o translate, as the project doesn't seem to have much planning around new content creation, 2) How well will these automatic content translation services work on potentially technical content in the blockchain space? \r\nWhat is really being gained here over users just applying Google Translate to anything that already exists on Cardano?", "q0r": 4, "q1": "The proposer has the knowledge to build the chatbot and knowledge base translation side of things. Do they also have experience in the content side (probably but not actually stated)?\r\nThe plan should include more information on what knowledge sources would be used for the knowledge base. There is also a lack of marketing plan. If this is built, how will users in the 58 languages find this resource? Should the budget not allow for things like Search Engine Optimization?\r\nIt is also not clear what is expected for the budget for \"Ingestion, Evaluation, and Translation\". 100, 200 and 1000 ADA per month split amongst all contributors. How much is expected to be contributed for those amounts?", "q1r": 4, "q2": "There is a relatively detailed timeline of deliverables against which progress can be audited. What is really missing though is is a plan for measuring how much the resources is used and how much impact it is having? It would be great to see some goals on visits to the KB and interactions with the chatbot and measure how much each language group is using it. It would also be nice to have some ability to measure the quality of the translations in each language. Could some spot audits on documents in each language be conducted to check they are correct. It seems a little dangerous to just through out some machine learning based translations without any checking on the accuracy of those translations. These accuracy checks could also be part of the auditing, but may required more funding.", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 14, "ne": 6, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "As a non-native English speaker I do agree that a scale mechanism to address translations in a more dynamic and automated way shall be reach.\r\nAs a technologist I also agree that a bot with an AI supported auto-translation service could really provide a good solution to address this challenge.\r\nThe integration channels though for people to be able to consume/interact with the bot and the ingestion and maintenance of the knowledge base are complex problems that I think the proposal does not address in detail. What the proposer wrote and it's criteria seems very valid and worth the experiment.\r\nI would suggest to interact more with other projects and veteran people from the Cardano's community to leverage existing APIs to access content and to define the integration piece better in order to make this project a success.", "q0r": 4, "q1": "The plan is clear and detailed and I do think it is feasible as it is worded, with specific general milestones. I'd suggest to get deeper into what success looks like in each milestone, as I don't see value oriented goals, just tasks being completed.\r\nThe proposal is based on a continuous service that consumes pay resources from Azure (which is OK) and proposes to pay the community regularly to produce refinement and QA for the auto-translator bot to learn (Which is also fine) but the project does not provides clarification on how all these costs will be sustainable after the time frame it covers with the requested funds. So I see no sustainability mechanism nor a business model indicated. I am guessing that the project aims to apply for further funding in next rounds, but that is not indicated or implied in the proposal and I see this as a major weaknesses to make this project sustainable.\r\n\r\nRequested budget for the tasks presented is coherent, though it is clear that more money will be required to sustain the project after the indicated period.", "q1r": 3, "q2": "Even though some general milestones are provided, no SMART metrics on how to measure impact and adherence to the challenge goal were provided.\r\nIf the project gets funded, I strongly suggest to work on those success criteria's ASAP so the project can be audited and provide clear indications on how it is addressing the issues that the challenge aims to solve.", "q2r": 3, "assessor": "z_assessor_288", "no_vca": 13, "ne": 3, "ng": 4, "nfo": 6, "vca_o": 1, "reply": "Assessor states that no sustainability model is present and that this is a major weakness. Assessor did not read or ignored the 'By the end of a year' section bullet point four \"- Establish KB as ADA-generating service to ensure sustainable project continuance beyond funding period\" which lays out an ongoing period of 6 months on which to work on sustainability. Furthermore Assessor agrees that milestones are provided but rates only a 3 due to the absense of 'SMART metrics'. SMART metrics are not part of the required elements or the AUDITABILITY rubric. "}, {"q0": "1. Using Natural Language Processing to translate is definitely a scalable solution as it automates the process and grants access to all the supported languages. \r\n2. Good that there is plan to involve the community to vet/contribute as that will create ongoing engagement and correct any machine translation errors.\r\n3. Knowledge Base and ChatBots while useful may not be a very interactive mode of communication. Could leverage on the existing IOHK KB hosted on Zendesk which from my experience with working on Zendesk in the past contains some integrated solution.\r\n4. Could consider the use of AI services hosted on Cardano to benefit the ecosystem and other interesting applications of blockchain.\r\n", "q0r": 3, "q1": "Has teaching and development experience in the NLP space which will definitely add to the successful implementation of this proposal. Project timeline and budget are also well defined.", "q1r": 4, "q2": "While there is a project plan, check points/UATs are not explicitly mentioned and not sure if the community would only be able to view after the planned public launch. Having some measurable metrics that tie back to the campaign objectives could also be included.", "q2r": 3, "assessor": "z_assessor_297", "no_vca": 11, "ne": 1, "ng": 7, "nfo": 3, "vca_o": 1, "reply": "The IMPACT rationale and IMPACT score are not aligned. Reviewer acknowledges the scalability of the solution, the quality of the plan, but then opines that 1) a chatbot would not be interactive and 2) Cardano-hosted AI services would be better. While #2 is a useful suggestion the review does not add up to 3 points. "}, {"q0": "The proposer has a well explained plan that states that they want to design a multilingual chat bot, create a Cardano related multilingual website and to make it easier for no english speakers to learn about Cardano. They have explained their budget and given a detailed timeline. ", "q0r": 5, "q1": "The proposer has lots of experience in this area as they already design multilingual chatbots and have over 10 years of developing experience. They also have a well-written concise plan that explains what they are doing and how and when they will do it.", "q1r": 5, "q2": "Since they have a timeline and detailed set of goals it will be easy to audit the progress. Their plan and experience also give them a good chance of success in their goals.", "q2r": 5, "assessor": "z_assessor_585", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge and is a necessary step to the mass adoption of Cardano across the globe. While the origination in English is to be somewhat expected, the ability of the ecosystem to grow beyond English-only speaking populations is foundational to acceptance. \r\nThe proposal also provides some significant benefit to the community by automating the process with a bot. The current reliance on human-powered translators is likely to face challenges over time and moving this work to a bot can help with sustainability. ", "q0r": 5, "q1": "Based on the experience included above it seems that the proposer has the relevant skills to implement the proposal successfully. The proposer could provide more information on their background and if possible links showcasing their credentials. While it can be taken at face value, including this content can strengthen voter confidence in delivery. \r\n\r\nThe plan is very well laid out and provides a concise path forward to implementation. Given the level of detail provided on the plan, if accurate, it seems very likely this will be implemented successfully. \r\n", "q1r": 4, "q2": "The information provided is certainly sufficient to audit the progress and the success of a proposal. I really appreciate the timeline as laid out by the proposer. The clear milestones and deliverables at each point make it easy for voters to know what to expect, and how to tick off milestones once achieved. This can also provide valuable correspondence for the proposer to update the community on progress. \r\nThe budget also seems reasonable given the level of work and timeframe. Perhaps the proposer could have provided a bit better of a breakdown to let voters know whether the prices provided are average, low, high? ", "q2r": 5, "assessor": "z_assessor_66", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "57種類の自動検出・翻訳された言語でチャットボットとナレッジベースを開発し、学習者と多言語コミュニティや情報を結びつけます。", "experience": "PhD Learning Technologies\n\n自然言語処理の大学院コースを担当\n\n多言語ウェブアプリやチャットボットの設計\n\n10年以上の開発経験"}