{"id": 367834, "author": "", "title": "Bring Smart Contracts to Vietnam", "url": "https://cardano.ideascale.com/a/dtd/367834-48088", "category": 26111, "amount": 29000, "description": "MarloweとPlutusを学ぶための詳細なステップバイステップの説明と実現可能な例は、ベトナム語ではありません。", "f6_no_assessments": 4, "f6_rating": 4.833333333333334, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=22974"], "media": [], "f6_assessments": [{"q0": "This seems like a good proposal by a group who are able to deliver technical smart contract documentation to the Vietnamese community. It would be nice to have some details on how big this community is so voters can compare to other proposals in other languages for what is a limited pot of funding.", "q0r": 5, "q1": "The proposers have the language and technical experience such that we can be confident they will be able to deliver this project. They have presented a clear plan with timelines and deliverables. ", "q1r": 5, "q2": "The presented plan and deliverables will make auditing of delivery of the proposal simple. It would be nice to see more metrics and goals around what success in this project is. How many users do you expect to reach, how many apps built etc. In addition to then having clear goals to judge success against, voters have a clearer idea on what impact this can have on Cardano as a whole. This project is asking for nearly 40% of the total multilingual funding to provide this resource to one language. It is important that voters can see how much impact will be achieved.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "This is a good model of how to effectively write a proposal for multilingual resources.  I would like to see this group expand to bring Smart Contracts to more languages.", "q0r": 5, "q1": "This group has plenty of experience to implement this proposal to the Vietnam people and I feel very confident that they will successfully execute their plan .", "q1r": 5, "q2": "This plan and the people behind it are very solid.  I want to see this plan implemented and further, I would like to see it expanded to help people in other languages as well.", "q2r": 5, "assessor": "z_assessor_385", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "This proposal intends to bring information on smart contracts in Vietnamese for easy access, which would be a way to promote the Cardano ecosystem blockchain. It's a solution to the challenge presented. \r\nIt'll allow people to have access to that information in their local language, and facilitate easy understanding of various technical concepts. As it's presented, I strongly agree with the proposed solution.", "q0r": 5, "q1": "The proposal is well detailed in terms of timeframe with all the phases, with action to be undertaken. The proposal objective is clear, which is to translate all available fundamental smart contract training materials in Vietnamese. \r\nThe proposer's team is composed by people with various expertise in programming and computer science, with a large experience in software building as showed on the resources shared.\r\nHowever, it would have been better to have an expert in translation as member of the team. And also think in developing some written material resources  for people who don't have access to the Internet, as sometimes it may be a barrier for a certain group of people.\r\nSpecify the area (city, town, universities, colleges) where the project will first start from, where the workshops, trainings and town halls will be taking place.", "q1r": 5, "q2": "The phases of this proposal are well defined, with all the activities to take place.\r\nAfter the 1 year during which the proposal is budgeted, what would be the sustainability strategy? It would have been important to mention that aspect, as it may slow down the success of the activities.\r\nThe audit method hasn't been mentioned, even though the main result of the proposal will be visible and accessible online through the website that will be created. It could have been necessary to specify the audit process as you think it would be done.", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "This proposal has a plan of how to get instructions on how to use Marlowe and Plutus but translated into Vietnamese, a timeline, an explained budget, lots of facts and reasons to support and back up their ideas. ", "q0r": 5, "q1": "Since they have a solid plan, timeline and lots of experience in this area it is highly likely that they will achieve their goal of getting instructions for Plutus and Marlowe in Vietnamese.", "q1r": 5, "q2": "Timelines and explained budgets make it really easy to audit the progress and success when trying to achieve the goal/s. The proposer/s are experienced in this area as they are blockchain users themselves.", "q2r": 5, "assessor": "z_assessor_585", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}], "solution": "テクニカルライターやPlutusの先駆者たちは、入手可能な資料をベトナム語に翻訳し、dAppsを作成するための実践的な例を増やしていきます。", "experience": "私たちはSPOであり、DevOpsであり、ブロックチェーンの技術者であり、Hewlett PackardやInstitutesの多くのプロジェクトで翻訳者として活躍しています。"}