{"id": 368463, "author": "", "title": "[Romania] Cardano Business Club", "url": "https://cardano.ideascale.com/a/dtd/368463-48088", "category": 26111, "amount": 9330, "description": "カルダノ ルーマニアの起業家コミュニティは全く発展しておらず、集まって価値を共創する手段を欠いている", "f6_no_assessments": 5, "f6_rating": 2.6, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a simple proposal to create and nurture a Cardano entrepreneurial community in Romania. It would be great to see more information on the impact this could have for Cardano as a whole given the limited budget of the challenge and the large number of languages and countries that will be competing for it.", "q0r": 4, "q1": "The proposer presents a relatively simple plan to create a community and host a discord server and run a number of events. He has the experience to be able to deliver.  It would be good to see some more information on how marketing will be conducted.", "q1r": 5, "q2": "A relatively simple plan has been presented enabling progress to be audited. This proposal could be improved by setting some metrics to measure success. Rather than just delivering a number of presentations and creating a email list and discord server, how many people will this reach? Can we measure how actively they are in the Cardano community? I.e. how much impact will this have on Cardano as a whole?", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "The proposer has identified a problem, but it doesn't fit challenge settings. The statement 'Cardano Romania entrepreneurial community is not at all developed and lacks the means to come together and co-create value' is vague and doesn't emphasize any real problem for Cardano ecosystem adoption in Romania. Entrepreneurial ecosystem in Romania has a decent maturity on how to create intrinsec value for businesses. Blockchain technologies use case is in its early stage of adoption in Romanian business ecosystem and there are businesses that monetize their output by accepting crypto payments/use (large venue events, utilities etc.) but none for Cardano. Possible question to ask when building a proposal's goals: What is the benefit of using Cardano ecosystem over any other mature blockchain? What are the constrains for adoption of Cardano ecosystem (legislation, audience education etc.)? What are the tools that have the potential to be adopted by Romanian business ecosystem (prioritize them)? and so on. Is better to start with simple goals and grow bigger with time.\r\n\r\nA viable direction to follow, based on the proposer experience could be 'Knowledge base & Documentation' (spread the word!)\r\n\r\nThe proposal doesn't clearly articulate how it will add value to the Cardano ecosystem.\r\n\r\nIs not clear what is the goal of the proposal: to bring businesses owners together or to bring businesses together with the help of Cardano ecosystem?\r\n", "q0r": 2, "q1": "The team behind the proposal has one member, with no evidence of necessary experience/skills (LinkedIn link is broken). The role of the member will be 'Cardano Evangelist' but with no evidence of qualifications for acting like one. Question the proposer should ask: Acting like an one-man-show will suffice to successfully achieve the goals?\r\n\r\nThe budget is outlined and is broken into identifiable items, but is seems that is not scaled properly, thus making the proposal unlikely to succed. 'create one annual national event for the entire Romanian business community - 2000 euro;' Entire Romanian business community has hundreds of thousands of individuals. How to bring them together with just 2000 euros? One viable audience could be the business community in a small/medium size town in Romania. And the budget for this type of events should be scaled up.\r\n\r\n'create an initial email distribution list for business people interested in developing Cardano blockchain and distribute monthly content in Romanian language - 600 euro' - the list is necessary to some extent, but what matters most is the impact of the messages transmitted via this channel of communications. (What it the outcome of this action - enrolling people to the discord server, buzzing new features of Cardano ecosystem? etc.)\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (What are the constrains in adopting the Cardano ecosystem tools in Romania? etc)", "q1r": 2, "q2": "No KPIs/metrics are defined to successfully implement the proposal (i.e. adding new members to the discord server each month (set a minimum threshold), keeping the server alive (people loose interest (this is a risk) abruptly if they are not convinced to stay). Inviting people to join a discord server without measuring the impact (how many ARE joining the server? how many enrolled are actively involved?) has no viable meaning.\r\n\r\nThe proposal is hard to assess based on the info the proposer has provided. The problem and the solution to the problem should be defined in an understandable manner for any outsider.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal ins't clear enough for the people who are assessing it be at least a little bit sure about its impact. Some numbers of the goals are missing and that overshadows the forecast of what can happen if this proposal become a real project.\r\n", "q0r": 1, "q1": "The budget could have been better explained and broken down into identifiable items. What kind of content would be shown in these local meet events? Numbers are missing about how many things would be posted in Discord, how many e-mails would be sent for how many interested people, etc. It's not clear if the idea is to make Project Catalyst reach these entrepreneurs or if it's only to join them. \r\n", "q1r": 1, "q2": "The numbers missing during the explanation of how the project would happen, make harder to audit. The proposer has to show the numbers that he has as goal to enable the auditing. Without these numbers, how can someone compare the goal number to the realized number (amount of e-mails that will be sent, amount of content that would be sent in Discord, amount of people the proposer wants to reach per month ou week using each platform of event, etc).\r\n", "q2r": 1, "assessor": "z_assessor_409", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal was able to identify the problem of the non-development of Cardano's business community in Romania. He also presented as a solution the creation of Cardano Romania Business Club to connect businessmen, but he did not specify indicators to assess the impact of the proposal. The purpose of the proposal is in line with the challenge. The proposal did not have any budget other than Catalyst to maintain the project so it is not possible to assess whether it will be financially sustainable in the future", "q0r": 3, "q1": "The proposer has attached a link to his linkedin indicating that he has the necessary experience to achieve the proposal's objective. The budget appears to be reasonable and has been well detailed. The proposer does not specify whether it has any budget other than the catalyst to maintain the project, so it is not possible to assess whether it will be financially sustainable in the future. The proposer does not present a plan of how the meetings and events will take place", "q1r": 2, "q2": "The proposer does not present a roadmap or key metrics to accompany the development of the project's success. The proposal lacks information to measure impact. It would be interesting to know how many people joined the discord server site, how many people will be attending events, etc", "q2r": 2, "assessor": "z_assessor_429", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "There was a plan, but it definitely lacked some details, like how they are going to create a discord server and how they are going to get people to join. They did explain their budget and keep it in the plan to make it concise, which was a wonderful idea. Overall this was a great idea and just a couple of things to work on next time.", "q0r": 4, "q1": "They have a plan, they have an explained budget, and the proposer has experience in this area. A little bit more detail on the plan and maybe a short timeline as well could improve this proposal. The idea of creating a Romanian business club to help entrepreneurs meet each other is an amazing idea though!   ", "q1r": 4, "q2": "It is easy to audit the progress of this proposal because they have an explained budget and a plan, this plan could use some more detail though. A timeline might also be useful in making it even easier to audit. To meet the success of creating the Romanian business club they should include these next time. This was a great proposal.", "q2r": 3, "assessor": "z_assessor_585", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "カルダノルーマニアビジネスクラブは、起業家同士が知り合い、現地でのコンフリクトコールなど定期的に会うことができます。", "experience": "様々な組織のコミュニティ・イベントに関わる経験豊富なシニア・マネージャー。Linkedin: https://www.linkedin.com/in/cosminpaval/"}