{"id": 368758, "author": "", "title": "Short videos in (african) french", "url": "https://cardano.ideascale.com/a/dtd/368758-48088", "category": 26111, "amount": 2000, "description": "カルダノのブロックチェーンの仕組みについては、（アフリカの）フランス語の動画が不足しています。", "f6_no_assessments": 4, "f6_rating": 2.75, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a simple very low cost proposal to translate IOHK material in French for an African audience and produce 2 videos per month. The proposal doesn't say how long this would be continued for. Is this asking for funding for 12 months?", "q0r": 5, "q1": "This is a simple plan by educators already experienced in the area and fluent in the languages required, thus highly likely to succeed. The plan could have a little more detail on how long the this funding will cover the translation and video services for. is it 1 yar?", "q1r": 4, "q2": "This is a relatively simple proposal to audit progress, assuming the proposers commit to a timeframe over which they will will provide these services. It would also be good to produce some metrics for success. How many views of the videos and translated documents do they expect?", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The challenge on lack of videos in (african) french about the working of Cardano's blockchain byt ranslating official material from IOHK or use existing one forum.cardano.org and record two 10 minutes explanatory video in french per month seems a straightforward solution.", "q0r": 3, "q1": "The proposer's team of computer science teachers & students speaking French & English is adequate to produce such materials. The likelihood of the proposal to be implemented 3/5.", "q1r": 3, "q2": "Proposal is too short and hard to determine auditability. Budget is within expectancy.", "q2r": 2, "assessor": "z_assessor_340", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "Draft proposal. The problem and solution are within the scope of the challenge, however the proposal is a draft and no metrics and KPIs that might indicate the impact on the challenge have been included. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q0r": 1, "q1": "Draft proposal. There is not enough information for feasibility assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q1r": 1, "q2": "Draft proposal. There is not enough information for auditability assessment. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document proposal writing guide in the FAQ section on the IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 8, "ne": 3, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "They do have a plan but it lacks in detail. There is no timeline or explained budget.  Extra details are needed, like which bits of the $2000 will go to each step. Which part will go towards marketing and how are they going to do the marketing and how many people are they going to hire or are they going to upload these videos themselves? This idea was wonderful, it just needs some more work.", "q0r": 3, "q1": "There is a plan even if it does lack details it is still a plan. It explains what they will do. It doesn't explain much of how they will complete it though. More reasons and details are needed. The proposer/s are computer science teachers and they speak English and French.", "q1r": 4, "q2": "There isn't a timeline so it is hard to audit the success and progress towards their goal of producing video's explaining Cardano blockchain technology in French.  An explanation for the budget uses would be a nice touch. Overall this was a great proposal and a splendid idea.", "q2r": 2, "assessor": "z_assessor_585", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "\\- IOHKの公式資料を翻訳するか、既存のものを利用する forum.cardano.org\n\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\", "experience": "フランス語と英語を話すコンピューターサイエンスの教師と学生のチームです。\n\n何百人もの学生にブロックチェーンとカルダノを紹介してきました。"}