{"id": 369397, "author": "", "title": "Translation - Ukrainian - Russian", "url": "https://cardano.ideascale.com/a/dtd/369397-48088", "category": 26111, "amount": 4500, "description": "英語をうまく話せない人が多い", "f6_no_assessments": 4, "f6_rating": 2.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "It is a great idea to translate Cardano resources into Russian and Ukranian. However this plan lacks details on what would be produced under the proposal. ", "q0r": 3, "q1": "The proposer seems to have relevant experience and would be a great resource to help in translating Cardano documents into Ukrainian and Russian. However the proposal lacks a clear plan, detail and timelines one what would be translated and what the budget is paying for. Perhaps it would be a good idea to join forces with other Cardano Knowledge basses and work to translate their work, or commit to translating IOG publications etc.", "q1r": 3, "q2": "The proposal currently lacks detail on exactly what would be produced, where it would be hosted and how it would be marketed to the Russian and Ukrainian community. As such in its current form it is not possible to audit progress. It would also be great to set some success metrics such as number of views, committed members of a community etc that this work would facilitate so that success can be measured. ", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 10, "ne": 4, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The problem is defined and a solution is also articulated even is entirely clear. Eastern Europe countries has good potential for crypto, in general, and Cardano in particular, adoption.\r\n\r\nThe goal of the proposal is aligned with the outlined challenge settings.\r\n\r\nThe proposal may addresses future challenges but the proposer is not aware of them. (add space for further improvements/updates).\r\n\r\nNo KPIs/metrics are defined to measure the output of the working plan. (how many translations can be delivered in a defined period of time?)\r\n", "q0r": 4, "q1": "The proposer has indicated some experience about the necessary skills required but with no evidences to sustain his statement. (links to relevant materials delivered, social media profiles etc.).\r\n\r\nThe team has only one known member, the proposer. The other members are 'several people with the knowledge of crypto space and fluency in the languages' which is a vague statement with no verifiable experience/skills for those people. The proposer should take into consideration to assign roles to each known team member (i.e. Copyrighter, Translator English-Russian, Corrector etc.) based on the experience/skills they posses. This approach is good for better accountability and for keeping things organized.\r\n\r\nThe budget is outlined but is not broken down into identifiable items. Also, when making the budget the proposer should take into consideration the time frame necessary to implement the proposal and the deliveries that will be created. (i.e.: Translator 2x3h/day x $10/h for 6 weeks = $1800, Licence for 2 Text editor apps - $50 etc.).\r\n\r\nNo timetable with milestones is defined (i.e.: 1 month: researching materials suitable for translation (100-150), request, from the owner, to use the materials for the goal proposed and translate 20% of them; 3 months - translating 80% of materials, deliver them to the targeted apps or make them publicly available etc.).\r\n\r\nThe proposer should take into consideration, if necessary, additional funding if the proposal aims to last for more than 6 months/one year.\r\n\r\nThe proposer should provide a conductible plan for implementation that shows not only what is being done but also how, if appropriate.\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (i.e. what if from 100 requests for using copyrighted materials only 20 are granted? what if the device used for editing text fails? etc.)", "q1r": 2, "q2": "No KPIs/metrics are defined (i.e. 100 deliverables in 4 moths, number of viewers for the broadcast of 2 videos - 2000 viewers, increase the visibility of Cardano ecosystem in 3 random cities across Russia using materials translated into Russian language etc).\r\n\r\nThe solution to the identified problem is not presented in a clear and understandable manner (what are the deliveries by achieving the goal of the proposal?)", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identified the problem of many people not speaking English. As a solution, translations into Ukrainian and Russian were presented, but it was not specified how many translations will be made. As a result, it is difficult to assess what the impact of the proposal will be. The objetive of the proposal is in line with the challenge. The proposer has not presented any financial plan other than Catalyst to maintain the project so it is not possible to assess whether it will be financially sustainable in the future", "q0r": 3, "q1": "The proposer said in the proposal that he has a team of members to implement the work, but he did not specify who they are and what their experiences are. It would be interesting to present a plan for the conduct of the project, such as how many translations will be done and how they will be done. In this way, it is possible to make a better assessment. The proposal does not pose any risk that would prevent its implementation. No deadline was set for the implementation of the work. The budget is not detailed, so it is not possible to assess whether it is reasonable or not. ", "q1r": 2, "q2": "No roadmap or milestones were presented during development. It also lacks metrics or KPIs to enable proposal auditability. The proposal can have a positive impact on the community but lacks information to measure its impact. It would be interesting to know how many translations will be done, who will do them, how they will be done, what content will be translated and have a deadline for the execution of the work. It's a good idea, but there doesn't seem to be a concrete plan for its implementation", "q2r": 1, "assessor": "z_assessor_429", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal identifies a worthwhile problem to tackle and it makes sense that it could certainly add value to the Cardano community. I would have liked to see an example provided of translation by the proposer. With that simple step this proposal would have added much veracity to the authors claim. ", "q0r": 4, "q1": "The proposal does not really provide any evidence to help us assess the proposers experience. Merely telling us big experience is not enough please provide examples of your work and/or qualifications. I note multiple languages are mentioned yet again no actual evidence for me to assess and rate in terms of quality or quantity. The proposer would do well to document his interactions as a community member and provide examples of his work.  ", "q1r": 3, "q2": "The information provided presents a good idea but is lacking in terms of evidence. It would have benefitted greatly by examples of work done. Further detail of specific KPI's in terms of hours required to translate a single document and then projecting number of hours to match funding requested would have greatly improved this proposal. ", "q2r": 2, "assessor": "z_assessor_53", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "ウクライナ語、ロシア語への翻訳", "experience": "Project Catalyst Fund1参加者、カルダノコミュニティでの活動、翻訳（暗号を含む）の経験が豊富。"}