{"id": 369811, "author": "", "title": "Babelada - Translation Community", "url": "https://cardano.ideascale.com/a/dtd/369811-48088", "category": 26111, "amount": 63500, "description": "カルダノの学習リソースは、英語圏の人にとっては手頃な価格です。他の人はどうですか？英語を話さない人は世界に2.26B人いる（Statista", "f6_no_assessments": 5, "f6_rating": 3.400000000000001, "videos": [], "media": [], "f6_assessments": [{"q0": "Whilst this could be a good idea, it is asking for the majority of the challenge funding to set up a platform to pay community members to translate Cardano information. It seems there are many individual proposals by committed community members to do this work for their local communities. It is not clear one central entity to do it all would be a better solution. Its not clear how they intend to decide what content should be translated? The challenge is to grow the non-English Cardano ecosystem in the next 3-6 months, however this proposal doesn't launch until month 7.", "q0r": 3, "q1": "The proposers have set out the plan they wish to execute to make this happen, however large parts are still to be proven making it hard to give this a high likelihood of success. Even if it were to all work, there is no clear methods for decided what should get translated. How do we make sure that we are translating the most important resources for each community. Its not clear where the funds to pay for the translations will come from, as the majority of the funds are using to design and create the system.", "q1r": 2, "q2": "Whilst the proposal does create deliverables in terms of the system of which delivery could be audited, what the community really cares about its the output. How are we measuring the benefit of the translated documents? What is being translated, for which communities and in which languages?", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The proposal address the challenge of multilingual resources, but it lacks explanation of where the translated content will be posted or what kind of learning material will be translated. It's not clear whether it comes from the Cardano Foundation, some qualified media channel, or whether it comes from any individual (which in this last case, requires some explanation about certifying the relevance of the content created in English). Another aspect to consider is the possibility of having a unilateral flow of content: English>>to the rest of the languages. It could be considered the production of authorial content in each of languages, culturally tailored. ", "q0r": 4, "q1": "The proposers provided information about previous works in the field of software development. However, they have provided no information regarding experience in the field of translation or translation assessment. They have provided no information about working with gamified platforms, neither explain what makes Babelada a gamified platform. In the way that it's described, it seems to be just a platform to connect translators, authors, and readers, but not a gamified one. ", "q1r": 3, "q2": "Although the KPIs and the roadmap are presented clearly in the proposal, the proponents did not explain where the rewards for translators come from.  And from what they explain, the reward in ADA is key for the success of the platform. ", "q2r": 3, "assessor": "z_assessor_386", "no_vca": 9, "ne": 4, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Thanks for your time and your feedback. The attached document \"Workflow 1st draft\", included in the proposal, explains how the \"English material owner\" user: \"Publishes link of beta trial material in their website\" and subsequently the platform: \"Sends notification to User 1 for they to publish the translated material; further transfer rewards to User 2\".  Ergo, \"English material owner\", is understood as any member of the community  empowered to create and democratize the learning on relevant issues. Regarding the potential bias on the translations, the proposal explains how the \"Learner\" user (Learner: The user that consumes and evaluates the quality of translations.) and the platform only would notify the the material owners to publish the translations when this is evaluated above the parameters (also explained in the attached document \"Workflow 1st draft\")  "}, {"q0": "\r\nHas the problem needing to be solved been identified and articulated?\r\nYes. Cardano learning resources are not available or not affordable for non English speakers. \r\n\r\n\r\nDoes this proposal fall within the scope of the challenge brief?\r\n Yes\r\n\r\nDoes this proposal show clearly how it will add value to the Cardano System?\r\nYes\r\n \r\n\r\nHave key metrics and goals of the proposal been stated clearly \r\n Yes\r\n\r\nDo the key metrics and goals of the proposal fall within the scope of the challenge\r\n Yes\r\n\r\nCan the proposal scale to address future challenges?\r\n Yes\r\n\r\n\r\nThis project will have a positive impact on Cardano system\r\n\r\n", "q0r": 4, "q1": "\r\nHas the proposer provided evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal?\r\nNo team members profiles are not  listed. Various social media links are listed. \r\n\r\nAre these links sufficient?\r\nNo \r\n \r\nHave you the CA visited these links and contacted the relevant people?\r\nI have not visited the links.\r\n\r\n\r\nHave you been able to assess their level of competence?\r\nNo \r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\nNo \r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\nNo \r\n\r\nHas budget been outlined clearly and broken down into identifiable items?\r\nYes \r\n\r\nIs budget reasonable to achieve the set goals?\r\nSeems high since translation is being done by users and not by his team\r\n\r\nHas the proposer provided a verifiable plan if additional funding is required to implement the proposal?\r\nNo plan for additional funds \r\n\r\nHave you verified this plan?\r\nNo \r\n\r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\nYes \r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\nYes\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\nYes \r\n \r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\nYes \r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nNo \r\n ", "q1r": 2, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\nYes\r\n\r\n\r\nAre there clearly defined Metrics/KPIs that define the success of the proposal?\r\nYes\r\n \r\n\r\nIs there a clear understandable description of the targeted problem?\r\nYes\r\n \r\n\r\nIs there a clear understandable solution that addresses the problem?\r\nYes\r\n\r\n\r\nHas the proposer identified possible hurdles, challenges and difficulties?\r\nNo \r\n\r\nHow does the proposer plan to deal with these difficulties?\r\nNo plan given\r\n\r\nAre there contingency plans in place for various outcomes?\r\nNo \r\n\r\n\r\nI dont fully recommend this plan because the budget is high reasonable.   Team members are not laid out .     \r\n", "q2r": 3, "assessor": "z_assessor_460", "no_vca": 9, "ne": 2, "ng": 3, "nfo": 4, "vca_o": 1}, {"q0": "Receive information in a native language is a big factor in learning about new things, and facilitate it.\r\nA platform with information about Cardano, blockchain ecosystem, with rewards in ADA in various languages will facilitate its promotion. And as statistics show, millions of people would be reached out to.\r\nI agree with the solution proposed for this challenge.", "q0r": 5, "q1": "The incentive through the reward in ADA is so attractive to contributors, and as it's an open concept, many experts in those languages may be interested in sharing their language knowledge to the community.\r\nThe proposal defines well the types of users of it: owner of English materials, translators and learners. and by connecting those three types of users, will be the success of this proposal. The timeframe is established and realistic, while the budget covers the main expenses, plus the portion covering the rewards cost.\r\nThe proposal is feasible and scalable. A lot of people will benefit from. \r\n", "q1r": 5, "q2": "The Babelada can be accessed by any community member and KpIs are able to be audited on various stages of the project (local, and once expanded).\r\nThe risk would be to accomplish this proposal in phases and request funds by phase. This will allow evaluation of the phase and make adjustement for next one's if needed.", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "It's an effective approach to the challenge, as it addresses the need for translation in an overall way, rather than focusing piecemeal on individual materials that need translating.  It's also an interesting approach, and potentially empowering to speakers of target languages, to have quality-evaluation resting with the person who uses the material rather than the person who commissioned the translation. Also, the collaborative approach to design during month 1 is likely to increase impact, as the proposal team are open to input from the community, although I'm not sure if there's quite enough time and resources given to this – what if community input identifies a major issue that needs to be resolved?\r\n\r\nI'm not completely sure that the project's approach will suit Catalyst, given that many documents are created by a group rather than a single owner, and are intended to be shared with and owned by the whole community – who, then, is technically the \"owner\" who would pay for the translation? And is there a danger that a service like this might shift the balance so that those who write a document in English might start to say \"Well, if someone wants it translated, they can pay for it\"?  \r\nI'm also not convinced how much people will care about the gamification element – but I could be wrong, and the point is that it will be tested during the project, so it could turn out to be impactful; and even if not, the project will still work and have a good impact without it. But the issue of translator rewards being worked out based on their evaluations – how would this work in the early stages, when nobody has any evaluations? Would low initial rewards put translators off, and mean they would prefer to negotiate with material-owners directly, who they may already know, rather than building up their reputation on this platform?\r\nIn short, the proposal *could* have really good impact, but it's hard to be sure -  the proposers could do more to explain the value of its specific features in this specific (Cardano/Catalyst) context. \r\n", "q0r": 3, "q1": "The proposers clearly have the needed relevant experience and skill; their past projects look user-friendly and well designed, and seem to have been well managed and implemented effectively.\r\nThere's a very clear roadmap and milestones, which is good in itself, and also helps with managing risk. Still, I would like to have seen some explicit description of what the team see as the risks of the project and how they will mitigate them.\r\nOne obvious risk is how the project would onboard sufficient good quality translators; because when the platform is launched, if there are not enough translators or they are not good, this will instantly damage people's wish to use it. So it's a slight worry that there are no specific budget resources or time in the roadmap for outreach or recruitment to get translators on board. It's probably intended as part of \"developing and testing\" in months 3-6, but it would help make feasibility clearer if it was specifically addressed.\r\nThe budget is well broken down and doesn't look excessive; but it is a slight concern that it is almost all the funds for this challenge, which means that if funded,  it would block out almost all other proposals. But this feels acceptable, since it is a complete and scalable approach that could have a longterm impact on future translation needs, whereas most other proposals begin and end with translating this or that specific material. It would probably lead to some short-term delays in Catalyst projects being able to address translation needs, since this platform will not be available for 6 months; but it could be worth it in the long run.", "q1r": 4, "q2": "The KPIs given are clear, well thought out, and measurable, and they are sufficient. It's also excellent that all the code will be open source and available on GitHub. The only thing that perhaps could improve auditability is any qualitative metrics about levels of user satisfaction. This could partly be measured by the amount of ADA changing hands, as people only pay when they are satisfied with their translation; but in this development phase it would be useful to additionally have some more detailed analysis of how people are finding the tool – including ease of use of the interface, speed of getting translation done, whether translators are available for the languages people need, speed of getting paid, etc.", "q2r": 4, "assessor": "z_assessor_540", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "コミュニティがカルダノ／ブロックチェーン・エコシステムに関連する学習資料を翻訳し、ADAの報酬を得るためのゲーミフィケーション・プラットフォーム", "experience": "メキシコの公的機関や高等教育機関向けに、モバイルアプリやソフトウェアの製品設計、開発、展開、提供を行います。"}