{"id": 370078, "author": "", "title": "Educational materials about Cardano", "url": "https://cardano.ideascale.com/a/dtd/370078-48088", "category": 26111, "amount": 15000, "description": "カルダノのエコシステムが成長するにつれ、様々な言語での教材が常に必要とされています。", "f6_no_assessments": 5, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Whilst producing educational materials is obviously useful there is not a clear and concise proposal on exactly what will be done here over what time frame. They mention Spanish and Russian, whilst later stating 3 languages (is the 3rd English?). \r\nIt would be good to see a more concise summary of the content that will be produced, in what languages and time frames and how it will be marketed and to whom.", "q0r": 3, "q1": "The proposers have already been producing this content thus obviously have to ability to continue to do so. The plan however lack clarity over how much content will be produced and clear deliverable timeframes. It would be good to also have a breakdown of the budget request.", "q1r": 3, "q2": "Progress on deliver will be hard to audit as the plan doesn't state how much content will be produced or over what time frames. The proposers mention views and engagement which is great. It would be better if they set goals which would define success of the project. If this is too hard to judge at this point, perhaps a shorter project first, which if measured successful could then re-apply for funding.", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The impact of this idea can be huge, given that Spanish is the second most spoken language in the world (with 538 milions of native speakers) and Russian is the most spoken language by native speakers in Europe (that are 258 milions). But, thinking about the scenery, how can you ensure you could reach at least a big part of these people in a way that would generate impact for Cardano? How can you ensure that Spanish or Russian speakers are ready to receive this kind of content, considering most of these people don't know about Cardano existence given that they don't speak English to reach the content produced until today.  \r\n", "q0r": 3, "q1": "The idea is to produce content in Spanish and Russian in many platforms, it's known that it demands time and people to work at it. Does Everstake have these resources? The requested amount was USD 15k, is this enough for how much time? It's not clear how much time you will spend to release each content in each platform, neighter how many videos, articles, blog posts, etc you would release per week. \r\n", "q1r": 3, "q2": "Everstake shows some estimated numbers about views, engagement rate, reach and potencial users. Before start the project, it's impossible to be sure about these numbers. Thinking about that, how these estimatives were created? Nonetheless, it's known that with the social media growth we have many usefull ways to audit the reach of the content about any issue using the performance indicators of each platform specifically (Instagram, Facebook, Youtube, Twitter, LinkedIn, etc). \r\n", "q2r": 4, "assessor": "z_assessor_409", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposer identifies the need for constant educational materials in different languages. It offers as a solution the creation of educational materials about Cardano in 3 different languages. The purpose of the proposal is aligned with the challenge and presents metrics to monitor the project's success. The project has not presented any financial plan to keep the project sustainable in the long term, therefore it is not possible to assess whether it will be financially sustainable in the future.", "q0r": 4, "q1": "     The proposer showed evidence of his experience necessary to implement the proposal. The budget has not been clearly detailed and seems slightly over-priced. The proposer presents a plan of what will be done in the development of the project. The proposer does not make it clear what the deadline for completion of the work is. The proposal does not pose a relevant risk for project implementation", "q1r": 3, "q2": "There is a clear description of the problem and solution. The proposal presents a roadmap with milestones and key metrics. However, the deadline for completing the project is not clear. It would be important to make this information clearer for better evaluation", "q2r": 4, "assessor": "z_assessor_429", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This proposal fit into the challenge brief. There is no start date and the KPI  mention  to \"Create text guides for existing wallets on 3 languages\". It  can be improve to specific  languages. Also the team target the already existing customer base , which fine but it would been better to find a way to reach out to other outside their customer base , That would have help the entire  cardano ecosystem.  The team mention \"A more accurate prediction for the next months or year can be made after the first month of content creation\".\r\nThis show the money requested for might be more or less and not enough to give the desire Impact. I don't think this proposal effectively addresses the challenge , for that i score 2 ", "q0r": 2, "q1": "The team experience with blockchain staking is great and the past content provided shows their ability .Therefore with experience, it is highly likely that the proposal will get implemented.", "q1r": 5, "q2": "The KPI provided is limited which can be improve , there is no Definition of success after 3, 6 and 12 months that makes it difficult to audit the progress of this Project, for that i score 2", "q2r": 2, "assessor": "z_assessor_430", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is about creating videos and articles about Cardano, translated into English, Russian and Spanish, and distributed through social medias.\r\nThe main objective of the challenge is about multilingual aspect, but the proposal does not include enough details on how the translation will be made (automated or verified by actual humans). The level of impact is moderated considering that materials are intended to be translated into only 3 languages.\r\n", "q0r": 2, "q1": "The proposer has experience and provide evidence of creating educational resources and distributing materials using social medias. However not enough details are given -and no experience or evidence is shown- on how the translation will be organized. I advise the proposer to add details about this, as it is the main challenge.", "q1r": 2, "q2": "The proposal offers to measure the success using number of views of published articles, videos, tweets. The proposal sets very precise objectives.\r\nAs stated in my previous comment, I do not see how the multilingual aspect of the challenge is addressed : I would advise to split up the objectives of views for the different languages in which material will be translated.\r\n", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 10, "ne": 4, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Everstakeは、カルダノに関する多くの教材を作成し、当社の顧客ベースに配布する準備ができています。", "experience": "我々はシェリーが立ち上げた時からカルダノのSPOであり、30以上のブロックチェーンを経験しています。"}