{"id": 383801, "author": "vinaydeva", "title": "KONMA DAO", "url": "https://cardano.ideascale.com/a/dtd/383801-48088", "category": 26237, "amount": 75000, "description": "传统的治理形式在协调和执行程序方面有许多层次的管理，因此减缓了决策的速度。", "funded": 1, "upvotes": 33154336, "downvotes": 14412439, "votes_result": 18741897, "votes_cast": 214, "f6_no_assessments": 6, "f6_rating": 3.7222222222222228, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=1196"], "media": [], "f6_assessments": [{"q0": "这个雄心勃勃的提案旨在为社会生活创造技术基础设施。这是一个真正雄心勃勃的项目。然而，挑战简介明确指出，这项挑战是关于带来\"......更多和更好的解决方案，用Cardano管理你的DAO，而不是用任何其他区块链。\"什么是KONMA？它是\"......由区块链技术驱动的去中心化自治组织，具有透明、安全和去中心化等特点。\"因此，初看之下，并不清楚该提案如何有效地解决挑战，因为它描述并证明了创建DAO，而不是作为一个DAO创建的基础设施提案。这使该提案的初始评级为1星。\r\n\r\n然而，提案人确实在目标部分写道，成功是\"......一个全面运作的DAO来帮助管理Konma及其Dapps\"。他们还暗示，他们知道这个挑战是关于使Cardano成为创建DAO的最佳选择，他们写道：\"一旦DAO在社区的帮助下设计和开发，它将进一步帮助Konma将更多的DAO引入Cardano生态系统，并治理Konma和其他合作的各种DApps\"。然而，仍然不清楚为什么创建Konma DAO要达到这个目的，除了成为一个建立在Cardano上的好DAO，从而激发其他也只是使用Cardano。\r\n\r\n现在，如果我们做一个慷慨的解释，并假设源代码是开放的，那么这个项目就可以变成DAO基础设施，帮助世界各地的组织启动。给予提议者怀疑的好处，并假设这是他们确实打算做的，那么KONMA解决的问题可以很容易地被利用到DAO制造基础设施中。\r\n\r\n反馈。我建议提案小组仔细思考挑战书的描述和它的要求。这个挑战是关于DAO基础设施的，而不是关于在Cardano上创建DAO的资金。考虑到该提案中的问题陈述，似乎提案人相当关注治理以及治理的无效性。因此，我建议一个起点可以是开发一个专门从事决策的DAO启动器平台。也就是说，你开发一些投票协议，让DAO创建者在启动他们的DAO时可以选择（直接民主、代表制、一些混合等）。", "q0r": 3, "q1": "有一些迹象表明，这个团队在web3开发以及其他区块链的开发方面有相关经验。一些进一步的独立挖掘帮助我找到了一些可以评估该团队的LinkedIn资料。这家创业公司已经存在了几年，网站也相当专业。他们显然精通区块链领域，其中一个人经历了一些EMURGO区块链课程并获得了证书。+1颗星\r\n\r\n然而，没有太多的迹象表明他们知道在Cardano上工作的挑战（Haskell和Plutus），他们似乎也没有表明他们知道Plutus先锋或Prism先锋计划，这些计划可以给他们提供成功的技能（对下一轮的强烈建议）。如果能表明这一点，那么将再加一颗星。\r\n\r\n他们打算将其部署为开源的事实表明，这可能是DAO基础设施的基础。因此，该提案被授予另一颗星。+1颗星\r\n\r\n反馈。为了使你执行该提案的能力具有可信性，向评估员和社区提供容易获得的信息以帮助我们验证团队的技能是至关重要的。对你来说，这意味着提供LinkedIn个人资料链接和Github仓库材料。另一个反馈是以较低的预算金额为目标。你要求的钱越多，在向社区提供证据方面的标准就越高。要求超过3-5万美元的项目应该有一些最小的可行产品或非常强大的成熟记录。因此，建议要求较少的金额来编写白皮书和建立伙伴关系。", "q1r": 3, "q2": "提案人清楚地列出了项目的每周目标，并有一个非常详细的预算，分为小时工资部分和成本估算。这使他们达到了5颗星。然而，我想指出的是，在未来，在透明度方面有很大的改进空间。下面描述的差距意味着该提案失去了一颗星。\r\n\r\n反馈。一些费用没有细分为各个部分。例如，10,000美元的营销费用是很重要的，而且没有适当地说明理由。还值得注意的是，开发的时薪是按美国水平设定的，鉴于该团队似乎在印度，这并没有明确的理由（这意味着他们为DAO的开发预算了120个小时，对于一个全职开发者来说仅仅是3周--鉴于他们寻求的许多功能，这其实是不现实的，是不够的）。可能是提案人要求Emurgo开发这些功能，但提案中没有明确说明。进一步解释 \"对早期推动的补偿 \"是什么意思也是可取的。", "q2r": 4, "assessor": "z_assessor_582", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This project proposes to impose a DAO and along with the other proposals that this project has filed for fund 7, they are aiming to create one of the larger (if not, the largest) DAOs on the Cardano blockchain. The ambition and magnitude of this project is huge and could pave the way for mass adoption in areas of operation, propelling the Cardano blockchain forward. All of this would start with the successful implementation of this DAO. So it has to be recognised that the potential impact of this proposal is big. ", "q0r": 5, "q1": "The team is currently incomplete, but there is an indication of intention to move fast and assemble needed additional developers within a timespan of 2 weeks. A suggestion that might help to find them is to simply use the seek-tags in the proposal. Further improvement would be to better identify the existing team by publishing each team member and their respective skillset so it can be determined what functions are still needed. This project has a very defined plan of operations in mind. The determination and organisational skills are exceptional. ", "q1r": 4, "q2": "The proposal is very auditable and contains every criteria prescribed in detail. The only thing in terms of improvement apart from team identification that I could find that would prove useful if clarified is how the ICO is meant to be conducted in the future.  ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 26, "ne": 3, "ng": 20, "nfo": 3, "vca_o": 1}, {"q0": "This proposal aims to support the governance of the Konma organization by creating a DAO. This challenge is asking for solution that will help to make Cardano the go-to-blockchain for DAOs. Comparing the challenge setting with the goals of the proposals I don't see a full alignement between challenge and proposal. It seems that KOnma has an active community, so at least we can expect that new people would enter our ecosystem.", "q0r": 3, "q1": "The team seems to be able to implement the proposed solution. Nevertheless, it would be helpful to provide more detailed references or a proof-of-life. The plan describes many details that are planned to include into this solution. To be able to further assess this proposal and see to full scope of this proposal some more details regarding the technical implementation would be helpful. The budget refers to the payment of different development tasks and  from this point of view, the amount can be fairly classified. The marketing budget could be explained in more detail.", "q1r": 3, "q2": "The schedule and the exact end result are described. For a better auditability it would be good to provide a documentation source. In addition, to measure success, not only general metrics could be mentioned, but clear numbers as a target. This would make it easier for the community to assess whether the implementation met expectations in the end.", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Konma is an existing \"Web2\" market place for food, art, and lifestyle items.  The proposers aim to evolve it to a \"Web3\" entity, and the purpose of this proposal is to build support for governance via a \"fully functioning DAO\" on Cardano.  There is a note regarding intellectual property that Konma DAO will remain a product of Konma, with \"rights reserved\", trademark, etc.  However, the proposal also says something to the effect that MIT open source license will be used, which presumably means that others could benefit from it as well, although perhaps only after modification and customization for their own purposes.  This makes me feel that this proposal perhaps does not fit the Challenge goal perfectly of delivering *tools* for managing DAOs.  Nonetheless, it may offer some value.  There is also some suggestion that Konma can bring other DAOs into the Cardano ecosystem, though I find the discussion of this too vague to be compelling.", "q0r": 3, "q1": "The team has some experience with Web3 hackathons, creating smart contracts, but no apparent background with Haskell or Plutus, and they plan to outsource the work in this regard; they hope to work with either EMURGO or MLabs.  There is not much material to convince voters that they proposers have experience in other important areas, for example DAOs, governance, etc.  The roadmap provided lacks much detail to assess.  The first priority is apparently to acquire Haskell/Plutus developers, and then design what they should build.  Strangely, the last two weeks (23 & 24) are simply stated as \"ICO\", which has not been mentioned elsewhere in the proposal.  The bulk of the proposal is heavy on jargon and light on details, which makes it difficult to assess what the project would even like to achieve, let alone how feasible it is that it will be achieved.", "q1r": 2, "q2": "Again, the roadmap is fairly vague and lacks detail, making it difficult to see how the project can be accountable.  A few KPIs are listed, but without any quantities (the reader/voter has no idea what would constitute \"high\" values of the proposed KPIs).  Apart from being unquantified, each of the KPIs is vague and makes reference to aspects that have not been explained in the proposal.  Overall, I cannot see this project being sufficiently accountable, especially for the relatively large budget requested.", "q2r": 2, "assessor": "z_assessor_499", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1, "reply": "Impact/ Alignment\nResponse:\nKonma in an existing web2 ecosystem (marketplace, community forum, upskill etc) we plan to convert all of them into web3, for which a DAO will exist to govern the above ( this includes the Dapps and other wings we are going to co associate with .\n“It will remain an intellectual property of Konma”, doesn't mean we are not allowed to give it to the community for free, such as access to the source code . Only entities with the name “Konma” will remain Konma's. But the code, usability and so on will remain accessible to the community \n*Our aim here is so that no one uses the name Konma, without our consent and knowledge * \nWe have plans for various DAO’s (NFT DAO, charity Dao, Trust Fund DAO etc). These will also consist of “tools” to manage such DAOs. \nWith respect to “bringing other DAO” we are highly collaborative with other NGO entities . for example Trees X Konma. Planting trees and afforesting in India. This entity will be made a DAO, an NFT DAO in specific, as such any other collaboration will also be made a DAO \n\nFeasibility\nResponse:\nHaskell devs are quite scarce , hence our collaboration with Mlabs and Emurgo. The confirmation with Mlabs and Emurgo arrived after the proposal submissions and we did not have the chance to make changes. Our guidance arrives from Mlabs and Emurgo as well as other DAOs we have researched.  Please get in touch with us for new updates, as we have updates on a daily basis. If nothing works with Mlabs and Emurgo (worst case scenario) our mitigation strategy is to employ devs as such and commence work . Any token would need to go through an ICO phase, either stealth launch or fair launch . week 23 & 24 will consist of Quality assurance , final auditing and the ICO phase.\n\nAuditability\nResponse:\nThe discussion forum for the DAO will be in Konmahood, as such a safe space for proposals and voters to come in consensus for further development . this will have a certain number of people present our KPI will be associate to the tribe running the discussions, hence as we grow we expect more in number and at this moment it is hard to pinpoint . the quantitative analysis is directly proportionate to the number of members present in the tribe"}, {"q0": "This is a DAO for their platform, Konma, which is a decentralized marketplace ranging from food to life-style products. DAOs on Cardano are still very few in existence, and this one will add some DAOs into it. This proposal envision to create a DAOs that govern their set of Konmas platform, from DEX to their marketplace. ", "q0r": 5, "q1": "The proposal provide the team profile on their website. They have their action plan laid out in details for the next 6 months. They're capable of identifying the team needed to recruit, complete with salary expectation and criteria (e.g the skills for Haskell developers are preferably a Plutus pioneers, the need of governance model designers, etc). However, it will be helpful if they explained about how the DAO is being developed, what are the core features to implement, and how it will be done. For example, the feature of being able to vote for the next DEX swap token, vote on community made proposal for Konma, etc. This is a rather important aspect since creating a DAO is complex, hence narrowing it down to identifiable items (of goal and achievement) will help the development to be more focused on the objective.", "q1r": 4, "q2": "The metrics and KPIs is well defined, the roadmap is laid out in week interval, and they also have a website to check on. However, since this is supposed to be a DAO and open for audit for the public, it would be better if they mention or provide link for their source code repository. This will make audit process more transparent and available to the public.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 17, "ne": 5, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The project that this team shows in the project will help to solve the slowing decision making/ delivering of traditional forms of governance by designing a DAO with features like transparency, security, and decentralization. Surely they're within the challenge of DAOs <3 Cardano. \r\nTheir included KPIs show that this project is aligned with the challenge givens, more than that these KPIs affect directly the number of the proposers, validators, and voters. Therefore, this project is vital and essential for the development of Cardano ecosystem now and then. ", "q0r": 5, "q1": "The team shared their very detailed implementation plan is not just in user features but also tech. These detailed explanations can help us to clarify what they put in the detailed roadmap. \r\nIn addition, the budget they asked for is reasonable with their plan and the roadmap. \r\nThe only thing the team misses here is the proposal is their faced risks that will appear in their action plan. Hope that they can be aware and have plans for limiting these risks. ", "q1r": 4, "q2": "They have a roadmap that divides into 2 weeks periods and outlined KPIs that will help Catalyst community audit the project clearly. \r\nThe team also has a great view of the problem context that was described into examples. It helps easier to understand the standing problem then helps us understand how the solution can solve it effectively. So, I think all the detail in the proposal are clear and concentrate on what the team wants, and they're all clarified. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "一个DAO来帮助管理KONMA ORG及其dApps，以便更容易地进行去中心化的社区交付。", "experience": "参加了Web3黑客马拉松，并利用ERC20、ERC721和ERC1155在ETH和BSC上创建了智能合约。"}