{"id": 384558, "author": "nftdao", "title": "DAO Decentralized Communication", "url": "https://cardano.ideascale.com/a/dtd/384558-48088", "category": 26237, "amount": 29440, "description": "DAO需要良好的通信和协作工具，但缺乏中央控制（FANG）通信平台的替代品。", "funded": 2, "upvotes": 118424927, "downvotes": 5069655, "votes_result": 113355272, "votes_cast": 746, "f6_no_assessments": 8, "f6_rating": 4.625, "videos": [], "media": [], "f6_assessments": [{"q0": "I strongly agree because;\r\nthe needed problem has been identified and falling within the scope of the challthe proposal also scaled to add value to the cardano eceosytem and goals of the proposer has been stated clearly and falling within the scope of the challenge, scaled to address future changies as well", "q0r": 5, "q1": "I strongly agree due to;\r\n The providing of accurate and good evidence, references links etc relevant for the implimebtation of the project if funded and the links are sufficient.\r\n\r\nTheir level of competent is good with listed team memebers needed for implementation.\r\n\r\nThe proposal has good budge's broken into identifuable items and reasonable to achieve it's goals.\r\n\r\nThe proposal has provides additional plan if hsould incase addition funding is required for implementation.\r\n\r\nthe proposaer has provide a realistic timetable for the work being done.\r\n\r\nalso has a describe or listed resources for the completment of the proposal and consisered some risk challengies for the completment of the proposal or project..", "q1r": 5, "q2": "I strongly agree because;\r\n the proposal has given good road maps that can help  auditing the project if funded.\r\n\r\nkey metrice and KPI's defines the success of the proposal.\r\n\r\nUnderstanderble describtion of the targeted problem and understanderble solution to address it.\r\n\r\nThe proposer has good contency plans in aace dor various outcome", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 25, "ne": 1, "ng": 13, "nfo": 11, "vca_o": 1}, {"q0": "This proposal is about improving the communication and collaboration between decentralized communities for decentralized decision-making and participation processes. The team provides information about the impact of the proposal but more context about the benefit for the Cardano Ecosystem could have been provided. However the objective of the proposal is interesting. ", "q0r": 4, "q1": "The proposer provides a plan for the development with clear milestones and a defined time horizon. The budget explanation is provided and in my opinion it is reasonable. More details about the technical implementation could have been provided to understand the scope of this proposal better. The proposer team is skilled about the context and experienced, knows the Cardano community very well because it has already been worked on by fund 4. I miss in this area that the proposer has not mentioned possible difficulties and market competitors.", "q1r": 4, "q2": "The proposer provides a detailed plan for the implementation with clear milestones, coherent KPI metrics and a defined time horizon. The only thing I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…) The proposal offers a realistic timetable to complete the work.", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 19, "ne": 2, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "An interesting idea! Merging all major communication channels into one, and make the communication more clear and in this case centralized, would even attract more different projects from different blockchains. \r\n\r\nI see a large impact on this proposal, which I find in accordance to the challenge.\r\n\r\nRating given 5.", "q0r": 5, "q1": "The team members with their relevant experience are posted - seems reasonable.\r\n\r\nThe roadmap seems to be sufficiently covered and submitted in structured detail. Yet in the first phases of the roadmap they are going to hire some members, therefore it decreases the predictability of the successful outcome and implementation.\r\n\r\nRating given 4.\r\n", "q1r": 4, "q2": "The progress can be audited based on the roadmap.\r\n\r\nNevertheless, it would be nice to see more details on metrics, rather than just \"1 communication system\", which is definitely a way how to audit the final outcome, but auditing the progress is not elaborated in a detail.\r\n\r\nBut overall, this part is covered. \r\n\r\nRating given 4.", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "Effective communication is essential to the success of any project, and their focus on streamlining and decentralizing communication for DAO's would be desirable and could help drive cardano adoption.", "q0r": 4, "q1": "This proposal lays out a detailed plan that is supported by KPIs, a detailed budget, and a measureable roadmap. Their team has experience developing apps as well as hands on experience as a DAO.", "q1r": 4, "q2": "This proposal does a great job providing detailed information for a sufficient audit to measure the progress and success of their project. They have laid out a detailed budget and KPI's to reference during an audit that can easily be measured.", "q2r": 5, "assessor": "z_assessor_612", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "This proposal nails the goals of this challenge. Cardano needs a DAO, and this team has seemingly well thought out a true DAO. As mentioned in the proposal, information gathering requires individuals to cover a multitude of communication vectors. This is a much needed proposal.", "q0r": 5, "q1": "In looking at this team's experience, they have been very involved in this technology, as well as specifically here on the cardano proposals. Atala Prism knowledge, technology industry knowledge with leadership, and much more experience.\r\nIt is apparent that the plan is far along, and not just in the beginning stages of ideas. For example, the details provided around their considerations for communication transportation and data sharing.", "q1r": 5, "q2": "The monthly deliverables, KPIs and metrics, and the budget breakdown (which importantly lists the different integrations, all give clear direction to determine the ongoing routine success of this DAO proposal.", "q2r": 5, "assessor": "z_assessor_816", "no_vca": 20, "ne": 2, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "Very necessary tool given the cognitive load of participants in a DAO across so many channels. Will be a differentiator for Cardano/Catalyst right from the start and provide a great seed for a really sophisticated \"VRM\" solution for Cardano Citizens to add to their critical toolbox. Future integrations with wallets/DiD's is exciting.", "q0r": 5, "q1": "Team looks to have all the requisite experience and the scope for initial API's looks  achievable. The user-experience/gui elements are not mentioned, however given the experience of the team (as stated) am assuming skills in this area... is there enough in the budget to do a good 'first cut' for the MVP?", "q1r": 4, "q2": "Simple to understand roadmap. Enough information to audit. Only reservation is not giving enough time/effort/resource allocation to UX/UI, however this is not to do with auditability.", "q2r": 5, "assessor": "z_assessor_850", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal appears to meet both of the campaign needs and at least two of the three key metrics.  It's difficult for me to argue for/against whether on-platform communication itself increases DAO adoption on Cardano, but I agree with the appeal of moving everything to decentralized systems.  The only weak spot I can find here, and it's likely just my own ignorance of the underlying architecture, but I don't see the direct link between the conversation stores and Cardano.  Perhaps it's intentionally network agnostic.  If not, it would be helpful to see direct statements that ADA is going to fund ADA-specific projects. ", "q0r": 5, "q1": "Team seems hard to improve, but timeline seems a bit aggressive unless they already have a bit of groundwork laid out that's not spelled out here.  Three months for five platform integrations, plus voice and video would probably have me biting my fingernails as a PM, otherwise I'd probably rate a five instead of four.", "q1r": 4, "q2": "Easily understood and measurable goals.", "q2r": 5, "assessor": "z_assessor_975", "no_vca": 27, "ne": 3, "ng": 15, "nfo": 9, "vca_o": 1}, {"q0": "This proposal aims to address the issue of communication over multiple platforms when using a DOA. Successful implementation of this project will also allow for better quality DOA's to be launched on Cardano.", "q0r": 5, "q1": "The team has a strong background in software engineering, building web applications and APIs. These are all key areas that are needed for this project to succeed.\r\nIt is also encouraging to see a number of the members are Atala PRISM pioneers, so they will have a good understanding of identity solutions.", "q1r": 5, "q2": "The proposal clearly states the timeline that goals must be accomplished. These goals are also measurable.", "q2r": 5, "assessor": "z_assessor_977", "no_vca": 28, "ne": 3, "ng": 17, "nfo": 8, "vca_o": 1}], "solution": "构建一个强大的、易于部署的分散式通信/协作平台，以组成关于治理、财务和参与的关键决策。", "experience": "作为一个新兴的DAO，我们对客户旅程有直观的了解。\n企业级的应用开发经验。"}