{"id": 384513, "author": "theada.dao", "title": "Creating Cardano DAO Infrastructure", "url": "https://cardano.ideascale.com/a/dtd/384513-48088", "category": 26237, "amount": 50000, "description": "DAO需要组织、投票和财务的工具集，以实现自主运作，DAO成员可以用它来指导政策。", "funded": 1, "upvotes": 63129764, "downvotes": 8635147, "votes_result": 54494617, "votes_cast": 284, "f6_no_assessments": 3, "f6_rating": 3.4444444444444446, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=9609"], "media": [], "f6_assessments": [{"q0": "Proposal addresses the problem of DAOs needing toolsets to enable autonomous operation. They will provide value to the Cardano ecosystem by easing the creation of DAOs that in turn will bring more DAOs to the Cardano. The key metrics of the proposal is directly in line with the Challenge setting as it will bring more DAOs to Cardano and provide toolsets to DAOs. The Project is able to scale well as it will be open source. ", "q0r": 5, "q1": "They claim to have Plutus pioneers on the team, but then later they list the team members and it doesn't show who the plutus pioneer is or anyone with Plutus experience. There is also no proof of their experience. It would help a lot to ad links to LinkedIn or Github pages. Providing proof of your skills will boost voter confidence. Budget seems reasonable and is broken down into identifiable items.  The timetable to complete this is reasonable and achievable if they have a plutus pioneer. If they still need to find one, that might slow them down. They go into detail explaining the different functions their product will have, but they don't explain the technical side of building these different parts. Explaining how you will build this will reveal alot about how you approach this problem and can boost voter confidence in your abilities. They haven't considered any risks or challenges. Not being aware or prepared for future challenges or risks will slow you down and in some cases might even end your project.", "q1r": 2, "q2": "They provided a roadmap with 3 detailed milestones about completing parts of the project. They haven't provided any measurable KPIs apart from finishing parts of the project. Adding more user/transaction based KPIs makes it easy to track the performance of your project. Even how many DAOs use your system at some point in time will be a great KPI. They address the problem of toolsets needed for DAO creation and they solve this by creating open source tools to help a variety of different type of DAOs.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 22, "ne": 9, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "This proposal aims to develop an open-source toolkit for organization that need or are based on decentralized governance. The proposal is well written. For me there could be more explanation on how this infrastructure will be used and how it will be 'accepted' and used by the market. The idea is interesting tough and since it will help DAOs to govern themselves it lays within the challenge setting. ", "q0r": 4, "q1": "The team seems to be capable of creating this solution. However we don't find a proof of live in the proposal. Also creating such a platform is one thing but running it successfully and getting a lot of traction on it, is a different story. The go-to-market strategy is not clear. Also the technical aspects of the platform are not described. The budget is broken down in details and seems to be reasonable for me. The time horizon seems to be realistic.", "q1r": 3, "q2": "The team presented a roadmap and a timeline, but the deliverables are overall vague. To further improve this proposal, I recommend to add a documentation source, so the community can track the progress of this project. It is defined how success would look like for this project. Adding some real KPIs would help to improve auditability.", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "The idea is to develop open source tools for the Cardano blockchain that can be used by any organization. I agree with this idea and it also fits the criteria, but need to clarify the scope of use, there are many different organizations such as judicial, tax, funding, law, election, organizations This will have different points in using DAO so to highlight the use any organization needs to clearly add what the proposed solution is, the benefits to attract developers to participate in code development What is open source?", "q0r": 4, "q1": "The proposal has successfully built a token to put on a smart contract, detailing each funding amount to develop for each function of the project, information about these functions, if the Demo interface is added, will easily visualize and increase the assessment of the possibility of the project. About $ 30,000 to build the support tool should add more clearly how many people participate and how long it takes to calculate the cost is enough to build or not", "q1r": 3, "q2": "There are 3 contents (Support Tools - DAO Seeding - Web and Brand) proposed description to be implemented and information on the time roadmap to be built, information on KPIs for each roadmap. should also be added. Will the proposal be expanded and submitted to the next funds?. What are the challenges and risks in the implementation process and what solutions have you prepared to prevent risks?", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "₳DAO将为Cardano区块链开发开源工具，可供任何寻求去中心化治理的组织使用。", "experience": "₳DAO包括经验丰富的DeFi从业人员、软件工程师、plutus先锋、网络/图形设计师和政策专家。"}