{"id": 382216, "author": "victorcorcino", "title": "Terra Cognita: AI+Blockchain Gaming", "url": "https://cardano.ideascale.com/a/dtd/382216-48088", "category": 26241, "amount": 54000, "description": "在Cardano生态系统中，缺乏令人兴奋的、融合人工智能和区块链概念的创新游戏。", "funded": 2, "upvotes": 149791899, "downvotes": 6220525, "votes_result": 143571374, "votes_cast": 754, "f6_no_assessments": 8, "f6_rating": 4.875, "videos": [], "media": [], "f6_assessments": [{"q0": "游戏提出了一个非常原始的想法，玩家将成为一个未知土地的探索者，并将在他们的旅程中面临挑战。我认为作者关注的是如何以一种非常叙事的方式来描述这个项目将如何发生，这是非常好的，因为游戏首先是一种沉浸在新的宇宙中的形式，而这个团队似乎非常有能力，它已经开始，通过提案的描述，让我们CA和潜在的玩家参与进来。这也是积极的，游戏是在RPG风格，这是非常成功的，但同时，它已经有几个项目和一些陈旧的叙述 - 这不是发生在这里，我们有一个不同的建议，比我们已经看到了。 在RPG宇宙。我们大家都知道，这种模式非常讨好玩家，是这个项目呈现给我们的无数成功迹象之一。使用人工智能的想法也非常酷，它让玩家对他们的角色有一定的--不是完全的--控制权。我认为这是一种吸引玩家的方式，以某种方式锁定他们，因为它最终成为带有赌博色彩的东西（这也是游戏界不可否认的喜爱的东西）。另一个积极的观点是，游戏发生在与现实世界的时间有关的回合中，这产生了更多的参与，因为它将生活与游戏混合在一起，此外，游戏采用了 \"玩到赢 \"的模式，这一点非常吸引公众--通常人们不愿意立即在事情上投资金钱。该团队关注的是非常准确地研究人物的特点，使他们的可视化非常扎实。他们还概述了可能的风险，已经推广了一些解决方案，这显示了很多审慎和现实感。而关于该项目将如何从Cardano生态系统中受益，我认为有很多方面。开始时，每个角色都会是NFT，这将直接增加Cardano生态系统的技术吸收，因为越来越多的玩家参与到这里。", "q0r": 5, "q1": "关于剧本，团队关注的是根据季度来定义哪些活动会发生。它们被列在主题下，让我们了解到在时间的流逝中谁会做什么，这让我们对这个过程有了非常清晰的认识。这个团队无疑能够成功地执行这个项目，首先是参与其中的AIM小组成员；他们已经向我们的社区介绍了一些非常有用的项目，如CA工具和vCA工具，从而显示了他们的技术能力。他们关注的是提供每个参与者的姓名和角色（此外还有包括某些情况下的一些先前经验的分类）。维克多和卢西奥似乎是非常有能力的人：前者在Cardano社区的一些成就是公认的，有工程背景，对游戏感兴趣，此外，他是一个总是出现在市政厅并充分活跃在社区的人。由于他的工作时间，Lucio似乎准备得很充分，此外他还知道如何用几种语言编程，这是很罕见的（在我看来）。团队的其他成员似乎也与这个项目有关，他们是来自不同专业领域的人，而不仅仅是技术部分。我们还有设计师，他们对项目的成功至关重要，在角色设计和氛围、UI/UX等方面都是如此。最后，就货币分配而言：他们将总金额（相当高，但也是合理的）分为几个主题。每个主题都有单独的解释，基本上都是关于相关专业人士的工资。这样一来，提案的这一部分也非常容易理解，使我们明白为什么要求这个数额。", "q1r": 5, "q2": "关于游戏监控，我相信团队为我们提供了足够的信息来进行详细的跟踪，不仅是最终的结果，还有过程。我说过程，是因为我们知道谁会做什么，什么时候做，通过这种方式，我们可以与相关的专业人员保持直接联系，谈论和监督每个部分的进展。而就最终的结果而言，基本上是关于有多少设计被创造出来，有多少NFT被售出，有多少用户在游戏的早期版本中玩耍。我建议团队自己监测这些数据，并将所有的东西收集在图形报告中，以便向社区的其他成员展示这些信息。这可以在After Town Hall的一个房间里进行，这是一个由Catalyst Swarm小组推动的项目，目的是促进对已经融资的项目（这里的情况）和未来项目的辩论。因此，我相信我们确实有足够的信息来对该项目进行适当的审计。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 22, "ne": 17, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "Love it. Sounds like an awesome NFT/AI/Metaverse experience. Much more fun than crypto kitties to have your NFT evolve over time under Reinforcement Learning simulation. This could be really cool, lets make it happen.", "q0r": 5, "q1": "The proposers have some good programming and ML experience and are highly involved in Catalyst. They have sketched out a plan of what they want to do. There are definite execution risks, especially on the scalability (that they have mentioned), but this is the sort of project that could really kick off and draw interest across the blockchain world. Its worth taking a risk on.", "q1r": 4, "q2": "The proposers have provided a clear roadmap for delivery against which progress can be audited. They have also provided a number of KPI's against which success can be measured. It would be nice to add some goals to these KPI's, but in the end these types of projects have a long tail. It either won't really get picked up and fade away, or if it does, the numbers would be explosive. ", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 32, "ne": 2, "ng": 25, "nfo": 5, "vca_o": 1}, {"q0": "I waited for this game genre for a long time, the idea of bring AI into game - even only helping players to build their civilian like this game  - will help the game industry to new era, therefore, it will make some different in Cardano ecosystem to other network. The idea look like huge and hard but this professional team have a very detailed description about their game materials and environments, then the gameplay that will make player eager to wait, and their technology strategy on developing the game...\r\nMoreover, their detailed KPIs and key metrics show that this game is a perfect pitch for the challenge given. ", "q0r": 5, "q1": "It's not only perfect vision and strategy, the proposal also could perfectly shows that they can successfully get their goals. There is a detailed roadmap outlined to detail activities that you can get them by reading the detail information inside the proposal, including the game info and the technology that they will use for advancing the game system. \r\nIn addition, their budget breakdown is clearly for part time position, and as they said it just enough for developing some first phase. But they also describe about how they will solve that problem in their risks and challenges. \r\nI think this team will make the idea come true soon as they set on their timeline. ", "q1r": 5, "q2": "They have a perfect proposal that can show how the game strongly impact to Cardano ecosystem, how they can successfully launch their game by their realistic time, and full of materials for auditing their progress so far. \r\nRoadmap and key metrics, KPIs in this proposal are clarify for Catalyst community tracking their commitment to us and I believe that they're all will support to their success. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 20, "ne": 3, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "Terra Cognita: AI + Blockchain gaming proposal address the challenge by creating RPG Game with the players set AI/ML characters to explore the new world. It is an ambitious project and fit wells within the Gamers on-chained challenge.", "q0r": 5, "q1": "The proposer team is comprised of members with strong technical ability (not in game development)but in AI and web/mobile development. The proposal has laid out what to be expected in term of user experience. There are clear roadmaps and risk/challenges have been addressed. They will get full score should they give KPIs in quantifiable term. ", "q1r": 4, "q2": "The information provided in term of roadmap, game development and team background are very detailed. The KPIs could include numbers so that it's quantifiable and easier for community members to track the progress.", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Unlike most of NFT games, this game will use AI with machine learning to help player develop their activities. With that type of mode I think people will be attracted to join and play because it can save a lot of time and they do want to see what AI can help them to build their things. \r\nThe proposal has a detail info about how their game will run and its key metric/ KPIs prove that the team concerns seriously to the challenge. \r\nMoreover, they also explain about their advantage on scaling the game very detail, so I think the game will make big impact to the Cardano ecosystem. ", "q0r": 5, "q1": "The proposal has detail roadmap into position that the team will pay for, it can help us assess that their required budget is reasonable.\r\nIt also has detail explaination about the tech and game development that it will use for developing and advancing the performance, scalability of the system. \r\nIn addition, their timeline of implementation and development is realistic and can help them to prevent their outlined risks well. ", "q1r": 5, "q2": "It don't have detail explaination or case study for the problem, but it has very detailed explaination about the gameplay and development to help. And those info concentrate with their detail roadmap and KPIs/ key metrics of the game. \r\nThis proposal is fulfilling things for auditability", "q2r": 5, "assessor": "z_assessor_670", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "In my opinion, this proposal is completely reach the challenge given. Even more, their detailed explanation can show how much benefit that players will be received from their game, not just only finance profit but also time and experiencing of AI development.\r\nMoreover, I'm very appreciate to their way to open source all of their game code to community, this will passionate and help a lot of other game developer make a new age of on-chain gaming genre. Currently, most of the game is bored: card game, turn-based game. ", "q0r": 5, "q1": "As my experience, their budget for employee is little bit lower than I know, and all the budget is for part time position, so I do want to know how will they solve if they can't find the right people to keep the project running on time. \r\nThat's my only risky concern to this proposal. On the other things, they made all perfect. Their budget is reasonable, and they have a cleared roadmap. All the essential game info and technology information were described so detail and can help me estimate their work easily. \r\nThey even show some relevant risks and solutions for them, I saw all make sense. ", "q1r": 4, "q2": "For auditing this project, I think proposer give us full of essential info, including very very detailed roadmap, success metrics that the project being lead to and KPIs that the team will show us on the needed time. \r\nMoreover, they also have perfect explanation about solution to solve the problem in the part of game description and development. \r\nAfter all, I hope that this game will be fund and successfully deployment. ", "q2r": 5, "assessor": "z_assessor_671", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "RPG game seeking to let players experience a whole new world. Proposal mentioned that players would create their own NFT based characters, explore and play, learn, evolve and conquer a whole new experience.\r\nEach minted NFT character is therefore attached to an artificial brain that will evolve and perform better over time. This idea promotes cardano as the best for gamers on block chain.", "q0r": 5, "q1": "The team experts have experiences in game architecture, developer, front end designer, data science engineer which all make the proposal an ideal one for successful implementation.", "q1r": 5, "q2": "The timeline is very detailed and clear showing the breakdown of 3, 6 and 9 months of different tasks which can be audited effectively. The budget has a detailed breakdown of different tasks and cost. This can be audited effectively. Progress of work can be monitored effectively given the details shown in different phases. Good proposal. I recommend for funding.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "I am already encouraged by the professionalism shown in this proposal and the graphics provided. The team looks incredibly capable of delivering this product which fits the challenge goals.", "q0r": 5, "q1": "The team has experienced software developers and game architects. This proposal also includes all the necessary information and more (project roadmap, budget breakdown, KPIs, team experience, and technical details.) This shows that they have clearly discussed and planned this project's progress.", "q1r": 5, "q2": "As mentioned above, this proposal offers all of the needed information to audit the project's progress (project roadmap, budget breakdown, and KPIs.) This is the information that will act as a baseline to judge their success.", "q2r": 5, "assessor": "z_assessor_893", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}], "solution": "Terra Cognita，一个在线、合作、战略、RPG游戏，玩家创建和设置基于AI/ML的角色，探索一个全新的世界。", "experience": "经验丰富的全栈开发人员、Plutus和AtalaPRISM先锋、机器学习研究员、设计人员、Cardano和游戏爱好者、AIM团队。"}