{"id": 384265, "author": "edwint", "title": "World of Pirates", "url": "https://cardano.ideascale.com/a/dtd/384265-48088", "category": 26241, "amount": 60000, "description": "玩家希望参与到他们喜欢玩的游戏的各个方面，在社会中产生影响，并控制他们在游戏中的资产。[1]", "funded": 1, "upvotes": 36292207, "downvotes": 12429093, "votes_result": 23863114, "votes_cast": 218, "f6_no_assessments": 8, "f6_rating": 3.9583333333333335, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=16012"], "media": [], "f6_assessments": [{"q0": "我认为我有能力评估这个提案，因为我从基金4开始就一直活跃在催化剂项目中，而且我有超过5年的为小企业和公司提供软件解决方案的经验，分析商业需求。除此之外，我一生都是一个游戏玩家，我也曾担任过游戏测试员，所以我对这个行业有一定的了解。\n虽然问题陈述并没有指出一个问题，而是指出了玩家喜欢的一些东西，但我们可以理解，该提案的目的是创建一个免费游戏和游戏赚钱的游戏，这将使玩家对他们的游戏内资产有很大的控制权，允许他们赚取NFT，还可以为慈善机构捐款。作为对提案人这部分的反馈：如果你在提案的开场白中使用首字母缩写词，请在不久后解释这些术语的含义。不要指望选民知道这些术语，因为他们中的许多人不会是游戏玩家，有些人一般也不会很懂技术。另外，在提案的后面，提到这里的资金需要用来创建游戏的MVP。在我看来，这一点应该在方案中提及，这样就不会让人误以为这里的预期产出是完整的游戏。\n在游戏概述部分对该项目进行了简短的介绍，它将是一个战役性的国际象棋卡牌游戏（参见《魔力棋牌》的比较），人们通过对战来获得XP（XP的使用没有详细说明）、海盗金（可用于购买游戏中的箱子，打开后可获得WOPRace代币、NFT卡或其他游戏中的资产组合）。据我所知，这些代币将与WOP代币（只能用ADA/法币购买）一起被我的玩家使用，然后在以后建立的DAO中对游戏的方向进行投票。开发者还计划让这个游戏兼容AR，以便在户外用手机玩。\n我同意这个提议有效地解决了挑战，因为我们在这里寻找的是好的游戏，把人们带到Cardano生态系统中来。然而，我不能给5颗星，因为该提案没有谈到成功的指标是什么，也没有谈到MVP到底是什么样子的，以及未来的扩展计划是什么。在白皮书中，有几个关于长期可持续发展的词，但这些都集中在游戏是免费的这一事实上，而且相当含糊。我希望能看到接下来几个月/几年的具体预测。\n", "q0r": 4, "q1": "提案人提供了一个项目网站的链接（https://worldofpirates.io），但说实话，它有点空。在工作人员（/联系）部分可以看到5个团队成员的名字和角色，但这些并没有提供任何在提案中没有提到的信息（角色和过去的经验）。请尝试在未来添加一些社会链接，这样任何人都可以很容易地验证这些是真实的人。我很遗憾地说，我在Ideascale这里亲自举报了一个不同的提案，因为它声称有些人为他们工作，但实际上并没有（我在LinkedIn上联系了他们，他们证实了这一点）。\n除此以外，另一个缺少的重要部分是关于这个项目将如何完成的信息。我们没有一步一步的路线图，也没有3-6-12个月后预期结果的时间表。请注意，你指出的https://www.worldofpirates.io/roadmap 页面是空白的。你还提到你已经出售了一些NFT，并把它们捐给了一个慈善机构，但你指向的细节链接也是空白的：https://www.worldofpirates.io/potm。\n缺乏我上面介绍的所有这些信息，以及没有提到该项目任何可能的风险或障碍，严重降低了我对该项目可行性的信心。\n唯一有更多细节的部分是预算，这是为接下来的3个月计算的（提案人认为他们需要多长时间来创建MVP）。这里的数字似乎足够可信，尽管有点高（每个开发人员每月4000美元，每个销售人员每月3000美元，总共53000美元的工资，而广告费用估计只有1200美元）。在加上基础设施的成本后，总的来说是6万美元。同样，这些都是可信的数字，但在我看来，对于一个正在寻求起步的独立项目来说，这有点高。我知道团队中的人有很多经验，但你可能也要考虑寻找额外的资金来源，因为我不确定仅靠催化剂是否能满足你从基金到基金的所有需求。\n回顾一下可行性，提议者没有提供链接来验证团队的经验，他们网站上提到的几个链接只是空白页面，除了提到MVP需要3个月的时间来完成之外，没有任何路线图或时间表，我觉得对于一个独立项目来说，这么短的时间内预算是相当高的。基于以上数据，我不同意这个提案有可能成功实施。", "q1r": 2, "q2": "如上所述，该提案足够清晰，它想为免费的战棋棋牌游戏创建一个MVP，但它缺乏很多关于如何做到这一点的细节。在未来，请添加有关方法的细节，以及在某些时间段的可交付成果（试着为你的项目设想一个时间表，在3、6和12个月的时间里有里程碑）。另外，为了使项目能够被审计，你需要更详细的关键进展指标。目前，提案中只提到在2021年12月4日上线社交页面后，你在Discord上有300名成员，在Twitter上有100名粉丝等，但Project Catalyst需要能够跟踪你未来的进展。为此，设定明确的目标会有帮助，比如说。\"第一个广告活动一个月后有1000个Twitter粉丝，MVP发布后卖出60%的铸币NFT，每个月有一个YouTube视频跟踪项目的更新等等\"。\n一句话，这个提议有很大的野心，从白皮书中似乎很清楚，该团队在这个想法上付出了很多努力，我确实认为，如果他们设法让雪球滚起来，他们就有机会成功，但催化剂需要的很多重要信息都没有，正如我上面所概述的。\n目前，我既不同意也不反对这里的信息足以审核该提案的成功。", "q2r": 3, "assessor": "z_assessor_546", "no_vca": 28, "ne": 15, "ng": 13, "nfo": 0, "vca_o": 2}, {"q0": "Overall, this proposal addresses the challenge posed. Gamers no longer spend time and money on video games in vain. Instead, they can profit in the long run from playing the game. Besides, the game has great meaning, it helps to create motivation to help our ocean.", "q0r": 5, "q1": "The team consists of many experts with experience working in different fields, which makes the implementation of the idea much easier. In particular, 3 people on the team are pioneers of Plutus, which is an advantage.\r\nI have read your plan, the route is quite reasonable. However, you have only designed the website of the game, the game interface will not be released until 2022, as you know, gamers attach great importance to interface issues.", "q1r": 4, "q2": "You mentioned this is a card game, and I think card games can't support AR, if possible you should clarify how AR fits into this game.\r\nI visited your website, but can't see the interface of the game. If the game is released earlier, I think it will bring a more intuitive view for users. I think you should allow users to try it out to experience.\r\nShould be more clear on the Play To Earn aspect.", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 18, "ne": 3, "ng": 10, "nfo": 5, "vca_o": 1, "reply": "You nailed the Impact section. For the second section (Feasibility) you are right at that moment we didn't had a final ui for the game, we will present something at IdeaFest, but nevertheless this will be an iterative process and we will work with users and based on their feedback we will adjust the ui and come with something sutiable.\nAdressing the AR part, currently is just in the idea/vision phase, we have some ideas on how we can implement that, but it's true that we have to do some research and test to come with a prototype. About our website, we currently focus on the characters, universe and the NFT part, but the website is a creature itself and it will evolve in the next months once we will focus more on the game MVP and next versions this will be reflected in the website too."}, {"q0": "This proposal is very well presented both in ideascale and in the recent ideafest presentation. Clearly a lot of thought has gone into the theme and gameplay through Free and Pay-2-earn scenarios, but also how best to utilise the blockchain functionality , incorporating NFT trading, NFT creation & an off chain DAO for artists. There are multiple avenues into this game so should appeal to a large demographic thus aligning with the key objectives of the challenge. More user, transitions, games on Cardano.\nInterest is already being shown. 100 twitter followers quite in the proposal, this is now pass 300.", "q0r": 5, "q1": "The roadmap on the website is great and provides very high level view of the next two years. However for this specific proposal, which is developing an MVP, it is not particularly clear what the steps involved are to achieve the MVP. The proposal really needs a plan vs budget vs deliverables vs milestones to provide confidence in feasibility. At the moment the voter is placing trust in the proposer based on a the website work done to date. This is a simple fix for the proposer, they need to due the due diligence on feasibility and i would suggest they reach out to a project manager/mentor to help with future proposals or presentations to a VC.\nA number of people are named in the proposal but it is not clear if these are actually going to be part of the delivery team. In addition resource profiles are not provided in the proposal or on the website.\nThe is a basic budget breakdown. Senior developer cost of $4000 per month. These are sensible assuming the named resource are simply taking this as their permanent salary and they do not need to engage contract resource which could cost significantly more.\nOn the basis of what i have seen from the ideafest video only have confidence to give this 3 stars.\nThere is a note about recruiting marketing and sales people. This is also a key risk to the project. Mitigation is either a very steep learning curve for the current team or a potential increase in costs if they need to engage a 3rd party organisation to help for example.", "q1r": 3, "q2": "Auditability is difficult to assess as not key metrics or KPI's are given. The key question is how can we measure that the MVP is successful? The proposer should think about measuring community feedback on the MVP and develop some targets to check themselves against. ", "q2r": 2, "assessor": "z_assessor_45", "no_vca": 28, "ne": 10, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "It's a good nft game plan on cardano blockhain written well and clear. \nIt talks about a 50% donation to sea shepard but it is not specified how it will happen. At the link given I can't find specific information. I noted that the proposal justifies this as not yet provable in advance and will be proven later. This is a red flag for me.", "q0r": 3, "q1": "I read the whitepaper and it is well written.\nHowever, it lacks specific details, 6 pages is perhaps too little.\nSome of the team we can look up on linkedin and they all have experience in the field of games and blockchain.\n", "q1r": 4, "q2": "I don't see a detailed plan. Milestones are missing and I would have liked a github repo to track work.", "q2r": 2, "assessor": "z_assessor_361", "no_vca": 28, "ne": 0, "ng": 18, "nfo": 10, "vca_o": 1}, {"q0": "The proposers want to introduce the game World of pirates which is a chess-like game. The game would be P2E and with the earned tokens the player is able to engage in the community and buy in-game chests for rewards. At its core, this proposal fits well within the challenge.", "q0r": 5, "q1": "Looking at the team's experience, they seem more than qualified for this project. They provide the necessary skills required on their website. Concerning the rest of this proposal, I see some inconsistencies. The proposers talk about two tokens (WOP and WOPR) while in the whitepaper they talk about three(PG, WOPR, and others). in the whitepaper, there is no mention of the WOP token which can be bought with ADA or FIAT. The roadmap provided is sound and secure. The budget request is more than sufficient for the proposal, although it is a bit on the high-end. Because of the inconsistency, I'll remain neutral on this.", "q1r": 3, "q2": "The roadmap provided remains rudimental for the proposal. the proposal is for one step within the global roadmap and the proposers don't provide us with milestones within these three months. The KPIs that are mentioned by the proposers refer to the marketing of this proposal, which is perfect for the stage this is in right now. I personally would've liked some milestones that go deeper into the development of this project.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 27, "ne": 1, "ng": 23, "nfo": 3, "vca_o": 1}, {"q0": "This is a game combining chess and NFTs. It has classical chess mode and a battle royale that includes the champion NFTs. I think it's an amazing idea and a proposal to match. I really like the idea of it, as a chess player myself I would try this game out for sure. There's a clear way to add value to the cardano ecosystem through leveraging NFTs and the blockchain integration into the game. I love that this project has well through out KPIs and metrics. That's something I'm missing in some of the other proposals. The team has thought about possible future challenges and how to overcome them and is listening to what the community has to say. To be honest, I don't see anything missing from this proposal. I think it's a great idea with a great team behind it to back it up.  As a developer, I don't see any issues with the team credentials. Overall should be a great game given the described work is put in the next year. Good luck!", "q0r": 5, "q1": "I was able to verify the credentials and skills of the listed people in the proposal. I have no doubt these people will be able to deliver on the game as described in the proposal. The team members count as well as types and specific skills required is clear and that gives me great confort in the success of this proposal. The budget is clear enough and is broken down into understandable parts that are easy to follow. As a developer myself, the roadmap and time frame seem reasonable for the work that needs to be done which shows that the team members have no problem estimating the tasks ahead.  All resources linked in the proposal are relevant and further explain details like how the future process and charity work will be done. The idea is to have royalties from the NFT sales got to charity which is noble. I love the proposers have shown the economic incentives for the players to go on their platform and are not just hoping but have a plan in mind to build a community. Risks and challenges are mentioned in the proposal and have well explained plan of action.  Overall I think the game is feasible and I'd play it.", "q1r": 5, "q2": "Should have no problem with tracability and auditability. The team has an active telegram discord and twitter channels so they'll be able to bring any community members along for the ride while the development is ongoing. Strong KPIs and metrics that would allow community members to follow the success of the project. A clear roadmap and milestones are present in the proposal. The description and problem statements are understandable and well put together. I love the charity cause as well.   I love the proposal and it surely will be a great addition to the ecosystem.", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 26, "ne": 6, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": " \nThe problem needing to be solved has been identified and articulated namely Gamers want to be involved in every aspect of the game they love to play, to have impact in society and to control their in-game assets but in most games they cannot\n \nThis proposal falls within the scope of the challenge brief by creating an interactive NFT game to bring gamers into the Cardano Ecosystem. It will also introduce kids to Play to Earn as well as NFT related Social Causes. It will bring chess players as well as card gamers into this space.\n \nThis proposal shows clearly how it will add value to the Cardano System by bringing many different types of new users. \n \nKey metrics and goals of the proposal been stated clearly namely 300 Members on Discord, 100 followers on Twitter, 50 Members on Telegram, 70 Users registered on our website that they verified their wallets too \n\nKey metrics and goals of the proposal fall within the scope of the challenge.  ", "q0r": 5, "q1": "\n \nThe proposer has provided evidence of relevant skills and experience needed to complete the project. \n \n \nThese links are sufficient \n \n \nI have visited these links and contacted the relevant people\n \n \nI have been able to assess their level of competence.They have a high level of competence.\n\n \nThe proposer know, in an identifiable manner, the type and number of team members required to implement the proposal. THe skills of the team has been clearly laid out along with their experience and history. \n\nThe budget has been outlined clearly and broken down into identifiable items\n \nThe budget is reasonable to achieve the set goals \nTHey have considered many different aspects, including how to create unique NFTS, increase player participation and ongoing engagement through Pawn of the Month competitions and such unique engagements. They also have the chance to get high value NFTs.\n \n\nThe proposer has not provided a verifiable plan if additional funding is required to implement the proposal\n \n\nThe proposal offers a very realistic timetable to complete the work\n\n \n The proposal provide a sensible and conductible plan for implementation that shows not only what is being done. All details have been provided as required \nThey have considered both the gaming aspects, the NFT aspects and the Social Value by creating a connection with Sea Shepherd. \n\n \n The plan describe the resources necessary to implement the proposal.\n \nThe proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation.\n\n \nThe proposer considered challenges and risks relevant to a successful implementation", "q1r": 5, "q2": "\nThere is clearly laid out a roadmap with milestones and a time horizon for achievement\n \nThere are clearly defined Metrics/KPIs that define the success of the proposal\nThese include 300 Members on Discord, 100 followers on Twitter, 50 Members on Telegram, 70 Users registered on our website that they verified their wallets too \n \nThere is a clear understandable description of the targeted problem\n\nThere is a clear understandable solution that addresses the problem\n \nThe proposer has not identified possible hurdles, challenges and difficulties\n  \n\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 23, "ne": 3, "ng": 12, "nfo": 8, "vca_o": 1}, {"q0": "Firstly, the attached website is very good. It is quite complete, both in terms of content and design. We have a lot of information about the project, and we can get to know it in an attractive way. Now talking about the idea itself: this proposal fits perfectly with the objectives of the challenge. The team intends to create a game that is a mixture of several things: chess, stake pool, NFT and donations to an institution dedicated to activities related to the ocean (here we have the explanation of the name of the game, in addition to the characters, that we can meet in the attached website, being pirates and the game's theme revolve around that). In my opinion, this game has everything to work out, because it already involves something very famous and appreciated - chess - with the minting of NFTs, greatly benefiting the Cardano ecosystem since all this would be done through a pool and also these NFTs could be exchanged for ADA. This would automatically increase the number of transactions on our blockchain, fully matching what we are looking for in the challenge - games that increase ecosystem activities. As a bonus, we could still meet one of Cardano's general objectives, which is to promote sustainability, through the donations made (the authors attach a link that is specifically about this, through which we can better understand this part of the donations). I congratulate the team and hope they are funded.", "q0r": 5, "q1": "80 years of experience? In this case, the bidders probably added up the years of experience of each one individually to arrive at this number. This did not make me understand the real experience of the group, that is, how old each one is, and in which areas, etc. It is positive, however, that they already have their developers in Plutus, because from what I've noticed many proposals need these professionals but will still hire them. The presentation of the group is perfect - we have a good description of each member, knowing their names, roles and areas of training. The linkedin profiles were also linked, in the end of the proposal. It is also positive how they leave open the possibility of hiring freelancers for design and storytelling areas. That is, in relation to the team, I believe that everything is in order (I was just confused by this story of 80 years of experience). The money asked for funding is also explained very adequately; we know what each small fraction would correspond to for the execution of the project, even though it is a high value (60k) it is quite understandable for the many people who would work here and also the various activities that would take place. It is a large and complex project. The roadmap is attached on a website (https://www.worldofpirates.io/roadmap), I loved the graphic way they organized the steps, really creative and gives us a good understanding of what would be done and in what order. In addition, from what I understand, the idea is to gradually complete the %, that is, in phase 1, they would update: 20% done, 50%... This would even be a way of auditing the proposal, as I will comment on the next topic .", "q1r": 5, "q2": "Through the attached website, we have a well-organized script with a very attractive design. As I was commenting above, with the passage of time they would update how many % of each step had been done, and with that we could monitor the process. However, unfortunately this is the part that is least addressed by the team, because they do not establish KPIs. They don't tell us exactly some goals to be achieved, they don't predict possible challenges to be faced along the way, etc. We weren't helpless, given the great level of detail about what this game is and how it would all work, but I wish the team had paid more attention to how they audited the proposal. I suggest that they review this part, if funded (I hope!) establish ways for the Cardano community to be able to precisely follow, in addition to the development of the project, the partial results that would be obtained.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 25, "ne": 9, "ng": 14, "nfo": 2, "vca_o": 1}], "solution": "通过我们的F2P和P2E游戏，我们帮助玩家通过向慈善项目捐款来对世界产生影响，并赚取NFT来获得收入。", "experience": "我们是一个5人团队，在基础设施和网络开发、游戏和区块链方面拥有80年的经验--我们中的3人是Plutus先锋。"}