{"id": 414276, "author": "benmahmoudyosr02", "title": "Cardano Tunisia", "url": "https://cardano.ideascale.com/a/dtd/414276-48088", "category": 26599, "amount": 5000, "description": "Tunisia is a developing country where ambitious students with innovative business ideas yet with funds shortage are yearning to dive in the blockchain domain yet struggling to find opportunities.", "f6_no_assessments": 10, "f6_rating": 3.9333333333333336, "videos": [], "media": [], "f6_assessments": [{"id": 1041, "q0": "As mentioned in the other, somewhat similar proposal by the same team, titled “Cardano for MENA”, the idea behind this project is sound and has a good potential to attract students from parts of the world that have been kept further apart because of the language barrier. If this barrier can be lowered, or even better, entirely removed, the impact on the entire ecosystem could be great.\nAs such, I find this proposal to be very well in the parameters of the challenge setting, as they intend to develop an e-learning platform for Tunisian students to teach them about Cardano in an engaging, hands-on way. The lessons will be held in French and Arabic, two languages that the team has researched and found that there is very little content about Cardano in.", "q0r": 5, "q1": "While the feasibility sections of the two proposals the team has submitted are identical, I find that the additional information provided in the impact section of this proposal offers a lot from the missing details I was asking for.\nThere is more documentation regarding the platform and its intended use, as such, I have been able to get a better grasp of what the team intends to do, and even though the details are not very specific, I find the information provided can be sufficient. \nRegarding the budget, I am a little bit unsure if the requested amount can be sufficient for what the team intends to do, as I am still unsure about the complexity of the learning platform, but the mention of “full support” from a software development company from Germany restores a lot of the confidence.\nRegarding the team members’ experience, I think they are perfectly suited to get this project done. What I would have liked to see though, is a clear answer to the question if the team has any other proposals in the same fund, as mentioned, I have assessed the other, very similar proposal in the same challenge. In the answer provided, they could have connected the two proposals and mentioned they are part of the same project and as such, I could have taken some of the extra information provided here and connected it to the other proposal, thus potentially increasing its review mark. But since this information was not provided, even though it is clearly asked for, I am not only not able to do that, but I will, unfortunately, have to take one point for it. The mentioned question is very important, not only to see if the proposers answer honestly in the submission form but also helps the PAs and the entire Cardano community understand what the team intends to do, especially if they have projects that are linked to each other, potentially even completing one another.", "q1r": 4, "q2": "As mentioned in the above two assessments, this section is identical to the auditability section in the other proposal, but with some of the additional information provided in the implementation section, the review will be slightly adjusted to accommodate the additional details provided.\nI feel that the tracking measurements described by the proposer are the basic, general ways of keeping a team going and working on any project, and do not offer any specific insight into how the progress of this particular proposal will be tracked, and most importantly, how the Cardano Community will be able to track its development: “Establishing clear deadlines for every task”, “Setting specific goals and deliverables throughout the project” etc. The team should have posted clear metrics that they will use to check if the project’s progress is on track. As a quick example that comes to mind, tracking the number of students who enroll on the platform or the number of teachers willing to share their knowledge etc. would have made for some clear, verifiable metrics and the team only would have had to decide on where they would publicly track these. It could either be on a website, discord server, miro board or google sheet etc.\nGoing into the next section, the first answer to the success question is “Maintaining the fixed budget and not exceeding it”,  and even though I sense there is good intention behind it, I find it feels weird to read it as a success base for an entire project and casts doubt over the previous section of feasibility that contains the budget decided by the team as being sufficient.\nIn conclusion, I find the entire auditability section a bit too ambiguous and cannot correctly estimate if the project can be successfully tracked for its progress, as such I will be taking a neutral stance on this aspect.", "q2r": 3, "assessor": "z_assessor_2192", "no_vca": 16, "ne": 4, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 1602, "q0": "The idea itself is fully aligned with the objectives of the challenge, in addition to the fact that the proponent argues very well which issue is the problem to be solved. One of the biggest difficulties for our blockchain to become global is the language barrier, so much so that this was the subject of a specific challenge in previous funds. As the proponent states, there is a lot of educational content about Cardano in English, available online, and the objective here would be to generate knowledge in languages ​​compatible with Tunisian students, so that they can concretely learn about the cryptographic universe, more specifically Cardano. The proponent points out several problems currently encountered by this audience, such as “lack of guidance on where to start when learning blockchain technology and lack of learning platforms and events to learn cardano in French and Arabic”; also indicates how blockchain technology can be beneficial for various economic sectors. In other words, theoretically, the proposal meets exactly what we are looking for in the challenge: to correctly and safely instruct students about the technologies relevant to our ecosystem. In addition to this main point, this proposal would also help to disseminate Cardano to an audience that does not have easy access to such knowledge. The problem I identified here was, mainly, the lack of detail regarding what would be created. We know that it would be an online, e-learning platform, that the contents would not only be theoretical, but also practical (students would need to present a final project to receive certificates). However, some important points were missing: would the platform be completely free? How would it be disseminated to students, how could we draw students' attention to the topic? How to make them realize the importance of this? And, the most important point I think would need to be included: what topics would be covered specifically, and in what order? They would probably be taught the initial concepts first and then move on to more in-depth questions, but I still think this could be better defined. For example: the course would have a total of 10 videos, the first being an introduction to the cryptographic universe, the second focused on Cardano, etc. For these reasons, I believe that the proposal is in line with what we are looking for in the challenge, but it still leaves something to be desired in terms of specificity.", "q0r": 4, "q1": "Unfortunately, the script of the proposal is explained very superficially. It is attached in a table, which we can see through the given link. Some activities (front-end development, internal process, course promotion to students, website design, etc) are delegated for a total period of 3 months. It is not possible to understand with solidity what would be done, when, by whom and in what way. All we know is which tasks to complete and the total time in which they would be carried out. Ideally, the proponent would explain what would happen (at a minimum) each month and that these activities would be more detailed. For example, how would the website design be developed? What kind of visual identity do they want to create? What would the platform's publicity campaign look like, through which media would they be disseminated? I believe that all activities should have been explained in a more specific way, so that we had a more concrete understanding of the whole. That said, this part of the script leaves a lot to be desired, unfortunately. Now, talking about the budget, this one is also explained in a superficial way. It would be 1500 dollars to pay the instructors, but how much? How many hours per week would they work? What, then, would be the value of your working hours? Why would marketing cost $500, how would the strategy be done? It would be necessary for each value to be better argued, regardless of whether the projects are of high or low investment, it is always necessary to understand why such a financial amount was requested. The team's presentation is also not very detailed. We generally know how the team would be made up, with a programming specialist, 2 computer science students and also with guidance from some active and experienced members of the Cardano community. But we don't have specific information about each. We don't know, for example, the name of the programming specialist, or even the students. We do not know their resumes, what they have produced so far in their training, if they have any solid connection with the technologies of our ecosystem, and if so, which ones… that they have done until today. In this way, we would have more confidence in relation to the preparation of this team to deal with the issues addressed in the project. For these reasons, unfortunately, I consider the proposal not very viable, we have no way of understanding the process because there are no phases, the activities are not well explained; the funding is also not as detailed and the staff is not properly presented.", "q1r": 2, "q2": "The proponent suggests valid ways to track the process, such as “setting clear deadlines for each task will keep team members on track” and “setting specific goals throughout the project”. However, the ideal would be that such goals and deadlines had already been defined since then. For example, what would need to be delivered at the end of each month? How can we monitor the work of professionals in relation to the construction of the site, whether in the programming, design, marketing part? How can the entire process be monitored periodically and concretely by the members of our community? In view of these doubts, I believe that it would be important for the proponent to provide us with more support, solving all doubts that may arise when it comes to how things are being done, what advances are being observed (even if small), what difficulties emerged in the process and so on. My suggestion is that the proponent and his team determine some methodology for monitoring the tasks (for example, I've seen that some teams use the Agile methodology to control the processes); for advances to be reported to the Cardano community, either through written reports, a checklist of tasks could be created on the website itself, or even that these updates be released through some of the team's social network, for example. Now, thinking about the end results, we know that the main goal is to introduce “as many students as possible in programming and blockchain and training them so that they are fully ready for the professional world”. The proponent also makes clear the intention to build a recognized platform. But how can we ascertain the impacts of all this for the Cardano ecosystem, in a solid way? It would be important, in my opinion, for a survey to be carried out with these students, after the course, to understand how they are using the knowledge obtained, if they are participating in the construction of any Dapp, if by chance they have become active members of the Cardano community and if yes, in what way… In other words, we understand the consequences of this online course, in addition to the number of students involved in the conceptualization of the site. For these reasons, I think auditability still has a lot to improve. Ideally, further research should be carried out, in order to accurately understand the consequences of the project, and to be able to verify if, in the end, it matches what the challenge asks for.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 11, "ne": 5, "ng": 3, "nfo": 3, "vca_o": 1, "reply": "Impact / Alignment:\n-''And, the most important point I think would need to be included: what topics would be covered specifically, and in what order.''\n=> Our content will be divided into 3 main parts:\nwe will have three parts:\n- Cardano for beginners:\n    * Basic concepts of blockchain technology\n    * What is cardano\n    * What is ADA\n    * What is a Wallet\n    * What is project catalyst\n    * etc..\n- Cardano for intermediary\n- Advanced Cardano.\n''would the platform be completely free?''\n- The purpose of this project is not lucrative.Indeed, our target audience of Tunisian students faces financial difficulties as a result of the country's financial problems, as well as limited opportunities in the field of technology. Therefore, our platform will provide completely free educational content in Arabic, which might become the first platform to provide such content in Arabic language.\nAuditability:\n-'' For these reasons, I think auditability still has a lot to improve.''\n=> The PA was heavily critical in this section and yet scored 4 stars.\n-''How can the entire process be monitored periodically and concretely by the members of our community? ''\n=>ck its development''\n=> We will present monthly reports for the catalyst community considering our progress and we will make sure to receive constructive feedback from the community to improve our project's quality and based upon which we might adjust our planning.\nIndeed, Every phase of the project described in the Feasibility section will be fully visible to the community on our website https://www.explochain.com/.\n-Additionally, we aim to track the number of students enrolled in our platform and most importantly receive constructive feedback from learners to improve the platform's quality by arranging Zoom meetings to submit feedback and fill the out surveys regarding their learning experience which will be the most accurate criteria defining the success of the project as we mentioned in our proposal.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"id": 3424, "q0": "idea is good as learning platforms are always welcomed, specially when they can deliver the content inlanguages other than english. More specifically, Cardano indeed has not a lot of content in French and much less in Tunisian so this can add value to ecosystem and make cardano more accessible to other countries. Proposal also addresses the challenge as the main focus is students, to be attracted to catalyst and bring their ideas.\nHowever, it could have more information here on who would be the \"skilled and experienced instructors\" or even how proposer would recrute them. \nThe risk part is well done with several risks identified and mitigated. I liked the communication/marketing plan is already outlined.\nAs further suggestions of next steps or even a scope expansionn in the future, it could be provided some guidance/introduction to catalyst as the course approaches its end. Catalyst information is pretty much avilable in english so this help in the begining would make students more confortable in proposing.", "q0r": 5, "q1": "There's an online spreadsheet with a very clear timeline provided, where its possible to see the activities and how they are distrivuited along the weeks. However, its seems strage to me that the creation of educational content will only be done after the promotion of the platform in the social media. If I receveid an ad to learn something new, clicked on it and there's no content, I wouldnt use or reccomend the platform anymore.\nRegarding the budget, there's a fair budget breken down by the main acitivites in the plan. it is also right on the limit of the challenge (5k dollars)\nAs for the team, it seems to have 2 people and count with the support from Oussama Benmahmoud, an active Cardano/Catalyst memeber. However, the exeperiences and competencies of the 2 people involved could be better described just as their roles in the project.", "q1r": 3, "q2": "the metrics or milestones are not very defined in the proposal and som of the proposed ways to track progress is really subjective (\"Communication between the teammates is the key to make sure that the project is running smoothly and everyone is getting their tasks done on time\" or \"introducing the largest possible number of students to programming and blockchain (...)\"). Some SMART kpis should be provided as the number of users and time spent in the platform with goals defined. It's possible to extract some milestones from the timeline thgough, it just needs to be comunicated in an open manner as project evolves.", "q2r": 3, "assessor": "z_assessor_2461", "no_vca": 17, "ne": 0, "ng": 17, "nfo": 0, "vca_o": 1}, {"id": 6091, "q0": "Tunisia is a country in North Africa, on the African continent, with a population of 11.82 million (2020), is a developing country where ambitious students with innovative business ideas but lack of funds are hungry to dive into the blockchain space but are still struggling to find opportunities. The author of the proposal came up with the idea of ​​providing Arabic content about Blockchain and Cardano for students. It is proposed to create an e-learning platform that provides education and knowledge enhancement for students at the EL MANAR university campus in Tunis. Educational content will no longer be exclusive to English speakers. Which provides information in French, Arabic and Tunisian dialects. Proposing and impacting on the challenges posed and described in detail and specific solutions. Besides, the author also recognizes the risks in the project. At the same time, the author has prepared solutions to minimize risks when the project is implemented. Ensure project success.", "q0r": 5, "q1": "The author of the proposal provided us with the information we needed to evaluate this section. The first is about the route. The author has provided the detailed path, we have checked and know that the roadmap of the project is laid out in 3 months. And each month is divided into weeks and clearly states the work to be done in the project. The board provides very specific route information. We know the work will be done, in what time period. Detailed roadmap ensures progress, and success of the project. Next is the budget. The proposal requires a $5,000 budget. This is a fair value for the work on the project. The budget is clearly allocated for each job. Finally about the team members. We know the identity, qualifications of the members. Especially the group is supported by Oussama Benmahmoud, a Cardano and Plutus Pioneer community member. We were also given the university's email address so that we could contact them. The proposal has a detailed roadmap, transparent budget and qualified members to implement the project. Proposal has good feasibility.", "q1r": 5, "q2": "The proposal is completely new, however the planning capabilities of the proposal are very good. Detailed and coherent route. The budget is properly allocated and transparently explained. In addition, the proponent has provided metrics that make it easy for us to measure and track the progress of the project. As for the final product, that is what the success of this project is expected to be. I believe that the information is complete and satisfactory has been established. If the project succeeds and develops in the right direction, this will be an open door for communities, students who speak French, Arabic and Tunisian dialects. Cardano ecosystem development.", "q2r": 5, "assessor": "z_assessor_2786", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 6964, "q0": "   -  Maybe many people know Tunisia is a small country located in Africa where it has a growing economy has ambitious students with innovative business ideas but they don't have many ways to approach Cardano technology with the idea of ​​bringing Cardano to Tunisia is a very good idea. Here I see the team raised the very specific issue of Creating the first educational online platform that provides Arabic content on Blockchain and Cardano specifically for motivated students and prospective entrepreneurs. I think the problem stated is very relevant and essential for scaling in the solution description the group has given a lot of solutions and the solutions are all very well defined. However, I don't see any specific research evidence yet. As for risk management, I see the group has identified six risks that the team may face. however, the group has not yet outlined a plan to deal with those risks.", "q0r": 4, "q1": "    -  When asked about providing a detailed project plan and timeline. I see that the group has stated a milestone that is 3 months to complete all the work. I think with this timeline is reasonable to complete the tasks set out. With a budget of 5.000 $ and has been broken down into five items as stated. I think such distributions are very reasonable. Regarding the provision of team members. I see the group has mentioned a few members who have a division of work for each specific person. However, the members' identities are not easily verified. When asked If funded, would you return to Catalyst in a later round for additional funding. the team answered yes and was looking forward to it which made me appreciate this very much.", "q1r": 4, "q2": "in the measurement description to track the progress of the project. I see that the group has mentioned 3 specific indicators as mentioned in the article. successes have also been reported. and there are at least 4 significant successes mentioned. when this project comes into operation. However, this project just stops at the idea section. but have never been tested in practice. This is a completely new proposal so it has not been funded yet. however I found this project to be quite cool. I hope your project will be supported more by the community. and be more successful.", "q2r": 4, "assessor": "z_assessor_2856", "no_vca": 14, "ne": 0, "ng": 8, "nfo": 6, "vca_o": 1}, {"id": 9293, "q0": "\"The project tackles the challenge effectively. You give each specific challenge and have a plan to solve them.\nGiven the challenge As an Arab country, speaking a Tunisian dialect and having French as a second language, students often struggle to find relevant content about the Cardano blockchain so what is the solution to this challenge? what? There are many online resources available to learn Cardano in English online. And to build a single hub for students in Tunisia, containing learning materials in French and Arabic, presenting events, and providing user information about Cardano news, I think a team is needed. Good translation team so as not to misunderstand Cardano, you need to come up with a more specific solution that is to build a team of experienced translators... The idea is not too new, but you guys have come up with good suggestions. and identify possible risks. \"", "q0r": 5, "q1": "I find the detailed plan you gave is not clear and specific. You said that 3 months is enough time to complete the project. But how do you plan to split. How should you divide by week into specific work each week? The detailed budget breakdown is also unclear. You need to have the number of hours worked multiplied by the amount. Besides, how much is the total amount needed? Details about team members were also not made transparent. No experience, no links, very generic. I do not rate high. You should add more. Hope you guys will do better on the FEASIBILITY part.", "q1r": 3, "q2": "What are specific goals and deliverables throughout a particular project? You should clearly state your goals. You suggest setting clear deadlines for every task that will ensure team members stay on track. So what is the clear deadline? You need to give specific deadlines, have timelines with specific jobs. There should be a number that shows how successful the project is, how many students are involved, and how involved they are. There should be surveys to capture the extent of students' understanding of Cardano. Hope you will do more details. Here are a few of my suggestions.", "q2r": 3, "assessor": "z_assessor_3046", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9820, "q0": "This is an amazing proposal by all standards. I appreciate the fact the proposer has thought of a major issue facing his community and is planning on ways to mitigate such a problem. The project plans to create an online educational platform, which will enable learners to improve their knowledge of blockchain technology(Cardano blockchain). The content on this platform will also be provided in Arabic, as the team looks to break the language barrier that prevents most students in Tunisia from accessing educational content about blockchain technology online. I also acknowledge the fact that the team plans to make this platform different from other e-learning platforms, by making it not only a theoretical learning platform but also engaging students in certain practical activities at the end of each course.\nThis proposal also does well to address how the team plans to mitigate potential risks that could hinder the success of the project. There was a mention of a series of marketing activities to help promote the platform and ensure that a significant amount of students enroll in the platform. They also plan to make this an interactive platform where students would be graded for the completion of each course, and also assessment and quizzes organized. Also, zoom meetings will be held to receive feedback from students about the experience on the platform so future improvements could be made. I also appreciate the fact that the team will mentor and assist these students all through the program\nI believe this project will be very beneficial to the community, as new members will be onboarded, and ambitious students with business ideas who lack funds could also be funded in the catalyst community. As students are exposed to Cardano blockchain and the numerous opportunities it can provide, student entrepreneurs who have ideas but lack funding will know how to link up with engineers and develop their ideas and also gain easy access to funds.\n", "q0r": 5, "q1": "The proposer provides us with a spreadsheet document that details the roadmap leading to the completion of this project. From the plan, this is going to be a three-month project, which is divided into subsequent weeks, with each activity and the corresponding week stated. I would have loved it if the proposer could develop this into a scheduled type of plan, where specific dates are provided to enable easy track of events.\nTeam members of this project are clearly stated, with their area of expertise and activity to be performed made known. The team will also collaborate with another person who is known to the Cardano community and has the requisite experience to help in the successful implementation of the project.\nThe budget is broken down into substantial amounts, each with its corresponding item. The details of the budget is appreciable, though major items on it could have been further explained. Website development takes a major portion, but there are not enough details to ascertain what will go into the development phase.", "q1r": 3, "q2": "The auditability stage lacks a bit of details but has clarity. The proposer provides us with KPIs that could be used to measure the success of this project.\nHowever, I recommend that the team establishes some form of communication between them and the community, where they could indulge the different minds of community members to see to the successful implementation of the project. This will also provide an avenue for them to provide timely reports on the progress of the community. I would also suggest that community members are invited to the platform after its completion, to provide relevant feedback. All this will make for the completeness of auditability.", "q2r": 3, "assessor": "z_assessor_3106", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11121, "q0": "\"This proposal caters well to what the challenge is looking for. The goal of the challenge is to fund proposals that can attract new students to the Cardano community, they may be future proponents, and provide an opportunity for them to network with engineers. The idea of ​​this proposal is aimed at students in Tunisia, which is a developing country, who want to create an e-learning platform (in French and Arabic) that provides an educational background. education and allows learners to enhance their knowledge of basic blockchain concepts taught by skilled and experienced instructors. After completing each course, the students will carry out a collective project and will be evaluated by the lecturers to achieve a certificate. The implementation of this project will contribute to dedicated students from all over Tunisia striving for excellence in the field of programming and especially building DApps on the Cardano blockchain while finding ambitious students with creative business ideas but lack funds and connecting them with global engineers in this engaging community who are ready to support their project ideas.\nIn my opinion, the idea of ​​the proposal is very good, in the challenge and risk section, the author has listed 4 challenges that they may face. Also came up with some options to deal with them, which is great. However, in the 2nd challenge \"\"Inability to provide accurate information for beginners and difficulty in assimilating blockchain concepts that students are unfamiliar with\"\". Their solution is to \"\"simplify educational content as much as possible\"\" which is also believed to be one of several ways to tackle the challenge. However, in my opinion, it is not convincing enough, because I don't know how you will simplify it, is it suitable for the content or not? This is worrisome because the main goal of the proposal is to educate students on blockchain and Cardano knowledge, which will be troublesome if such information is not conveyed correctly. Although the team also mentioned that they will be supported by Oussama Benmahmoud, a Cardano community member, and Plutus Pioneer, I don't know where he will support them. The solution to this problem in my opinion is to find more members with teaching skills as well as knowledge and experience in the blockchain field that will help the above problem be solved easily.\"", "q0r": 4, "q1": "\"In my opinion, the feasibility of this proposal is temporary. First, about the roadmap, we know this project will be completed in 3 months and some basic activities will be carried out. There is an attachment provided, we know what activities will be done in what period. It is explained what will be done, in a very specific way\nRegarding the budget, the requested value is $5000. I think this part should be explained more clearly, even though the amount requested is not high, this does not preclude the need to be detailed amount to be used. We know what the total amount is spent on, however, they can explain better. For example: \"\"payment to teachers: $750\"\" \"\"we need to know how long the teaching time is, and how much their salary is in US dollars/hour? Same for other expenses. which proposed enumeration can also be explained in more detail.\nAnd finally, about the project team, I think this part is pretty superficial. The team is described as \"\"consisting of a programmer who acts as a project manager, mentoring the team, measuring project progress, and driving the project while remaining in contact with qualified instructors. skills \"\"and \"\"Yosr Benmahmoud, a computer science student, and Manar Bennaceur, a Pre-Engineering student at the Tunis Faculty of Science, are both hardworking and dedicated students who will develop background, design and innovate an attractive logo from the start\"\". However, we don't have any specific information about Each of them. What is their name, and what their experience is relevant? What is the role of each member in this project? I think the proponent should attach a resume as well as a link to the project members so that we can understand more clearly whether they are a good fit for the project. In this way, the team has more confidence in their ability to successfully execute the project.\"", "q1r": 4, "q2": "\"As for measuring project progress, it is said that \"\"Setting clear deadlines for every task will ensure team members stay on track. Set specific and achievable goals throughout. Communication between teammates is key to ensuring a project runs smoothly and everyone completes their tasks on time.\"\" It seems like these are some of the ways for the team to track the progress of the project. the project, project is not a way for the community to follow this project. Progress indicators are very local and do not provide enough points for the community to gauge a project's progress. While they may be meaningful to the proponent, these metrics should ensure that the community can evaluate the development of the proposal independently of him. The proposed team has not come up with any KPIs to determine the success of the project. In my opinion, the KPI in this project could be the number of students participating in the teaching sessions, the number of courses, the number of participants in the Blockchain knowledge session, the number of quality participants, and the number of participants who catalyze a new project in Tunisia ...... And importantly, there should be a place where the proponent can update information on the progress of the project so that the community can easily follow.\nNow about the results, this seems to be the best part of the project. I think the author is very conscious of what he is going to do and what he can achieve. The success of the project is also closely related to the challenge of the campaign. However, as noted above, the project needs to add KPIs as well as how the community can monitor this project.\"", "q2r": 3, "assessor": "z_assessor_3223", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 12594, "q0": "The project effectively addresses the challenge, an educational online platform about blockchain for Tunisian students. I support this project because university students will be attracted to new technologies that have the potential to develop their country.\nThe solutions you offer are quite exhaustive, but can you elaborate on how you track students' skill progress through an online platform?\nTeamwork is always a good way to learn, also you should organize some activities like prizes for the NFT innovation contest, I think this will help the students get acquainted with blockchain.\nI very much welcome finding aspiring students with ideas and connecting them with engineers on the Cardano community supporting their project ideas, and with trading and paying in ADA, All of this will help Cardano grow even stronger.\nRegarding the problem of solving the confusion of students who are still new to blockchain, I think this is not a big problem because with the curiosity of the students, they will soon overcome this.\n", "q0r": 5, "q1": "We have the necessary information, but not to a degree of detail that I find satisfactory. The plan given is too vague, because it does not clearly define the products to be delivered at each stage in the roadmap, There are no specific timelines and the goals given are quite superficial. Regarding the budget allocation, I think it is not suitable. The amount offered for the salary of the project person may seem low, but it is probably a result of the position of the proponent and their respective local economy. However, it is still not practical because there will be many other costs incurred in the implementation process. I would suggest the proposer add additional how the money will be used to bring the product to market, and the roadmap.", "q1r": 4, "q2": "Unfortunately, the proposal doesn't make it clear anything significant regarding how the project will be tracked, reported, and audited. I think in terms of success, things are still very abstract, the author needs to identify the exact ways we can feel the real impact of the project on Cardano's blockchain. I recommend providing public GitHub repositories, regular YouTube updates, or even by creating websites to report and communicate like previous successful proposer.", "q2r": 3, "assessor": "z_assessor_3445", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 13355, "q0": "Creating an online platform providing Arabic content about Blockchain and Cardano? Is there a mistake here? Or do you mean to create an online channel on a certain platform (for example, an online channel via Zoom, via Google or any other social networking platforms...)\nBut I can also understand your desire to bring blockchain and Cardano knowledge to Arabic and French speaking people, specifically initially university students in the host country.\nSo first of all this proposal of Yours is perfectly suited to this challenge in Fund 9, which expands information about Cardano to developing countries, with a student population of up to 4000 at EL university. MANAR then surely many of you will have a passion for blockchain and Cardano. I support your suggestion.\nHelping them understand Cardano and the many opportunities open to them with their Catalyst program will help them not only gain more knowledge about blockchain, but students can also earn extra income from the jobs that they do that Cardano ecosystem bringing in.", "q0r": 5, "q1": "Creating an online platform providing Arabic content about Blockchain and Cardano? Is there a mistake here? Or do you mean to create an online channel on a certain platform (for example, an online channel via Zoom, via Google or any other social networking platforms...)\nBut I can also understand your desire to bring blockchain and Cardano knowledge to Arabic and French speaking people, specifically initially university students in the host country.\nSo first of all this proposal of Yours is perfectly suited to this challenge in Fund 9, which expands information about Cardano to developing countries, with a student population of up to 4000 at EL university. MANAR then surely many of you will have a passion for blockchain and Cardano. I support your suggestion.\nYour plan has 3 months and specifically 12 weeks to execute, You have broken down the work for each week, which is commendable. However, you can summarize in the Feasibility section for reviewers and the community to see more intuitively and quickly.\nBut why in the plan, I don't see any content about Blockchain and Cardano, I only see general keywords like: \"doing research, finding, informing instructors, oinline platform, social media, content translation. If possible. , You should break it down and be more specific, it will be better.\n- In the cost section, you have broken it down, this is very good but not enough. Need to be more specific, it will be more reliable, for example:\n  + Website development: develop on any platform (Woodpress, Joomla, .... php, ..), server rental fee (hosting, VPS, Cloudserver), where to buy domain name, domain name maintenance fee in how many years?\n + pay for teachers: Who do you hire with their major, how much does an hour of teaching cost, and how many hours do they teach?\n  + Where will the social media and web marketing section communicate and market, on what platforms?", "q1r": 4, "q2": "- The information you provide to measure and track the progress of the project is only good but not good, the parameters do not have KPIs or milestones.\nFor example, How many students will you get into your plan (50, 100, 200, or a specific number)?\nAudit the advertising by seeing how many website visits, how many registrations\nOr after completing how many people join Catalyst, how many will you do PA,\nAudit of ADA users by how many Yoroi wallets are initialized, or any other wallet on the Cardano platform, the number of ADA wallets will have more confidence than the number of subscribers on Your platform.\nHope you will succeed and bring good things to the community in Tunisia.", "q2r": 4, "assessor": "z_assessor_3616", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "To create the first educational online platform that provides Arabic content about Blockchain and Cardano, which is further dedicated to motivated students and future entrepreneurs.", "experience": "A computer science student at the Faculty of Sciences of Tunis. The university is ultimately a prestigious and competitive faculty. I have also been an active member of student associations, such as the IEEE computer science chapter and the Free Software Club."}