{"id": 414210, "author": "ddlezu01", "title": "Cardano Peer Education", "url": "https://cardano.ideascale.com/a/dtd/414210-48088", "category": 26599, "amount": 5000, "description": "Many Business and Engineering students got brilliant ideas to impact their society but there is no funding opportunities for these students, therefore Project Catalyst would be ideal.", "f6_no_assessments": 35, "f6_rating": 4.571428571428571, "videos": [], "media": [], "f6_assessments": [{"id": 2055, "q0": "The problem is that many Business and Engineering students have great ideas to impact their society but do not have the opportunity to sponsor these students. And the solution to this is to introduce Project Catalyst to Business and Engineering Students, mentoring and vetting their business projects and innovative ideas, and assisting them with submissions through Project Catalyst. The proposal is within the challenge target because I think this implementation will be core to the Cardano community that will help more student developers to come to the Cardano playground and grow in the future. A great thing about this is that the proponent clearly defines the goal to be achieved through the entrepreneurship education program of Project Catalyst: Improving the entrepreneurial mindset of young people to help them be more creative and confident in their work. whatever they undertake and enhance their attractiveness. Encourage innovative start-up colleges; Enhance their role in society and the economy. It can be seen that the goals of this proposal are completely aligned with the overall goal of the challenge and do it directly and simply, so in my opinion, it deserves the maximum score in terms of impact.", "q0r": 5, "q1": "The feasibility of this proposal is very high. First talking about the project team, we have a complete and satisfactory description of the members, including his training area, time of experience, branch he worked/operated, and even multiple LinkedIn, Twitter, or telegram profiles are attached where we can get to know him more intimately. We also know the affiliation of the members to Catalyst, all of whom are active members and also hold a certain position in the Cardano project catalyst community. So for a project as simple as this, I have complete confidence in their ability to execute successfully. Next on the roadmap, the proponent provides a roadmap with an estimated timeframe attached. The time to complete the proposal is quite short, in just 8 weeks, we know well what will happen in each subsequent stage, i.e., our visualization of the process is quite solid. And finally, about the budget, $5000 was requested and we understand their purpose very well. So, in my opinion, the budget is completely reasonable", "q1r": 5, "q2": "The audibility of the proposal is also considered very closely. We can fully track the progress of the project based on the information provided by the team through the monthly report form and the Catalyst Coordinator Chat group on Telegram and on the Wada website. https://www.wada.org. Besides, the team provided some KPIs that are very suitable for us to understand if the project is achieving the expected results, such as 10 students mobilized per University, 50 Students Business and Engineering students will be able to join Project Catalyst to contribute to various roles, At least 50 new Cardano wallets will be created for students of each university (Yoroi, Nami, CC Vault)...Again, KPIs are very clear and consistent with the definition of success emerges a good understanding of the target problem. I agree that the recommended success criteria and metrics are precisely set to measure progress in tackling the challenge.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 20, "ne": 5, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 10286, "q0": "\"We recognize that the purpose of the proposal is to create a platform that uses Cardano technology to enable, Blockchain and Cardano Arabic, to give more independence to entrepreneurs. Learn to engage in Arabic and the possibility of profiting from it. Given these characteristics, it can be shown that the proposal is suitable for the range of challenges in question. However, some doubts arise about the ability of the project to actually live up to what it proposes and make a positive impact on the Cardano ecosystem.\n\nIt can be seen that the platform is going in different directions, but the general idea that we see is that the project tries to take on many challenges and provide a lot of complex functionality at first. We can explain this point of view with the following opinion, we know that there is a barrier that needs to be overcome in order for the proposed format of business and students to reach many fields. But we recognize in the proposal that there is a concern to attack many of the methods of this commercialization, in fact, it is not yet well rooted; For example, regarding Arabic language learning, we observe: Arabic implementation, foreign language exchange, streaming. Perhaps it would be interesting to establish a more direct path at first. At the same time, this foundation also involves further learning, material and the goal of creating a community around Arabic.\nThis seems like a very bold attempt at the first approach.\"", "q0r": 4, "q1": "\"This proposal is aimed at the challenging setting of “conceiving an idea and building a single center for students in Tunisia,\ncontains learning materials in French and Arabic, presents facts and provides information\nusers of the Cardano news”, but many times during the “Feasibility” section, it was supposed to look like the framework would be more widely adopted. Proponents should clarify the intent of this funding round. The budget breakdown is very specific with clear and concise descriptions for each section. There are even plans for the development of a program to build the cardano block chain of DAPPs to help active and creative students develop their capacity, to confirm the commensurate value of the funding. Good job. I believe the project can do exactly as suggested by the team.\"", "q1r": 4, "q2": "\"Yes, the project is easy enough to test, if a programmer acts as a project manager, team leader, measures project progress and drives the project while still being in contact with qualified instructors. skill.\nof the proponent. As mentioned before, the project usable report will be fully supported by Oussama Benmahmoud, a Cardano community member and Plutus Pioneer, as well as his company PeakSoft GmbH, a company Software development company based in Germany.\nYou can contact us at the following university email addresses:\nYosr.benmahmoud@etudiant-fst.utm.tn\nManar.bennaceur@etudiant-fst.utm.tn\n, would be better for the project. It wouldn't be difficult to have a team reporting for Catalyst alongside their own channels, to provide highly summary overviews of funded proposal progress. This project is a project in itself, and in many test requirements. If the team finds success at work, it should be shared with the community and applied across all challenge settings. Good luck.\"", "q2r": 4, "assessor": "z_assessor_3171", "no_vca": 14, "ne": 0, "ng": 9, "nfo": 5, "vca_o": 1}, {"id": 11179, "q0": "Yes I believe this proposal effectively addresses the challenge.  Reaching 50 students in STEM would really help to bring some of the brightest minds into Cardano.  I also like the fact that this proposal is targeting African students.  This could be a great opportunity for many students in this developing continent.", "q0r": 5, "q1": "Yes, they have an incredibly well put together team with lots of experience.  The roadmap looks to be well put together and is not rushed.  I also like that they are reaching out to 5 separate universities instead of just focusing on one.  This will give the project greater reach and possibly bring on more students than they are anticipating.", "q1r": 5, "q2": "They will be using the Catalyst Coordinator Chat group on Telegram and on the Wada website.  They have also identified 5 key metrics than can be measured and audited.  The true measure of this audit will be how many students show interest in Cardano and in project Catalyst.  And subsequently if any of them submit innovative ideas for Fund 10.\n", "q2r": 5, "assessor": "z_assessor_3230", "no_vca": 14, "ne": 0, "ng": 8, "nfo": 6, "vca_o": 1}, {"id": 11754, "q0": "“Cardano Peer Education” is a good idea associated with the challenge setting. The solution the authors came up with was, to introduce Project Catalyst to business and engineering students, mentor them to implement proposals, and help them turn ideas into proposals that received Catalyst funding. The purpose of the solution is, to help students who have an idea but lack the funding to implement it. This is exactly what we're looking for in this challenge. The idea the team came up with is direct and highly practical, but I don't know if the team will implement this idea across the African region or just in one or a few African countries. This is not mentioned by the group, leading to the community lacking information to assess the scope of the solution's impact. The list of 5 universities that the group plans to implement the idea also does not have specific information as to which universities and which countries in Africa. Regarding the risks affecting the success of the solution, I personally think that the team should consider some more risks that may be encountered. For example, one is the risk that students are uncomfortable and unwilling to participate in Catalyst; secondly, the risk that the expensive internet costs students have to pay may affect the quality and their ability to participate in the project… To limit this risk, I suggest the team should have some incentive rewards for students with good ideas and selected for training to participate in Catalyst. This award should be awarded in installments: as soon as the student is selected for Catalyst training, and after the student has a completed proposal submitted to Catalyst. Because of some unclear information mentioned above, I rate 4 points on the impact of this solution.", "q0r": 4, "q1": "Regarding the progress and budget to implement the solution, I consider the information given by the team to be complete, detailed, and clear. Specifically, the solution implementation roadmap is expected to be implemented in 8 weeks by the group, including 3 phases, with specific plans for each phase. Two Cardano / Project Catalyst workshops with Students are planned by the team 4-6 weeks after funding. However, the size of the workshop and the number of participants were not mentioned by the group. This has to do with the estimated $650/workshop budget I think needs to be clarified. For example, conference room rental costs (unit price $ per square meter or according to the number of attendees), banner advertising costs, and on-site conference service costs (printing materials, water, etc.). Clearly dividing each item into detail with unit prices like this will help the community understand how the budget money is used. Similarly, advertising and marketing cost $500 but I don't know what platforms the team will advertise on, what is the unit price, and how long it takes... About the team, I rate them enough skills and experience with Catalyst to guide students to become more involved in Catalyst in Africa. Personally, I rate the project as likely to succeed, but due to the lack of budget details, I rate this item 4 points.", "q1r": 4, "q2": "Regarding the auditability of the proposal, it is highly commendable for the team to have provided KPIs that measure success with specific and clear numbers. The community can easily track these success metrics on the shared group website https://www.wada.org/. This is exactly what we expect from a proposal. The community through these numbers can easily audit the success metrics of the proposal. Here, the most important criterion I evaluate is the number of 50 students who can submit their innovative ideas about the Catalyst project to Fund 10, out of 50 students selected to participate in the training project of the team. The rate of reaching 100%, this number is very impressive. If approved by the community, I very much look forward to the group results that have been achieved as promised. Therefore, I rate 5 points on the robust auditability of the proposal.", "q2r": 5, "assessor": "z_assessor_3279", "no_vca": 16, "ne": 5, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 11793, "q0": "I found the Cardano Peer Education project to be a perfect fit for the Challenge & Scouted for Students challenge. The project aims to bring to life the great ideas that have a real impact on society by business and engineering students in Africa, specifically Ghana. In addition to connecting and creating opportunities for students to know and seek funding from the Catalyst fund, the project also solves the main problem that the challenge poses, which is to provide students with a place to live let them freely provide their ideas and actualization them.\nI see the uniqueness of the proposal as a bridge to introduce the Catalyst project to business and engineering students, ensuring there is investment to promote a business project. The Cardano Peer Education proposal helps students become more aware of their work, so they can seize the opportunities that the project offers, creating a foundation for students to be active in society and the community in the future ecosystem.\nI completely agree with the author's argument when providing solutions for this proposal. Entrepreneurship education will have a positive impact on a student's entrepreneurial mindset, entrepreneurial orientation, employability, and role in society and the economy. Once successfully raising capital, they will initially develop their projects, bridging the gap between the young generation and donors. In my opinion, students in any country are very accessible to convey information and attract them to participate in funded projects. In Vietnam, too, there are always programs and playgrounds for students to participate in at their universities or on television to help them call for capital, stimulate inspire business passion in them, help them develop their own dreams. All in all, I found the proposal to be contagious, and it's also a good solution to a proposal that should be promoted by the Cardano community.\nAt this point, I will give this proposal 4 points due to the impact the idea brings to the community, minus -1 point because this is not a very different idea in this challenge.\n", "q0r": 4, "q1": "The project has issued an implementation plan within 3 months, I see the timelines that the author team have divided into 3 main timelines with implementation content. This plan is perfectly reasonable for this proposal, but for me, the information for the above plan is not enough, I need more detailed content for the tasks in it. For example, plan more detailed seminars with students at schools, or produce more publications about the project's success stories and their feedback on wada.org.\nRegarding the budget of the proposal is 5000$, this is the maximum amount of funding for each proposal of the challenge & Scouted for students challenge at this fund 9. This figure is reasonable to me, but the authors need to explain the use of this funding in more detail for each category. Currently, I see that the group of authors just stops at providing the main content using the budget that needs funding without going into detailed explanations of them, which will somewhat make it difficult to determine auditability of the project as well as making it difficult for the community to monitor the implementation of the project later.\nThe proposal team also identified a foreseeable risk that prevented the success of the project and the options to overcome and minimize this risk. I found it to be sufficient and completely consistent with the current proposal.\nI see information about the team that developed this proposal. They are fully qualified to carry out their proposal. With specific information about their work experience, education level and the units they are working for, it gives me confidence in the transparency of the above information. Moreover, I find out full information through community links such as wada.org, on telegram, Linkedin, personal email and twitter of project members.\nI will give the proposal part 3 points, since -1 point was deducted for the planning part and -1 point for the budgeting part. I find these 2 parts to be very important for a proposal, so it is very strict when scoring in these 2 parts.\n", "q1r": 3, "q2": "In my opinion, with this information, the project is completely auditable, but only at the general level of coverage, in line with the information provided by the author team. If the monitoring is to take place continuously and closely, it is necessary to add more information in the project implementation plan and the budget to use the project more carefully, fully and in detail.\nKPI of the project has given 4 specific evaluation criteria which are (number of business and engineering students will be admitted, number of Students will submit Science, Technology, Engineering and their math (STEM) on Ideascale, the number of students who will attend the workshop, the number of students who will be interested in Cardano and Project Catalyst). In my opinion, these 4 criteria are quite sufficient to evaluate the success of the project. Indicators are also included in the proposal for specific measurement such as (at least 10 students mobilized per University, 5 universities need to be sensitive in Cardano Peer Education, 50 Business Students. and Engineering will be joining Project Catalyst to contribute in various roles, At least 50 new Cardano wallets will be created for students of each university (Yoroi, Nami, CC Vault). At least 50 students can submit their innovative ideas for the Catalyst project to Foundation 10).\nThis project is a new proposal and has not been funded at previous funds, the author team will update project implementation metrics with reports via community channels such as telegram and web Wada. The community can follow the information at the links shared in this proposal.\nI will give this part 4 points, -1 point because the audit part of the proposal does not provide enough information for the audit community tight.\n", "q2r": 4, "assessor": "z_assessor_3281", "no_vca": 15, "ne": 7, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11812, "q0": " The proposal intends to spread awareness among students and engineers through campus outreach programs and online workshops, which would help students to be innovative and creative. Many creative minds, especially students are not able to go forward  with their idea due to lack of funding  .This proposal would encourage college entrepreneurs to venture forward to achieve their big goals and participate in discussions that would help them to properly implement their ideas.\nThe proposal also talks about mentoring students, giving them advice on how to run a business or enter the market for the very first time. Students are able to follow the people who have already gone through the path they want to follow. \nClearly the proposal addresses the challenge accurately, giving opportunities to students by participating in future project catalyst funding and bring up further projects that would benefit the Cardano community.  This would also help with in creating a bigger and better, healthy community\n", "q0r": 5, "q1": "The team is very well experienced and has been actively part of the cardano ecosystem. The team strives to provide in about 5 different universities The target is around 50 students from these universities to come up and be an active participant in the future catalyst funding. The plan itself does not need a lot of technical complexity or barriers as its more focused on spreading awareness and mentoring students. Hence I strongly believe the plan can be implemented successfully without much challenges. \nA monthly plan was provided by the team that indicates the roadmap for the project. Tough a weekly plan was more appreciable and preferred, the given roadmap fairly outlines the roadmap.\nA well-structured budget breakdown into understandable items was given by the team.\n$1000 of the breakdown is for the souvenirs for 50ish students who intend to speak up after the workshops. I personally found this very appreciable from the team.  \n", "q1r": 5, "q2": "There is clarity in the problem and the proposed solution, and the roadmap mentions the milestones that would help in tracking the progress. The team has provided information on how the progress will be tracked on a monthly basis via telegram chats and a website. The roadmap is well defined to track the progress of the plan. Since there aren’t much technical challenges, the team is can implement the plans to its fullest extent. .   \nThe KPI and metrics are well chosen, and are very good indicators of success of the proposed plan. The given outputs will be a clear indication of the number of students who would like to be a part of the community.  It would help in building up and expanding as a healthy community if at least 50 more students participate in the coming project catalyst funding and actively take part in the cardano ecosystem. This would help in building a healthier community. \n", "q2r": 4, "assessor": "z_assessor_3284", "no_vca": 13, "ne": 0, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 11923, "q0": "This proposal contains the idea to introduce Project Catalyst and catalyze their ideas from ideation to submission. The idea would encourage the enterpreneuship and creativity of students while also bringing more allies along into Cardano’s network, resulting in more innovative idea and brilliant projects created by them initiated in the future which makes Cardano even larger.\n\nThis project will also educate the students with the knowledge of Blockchain and Cardano in a visionary method and ecosystem of learning, giving them chance to make changes through Cardano.\n\nThe project has also assessed their risk of having complex things for student in regards of their ideation, furthermore, has given the solution to accompany students to mentors and business executives to lead them with related knowledge. Giving 5 for the impact this could deliver in a long time, for society and Cardano, along with how many parties will be included and could refer even further in this project.", "q0r": 5, "q1": "The proposal has a clear goal and project roadmap, with 8 weeks running project and sensible segmentation of 3 weeks University Sensitization & Mobilization, 2 weeks for outreach, mentoring, and ideation program, and 2 more weeks for evaluation and publication of the ideated projects.\n\nThe project has also defined a feasible number of budget, including their workshop organization, team funding, souvernirs, and even advertising and miscellaneous items, all in a feasible budget of $5000. The project has also included credible PIC with each of them having specific role while also clearly mentioning their experience and contact reference.", "q1r": 5, "q2": "The proposal has outlined clear metrics of achievement measurement, such as number of contributing students, number of new wallets made from the project, and the number of university they will reach. The proposal mentioned that as for the tracking, the progress will be reported to the community with in monthly report through their website and Telegram group, making the project is completely auditable. ", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 13, "ne": 0, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 9879, "q0": "The proposal is definitely relevant to the challenge.\nThe idea of connecting business and engineering students to project catalyst is what the challenge is all about.\nThe country where the proposer will launch the project is not clear. Is it Ghana or another country?\nBut overall, aside from the target country, the impact of this proposal on the Cardano blockchain and Catalyst is important. It is giving a good exposure to Catalyst between students and helping business and engineering students to realize their ideas and business ventures with the help of Catalyst funding.\nThe way to mitigate the risk that the proposer stated which will be by teaching students everything related to business in the real world with the help of experts is a transformative journey and will result in high quality ideas to be implemented on the Cardano blockchain.\n", "q0r": 5, "q1": "The proposal has a clear structured and detailed plan of execution. The time frame is logical, 8 weeks to implement the idea and the reporting process is enough.\nThe five team members working on the project have a very good experience, and all of them are part of the Catalyst community, either as PA or VPA, which shows that they are credible and can complete the project smoothly.\nThe project budget breakdown is detailed and clear. 5000 USD is a reasonable budget for 8 weeks of work.\nThe proposer stated that they are working on other proposals, but I would like to see how they will time manage with other proposals.", "q1r": 5, "q2": "The problem and solution are clearly described and are relevant to the challenge. The roadmap is detailed and the budget is reasonable. The KPIs chosen are relevant which will mainly track the number of students onboarded.\nThe KPIs chosen are related to the prelaunch and post launch of the project.\nThe proposal is tackling the SDG4 which relates to education. The KPIs for this SDG should be clearer and more related to the goals\n", "q2r": 4, "assessor": "z_assessor_3124", "no_vca": 12, "ne": 0, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 12067, "q0": "The \"Cardano Peer Education\" proposal identified a problem in the challenge and that issue has a wide impact on the development of the young generation. It matches the requirements that the challenge wants to bring. It addressed the problem that many Business and Engineering students had great ideas to impact their society but were not financially or technically supported. Young people - you embrace a lot of ideas, ideas that only you have the courage to think about, decide the future of the world. So to help young people facilitate the process of implementing ideas and developing it, this is a suitable proposal. Please present the problem clearly and convincingly. It gave solutions to a problem in the growth of the Cardano community, which is how to stimulate the development of the young generation community. The specific solution of the proposal is to introduce Project Catalyst to Business and Engineering Students, to mentor and test their business projects and innovative ideas, and to assist them in submitting them through Project Catalyst. Thus, increasing the performance, the possibility of success of the idea projects for the specific student audience here business and engineering students. The team proposes to give specific examples in the presentation with arguments with specific, feasible, and highly effective numbers. Shows that the proposed team has thoroughly researched the development of proposals on each fund and the needs of the audience of this proposal, answering the question: How to increase the effectiveness and success of the proposals and your students' interest in Cadarno? The specific goals of your proposed product are: This proposal (Cardano Peer Education) will support students in their daily lives at school and in society, making them more aware of the work context. their projects and can better grasp the opportunities on the project catalyst and create a platform for University entrepreneurs to establish a social and community activity in the Cadarno Ecosystem. The proposal identified a number of risks in the implementation process and proposed solutions to overcome all those risks. You just risked in the process that students have a great idea but don't know exactly how to execute it which is a challenge so many students face. From there you lay out the solution to this risk that mentors and business executives will be assigned to students to advise them on how to run a business, how to enter the market for the first time. First, how to identify potential profit or loss here is a possible idea, helping to realize ideas. However, the proposed team needs to identify more issues that many other proposals also raise, which is the price fluctuation of ADA Token in the market and you need to come up with a long-term solution, when the price of ADA Token in the market fluctuates. The strong will ensure the interests of the participants and the success of the proposal can be overcome by having an additional budget plan. I rate: 4 points.", "q0r": 4, "q1": "The proposal provides clear timelines 1-3 weeks, 4-6 weeks, 6-8 weeks., detailed and reasonable to perform the work with specific goals. Specifically, the proposed group presented the target plan with specific and very feasible figures. Proposal implementation results are easy to check on an ongoing basis via community reporting on progress made to date via the monthly report form and the Catalyst Coordinator Chat group on Telegram and on the website Wada. https://www.wada.org. The proposal accounts for about 5% of the fund's budget capital (USD 5000) and has a specific spending plan and additional budget. There is a clear and transparent budget allocation plan but I hope you can present it perfectly in terms of text presentation. The alternative proposed in the additional budget for other costs should be more specific. However, an additional provision is needed in case more students are interested in the proposal than expected. Next, it is proposed to assign specific tasks to each member; Have experience related to the assigned task; The identities of team members are easy to verify. The proposal also analyzes the tasks for each specific, appropriate and highly specialized group of members. List of core groups and easy-to-identify members, with links to telegram, Twitter accounts. I rate: 4 points.", "q1r": 4, "q2": "Proposals provide KPIs, making it easy to accurately quantify a proposal's effectiveness and easily test it. The proposal has three metrics/KPIs to measure project performance and progress. Metrics/KPIs that are easy to measure and check (number of students participating, Number of students who will submit their Science, Technology, Engineering and Math (STEM) projects on Ideascale, will be interested in Cardano and Project Catalyst). Although there is no pilot program, if funded, the project can be successful. The goal of the proposal is by establishing student portfolios and increasing the display of their ideas while students can expect easier funding and being sought after by engineers and business students Searching on Project Catalyst. Proposing not only pioneers to launch practical activities, young people will find all opportunities and means on Project Catalyst to voice their thoughts, build quality projects. for community. The proposal then aligns with the United Nations SDG goals: Ensuring inclusive and equitable quality of education and promoting lifelong learning opportunities for all; Promote sustained, inclusive and sustainable economic growth, full and productive employment and decent work for all; Build resilient infrastructure, promote inclusive and sustainable industrialization, and foster innovation. The proposal has never been funded, but the core members of the project have gained extensive technical experience in funds. If funded I think the proposal is in the top 10 voted. I rate: 4 points", "q2r": 4, "assessor": "z_assessor_3353", "no_vca": 12, "ne": 3, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 12250, "q0": "I agree that, this proposal effectively addresses the challenge. I think to increase the exposure of student ideas and make funding of such ideas easier, which this challenge seeks to achieve, there is a need for education and providing some hope for them in terms of the funding of their ideas. ************************\nWith such reason as stated, I think this proposal will provide students in Ghana especially those in the university to get their ideas some exposure and subsequent funding. ***********************\nIn as much as this proposal i think with all due respect,  did not provide detailed plans as to its future sustainability,  I have no doubts , that, with the Key metrics provided which is in line with that of this challenge, it is capable of adding great  value to the cardano ecosystem. ", "q0r": 4, "q1": "I agree that. Per the experience possessed by the members of this proposal, coupled with their skills which I think is relevant to the successful implementation of this project, I think I have zero doubt.**********************\nEven though with the greatest of respect, I think the risk or challenge associated with the implementation wasn't clearly outlined and ways to mitigate also got me a bit confused , I think the budgetary allocation was well presented and very realistic.  **************************\nMoreover,  I think plans to implement were well thought of and outlined to my understanding taking into consideration the timelines which were realistic enough. This provided me with the greatest of belief that, this project will be successfully implemented ", "q1r": 4, "q2": "I agree that, the information provided is sufficient to audit the progress and the success of this proposal.  I think this proposal provided Key metrics and Indicators that have been well thought of and carefully selected to easily measure the success of it. ***********************,***\nMoreover, the outcomes of this proposal clearly provides the community with the number of proposals expected and the number onboarding of students just to mention a few, these I think makes it easier for the community to assess the success of this proposal. *****************************\nHowever,  I humbly think that reports on progress to the community can be done bi- weekly if not weekly ,since the roadmaps and timelines provided were in weekly intervals,  notwithstanding,  I think the community will still have access to the progress report as provided by this proposal upon which successful Evaluation can be done.", "q2r": 4, "assessor": "z_assessor_3371", "no_vca": 12, "ne": 0, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 12265, "q0": "The proposal addresses the challenge and looks into funding students who have ideas. One limitation about this project is that the proposer seeks to involve only business and engineering students who may not necessarily be the only ones with the ideas for a business. Including students who are studying other programs will not only bring diversity but will also reach a larger audience and in turn grow cardano to a larger populace. The proposer indicated their plan to bring on board mentors and business executives is laudable since it will help to filter ideas that may not be feasible even before they are presented to the cardano community", "q0r": 4, "q1": "The experience of the team seems sufficient for the task ahead. Their budget is clearly stated and outlined/ With a target of 50 students, the team can easily get a database of the students and follow up on their businesses and ensure they are able to submit it to the cardano ecosystem. The proposer expecting all 50 students to submit their proposals is a bit unrealistic since behaviour is unpredictable. ", "q1r": 3, "q2": "The plan is likely to be implemented except that it does not involve or indicate how it will use social media to attract students who may be interested in this idea. Additionally, it does not include plans for future students and will likely end after it’s implementation. I would suggest that to ensure the continuity of such an idea, a registered organization/club on the targeted campuses should be set up with members who are students in all their levels of education involved so that they can learn from each other and encourage freshman students to join them every year to keep it running. ", "q2r": 2, "assessor": "z_assessor_3378", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}, {"id": 12563, "q0": "Many Business and Engineering students have great ideas to impact their society but don't have the opportunity to fund these students so Project Catalyst would be ideal this is a matter of challenge. consciousness needs to be resolved. The proposal clearly outlines how it will add value to the Cardano ecosystem. The way it will add value to the Cardano ecosystem is to support students in their daily lives on campus and in the community. staff are more aware of the context of their work and can better grasp the opportunities on the project's catalyst and provide a platform for University entrepreneurs to establish a social and community activity in the Ecosystem. The goal to be achieved through Project Catalyst's entrepreneurship education program is to improve the entrepreneurship mindset of young people to make them more creative and confident in whatever they undertake and to enhance the attractiveness of young people. surname. Encourage innovative start-up colleges. Enhance their role in society and the economy. The proposal's key metrics and goals are consistent with the stated challenge settings. I completely agree that this proposal effectively addresses the challenge. I rate the impact of this project 5*.\n", "q0r": 5, "q1": "People who will work on the project include Daniel D. Lezu: Daniel is a front-end developer with over 5 years of experience. Nana Safo University Ambassador for Wada and Blockchain Education Network (BEN) in Ghana. Richmond Oppong is a graphic designer with over 10 years of experience in logo design and marketing. Acura Adwoa - Student Ambassador @ Wada. Jeremiah Baani: College assistant, IT specialist, Blockchain/Crypto educator and advocate, Wada Ghana team member. The proponent has provided sufficient information on the relevant skills and experience required to implement the proposal. The budget given is reasonable to achieve the stated goal and is clearly outlined and broken down into sections. The following is part of a detailed budget for an 8-week student referral and mobilization program\nTeam cost - 5 members * $200 = $1,000\nworkshop - 2 events * $650 = $1,300.... The proponent provides a blueprint, including progress and milestones. Divided into 3 phases for implementation: phase 1: 1 - 3 weeks after funding. Phase 2: 4-6 weeks after funding. Stage 3: 6-8 weeks after funding. Each stage is clearly planned out in detail. The main risk that can prevent a successful project from being implemented by proponents is that university entrepreneurs often have complex science behind their inventions. Having a great idea but not knowing exactly how to execute it is a challenge many students face. The proponent not only presents risks to the proposal but also offers a very useful measure, which is a positive point of the feasibility of this project. I rate this project 5*.\n", "q1r": 5, "q2": "As stated in the 8 week workable roadmap with milestones and timelines to achieve. The success of this project is due to the establishment of student portfolios and increased visibility of their ideas while students can expect easier funding and is being sought by engineers and students. business in Project Catalyst search.\nNumber of Business and Engineering students admitted\nNumber of Students who will submit their Science, Technology, Engineering and Math (STEM) projects on Ideascale.\nNumber of students who will attend the workshop the number of students who will be interested in Cardano and Project Catalyst. Proposer offers a clear and understandable solution to the problem. I fully agree that this recommendation provides me with sufficient information to gauge progress towards the goals. I rate this project 5*.", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 15, "ne": 1, "ng": 13, "nfo": 1, "vca_o": 1}, {"id": 12945, "q0": "The proposal is about to introduce project catalyst to business and engineering \nstudents and to the mentor and examine their business projects and assisting them to submit via project catalyst, The approach of the proposal is by providing one-on-one training and online training to introduce them to the project catalyst. BY giving them the awareness of the context of their work and improving their ability to take advantage of the project catalyst opportunities and This \nproposal will support students day to day life on campuses and in society. It will also serve as a platform for the college students to start a social and community activity activity in the eco system. The proposal clear explains how it will add value to the cardano eco \nsystem .The proposal is able to scale to addresses  future challenges Upon reviewing the proposal I strongly agree that the proposal effectively addresses the challenge .\n", "q0r": 5, "q1": "The proposer have provided the detailed plan of the proposal and The proposer have provided the detailed information about the timeline and Budget. The timeline of the proposal have been break down very clearly. A little elaborative approach or explanation would have been easy to assess the proposal .The team looks very experienced hope they work on that other then that the proposal looks awesome . The proposal clearly helps the \ncardano community to grow . A little bit of the more work on the proposal would been better. The goal of the proposal is great, The team looks very professional and the have\n mentioned relevant skills which are required to carry out the project .", "q1r": 5, "q2": "To Track the progress of the proposal  the team will be reporting to the community with evidence of progress attained so far through the monthly report form and the Catalyst Coordinator Chat group on Telegram and on the Wada website . The proposer have provided the detailed explanation of the proposal , and The approach to the solution is also described clearly in the description . Upon reviewing the proposal I agree that the proposer have provided enough information to review the proposal .", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 14, "ne": 0, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 13349, "q0": "Taking advantage of Business and Engineering students to direct them into catalysts to make PA, vPA and even Proposal so that the Cardano system can get more new ideas from their positive energies is the goal. suitable for the challenge that the Catalyst program aims at.\nParticipating in Catalyst of students not only brings a good source of income but also learns a lot of knowledge about blockchain, Cardano, teamwork skills and other essential soft skills for students. young university students.\nYour proposal is also extremely useful for students who are having a start-up idea but do not know where to finance, Catalyst is a smart choice that few special funding sources like this one.\nThe Catalyst Foundation sets the stage for and nurtures future success for our students.", "q0r": 5, "q1": "The timelines are not clear, 1 to 3 weeks after funding then 4-6 weeks after funding then 6-8 weeks after funding, these timelines You have divided into three phases but within each stage need to be described in more detail.\n- The number of members is 50 for 5 universities, is this too little? Given a large number of students in each university, I think the number of members should be many times greater than 50.\nThe cost of your proposed activity is also broken down, you do quite well. But I don't understand what other costs include that up to $500,\n- budget for advertising and marketing, You should also specify on which platform to advertise, such as advertising on Facebook or Google,\n- organizing seminars and events, the community will appreciate it more when knowing where the workshop will take place, the time for each seminar, event, ...", "q1r": 4, "q2": "You have provided a website for the community to check on project progress, which is consistent with the auditability offered by the challenge, which is very good and I see very few proposals that do this.\nKPIs like number of students, number of universities, number of Cardano wallets, and number of students who can submit proposals. specific to the numbers, this is very intuitive for the community to verify, I appreciate your step. And wish you will get a sponsorship", "q2r": 5, "assessor": "z_assessor_3616", "no_vca": 15, "ne": 0, "ng": 12, "nfo": 3, "vca_o": 1}, {"id": 13412, "q0": "This proposal will very effectively address the challenges of helping engineering students find funding for their ideas and of connecting them with supporters in their profession. The campus outreach program, the online workshops, the mentoring and encouragement to be an entrepreneur will all greatly help improve the students’ abilities and confidence in themselves. Their participation in this proposed project should open the door to using tools and networking within the crypto ecosystem to promote their ideas and to attract funding support.", "q0r": 5, "q1": "This proposal has a very good chance at successful implementation. The five named members of the team are all part of the Wada organization which has a great track record (numerous completed or in progress Catalyst projects since Fund 4). This proposal’s goals fit perfectly with Wada’s mission to “provide seekers with providers” and to “equip local developers and entrepreneurs to build decentralized applications and businesses of the future”. Given the work experience and skillset of the proposal team and their connection to the Wada resource network, there is every reason to expect a highly effective outcome that will help many students on their paths to success.", "q1r": 5, "q2": "The proposal plans to release reports on its students’ progress monthly through both Telegram and Wada’s website. Together with its metrics of counting the number of students achieving various skills, interest, and workshop attendance, this will be quite sufficient to allow tracking of  the proposal’s progress and success. One suggestion to improve would be to be clearer concerning what success would look like - as it is, the proposal lists the number students doing this and that, but does not provide a quantitive value. For instance, success will be when at least one half of our students achieve all of the listed goals. Or two-thirds, or whatever seems right to the team.", "q2r": 5, "assessor": "z_assessor_3624", "no_vca": 14, "ne": 0, "ng": 13, "nfo": 1, "vca_o": 1}, {"id": 12107, "q0": "This proposal relates to the situation faced by students today, they have a lot of brilliant ideas but they don't have the resources to link them to funding. The opportunity offered by the Catalyst Project is a bright spot for resource ideas owned by students that can be used for the development of Cardano as an ecosystem. These developments are not limited to Cardano but can also affect the blockchain ecosystem as a whole. This Proposal (Cardano Peer Education) will support student's day-to-day life on campuses and in society, making students more aware of the context of their work and better able to seize opportunities on project catalysts and provide a foundation for College entrepreneurs to establish a social and community activity in the Ecosystem. Support for students not only accommodates funding for their ideas so that they can run but also develops an entrepreneurial mindset to enable them to be more creative and self-confident in whatever they undertake and to improve their attractiveness. The expected impact will be useful on their role in society and the economy.", "q0r": 5, "q1": "These proposals have a clear timetable and suit their ultimate goals. they need $ 5000 to run this project for 8 weeks so this is a reasonable budget the breakdown for the budget is quite clear and the nominal is still reasonable for each cost. This project has qualified people resources to work on this project, some of whom are quite familiar with the Cardano community. The proposer provides the plan to have implemented to impact their society to motivate the new students that are yet to be onboarded. For the technical aspect to be successful they have some program such as One-on-one outreach program with university representatives to educate the Business and the Engineering Department about Project Catalyst and Cardano / Project Catalyst Workshops with the Students. ", "q1r": 4, "q2": "The proposal make sure that reporting output is well publish. Key metrics on this project proposal is a wide range of interest, which is good for students that will be filtered into the group of people which have complex interest, mainly blockchain and for the future needs, employment and decent knowledge to move forward. Not only for themself, but the use of Cardano wallet will be increase in the mean time. The additional fifty proposal is a plus considering that it will be very ideal written by the people who taste the school and university ecosystem. More additional value will come from the students which have background from Science, Technology, Engineer. From here we know that the interest to some categories of Cardano Fund on specific thing such as legal and finance are still low. Being accepted on the universities means that Cardano is already present as an option not just something onboard and co-exist only.", "q2r": 4, "assessor": "z_assessor_3362", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}, {"id": 13439, "q0": "The main problem of student entrepreneurs is funding for their innovative ideas. The proposer has found that students in his home country ,Ghana, also face this same problem. This proposal effectively addresses the challenge because the proposer has been able to identify a very effective method, that is one on one mentoring that will increase the effectiveness of this project. This method makes it easier for engineers to scout out students who have great ideas for a small scale projects. Direct mentoring of these students give them the opportunity to submit their ideas on Project Catalyst in order to greatly improve their chances of getting funding.", "q0r": 5, "q1": "The proposer has over five years of  expertise in block chain and has the required abilities to implement the plan.This project is to be implemented over the course of 8 weeks. This period is realistic enough for the completion of the project. The strategy for implementation is also clearly outlined and is laudable. The challenges that the proposer will face in carrying out the project is presented and the proposer has outlined the ways in which these challenges will be overcome. In all, the project presents a well structured implementation plan that gives this project a very high probability of being successfully executed.", "q1r": 5, "q2": "This proposal describes in detail the process and methods that will be used to measure the achievement of project milestones in the bid to reach the proposal objective. Key metrics that will indicate the success of the project are also clearly outlined. Thus information provided is sufficient to audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_3648", "no_vca": 14, "ne": 0, "ng": 12, "nfo": 2, "vca_o": 1}, {"id": 8829, "q0": "We have seen most the projects which involve just in teaching the block chain related data to the students, but no others have concern to mentor the projects and assist them till the students get the funding. hence to develop a project where students are assisted till they are funded by catalyst team is a great idea, the proposer has given his target audience where he wants to capture  business students as well as Engineering students  to achieve the goal, where it helps in growth of their people economically, hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer has great experience where he is veteran in assessment proposal and has been Community Manager for the Africa Town Hall and Catalyst Africa School , so this shows the proposer has maximum knowledge in catalyst related projects.\nThe proposer has also other partners who were previously funded by catalyst for their projects ,and they have even completed the project without any barriers, the proposed task has very minimal risk involved it ,so with provided experience team to achieve the target  plan presented it is highly likely this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The audit clearly contains how the proposer's team is going to nurture the ideas and help students to complete the project by mentoring them, the proposal has even introduced all the team members of the project and has displayed each person's experience in catalyst program.\nThe presented team has experienced members which will definitely help youngsters to mentor in proper way , the plan has well structured timeline and detailed budget breaking idea involved in it , hence with good key indicators and experienced team provided the information provided is sufficient to audit the progress and the success of the proposal.\n ", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 16, "ne": 0, "ng": 14, "nfo": 2, "vca_o": 1}, {"id": 7700, "q0": "is proposal (Cardano Peer Education) will support students' day-to-day life at campuses and in society, making students more aware of the context of their work and better able to seize opportunities on project catalyst and to provide a foundation for College entrepreneurs to establish a social and community activity in the Ecosystem. This is completely in line with the challenge's objectives. Project Catalyst's entrepreneurship education aims to achieve the following goals: Improving young people's entrepreneurial thinking so they can be more imaginative and self-assured in whatever they do, as well as more appealing. Encourage college students to launch new businesses; Enhance their contribution to society and the economy. The essential measures that will be important to this proposal's success have also been specified by the proposer. The issues they will face have already been mentioned by the proposer, and they have alternative solutions and are scalable.", "q0r": 4, "q1": "Based on the data in this proposal, I believe that it can receive a high score for feasibility. They have offered a schedule with checkpoints for finishing the task. I believe that the proposer is fully aware of the foundation they are attempting to lay and the outcomes they hope to achieve within the timeframe they have specified. Additionally, there are significant checkpoints at 3, 6, and 8 weeks, and metrics are offered to enhance auditability. Because of this, I believe the suggestion is quite likely to be adopted effectively.", "q1r": 4, "q2": "The achiever of the project has a well-planned road map. The 5000 USD in financing that the proposer is requesting, together with a breakdown of all the costs that can be identified, seems reasonable and necessary to achieve the goal. Because the proposal has identified a real-world need, understood it, and is attempting to find a solution to the issue, the submitted material is sufficient to audit the progress. The skill and understanding of the plan's proposer and his team increase the likelihood that the plan will be implemented successfully.", "q2r": 4, "assessor": "z_assessor_2916", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 2498, "q0": "The addition of this challenge to the Catalyst Fund has created a unique opportunity for the students. The most important problem faced by the young students in their career is when they have innovative and sometimes revolutionary ideas but they are not able secure the funding to make it a reality. This challenge provides them a great opportunity to secure initial funding to setup a team and develop there innovative idea to a formal proposal and submit it to the Catalyst for funding rounds. This presents them with the initial capital to pursue their ideas and they are incentivized to try to bring them to life.\nThis proposal is planning to mentor the business and engineer students to pursue their business projects and innovative ideas and assisting them to submit the same to Project Catalyst. The team will provide one-on-one mentorship, online workshops and provide them the mentor support from beginning of the idea till the complete proposal is submitted to the Catalyst. This perfectly aligns with the challenge objectives of the category and will help in bringing the new talent and innovative proposals to the Catalyst and hence ultimately will help in the growth of Cardano with some great proposals untimely being implements by some of these students.\nMy concern here is the scalability of this proposal. The team through this proposal is trying to mentor and guide the students of around 5 universities to develop innovative ideas and submit their proposals to Catalyst for securing the funding. This can help the students of these universities in financing their innovation and might bring some good projects to the Cardano in the end, but it will not be able to scale to include more universities in the future. To address this challenge comprehensively, we need to create a technological solution to outreach to different universities and try to educate them about this great opportunity. This can then be scaled to include other universities from other areas as well by expanding the platform. Although the proposal will help the Cardano in innovation, but I request the team to also look for ways to conduct awareness campaigns through technological solutions to reach to more universities to make is a large-scale phenomenon. ", "q0r": 4, "q1": "The project is divided into the 3 stages which runs into 2 months and includes conducting a “Sensitization and Mobilization program”, conduct one-on-one mentoring and workshops and help interested students prepare the proposals regarding their ideas and submit it to the Catalyst. The team consists of 5 people, who have prior experience of working with Catalyst and Cardano and also with students. Some of the team members are also part of the wada.org which is similar in objective to what this challenge is all about. These facts shows that team is capable of completing this proposal and possess required skills to do so.\nOn the budget front, they are requesting the funds of $5000 and the full breakup of the funds is provided which includes the cost of mentoring and conducting workshops and is quite reasonable. From all these aspects, the proposal is feasible to implement. My only concern would be to not able to onboard enough students and not able to generate reasonable number of proposals for next Catalyst fund to justify the money spent. To mitigate this, I would suggest them to conduct some ground work even before submitting the proposal and present a brief in the proposal, based on their initial ground work, if they will be able to enrol 50 students as stated in the proposal.", "q1r": 4, "q2": "The regular updates about the project will be provided through the monthly report form submitted to the Catalyst and the progress also shared with Catalyst Coordinator Chat group on Telegram. They will also upload the relevant progress points on the Wada website https://www.wada.org. The success of the project can be further monitored from the number of proposals submitted in the subsequent Catalyst funds by their students. Only concern I have is that they are planning to have 10 students from each of the 10 universities and ultimately bring 50 students to the Catalyst Fund 10 but given the nature of complexity involved in the Blockchain Technology, they might not be able to find this number of students from just 5 universities. As I have already said, the solution to scale it and to ensure that there are always sufficient number of students onboarded to justify the funding, we need to onboard more universities by using technological solution and conduct an awareness campaign about this.\nIn the end I would say that the proposal is capable of bringing good innovation to the Catalyst and ultimately to the Cardano and I am hopeful that in next rounds, the team will be able to reach out to more universities to make it a campaign of innovation. I wish them all the best.", "q2r": 4, "assessor": "z_assessor_2312", "no_vca": 15, "ne": 5, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 3808, "q0": "The problem statement of this proposal has been identified and stated clearly by the proposer. The purpose of this proposal as I read through, is to introduce project catalyst to Business and Engineering students, mentor and assist them to put their ideas into proposals to submit in project catalyst for funding.\nTo address the challenge, the proposer seeks to educate students on Cardano project catalyst so that the student entrepreneurs can access fund from Catalyst because they cannot get capital easily on their own. Thus, getting knowledge about project catalyst and helping student entrepreneurs to showcase their ideas in this space is the goal of this challenge. \nRisks and mitigating strategies have been explained in the proposal.\nGiven the above information, the proposal has addressed the challenge effectively., hence my 5 star rating.", "q0r": 5, "q1": "Provision of a detailed plan in this proposal shows a flow of 8 weeks duration for the project. The plan is divided into 3 weeks intervals with specific activities added. Thier target is 50 students in about 5 Universities. They plan to do one-on-one outreach program and also online outreach.\nIt is mentioned that publications of success will be on wada.org site and preparation and close up reports sent to IOG. \nThe budget request of $5000is reasonable for this project and it is also broken down in detail to show the budgeted cost of each activity to be meaningful.\nThe team is made up of 5 personalities with various credentials provided in the proposal. They have a combined experiences as active members in Wada Ghana and Cardano community/ They are PAs, vPAs, Voters, Proposers and Challenge Team members in Cardano. \nLinks such as Twitter, telegram, LinkedIn have been provided to further reference their profiles. The team I believe is capable of delivering. \nThe team has indicated that that when they are successful, they would return to Catalyst for support for more work to reach more students. They are also involved in other proposals in Fund9. \nFrom all of the above, it is likely this proposal will be implemented successfully so my rating is 5. ", "q1r": 5, "q2": "According to the proposal, the progress of work will be tracked through the reports sent to Catalyst Coordinator chat group, telegram, Wada website with address provided. \nThe metrics that will be used to measure progress are listed in the proposal in detail, such as 10 students to be mobilized per University etc. to mention a few. \nThe proposal has listed a number of facts that will show that they are successful, such as the number of business and engineering students that will be onboarded, the number of students that will attend workshops, etc. The project is a new proposal.\nThe information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 19, "ne": 1, "ng": 18, "nfo": 0, "vca_o": 1}, {"id": 4771, "q0": "The problem of no funding opportunities for students was clearly indicated in this proposal, and it was suggested that the Catalyst project would be ideal for such students. The team clearly presents how this project will add value to the Cardano ecosystem. Key metrics and goals are elaborated in detail and in accordance with the outlined challenge settings. This proposal is able to scale to address future challenges.\n\n\n", "q0r": 5, "q1": "The team presented itself transparently in the links provided in the proposal. The community/voters have a clear insight that the team is professional, that it has all the necessary knowledge and skills needed for this project to be realized. The budget is realistic, modest and a quality budget breakdown was made. A clear feasible plan with realistic time frames within the project can be completed is presented. It would be good to present what kind of tasks someone from the team will do and in what way. The team presents possible challenges and risks without reservation, but also offers adequate solutions.", "q1r": 5, "q2": "Roadmap with milestones is presented and we can clearly see the time frames within the project will be implemented. KPIs have been elaborated and presented and the community can easily follow the development and success of this project. The wada.org page for delivering regular updates to the community for auditing progress was presented.", "q2r": 5, "assessor": "z_assessor_2616", "no_vca": 17, "ne": 0, "ng": 14, "nfo": 3, "vca_o": 1}, {"id": 4884, "q0": "The proposal offers opportunity through the Catalyst Community to raise funds for their innovative ideas so as to realize their project potentials.\n\nThe proposal will first outreach 50 students in real person one on one in the campus and create interests. It will conduct online workshops to help the interested students to onboard Project Catalyst for submission of proposals. A mentor program will also be launched to help the students in respect of planning, managing and so on. It would be ideal with there is an opportunity to involve engineers in this program.\n\nIndeed this project will help students solve the problems of funding for their innovative ideas and getting help in managing start-up entrepreneurship. A program that provides an avenue for solutions and advice. A program that keeps the innovative ideas following.\n\nThis program therefore fits into the campaign briefs and aligns with the challenge goals. And with this, I agree that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "The project will start after funding and is spread over 8 weeks starting from the outreach followed by education and learning (that should include proposals writing and submission, which is not mentioned in the plan). There is provision for reporting on the progress and success. \n\nThe budget requested is in line with the USD5000 limit and the cost provision is line with tasks involved.\n\nThe proposal team consists of 5 members all with Blockchain experience and have active involvement in the Cardano Catalyst community. \n\nLooking at all the favorable factors identified, I strongly agree that it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal listed the key matrics that provides measure of the project progress and the success with goals at the end of the 8 week. The impact on the Cardano ecosystem would be an increase of 50 ADA wallets, 50 project proposals for fund 10. It also intends to report the progress and success monthly via Catalyst Coordinator Chat Group in a telegram and on the Wada website. \n\nI strongly agree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_2631", "no_vca": 16, "ne": 0, "ng": 16, "nfo": 0, "vca_o": 1}, {"id": 4911, "q0": "Activities that allow for fostering student entrepreneurship fall squarely within the parameters of the present Challenge setting. The main activites, namely to support student entrepreneurs via one-on-one campus outreach programs and online workshops so as to create awareness to seize opportunities on Project Catalyst and to provide a foundation for college entrepreneurs, will undoubtedly aid in the increase of projects deployed on Catalyst and Cardano, increasing consequentially the onboarding of new members and users in the ecosystem.", "q0r": 4, "q1": "The WADA team is highly known and respected within Catalyst and Cardano for their efforts to expand Cardano´s footprint in Africa, with a widely known track record. The proposed budget and timeline are also reasonable in the context of the proposer´s set goals. It would be interesting though, for future iterations of this project, to specify the criteria for the selection of universities (is it a regional setting, aiming at universities in Africa? several countries at once or a pilot program of 5 universities in a single country, to be replicated further in the rest of the region upon success of the initial proposal?), and on the other hand, if the workshops that are planned will be online in nature, perhaps the proposers could consider a more ambitious target of students, broadening the potential audience per university onboarded.", "q1r": 4, "q2": "As part of the wider array of projects from WADA, the proposers indicate that reporting to the community with evidence of progress attained will be made through the monthly report form, the Catalyst Coordinator Chat group on Telegram and on the Wada website, ensuring multiple public outlets for information transparency. Furthermore, the selected success KPI targets, namely to mobilize at least 10 students per university from at least 5 universities, resulting in a total of 50 Business and Engineering students onboarded to Project Catalyst, with the corresponding wallet creation and proposal presentations in Fund 10, will suffice as quantifiable measurements in auditing the progress and success of the current proposal.", "q2r": 4, "assessor": "z_assessor_2636", "no_vca": 16, "ne": 0, "ng": 13, "nfo": 3, "vca_o": 1}, {"id": 5085, "q0": "This is a Proposal for $5,000 to set up a Campus outreach program with online workshops with students.  The goal is to mentor these students to submit their innovative ideas on Catalyst. The concept to support the students to help turn ideas into action and assist them to plan and manage projects. The proposal has the following objectives which follow the spirit of the Challenge are: 1. Improvement of entrepreneurship mindset. 2. enabling creativity and self-confidence, 3. Improve their attractiveness of undertakings and encourage College innovative business start-ups.\n-------------------------------------------------------------\nBased on the Challenge brief and the Proposal parameters may Assessment is this is a 5( strongly agree it meets objectives laid out) star.", "q0r": 5, "q1": "The lead on this Proposal team has experience in Catalyst as a CA, VCA, Community Manager of the African Town Hall and more.\n--------------------------------------------------\nThe timeline and implementation plan is scheduled into an 8 week block to completion broken into 3 segments. The final segment finishes with evaluation and success stories. The budget is reasonable and well explained. The proposal looks to be Ghana centric and the lead is involved with WADA.  The Risk Management is focused on the student as the weak link due to idea complexity and lack of experience. The mitigation is covered by mentors and business executives being assigned to the student that join the program to advise and enter the market.\n---------------------------------------------------------------------\nMy assessment on the feasibility of this project is a 5 (I highly agree this will be successfully implemented) star.", "q1r": 5, "q2": "The proposal plans on reporting for tracking purposes via Telegram, Wada web and the Catalyst form. There are 5 key metrics listed for measurement including number of student per university(10), number of universities(5), and onboarding of Students & proposals.\n\nThe metrics are in line with the Challenge and appear to be measurable. \n-------------------------------------------------\nMy assessment is the Auditability of this proposal is a 5 ( strongly agree it has identifiable measurements of success) star.", "q2r": 4, "assessor": "z_assessor_2671", "no_vca": 15, "ne": 0, "ng": 12, "nfo": 3, "vca_o": 1}, {"id": 7813, "q0": "The proposal has been appropriately placed in the right challenge. It has also addressed the challenge effectively. As stated in the proposal, mentoring and coaching student entrepreneurs on the benefits of project catalyst will create awareness and increase student entrepreneurs involvement in the whole Cardano ecosystem. For this reason I will give this proposal a 5 star rating.", "q0r": 5, "q1": "The proposal budget meets the maximum limit of $5000. The team behind this proposal have a lot of experience going through their profiles as well as their completed projects in previous funds. A time line of 8 weeks given to execute this project by 5 team members is realistic. The plan spelt out to complete this project is feasible. That is meeting student entrepreneurs through conferences in person or online is very laudable. For this reason I gave it a 5 star rating.", "q1r": 5, "q2": "The clear milestones given to measure progress and success is commendable. Sending reports to the catalyst community and posting progress on the Teams website is also a good way for tracking the success-fullness of the  project. The target of 50 students entrepreneurs successfully submitting their proposals on ideascale at the end of the project is a key thing to watch out for. This proposal therefore deserves a 5 star rating.", "q2r": 5, "assessor": "z_assessor_2924", "no_vca": 13, "ne": 0, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 5435, "q0": "This is a great idea. Most university students that wants to engage into businesses are faced with the problem of lack of  funds and lack of proper execution plan for their project. The proposal fully meets what the challenge ask for , as it intends to help to introduce cardano project catalyst to business and engineering students in Ghana and as well mentor them  and help to develop their projects .  When this project is successfully executed  it will help to create an opportunity  for those student's project of  having the possibility of being funded in the catalyst ecosystem and also create room for possible adoption of cardano blockchain and as well add most value to the community and the ecosystem. ", "q0r": 5, "q1": "From the information provided the proposer team stated that they have the necessary skills and experience to implement the project by providing us with relevant link (https://eship.ox.ac.uk/student-entrepreneur) and references  for us to see what they have being doing , also  they went further to mention the names of the team members required for the implementation of the proposal as well as their experiences and roles they will handle. The budget provided is reasonable and broken down into identifiable items that can be used to quantify the success of the project. The possible difficulties that can be encountered during the execution of the proposal is stated with how to overcome them. With this it is highly likely that this proposal will be implemented successfully. ", "q1r": 5, "q2": "The information provided is sufficient to audit the progress and the success of the proposal because the team provided that the community can track the progress of the project through their telegram handle and their website. Also there is a step by step implementation  plan with clear milestones and a time horizon.  Kpis and metrics that measures the success of the proposal is stated . In summary I rate auditability with a score of 5.", "q2r": 5, "assessor": "z_assessor_2703", "no_vca": 19, "ne": 0, "ng": 10, "nfo": 9, "vca_o": 1}, {"id": 5656, "q0": "It is quite obvious from the onset what the team intends to do. “Providing a source of funding, improving the entrepreneur mindset of young people to be more creative and also encourage innovative business start-ups” are the the key impact the project intends to actualize. Anyone who is preview to the unemployment challenges in Africa recognizes that the educational system is not only unfriendly but often unproductive. Therefore, i agree with the idea behind the project –focusing creating more jobs via innovative initiative by young people. However, the information here is not well detailed. There is a starting point for every project; though we know students are the focus, but what is the target audience of the project at the early stage of the project? is it a random selection of students from any college institution or an initiative focused on a specific college institution?  How does the project intend to start or be organized? is it an in person event, an online event or both. The essence of this concern is to help anticipate the potential challenges the project will face if is organized online, if is in person based or both. What’s the scope of the entrepreneur educational series? Is the project a localized initiative, focusing on specific college institutions or will it be a nationalized initiative which will cover students across all universities. Aside that, there isn’t a clear plan to make sure the project is sustainable. And will the program be organized as a series of event as the name suggest or will it be a one time event? My general view of this project is that, the idea would provide a unique approach to hone and mentor students to exploit their innovative ideas and realize the full potential of their ideas, however, in my opinion, more details on the questions outlined here would be provide a better view of how the solution will address the problem. I suggest the team endeavor to readjust the project to highlight in details what they intend to do.", "q0r": 4, "q1": "There's clear time-framed plan with good activities that help to understand what will be done to initiate the project. The roadmap in this project is well designed, incorporating the needed work structure to provide guidance from start to completion of the project. They also provide the community with a detailed breakdown of the budget, and how each team member will optimally be relevant to the execution of the project. Evidently, the budget breakdown is fair, divided by parts of the projects and the total budget allocation is reasonable, feasible and will leave no doubt in the minds of the community in rating this project well. Again, on the profile, some of the names put forward by the proposer, they have demonstrated sound and impactful contribution to the community; this highlights their expertise and competence of the entire team. To add to that, the profile of the team is open to the community given the provision of the links to their profile; hence their expertise can clearly be confirmed by the community.", "q1r": 5, "q2": "The overall metric is very elaborate and with the kind of KPIs presented by the proposer, i think they’re very much aligned with the challenge's requirements. The extent of fame the hub creates for itself is surely the most effective metric to track the success and also the amount of public engagement the hub achieves in the form of posts, videos, responses are verifiable add-ons. The team intends to make available results from the event to the community via their social media platforms. This gives enough grounds to make proper credible diagnoses and can be useful to the auditors and community to track the progress of the proposal. Considering the team having raised funds previously for their venture, I feel the auditing process should be less complicated and the community would be able to generate enough evidence regarding the proposal's triumph. However, considering the team have gained much experience within the cardano ecosystem and being an establish members community, I feel the proposer could have provided the community with a few more unique metrics that makes them different from the other project that will incite support from the community. On accountability to the cardano community, it’s unclear how the team will update the the community writhe the relevant information to help assess, monitor and track the success and progress of the project. This will greatly affect the chances of the project beib funded; hence i suggest the team adopt communication channels that would make accessibility to these document easier for community members.  \n\n\n\nThere's clear time-framed plan with good activities that help to understand what will be done to initiate the project. The roadmap in this project is well designed, incorporating the needed work structure to provide guidance from start to completion of the project. They also provide the community with a detailed breakdown of the budget, and how each team member will optimally be relevant to the execution of the project. Evidently, the budget breakdown is fair, divided by parts of the projects and the total budget allocation is reasonable, feasible and will leave no doubt in the minds of the community in rating this project well. Again, on the profile, some of the names put forward by the proposer, they have demonstrated sound and impactful contribution to the community; this highlights their expertise and competence of the entire team. To add to that, the profile of the team is open to the community given the provision of the links to their profile; hence their expertise can clearly be confirmed by the community.", "q2r": 5, "assessor": "z_assessor_2734", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7063, "q0": "The proposal satisfies the challenge's stated goals. It's a remarkable attempt to enhance and have a good influence on students studying business and engineering who have an entrepreneurial attitude. The opportunity to increase their significance in society and the catalyst ecosystem will be greatly enhanced by this because it will foster their innovative startup and make them more creative and self-assured.\nMany graduate students with excellent project work ideas do not receive financing and scholarships to put their unique ideas into practice after school, thus this project will be a terrific opportunity to let students show off their abilities. \nUnless they will choose students and colleges at random from around the world, the proposal did not specify the target location where the project will launch. Apart from that, I think that this plan would act as a hub for connecting with students.", "q0r": 5, "q1": "The proposal team's credentials have been disclosed, and the group seems to have strong ties to the catalyst community and a wide range of expertise and understanding of the cardano protocol. This indicates that the project will probably be completed without a hitch. \nThe team is already extensively involved in the catalytic community in a number of positions in addition to having the necessary experience in establishing Cardano and blockchain technology in Africa. The team has also provided specifics of how they plan to complete this project. The spending plan is comprehensively laid out and broken down into particular.\nAdditionally, the project's proposer has provided a thorough strategy, complete with a defined timeline and all required resources, for how the project would be carried out. The proposer highlighted a few potential risks and suggested strategies for mitigating those risks. I believe  in the success of this project's execution.", "q1r": 5, "q2": "This project's proposal is extremely ambiguous because the proposer failed to specify the intended location for its implementation. Whatever the case, the aforementioned KPIs are sufficient to completely audit the project's success. \nThus, there is a strong likelihood that this objective will be accomplished.", "q2r": 4, "assessor": "z_assessor_2869", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 7384, "q0": "This is an incredible idea which aims at creating a platform, for mentoring student entrepreneurs with innovative ideas and assisting these students to submit good proposals via project catalyst to seek funding for their projects. I believe by putting these efforts,the team will be creating a place for student entrepreneurs to appeal their ideas and with this I think the idea in this proposal aligns with the challenge goals and this project will go a long way to help student entrepreneurs to be financially free. At the end of the day,we get a good number of student entrepreneurs submitting good ideas onto ideascale thereby matching one of the key metrics of the challenge. Also, student entrepreneurs with brilliant ideas will be identified in the face to face on campus outreach program the team intends to undertake and hence this solves the problem of this challenge where we are looking for brilliant students with innovative business ideas to help them submit good proposals via project catalyst to seek funding. In essence,I believe the idea in this proposal is simply, creating a space for student entrepreneurs to be guided and mentored to put in good proposals for funding and I feel this answers the challenge and addresses it effectively.", "q0r": 4, "q1": "I will start with the timeline in delivering this project. The team intends to use 8weeks(2months) to realize this project . I believe there is clarity in the timeframe. In those 8 weeks,there are three phases and we know under each phase which activities will take place and this was very clear to me.\nSecondly,the experience of the team is undeniably top notch based on the description and relevant links given in the proposal. We have here,the community manager for the catalyst town hall and the catalyst Africa school as the project lead,I believe with all this experience in the cardano community,he is capable of handling this project. Also the rest of the team are very qualified and experienced people who can collaborate well with the project lead to make this project effective. The author provided us with very detailed information about the team, their linkedins, telegram links,Twitter handles and emails and I doubtlessly think the team is very much familiar with the community and will be skillful in handling this project.\nLastly,the budget is quiet reasonable and clear to me. The team is requesting for $5000 which does not exceed the challenge setting limit and the budget is catering for 5 items with $500 for miscellaneous,this to me is fine, because,the team plans to do a face to face meet up and an online workshop and I believe all these will come with incentives for the students,though this was not mentioned in the proposal,apart from that,I believe the budget is satisfactory and this proposal is feasible enough and also, highly  likely to be implemented if funded.", "q1r": 4, "q2": "In my opinion,this part of the proposal is complete. The author provided us with the key metrics to measure the success of the project and there was clarity in the description of the key metrics which I believe are very measurable. The author also stated clearly, where we get to track the progress and success of the project. He provided relevant links to that on the proposal. We can get to track this project through the monthly report form,the catalyst coordinator chat group and the wada website and all these make this project highly auditable. The key performance indicators are also clearly stated as to how success of the project will look like. The only problem I had was how the team intends to get all 50 students to submit proposals in fund 10 but upon careful reading,this was clarified, because they plan to sensitize 5 universities with 10 students each and I believe with these small numbers in each university,at the end of it all,they will realize the target number submitting proposals. This project definitely is a project which can be audited safely and accurately by the community.", "q2r": 4, "assessor": "z_assessor_2890", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 7588, "q0": "The problem described in this proposal is closely aligned with the challenge. I must commend the proposer for putting the proposal at the right challenge . The proposer also provides a precise solution by introducing a project Catalyst to Business and Engineering Students and to mentor and examine their business projects and innovative ideas and assisting them to submit via Project Catalysts to promote the ecosystem.\nThe proposal also captures some of the key important metrics under the campaign breif by mentioning some of the key values which include at least 10 students to be mobilized per Unit ,5Universities to be to sensitized on the Cardano Peer Education ,50 Business and Engineering Students would be onboarded to Project Catalyst to contribute to various roles among others. The proposal scales up to enlighten the youth and adults about Blockchain which they can be a actively engaged in to make money for themselves and also increase the number of participants through the Cardano peer education.", "q0r": 5, "q1": "The proposer has provided relevant links to members who will help in the proper execution of the project.The proposal and team from the links provided have the desired skills and experiences to be able to excute the project if funded which I think is highly commendable.\nMoreover, the proposer has provided a detailed budget which has been broken down into identifiable bits and also the duration of the project will be an 8 weeks long project which shows the divisions of the various week and the activities that will be undertaken to the implementation of the project. Again the proposer has provided details of the team members and the roles they will play to the implementation of the project based on their expertise.\nThe proposer has also considered the main risk associated with College entrepreneurs typically having complex science behind their inventions. Thus they have great ideas but not knowing exactly how to execute on it is a challenge a lot of students  face. This will be mitigated by providing\nmentors and business executives which will be assigned to students to advice them on how to run a business, how to enter into a market for the first time, how to identify potential profit or lost.", "q1r": 5, "q2": "The proposer and team has provided a clear outline on how to measure the progress of their project by tracking of community project progress.The proposer has also indicated how success of the project will look like should they be funded which include the number of business and engineering students that will be onboarded ,\nthe number of Students that will submit their Science, technology, Engineering and Mathematics (STEM) projects on Ideascale among others.The proposer has also provided key milestones, metrics , information on how success will look like should they be funded.\nThe proposer has also indicated how their progress will be monitored and reported to the Cardano community by making reference to Wada which I think is a reputable organization and will be able to excute the project if funded.", "q2r": 5, "assessor": "z_assessor_2906", "no_vca": 15, "ne": 1, "ng": 14, "nfo": 0, "vca_o": 1}, {"id": 7621, "q0": "The problem described in this proposal is closely aligned with with this challenge. The proposal clearly provides a solution to the problem that is to introduce project catalyst to business and engineering students and to mentor and examine their business projects.Through this the proposer aims to secure major investment money for this business and engineering students. The proposal articulates how it will add value to the Cardano ecosystem by onboarding as many students as possible unto the Cardano ecosystem.Through one on one campus outreach programs, online workshops among others. The key metrics and goals of the proposal aligns with the challenge of the proposal because it deals with increasing the number of students participation on Cardano and project catalyst. The proposal is able to scale to address future challenges and it also shows a plan for the future sustainability efforts.", "q0r": 4, "q1": "The proposer provides evidence in the form of reference and links of relevant skills and experiences needed to implement the proposer if they are funded. Moreover, the proposal and teams from the links provided have the desired skills and experiences to be able to execute the project. \nThe budget is clearly outlined and is also broken down into identifiable items and it is also reasonable to achieve the set goals. The proposal has outline the milestone by providing duration with which the project will be funded which is eight weeks timetable is attainable. The proposer has considered the challenges and risks relevant to a successful implementation and how to mitigate them. ", "q1r": 4, "q2": "The proposer and team has provided clear outline on how to measure the progress of their project should they be funded. They have provided key milestones, information on how success will look like such as the number of business and Engineering students that will be on boarded, the number of students that will submit their Science, Technology, Engineering and Mathematics (STEM) projects on Ideascale, the number of students that will attend the workshops, the number of students that will be able to show interest in Cardano and Project Catalyst should they be funded thus elaborating on key milestones to look out for such as the at least 10 students to be mobilized per University, 5 Universities to be to sensitized on the Cardano Peer Education, 50 Business and Engineering Students would be onboarded to Project Catalyst to contribute to various roles amongst others. The proposer has also indicated how their progress will be monitored and reported to the Cardano community making reference to WADA which I think is a quiet a reputable organization in \nthe cardano ecosystem and will be able to execute successfully.", "q2r": 4, "assessor": "z_assessor_2908", "no_vca": 13, "ne": 0, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 7686, "q0": "The project joins the challenge as it aims to reach business and engineering students in order to boost their brilliant ideas to have an impact on their society but also facilitate access to funding for these students, including the Project Catalyst would be ideal.", "q0r": 5, "q1": "Given the experience of members being Community Managers for different African hubs, african Town Hall and the Catalyst African school, Evaluator Proposers, Members of the student representative council, Cardano Advocate and given the reasonable short plan and budget presented, it is appropriate to experiment with the implementation of this brilliant project in order to increase the network on Africa and for future generations.", "q1r": 5, "q2": "The plans presented according to the activities allow them to be audited via the number of students reached for business and engineering students on Project Catalyst, the number of workshops facilitated online with students interested in submitting their innovative ideas on Project Catalyst but also monitoring and auditing will be possible thanks to the relevant links of https://www.wada.org, https://eship.ox.ac.uk/student-entrepreneur and https://www.wada.org /about-us; this apart from the monthly reports and the youtube videos posted on the channel will make it possible to audit the evolution until the implementation of the solution.", "q2r": 5, "assessor": "z_assessor_2915", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}, {"id": 5470, "q0": "The challenge is an entirely new one, it is quite hard to expect what exactly one can expect from the ideas presented, but this proposal seems like it is tailor-made for this challenge. The proposer plans to reach out to business students and educate them with all the necessary inputs regarding bringing their ideas to life and monetizing them. This proposal could draw a lot of young minds to the Cardano chain and increase the kind of applications that are built on the chain. The online workshops are also included by the team in their proposals, hence one can assume that their work is surely gonna reach students from different walks of life across various nations. The global extent of the proposal makes it more exciting. The team's plan to involve experienced figures all along the project to continually assist the students, adds more value to the project and to the students involving themselves. The students educated would, later on, build their ideas on the chain and the chain itself opens up to whole new dimensions of target audiences.", "q0r": 5, "q1": "The requested budget of about $5000 is 5% of the total allotted funds for the challenge and the team provides a very transparent breakdown of the budget which is sensible in every way and economical. The team introduced here is very much capable of pulling this venture effectively, the expertise each of the members has is commendable. The team members who have worked on previously funded proposals show their character and passion for the Cardano chain. The road map laid out by the team for about 2 months post funding is very practical and doable, the team has not overestimated any aspect of it. The fund requested is very small considering the total funds, the community can take a chance with this proposal as the impact it could have\n is ten folds. The project can be assumed to be completed successfully, in view of the fact that all the members of the team are reputed names in the community.", "q1r": 5, "q2": "The team makes no reservation in providing the readers with viable metrics to assist the audit process. The team ensures to provide a monthly report to monitor its progress and also do the same over their telegram group. The Key Metrics that can be measured are clearly identified by the team and a quantifiable figure next to each of them makes it more reliable.  The success metrics such as the number of students from various streams onboarded and the workshop attendance are clear indicators that the community can rely upon to assess the success of the proposal. The project is a new one, and also a very non-digital approach, it is quite hard to identify the metrics that one can easily use to track, but provided it is coming from a reputed team, the readers can assume that the team shall assist the audit process in every way to make it easy and prolific. The number of students coming out of these workshops applying for funding in the future rounds will be the ultimate success indicator the community can use.", "q2r": 5, "assessor": "z_assessor_2704", "no_vca": 18, "ne": 1, "ng": 17, "nfo": 0, "vca_o": 1}, {"id": 13710, "q0": "[IMPACT]  \nThis proposal target the Engineering and business students by introducing them to project catalyst and also to examine their innovative ideas and business projects by providing them with assist for them to to submit via project catalyst. This will be done through ;\n#securing major investments for college entrepreneurs. \n#one-one campus outreach i.e. the main activity of the project and finally, an online workshop. \nThe workshop will provide education about entrepreneurship and which has positive impacts on the entrepreneurial mindset of young people and their intention towards entrepreneurship. This makes the proposal address the challenge \"challenge and scouted for students\". ", "q0r": 5, "q1": "[FEASIBILITY] \nFirst of all the proposal has shown with details on how to prevent the project for becoming and failure. \nAlso the time distribution for the funding of the project is very reasonable compared to the environment where the project is going to take place. \nFurthermore the budget breakdown is within reasonable amounts and the project team also have experienced members who already has been able to successfully implement their project during the previous funding. ", "q1r": 5, "q2": "[AUDITABILITY] \nTracking of the project will be done by reporting to the community with evidence of their progress attained through the monthly report form and also the catalyst coordinator chat group on telegram and the wada websites. \nThe assurance of it being successful will be by setting up a student category and increasing the exposure of their ideas so that students can expect easier funding and scouted engineers and business students on project catalyst. ", "q2r": 5, "assessor": "z_assessor_3759", "no_vca": 12, "ne": 0, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "To introduce Project Catalyst to Business and Engineering Students and to mentor and examine their business projects and innovative ideas and assisting them to submit via Project Catalyst.", "experience": "Community Manager for the Africa Town Hall and Catalyst Africa School | Proposer Assessor | Veteran Proposer Assessor | Students Representative Council Members | Cardano Advocator | + Wada Ghana Team"}