{"id": 417115, "author": "keith", "title": "Create Local/Online Job Fair System", "url": "https://cardano.ideascale.com/a/dtd/417115-48088", "category": 26599, "amount": 17500, "description": "There is no representation from Cardano to grant students internships and full-time opportunities.", "f6_no_assessments": 17, "f6_rating": 3.7254901960784315, "videos": [], "media": [], "f6_assessments": [{"id": 1670, "q0": "The idea aligns well with the objectives of the challenge, in theory, but in practice more in-depth explanations about the project are needed. In theory, the idea fully addresses the problem described in the explanation of the challenge itself: “Most student entrepreneurs are suffering from a lack of resources, especially in funding and in the recruitment of engineers”. The problem is that there is no place that is intended to establish the connection between students/future interns with companies that work using our blockchain technologies. So what is suggested here is to create a specific platform for this, which will act as a “job hub, we will create a section dedicated to students. This will be a place for people to represent at their local universities, but also on a remote/global level.” I believe the idea is very relevant and directly contributes to facilitating student engagement with opportunities in our community, but important information is missing. How would the site be built, what would the user interface look like? What kind of information would students have to provide to apply for vacancies? Would their identities be tied to Atala Prism? I've already seen some proposals that work to link professional CVs to DIDs, it would be interesting if this were done here too, for example. Would there be some artificial intelligence that would align students to the main vacancies for them, that is, vacancies that make sense according to their profiles, training areas and interests? What was a little abstract, in my view, would be the functioning of the site itself. We know what would be done, but we don't know how, we don't have details about how this site would be designed or how it would work. How would opportunities related to Cardano be distributed, how would the webinar cited by the proponent be held? How would students be introduced to this platform and encouraged to engage with companies that need their expertise, how could we provide instruction for those wishing to specialize in a certain programming language, for example Haskell/Plutus in the case of Cardano , but have no opportunities? Will the site also partner with some courses, for example? In general, I agree that the proposal is well aligned with what the challenge seeks, but it lacks that detailed explanations had been provided about the practical functioning of the idea. If these details had been provided, I believe the impact rating would be maximum, but in this case I will give it 4 stars, because I agree with the potential of the idea but I also think that more general detail is needed.", "q0r": 4, "q1": "The phases of the project development are informed in a superficial way. Firstly, we do not know how long the project would take to develop in its entirety; we know that phase 2 would take 6-10 weeks to complete, and phase 3 would take 2-4 weeks. What about phase 1 and 4? While they are already underway, it would be important for the proponent to provide us with an estimate of how long they would take to complete. The activities that make up each phase should also be better detailed; in phase 1: how would “the interest of a wide range of universities and entrepreneurship clubs be gained to assess demand”? How would this project be marketed? How would the target audience be aware of the existence and advantages of such a platform? It would be important that the dissemination plan was explained in an exact way, so that we could be sure that the maximum number of students and companies would be involved with this initiative. In phase 3 it is said that online or local job fairs would be held, if they were local, in which countries (or countries) would they be organized? It is possible to assess that in the budget division, no money is destined for the organization of face-to-face meetings, so it would be necessary to have more security in relation to variables such as rent, etc., necessary for local fairs to be possible. In general, all phases are mentioned in a very short and succinct way, more explanations are necessary so that we have an understanding of what would be done and also how. Regarding the division of the budget, 15,500 dollars are requested for the realization of the project. The amount is divided into 3 parts: the work of the developers, the marketing and mentoring program. All 3 parts should be more detailed too, so we could understand exactly how the money would be used. Most of the money would go towards the developers' work, but what would their work routines look like? How much would you be charged per hour of work? How many hours per week would they dedicate themselves to the project? Regarding marketing, we would need to understand how it would be done, so that we would know how the 3 thousand dollars would be used - would it be done through social networks, would the money be for paid advertising in these media? And in relation to the mentoring program, this would also need to be better explained, it is not clear what this program would be, what the mentors would do. Would they be employees who would be helping students to find the best opportunities, to prepare curricula in more attractive ways for companies, for example? Finally, speaking of the team, although little information has been given about the duo, it is said that they have previous experience working at Cardano, including full-time, which conveys a lot of confidence that they are prepared to successfully develop this project.", "q1r": 4, "q2": "Unfortunately, auditability leaves something to be desired, due to the small amount of information suggested for us to monitor both the process and the final results. Regarding the process, it is said that “we will be working on an agile mansion for developmental milestones, as well as to keep up with the business needs of our students and mentors”. What would these developmental milestones be? How would the needs of students and mentors be monitored? It would be necessary for the proponent, at first, to better detail the roadmap, so that we would have more content to carry out the monitoring of the phases. If we knew exactly what would have to happen, how and when, we would be able to audit whether activities were being done as planned. It would also be necessary for the proponent to inform the Cardano community of important updates, such as milestones, partial results that would be achieved throughout the development of the project. In theory, we have a lot of things to audit here: website development (both programming and design); the scope of the project (marketing, public engagement - companies and students); degree of hiring, how many students who signed up on the platform would have gotten internships, for example... Talking about final results, again if the proponent provided us with a very small amount of information to be perceived, success would be faced by the realization of online/face-to-face fairs of jobs and with a robust mentoring program. But we would need to know specific information about each of these fairs, for example, how many would be taking place, how many participants (how many students and how many companies), where they would be happening (how many % online, how many % in person - and where, in person)... , in addition to whether the fairs took place, how was the level of use of them - for this, a satisfaction survey could be carried out between students and companies, understanding numerical data such as the percentage of students who were hired in relation to the whole who participated in the event , if the companies found the fairs to be really facilitators and catalysts for hiring to take place, etc. It would be necessary to understand the impact of all this for Cardano, if through these new stages, more projects built on our blockchain would be being carried out; whether metrics like the number of smart contracts/Ada in circulation/CNFTs minted/active community members would be growing and etc. In general, I disagree that the auditability of the project is adequate in the way it was presented.", "q2r": 2, "assessor": "z_assessor_2259", "no_vca": 14, "ne": 10, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 194, "q0": "The proposal wants to create a section dedicated to students on their job center platform, by provide parallel functionality to their job center platform; add the ability to create a profile and connect LinkedIn for students to network with other students that share similar interests; create a mentor system for base level students to understand what is going on in the Cardano ecosystem and what opportunities are potentially available to them. This will attract the interest of just graduated people with innovated minds to the space. \n\nThe proposer aims to have a network of students that now have awareness of the Cardano ecosystem and its capabilities. This well fits with Challenge to prepare a group of people willing and able to make contributions to the ecosystem.", "q0r": 4, "q1": "The proposers are with IT experience. Their Linkedin profiles are clear posted showing their ability to complete the tasks. The budget’s reasonable but its over the challenge limit of usd 5,000.00. The proposer needs to adjust their plan or they can ask for fund for every single phrase. The proposer aware of the risks and provide their solution by having have a webinar or training session and networking events for student. However, I’d like to know more details work /job description to be done in each phrase. What the 02 developers will do in two months for building out the student center for their app? What kind of works be prepared for conducting local job fairs or online job fair system. What’s their marketing plans? More details will increase proposal’s feasibility.", "q1r": 3, "q2": "The proposer provides targets to be completed but no any KPI or milestones presented. I’d like to know more ie. how you define a successful online job fair? how many students expected to subscribe to online job fair ? or how many job opportunities introduced to students during yearly in person job fair ? how many mentors are attracted and register to your program. Also, I’d suggest the proposer to publish social media channel to keep community updated on their progress. By that way, the audit can be carried out easily in effective way.", "q2r": 2, "assessor": "z_assessor_2055", "no_vca": 22, "ne": 3, "ng": 19, "nfo": 0, "vca_o": 1}, {"id": 12571, "q0": "Proposing the issues identified in the formula that needs to be addressed is that Cardano does not have any representation to grant students full-time and hands-on opportunities. The proposed presentation will add value to the Cardano ecosystem by building on the platform of the proposer's work center, the proponent will create a section dedicated to students. This will be going to for a young age, determined to find incredible opportunities in the Cardano ecosystem. The proposal also made in terms of value-added implementation is: the need to assess the level of interest and determine if the organization of an online or local work fair is more appropriate. From a construction point of view, the time to participate in the local work fair will be shorter while the online system is built but this is more dependent on cooperation with the company or the university. The result is an existing network of students aware of the Cardano ecosystem and its functions. I believe that with such an approach, the project will be able to grow further and will tackle future formulations. I rate this project 5 *.\n", "q0r": 5, "q1": "The proponent has provided evidence of the relevant skills and experience required to implement the proposal. Mr. Keith Hedges - A software engineer for four years at Fortune, He has worked on the music NFT platform, is a core contributor to Freeloaderz, and has run the Hedges Stake Pool. Mr. Erick Avalos - has years of software engineering experience at a publicly-traded company dealing with high-integrity code. he is also the core developer of an NFT project on Cardano. is a team with experience in software engineering from university majors, to traditional corporations and now Cardano development. Having the ability to leverage key partners to host online or local job fairs is a strategic location. The proponent can also provide a budget, but the proposed budget does not match the set budget and has not been clearly outlined. The proponent gave a realistic timetable to complete the work with 4 stages but the proponent has not given a specific time, so we cannot follow up in detail. I would like the proponent to be able to determine the duration of the project and clearly outline how long each phase will take. The proponent has considered the risks involved and has come up with a measure. Specifically:\nKeep a healthy distribution among students with Cardano-related opportunities available.\nOne way to mitigate this is to host webinars or training sessions and networking events that will leave students with something to take away if nothing else works for them. With this feasibility, I rate 4*\n\n", "q1r": 4, "q2": "The proponent has not provided a specific implementation roadmap. When the project is implemented, the Cardano community will have an additional system of local/online job fairs, face-to-face job fairs every year or biennial, and a strong mentoring program. clearly describe the problem from Cardano to grant students internships and full-time opportunities. this is a very meaningful new project but the proponent hasn't given clear details, I would like This proposal will be made more clear. With this suggestion, I rate 4*.", "q2r": 4, "assessor": "z_assessor_3438", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 12122, "q0": "The Problem: To hire a good candidate on employment issue nowadays is vary. Employer can get the worker not just by job fair system. Some headhunter and other subcription method on social media or platform already exist on delevoping country also. The solution: I somehow agree to the parallel term ( which is very supportive way to create a good network and spreading the information while many roadmap must be done ), But using Linkedin again as the identity solution to new employment seems a little bit traditional. But the additional feature \"Mentor\" System might find a way to recruit many people to join in and have more activity on Cardano Ecosystem. Yet, this proposal don't explain how it will work that well. The story of how they accomplish their plan is also ambigouty, technically they not present a channel distribution or even leads and account ( yeah we can see how Linkedin provides data on employment issues). The Result: being aware of Cardano ecosystem is the first step of knowing the very existence and utility of Cardano. But the Proposer maybe saw that  \"a network of student\" will be assembled through their job Fair System. The proposed solution that will address the Challenge : only mention about three things : Mentorship, Entrepreneurship opportunity, and differentiation tactic to attract working situation for students. Yes i will agree to the activity which will deliver some students actively on Discord. Right on target and place to educate. The proposer must also have interest on branding content, brand existence of Cardano, decision to join in, and also buying or spending their time for participation and future benefit that the students / graduates get. The last impact(risk that could prevent): if webinar, trainning, and mentor system do not work out, as they already mention this is also a risk, then, they are not confident enought to launch such activity, yet the potential and strength of the market has been notice by the Proposer.", "q0r": 4, "q1": "Feasibility phase 1: now i can clearly see that they already do something about the addressed problem and challenge, yet remain no further link to this current condition.phase 2: i still wonder on how the form of student center will works on this project. if it is attach to university motivation and plan, it will be bandwagon term, which we know the value won't be deliver fully understandable.phase 3 will follow up the phase 1 result: how many companies, employers and also on what categories of common interest, and when it will benefit Cardano Ecosystem beside Discord link of Cardano. Parallel on phase 3 online, so little information provided, with no visions nor missions to be achieved on such a huge fund requested. And Mentors do not exist from the phase 1, which could make this project even harder. I am hoping that this proposal have more links and breakdown on the roadmap and contents.Feasibility 2: Budget breakdown of three main cost, development of 10k is huge for the scope of work on this kind of proposal. i wonder which will cost more, development or partnership type. 2.5 k mentorship program can be maximized if the Mentor participant are really comes from blockchain ecosystem, which i assume that it will make an involvement of more than 5 people. If the term of this job fair system based on :\" every candidate which will have a job, willing to contribute on Cardano, that gonna makes this hiring platform the best one.", "q1r": 2, "q2": "Now the auditability mention about business needs for students and mentors, while phase 4 consist of aligning mentors with candidates. I can not figure out what kind of business needs will cost so much without any reference or links. But i believe the idea of job fair system that will bridge people to Cardano ecosystem with a good content and network. Make sure everyone gets the information of Cardano activities from GeniusYield, Emurgo,ETH,ECS also Cardano. The last thing i believe from this proposal is that mentor system will work out with consistency but the content will not be heard as the output of this project in the future without any links or at least report and the form of this kind of project.", "q2r": 2, "assessor": "z_assessor_3362", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11354, "q0": "The proponent raised the problem that reflects the current situation of student entrepreneurs, they are young people with a lot of interesting, unique and creative ideas but lack the resources to develop. them , especially there is a lack of funding for professional development and few opportunities for students to access these resources.\n\nSo creating an online and local job fair system will be a place for young people, determined to find incredible opportunities in the Cardano ecosystem.\n\n The proponent has detailed solutions for each step that accomplish the goals of the proposal very specifically.\n\nMany of the results to be achieved that the proponent listed out I find really interesting, this helps the proponent to know in advance what the outcome after the project is successful.\n\nThe risks proposed by the proponent show that they can anticipate the risks that could affect the success of their project.\nThe solutions proposed by the proponent to deal with the risk are still general, I really wish the proponent could come up with more specific solutions.", "q0r": 5, "q1": "The project implementation process is planned in detail by the proponent in terms of time, quantified the work, and the results to be achieved for each quarter specifically. it helps the community see the path to completion of this project is feasible.\n\nabout the budget is also broken down by the proponent however it is not really clear that this needs the proponent to show in detail what more than 10k developments are like and the remaining budget items should also be stated more clearly.\napart from Catalyst's funding, does the proponent have any additional reserve funds if the ADA price drops sharply after the funding round, does the proponent need to call for more budget from the community?\n\nWith the team that made the proposal, people with software engineering experience from university majors, to traditional corporations, and now Cardano development, they are publicly identified, their image is public. ,link .this is a good opportunity to propose a successful implementation of the descriptions in the proposal.\nXem thêm về văn bản nguồn nàyNhập văn bản nguồn để có thông tin dịch thuật bổ sung\nGửi phản hồi\nBảng điều khiển bên", "q1r": 5, "q2": "Although the metrics and KPIs have not been provided specifically, the proponent has provided the community with links,\nTwitter social network updates the progress of the project.\n\nThe community can also check the required results for export through the webside provided by the proponent.\nThe success of to export is to create a successful online job fair.\nIf the proponent pointed out that a job fair held in person every year or every two years might be a bit small, and it should be pointed out that if there is a risk of a pandemic that cannot be held in person, it will be How to organize online. What are the ways to get students involved?\n\nWhat is the goal of sustainable development and being able to stick with the catalyst fund to help this project develop in the long term.\nthis is a brand new proposal so the proponent's recognition of the success of this project is practical.\nThis proposal meets the requirements of the challenge.", "q2r": 5, "assessor": "z_assessor_3241", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 11236, "q0": "This proposal is well written and clearly addresses the challenge. As of now, there is no proper job center platform for students to onboard on Cardano Blockchain. This proposal highlights that and aims to fill that gap. They plan to create a job center platform where there would be a section for young, determined people to find incredible opportunities within the Cardano ecosystem. There will also be mentorship and guidance. Overall, it is a well-thought-out proposal and a well-needed one too. ", "q0r": 5, "q1": "There are 2 main individuals in said proposal. They both have years of experience as software engineers and experience working on Blockchain platforms that were NFT-related. In regards to experience, the team should be more than capable to handle the work they have set in motion. As for the plan, which is already set in motion. It is very detailed and factors in many issues. They have an online platform, mentorship, and simple UIs that are integrated with LinkedIn. With all these to make a clear path for the students to breakthrough into the industry. Thus the plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The means to audit the progress of the proposal is not detailed enough and leaves some room for improvement. However, upon reading the proposal again some timestamps have been indicated such as 2 months for development and 2 months for the marketing/partnership aspect. In addition, there are 4 phases and those phases could help the audit process. It would have been better if all these were mentioned in the auditing section. The success of the proposal will be measured by the yearly or bi-yearly in-person job fair and robust mentorship program. These are all sufficient to measure the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 8861, "q0": "As we have seen most of the companies asks for student's skillset in working or internships while hiring for job, which has been biggest problem for the new joiners, hence to counter such scenario the proposer wants to create  center platform we will create a section dedicated to students, where youngsters can find incredible opportunities within the Cardano ecosystem, this will help the person financially so that they can continue the carrier, it will also help cardano ecosystem  where community can grow bigger and stronger, Hence This proposal effectively addresses the challenge. ", "q0r": 5, "q1": "The proposed task doesn't involve much of a risk , where creating interest among a wide range of universities and entrepreneurship clubs and companies and conduct local job fairs based on the results, however the proposer's team has already worked in cardano eco system , Hence  to conduct an online job fair and/or a local one a strategic location can be achieved, the proposer even wants to create a mentor system so that at a base level students can understand what is going on in the Cardano ecosystem and and how can they utilize the options available to them, hence with minimal risk involved and Given experience and plan presented it is highly likely this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The audit has clearly mentioned each step on how to complete the project in the proposed solution, audit has even explained on how people struggle to get job on Entry level and how local/Online Job Fair system can help them, audit has even mentioned how students can get awareness about blockchain and utilize the features available through blockchain.\nThe audit has explained detailed timeline structured to complete the project, audit has marked the budget estimation as 80k dollars which is way too much for the proposed project, the audit hasn't explained how such massive budget will be utilized to make the project efficient, with increased scale of budget and moderate risk involved, The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 8439, "q0": "Proposal will be in the target of challenge, and I think this proposal can increase the attraction from students participating because it gives advantages for students who are looking for internship and full-time job. time. The solution is clear, experience is demonstrated by people with soft engineering skills from universities. It is proposed to learn deeply about the Cardano blockchain, so they are looking for opportunities for students to participate, you understand that students want to start a business, but they are students, so starting from scratch is uncertain. should take advantage of the creation of a local/online job fair system to circumvent the limitations of students. Organizing webinars to reduce the risks you encounter as well as create luggage for students when they are trained to bring a little more confident experience to the workplace later is also a good solution to solve problems. decide risk.", "q0r": 4, "q1": "This proposal is well written, well proven, with accessible links, but I don't know who the instructor is, who wrote this project or in other words the location of the author. How are people in this project? Each stage you plan in this project, we can understand the work as well as the working time, the set goals are active. The budget you set out at 17500usd exceeds the limit that the challenge for funding is 5000usd. Please consider and adjust to be reasonable with this level of funding.", "q1r": 4, "q2": "Metrics do not see specific figures, goals set and work completed. You guys in general should not be able to highlight our questions. It takes a lot of basic data for us to check your project to give users confidence in this idea. Success is expected to be attended by a large number of students, the fair is held regularly to create searches for thousands of students preparing and going to graduate school, creating internships to gain experience to apply when going. do.", "q2r": 3, "assessor": "z_assessor_2984", "no_vca": 13, "ne": 1, "ng": 10, "nfo": 2, "vca_o": 1}, {"id": 8272, "q0": "The proposal fits very well with the challenge, and its idea can be very effective to help students access opportunities in the tech field. While students have a lot of potential and should be considered an investment, many companies prefer to hire experencied professionals. So this is an interesting solution to give students opportunities while attracting talents to the Cardano ecosystem. The risk is also a valid point, but the proposers came up with a good solution.", "q0r": 5, "q1": "The milestones seem feasible, but I think it could benefit from a little more detail within each phase, so we could understand the different steps that the project will require. The budget is a bit high considering each proposal for this challenge should have a budget of around US$5000.00, so I believe the proposers could think of a way of scaling down this project and maybe trying to get bigger funding in the next funds. The proposers' backgrounds are aligned with the project's goal, so I believe they are capable of carrying on the proposal.", "q1r": 3, "q2": "I think there could be some more information on key metrics and some of the numbers the proposal aims to achieve for example, how many students are being tutored, how many students getting a job after the programme, etc. I think there should also be more details on what is considered to be a\"Successful online job fair\", so, that by the end of the project, the proposers will know whether it was successful.", "q2r": 2, "assessor": "z_assessor_2971", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 7593, "q0": "This is a brilliant idea that will help promote the Cardano ecosystem by creating local/online job fair for students to be able to realize their full potentials in the Cardano ecosystem. The problem described in this proposal is closely aligned with the challenge, the proposer has done well by putting the proposal in the right challenge.The proposer provides a precise solution to the problem by providing a job center platform that will create a section dedicated to students. This will be a spot for young, determined people to find incredible opportunities within the Cardano ecosystem. The proposer also captures the key important metrics under the campaign breif which will make enrepreneurship  which is often hard to start much easier for students by providing the enabling environment for students to establish their own business through the online job fair.\nThe proposed Solution will provided will be able to gauge the interest of students and determine if it is more appropriate to launch a local or online job fair. The proposal scales to finding opportunities for students to be able to find online jobs with Cardano and also partnering with other universities to promote the online/local job fair system.", "q0r": 5, "q1": "The proposer has provided relevant links to members who will help in the proper execution of the project. The proposer and team from the links provided have the desired skills and experiences to be able to excute the project. The proposal has provided a budget but has not been able to really break it down into identifiable bits on how the money will be allocated to each item. The proposal outlines the milestones by providing a duration of 4 phases which will be used to implement the project. \nMoreover the proposer has provided the team members with detailed experience that shows their field of expertise to the successful implementation of the project. The proposer has also considered the main risk of keeping a healthy distribution between students with Cardano related opportunities available to prevent the case of too many students or universities onboard before having the necessary resources to accommodate them.This will be mitigated by providing a webinar or training session and networking events which will leave students with something to take away if nothing else works out for them.", "q1r": 4, "q2": "The proposer and team has provided a clear outline on how to measure the progress of the project by working in an agile manor for development  of milestones as well as keeping up with their  business needs for the students and mentors. They have provided a roadmap with milestones and a clear time horizon on how success of the project will look like by Successful online job fair\nyearly or by yearly in person job fair , robust mentorship program among others. The proposal will use the available public channels for the delivering  of regular updates to the community to make audit easier.", "q2r": 4, "assessor": "z_assessor_2906", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 4779, "q0": "The proposer points to the problem that there is no representation from Cardano to grant student internships and full-time opportunities and claims that he will create a section dedicated to students on his job center platform. The proposer explains that it will be a spot for young, determined people to find incredible opportunities within the Cardano ecosystem. In the proposal, we come across a section that explains how this project will add value to the Cardano ecosystem and key metrics together with the set goals meet the challenge settings. ", "q0r": 5, "q1": "The proposal presents a team of two people who transparently present themselves and their work via LinkedIn, and we can clearly see that the team has the necessary knowledge, experience and skills needed for the realization of this project. It's good to know that this Challenge has a budget of $100,000 and the team is asking for $17,500. I would like the team to work out a detailed budget break down with a work schedule that would show how many hours are needed to accomplish the goals. The team presents a work plan with a time frame within the idea should be realized. It would be great if the team worked out who will do what from the team members and how the work will be done. In the proposal, we have an idea about possible risks and the team offers concrete solutions if risks arise. ", "q1r": 3, "q2": "I would like to see a detailed roadmap with clear time frames when the project starts and when the project will end!? It would be good if the team worked out KPIs through which the community/voters could monitor the start of the project, development, completion of the project. Maybe you should think about opening a public channel for updates so that the community can audit the progress of the project.", "q2r": 3, "assessor": "z_assessor_2616", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4741, "q0": "proposal is a good idea , the idea is to create a local / online job fair system . on the job hub platform, the team created a section specifically for students to be able to participate in what's going on in the Cardano blockchain and what opportunities are available to them, we all know the Cardano community is very open. For Vietnamese to connect more students with people with interests or skills that they want to experience positively, it is suggested that they can be scaled up to address future challenges and grow the ecosystem. Cardano . Entrepreneurship is on the rise, especially for students who don't know where to start. The job fair entry level for students is an important recruitment tactic by companies and groups that are likely to disrupt with a more attractive way of working . on the subject of risk the proposal has been put forward . potential of the project and have come up with a plan to overcome it", "q0r": 4, "q1": "with the roadmap of the proposal stated timelines , reasonable timelines for completing the work set out detailed objectives eg phase 1 interest in a range of universities school and business club for needs assessment , phase 2 building a student center for the application of the proposal , etc. with a phased and timed roadmap to know how much time to complete I appreciate the required project budget in the amount of 17 500$. This amount is suitable for the difficulty level of the project. output and time to complete the work , looking at the detailed analysis shows that the project has been divided into expenditures for each item . however it would be great if the team split the development and marketing like development on what for each sub-category? How much did it cost for that item? How much time to complete? for the community to know better about the project's working process, and if the proposal needs additional budget while in case more funding is needed, give a detailed plan talking about the proposed project team. includes members of the proposal stating their work-related experience, there are reference links to the personal page, so in my personal opinion, the feasibility of the proposal is completely communicated. get what is done . thank you", "q1r": 4, "q2": "What the team described about measuring the project tracking I found that the auditability is excellent, related to part of the successful outcome of the project, i.e. the team project development process. fulfills its mission as a successful online job fair. annual live job fair .strong mentoring program . The team will work in an agile manor for development milestones as well as keeping up with business needs for students and mentors. Due this is a completely new community-based project for assessment and stars. funded project may i believe this project is suitable for the challenge .good luck", "q2r": 4, "assessor": "z_assessor_2615", "no_vca": 14, "ne": 0, "ng": 8, "nfo": 6, "vca_o": 1}, {"id": 2804, "q0": "\"The way to report the problem of the idea is not really clear, it has a vague meaning in general, for example: Currently, Cardano does not have an organization representative to look for and connect jobs for students, actually intern, can work full time or online, here is my example to make this idea easier to understand *the explanation of the proposed solution is also a bit sketchy and inadequate example meaning this way: \"\"Our solution is to create a place where students can participate in what is happening in the Cardano blockchain and what opportunities are available to them\"\". Is this a suggestion that you want to find opportunities for your students on the Cardano ecosystem? train them with the knowledge available on IOG data * but below in the description of the proposed solution it is stated that : will overcome and break the recruitment tactics of companies like So what is the main purpose of this proposal? * If you want to focus on developing an application to connect and search for a temporary agent (job broker), the proposed team needs to be more detailed and provide documents focused on that part, not rambling difficult to understand and very difficult to define for the assessment team. \"", "q0r": 3, "q1": "\"I have no comment on the published roadmap of the proposal, but do have a small comment on the proposal in the budget section:\n  - announced budget 10k$ for two developers for two months, so it's 4 months working for two developers, pay each developer $2.5k per month. with the average senior programmer salary is 100$ per hour but the work to implement this idea is very little technical, it only takes a few hours for a programmer to create an application like the one proposed. request, in this proposal mostly community activities and connections would not be suitable for paying this amount with such a two-month salary\n  - and the mentoring program is 2.5k $ I have not seen the proposed group mentioned in this mentoring problem solution section, need more explanations \"", "q1r": 3, "q2": "\"No indicator has yet been provided for the community to track the progress of the proposal, nor has it been committed to reporting on the completed work of the proposal.\n   there are three suggested success metrics to provide but it's not easy to track or define and the proposal also doesn't have a statement that will support the community on this. I suggest that the proposal team need more detail or can consult with people in the community about the proposal presentation. if that is the case, then there will be a chance to get the maximum evaluation score and be elected in the next election rounds.\"", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}, {"id": 2418, "q0": "The main subject addressed by this proposal is quite relevant, since we have not yet found many recognized partnerships between Cardano and universities for recognized internships to be offered, as well as job offers in general. Creating an integration center for this purpose is undoubtedly a great way to spread the knowledge and use of blockchain, as one of the first professional experiences of students can already be in this area, which will certainly make it easier for their future choices to also belong to this area. of technology. Thus, without a doubt, the idea that motivates this project is very interesting and relevant, as well as fitting correctly into the challenge in question. But we cannot say that the proposal is really in line with the definitions of this challenge, because unfortunately the budget being requested exceeds the limit of $5,000 for the proposals of this challenge.", "q0r": 3, "q1": "Regarding the feasibility of the project, we see that the professionals involved have very relevant experiences in large-scale companies, which certainly indicates a good competence of this team. Additionally, CVs were also made available so that their experiences could be proven. We have that the steps described in the project timeline are quite consistent and, taken together, seem to cover well the activities necessary for the fairs to be successful. However, as mentioned earlier, when we analyze the budget details, we realize that the allocations make sense and it is even interesting to see the team's concern with directing expenses to the project's marketing. But we have again to mention the fact that the total amount is exceeding the limit allowed for this challenge, which jeopardizes the viability of the project.", "q1r": 3, "q2": "The way chosen to follow the evolution of the project seems quite correct, since the agile method is one of the most used ways today to obtain a good progression in software development projects. However, we have that the presence of some well-defined parameters would be very useful to better understand the evolution of events. Some of these parameters could be, for example, how many projects are offering vacancies at fairs and how many students are actually getting these opportunities. The perception of success described is in accordance with what was developed in the proposal, in addition, it would be interesting if some goals were exposed to clarify the perception of success or not of the project. Such goals could be an average number of participants in the fairs to be reached or a certain number of partnerships between students and companies.", "q2r": 3, "assessor": "z_assessor_2306", "no_vca": 13, "ne": 0, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 2068, "q0": "The idea of ​​this proposal is great, a job fair for students in a growing industry will offer a lot of great opportunities because there are so many college students who struggle all the way to find a job when they graduate. This is a good opportunity open to students and if this project goes into practice, some great people will certainly be generated from this program. This proposal is certainly nice and complete, it tackles some really important issues that are key to this challenge. However, it is a pity here that in the challenge \"Challenge & Scouted for Students\" the budget limit per proposal is $5,000, this is aimed at helping more students experience the resource support from Catalyst. This proposal requires a budget of $17,500 which is already over budget, so I think your proposal would be a better fit for the \"Developer Ecosystem\" challenge as it also meets the \"attracting developers from outside the community participating in Catalyst\". I'd love to give this project the highest score, but for the above reason, unfortunately, I can only give it a 4.", "q0r": 4, "q1": "Regarding the feasibility of the project, I think it is average. The first is about the roadmap, the proposal provides us with 4 stages and what actions will be included in each of them. It is good that 2 out of 4 phases (phase 1 and phase 4) are in progress, it would be nice to propose in more detail what specific activities are included in those phases. For example, \"Phase 1 - (ongoing): Garner is interested in a range of universities, entrepreneurial clubs, and companies to assess needs\" the proposal might present the phase. When does this segment start and will end at what time (expected), and how many universities and business clubs will be interested in assessing demand? How many % have you done at this stage? Although they explain the basic operations to be performed, they do not place us in a specific time and space, nor do we know whether the stages here will be performed in parallel or this action ended and then continue with other actions and who will be in charge of those activities? We don't have many details to fully understand the development of the project.\nNext is the budget, the proposal requires $ 17,500, for this challenge this is not a small number compared to the regulations. However, the explanation I think is quite superficial. \"\"10k developers - (2 February developers).-5k marketing/partnerships - (2 months).-2.5k mentoring program - (correspondingly spread based on participants ). It can be seen that there is no close connection between the roadmap and the budget presented. For example: for a $5,000 marketing/partnership for 2 months, we need to know what the marketing strategy of the proposal is, how many members will do it, and in what period it will take?\nAnd finally, about the team, this is perhaps the best-presented part of the possibility. We know that the person who proposed is the duo Keith Hedges & Erick Avalos, both software engineers and active members of Cardano, and the proponent also provided LinkedIn links to its 2 members so we can verify their qualifications. So my suggestion is to explain in more detail both the roadmap and the use of funds, the presentation of the team was very good.", "q1r": 3, "q2": "In my opinion, the ability to track the progress of this project is low. What we know as success is referred to as the \"Successful Online Job Fair\n-Annual or biennial live job fair\n\"Powerful Mentoring Program\"\n How can we properly audit a proposal that doesn't give a detailed roadmap or an inadequate budget explanation? The proposal also doesn't provide any KPIs. There are no small goals set, so I can't determine how we will audit this project. I think the proponent and his team need to prepare reports, at least monthly, with updates on the project, that these documents will be analyzed during meetings with the coordinators. IOG and also shared simply and directly with the community. Unfortunately, again we have practically no information.", "q2r": 2, "assessor": "z_assessor_2299", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 13373, "q0": "- Your group has proposed a job center platform, and will create a section for students, this is suitable for the challenge posed, but solving the challenge is still very general, we need to more specific.\n- The description of your and your team's experience has not been too detailed, it would be better to describe what major you studied, what school, how many years of experience in a certain field.\nStudents with the level of knowledge and agility of youth will quickly access Blockchain and Cardano, in addition to learning about knowledge, students participating in this program can also earn money. ", "q0r": 4, "q1": "- When you provide the proposal's plan, the progress and milestones are not clearly described, The stages are divided into weeks but not yet clear. You need to go into more detail, be more specific to each category and to subcategories.\n- It looks like You haven't read the budget for each project in this challenge carefully, it's not within budget for each challenge and over budget (less than $5000 per proposal in this challenge) ), you consider the cost to be reasonable.\n- Therefore, this part of the budget I probably won't get a high score, although I am very open in this part.", "q1r": 2, "q2": "The measurement and monitoring of project progress is also not specific and very general,\nThe online job fair is successful, but what is success?, we need a specific criterion and KPI to evaluate the success of the project.\n- Direct sales job fairs are held directly every year or every 2 years, very unclear but not fixed in cycle.\n- Strong mentoring program, how do you measure a strong mentoring program?\nI hope that you will draw a lot of experience for the future proposals in the funds.", "q2r": 3, "assessor": "z_assessor_3616", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 13396, "q0": "this proposal fully meets the expectations of the challenge.  Perfectly designed, providing all necessary and information.  It requires a lot of time for implementation, which means that maximum attention should be given to it.  The proposal would have a more effective impact on this challenge.  It is written in detail and gives answers to all possible questions. Students are met, with the possibility of realization in 2 ways (online and live). The goal is also very realistic, which corresponds to the criteria of a challenge. This challenge is based more on software programming.  and connecting to the Cardano platform.", "q0r": 5, "q1": "\n. The plan is also detailed, it does not leave out even the smallest detail. It answers all the questions regarding time, finances, contacts, measures and the like.  That is quite enough information for a project like this.  There are only a few facts missing about the prizes that the participants who do not go through further cooperation would receive. However, this does not represent a big problem, solely because of what was stated as a suggestion that they receive something in return. The financial plan is well written, the fact is that the figures are large.  in question (17.5k), which would represent a risk.  The risk would also be that the number of interested parties would be too small, so this project would fail. A more comprehensive motivation plan is missing.", "q1r": 4, "q2": "\ninformation as well as the plan are listed in detail.  Everything is in place, not even the smallest detail is missing.  Even detailed information is given about the contacts of the people who will work on this project. And each person is reliable on the basis of that data. Information is a key part of the project, with the help of them we learn everything that would help us during the realization. This proposal is composed of quite enough  amount of information for such a project.  Information about finances, time, risks and measures that describe the proposal itself is given. This is all of great help in meeting the challenge.", "q2r": 5, "assessor": "z_assessor_3617", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Solution\nOn our job center platform we will create a section dedicated to students. This will be a spot for young, determined people to find incredible opportunities within the Cardano ecosystem.", "experience": "Our team has software engineering experience from majors in college, to traditional corporations, and now Cardano development. We have the ability to leverage key partners to conduct an online job fair and/or a local one a strategic location."}