{"id": 417332, "author": "benzvibenjamin", "title": "ALOHA for Cardano", "url": "https://cardano.ideascale.com/a/dtd/417332-48088", "category": 26599, "amount": 4160, "description": "Many Business students have a lot of ideas but they lack tech knowledge how to develop them", "f6_no_assessments": 12, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 2074, "q0": "This proposal is aimed at Business students who have a lot of ideas but they lack the technical knowledge of how to develop them. This proposal was the idea of ​​​​a bachelor of business at the Grenoble School of Management, this is his second proposal in this challenge. However, after reading the 2 proposals, I found them to be completely the same, except for the target audience, in the \"International students for Cardano\" proposal https://cardano.ideascale.com/c/idea/ 414506 is targeted at 80 Bachelor of International Business (BIB) students and the proposal is currently targeted at 80 students belonging to a student association (ALOHA). The goal of this proposal is to teach the ALOHA association about Cardano and Catalyst and then help them come up with some business ideas that could be useful for Cardano and Catalyst, which will then be shared among the technicians. Cardano's mentors will choose whom they can propose. In terms of impact, I think it meets the goal of the challenge. However, in terms of risk, I think the biggest risk here is that the proponent is currently a student, in addition to studying, he also has to propose, and as he said he has several proposals in this fund and is working as an administrator for 2 proposals from the fund 8. How is it possible to balance learning and implementing many proposals when the leader of this project only has one alone? I have 3 options for this risk:\n- Gather several members with similar interests, then assign and divide the work for each member, which will give peace of mind to the community about the ability to carry out the project.\n-Or an alternative I think is more convincing is that he submits a proposal for this challenge, then based on the results achieved, can expand this idea through upcoming funds.\n- And finally, it is to put these proposals together, because after all, the target audience for the proposal is students of Grenoble Ecole de Management (so the route is the same, we just need to ask for a little extra cost to make)\nFor the above reasons, although the proposal is in line with the objective of the challenge, unfortunately, my opinion is neutral on this proposal.", "q0r": 3, "q1": "It is difficult to assess the feasibility of the project. While the proposal provides a complete roadmap, a good explanation of the budget as well as providing enough information about the person implementing the proposal. But as I showed in the impact section, the proponent had a similar idea in this challenge so the planning, budget, and team aspects are the same. This also raises questions for us, I think it would be more convincing if the proponent could explain why the two proposals' roadmaps are the same but require 2 parts of the budget? For example \"Create a presentation: $40 in 5 hours = $200\" I think this cost can be minimized because we only need to do it once. After all, the target audience is all students, so the content may be the same. Quote \"Monitoring student ideas: 6 hours per week for 6 weeks x $40 = $140. Help students write proposals if needed: estimate 10 hours per week x 4 weeks x $40. = $1600\" I can understand that each week you spend at least 16 hours monitoring student ideas and helping them write proposals. So if all your proposals are funded, this time pool will grow exponentially! (not to mention the time spent on other tasks of the proposal). This is very difficult to convince the community. I think the most important thing right now is that you need to recruit more members to be able to work on the project together. Because of the above factors, I, unfortunately, disagree with the feasibility of this proposal. (It should be clear that on the \"International students for Cardano\" proposal I gave the maximum score, and I think that if the author only made 1 proposal in this challenge, it would be possible.)", "q1r": 2, "q2": "And finally about audibility, if this proposal is funded I think it is quite easily audited by the indicators provided by the author. The proposal takes care of setting goals and KPIs that will serve as a document for us to analyze the progress of the proposal. It's entirely possible to track results based on the different goals they set. And about project monitoring: this part is very easy to follow, as the project will update the report on https://www.gimbalabs.com/gimbalgrid this is a place where the community can exchange ideas one-on-one easy way.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 15, "ne": 3, "ng": 5, "nfo": 7, "vca_o": 1, "reply": "The PA hasn't read the proposal well, it is clearly stated in the proposal that if I had some issues with the quantity of work that I had, I would use the help of students that I know and that are really interested in this area. Also, I agree that I have two really similar proposals on the same challenge, but there was a budget limit of $5000 for the proposals which means that I can not have a huge impact, this proposal is meant for Cardano to start implementing in a business school and to expand among students.\nMoreover, he gives his personal opinion saying that the budget is too high"}, {"id": 3152, "q0": "I assessed another or Benjis proposals, which I found to be extremely impactful and relevant to the challenge. What works really well is that he has identified a concrete student group that he has access to - a captive audience if you will - and he has a clear, concrete value proposition for them: Learn about Cardano and blockchain, brainstorm ideas with guided help, and work with established community leaders to apply for funding. Far from competing with each other, I think implementing this plan with multiple groups within a university community has the potential to magnify the impact, and there is the possibility of cross-pollenization between the groups, sharing knowledge, and magnifying the effect. It’s a bulls-eye for impact in this campaign.", "q0r": 5, "q1": "This student seems to have the necessary knowledge, and even more importantly, the necessary backup and network within the community to support his effort. The budget and timeline are detailed and reasonable. ", "q1r": 5, "q2": "There are both qualitative measures (like student feedback) as well as a handful of quantitative KPIs. Even if the proposer does not reach every single quantitative goal as named, the clear numbers give a benchmark for what he is reaching for, and we can evaluate whether expectations are met, or exceeded, or what areas may need closer attention in the future. ", "q2r": 5, "assessor": "z_assessor_2404", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 4781, "q0": "The team in this proposal represents a problem for students and that is the lack of tech knowledge that is needed to realize students' business ideas. The idea of the team is that through presentations about Cardano students will learn how to connect with Cardano and Catalyst and that would ultimately have a positive impact on both the students and the Cardano ecosystem. Key metrics and objectives were elaborated and presented so that this proposal is in align with outlined challenge settings and proposal is able to scale to address future challenges. ", "q0r": 5, "q1": "The team presented itself transparently through links via LinkedIn and proposal F8, from which we can see that the team has all the necessary knowledge and experience to perform this proposal. The budget is modest and we can clearly see how the funds will be distributed. A detailed executable plan has been created from which we can see who will do what and in what way. Clear time frames within the project will be realized are given. The proposer lists possible risks as well as solutions if risks arise. ", "q1r": 5, "q2": "A roadmap with milestones together with KPIs have been thoroughly elaborated and presented and the community can easily follow the development and success of this project. It is also nicely explained what success looks like for this project.", "q2r": 5, "assessor": "z_assessor_2616", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 5668, "q0": "The problem statement is well pointed out to highlight an existing problem that would lead to value addition to the cardano community when solved. The project provides a detailed description that suit the objective in the challenge setting. The adoption of the ALOHA community for this initiative open up access to a host of people with different background and expertise that could be beneficial to the catalyst community. “The plan is to teach the ALOHA association about cardano and catalyst, then to help them find some business ideas that could be useful for Cardano and catalyst, these ideas would then be shared to the engineers of cardano who will choose who they can do a proposal with”. The context of the objective unpinning this project provides the cardano ecosystem enormous value addition to the network. In the first place, I envisage that, by this project, the team creates the  potential of not only attracting young people, but also serves as a transition(on-boarding) into the cardano space. Per the project, there is an already established network with cardano industry experts to assist in connecting and shaping the ideas of students. The more relevant point here is the myriad of ideas that could be available to the catayst  community via this program. Ultimately, the end goal here is to expand within the different associations of “The Grenoble Ecole de Management association” (France).This is a long term sustainable strategy that could project the image of the cardano network and also help scale up the growth of cardano through the on-boarding of developers. However, the only missing element here is a marketing strategy to attract more students to the program. I see an amount located at the budget for student promotion but there is no marketing strategy that requires such amount. We know students are generally stimulated by incentivized learning platforms, therefore, as part of a marketing strategy, i suggest the team allocates a specific amount in ADA for participants. In addition, the use of social media channels is now the choicest medium for advertisement due to the volume in usage. Other than this few observation, i am generally impressed by the input of the team.  ", "q0r": 4, "q1": "The clarity and the well elaborated project description in addressing the identified problem, coupled with a concise and precise design of the roadmap shows how the project would be followed through from start to finish. This shows the commitment of the team in executing this project. The project intend to use 8 weeks for the project, with a breakdown of the set of activities under specific duration of each week(s). I prefer the team assign specific duration of week(s) for each activity under week 3-4 and week 5-8. This would provide clarity on the activities the team would be undertaking for each week. Apart from that, i suggest the proposer indicates clearly whether the activities would be sequential as listed or random. Aside that, ibelieve the budget is accurately representation or reflection of the market value per my understanding. To add to this, the overall allocation of 4.16k falls \nbelow the cap set for this challenge. The project is educational based and the amount requested for falls within the range charged per an educational hour.However, per my understanding of market values on the items listed, i think the estimated amount for some items for the project is a bit too high. For instance, citing  point 3 of the bullet, “Supervise the students ideas : estimated 10 hours per week x 4 weeks x $40 = $1600”, i find it fascinating that the amount allocated is the same as “help the students write proposals if needed”. In my opinion this amount should be lowered to reflect market value and the conditionality of the point in the bullet 3 (Help the students write proposals if needed). Clearly, the allocated money for item 3 would only be used if the conditional clause is fulfilled (it also possible it won't happen). Hence in my view, this amount  shouldn’t match the amount for helping students write proposals. Yoram Ben Zvi, a data base management expert and crypto enthusiasts as provided by his profile and confirmed by the external link provided. Per the profile, Yoram is an interned in cardano ecosystem, PA and is already working on a few catalyst project, this suggest an accumulated work experience in the catalyst space and in project execution. Hence this confirms his competence to execute this project. However, i think the workload and the ambitious nature of the project would be too much for one person to bear. Therefore i suggest Yoram consider getting more team members.\n", "q1r": 4, "q2": "My understanding of the the information provided at the auditability section of the project is that, it is sufficient to ensure the effective monitoring of the project. It is hard to identify any set back on the auditability of this project. Per the systematic approach of the proponent from project description to project’s roadmap and the impact the team intends to make with this project, i consider the KPIs as a best fit for measuring the progress and success of the project. The KPIs provided shows a clear alignment with the objective of the project and would help determine how well the team performs and grows. Additionally, the suggested KPIs provides the best quantitative metric for assessing this project. I am also impressed with the willingness of the team to make available their progress report to the community via town hall.However, i will also suggest that, the team also consider alternative medium (such telegram and discord) of making such report available to the catalyst community since not everyone may be present at town hall meetings. \n", "q2r": 5, "assessor": "z_assessor_2734", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8688, "q0": "The main purpose of this project is to educate the members of a university student association about Cardano to introduce them to a new avenue for funding their creative ideas, search for and filter useful business proposals for Cardano, support those proposals to participate in Catalyst in Fund11 under the advice of skilled engineers. The descriptions of the ALOHA association show the ability to quickly acquire new knowledge about blockchain and successfully operate thanks to the unique qualities of its members. I think choosing an association like ALOHA to start the project is a good starting point for expanding the project scale to other organizations/associations. I find this project in line with the Challenge's key metric of finding and supporting the ideas of students coming to Cardano so they can find funding, job opportunities, and connect with professional organizations. Assumptions about risk are compatible with the problems that educational projects will encounter, however, there is a risk that needs to be considered here is how to get students interested in participating in the project and build ideas, in addition to convincing them with the great opportunities Cardano offers, authors can consider building an incentive reward structure if their idea is chosen such as.", "q0r": 5, "q1": "The order of execution of tasks in the project development plan is completely consistent with the description proposed by the author. The proposal itself comes from a college student, there will be concerns that he/she does not have enough experience and expertise to carry out the project well, luckily he/she searched for support from people/organizations who have had previous experience working with Catalyst and Cardano. The proponent himself also has a certain understanding of Cardano and the active activities on Cardano. This help reinforces the viability and reliability of the project. Because of CA experience, the proponent clearly understands how to present the budget reasonably and convincingly by calculating the costs allocated to the project implementation activities according to the structure of working hours x respective remuneration. The total funding requested is also within the budget limits set by this Challenge.", "q1r": 5, "q2": "The metrics proposed by the proponent are meant to outline the short-term success of the project, and they are ideal metrics for measuring success. There have been descriptions of extending the project to other associations/organizations before, so in this section, I was hoping to see their long-term goals for this, would do a plus if they can clarify this idea/plan more clearly. According to the proponent, reports on the project will be released when it is finished, the important thing is that perhaps the proponent forgot to give us the tools/how/space to reach those reports, as well as those interested in the project, can track its progress.", "q2r": 3, "assessor": "z_assessor_2996", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 8868, "q0": "There are lot of business academic students who have better idea to make society a better place, but they are often limited technical knowledge that they have, Hence to overcome this barrier the proposer's team wants to build a community where they can review all the ideas presented by business team, and based on best ideas they can connect those idea proposers with Cardano engineers so that the idea presented can be made into real time project, this will boost all the business students to develop their own ideas to make the society a better place, hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The task mentioned is easy to achieve where it involves guiding Aloha students about the basics of cardano, and asking them to develop any idea, later reviewing the ideas and connecting this business idea students with catalyst Engineers, to achieve this task it the team needs a person who has basic knowledge over cardano and  some links to connect with catalyst Engineers, guiding task can be done by proposer's team where they have worked with fund 8 projects, so they can share their own experience in workshops, and to reach engineers the proposer wants to connect with Gimba labs who are a committee of authentic members and has been in contributing in block chain development from past, Hence  plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has presented clear goal to achieve where it wants to get best idea out of business students of Aloha committee and help the students make this projects into real one.\nThe proposal has clearly mentioned how he's team is going to connect with Gimba labs for catalyst Engineers.\nThe audit has even explained about experience of proposer's team from fund 8 projects and their aspiration to continue to work with project catalyst , the proposed solution has explained timeline in detailed manner in weekly phase manner, the audit even contains  budget breaking scheme in detailed manner , Hence with minimal risk involved ,the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 9650, "q0": "From the proposal. it appears the project will have a good impact on the Cardano ecosystem. This is because it seeks to expand the reach of Cardano to students in France. As the project progresses, it is expected students will be able to come up with great business ideas that are useful for Catalyst and to match them up with engineers to collaborate on these ideas. This fits into the challenge setup.The proposal was developed by a student and this makes it even more appropriate for the challenge.", "q0r": 5, "q1": "According to the proposal work plan, some of the skills required for a successful project will be presentation skill, the use of Excel and knowledge of Cardano and Catalyst. There is however no indication that the three people who will be responsible for the project implementation have any of the earlier mentioned skills. The budget of 4160 dollars is well written and reasonable although the component \"promotion to students\" could have been explained further for clarity. Depending on whether promotion will be virtual, as in the use of  social media ads, or be done by printing posters and souvenirs, the amount of 200 dollars could be reconsidered.", "q1r": 4, "q2": "All the KPIs presented are measurable. It is easy to refer to how many students participate in the project as a measure of success and this also translates into how many ideas will be given and funded. There is a clear road map for the project which will span a period of 8 weeks. At each time point within the period, a milestone is given to mark how far the project has come in development and what is next to be done. In my opinion this makes it easy to audit the project.", "q2r": 5, "assessor": "z_assessor_3078", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9825, "q0": "This is an excellent proposal that is in agreement with the objectives of this challenge. The plan is to teach a student organization called ALOHA (which is in a French business school called Grenoble Ecole de Management) about Cardano and Catalyst, help them develop business ideas that could have an impact on the catalyst community, and share these ideas with engineers in the community with the aim of finding interested engineers to connect and collaborate with these students to develop a relevant proposal which could be easily funded by the catalyst community. Most students seem to derail from developing new business ideas for fear of not finding interested investors, especially on platforms such as project catalyst, because small-scale ideas or projects are ignored in favor of bigger ones. The main aim of this challenge is to solve this problem, and this project provides the opportunity to do so since its aim aligns with that of the challenge.\nThe team plans to target at least 50 students, and have about 3 ideas funded by the end of the project. The team also is poised with the right experience, and from the proposal, there will be a lot of collaboration with more experienced community members.", "q0r": 4, "q1": "The proposer does well to state who the team members of this proposal are, a brief description is given, and their area of expertise is mentioned. Subsequently, links to their profiles are given for easy verification and accessibility. \nThe plan to educate students about Cardano, guide them through the generation of ideas, and find engineers interested in working on these ideas and linking them with these students to generate relevant proposals, which can easily be funded, is such an amazing project and one which is in agreement with the metrics of this challenge.\nThe proposer also does well to provide a plan, which is categorized into weeks elapsing for about eight (8) weeks, with the activity to be performed under each week stated. Though the roadmap is quite satisfactory, there is still room for the provision of specific dates for the completion of each activity, to enable easy track of progress. \nThe total budget stated for this project is 4160 USD, this is split into different segments on how it will be used. This makes it easy to understand and the details are quite adequate.\nThis project looks promising to succeed, if funded, considering all the factors.", "q1r": 4, "q2": "The milestones stated allow for easy checking of the progress of the project. The team also does well to provide important KPIs that will give us an idea of how successful the project was. The team also promises to give a report at the end of the project but fails to provide where the report will be posted or what page it will be made available. The proposer also provides relevant links that could be used to verify the identity of the group and the school. This help conveys confidence to the proposer and the project as a whole.\nDetails of the budget are considerate, and prices look feasible. For easy audibility, I recommend the team makes documentation a priority. This could help future projects also provide a better proposal if need be.", "q2r": 4, "assessor": "z_assessor_3106", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "The PA only gives positive feedback, there is no reason for him to put 4 stars to the three parts of the review"}, {"id": 11068, "q0": "Many Business students have lots of ideas but they lack the technology knowledge. Seizing that opportunity, you made a proposal: \"Instruct a student association on Cardano and Catalyst, collect business ideas and share them with Cardano engineers to try and establish synergies works\". Your proposal is great because it teaches Cardano to students and gives them the ability to innovate and connect with the engineering community to train students to become key actors in Blockchain in the future. The suggestion presented the possible risks that students didn't come up with the right ideas, you came up with a way to reduce the risk which is to teach them about Cardano and supervise them so they come up with ideas . In my opinion, the explanation is not reasonable for students to come up with ideas they need help with, suggest and advise them on how to build ideas accordingly.\n\n \n\n\"", "q0r": 5, "q1": "The challenge is how to connect students with engineers? You have a suitable solution that is to equip students with Cardano knowledge. In my opinion this is the first but most important step to help students get an initial understanding of Cardano and how to build a proposal. You must have a solution to choose appropriate materials, a reasonable method of transmitting knowledge, Implement teaching methods in the direction of increasing interaction between lecturers and students, associating knowledge transmission with Experiential practice activities to promote the student's positivity will increase the training efficiency. You have developed a detailed plan, clear work to do. The capital you require is not too large, the spending content is relatively specific. In my opinion, you need to recruit more personnel to be able to implement the proposal as planned.", "q1r": 5, "q2": "You have provided information to measure the progress of the project, I see a lot of work, while you have developed a two-month implementation plan, I think it is very difficult to do. The proposal is completely new, but if successful, it will contribute to the realization of the sustainable development goal which is to improve the quality of education, mainly at business schools. I hope you will add more complete suggestions. I support you.", "q2r": 4, "assessor": "z_assessor_3216", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 11542, "q0": "The proposed idea fits in well with the current situation because it encourages a student school organization ALOHA to learn about Cardano and Catalyst, generate business ideas among students, and provide a communication channel between students and engineers by sharing ideas on the Gimbalabs playground platform. By increasing student exposure to Cardano, Blockchain, and Catalyst, there is a great opportunity for the entire ecosystem to grow. Furthermore, ALOHA, as described in the proposal, connects students from diverse fields and cultures, providing even more exposure and thus opportunity for global scale. From a procedural standpoint, the plan is to conduct multiple presentations during BIB classes, including discussions, collecting feedback, and generate ideas, which will then be organized in an excel sheet and shared with the engineers. The main goal of the current is clearly the previous, and I find the Idea to be clear and well conceptualized.", "q0r": 5, "q1": "The project is likely to be realized because of the highly detailed timetable that matches up with the semester's organization. When recognizing the team and their experience, the proposed timetable is also realistic. The likelihood is increased by the members' previous experience delivering projects in the previous fund (Shlomo Cohen), as well as the team's extensive exposure in the student organization. Furthermore, the team members have linkedIn profiles and are active members of the Catalyst community. The section on team members, on the other hand, lacks details on the roles and responsibilities of the team members in the project. Regarding the budget, the total required fund is appropriate and well within the scope of the current challenge, with a detailed breakdown of how the various costs were calculated, and the costs are reasonable and highly relevant for the project to be carried out.", "q1r": 4, "q2": "The key performance indicators (KPIs) are clearly defined and reflect the quality and quantity of ideas and people involved in the project. According to the proposal, the deliverables are intended to be presented and disseminated on the Gimbalands playgrounds, indicating a high level of transparency in monitoring the community's progress. The delivery dates are provided only with rough estimate - with the main delivery, including the spreadsheet of ideas for the engineers, is scheduled for the end of the third/4th week, and so on. Furthermore, the proposal anticipates several written and funded proposals in the future, with a realistic estimate based on semester organization. The risks associated with completing the project are clearly described, along with a rationale for how they will be addressed - for example, students will be more motivated to write proposals if it is explained that they will be incentivized. ", "q2r": 5, "assessor": "z_assessor_3256", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 12125, "q0": "The proposer method is very innovative, involving ALOHA, a student association to learn about Cardano in theory and practice with Cardano Community. This proposal aims to teach 80 french students about Cardano and Catalyst, collect project ideas, and share them with Cardano engineers through Gimbalabs playground and establish collaborations. This proposal provides high-quality information about the association and the school's background. The proposer's young and very passionate about Cardano and its ecosystem. The proposal includes the plan to expand within the different associations and make The Grenoble Ecole de Management an example for student associations onboarded to Cardano. This could be a positive impact on the Cardano ecosystem, where a lot of potential students could be the future generation of Cardano engineers. The obstacles in this project are described in great detail along with solutions to prevent them. ", "q0r": 5, "q1": "The proposal gives detailed information about team members. Several of them are Cardano community members and funded proposers in F8. The proposal gives a clear timetable and budget plan. Details of the funding requirements are detailed enough for, creating a series of events, making a presentation, teaching, and mentoring for 8 weeks. The milestones for this project have been explained in detail, however, the duration of the targeted achievement of each milestone has not been explained in detail. Suggestion: the proposer needs to describe the promotion method that will be used in these projects.", "q1r": 4, "q2": "The roadmap has clear targets and included plans for the future if the project is approved. The proposer will provide the report to Cardano, including a clear presentation and session with Gimbalabs Playground at the end of the project. The proposer's goals have been explained in detail based on self-experience as a base for expanding business school education using Blockchain. Honestly, this is a potential project to develop student knowledge about Cardano and Catalyst. With the support of Cardano engineering. this project will give a positive impact on the growing France Cardano community.", "q2r": 5, "assessor": "z_assessor_3362", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 14805, "q0": "The aim of the project is to educate students that belong to an association (ALOHA) about Cardano, as well as Catalyst and help to bring their ideas to Cardano engineers. I think the solution is closely aligned with the challenge. It’s good to see that the team has added their students’ profiles which could help sponsors better understand the students’ ability and what they could bring to Cardano ecosystem. Background information about the association has been shown and the fact that it has existed for 67 years indicates that this is a reliable association. The team has also listed some Cardano community members whose proposals have got funded to improve quality of students’ projects. There are some parts of the solution that I would like to see more details about. For example, knowledge about Cardano ecosystem is very board, and not all students have had a good grasp of it, but some have already had basic understanding. I would like to know how the team intends to approach these different student groups, and through where they will deliver their lessons. In general, I think the team has a well aligned idea, especially when they have very detailed information and understanding of their target audience, however, there could have been more details about the solution", "q0r": 4, "q1": "The team has presented a clear roadmap (based on weeks) with necessary tasks to be completed. The budget breakdown is relatively clear with information about the amount of money for each activity. Although there are only 2 members mentioned, it can be seen that they both have relevant experience and are capable of carrying out the project.", "q1r": 4, "q2": "For this section, I think the team has given quite good indicators to measure the project’s progress. However, I think it would be better if the proposers could add specific timeline to their deliverables, this could make it easier for community members to keep track of the project’s progress.", "q2r": 3, "assessor": "z_assessor_4102", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Teach a student association about Cardano and Catalyst, collect business ideas and share them with Cardano engineers to try and establish collaborations ", "experience": "BA business student in Grenoble school of management\nPart of the Cardano community\nWorking with funded proposers : Shlomo Cohen\nCARICATOR ADA \nUnited Caricature\nCollaborating with Razali Samusudin and Cole Bartlett from the Catalyst school and\nwww.sustainableADA.com"}