{"id": 418120, "author": "jalvarez", "title": "Thesis on Catalyst Decentralized VC", "url": "https://cardano.ideascale.com/a/dtd/418120-48088", "category": 26599, "amount": 3000, "description": "Student entrepreneurs in universities, specially in developing countries, when evaluating possibilities for funding have a limited scope to apply for, and are unaware of new alternatives.", "f6_no_assessments": 7, "f6_rating": 4.0476190476190474, "videos": [], "media": [], "f6_assessments": [{"id": 2078, "q0": "The problem is that student entrepreneurs in universities, especially in developing countries, when assessing funding possibilities have limited scope to apply and are unaware of the solutions. new replacement. And the solution that the author offers is to write a Master thesis (MSc Finance) about Catalyst as a decentralized VC solution (I guess the VC here in Venture Capital) that is ideally suited for entrepreneurs in developing countries. development, which can be used to introduce background in an academic setting. The focus of this thesis is on the academic literature regarding the decentralized VC properties of Catalyst. At first glance, this proposal and issue statement may seem a bit lackluster in its information. In terms of impact, I think a proposal like this is up to the challenge but has not as great an impact as it should be. The project says it will be done by Jose Alvarez alone he is a Master in Finance at Torcuato Di Tella University (based in Argentina, South America) but does not provide any information to verify it, nor do I. not know his connection to Cardano, his understanding of Catalyst, nor how his thesis can be applied to entrepreneurs??? The necessary information is either missing or not enough. So when the proposal is to do a thesis by him, I think it will be very difficult to convince the community to believe in his ability. Unfortunately, the proponent may not be very knowledgeable about how to submit a proposal and the details it needs to include, I recommend that you review your idea in its entirety and provide all the details cited here.", "q0r": 3, "q1": "The author provides some possible information which I think is ok but still can explain a few more details. The first is about the roadmap, the author gives a step-by-step roadmap associated with the defined milestones (months) so that we can visualize the actions to be taken in the coming days. How long does it take to get the final results? In this section, I only wonder about a small detail that is “Community Participation - February to May 2023” I have not yet figured out what this activity has, what role it plays in this proposal, and How many such meetings will there be? .... Next on the budget, the proponent asked for an amount of $3000 for this project, which I think is a perfect fit. The budget is also broken down into sections by the project's roadmap, we know your hourly cost (quite low compared to the common ground), translation costs... In general, the budget in my opinion in detail. And finally, about the team, this part is not so good. We know the proposed author will be the one to do this project, but we don't have enough information about him. From relevant experience we have learned that he is a Master in Finance at Torcuato Di Tella University (Argentina, South America), also we do not know his relationship and we can find where is it. gain a more direct understanding of the work he has developed in the past. Besides that, we don't know how this person is related to the Cardano ecosystem if he already has some blockchain experience and with that, we don't know if he is qualified or not for the successful implementation of this project. Although he says there is community involvement behind the scenes with local entrepreneur networks and business/technical schools... I think it would be more convincing if he formed a group properly presented with their name, role in the project, professional resumes, and affiliation profiles....this will reinforce the community's confidence that the project is powerful enough to be successfully implemented 100% work.", "q1r": 4, "q2": "Regarding the ability to measure the progress of the project I think this project can be easily tracked because of the feasibility of building a work schedule, we were able to orient ourselves well on what to expect will happen, when and how, can track the development process. As this is a written product, the progress of the project will be determined by the milestones previously presented (Thesis Memorandum, First and Success Chapter, Preliminary and Final Draft), and can also be measured in page numbers. The author also states that if this proposal is funded, the results will be reported to key members of the Catalyst community, who can inform and inform the thesis throughout its development... this increases project transparency. In the end, the success of the project is explained very simply, as it claims from the beginning a completed Master thesis (MSc Finance) on Catalyst as a decentralized VC solution. As for the audit, I think it's complete and perfect so I'll give it the maximum score.", "q2r": 5, "assessor": "z_assessor_2299", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for your support, and I hope to be able to continue engaging with you and the rest of the community if the proposal is funded!"}, {"id": 3500, "q0": "There is no doubt that a master's thesis whose theme focuses on Cardano is a real vote of confidence in the role we are playing as an alternative solution to the most pressing social, economic and environmental problems (plus all those that do not fall into these categories).  The proposal reveals a proposer in tune with that role.  A proposer who also wants to do his part.  However, a fair evaluation of the proposal requires a comparison with the Challenge in which it is enrolled. The fundamental motivation behind the \"Challenge & Scouted for Students\" Challenge, approved by the Catalyst community last fund, is to provide college and university students with a space completely separate from the regular Catalyst environment in which they can bring their projects to Project Catalyst and secure base funding, nothing financially ambitious. Clumsy projects, with flaws or weaknesses if any, but with a true innovative and creative student spirit, insolent and daring, that will lead their authors to find in our community a place to learn and get involved, a playground endowed not only with money, but more importantly, with the possibility to get hands on with the best technology in the industry while having access to the knowledge, experience and sense of collaboration of Catalyst members. A new concept for Catalyst no doubt, but an efficient one: in the student community of the planet lies that needle in the haystack that ends up changing the game we play so tightly with other blockchains and the legacy world, and it is our obligation to build the best of the magnets to find it. That's just what this Challenge is trying to do: build a suitable habitat for students, designed primarily by the students themselves. \n\nBecause of my affinity with this Challenge (formal experience in education at school, university, company level) and my experience in Project Catalyst (actively participating in 90% of the community positions that exist: CA, VCA, Challenge Team member, funded proposer, involvement in multiple projects in Catalyst) I have been following it closely since it was approved at F8, because it never ceases to amaze me how often the scoreboard seeks to augment itself with topics of undeniable importance (Developer Ecosystem, Cross-Chain Collaboration, The Great Migration (From Ethereum)) to the point of discarding areas that in the real world have proven to be an inexhaustible source of ideas, creativity and results, such as those related to students. \n\nAs an educator and experienced Project Catalyst member, I understand the intention behind the proposal and consider it completely valid. However, it is clear that it does not correspond to the purpose that the Community decided to support through this Challenge: neither the type of student who created the proposal, nor the objectives of the proposal are in line with the parameters of the Challenge.  I quote (excerpted from the Challenge information): \"By creating a category of students and increasing exposure for their ideas, they can expect easier funding and to be scouted by engineers\" (section What does success look like?). \"Most student entrepreneurs suffer from a shortage of resources, especially when it comes to funding and hiring engineers\" (Why is this important? section). \"However, the number of proposals to Catalysts is increasing rapidly, and the community does not readily perceive small-scale proposals from students. .... Therefore, to make it easier for the community to recognize new ideas from students, we will establish a new category exclusively for students\" (Challenge brief section). \n\nTaking into account the above reasoning, I must remove three stars from the final rating.     \n", "q0r": 2, "q1": "Although certainly general, the implementation plan and the budget correspond to the reality of the development of a thesis work.  The development of the thesis is a process characterized by its linearity.  The dizzying twists and turns involved in such academic work are rare. At the same time, it is an assurance of compliance that the proposal is directly linked to a key requirement in the proposer's professional life. The $10/hr rate assigned by the proposer to his work is indicative of someone who is not looking for anything beyond basic support to meet his objectives. I must reduce 1 star from the final rating because certainly more detail in the information provided at the level of implementation plan and budget would be desirable: it is a requirement in the presentation of any project to increase the level of detail of the procedures to be executed, this allows to know the dimensions of the project itself. ", "q1r": 4, "q2": "As someone who has made a career in formal education (school, university, company), I must say that the measurement tools provided by the proposal are not adequate.  An academic type project cannot be assigned the skin of a technical type project.  Peer review of an academic result is imperative.  Consequently, the fulfillment of the milestones described in the Feasability section are not a true indicator of the performance of the academic work: it is how the fruit of it is judged by the academic and technical community apt to judge it.  Therefore, I believe that better parameters for measuring the performance of the proposal should be developed, based on a deeper reflection of what it means to ask for support to develop an academic work as described in the proposal.  For the moment, I find that the proposal needs to strengthen its auditability conditions, which is why I must deduct three stars from the final rating.", "q2r": 2, "assessor": "z_assessor_2462", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "While applauding the PA´s dedication to both formal education and Catalyst, it would appear he has a narrow interpretation of the Challenge setting as it was formulated. The excerpts presented under impact are true, however they only tell the technical side. I quote the first line of the Challenge: \"Student entrepreneurs have exciting business ideas and motivations to start a business, but they lack the resources to implement them.\" An academic thesis laying out the case for student entrepreneurs to engage with Catalyst, in environments such as developing countries where funding is scarce, will help engage and onboard these students not only for this specific Challenge, but rather for the long run, increasing the value of Cardano as a whole by receiving their valuable projects and having them executed on-chain. Regarding auditability, the PA seems to have forgotten (or not read) that within the proposal, it is clearly stated that at the final stage, having first a rough then a final draft of the thesis, it is provided for \"Community Engagement (both academic/university with fellow students and at developing country TownHalls)\". This academic engagement amounts to what the PA has indicated as academic peer review, which of course is of vital importance to the adequate development of any academic product once in its latter stage of execution. Additionally, it would appear the PA is unfamiliar with the Reporting scheme that must be complied with as a funded proposer, which would surely alleviate his worries. I appeal to the vPAs reviewing this flag to filter out this assessment."}, {"id": 4918, "q0": "As a challenge centered in promoting student engagement and academic awareness of Cardano, this proposal addresses it twofold: firstly, as a proposal made by a student, it already demonstrates engagement from a university environment, and from a developing country no less; secondly, by proposing to write an academic thesis on Catalyst as an ideal VC funding mechanism for developing country student entrepreneurs, it promises to deliver a product that can be marketed and leveraged by the Cardano community with a seal of academic rigour in emerging market student entrepreneur networks.", "q0r": 5, "q1": "The proposer indicates that regardless of funding, he will of course need to write the thesis to graduate from the Masters program; therefore, it is highly likely that he will implement his proposal successfully, due to the necessary requirement of completing a thesis in order to graduate from an MSc university course. He also describes a concrete timeline, according to his university´s indications, with a detailed budget breakdown of the different stages to be dealt with, offering as well to handle translation into whichever language the community deems best suited for further marketability of the product.", "q1r": 5, "q2": "The proposer correctly states that, as a written product, the project´s progress will be determined by concrete milestones required by his university in the thesis submission procedure (Thesis Memorandum, First and succesive Chapters, Rough Draft and Final Draft), and correctly states that said progress can also be measured in terms of pages. Therefore, there should be no issue in fulfilling the reporting standards of the Cardano community once funding is approved. The fact that a third party, namely the university, has an independent schedule which must be fulfilled in order to present the thesis and graduate, is another element that adds to the certainty of auditability and verifiability of the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_2636", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for your support, and I hope to be able to continue engaging with you and the rest of the community if the proposal is funded!"}, {"id": 5828, "q0": "I think academic papers educate a lot and one of the ways people look for the authenticity of programs is through academic papers. I believe this proposed idea of writing a paper on the Cardano blockchain. \nIf well-circulated among students, it will lead to massive education on the Cardano blockchain. Students will begin to have raised interest in blockchain technology. Student entrepreneurs may want to bring onboard innovative ideas to participate in project catalyst.\nThere may also be onboard of students with an interest in participation in project catalysts as PAs. \nI think this proposal is great.\nI wish this proposal will be considered because sometimes students want to do their best and come out with a thesis that will impact the academic community and society as a whole but for lack of funding, this becomes difficult. Funding this proposal will give Jose the impetus to do impressive work that will benefit society. ", "q0r": 4, "q1": "The plan presented in this proposal is straightforward. It is detailed with milestones and timelines attached. I personally think the timeline for delivery is good because to do a quality work in a thesis you need time to a lot of research and contact resource personnel who will give valuable knowledge. \nThe budget is well-written and simple. \nThe proposer indicates he is a master's student in Finance who is currently working on his thesis. I think as a student he is capable of delivering but I don't know how much he knows about the Cardano blockchain. That information is not given. \nThe proposer indicated he will not come back for further funding after completion. He is not on any other team or working on any other project so he has enough time to concentrate on delivering on this proposal. \nPutting all this information together I think of this proposal is funded it will be implemented successfully. ", "q1r": 4, "q2": "The milestones indicated with the timelines are clear enough for auditing. What success looks like has been started by the proposer as the successful completion of the thesis. The budget is clear and can be audited as well. \nI think this proposal is clear auditable", "q2r": 5, "assessor": "z_assessor_2754", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "Thank you very much for your support, and I hope to be able to continue engaging with you and the rest of the community if the proposal is funded!"}, {"id": 7722, "q0": "The proposal is focusing on preparing a Masters thesis (MSc Finance) on Catalyst as a decentralized VC suitable for entrepreneurs in impoverished countries, which can be used to promote the platform in academic settings. \nDespite the fact that academic papers on both Cardano and Catalyst are frequently published in the technical realms, there is a dearth of academic work on Catalyst's decentralized VC features, particularly when it comes to emphasizing its significance for and appeal to entrepreneurs in developing economies. This component will serve as the thesis' main point of emphasis.", "q0r": 4, "q1": "I think the proposer has the skills and knowledge necessary to complete the project based on the information supplied and the acknowledged relevant experience. \nBecause I can see that the $3000 budget has been carefully planned out and divided into a variety of areas, I can say with confidence that it will be enough to accomplish the stated objectives. Additionally, the plan was well-organized and simple to understand.\n", "q1r": 5, "q2": "The proposal's very explicit definition of success provides us with a wealth of data for tracking outstanding auditability. They also go into great depth about the phases so that we know what will happen when and to make sure that everything is going according to plan. As a result, we may now carry on with the monitoring process.", "q2r": 4, "assessor": "z_assessor_2916", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "Thank you very much for your support, and I hope to be able to continue engaging with you and the rest of the community if the proposal is funded!"}, {"id": 8441, "q0": "Another interesting proposition. The idea of ​​​​writing a Master's thesis on Catalyst is aimed at entrepreneurs in developing countries to create a foundation for use in an academic environment. The solution describes the proposal as a decentralized VC solution suitable for economic entrepreneurs. Although the idea is elaborated towards both Cardano and Catalyst but there is a lack of scholarly literature regarding the decentralized VC property, when the project took shape and focus and its key aspect and calls for entrepreneurship development, this issue is the main focus of the thesis. To overcome that, you come up with a fairly reasonable solution, which is to introduce the foundation in a suitable academic and business environment, challenge to attract student entrepreneurs and engineers to refer when only limited. in the university environment, if the results are good, it will aim to create a network of local entrepreneurs and go further in the future to developing countries. Basically the risk you face is not really a big obstacle for this project. It is understood as a necessary condition for graduating from the Master of Finance program.", "q0r": 4, "q1": "is a thesis idea for a Master of Finance is also a condition for graduation, so the idea is built in a clear process of about seven months to complete them, it is not too long, the budget to pay for the activities to complete the project are also reasonable with the amount of 3000usd. The project is based on yourself as a Master in Finance candidate at Torcuato Di Tella, based in Argentina, South America, you are the one who wrote up and conceived this idea shows that you are very serious based on it. into the basic outline of the proposal, you're trying to finish as if you were completing your graduate thesis.", "q1r": 4, "q2": "As for the chosen way to track progress and project development, we find that it is very general, without providing a clearer means of the process being audited, you give us measurement data by The progress you have built before, but such a process we want to have clearer goals to track more conveniently. Visualizing success in this project provides a new environment as a tool to bring creative and motivated students into Catalyst to write up good ideas, attract sponsors, and incorporate into the community. Cardano coins in a permanent way. It's also interesting to create a new platform for future creative people.", "q2r": 4, "assessor": "z_assessor_2984", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1, "reply": "Thank you very much for your support, and I hope to be able to continue engaging with you and the rest of the community if the proposal is funded!"}, {"id": 11544, "q0": "The proposal fits the challenge category perfectly because it encouraged the student to conduct and publish (thesis) a small study on how Catalyst VC alternative funding can be used to raise awareness of these opportunities in academic and business circles. As a consequence, the solution is an excellent way to raise awareness about the Cardano blockchain and Catalyst among young students, who are the most frequent adopters of novel technologies, providing an excellent potential to expand the ecosystem.By spreading awareness of these technologies in the academic world, the likelihood of conducting peer-reviewed research increases, which really is a key pillar of Cardano. The author also presumes that the outcome can be transferred into the local entrepreneurship network and thus have a larger impact on a larger scale. My recommendation for increased impact would be to try to publish the work in a peer-reviewed journal afterward on in close cooperation with knowledgeable academics, and to further spread the idea on researchgate and similar platforms to engage the academic spheres in the discussion.", "q0r": 5, "q1": "For several reasons, I believe the project will be a success. First and foremost, the timeline is realistic, with 4-5 months planned for thesis writing and 3 months planned for community engagement to refine the work. Second, the execution of these should only be dependent on the student and his cooperation with his supervisor - thus I suspect it should be feasible without a doubt, but what I miss is maybe describing previous writing experience as well as the experience to conduct research, as well as some link or profile of the student - university profile/facebook or linkedIn.Finally, the budget appears to be reasonable in relation to the current challenge, which should encourage students and the community. Perhaps the budget should include an additional $2000 USD if they decide to refine the work and publish it in an open-access peer-reviewed academic journal. In my opinion it would add more value to the work.", "q1r": 4, "q2": "The KPIs are not clearly defined, but the milestones are reasonable and largely dependent on the student's work. The proposer suggested the number of pages of distinct parts of the work as indicators of progress, which I don't think is a good measure of progress - it is well known that the discussion and introduction are the most difficult parts of the work and require significantly more time to proceed, whereas parts like method and so on are really easy to write and can be spread across more pages - thus number of pages is really a non-realiable indicator in my opinion.However, as suggested by the proposer, conducting interviews with the catalyst community may be a more feasible way to trace and refine the work. The delivery dates are set, and they most likely correspond to the university's internal deadline for completing the thesis. ", "q2r": 3, "assessor": "z_assessor_3256", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you very much for your support, and I hope to be able to continue engaging with you and the rest of the community if the proposal is funded!"}], "solution": "Write a Masters thesis (MSc Finance) on Catalyst as a decentralized VC solution ideally suited for developing country entrepreneurs, which can be used to divulge the platform in academic environments.", "experience": "MSc Finance candidate at Universidad Torcuato Di Tella, based in Argentina, South America, with vast IR/PR experience. Local entrepreneur networks and business/engineering schools have shown a complete lack of knowledge of Catalyst as a funding alternative when approached."}