{"id": 418338, "author": "otaviolima", "title": "Cardano Brazil Meetup Hub Students", "url": "https://cardano.ideascale.com/a/dtd/418338-48088", "category": 26599, "amount": 19800, "description": "The Cardano community in Brazil is growing rapidly and we need to bring hybrid events to support and interact with our crypto community and college students and universities of Brazil.", "f6_no_assessments": 19, "f6_rating": 3.263157894736842, "videos": [], "media": [], "f6_assessments": [{"id": 1687, "q0": "Unfortunately, the proposal has some serious issues regarding impact, in terms of alignment with the challenge objectives. The idea is great, it is about holding a series of hybrid events, where face-to-face meetings would take place in the city of São Paulo, and topics related to the Cardano ecosystem would be addressed, with the aim of bringing new people to the community and increasing engagement in our projects. However, it is not said at any time how the students would be the focus of the events, how the contents covered would be specific so that this audience would benefit and how such contents would be designed to meet their needs. It would be necessary for the proponent to seek to establish a bridge between students/universities and events, for example: how to enter the job market that involves blockchain, how to get internships in companies that work with this technology, how to insert themselves in the teams in the teams of the projects currently developed in the community, or even how to participate in Catalyst (either as proponents or CAs). In addition, it would be necessary for more information to be passed on in relation to the meetings themselves. It would be 1 per month: what subjects are covered in each? Or would they be the same subjects addressed, intended for different audiences? It would be necessary for the proponent to explain in detail which topics would be presented and in what way. Probably, more initial topics such as “what is blockchain, what are cryptocurrencies, what is Cardano” would be addressed either in the first meetings or in the first minutes of all meetings; so that more in-depth subjects could then be worked on, such as blockchain use cases, Cardano’s programming languages, how each professional (or student in each area) could be part of our projects and so on. In general, the idea is suggested in an abstract way. The proponent states that special guests and speakers will be called to bring credibility to the events: it would be important to know which ones; it is said that current affairs that revolve around our currency would be discussed, Ada: which subjects? It is also said that special attractions would be included in the events, to attract public attention and increase the level of engagement: what kind of attractions? Maybe musical attractions, famous people in Brazil? How could we captivate the participation of an audience from a country that, despite advancing in this direction, is still not a place where blockchain is widely known and established? That said, I believe that the core of the proposal is good, but it would be necessary for more detail to be given about the events and the relationship of the meetings with the student public to be clearer, so that the proposal could be more clearly aligned with the challenge, achieving the specific objectives set out here.", "q0r": 3, "q1": "The topic gives us basic information on how the project will be put into practice, but several things need improvement. The roadmap does not give us an understanding of what the project development process would look like, which steps and tasks would have to be developed for the desired results to be achieved. In total 12 months, the description of activities is the same for each (“Launch, dissemination and registration for the meeting; Conducting the hybrid meeting”). However, a lot of information should have been provided, so that we had a proper understanding of the project development. First, it would be necessary to know what each of the professionals mentioned in the team's presentation would be doing, what would be their roles in the project. It would be necessary to understand 1) where the face-to-face meetings would be held, how they would be defined. We know they would be in São Paulo, but this is the biggest city in Brazil. So where, in São Paulo, would they be made? 2) what subjects were covered in each meeting, and how they would be explained, so that the presentations were as accessible as possible 3) who would be the presenters of the meetings, if they would be the members of this team, or people from outside, invited especially for that. And if they are outsiders, how would they be selected? 4) how would the event publicity process be carried out, so that more people would get involved. It is said that they have a site with 1 million hits on average; but I believe that users who access it already know Cardano. How to encourage people who don't even know what blockchain is to participate? 5) it would be important to set up a script for each event, for example: first 2 hours - exposition of contents / half an hour of coffee break / plus 1 hour of lecture / half an hour for questions and answers, at the end. And, above all, it would be necessary to understand if the team would make any specific contact with the students, how this contact would be made, which students would be approached (only from the technology area, or from several areas of knowledge)... a good view of the pre-production of events, how the events themselves would happen and also how post-event feedbacks would be collected. Moving on to the next analysis topic, the total amount of $19,800 is broken down into a few parts, but those would need further explanation as well. Many of these expenses are unclear. Who would be the teacher? And what is the difference between him the presenter of blockchain and cryptocurrency contents? Which journalist would that be, would he have the function of covering the event and publicizing it? How can it be defined that the physical space would cost 100 dollars of monthly rent, if we don't know what spaces these would be? Would social media expenses be used to carry out paid advertising? How would the organizers, the marketing assistant, the video editor work? How many hours a week would they dedicate to the project, and how much would their work hours be priced? Finally, speaking of the project team, a certain trust is transmitted, although from what I understand only Otávio and Maria do Carmo have a direct relationship with Cardano. Some information about each is provided, but I would like a more detailed curriculum in relation to their areas of expertise and the projects they have already developed to be included as well (for example, we are not sure of Maria do Carmo's area of ​​expertise). With this, several points of feasibility need improvement for the topic to become suitable.", "q1r": 3, "q2": "Once again, the information provided is very superficial, and is basically numerical, which does not allow the project to be properly monitored. Regarding the progress, it would be important that the script was better worked, so that we had more tangible content for audits. The suggested KPIs are all numerical: number of event registrants; community participants (in this case, the subscribers who would be community participants or subscribers who became community participants?); number of users in groups (which groups? from telegram and discord?); and number of actions taken (what actions?). In addition to leaving some doubts open, such surveys do not cover the pre-production part of the events. How can we verify that all the tasks necessary for the events to come true were done properly? How can we monitor the work of each team member? In my opinion, the ideal would be for the proponent to provide us with a report at the end of each month, raising general questions about the project, from activities in the pre-production of events, as well as about the day of the meeting itself (how was it, if the number expected of people appeared, how was the engagement of this audience…). Speaking of final results, the metrics are similar to those suggested in the auditability of progress, and do not allow us to form a solid understanding of what the consequences of the project would have been for the Cardano ecosystem and also for the Brazilians involved. It would be necessary that 1) we know what the participants of the events would be doing after the meetings; if they actually absorbed the knowledge that was passed on, and how they would be getting involved with our community today - if they would be participating in Catalyst or in Cardano projects 2) If the students, specifically, were benefited from the project, and if so, how , what opportunities arose from here 3) what verifiable data would have emerged to confirm that the project was beneficial for Cardano, contributing to the greater popularization of blockchain in Brazil. All this data should be studied and passed on directly to our community, through, for example, the participation of the proponent in a townhall or a video summarizing the consequences of the project, which could be made available on youtube, for example. The information given only provides us with some necessary knowledge, but not all the understanding that would be necessary for us to carry out an adequate auditability.", "q2r": 3, "assessor": "z_assessor_2259", "no_vca": 15, "ne": 11, "ng": 3, "nfo": 1, "vca_o": 2}, {"id": 690, "q0": "Unfortunately, the proposal is not adapted to the Challenge due to the budget. Although the idea is correctly developed in its objective and way of proceeding, it exceeds its limit by almost 4 times, which is clarified twice in the description of the Challenge that it is very important to take into account the limit of USD 5,000. I suggest that To give the project a chance to complete, shorten the duration to a 3-month program. If it is successful, a further budget could be requested from another Fund based on this experience.", "q0r": 1, "q1": "Although the team is presented and has experience in Catalyst (with references from LinkedIn, projects and collaborations), the presented plan that has no details, no certain dates, or specific tasks catches my attention. I don't consider it a plan. Additionally, it should be reviewed because in 12 months it is not feasible due to the budget presented that exceeds the challenge. I recommend strongly revising the plan if it is possible to cut the activity to a shorter period.", "q1r": 1, "q2": "This point is correct, since they have the experience to be able to ensure the KPIs behind the active community that they have today. In any case, if they want to align the plan with the Challenge, they should check again if there are other short-term metrics that can help measure more accurately.", "q2r": 4, "assessor": "z_assessor_2118", "no_vca": 12, "ne": 1, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 11386, "q0": "Cardano community in Brazil is growing rapidly and need to bring hybrid events to support and interact with crypto community and college students and universities of Brazil. Cardano community is an independent organization but gain support of bitcoin bay. By doing 12 face 2 face and online hybrid meetings with participation of speakers or guests to present cardano or ecosystem to students and guests.This will help college students and universities of Brazil to interact with crypto community. This proposal effectively addresses the challenge and I agree with the proposal", "q0r": 5, "q1": "The project has detailed plan includes disclosure, launch and registration for meetups and conducting hybrid meetups every month till 11 months. The budget is outlined clearly and broken down into idenfiable items. It is reasonable to achieve set goals . It offers a realistic timetable to complete the work and describes the resources necessary to implement proposal. The people working with the project includes founder and CEO at cardano feed and have good experience with cardano. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by monthly news release on Cardano feed and panel disseminated within cardano feed with evolution of project according to catalyst KPIs. Also by knowing the number of registrants in the event, participants in community, universities visited , schools visited and shares preformed we can track it. Several schools and universities visited and got to know about cardano and increased user participants and speaker guests we can know the success. This information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}, {"id": 11242, "q0": "This proposal does tackle the challenge as it focuses on have face to face and online hybrid meetings in São Paulo for students and guests. The speaker and guests will be all experienced individuals in Cardano Ecosystem. Through their meetings, they can bring a lot of knowledge, tutorials, and news about ADA projects to the audiences. They also plan to speak to the audience through a non-technical way, which is always great as a lot of termanologies in blockchain technology are rather difficult to know and comprehend for newcomers. They would also have Telegram and WhatsApp groups to keep in closer contact with users and bring information to users in a faster and more assertive way. All those events will be broadcast online and will be posted on Youtube for suture access. Most importantly the events will ve free so a huge barrier is eliminated. ", "q0r": 5, "q1": "The team is composed of many capable individuals ranging from developers, UX/UI, Marketing, SEO, Business, and the team also developed the largest media coverage platform Cardanofeed.com. There are more than 1 million monthly visits and it is also the largest \"Cardano Ecosystem\" project directory, where there are more than 800 projects. Otávio Lima is the Founder & CEO at Cardano Feed. He has founded some internet startups, some are successful. He also processes practical and theoretical knowledge in B2B and B2C e-commerce, marketplace, digital marketing, UX/user experience, navigation tests, interface, information architecture, big data, data-driven, data science, web metrics, BI (Business Intelligence), open innovation, crowdsourcing, ERP integrations, digital signage/digital signage and out-of-home digital media. Next there is Gino Matos, who is a crypto-journalist and content editor. He specializes in writing and has experience as editor-in-chief and develops journalistic articles, press releases, ebooks, article translations, and subtitles for videos. Finally, there is Lucas Fernandes, who is the marketing Assistant. FOunder of an Education startup in 2021. Overall the team is extremely well building and capable of handling said proposal. As for their plan, it is very detailed and set to be completed in the course of a year. Each month they plan to launch, disclosed, and register for the meetup and followed by the hybrid meetup. The consistency of the plan is great as users will get used to it and it will also be easy for the team to get used to the rundown. Overall it is likely that the plan will be implemented successfully. ", "q1r": 5, "q2": "The process to audit provided is excellent. There are progress reports given out monthly to Cardano Feed. The number of registrants, participants in the community, universities visited, schools visited, users in the groups, and shares performed will also be given out. The means to audit the success given by the proposer is also appropriate. As it would be indicated by the number of events, school and university visits, increased user participation in groups, and the number of speakers and guests. Overall, it is going to be simple to audit both the progress and success of this proposal. ", "q2r": 5, "assessor": "z_assessor_3233", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 8442, "q0": "Launching a project around the Cardano cryptocurrency to the Brazilian community in a thriving country, the proposal aims to create a new way for people to understand and participate. Thus, we can see that the proposal is consistent with the objectives of the challenge. Proposing 12 face-to-face and online meetings with the participation of speakers and guests to present Cardano, a team of experienced professionals specializing in media coverage platforms with the number of more than 1,000. 000 monthly visits and a significant amount of Cardano projects. The idea of ​​going into depth in cryptocurrencies is a smart way to invest with a large number of participants today, so the team is quite confident when implementing them with a solution to guide and transmit news about the ADA project. a lot of knowledge for the participants. Solving the given challenge is also quite common when you closely link people with easy-to-use social media and transmit information quickly, appreciated The economic value of joining at no cost is great because that would be very attractive. You are concerned because of the covid-19 epidemic, so it will be difficult to meet directly to communicate risk information immediately when using the website with high traffic to explain and present the project. then there will be no worries about the number of participants as expected. It will be fine if you focus on finding ways to fix it, we believe this project has a high possibility of funding.", "q0r": 4, "q1": "\"Building a good crypto project is letting people know more about Cardano ADA projects are not only the number of participants but we look forward to other goals of the project. During the 12 months we see you using to: launch, disclose and sign up for the meeting and run it, do you expect more subscribers to participate than the We were a bit surprised by this progress plan, but we didn't clearly see specific tasks and clear goals, or goals, or other goals. preparation for this meeting.\n   The budget table given is quite vague because often the schedule will be detailed work and will complement the budget but we do not see this link together. For example, we see meetings around to guide or give presentations on projects or the Cardano ecosystem without the work of that session including what will be prepared? invite any advisors or engineers to join to collaborate, prepare data...etc. And while the stated cost has not been made public, and much information is lacking, the desired $19,800 pool capital doesn't make much sense. Perhaps you have your own way of presenting and understanding, but to be sponsored, we think it is necessary to present more clearly and coherently the sections that are both easy to understand and attractive to participants. Members are divided into jobs that we see as a plus because it is clear that each position is assigned according to the experience of each suitable individual.\"", "q1r": 4, "q2": "As for the testability of the project, we find that this seems to be the most complete part of the proposal. these parameters include Number of people registered in the event - Number of participants in the community - Number of users in the group - Number of shares made. how to check them directly on the system is displayed parameters that will be authenticated in the most accurate way. As a new project specializing in events or looking for participants for group events, the success of this proposal is clearly seen because the number of participants will increase month by month, if the number of participants increases. If you are a regular member, it is certain that the events will open continuously and develop in the future.", "q2r": 4, "assessor": "z_assessor_2984", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 8275, "q0": "I believe the proposal can have a big impact for Cardano by addressing one of the largest crountries in the world, in its largest city. I think it is a big risk is that there might not be enough people interested in attending de meetings, as it is not a widespread topic. I think there could be some thought on innovative ways to attract the public, specially one that is not already included in the Cardano community. I think focusing on Cardano feed wouldn't be enough to attract a new public.", "q0r": 3, "q1": "The team seems fit for the challenge, I like how there is enough information on their backgrounds and links to corroborate.However the budget is higher than the expected for this challenge, which would be US$ 5000. It might be a good idea to scale it down first, so it would be possible to make it happen with the US$ 5000 budget.\nRegarding the milestone, I believe there could be more details, specially on how the marketing would take place.", "q1r": 3, "q2": "I like how there are specific measurements and the numbers show clearly what the proposal aims to reach. It would be nice to see how the project related to SGD goals", "q2r": 4, "assessor": "z_assessor_2971", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 8103, "q0": "I truly believe that these meetings would help and incentivize students and guests to become more curious about, giving them resources and tools to engage and participate, increasing this knowledge about Cardano Blockchain, its functionalities and cryptocurrencies like ADA. However. According to the requested funds  (19800 USD) I see an excessive budget, taking into account that this challenge limit is 5000 USD. As the meetings would be hybrid, there are some costs that can be reduced, and the total budget can be more reasonably distributed. Moreover, although I agree with a few detailed costs, others are not quite necessary. (example: coffee)", "q0r": 4, "q1": "According to the proposal, this proposal would last 1 year, one meeting per month, , but I believe it would have the same result to make it in less months, for example 4 times. It would give more time to let the guests and participants to search about these concepts that are new for them, and really understand if they are interested in learning these topics or not. Also, it would increase the numbers of participants in each meeting, as if it's successfully recognized by students, it would make them wait for the next meeting. And finally it would give some time to improve and go over the mistakes of the previous meetings. It would be great if the proposal includes more specific data about each month, if it would have some differences between each meeting, some new ideas in each and other details. The information about the team it's complete and they are qualified and capable to carry out this project.", "q1r": 3, "q2": "The information provided is sufficient to fully audit the progress and success of the proposal. The measuring of the progress it's correct, The metrics and KPIs were well chosen and I believe they are good indicators for evaluating success. It would be better to detail more about what success look like, talking about places, numbers, people, famous guests, impact in social media and tv, etc.\n", "q2r": 3, "assessor": "z_assessor_2955", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 7723, "q0": "The goal was to propose holding 12 in-person and online (hybrid) meetup events for the Brazilian community associated to the cryptocurrency Cardano and its complete ecosystem of projects. The proposal's success corresponds nicely with the challenge's success.\nI think there will be a significant rise in people's engagement and participation in the cryptocurrency community, bringing a wealth of information, guides, and news about the ADA project.", "q0r": 5, "q1": "Based on the information provided by the team member, I have a high degree of confidence that this plan will be implemented successfully. The team consists of developers, UX/UI designers, marketers, SEO specialists, and business professionals. They have created Cardanofeed.com, the largest media coverage platform, which receives over 1,000,000 visits each month. They also created the largest \"Cardano Ecosystem\" project directory, which lists about 800+ projects. The crew seems efficient and capable of achieving the desired outcomes. The budget is uncomplicated and details how the funds will be used to their intended use.", "q1r": 5, "q2": "The suggestion moves along really easily, and it is clear how it solves the problem. The expenses are modest and the budget is clearly laid out. Also A breakdown of all the expenses that may be calculated and the funding of $19800 USD requested by the proposal's author seem reasonable and essential to achieving the goal. The plan has recognized, understood, and is making efforts to address an actual need, therefore the resources provided are adequate to audit the progress. The knowledge and understanding of the proposer and his team increase the likelihood that the recommendation will be implemented successfully.", "q2r": 4, "assessor": "z_assessor_2916", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 7548, "q0": "The idea of ​​the project aligns with the objective of the challenge. Cardano Brazil Center for Students was born, this is the problem that needs to be solved in this challenge, it is directly related to the current challenge. This proposal can scale to solve challenges for the future it helps to add more value to Cardano helping more people to participate in Cardano. Well-defined solution author creates12 online face2face & hybrid meetings to be held in São Paulo (BR) with the participation of speakers/guests to introduce Cardano / Ecosystem to students and guests. This solution can solve the problem of the challenge. The author also raised risks that may affect the success of the challenge is about covid 19. The author is afraid that when the event happens, it will be affected by the epidemic.", "q0r": 5, "q1": "Timeline to implement this project in the span of 10 months. The proponent provided a complete blueprint with clear timelines. The author details what the to-dos for the month are and also aims to achieve them within a certain period of time. The progress of the project is also easily trackable through the web links that the author has listed. The success is clearly described by the author the results achieved are: Number of events held, several schools and universities visited and got acquainted with Cardano, increased user participation in groups , the number of speakers and guests at the events. This success is linked first to the challenge of the campaigns. The solution of this proposal is to bring more knowledge to events, bring in guests and speakers to give greater credibility to the events, rely on Telegram and WhatsApp groups to stay in close contact. closer to the user and get the information to the user in a faster and more decisive way. All events will be streamed to participants from other regions of Brazil and we will do it in person in São Paulo....These solutions can solve the current challenge of the group.", "q1r": 5, "q2": "KPIs are clearly defined, the proposed future implementation plan is very detailed and complete. Performance metrics are complete and clear.\nThe author will provide the community with some kind of progress report as we go along, in the form of a monthly news release on the Cardano Feed, to measure the progress of the project proposal.\nThe author will also provide a board to be disseminated in the Cardano Feed, with the development of the project according to the Catalyst KPIs.\nNumber of people registered for the event: 800\nNumber of people participating in the community: 500\nNumber of OS universities visited: 10\nNumber of schools visited: 8\nNumber of users in the group: 2,000\nShares made\nWith the above indicators is enough audit for this proposal.\nOur team consists of developers, UX/UI, Marketing, SEO, Marketing, Business. The team consists of 3 main members working on this project the author seems very experienced and has a strong background: Otávio Lima is Founder & CEO at Cardano Feed, Gino Matos is a cryptocurrency journalist Writer & content editor, Lucas Fernandes is a marketing assistant. The author also highlights what each member of the team has done, they talk about their previous experiences. They also link attached network links so we can easily follow their projects easily. The funding applied for this proposal is $19,800 less than 20% of the full challenge budget. The budget is broken down into reasonable expenditures, they are explained and estimated for each item clearly and in detail.", "q2r": 5, "assessor": "z_assessor_2902", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6596, "q0": "The proponent exceeded the budget limit established in the rules of the challenge. Which makes it clear that he didn't even read the rules to present his proposal.\n\nThe limit was $5,000 and he requested about $19,800. which doesn't make sense. I recommend the team to read in detail all the information in catalyst before uploading their proposal. My score is 1 star", "q0r": 1, "q1": "The roadmap does not have any type of detailed information, it is a constant copy and paste of information. The proposer copy and pastes \"Launch, disclosure, and registration for the meetup Conducting the hybrid meetup\" in every month. The background of the team does not explain how they can carry out this project or if they have any type of study. Regardless of their experiences in the \"business\" world.", "q1r": 2, "q2": "The KPIs are the only reasonable thing about this proposal. However, the wording of it shows me a lack of interest on the part of the team to carry out this project.\n\nWhile their intentions are good, they should work and take the time to read the rules of the game and write a detailed presentation that demonstrates transparency, impact, feasibility, and auditability.\n", "q2r": 3, "assessor": "z_assessor_2822", "no_vca": 12, "ne": 0, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 6399, "q0": "Athoughits intentions are very noble and this proposal is well-written and comprehensive, the budget requested is almost 4 times the maximum set for this challenge. I'm afraid I must qualify this qith 1 star to uphold this challenges rules and prevent this proposal to take funds from others who respected the budget cap.\nHowever, I do encourage the authro to come back in the next fund and read each challenge terms carefully to get their proposal funded, as they show great potential.", "q0r": 1, "q1": "Again, requitirng 4x the maximum budget allowed for this challenge, I don't see this proposal being successfully implemented even if it was granted the $5,000, as it would only cover a handful of the expenses.\nAs a result, I must deem this proposal unfeasible.", "q1r": 1, "q2": "Being unfeasible and out of the budget specifications, this proposal is not auditable by the community, which is why I must grant a 1-star rating.\nAgain, I'd like to encourage the author to come back next fund and after carefully reading and understanding the terms of each challenge, crafting a suitable and feasible proposal.", "q2r": 1, "assessor": "z_assessor_2815", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 5672, "q0": "The project clearly describes what it intend to do but fails to explicitly provide a detailed framework  of how the project will focus on the entrepreneur students who are the focus of this challenge. Additionally, the nature of the project doesn’t provide enough content on what the meet-up will focus on. Clearly, the proponent intends to bring guests and speakers to debate current issues that revolve around the Cardano cryptocurrency and also keep in closer contact with users and bring information to users in a faster and more assertive approach. Even though this a good initiative that will adda value to the cardano ecosystem, the focus of this proposal does not fit this challenge. I suggest the team realign the goals of this project to make it more entrepreneurial centered and also provide entrepreneurial contents that will shape the the skills of young students entrepreneurs. To add to that, the proponents seeks to also bring speakers for such meet-ups for to enhance knowledge acquisition but failed to indicate who the speakers are and where these speakers will come from. As far as we know there isn’t an established network to bring speakers on-board. However, the major positive here is the strategy to make this project more sustainable via the creation of the social media channels to enhance community engagement.", "q0r": 5, "q1": "Despite providing a clear work structure for approaching the implementation of this project, the roadmap is not well detailed. Regarding the roadmap, we see the project cites a list of two activities to be carried out for each event but they provides no further details on the duration for each and whether or not the activities woiuld  be done concurrently or will be done as listed or it is a random selection of each activity for execution. Whichever way the team intends to execute the project, i suggest the proponent provides clarity on that. The bio of the team show a detailed and solid profile. For instance, looking at the background of Gino Matos–a crypto journalist & content editor and Lucas Fernando–a founder of an education startup, i consider their profile well aligned to this project. However, on the budget, i believe the proposer failed to recognized the amount limit set in this challenge for funding. Therefore, the amount of $19800 requested for this proposer does not meet the criteria for funding. ", "q1r": 2, "q2": "Based on the information provided, it’s obvious the project has sufficient information to measure the progress and success of the project. The proponents cites “number of registrants in the event: 800, number of participants in the community: 500, number os universities visited: 10, Number of school visited: 8 and Number of users in groups: 2,000, as the KPIs to track and monitor the progress and success of the project. These are simplified and quantitative metrics that could easily and efficiently help audit the project. The indicators outlined by the team shows a systematic approach to understand if the progress of the proposal is in fact satisfactory: monthly progress reports that provides feedback on the various activities to the cardano community via the cardano feed. The more important point here is the issue of accountability. To address that, the proposers has indicated the team’s willingness to make available to the community progress report as they initiate the project, in the form of a monthly news release on Cardano Feed, to measure the progress of our proposal. For the purposes of accountability, i consider this satisfactory.", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4785, "q0": "The proposer highlights the problem and that is that Cardano community is growing rapidly in Brazil, and believes that meetings should be held in order to support and interact with the crypto community and college students and universities of Brazil. He claims that he will organize 12 face2faces & online hybrid meetings in São Paulo to present Cardano/Ecosystem to students and guests. The idea was presented and this project could add value to the Cardano ecosystem and the key metrics and goals of this project meet the criteria of this challenge. It would be good if the team also proposed an idea/plan for future sustainability.", "q0r": 4, "q1": "The team presented itself transparently through links via LinkedIn and we can see that the team consists of three members who have all the necessary skills and knowledge for the realization of this project. The proposer in the challenge, whose budget is only $100,000, is asking for $19,800, which seems to me to be excessive. My advice to the team is to ask for less money in the next F10 instead of the requested $19,800 and not to ask for funds for 12 months but for 4 months and thus through F10 and F11 a team with a smaller requested amount increases its chances of getting funds. Although a budget breakdown has been made, I would like to see who is doing what within the team and how many working hours the team actually works per month. The proposer presents a work plan for a period of 12 months, which is quite a long time and it is difficult to monitor the work of the team within such a time frame. My advice to the team is to reduce the time frame to 4 months. A possible risk is presented and a solution is offered, but for a period of 12 months there is certainly more than one risk that can happen due to the long period of time. ", "q1r": 2, "q2": "It would be great if the team presented a roadmap showing when the project will start! Is it Q4 2022 and when will the project end in Q4 2023? The team states in the proposal that the community will be able to monitor the development and success of the project through their website. My opinion is that the community will have difficulty following this project due the 12months time frame so I advise the team to make the project in a 4 month or 6month time frame. ", "q2r": 2, "assessor": "z_assessor_2616", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 3501, "q0": "Evidently the profile of the proposer team and the budget they are requesting is well outside the guidelines clearly established by the Challenge for which the proposal was submitted. The fundamental motivation behind the \"Challenge & Scouted for Students\" Challenge, approved by the Catalyst community last fund, is to provide college and university students with a space completely separate from the regular Catalyst environment in which they can bring their projects to Project Catalyst and secure base funding, nothing financially ambitious. Clumsy projects, with flaws or weaknesses if any, but with a true innovative and creative student spirit, insolent and daring, that will lead their authors to find in our community a place to learn and get involved, a playground endowed not only with money, but more importantly, with the possibility to get hands on with the best technology in the industry while having access to the knowledge, experience and sense of collaboration of Catalyst members. A new concept for Catalyst no doubt, but an efficient one: in the student community of the planet lies that needle in the haystack that ends up changing the game we play so tightly with other blockchains and the legacy world, and it is our obligation to build the best of the magnets to find it. That's just what this Challenge is trying to do: build a suitable habitat for students, designed primarily by the students themselves. \n\nBecause of my affinity with this Challenge (formal experience in education at school, university, company level) and my experience in Project Catalyst (actively participating in 90% of the community positions that exist: CA, VCA, Challenge Team member, funded proposer, involvement in multiple projects in Catalyst) I have been following it closely since it was approved at F8, because it never ceases to amaze me how often the scoreboard seeks to augment itself with topics of undeniable importance (Developer Ecosystem, Cross-Chain Collaboration, The Great Migration (From Ethereum)) to the point of discarding areas that in the real world have proven to be an inexhaustible source of ideas, creativity and results, such as those related to students.\n\nAs an educator and experienced Project Catalyst member,  I understand the intention behind the proposal and consider it completely valid. However, it is evident that it is not being proposed by the type of students that the Community decided to support through this Challenge and it’s outside of the max budget established per proposal, therefore it does not fit the parameters of the Challenge.  I quote (excerpted from the Challenge information): \"By creating a category of students and increasing exposure for their ideas, they can expect easier funding and to be scouted by engineers\" (section What does success look like?). \"Most student entrepreneurs suffer from a shortage of resources, especially when it comes to funding and hiring engineers\" (Why is this important? section). \"However, the number of proposals to Catalysts is increasing rapidly, and the community does not readily perceive small-scale proposals from students. .... Therefore, to make it easier for the community to recognize new ideas from students, we will establish a new category exclusively for students\" (Challenge brief section). \n\nTaking into account the above reasoning, I must remove four stars from the final rating. \n", "q0r": 1, "q1": "It is an iterative project that can provide the service it intends to implement.  The information regarding the implementation plan, the budget and the experience of the executing team, all point to a project that can work.  This makes it lamentable that it has been placed in the wrong Challenge (based on the reasons set out in detail in the Impact section).  For this reason, I must unfortunately deduct three stars from the final rating.  ", "q1r": 2, "q2": "The body of indicators provided by the proposal can efficiently accomplish the performance measurement tasks required.  The proposers provide numerical targets against which the results progressively achieved by the project can be measured.  In general, the project presents a feasible and measurable scenario.  However, proceeding to measure its performance would mean measuring the performance of a project that is outside the guidelines that were clearly given to the Challenge “Challenge & Scouted for Students” competitors.   Therefore, similar to trying to break a physical law, I see measuring the project as impossible.  Consequently, I must remove 4 stars from the final rating.", "q2r": 1, "assessor": "z_assessor_2462", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 3466, "q0": "The idea of having events in Brazil is really good due to its expansion potnetial, as the largest country in LATAM and one of the most important economies in the world. São Paulo is indeed the best city to hold this meeting, due to its economics and demographic relevance in Brazil, and its very nice that they will broadcast online, to reach those who can't attend, considering countries large dimensions. It is also aligned with challenge as it has, indeed, potential to bring students to Cardano and connect them to its ecossytem. However, in spite of some nice features proposal brings, such as telegram and WhatsApp, a good number of meetings and the focus using an accessible (non-technical) language/approach, it could include more information on the content that will be discussed that. Some sort of syllabus or what are the main desired topics could be explained. Other idea is to use a sequence of meetings to explore specific themes that can levarage Brazil's capabilities. For instance, Brazil has a great agricculture segments so maybe 2 or 3 meetings could have this as theme to expose potential applications or on going projects that combines both Cardano and Agrobusiness. This would bring real life use cases and solutions and potentially attract new people. \nIn addition, a more detailed communication/marketing plan could be ellaborated here. Not publicizing enough the event is a correct risk identified but the mitigation plan proposed could be strenghthened by a more robust adverstising strategy, covering not only Cardano feed site and telegram/whatsapp group but also including universities, companies, small business and so on.\nLast thing to consider is to collect lessons learned from other proposers that held similar events in past funds, specially the one in the \"grow latam, grow cardano\" a couple of funds ago. this is imporant in order to not start from scratch.", "q0r": 4, "q1": "it has a plan but it considers only the monthly meetings acitvities (sign up and executing steps for each month). Maybe it would be nice to see how the marketing campaign will be held accros time, for instance. Other acitvities imporant to consider is the choosing and rental of the venue, the engagement of speakers/teachers, the feedback necessary after each meet up and so. The presented timeline summarizes a lot what is envolved and doesnt make it so clear what will be all proposers efforts (which will likely involve much more that just these 2 itens per month).\nBudget breakdown is fair and encompasses project scope. its good to see that the aforementioned aspects that would be nice to see in the timeline are here included such as teacher payments, venue rental and Social Media. However, total budget surpasses the upper limit for this challenge (5k dollars)\nRegarding the team, there are 3 people committed with experienced in crypto and marketing and with apparent good network in Brazil universities, which should be enough to execute this project. linkedin links are provided and so is a good description on their background. the only thing nice to complement here is the role of each person in this specific project, but this is more of a detail.\nTaking all into considration, I'll rate it as 3 due to its simplified timeline and the fact thatbudget exceedes the challenge reccomendation by nearly 4 times.", "q1r": 3, "q2": "There are good kpis provided and some of them have targets which is essential to assess project success. Other nice metrics do be considered would be the number of new wallets created, number of proposals in future funds due to these meetups and some measurement of feedback collected after each event. This is not only important validate success but also to improve over time.", "q2r": 5, "assessor": "z_assessor_2461", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 3153, "q0": "This proposal makes little sense in this Campaign Challenge. It seems like it was written for a different campaign, but they just put it in here and added the word \"Student\" a couple of times in the problem and solution statement. (Students are not mentioned anywhere in the project plan - literally not once. Nor are any of the other challenge topics) Further supporting the notion that they did not read the challenge brief, their budget is more than 4x the intended \"cap\" for proposals in this category. I am giving 2 stars rather than 1 because I do think that more public/hybrid events is a good way to reach more people with information about Cardano, including students. But specific student impact is not described here.", "q0r": 2, "q1": "The budget seems reasonable, if a bit cheap. I'd rather see an effort to do these events for 6 months, rather than a year, so that there is more opportunity to evaluate and pivot, rather than being locked into a plan for 12 months, only to learn partway through that it doesn't work. The budget names many roles, but there are only three people named in the proposal. It's not clear if they will each be wearing multiple hats, or if they plan to hire additional talent, or who will be doing what. They also mention that they have other previous funded proposals and other proposals in this fund, but do not adequately explain what these are and how the workload would be balanced if they win all their proposals.", "q1r": 4, "q2": "I appreciate that the auditability section lists clear quantifiable metrics, and explains where the community can view their results. I am baffled by the presence of \"School and University Visits\" in the auditability section. It seems like a last-minute effort to \"fit\" the proposal to the campain -- visiting schools and universities is mentioned NOWHERE in the plan or budget, so I'm not sure what that's about.", "q2r": 4, "assessor": "z_assessor_2404", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1245, "q0": "This proposal seeks to help build a monthly Meetup Hub for students in Brazil and to target different universities throughout the year.  Much of the text of this proposal is quite vague without very specific plans or details on which Universities/cities, how the meetups will be structured, and how planning for it will work.", "q0r": 3, "q1": "Feasibility of this proposal is seemingly very questionable.  The proposal plans to utilize Meetup, which is an existing meeting platform, but there is very little detail on what the Meetups will do, how they will be setup, and where they will be.  The proposal is very cut in paste and/or filled with generic and vague writing.  The team members on the proposal seem to have good blockchain backgrounds and could set up an event that goes well, but it isn't defined very clearly.", "q1r": 2, "q2": "This proposal would be poorly auditable due to the vagueness associated with the what's and how's associated with this proposal.   In addition, of the total $19.8K of funds requested, only $3K appears to be spent on the actual meetups, with the remaining funding paying people.  It seems a little inverted in terms of funding should be used primarily for the event (venue, food/beverages, and/or content to be made to support the proposal).  This may be part of what is to be paid to the individuals associated with the execution of the meetups, but it isn't clear.", "q2r": 2, "assessor": "z_assessor_2219", "no_vca": 20, "ne": 0, "ng": 11, "nfo": 9, "vca_o": 1}, {"id": 14837, "q0": "Perceiving the pattern of interest in the Cardano ecosystem in the Brazilian people group, the proposer wishes to arrange 12 gatherings to assist the participants in tackling their inquiries as well as conveying data about Cardano digital money and its whole ecosystem of tasks. Moreover, the creator means to invite visitors and speakers to carry more noteworthy validity to the occasions as well as no enlistment expense for cooperation for all members, which will clearly be seen and intrigued by many individuals then participation will be guaranteed as intended. Nonetheless, I see the proposer makes reference to looking to bring attractions to carry more individuals to the occasions, yet can't show what its model is. Simply making guarantees that can't be satisfied effectively prompts a diminishing in the number of members after every occasion. Likewise, there is a detail referenced in this segment that I have not had the option to see the reason and its association with the undertaking, which is to convey a month-to-month pamphlet to clients with the principal news in Portuguese about Carsano. Assuming the proposer means to grow the market to Portuguese-talking nations, it ought to express the explanation. Eventually, for the solution to the challenge that the author anticipates about covid 19 that will make the proposal meets, difficult in general, it is very reasonable. However, right from the beginning, the proposer referenced mentioned organizing online meetup occasions, so the pestilence issue will be tackled all the more without any problem. So then, at that point, I have an inquiry to pose to the creator: how you will guarantee the number of individuals going to the occasion while today the web is growing exceptionally quick, and clients can utilize it to find out about Cardano at home in a more straightforward and more secure manner for them?", "q0r": 4, "q1": "An ideal group for what the undertaking means to do soon. There, most importantly, is somebody in the group who has won Fund 1 and Fund 2, and this will significantly support the colleagues. They likewise have an e-columnist and a marketer with broad experience and are prepared to work any time. Specifically, they have a Founder and CEO at Cardano Feed who claims functional and hypothetical information in B2B and B2C web-based business, commercial centers, and so forth as well similar to an enthusiast of computerized monetary forms like Bitcoin (BTC), Cardano (ADA), ZCore ( ZCR), and so on, to resolve participants' inquiries concerning virtual money and the Cardano ecosystem.\nItems that should be burned through cash are additionally recorded obviously by month. Be that as it may, its greater part is a seriously huge sum, and as far as I tell, it appears to have surpassed a considerable amount inside the system of the Challenge this time. For a project that surpasses the reasonable spending plan, it is hard to get endorsed by the citizen board, so diminish the sum or slice a few unnecessary things to guarantee that just about $ 5000 is utilized as required.\nFor the plan given by the creator, the majority of the months are rehashed similar exercises including launch, disclosure, and registration for the meetup and conducting the hybrid meetup. Yet, that isn't enough for what is expected in this part. My recommendation is, to come up with what the theme of each event is, what will it focus on the most, or who will be participating in the lecture to ensure the participants plainly handle the data and register for the right occasion they need. \n", "q1r": 3, "q2": "Expression is very effective and coherent. Each bulleted item is also very relevant to what the project is about. However, this section in general is still a bit sketchy and no specific data has been given. I recommend that any proposal related to the number of people should add a specific range or number to match what the voter expects in this section.", "q2r": 3, "assessor": "z_assessor_4104", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"id": 14875, "q0": "The team wants to hold regular meetings in 12 months between people in the crypto community to exchange support and interaction, this will help create a stronger community in brazil and will benefit the Cardano system in general. However, this project has not yet addressed the impact on the students which is the Challenge's targeting. ", "q0r": 3, "q1": "The project is making the repetitive activities in 12 months, they will have chance to get experience and improve from time to time. Yet there is the need to make a more detailed plan of each month, list of tasks and deadlines and peson in charge list. Furthermore, the budget already exceeds the limited budget by the challenge. The team has to consider to cut some costs to meet the budget target. The strong point is the team has members with strong and suitable background to perform this project.", "q1r": 3, "q2": "The proposal has a very clear budget breakdown according to the activity list. However they will need to make all the target numbers more specific. Since this is a chain of 12 repetitive meetings, it is expected to come up with certain results after each meeting and after all 12.", "q2r": 3, "assessor": "z_assessor_4107", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "12 face2face & online hybrid meetings will be held in São Paulo (BR) with the participation of speakers/guests to present Cardano/Ecosystem to students and guests.", "experience": "Our team is composed of developers, UX / UI, Marketing, SEO, Marketing, Business and we developed the largest media coverage platform Cardanofeed.com, with more than 1,000,000 monthly visits and also the largest \"Cardano Ecosystem\" project directory (approximately 800+ projects)."}