{"id": 418849, "author": "benzvibenjamin", "title": "Catalyst tournament", "url": "https://cardano.ideascale.com/a/dtd/418849-48088", "category": 26599, "amount": 5000, "description": "Business students are unaware of blockchain, they have a lot of business ideas but they do not know how to realize them", "f6_no_assessments": 20, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1691, "q0": "The proposal is fully aligned with the objectives of this challenge. Here, we are looking to fund projects that contribute to students, in general, having more opportunities to get involved with Cardano and for them to learn more about our blockchain and its various technologies. In short, wanting to support them, so that they have a good orientation so that they can actively insert themselves in our community. The proposal in question suggests that this be done: Cardano and Catalyst will be presented to the students of the Grenoble Ecole de Management (which according to the proposer, is one of the most important business schools in France). An exhibition of contents would be made, so that they know, at first, what Cardano is, after all. And after that, a tournament would be developed in which students would have 2 weeks to think about proposals for fund 10, in which “the top 5 will receive a reward, these will have 1000 gimbalabs (this is a token from the Gimbalabs community), these tokens will allow that they have contacts and be introduced to Gimbalabs engineers.” This is directly related to the scope of the challenge, as these students will be directly inserted into the community by establishing contacts with Cardano veterans, engineers who already work on ecosystem projects. It is also positive as some of the requested money will go towards prizes for this tournament, as a dollar reward is the most attractive way to keep students interested, in my opinion. In theory, the idea is perfect, but I have some observations to make. The first is: it would be interesting for us to understand exactly when the tournament would take place (I will comment more on the timing issue in the topic of feasibility); Fund 10 is scheduled to start in early October, according to the official calendar that was released at Town Hall recently. Could this be the beginning of the school year? It would be necessary for the challenges to be disclosed so that the students have a direction in relation to the proposals they will develop. Speaking of students, it is not very clear 1) who would be the target audience. It is said that the university focuses on business, so would it be only international business students? Or would there be students from the fields of technology, engineering, computer science, marketing, design? I believe that these are areas more directly linked to Cardano (in fact, any student from any area of ​​knowledge is able to get involved with our blockchain, but especially those in the technology area, since there is a need for a lot of mother of work of developers ). It would be important for this point to be clarified further. 2) it is unclear how students would be encouraged to participate in the tournament. The main flashy thing would be the dollar rewards, but I would like the event publicity process to be better explained. Other than that, I agree that it is a very relevant idea and that it relates in a certain way to the proposed challenge, deserving maximum marks in terms of impact.", "q0r": 5, "q1": "The proposal is quite viable, I believe that just a little more detail would be needed for this topic to be perfect. Speaking of impact, the whole project is divided into weeks, and we know what would happen in each of these intervals, what activities would be developed. What could be added here, in my view, would be more detail about the activities. We can see this in the excerpt “\"Week 1 - 3 : Teaching: Prepare content, present to the BIB class, Introduce them to Cardano, Introduce them to the tournament. Week 4 - 6 : Tournament, Start the tournament, Provide help if needed, Answer the questions, On week 6: presentation of all the ideas, find the top 5 (as described above).” For example, in the first step, it is said that the content would be prepared. contents would be covered (slides, videos, fully oral presentations?) In relation to presenting Cardano and the tournament to students: how would this disclosure be made, how would students be approached? How would the proponent, who is a student at this university , would you convince your colleagues about the possibilities of working with blockchain, in addition to the interest in profiting from the event? In the next step, the tournament itself would be held, and it is said that help would be provided, if necessary. would be held ? Perhaps the proposer would hold some face-to-face meetings, bringing together all students who have questions, or would individual calls be made? Would the presentation of ideas be done online or in person, and would this stage be open to the public or just to the judges? When it comes to funding, this part is great, the total (5000 thousand dollars - the maximum amount established for the proposals of this challenge) is divided in a very detailed way. We know which parts the amount would go to: content preparation, presentation, advice, awards, integration with Gimbalabs engineers and so on. The only question that came to my mind is the following: some activities, such as helping with the writing of proposals, can take a very different time to happen (it is said that it would take 20 hours, but maybe it would be much less, so as the money that would be left to be destined, in case that happens?). 11 hours are dedicated to preparing the expository content on blockchain, but as I mentioned earlier, it would be important for us to know which formats would be addressed and also what exact topics would be taught here, within the various subjects that make up the universe of our ecosystem. Moving, finally, to our last topic of analysis, which is the team, a lot of security is conveyed in relation to the mentors Yoram and Razali, as they provide a lot of information about them, in addition to attaching the links to their linkedin profiles. However, regarding Benjamin, we don't know exactly how he works at Cardano, it is said that he has been an internship since 2022, but it would be very interesting if we knew what project he works on and what role he plays. About Shlomo, no information is provided, but links to a proposal on ideascale and its profile on linkedin, it would be interesting if a small CV was attached here. That said, the topic is fine, but it needs some minor changes (detail improvement).", "q1r": 4, "q2": "The auditability of the progress is good, the only thing missing is that the proponent suggested that the work behind the suggested partial results be followed up. In the excerpts “Overall, we want to check the action of the project, mostly about the number of people participating and the quality of their work + A report will be given at the end of the project, Presentation of students on Gimbalabs playground / After townhall will be recorded in zoom, all proposals will be visible for the community”. It would be important for our community to be able to understand if the preparation of the content was being done in the right way, if the presentations were being organized and carried out as planned, if each of those involved was fulfilling their functions properly (actually in this proposal, at the As I understood, the entire process would be developed by the proposer, and only at the end would the mentors participate in the evaluation of the proposals and provide feedback). In this case, it would be interesting if the proponent provided us with a half-time report, that is, an overview of how things were developing over the stages, in addition to the suggested metrics. The report would be a preview of the final report, and could include the work behind such achievements - such as the number of students who would be participating/proposal ideas being created/ideas evaluation and so on. It is very positive how the proponent has included numerical KPIs (like the ones I mentioned) and also more qualitative ones, such as feedback from students, the Cardano community and Gimbalabs engineers. Talking about the auditability of success, in this part the proponent only focuses on quantitative data (at least 50 participants in the presentation, about 20 ideas given, at least 5 proposals written, etc.). In my opinion, it is also necessary for him to assess how the tournament participants would have related to Cardano in the medium/long term, that is: the presentations were a starting point for these students to have more interest in the cryptographic universe, and study more about the subject, seeking to insert themselves in the community, beyond Catalyst? Are they new active members of our community, in the sense of being involved in projects, even if they are not funded proponents? How can we ascertain the consequences, even if sensitive, of this initiative for our blockchain? Has a solid bridge really been established between the students and Cardano? Did the movement motivate other generations of university students (example: younger students) to also be interested in the subject and seek to learn about it, understand how they could insert themselves in our community? It would also be very positive to follow the path of those students who had won prizes in the tournament, either within the Gimbalabs hub or individually. With that, I think the auditability of the project is good, but just like the topic of feasibility, some small changes could be added so that this part of the proposal receives the maximum score.", "q2r": 4, "assessor": "z_assessor_2259", "no_vca": 14, "ne": 11, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 3989, "q0": "The problem statement, solution and execution mentioned in this proposal is a perfect match to the current challenge setting. Not only is the proposer a student entrepreneur (second year BA student of Business), the whole idea of the proposal is to educate AND onboard new students directly to Catalyst. The idea of educating business students in the first phase, then hosting a hackathon-like tournament, choosing 3 proposals (that will be rewarded with a small amount of funding) to present in the After Town Hall and Gimbalabs playground (where they have good chance of getting in contact with developers and engineers) is incredibly tailored to fit the challenge setting. As a recurring PA since Fund 6, I’m very impressed seeing how much thought and planning that has been put into this proposal. \u2028\u2028I believe (from my experience as a teacher and researcher, working with universities) that targeting business students is a great place to start. Every student the proposal aims to get in contact with will have a deeper understanding of entrepreneurship from the start (since they are business students). \nNot only will it benefit Catalyst if a few or many of them are onboarded, it will also benefit the university getting exposed to modern era entrepreneurship. This type of beneficial symbiotic collaborations with universities is super rare, in my opinion. Not often do we see collaborations where university students learn new perspectives that are not taught at university, and the university gets their students educated for free, basically. The Cardano ecosystem gets what it wants, and so does the university, and the students. I believe that this model is something that more proposers could learn from. I very strongly agree that this proposal addresses the challenge, flawlessly.", "q0r": 5, "q1": "The team provides us with a clear and realistic roadmap, divided in 2-3 week blocks. Teaching, Tournament and onboarding, in that order. Although the initial intention in the timeline was to have students apply for funding in Fund 10, it is my opinion that the delay to focus on the student proposals for the following Fund (11) actually will benefit them. This way, they can Segway in to learning and experiencing Project Catalyst and Cardano instead of being thrown in immediately. It will also relieve a lot of time pressure on the authors of this proposal. Slow and steady wins the race, and even with the delayed time plan it still manages to (hopefully) achieve all the bullet points mentioned in the challenge brief. \u2028\u2028I love the fact that the lead proposer is a student entrepreneur himself, but with added team members who have lots of experience of trusted and well known projects from the Catalyst ecosystem (Cardano4Climate, Catalyst School, etc). The proposal includes LinkedIn-profiles and instagram account to verify the stated experience needed for the success of the proposal.  \nThe budget breakdown leaves me with no questions, it is presented clearly with an estimate of hourly wage, working hours and is connected to the roadmap timeframe. In my experience as a teacher, I know that preparing educational material and especially supporting students in their work can be incredibly time-consuming. With that in mind, the budget is more than reasonable for the work intended. \n\u2028There are some risks related to the potential workload of the proposing team, considering they are involved in several different proposals in a variety of challenges. Both from this and earlier funds. The proposer is aware of this, and reassures us that there is some safety nets should that be the case. The proposal itself is not as immense as many others are, but a word of advice is to be mindful of the workload and prioritize the health of the team members, should the proposal be approved for funding.  \u2028Risks of not engaging motivated students, or lack of quality in their upcoming proposals are planned to be mitigated through education, support and incentives. Based on what the proposal aims to achieve, it is my opinion that this is a good strategy. Overall, I agree that it is highly likely that this proposal will be implemented successfully. ", "q1r": 4, "q2": "The roadmap is (as explained under ’feasibility’) clearly presented, and includes milestones on a clear time horizon. The suggested KPIs listed in the proposal are all relevant, and good choices when measuring elements of success after potential implementation. \nHow many students will participate in the project, number of ideas/proposals contributed (and the quality of these), feedback from students, Gimbalabs and the Cardano community, it’s all there. If the estimated target KPIs will be met, it will onboard 50 business students into Catalyst, along with (hopefully) 3 funded proposals (and lots of new ideas).\nI really stand by the idea of creating feedback from all directions, since it might lead to perspectives that wouldn’t normally be found if the only feedback came from the teachers, for example. It will also aid in creating a space where it is common to have each actor or collaborator have a voice during the development process, even if the project is hosted by this team. \u2028\u2028The community will be able to track the potential proposals through Catalyst, partake in the report planned for the end of the project, and of course view/attend the presentation from the students in the ATH/Gimbalabs playground. It will be interesting to see what this proposal will grow into being, and how the team plans to communicate with its community members if the students reach a much higher number (maybe it will turn into something similar to Catalyst school, who knows?). If I were to make a suggestion for improvements, I would like to have seen a social media channel or means of communicating with the team directly. Or a place where the community could follow the development progress of the project, even in its infancy. \nConclusively, I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. ", "q2r": 5, "assessor": "z_assessor_2504", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 5674, "q0": "The existing problem cited by the proponent in his problem statement is what the defines the challenge and scouting for students setting challenge. A platform that enable students explore and engineer their ideas into the real world to provide relevant solutions to societal problems. The cardano ecosystem provides such a platform, not only to shape and develop the ideas of students but also help them integrate their ideas into the real world. From the proponent perspective, the main impact focuses on \"...increasing the exposure of the students ideas, access to an easier funding and can be scouted by engineers, this could also be an awesome opportunity for the students to get to know Cardano and Catalyst\". This goal fits perfectly with the objective given by the challenge and scouting for student challenge setting. The proponent defines a systematic approach to address this challenge, segregating them into 3 phases; a teaching phase, the tournament stage and the onboarding stage. Ideally, per the project design, the expectation is that, going through these phases successful should enable students refine their ideas (with the assistance of the professionals) for funding in the catalyst space. Its worth noting that the project provides a detailed incentive system that could attract more students developers who are left behind with their ideas due to financial contraints and mentoring system. What's the value addition to the ecosystem? Ultimately, by introducing  students entrepreneurs to the cardano ecosystem, the team would create the opportunity to scale up the number of developers within the community and the number of ideas developed on the cardano Network. More importantly, this would be an entry point into the community where students could be onboarded either as PAs,Voters, Dreps and any other role. The overall observation here is that, the proposer presents a detailed project description, a well captured target audience and a definite marketing strategy that would support the team's effort in project implementation. However, my only critic here is the absence of a sustainable plan. Is this a one time event or several of this would happen? i guess the proposer could have provided a clarity here. But really satisfied with the work of the team.", "q0r": 5, "q1": "The work structure put forward for this project's implementation is not only precise but also sufficient to support the feasibility of the project. The project  details the profile of 3 team members for this project. How does the team’s experience supports the implementation of this project? The expertise of the team addresses this question. Benjamin Ben Zvi, details his experience as a proponent with 2 funded projects. Would this experience be required in this project? obviously, the project intend to shape the ideas of the students entrepreneurs therefore his experience would be relevant here. Aside that, he provides the relevant links to his projects to confirm his expertise. Yoram Ben-Zvi, a partnership lead, social entrepreneur, mentor and an active CA, provides a different perspective to the project with his experience and expertise. His mentorship background suits the outlook of this project. With Razali Samusudin as a research lead, i believe his expertise an educator, catalyst school core member, social entrepreneur, catalyst proposal mentor, and education coordinator would be more significant considering the general objective of the project. I am impressed with the designation of specific role for each team member. Overall, the team experience and expertise covers all the areas required in this project. Apart from that, the roadmap is well structured to complement the effort of the team. There are clear timeframes for the activities schedule within the roadmap. Aside that, the provision on the budget is very clear and elaborate, detailing the specific amount to each item.", "q1r": 4, "q2": "The information provided to audit the project is  detailed and sufficient to measure the progress and the success of the proposal. The ultimately success (long term goal) of this project is to ”…increasing the exposure of the students ideas, access to an easier funding and can be scouted by engineers, this could also be an awesome opportunity for the students to get to know Cardano and Catalyst”. To determine the performance of the project in achieving the overall objective, the proponent also set specific deliverables such as, attain at least 50 participants on the presentation, enroll 50 possible new Catalyst community members, develop around 20 ideas given and at least 5 written proposals for fund 11. Based on these deliverables, the team further provides specific KPIs that align with the general objective and the deliverables provided for the project. Among these KPIs, the proponent cites the number of ideas given, how many students participate in the project, number of proposals that come from students and engineers, are the proposals funded, rating of the idea and feedback from the students, as the indicators. In my opinion, these are comprehensive approach to help measure the overall progress and success of the project. These KPIs would help provide accurate and definite data on the progress and success of the project. Additionally, to indicate their transparency and accountability, the team intends to present report on these deliverables to the community. I am satisfied with the overall inputs of the team. Kudos.", "q2r": 5, "assessor": "z_assessor_2734", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1059, "q0": "The proposer being a student himself knows best how to motivate his fellow students into getting involved in the Catalyst process and community. He wants to organise a tournament, with prizes in US dollars, that will certainly incentivise students to participate. The tournament will require students to come up with ideas for Catalyst Fund 10 challenges and the best 5 ideas will be not just rewarded, but supported in an onboarding process, where participants will be able to present their ideas to the broader Catalyst community throughout the Catalyst after Town Halls or Gimbalabs Playground. Further on, after they start getting involved and understanding what Catalyst is about, they will most probably become more interested in joining the process and committing their time and ideas to the future of the blockchain.\nI think the project stands a very good chance of succeeding and in that case, the impact it will have could be very beneficial to the Cardano ecosystem.", "q0r": 5, "q1": "I find the implementation plan to be easy to follow, as it is well organised for each phase of the project - teaching, tournament and onboarding -  each with its subcategories, organised neatly in a provided timeframe, to be completed in an interval of 9 weeks.\nJust like the plan, the budget is also very well organised, on the same 3 sections, each with adjacent tasks, well-described and with the corresponding amount of hours and dollars needed budget. All numbers seem to be reasonable, as such, I have absolutely nothing else to comment on this topic.\nThe implementors of the project have provided us with a lot of information about themselves, including Linkedin links to show their skills beyond the scope of Project Catalyst. Besides this, I also highly appreciate the honesty of the proposer in regards to his time management of his other proposals, especially considering the fact that he’s also a student. His honest promise of waking up earlier to work for Catalyst has definitely convinced me of his ambitions, and as such, I can only give him a score of 5 for this section.", "q1r": 5, "q2": "I also appreciate how the proposer has thought out every detail: since Fund 10 will be overlapping with the start of the university year, they will only be delivering ideas for Fund 11, in that way making sure they have enough time to prepare and get sufficient involvement from his fellow students. \nThe metrics he will be monitoring look reasonable, and since he plans on making a public report at the end of the project, as well as getting the students to participate in the ATH and Gimbalabs Playground, that will provide the community with direct interaction with his proposal.\nI also appreciate the vision of success, to me, it looks like the proposer sees the capabilities and improvements that will come in the future with blockchain, and Cardano especially and is keen on providing this vision to his fellow students, thus making sure that the upcoming young generation is better informed and prepared.\nIn conclusion, I find the proposal to be easily auditable in its implementation.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1}, {"id": 13449, "q0": "The aim of  this proposal is to create awareness  about Cardano among the students in  Grenoble Ecole de Management, France by  introducing the business students to Catalyst. This will be done by organizing outreach programs which will educate and empower students  with creative ideas, which can be submitted as  proposals on Cardano. This will go a long way to ensure easier ways of receiving funding for projects and ideas by the students which will encourage participation and use of Cardano blockchain technology, and will also help students to realize  their business ideas. ", "q0r": 5, "q1": "The proposal is to be implemented over a period of nine weeks and involves students with minimal to no knowledge of Cardano Project Catalyst. A laid out budget and a detailed plan, including a reasonable schedule for the completion of the project is provided. Problems that may arise are identified and solutions are suggested. Thus this project  has a high probability of being implemented successfully.", "q1r": 5, "q2": "The proposal provides sufficient details to audit and assess the project's progress toward effect development of the project. This is seen from the detailed procedures that will be used to carry out the project, the feasible budget and ways in which progress will be measured.", "q2r": 5, "assessor": "z_assessor_3648", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 12839, "q0": "The proposal the Benji has presented has a very clear intention and would bring on new members to the Cardano network as well as get new and aspiring developers to build on this network.  Bringing students together on the Cardano network and the chance to win some ada I believe would help the kids push their own limits! ", "q0r": 5, "q1": "The plan Benji has set out should be fairly easy to set up.  He has students he wants to engage in the ecosystem and give kids other options that they normally haven't seen in their life. Being a student can be hard and lack of money.  This tournament should drive students to learn about this system and for them to get frequent with Catalyst and the Cardano ecosystem. ", "q1r": 5, "q2": "The information here should be simple to audit.  This part is very dependent on Benji.  He has to let the public see the work of his students and see through the top ideas his students has.  The ask of $5,000 is something i dont see as to be to much. Giving students the chance to make some money while learning this eco system is something many other programs should be considering. ", "q2r": 4, "assessor": "z_assessor_3487", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 12573, "q0": "The problem in the challenge that needs to be solved here is that business students don't know anything about blockchain, they have a lot of business ideas but they don't know how to realize them. The proponent found how it would add value to the Cardano ecosystem by teaching the basics of business, such as accounting, marketing, team projects, etc. With the aim towards doing a use case with a BIB (Bachelor of International Business) class and can then continue doing this for further funds in Grenoble School of Management or other schools/Universities. I believe the proposal can scale to solve future challenges. It will allow them to express their ideas and be a part of the future and will provide them with the knowledge that they would never be taught in Business school. I agree with this suggestion, this impact deserves 5* and I believe it will effectively address the challenge. ", "q0r": 5, "q1": "The proponent provided the relevant skills and experience required to implement the proposal. Mr. Benjamin Ben Zvi: A sophomore of international business students in Grenoble Ecole de Management. Speaks fluently in 4 languages ​​and learns 3 others. Especially having experience with Cardano and working with several sponsored proponents...Mr. Yoram Ben-Zvi, partner team leader, social entrepreneur. Yoram is an active catalyst member, CA, and part of the Cardano4Climate community.....Mr. Razali Samusudin, Research Lead, Blockchain & Sustainability Researcher, Social Entrepreneur, Catalyst Proposal Advisor ... The budget number that the proponent gives is clear and detailed, with this budget number, there will be no need to ask for any other funding. The budget number is divided into 3 sections, the first will be for lectures with a total of 1000usd, the next will be a tournament with a total of 3120 USD, and finally for referrals will be 880 USD. The proponent has given a detailed plan with an implementation time of 9 weeks. The proponent has divided into 3 phases to implement the project, week 1-3 Teaching, week 4-6 Tournament, and week 7-9 In the introduction, the proponent has established the plan to be done in each stage in very clear detail. The proponent weighed the challenges and risks associated with implementation and found solutions for example (Students didn't come up with relevant and interesting ideas - to mitigate that, we will teach them the best way we can about Cardano and supervise them so they come up with the best ideas possible). With this feasibility, I completely agree, deserving of 5*.", "q1r": 5, "q2": "As said in terms of feasibility the roadmap of this project will be implemented in 9 weeks, the obvious possibility of this project is reasonable. Success will be measured by the quality of the results provided. The team lacks time to come up with ideas for fund 10 as the school year begins on September 15th and the proposal process ends at the end of September, after which the team will begin providing content for the 11th fund. At least 50 people participated in the presentation about 20 ideas were given. At least 5 written proposals for the 11. fund\n3 sponsored proposals. Up to 50 new Catalyst community members are possible. I completely agree with the clarity of this project.", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 12131, "q0": "Breakdown the catalyst content into a smaller piece of project such as tournament would be a great idea if there is no other token involved. Students are really a good target for awareness purpose.The word of mouth is still effective around the education ecosystem. But the target quantity of the student is below 100 people, which we acknowledged that a webinar on social media will be around 100 or more. The participation of the students will help the proposal maker to filter the best issue to be analyze and being used for his/her proposal creation in the future. The afterward impact will clearly have no clue. The abstract concept of student might have a potential best practice without knowing what is really happening on the society, especially on Cardano. Before having a competition, a fast forward sharing knowledge will be more likely to be intense, need more time to digest many thing from categories that being provide on Catalyst. As long as Cardano have interest on the surface of these group of student, it is okay, but to go through the mind of students will need more effort. But the idea from this proposal is very simple and practical. ", "q0r": 4, "q1": "Such a pure and geniune idea from a student which have a passionate act to blockchain, Even though it will be a tough way to go thoroughly with other students, this project will be a good first step of the community that will be build by a student. With more support on this proposal, it will be more convenient for this little group of students to be more actively spread the word that hey, my friend get funded so as they will aware of the potential of being a student which have a good direction to blockchain and Cardano. The challenge will be escalate when the reporting phase is on demand, while the event must be done with some budget on it. How they will collect the database and participant and how the proposal creator analyze the tournament will be no problem as long as there is a supervision on the project.", "q1r": 4, "q2": "The roadmap is clear enough but too general for the activity that they will do it on Proskill. The milestone of the team is having good number but the previous impact fund8 at least will represent that they need less budget for such kind of engagement to the user of this platform. ", "q2r": 3, "assessor": "z_assessor_3362", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 11941, "q0": "It fulfills the target and challenge yet the scope of impact considered to be quite small, since it is in the scope of a specific study in the school, without any way of publication or greater influential move explained in the proposal. The risk is also not mitigated well in the proposal, which the solution doesn’t really certain about how to solve the problem. I would suggest that the program should collaborate with the curriculum or school authorities to construct the better encouraging environment, supervisioned and supported by the school, thus making the students aware and motivated since it is under a greater authority.", "q0r": 4, "q1": "Fund distribution goes too much on basis of making presentation and answering questions, with highly paid amount per hour, which are the core things to do and should not be accounted for that much money. The fund should have been more detailed on various program crucial allocation such as host presenting fee or any other resource payment, instead of just undetailed funding on activities, which could infer to only “paying the people”. Since the project is in a small scope of school-community, chance of failure should be small. The timeline is also quite feasible  and should be safe to say that the project can be delivered successfully as planned.", "q1r": 4, "q2": "The proposal has defined a set of logical metrics to measure its auditability. It is defined that the ideation result and proposals from each team will be visible for the community, yet the way to access the proposals and the publication or updates of the whole program activities are not mentioned yet. By having the publication media and any tracking reference that should be mentioned in the proposal, the program should become more auditable.", "q2r": 4, "assessor": "z_assessor_3319", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 11391, "q0": "Project catalyst is a series of experiments which seeks to generate the highest levels of community innovation. Catalyst is bringing onchain governance to the Cardano blockchain by allowing the community to self determine priorities for growth. It also let's participants deploy funding to proposals which tackle challenges and capitalise on opportunities that arise in the life cycle of Cardano. As business students are unaware of blockchain introducing them to catalyst and teaching about project create tournament for them to start writing ideas. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The project has detailed plan includes teaching which has presenting to BIB class and introducing them to cardano and tournament has answering the questions and presenting ideas. The debonding has project discussion with community and helping them to write proposal. The budget is outlined clearly and is reasonably achievable. The team working with the project has good experience about cardano and catalyst including proposal writing, CA and supporting funded proposals. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The action of the project is tracked by knowing number of students participating in the project, ideas given and proposals that come from students and engineers. Feedback and rating from students is also important. The target of project is reaching many participants in presentation and giving ideas with written proposals and funding for them with new catalyst community members. The proposer has considered challenges and risks relevant to a successful implementation. The information provided is sufficient to audit the progress and success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}, {"id": 11162, "q0": "This is a great project that will help introduce Business students to Cardano and to help get funding for their ideas. The project could have a great impact on Cardano. Business students usually have different ideas which they sometime find it difficult to get funding for these ideas. This project can address this problem and help introduce the business students of Grenoble Ecole de Management to Cardano.", "q0r": 5, "q1": "The team picked by the proposer to be judges for the tournament per their designation, proves to be highly skilled and they can help gather the best ideas for the project to be successful. The proposer in the proposal, provided a link which gives details of the judges to be used for the tournament. This shows the time the proposer has put in to gather the great people to make the program a success and to get the best ideas for the project. \nThe budget for this project has been clearly stated out. It indicates how much will be paid as a reward to winning participates and other miscellaneous expenses. The reward price, in my view, will help get the best out of participants and this will help entice them to take the project serious and put in all their best.\nThe proposer in my view did indicate the timelines for this project. They indicated when the results from the project will be seen. The proposer did not indicate any risk associated with this project and what will be their next step when the number of student or ideas they estimated to get was not achieved.", "q1r": 5, "q2": "The project team mentioned the milestones that could be use to track the progress of the project. There is detailed plan as to when the desired outcome of the project would be expected to reach. However, the team provided a list of final metrics one could use to audit its final goals and its success. The team also provides a detailed breakdown of the budget which is realistic and practical. The proposal's objective of introducing business students to Catalyst is viable and competent. The project indicates a detailed game plan and time for which ideas from business students can be gathered and it also indicates the efforts that would go into educating these students about Cardano.  ", "q2r": 5, "assessor": "z_assessor_3228", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9407, "q0": "The author realizes that business students are unaware of blockchain, they have a lot of business ideas but they do not know how to realize them. To solve this problem, the proposers introduce the business students to Catalyst, teach them about the project and the challenges, create a tournament for them to start writing ideas. Through these activities, Cardano brand will surely be popular in a group of students of Grenoble school of management. Furthermore, the Cardano value will be increased through the ideas suggested by students in the tournament. Generally, the project address the challenge and have specific target to follow. I just wonder a bit about the scale of broadening Cardano since this tournament is organized to business students in a college only. I hope this model can be implemented in various group of students for more effective. I evaluate mark 4 for this criteria.", "q0r": 4, "q1": "There are 3 key persons entering the project, including the second-year student (the writer) and 2 other experts. They all have knowledge in Cardano. One member is the mentor with international board, operations, and startup experience. The other one is the Educator, Editor, Digital Economy, Blockchain & Sustainability Researcher, Social Entrepreneur, Catalyst Proposal Mentor, Wada UN SDG and Education Coordinator. I believe they have enough competence to run this project. \nRegarding the budget, the proposers state out costs for 3 main stages, including teaching, tournament and onboarding. The estimated costs are stated clearly and logically. The authors also consider two main risk they may face out for this project. First, the students do not give relevant and interesting ideas. Second, the students will not be motivated to work with Cardano. The proposers give proper solutions to this problems by teaching them about Cardano and Catalyst, organizing the tournament with the award for motivation. I think the author should also consider the fact that there may not be many people attending the workshop and how they can handle in this situation, how they can attract effectively business students to attend the club. The activity of propaganda is very important. The author should have more activities in this area and state an amount of budget for these. I evaluate mark 4 for this criteria.", "q1r": 4, "q2": "This project has clear schedule to follow, including: teaching (first to third week); tournament (fourth to sixth week); onboarding (seventh to ninth week). The proposers have estimated time to finish and particular figures to evaluate the success. They are: at least 50 participants on the presentation, around 20 ideas given, 5 of which are written for fund 11, 3 funded proposals, 50 possible new Catalyst community members. In general, this proposal is clear and the problem solving is easy to understand. I evaluate mark 5 for this criteria.", "q2r": 5, "assessor": "z_assessor_3052", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 14610, "q0": "It can be seen that the proposer's project is completely aligned with the challenge because it directly increases the number of proposals in this category in particular and the Catalyst community in general. This is a project to present blockchain to students, besides creating a playground for them to develop business ideas and realize them. The plan is divided into 3 parts – corresponding to each part are the activities of the proponent for the project. He proposed a very detailed and clear schedule. First, they train the students. Then organize a tournament for students to present their proposals. Everything is covered from the tournament's roadmap to the judges' information. The tournament judges are also experienced in the field of investing on the Cardano ecosystem. Ultimately, the purpose of the tournament remains to help the highest rated proposals get in touch with engineering resources. It can be said that this project has chosen the perfect score with the KPI challenge and if successful, it will create a huge source of future proposals, contributing to the diversity of the ecosystem. . A small suggestion is that the proposer can consider publicizing the lecture content so that the catalyst community can evaluate the professional knowledge that the proposer will bring to the students. Business students are an ideal resource, and according to proponents, they will likely be key players in blockchain and cardano in the future. Therefore, accessing and training business student resources is necessary for the ecosystem. The proponent presented a risk and with it a reasonable solution. The resolution of risks will depend largely on the subject matter and expertise of the proponent. And I also believe that giving $1000 as a reward to students with the best ideas is an incentive for them to put in more effort and maintain interest in Cardano.", "q0r": 5, "q1": "In terms of feasibility, I have nothing but praise for the team. Each point is covered in detail. The project is led by trusted figures based on their expertise. At the same time information about the people working on the project is presented in the form of links to verify them. The level of detail provided in the \"\"project details\" section provides the community with an understanding of the implementation steps involved. The proponent has given a completely ideal timeline and clear roadmap for the community to track the project progress. In addition, the description of budget items is also highly detailed, covering all Aspects of the budget. The budget breakdown is also clearly presented. I have a question whether the proponent has left any investment funds for equipment and software for the tournament?", "q1r": 5, "q2": "The team details the success metrics they expect to have, which I consider relevant. Another factor that adds testability is that they will report after the end of the project, all student work will be visible to the community. Not only that, the proponent sets out specific KPIs to determine the success of the project, which shows the level of motivation and confidence that the teams have in themselves and allows the community to work together. detailed understanding of how the project is progressing and its direction. based on my previously described reasoning, I strongly believe that the community will have the essentials for an audit. I have a small suggestion that the team can set milestones corresponding to each week in the project activities section. (Although this is not too necessary.", "q2r": 5, "assessor": "z_assessor_4075", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 8892, "q0": "This is an excellent idea where students are introduced to block chain and conducting a test where students can build their own ideas and present them, by this students of business school will be having a inner competition among them to get the best idea out of them.\nThe winners of the project will also be rewarded with gimba tokens, and they are introduced to gimbalabs to develop the project is a great idea, by developing such projects students can get into future catalyst funding projects. hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The only challenge the project has is introducing studens to catalyst program in most efficient way , the proposer's team has knowledge on cardano but still they are  in student level, they have a experience drawback in teaching cardano related data.\nOther than above fact the task is simple, setting up a group and asking them to get idea is easily achievable and presenting the winners with gimbatokens will definitely boost more students to participate in such events, and introducing the winners to gimbalabs and helping them to request funding from catalyst program can be achieved. Hence , plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The presented plan should have elaborated on who is teaching the basics of blockchain to the students and which are the topics that proposer's want to cover first,this task definitely needs to good teacher where he/she can keep the students more engaged.\nExcluding the above point the team has well presented regarding the assessment, and rewards to the winners of assessments , the presented plan has introduced the team and their role during judgement of ideas, The presented plan detailed timeline of the project as well as structured budget breaking. hence, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 7869, "q0": "The proposal comes up with an excellent plan about the opportunity into blockchain technology for International business students. Here, their is a cognizance about the cardano and blockchain. The proposer aiming to do a use case with the bachelor in international business class and implementing catalyst to students that would create amazing opportunity to express their conceptions. The proposer provides a detailed plan like teaching, tournaments and onboarding. The success of the proposal increasing the exposure of the students ideas and can be scouted by engineers. So that which gives awesome opportunity for the students to get to know about cardano and catalyst. The proposer is also aware of risks involved and also has required action plan to overcome them. ", "q0r": 5, "q1": "The proposer provides a detailed explanation of how the intended plan would function. The proposer provides weekly wise goals like teaching, tournament and onboarding which are measurable. This would provide ideas for Fund 11 also. The team requested for total budget breakdown of $5000 which is very clear and practical budget breakdown. The intermediate steps and roles of the members are clearly identified. The team put together to make this idea into reality is very trustworthy. The member carry a lot of experience and skills from their previous years of working on blockchain and other fields. The team mentions about coming back in the next round which shows passion and future plan for this proposal. ", "q1r": 5, "q2": "The proposer should look over the number of people participating and quality of their work and the report will be provided at the end of the project. This is entirely new project. The proposal process end of September and the success will be calculated according the quality of the results provided. 50 possible new catalyst community members. The goal is to increase the quality of the education, mostly in business schools. the Presentation of students on Gimbalabs playground, townhall will be recorded in zoom all proposals will be visible for the community. ", "q2r": 4, "assessor": "z_assessor_2929", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5768, "q0": "The proposal seeks to educate a specific group of students - Business students, to help onboard them. This is to help them link their  business ideas into the catalyst ecosystem to explore for opportunities to make their ideas reality. \n\nThe proposal is aligned the challenge because the students may be have entrepreneurial ideas but the funding source have been the major challenge. Educating students of the opportunities within catalyst is a great way. This could be a source of funding for their ambitious businesses. This will help create jobs after school and transform societies", "q0r": 5, "q1": "The proposal's timelines shows a clear path to its implementation. Activities put in place are detailed with what do after each stage. \nThe budget is equally a detailed one with items and corresponding cost. It shows where each funds are going to do for a successful implementation. \n\nThe team is well organized and have experience in the WADA ecosystem shows that they are familiar with the catalyst platform. This shows the team would be able to execute the project with ease. \n", "q1r": 5, "q2": "There are interesting KPIs that could guide the community to audit. The proposers however, should also consider progressive monthly report to understand the win and failures of the project by the community.\n\nsuccess has been well thought with reasonable situations meant for success. This will make it easy for the community to audit the proposal. ", "q2r": 4, "assessor": "z_assessor_2749", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 4788, "q0": "The proposer points to the problem that Business students are unaware of blockchain, they have a lot of business ideas but they do not know how to realize them, so he will introduce the students to the Catalyst, teach them about the project and the challenges, create a tournament for them to start writing ideas. In the proposal, it is clearly presented how the proposed solution will address the challenge. The team worked out key metrics and presented in detail the goals of this proposal and proposal is able to scale to address future challenges. ", "q0r": 5, "q1": "A team of four people was presented via Instagram and LinkedIn, from which we can clearly see that this team has the knowledge, experience and all the necessary skills to implement the proposal. The budget is presented and is quite reasonable and is broken down into identifiable items. The implementation plan together with the time frame within the project will be realized is elaborated in detail and it is clearly visible who will do the elaborated parts of the plan and how. The proposer lists possible risks and offers solutions.", "q1r": 5, "q2": "A detailed roadmap with milestones with precise time frames within the project will be realized was listed and presented. The KPIs are also worked out in detail and the community will be able to follow the development and success of this project without any problems. ", "q2r": 5, "assessor": "z_assessor_2616", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 3156, "q0": "This proposal is a Campaign Bulls-Eye -- There is a known cohort of students who are great candidates to learn about Cardano and participate in Catalyst. The proposed event is understandable and impactful. It includes a clear and achievable path for students to participate as Catalyst proposers in fund 10. It includes numerous paths for students to start cross-pollenating with other experienced builders in the comminity - either through townhall, or the Gimbalabs playground. In short, all the key elements of this Campaign are present in this proposal in an impactful way.,", "q0r": 5, "q1": "The proposer is a student, and yet is already deeply experienced with Catalyst. He is also cooperating with respected and known builders in the community. The plan is cohesive, contained, and concrete, and the budget is appropriate. I have no concerns for feasibility.", "q1r": 5, "q2": "This proposer included a clear timeline to hit, and a full set of both qualitative and quantitative measurements for auditability. For quantitative measures, the proposer specifically set 5 measurable goals. What I like about these goals is that they combine realistic targets with possible stretch-goals. For example, the goal that the tournament would result in three funded projects. Is that realistic? Perhaps it is, but it also is somewhat outside his control. It is however an exciting stretch goal, and it would be exiting for the tournament participants, and for the Catalyst community to cheer the new cohort on toward this goal. Achieving or exceeding this goal would be a win for the Campaign, for the Catalyst community, for this proposer, and of course for the students who win funding to start building for Cardano.", "q2r": 5, "assessor": "z_assessor_2404", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 10299, "q0": "Great idea Introduced business students to Catalyst, taught them about the project and the challenges, created a tournament for them to start writing ideas\nand it will have a big impact on the Ecosystem if it is implemented in the good way as mentioned and it has even been done before on a Grenoble Ecole de Management which is one of the most influential business schools in France, the school is full of international business students who can easily find opportunities into blockchain technology.\nwhich is mainly for news but needs good marketing i see you have planned your Idea because you provide a complete solution for Cardano news and insights on all the projects in progress started or running on Cardano.\nthey have a lot of business ideas implementing Catalyst for this class can be a great thing giving them the opportunity to express their ideas and be a part of the future in my opinion. Moreover, this will give them knowledge\nsolve the given challenging problem, identify the actual challenge risk.", "q0r": 4, "q1": "team and budget look good Introduce students to Cardano, Catalyst project, explain everything there is to know about challenges, funding, These Proposals help students bring their ideas to life with Cardano's help, that's what the challenge is all about. This proposal will allow some students, who will be key actors in Blockchain in the future, to integrate the system\n Such a project will need ongoing maintenance after completion of spending the necessary funds and will need to collect data on the project starting fresh every day The success of the proposal is fully consistent with the success of the project. challenge presented, this is increasing exposure of student ideas, these ideas can expect an easier source of funding and can be sought by engineers, this is also can be a great opportunity for students to get to know Cardano and Catalyst.\n, so I see a future vision for sustainability after being fully operational ??\nCardano projects start every day,\nit is possible that the project has a stake pool and will continue to finance from stake revenue or display Ads on the website, but it is not mentioned.\nAnother important thing is that there is no mention of the cost of being multilingual unless the team will use automated plugins to automatically translate the txt, which will not work correctly for technical data and may confusing the reader.\nThe budget requires a clear and transparent explanation of the right spending.\nTeam capacity with potential and experience\nclear and reasonable process.high feasibility", "q1r": 4, "q2": "the information provided is sufficient to evaluate the plan mentioned, We lacked time to come up with ideas for the fund\nThe goal is to improve the quality of education, mainly in business schools,\nHave a high project success and measurement index\nClear, creative fact full of data , matching challenges and suggestions\n. I also believe that Blockchain will be fully implemented in our society in the future, so I am concerned about this lack of knowledge. I hope this project is funded to increase knowledge.", "q2r": 4, "assessor": "z_assessor_3171", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 14839, "q0": "Grenoble Ecole de Managemen university is a school with 8000 students of 130 nationalities and is one of the most influential business schools in France, so it is time to start a campaign to spread knowledge about Cardano is a very good move. In general, the plan will be divided into 3 parts including teaching, competition, and onboarding with extremely attractive prizes up to 1000$. Obviously, for a student, this is an extremely attractive amount and will help them a lot in implementing their own project. In addition, the more people participating in the competition, the more people will know about the good sides of the ecosystem and create more diversity for Cardano. For the 2 challenges mentioned by the proposer, I am also satisfied with the solution and have nothing to add. Overall, the proposer did a great job on this part.", "q0r": 5, "q1": "I would like to commend the detailed and thorough preparation of this part of the proposer. The project will be implemented in more than 2 months with very clear and highly linked weekly tasks. The funds used were also fit for purpose and very well explained. In particular, the project has a team of talented and dynamic people. With 2 out of 3 members who have many years of experience directly related to the ecosystem, as well as blockchain, will act as both mentors and judges, then the quality of the winning articles will be guaranteed. The other is a student of Grenoble Ecole de Managemen who will coordinate with team members to spread and advertise the project in their school more easily and quickly.", "q1r": 5, "q2": "In general, the numbers expected to quantify the advancement of a venture and its prosperity show up in this segment. The key metrics and achievements are clear and quantifiable. Also, the milestones clearly align with what the project is going to do. Congrats once to the group for effectively finishing what was mentioned in this challenge of Fund 9.", "q2r": 5, "assessor": "z_assessor_4104", "no_vca": 12, "ne": 1, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Introduce the business students to Catalyst, teach them about the project and the challenges, create a tournament for them to start writing ideas", "experience": "BA business student in Grenoble school of management\nPart of the Cardano community\nWorking with funded proposers : Shlomo Cohen\nCARICATOR ADA \nUnited Caricature\nCollaborating with Razali Samusudin and Cole Bartlett from the Catalyst school and\nwww.sustainableADA.com"}