{"id": 420233, "author": "natdwamena", "title": "Establish Coin Media", "url": "https://cardano.ideascale.com/a/dtd/420233-48088", "category": 26599, "amount": 4500, "description": "The mainstream media provide content and report on bad news in crypto ecosystems. How do we tell our story and present the amazing real-world impact made in the Cardano ecosystem?", "f6_no_assessments": 13, "f6_rating": 4.153846153846154, "videos": [], "media": [], "f6_assessments": [{"id": 5679, "q0": "There is so much workload to engineer young Africans into the blockchain space, due to the potential real world solution they can explore in the blockchain ecosystem in addressing the challenges that faces our continent. In that regard i am really impress with this initiative, well-detailed description of what they intend to do and the value they intend to create to the cardano community. One key area that satisfy me about this project is its focus on addressing the unemployment bit. The real focus here is to project the great works being advanced using blockchain to solve real-world problems that mainstream media would not report on, through interviews, reportage, talk shows and project Digest. This would offer the opportunity to help the team establish and impact students with quality content on blockchain and real-world value delivery. This initiative could be the entry point for young African students into the blockchain ecosystem, especially the catalyst community to help explore the general ecosystem. Given the target audience the project focuses on, ideally i would have wished the team provides a marketing strategy to capture their target audience so as to ease the successful implementation when the project sets off with its project execution. ", "q0r": 4, "q1": "The framework of the project requires specific team experience to ensure effective implementation. Given the profile of the team, a production head, a presenter, programs development and designer are the team formation. The composition of the team depicts clearly the individual roles of each team member in project execution. More importantly, the work experience of the team members is well detailed, with links to their LinkedIn profile confirming their expertise. However, what will be the marketing strategy here and who play such a role. Because a lot of things fight for the attention of students, there ought to be a strategy to attract them to an initiative that seems novel in Africa. Therefore, i suggest that, in the initial stages of the project, the team include a marketing expert for this project. The outlook of the roadmap is great; the proposal clearly states the expectation of the community and what's required of auditors. The framework here is quiet simplified into weeks with specific duration allocation provided for each activity. This gives u a preview of what we should expect within each week to ensure the successful project implementation. The total allocation for the budget  is $4.2K, an amount far below the the limits set for this challenge. It is worth mentioning the systematic and comprehensive budget breakdown for the project, with a feasible structure depicting clearly how the said amount being solicited would be used. However, as suggested here and at the impact assessment section, i expect that if my view on the “marketing strategy is incorporated into the general framework of the project, it should reflect at the budget section with an allocated amount. Beyond this, i think the project deserve this ratings.\n", "q1r": 4, "q2": "We’re told under this project the mechanism that would be deployed to determine how well  will is  performing. Because the platform for the project is Youtube based, the proponent’s focuses on the number of videos, number of students reach, number of views, and number of students onboarding catalyst, as the KPIs for this project. Unlike other projects, the platform for this project provides the needed features on the platform to help determine the performance and progress of the project. However, the information on how the team intends to be accountable to the community is unclear. Also, i suggest the team indicate clearly hoe the general updates on KPIs would be made available to the community to help determine the progress and success of the project. In my view, i’ll recommend that the team create social media channel to better create more engagement with their audience aside the Youtube channel, to update and receive feedback from them. This will help the audience provides suggestions on things they expects the team to address and also serve as source of update from the catalyst community.", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "This assessment great however, there is a misrepresentation of the budget as to 4.2K when it is stated in the budget as 4.5K"}, {"id": 7730, "q0": "By establishing Coin Media to project impacts made in the cryptocurrency ecosystem and real-world impact produced by members of project catalyst that provide evidence-based solutions to a real-world problem, this plan effectively tackles the challenge. Coin Media would be a well-known and committed YouTube channel that offers continuous material, as well as evidence-based decentralized solutions for projects that are making a genuine difference in the real world and addressing issues for the future of the internet. \nThis would make it easier to showcase the fantastic work being done to use blockchain to address real-world issues, which the conventional media would not cover. \n", "q0r": 5, "q1": "Regarding viability, I completely agree that the idea has a good possibility of being successful because every detail has been carefully considered and the community is easy to use. This proposal provided funds for camera equipment to facilitate Coin Media's successful launch. The following would be accomplished within two months (8 weeks). \nTimelines, goals, and milestones are all included in the proposal. It is easy to track the project's success and progress because the plan's steps are all clearly laid out and described. The budget items are also very well explained, covering every part of the budget.", "q1r": 4, "q2": "Every milestone from the first to the eighth week offers a succinct and to-the-point overview, making it simple for me to understand the entire process. Also The $4500 USD funding request and breakdown of all probable costs provided by the proposal's author seem reasonable and essential to reach the objective. Since a genuine need has been recognized, understood, and is being attempted to be addressed by the plan, the resources provided are adequate to track performance. The proposal's author and his team's skills raise the likelihood that the idea will be implemented successfully.", "q2r": 5, "assessor": "z_assessor_2916", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8101, "q0": "This proposal identified one main issue affecting the crypto ecosystem being that the mainstream media always providing negative news about crypto. The coin media this proposal seeks to establish will change the narrative in the crypto ecosystem which is going to expose students to the cardano ecosystem and the younger generation.\n The YouTube base contents which would be provided will present the real-world impact in blockchain technology to its focused audience (students) which will create the needed interest in them and onboard them to the cardano ecosystem.\nThe proposal mentioned workload on production as the main challenge and they're going to overcome it by providing contents on weekly basis which I think is fair since there are student team members.\nThis proposal would be self sustaining as they are going to generate income from the contents being provided on the YouTube channel if and only if they're provide quality contents and are consistent with the contents being provided. ", "q0r": 5, "q1": "The team members working on this proposal have the needed skills such as; production management, photography and videography, broadcasting, programs management, graphic designing to implement the proposal successfully. The breakdown budget provided is reasonable to achieve the set goals but failed to provide budget for computers which I guess the team already have that for the project.\nThe timeline (8 weeks) provided is enough to kickstart the project successfully. There well detailed plan on how to implement the proposal within the timeline given.", "q1r": 4, "q2": "The proposal indicated a clear roadmap and key milestones for it to be implemented successfully. The KPIs (number of; videos, views students reached and students onboarding catalyst) provided are enough to track the success of the project.\nThe YouTube channel provided would enable the will enable the community to audit the progress of the project.", "q2r": 5, "assessor": "z_assessor_2954", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8496, "q0": "This proposal aims to build a media channel (on Youtube) to project the amazing real-world impact made in Cardano and the crypto ecosystem. The goal is to bring justice to the crypto world that was caused by the lack of content on blockchain-based content and the one-sided apocalyptic bias for the crypto world in Africa, bring a positive idea and encourage people’s interest in blockchain, web 3, the digital future and Cardano ecosystem itself. A concept that is (in my opinion) very much aligned with the core values of Cardano. The proposal features a clear problem statement, the entire progress seems to be thoroughly considered. The one difficulty that might prevent the team from delivering the project successfully, I agree that it’s the team workload, and I might want to add two other problems maintaining the consistency of the content and marketing. However, it is minimum and it’s controllable with a good work arrangement and marketing campaign. This proposal could be beneficial on so many different levels in the development of the Cardano Ecosystem, I believe this is a very good use of the funds distributed. I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The core team consists of some people who have a decent knowledge of Cardano and Catalyst, it’s a necessary proof of both expertise and experience is presented in detail. There is a very detailed plan provided in the proposal and milestone. They all seem aligned with the challenge’s scopes. The budget breakdown sounds fair to me and it 100% serves the project. However, to make it more informative, I would like to see a bit more of a \"prologue\" section explaining the background and reasoning behind creating it, especially for the camera equipment since it takes up pretty much 50% of the estimated expense. Moreover, as I mentioned above, I don’t see the team mentioning your marketing campaign/ idea and it might add up quite a bit of expenses", "q1r": 3, "q2": "The team has provided KPIs, however, in my opinion, the KPIs are still not enough to demonstrate your vision of success. I suggest the team work on time-related KPIs, for instance, the number or the frequency of videos every month, the number of views after a month, the number of students who reach out and onboard Catalyst after a certain amount of time running the Youtube Channel. And it’s important to have a goal for your KPIs. A PKIs with time and goal will be more effective in terms of audibility and it also helps the team to keep track of their own progress and make adjustments to their marketing program if they don’t achieve their intended goal. ", "q2r": 2, "assessor": "z_assessor_2989", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8791, "q0": "In terms of impact, it is proposed to clearly define the issue of establishing Coin Media on Youtube and build a solid student base while developing the preparation of the young generation for an interest in blockchain, web three, and the digital future. However, this proposal appears to be still in the early planning stages. Although you identified the need to attract students to create the necessary interest in blockchain technology, it would be better if you showed me your specific plan for this, especially when students are not yet familiar with it. About blockchain, how will you communicate for this channel to attract students' attention, such as communication in university teams or student competitions. In addition, how Coin Media will have a different way of communicating compared to other channels to create credibility and support from students is also something to think deeply about. I believe this is a very good proposal, but it is necessary to carefully understand the behavior of today's students and have a more reasonable method of communication.", "q0r": 4, "q1": "I found that the proposed team has a wide range of careers and good experience in the fields, and the highlight is that you divide the tasks very clearly by the strengths of each member. Regarding the project implementation time, I see you give a detailed plan for each work group. However, there are some jobs that I don't understand why you have a lot of time to do this, such as buying the camera but it took two weeks. That's just a tiny point. The critical point is that I have not seen you give a plan, and the cost of channel promotion, a good product but not known by many people, will be prohibitive. Also, what do you think about a longer-term plan for your channel, such as switching to multiple languages, so that more students from other countries have the opportunity to understand blockchain better?", "q1r": 4, "q2": "The process of this proposal is clear and straightforward. However, I think you need a place to update the project progress for the entire community to know. Measuring \"the number of students passing\" perfectly reflects the video's content and quality. Still, it would be better if you provided more information about grading students based on criteria and forms, such as organizing a contest after each semester. The members involved in the project include members with many years of experience or just students; I believe this generational diversity will help the team carry out this project successfully.", "q2r": 4, "assessor": "z_assessor_3004", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10303, "q0": "This project is about the mainstream media providing content and reporting on bad news in the cryptocurrency ecosystem solving the challenge presented, identifying the real challenge risk. Existing Project Success Indicators Clearly Realistic and Innovative ,: Establish Coin Media and build a strong student audience while developing the preparation of the younger generation for with an interest in blockchain, web 3 and the digital future.", "q0r": 4, "q1": "Progress on clear milestones Complete legal registration\n· Acquire camera equipment\n· Complete the establishment of Coin Media\nand logical meeting to drop the exam · Legal registration, weeks 1-3\n· Website development, 3rd - 5th week\n· Studio background design, Week 5 - Friday\nCamera acquisition, 6 - 7 weeks\n· Program plan, 7-8 weeks\n· Complete establishment\nThe required budget has reasonable, clear and transparent details of expenditures Legal registration\n  Website Development , Camera Equipment , Lighting , Tripod , Team Fee ,\nPotential Team Capabilities With Related Experience Asamoah Kwaku Junior - Head of Production\nNana Osei Bonsu - Cinematography\nAngela Okai-Nartey - Presenter\nNathaniel Dwamena - Program/Project Development\nRichmond Oppong - Style", "q1r": 4, "q2": "Project success metrics The following KPIs will be used to track success\n Number of videos\n Number of students who passed\n Number of views\n Number of students participating in the catalyst station\nClearly realistic and creative\nMatch and complete the team's challenge proposition to establish and impact students with quality content on the blockchain and deliver real-world value Media, economics, law students, people blockchain enthusiasts and active contributors This is a brand new proposition. Established Coin Media to host the weekly impact on the real-world crypto ecosystem and build a strong student base while developing the younger generation's preparation for an interest in blockchain, web 3 and digital future", "q2r": 4, "assessor": "z_assessor_3171", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 11256, "q0": "The proposal sets to establish a YouTube channel named Coin Medio and build a strong student audience base. This YouTube channel will be in English and thus there will be a huge number of reach around the globe. The contents the team wants to cover are blockchain, web 3, and the digital future. Thus, this indeed does effectively addresses the challenge as it would engage to create the needed interest in blockchain technology among the younger generation.", "q0r": 4, "q1": "The team seems to be capable of implementing the proposal in regard to their experiences. There are 2 students on the team while the rest have experience in their relative fields. There are a total of 5 people on the team and they have all been given a proper role for their expertise. The only concern would be the 2 students if they can handle the tasks they are given. As for the plan they set out, it would seem that it is likely that it would be successfully implemented. There will be Legal Registration, Website development, Studio background Designs, Camera Acquisition, Programs plan, and complete establishment. As the focus is a YouTube channel that focuses on interviews, reportage, talk shows, and project digest. There is a variety, which is something appealing. However, an issue would be marketing. There is a lack of one and if there is one then it would help the team grow faster and have a wider scope.", "q1r": 4, "q2": "The information given from the proposal to assess the progress of the proposal is sufficient as there will be a number of videos, views, and students reached. There is also one more indicator which is the number of students onboarding Catalyst, this one seems tricky. As it would seem that there is no means to track those metrics through a YouTube channel. While the success of the proposal will be identified by the team's ability to establish and impact students with quality content on blockchain and real-world value delivery. This metric is hard to assess. A better means would be the interaction on the YouTube channel through the comments, the number of subscribers increasing to a certain threshold, and the consistent increase on number of likes. ", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 11779, "q0": "It is quite clear that “Establish Coin Media” is a good idea, meets the requirements of the challenge “Challenge & Scouted for Students”. The solution proposed by the authors is to establish Coin Media - a Youtube Channel, a web dedicated to providing updated content about blockchain and the Cardano ecosystem to a student audience in Africa. The aim of the solution, the team argues, is to spark student interest in blockchain technology, preparing for the digital future. Personally, I think that the solution for developing information channels and blockchain and Cardano community groups, in general, is not very innovative. A lot of similar ideas have been presented at previous Funds. It is important for the team to come up with really breakthrough and creative ways to make the information channel really attractive, and attract the audience to approach, specifically here are students who love learning technology in Africa. This requires the group to research and analysis of the problems technology students in Africa are facing. For example, what information do they want to be provided with? What are their main concerns about blockchain focused on? How many people have approached Catalyst and become PAs/proposers?.. Personally, I think the team should have a preliminary survey before setting up Coin Media. The survey results will help the team orient the content and target audience more effectively. Regarding the risks encountered, the team considers that “production workload is the main risk to the project”. However, as someone who has spent a lot of time researching Cardano development in Africa, I personally think there are a lot of risks preventing success that the team needs to take into account. Specifically: one is, the risk of expensive internet connection costs, and poor connection quality may limit the student audience from accessing the Channel. Africa is known as a region where people have to spend up to 10-20% of their monthly income on internet connection costs. The second is the risk of not attracting the attention of students because many students in the area have financial difficulties when studying. They have to find a way to work to cover their study costs. To overcome this, I suggest the team consider setting up a prize fund to develop the community through minigames on the Channel. My rating is 3 points, deducted -2 point because the idea given is not really outstanding.", "q0r": 3, "q1": "The process and budget for implementing the solution are outlined, which I personally think, is quite simple and sketchy. The implementation time is estimated by the team to be 8 weeks. In it, I find it quite confusing when some simple content takes a long time to complete. For example, buying a camera takes 2 weeks (weeks 6-7)? The final milestone of the plan is to complete the establishment of Coin Media in the 8th week. Also, I did not find any information in the roadmap about the plan to reach out and develop the Channel after its establishment. This in my opinion is a major shortcoming, affecting the feasibility of the solution. Personally, I suggest, the team should make a full plan of 3 phases (minimum 3 months) to develop the Channel. In which, the first month is to complete all the preparations and promote the establishment of Coin Media. The second month should be spent developing channel content, community marketing, and receiving feedback for editing and improvement. The 3rd month is to accelerate, grow the number of new people to the Channel, and maintain the number of regular Channel followers. Regarding the implementation budget, the items in my opinion are not really reasonable and clear. I could not find the specific unit price and the number of accompanying explanations. About the team, includes 5 members with information profiles and reference links quite complete. However, the overall feasibility of this proposal I do not appreciate. My score is 3 points, I have made deductions -1 point because the route is not reasonable, -1 point in the budget is not clear.", "q1r": 3, "q2": "Regarding the auditability of the solution, I did not find any necessary metrics to measure the success of the proposal. The team has indicated 4 indicators, namely: the number of videos, the number of students who pass, the number of views, and the number of students participating in Catalyst. The project has products namely Youtube Channel and a website. The community can track the team results achieved through these platforms. Unfortunately, however, there is no committed figure for each of these indicators. This makes it very difficult for the community to understand exactly what success will be expected of the project. My rating is 4 points, -1 point deducted for lack of success metrics.", "q2r": 4, "assessor": "z_assessor_3279", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12077, "q0": "The proposal \"Establish Coin Media\" identified an issue in the challenge and that problem had a wide impact on the community especially the students It presented an issue in the development of the community. Cardano coin, the proposed issue matches the challenge, the mainstream media provides content and reports on bad news in the crypto ecosystem. How to present great real-world impact in the Cardano ecosystem? This project will help answer that question. Please present the problem clearly and convincingly. It offered solutions to a problem in the growth of the Cardano community, which was the growth of a stronger student audience. The solution is to set up Coin Media to host the weekly impact on the real-world crypto ecosystem and build a strong student base while developing the younger generation's preparation for the future. with an interest in blockchain, web 3 and the digital future. The proposed group gives specific examples in the presentation with feasible and effective arguments. The African media, for example, provide little or no blockchain-based content, quickly reporting price movements with doomsday trends for the crypto world. This project in effect will present and digest the Cardano ecosystem as well as individuals who are leveraging the project's catalyst to provide solutions to related problems in Africa. The specific goal you suggest is: Create Coin Media and thereby attract students to create the necessary interest in blockchain technology in the younger generation. Coin Media will be a media with blockchain-focused programs, real-world current impact, and developing African youth readiness for a digital future..You pointed it out. risks in the process of performing the work and have solutions to overcome and limit those risks. The risk you refer to as predicting production workloads is the primary risk to the project and your solution is to find ways to mitigate this and build consistency by delivering weekly content for channel. This will help give student team members time to pursue their academic work while adding value to the project. In addition to the above risk, I find that you need to identify more risks that many other proposals also raise, it is true, it is the price movement of ADA Token in the market and the solution needs to be more detailed than the plan, additional reserve fund. I rate: 4 points.", "q0r": 4, "q1": "The proposal sets out timelines such as week 1 - 3, week 3 - 5, etc., clearly associated with the beginning of the specific work. Regarding the timeline, the proposed team presented a target plan towards completing legal registration, acquiring camera equipment, and completing the establishment of Coin Media. The results in the implementation of the proposal are easy to check and continuously update through video products on popular social networking platforms such as Youtube of the proposed team. It is proposed to account for 5% of the fund's budget ($4,500) and have a reasonable spending plan for each specific activity. Have a detailed, specific, clear and transparent budget allocation plan. But I think you need to add an additional project plan, the project will be more complete. However, an additional provision is needed in case more videos are shared than expected. Then propose to assign specific tasks to each member; have experience related to the assigned task; the identity of team members is easy to verify and most importantly they are young people who are passionate and enthusiastic about their work. The proposal also analyzes the tasks for each specific, suitable and highly specialized group of members, each group will be in charge of a public department. Work is based on the ability and experience of each team member. List of core groups and easy to identify members, with YouTube links, telegram accounts, Linkedin, Facebook. I rate: 4 points", "q1r": 4, "q2": "Proposals provide KPIs, making it easy to accurately quantify a proposal's effectiveness and easily test it. The proposal has four metrics/KPIs to measure the performance and progress of a Youtube project. The success of the proposal clearly describes the results achieved with the number of videos, the number of students passing, the number of views, the number of students participating in the catalyst. Metrics/KPIs that are easy to measure and test (videos, watch time, rate watched, new subscribers). Accessible anytime, anywhere clearly display the number and results of work. The goal of the proposal is the team's ability to establish and impact students with quality content on blockchain and deliver real-world value with the most impact on the Africa region. The proposal has never been funded, but the participants have a lot of experience in previous Funds. If funded, the proposal could be in the top 10 percent to be voted on. In my opinion, this proposal is a great success helping young generation students - who are about to create their own home in the future have interesting ideas and more motivation to start a business and develop based on the cardano platform. It is their thoughts, choices, and actions that will determine the better change of the future world. Not only that, the proposal is in line with the United Nations' Sustainable Development Goals SDG 4 to ensure quality, equitable and inclusive education and promote lifelong learning opportunities for all. . I rate: 4 points", "q2r": 4, "assessor": "z_assessor_3353", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 12433, "q0": "I would like to give thumps up to the planners and developers of this idea. It is one of the best because of the weekly engagement with the targeted interest in blockchain technology. The idea of this proposal creating a platform which will serve as an avenue for students to gain experience in media work, develop analytical and research writing skills is the way to go in scouting talents for Blockchain technology. However, clarity on getting students to appreciate and get onto the YouTube channel is vague. I think the contributors involved should organize a symposium for students in various tertiary institutions across the country encouraging them to get onto the YouTube channel and explain the need and importance of that channel to them as Blockchain technology is concern. By so doing, 70% of their success has been achieved. ", "q0r": 4, "q1": "Sure, it is highly possible this proposal will be implemented successfully. The experience of Angela Okai-Nartey, an executive director of the ladies network for economic freedom is very recommendable for such a project. Public speaking and control over grammar, and knowledge in-depth as blockchain technology, digital marketing and community advisor is concern is one of the best tool to draw the attention of females to compete the dominance of males in the field of technology. Also, detailed plan outlined shows how vested the team is in the media world and how best their talent can be exhausted. ", "q1r": 5, "q2": "The project is a silver to gold standard in terms of audibility. The proposal shows how organized and transparent the team is. The clarity of the proposal is on point and would rate it 90%. A little push is expected to blow the minds of everyone. Good work by all standard and kudus to the team for such a brilliant idea. The information provided is quiet sufficient to audit the progress and success of the proposal.", "q2r": 4, "assessor": "z_assessor_3411", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 12966, "q0": "The proposal addresses to Create Coin Media and expand its student audience while preparing the next generation to be interested in blockchain, web 3, and the future of digital technology. The project will include a dedicated YouTube channel with regular programming and decentralized, evidence-based solutions for initiatives that have a real-world impact and address issues for the digital age. In order to generate the necessary interest in blockchain technology among the younger generation, This proposal is useful .The proposal enhances the cardano eco-system. The proposal is able to scale to addresses the future challenges.", "q0r": 4, "q1": "The proposer have  provided a detailed plan, including timeline and key milestones for implementing the proposal. The proposer have provided the details of the team  and the links of their works .\nThe team looks professional and also mentioned the skills which are needed to implement the proposal. The Timeline provided is very realistic and the Budget breakdown is good, The proposer needs to work on the Budget looks bit high. The Approach to the challenge is great the proposal have considered the relevant risks and challenges for the successful implementation. Upon reviewing the proposal i agree that the proposal is likely to be successfully implemented.", "q1r": 4, "q2": "\nThe progress of the proposal can be tracked by the looking at KPI's like Number of Videos, Number of Views, Number of Students Onboarding Catalyst etc.\nThe proposer have provided the clear understandable description of the challenge and The approach for the successful implementation is described.\nThe Metrices/Kpi's mentioned in the proposal define the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 13391, "q0": "Establishing Coin Media is a good proposal and suitable for this challenge for students full of positive energy for a new dimension for blockchain and Cardano ecosystem.\nBesides technical and technological issues, Communication work to help people get more information about Cardano is very necessary to expand the network and users, I love your suggestion. And hope this project will be funded by Catalyst fund.\nEspecially the communication right in universities and colleges, because students are young generation, know how to seize opportunities and have many educational backgrounds to absorb and contribute to the development of the Cardano community.\nAnd in your suggestion, I only see the promotion on the Youtube channel, I have an additional contribution as to why not set up a Facebook channel such as creating a Fanpage or Group for the community to exchange and interact more easily, because the interaction I find it more intuitive on Facebook than on Youtube, on Youtube, it is more about making content about information, tutorials and passive viewers than interacting on Facebook, although on Youtube there is also a comment function.", "q0r": 5, "q1": "You have shown the roadmap to develop your Media channel, but I have an additional suggestion that to develop the Web site, what platform do you plan to develop or program yourself, I still recomment the use of Wordpress because it is easy to use.\nAnd whether the cost of $ 500 to develop a website is whether you have divided it into details because often with a Website, it is necessary to maintain hosting and domain fees.\nSetting up a Website requires costs such as:\n   - Buy domain name, and renew\n   - Hosting or VPS\n   - Buy Theme, buy Plugin and Security Plugins if needed\nLearning a little more knowledge about SEO is also good to aim for the Web to have more interaction, then attach the Links of Social channels like Youtube and Facebook in the footer of the Website to have a connection,\nIn the Youtube channel, you should also put the Website link in the description, in the settings of Youtube.", "q1r": 5, "q2": "- Almost all measurement indicators such as the number of Videos, the number of students passing, the number of views, the number of students participating in the interaction are enough to measure the progress of the project.\n- Very well, I also wish that my student days would have been better if I had been exposed to Blockchain earlier, once again I wish you all get the fund and better yet the successful project in reality.", "q2r": 5, "assessor": "z_assessor_3616", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 14899, "q0": "I found that the team presented each topic clearly and easily to distinguish, in the first sentence the team also wrote a very clear and easy to understand summary solution. Proposal also shows the benefits that Establish Coin Media brings to students and in the future, which shows the project's interest in young generations a lot. Next is the detailed plan,the team gives very good evidence, but I have not seen the characteristics of the audience that the team is trying to reach. I think doing the project on the Youtube platform is very good because this is the most popular platform in the world and people spend a lot of time on it,the team also knows how to take advantage of blockchain to develop the project. In terms of strategy and sustainability, I found the team to come up with very good ways and have clear goals. Proposal wants to achieve that result is \"prepare among African youths for a digital future\" and I see the team has set out a way to do that. Every content the team offers, I see a very detailed analysis and introduction, with even the smallest parts but also taken care of. At the end the team also presented the onboard in a convincing and feasible way. The team took the risk that it was “workload on production” and I found them quite reasonable because if there is too much work that cannot be completed, the project is not completed. project cannot be completed. Proposal presented good workarounds that are both beneficial to the project and the user case.", "q0r": 5, "q1": "Proposal presents a fairly complete roadmap along with detailed content and an intended time. There is also a Key Metrics section so that it can be used as a milestone to complete the stages. But I think adding a few more ideas for the more detailed stages would be perfect. For example, \"Legal Registration\", the team should further explain how it will happen, what conditions are needed or not. The other stages should also be presented in a similar way. Each number is clearly presented with specific price figures so it is easy to understand and reasonable. I think the items to be paid by the team were presented well but I think it was lacking for advertising and design. And finally the team gave the total number. The project provided full profile information of 5 members. very detailed tablets. I believe these talented people will help the development of the proposal.", "q1r": 4, "q2": "The content that the team gives to measure is closely following the progress of the project, because it is done on the Youtube platform, I will definitely pay attention to the views and I see the team can present. There is also the number of videos and students reach are also two important things to follow. I recommend more about the number of old people who successfully introduce new people. The team defines success very reasonably and specifically. Regarding the impact on students on blockchain and real-world value delivery, this is very true and relevant to the project.", "q2r": 5, "assessor": "z_assessor_4108", "no_vca": 11, "ne": 3, "ng": 7, "nfo": 1, "vca_o": 1}], "solution": "Establish Coin Media and build a strong student audience base whilst developing preparedness among the younger generation for interest in blockchain, web 3, and the digital future.", "experience": "Team of media, economics, students of law, blockchain enthusiast, and active catalyst members since Fund 7."}