{"id": 421331, "author": "gilvania", "title": "Cardano for STEM Brazilian students", "url": "https://cardano.ideascale.com/a/dtd/421331-48088", "category": 26599, "amount": 5000, "description": "There is a lack of courses on blockchain in Brazilian Universities leaving our students out of these technological advances. Most educational contents are in English, but Brazilians speak Portuguese.", "f6_no_assessments": 27, "f6_rating": 4.246913580246914, "videos": [], "media": [], "f6_assessments": [{"id": 3403, "q0": " This proposal plans on creating a new course on blockchain and cardano to the students of the college of  Science, Technology, Engineering and Mathematics, university of Pernambuco. And this in Portuguese, which the native language of those targeted potential participants (students). The learning from this course will be an addition to the knowledge of students, and they can apply this technology to improve fields such as cryptocurrency, supply chain, data management, healthcare, governance, and others.\nThis demonstrates that the proposal is impactful and aligned with the challenge objectives, since after taking the courses, some students may decide to get involved into the catalyst and cardano ecosystem and apply for funding for some related projects.\nI would rate this with a 5 star.", "q0r": 5, "q1": "The proposer is a doctor in Physics and an associate professor at a Brazilian Engineering College (Pernambuco University), with experience in condensed matter physics, computing, and data analysis, which shows she understand the basics around the blockchain, but she hasn't had previously any work in and around the catalyst project. This may be a challenge for her as she'll have to learn and get familiar with the catalyst process.. \nThe budget breakdown covers main project expenses, but amounts allocated to the  Books expenses (USD 250); Marketing (USD 200); Websites (USD 100); Services (USD 250) seems low, especially since the projection is to make Pernambuco university becomes a pioneer hub on courses in Portuguese around cardano and the blockchain in Brazil. Increase these amounts in a perspective of sustaining the availability of the course, and why not diversify the types of courses, exploring various topics within the cardano blockchain.\nThe proposer would have thought of adding few more people to her team, to decrease  the workload, but also increase collaboration. Catalyst philosophy being also based on \nteam work.\nWork experience and expertise of the proposer would help the team to make this proposal a success, and as it's presented, the project is feasible, except elements I raised above.", "q1r": 4, "q2": "being a continuation of a proposal funded in fundd-7 (https://cardano.ideascale.com/c/idea/381790) would help the community to continue following the implementation, but the proposer doesn't detail how will this ne done, by  which mechanism.\nAlso, for indicators of success I would mention the number of students registered to the course, which wasn't mentioned.\nI would rate this with a 4 star.", "q2r": 4, "assessor": "z_assessor_2458", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 13400, "q0": "1. The proposal quite effectively affects this challenge. It was designed in detail, giving us all possible and necessary information. From the very beginning, the goal was explained to us, which is to spread knowledge about the Cardano platform to Brazilian students who are unable to follow these workshops in English. The goal is quite realistic and useful, not only for the Cardano platform, but also for the students of the Brazilian University of Parnambuco. The intended audience of this proposal is young students of engineering and natural sciences, who will later be highly qualified members of the Cardano ecosystem. In addition to expanding knowledge about the Cardano platform to Brazilian students , the aim is to expand that knowledge throughout Latin America. The knowledge that the participants get is within the framework of cryptocurrencies, data management and the supply chain.", "q0r": 5, "q1": "2. The plan as a plan is very well stated, not even the smallest details have been left out. This proposal contains a detailed financial and time plan. The budget is limited to 5000 dollars, which is not a large amount available. It is quite enough for implementation. The students of the workshop are guaranteed free of charge, entering their school plan and program, so they are not at a loss even in terms of time. Preparations and the implementation of the proposal itself is limited to a couple of months, which is quite enough. and will participate. The workshops are planned to be online, which again suits the students. The classes will last 10 hours, without losing free time for the students. The measures are also detailed.The number of views and accesses on the platform for online classes, as well as the number of questions asked, would be measured.", "q1r": 5, "q2": "3. The information provided is sufficient for the realization of this proposal. The main contact information of the persons who would be responsible for the work on this proposal is written in detail. The persons have all the criteria suitable for the realization of this proposal. The links of the online application are listed, which will be from used in the implementation of these workshops and classes. The budget is detailed, not missing any possible detail. The amount of information is quite sufficient for a project like this.", "q2r": 5, "assessor": "z_assessor_3617", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 12971, "q0": "The proposal is about to introduce the \ncardano ecosystem to the Undergraduate and graduate students in the STEM fields of science, technology, engineering, and mathematics (STEM) in Portuguese. This proposal seeks to offer free, Portuguese-language courses on Blockchain and Cardano from a scientific standpoint to engineering and natural science students. This challenge will be addressed by the suggested solution, The information will be freely accessible online. The proposal identifies a problem within the challenge which needs to be solved .The proposal makes it crystal obvious how it will improve the Cardano ecosystem. The proposal's key metrics and objectives line up with the specified challenge settings. The plan can be scaled to deal with upcoming difficulties.", "q0r": 5, "q1": "The proposer have described detailed plan including timeline and key milestones for implementing the proposal. The proposer have provided the detailed plan in the description which can be more elaborative .\nThe proposer have mentioned the budget a bit high and need to work on that , Other then that everything looks fine. The proposer have mentioned the skills and the experience which is needed to implement the proposal .\nThe resources that are needed to complete the proposal has been addressed . The proposal offers realistic time table to complete the project. The proposer need to work on the budget part it can be slightly reduced .\nThe proposer have considered challenges and risks relevant to a successful implementation .", "q1r": 4, "q2": "How the proposal can be tracked has been explained by the proposer. The number of accesses and views on the online learning platform can be used to track the proposal. queries submitted to the Q&A service, student comments. The proposer have described the clear understandable description to the targeted problem .\nThe proposer have also mentioned the Metrices/Kpi's that define the success of the proposal. By assessing the proposal I agree that this proposal provides me sufficient information to asses the progress in attaining the stated goals .", "q2r": 4, "assessor": "z_assessor_3521", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 12581, "q0": "The problem in the challenge that needs to be addressed is that the lack of blockchain courses in Brazilian Universities makes it impossible for students to avoid these technological advances. Most of the educational content is in English, but Brazilians speak Portuguese. Will offer an introductory course on Blockchain and Cardano at a Brazilian University. Classes will be part in-person at the University of Pernambuco, Brazil and part zoom online for a total of 10 hours. Introducing blockchain and Cardano technology to STEM students will advance this field of research and its applications in organizations, companies, startups, and communities, thus adding value. for the Cardano ecosystem. The main goal of the proposal is to attract highly qualified new Brazilian members to the Cardano ecosystem. Providing knowledge of blockchain and the Cardano protocol will revolutionize the way STEM students deal with challenging issues on a daily basis. This proposal can be scaled up to address future challenges. I completely agree with the impact of this project, I rate it 5* and believe it solves the challenge in a good way and is effective.", "q0r": 5, "q1": "Gilvania is the proponent, she has been teaching STEM classes since 2007. She is a spintronics researcher and has been collaborating with the Massachusetts Institute of Technology, USA since 2017. With the digital budget that the proponent has proposed. Proposal request : 5000 USD, this is a suitable budget to achieve success. Proposer also outlines and breaks down the items that can be identified. and the key to the proposed implementation. Get the tasks you need to do for the month. Milestones February and 3: Materials, Lessons & Challenges, this month the proponent also outlines tasks to do for the month. proposed by the proponent is minimal. The members are highly qualified in their work. The content will be available online and with free access. The course will be offered to Brazilian STEM students in their native Portuguese.", "q1r": 5, "q2": "As mentioned in the feasibility of the project, there is a roadmap for implementation in 3 months with specific goals to be achieved according to each defined timeline. In Brazilian academic circles, there are not many projects that popularize blockchain technology. Now is the time for students to learn about blockchain and Cardano from a scientific perspective. This is also where scientists and professors have to step in. With the hope of the University of Pernambuco becoming the center of educational content in Blockchain and Cardano. This is not a brand new project but this project is a continuation of a project funded in Fund7 (https://cardano.ideascale.com/c/idea/381790). With the solution it will be is offered an introductory course on blockchain technology and Cardano in Portuguese for undergraduate and graduate students in Science, Technology, Engineering and Mathematics, the solution given is suitable for solving Problem posed, I rate good clarity, give all necessary information, I rate 5 *.", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 12148, "q0": "The proposal has the main problem a lack of courses on blockchain in Brazilian Universities leaving our students out of these technological advances. Most educational contents are in English, but Brazilians speak Portuguese. The program will be offered an introductory course on Blockchain and Cardano at a Brazilian University. The audience will be Brazilian STEM undergraduate and graduate students, and the lecturers will be doctors in Physics. The target audience in this course has a big enough impact to spread knowledge quickly. In any country, students are a source of public information that can be trusted by the community and they have a certain way of explaining complex information to be applied in easier language.", "q0r": 4, "q1": "The proposer references related to the program they will do in this project they also enter data on team members who will carry out this project this proposal only includes the lead of the team but this is quite clear because it adds a detailed link to find out the profile of the lead, they ask for a reasonable budget for the workshop for 4 months but they didn't describe their budget details, the timetable presented is quite good with clear program highlights, but they describe it in the explanation \"how your proposed solution will address the Challenge that you have submitted it in.\", and they confident that the workshops they hold will succeed with the goals they set.", "q1r": 4, "q2": "They have KPI to measure their performance but they didn't write the targeted number to be standard successful in their program, This proposal is focused specifically on disseminating blockchain technology in Brazilian academia, and explanations related to the goals and solutions have been described quite clearly. They are should to describe their milestone more detail and for the KPI should be detail. ", "q2r": 2, "assessor": "z_assessor_3362", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 11320, "q0": "The proposer here has a really good idea around helping Brazilian's to learn blockchain and the Cardano system of blockchain technologies. They would like to educate students in Science, Engineering, Technology, and Mathematics (STEM) basically for free!\n\nThis has a very high chance of success and would definitely address the challenge that it is presented in. This has a high chance of igniting and educational fire within Brazil and Latin America that would spread out to various communities. \n\nProviding knowledge about blockchain and Cardano protocol will revolutionize how STEM students deal with challenging daily problems and ultimately have a profound effect on the Cardano blockchain as well as Latin America perhaps pushing Cardano to new heights in this area.\n\nFurthermore", "q0r": 5, "q1": "With the milestones presented, plus the background of the proposer (Gilvania Vilela) (see the linked in link in the proposal (will need to use google translate to get it into your language)) this proposal is highly likely to be implemented successfully. She has been teaching since 2007.\n\nSecondly, they are not asking for much financial help ($5,000), and the classes would be done on a zoom meeting with help after class as well as engagement in the Cardano community. Finally, the classes would be free for the students making it much easier to educate more people which in turn could turn into engineers for Cardano in the long run. There is no real \"risk\" involved in this proposal and should be easily implemented. ", "q1r": 5, "q2": "The information provided is very sufficient in auditing the progress of the proposal. We would easily be able to monitor where the project is at in its path to success through\n- Books that are brought forth for the classes\n\n- Marketing \n\n- A Website(s) being developed or completed\n\n- Services being acquired\n\n- A working class on zoom or in the university.\n\n- Number of access and views on the online class platform\n\nAs well as student numbers. The auditability should be very easy, and the project should not take long to have up and running.", "q2r": 5, "assessor": "z_assessor_3237", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11262, "q0": "This proposal effectively addresses the challenges and does find means to scout more students towards the Cardano blockchain. As the proposer is providing an introductory course on blockchain and Cardano technology to Science, Technology, Engineering, and Mathematics (STEM) undergraduate and graduate students. As an academic approach is necessary for scouting high-qualified individuals for the Cardano ecosystem this means would be the best in onboarding and igniting discussions and interests. Students talk and if the course is done correctly through word-of-mouth more individuals will be keened in said topic. This would then create a snowball effect where more and more university students would want to learn about then Blockchain and the Cardano technology. In addition, as the lecturers are highly qualified for the work the community does not have to fear that the job is done improperly and we lose people instead of gaining and the content would be free and available online. This would likely increase the number of individuals enroll, thus making the aforementioned snowball effect bigger.  ", "q0r": 4, "q1": "The individual that put up this proposal received funds in Fund 7 of the Catalyst. This is a continuation of that funded project. The initial finding was a success and it is stated that those students are looking forward to more. Glivania is the individual that wrote this proposal and has a Ph.D. in Physics in addition she is an associate professor at a Brazilian Engineering College (Pernambuco University), with experience in condensed matter physics, computing, and data analysis. She has been teaching technology, science, mathematics, and engineering courses since 2007. Furthermore, she is also a researcher in spintronics with experience in collaborating with the Massachusetts Institute of Technology in Cambridge, since 2017. This individual is very experienced in academic fields and has a long list of experiences. As stated previously, this would not be her first encounter with teaching regarding blockchain tech as her previous proposal has been approved and carried out. In regards to the plan that was presented in this proposal, it is well thought out and so is the syllabus that is planned for the individuals that participate in said course. There is a 3 months course planned. The first month is mainly focused on course preparations. Such as informing STEM students about the course, communicating with the community through Twitter, Facebook, Telegram, Slack, Instagram, and discussions, selecting the students, preparation of the class, and registration of the students. As for the following 2 to 3 months, it will be focused on materials, lessons, and challenges. Such as the initiation of the course, weekly classes on online platform, interaction and guidance with the pupils, test and scores preparation, motivating the pupils, monitoring group discussions on relevant topics, and finally the course closing. Based on the experience and plan presented it is highly like this proposal will be implemented successfully. ", "q1r": 5, "q2": "The proposal provided the following means to assess the progress of the proposal. The number of access and views on the online platform, the number of questions on the Q&A service, and the students' feedback. These means are sufficient indicators for the progress of the proposal. As for the success of the proposal, the proposer has given the following method. The University of Pernambuco becoming a hub of educational content in Blockchain and Cardano. Indeed this approach can assess the end goal of the proposal. However, there should be more means to assess this. Such as an uptick of interest amongst the community for new courses, which can be measured by having an online platform ready for enrollment on the course through the university. This would show that more individuals are interested in the course from word of mouth through the participants of the previous courses. ", "q2r": 4, "assessor": "z_assessor_3233", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 11195, "q0": "Yes, 5 stars because I believe that they are targeting the proper audience.  The students that are in STEM are the best and brightest the university has to offer.  It would be amazing to help them all learn about Cardano.  The marketing of this coarse needs to be really good to get as many as they can into this free program.  It is also great that they will be lectured to in their native language.", "q0r": 5, "q1": "Yes, I agree with 5 stars that this program will be completed successfully.  You have a highly experienced educator and lecturers that will be zooming the students.  Students that are interested get to take the entire coarse for free, which is a huge bonus.  As long as they can effectively promote the coarse and keep the students engaged, they will have a great group to teach.", "q1r": 5, "q2": "There was not much mention of how they would audit the success of this project.  I see several factors as keys to success for the proposal.  1) A large number of students that show up for the classes. 2) Good grades reflected on all of the quizzes and tests. 3)  Reports from the students on the quality and satisfaction of the coarse.", "q2r": 5, "assessor": "z_assessor_3230", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 11091, "q0": "Learning blockchain technology is the foundation for the next generation of Science, Engineering, Technology and Mathematics (STEM) students. Despite this, there is still a shortage of these courses in educational institutions in Brazil today. In response to that situation, you make a proposal: \"Provide an introductory course on blockchain technology and Cardano in Portuguese for undergraduate and graduate students in Science, Technology, Engineering and Mathematics (STEM) This proposal aims to provide free lectures in Portuguese to engineering and natural science students on Blockchain and Cardano from a scientific perspective.\" The risk of the proposal is not too great, I see this as a highly viable proposition.", "q0r": 5, "q1": "I completely agree with your solutions that must be carefully prepared in terms of materials for the course. You should design cross-chain documents to attract more students of other blockchains to participate. The way the class is organized has had an innovation that increases interaction with students and supports after-school questions; Prepare tests and scores. This is the way to organize the class in order to best promote the students' positivity in each lesson. What I completely agree with you is that at the end of each course, students are granted a certificate to record the results achieved by the students after the course. I see that the detailed budget analysis for the project is not specific, you need to clearly state each spending item so that we can see the appropriateness and effectiveness of those expenditures. Currently, there is only one member participating in the project, in my opinion you need to find more partners to be able to implement the proposal as planned.", "q1r": 5, "q2": "Your detailed plan is implemented in three months, in my opinion you should clearly state the specific work in each month and how to control the progress of the project according to the plan for specific, clear and transparent. The success of the project according to your description is not clear and specific. In my opinion, the success of the proposal must be the number of students trained and participating in the Blockchain, the number of proposals from students accepted.... Hope you will add adjustments to make the proposal more complete. This project is a continuation of a project funded in Fund7 that I see a very high probability of success. I support you.", "q2r": 5, "assessor": "z_assessor_3216", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 10201, "q0": "The group has raised the problem and the appropriate solution to the challenge, but it is still missing in the risk section. The risk part has not been focused on. I can mention risks such as ADA fluctuations, why not use teachers with expertise in the field of information technology but choose the field of physics?", "q0r": 4, "q1": "This part is not as good as the previous part. I have not seen any section mentioning the collection of knowledge about the course, for example, what knowledge is collected, where is it collected? The budget section is not detailed in terms of amounts such as $4200 paid to professors (I only see mention of an associate professor named Gilvania), that is quite a large amount for one person, how many work hours? And the group has quite limited human resources (1 person).", "q1r": 3, "q2": "The team has stated items to measure progress, but I need specific numbers for this, and I don't know how to track the progress of the project, please add a GitHub link or any other Relevant documents or online reports are constantly updated so that I can track the progress of the project.", "q2r": 3, "assessor": "z_assessor_3165", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9659, "q0": "The proposal is very well stated and aligned with the description of the challenge. It is focused on the generation of a training program in Portuguese, an extremely necessary aspect to generate adoption of the new blockchain paradigm, and specifically in Cardano, in a large area of the LATAM region. Although the proposal has a local approach (only Brazil), it is scalable and replicable to other parts of the world. ", "q0r": 4, "q1": "There is a high degree of certainty that the course, object of the proposal, can be carried out without any inconvenience by the proponent, given its high level of training and experience in several disciplines related to blockchain and web3. In addition, taking into account that this proposal is a continuation of a proposal in Fund 7 ", "q1r": 5, "q2": "The metrics for measuring the success of the proposal are exactly the same as for the Fund 7 proposal. Analyzing the content of the program in the current proposal and comparing it with the proposal funded in Fund 7, it can be seen that they are almost the same (more limited for the current proposal). However, it would be necessary to have the reports related to the performance in the proposal funded in Fund 7 (not published in this proposal), taking into account that this \"second stage\" is very similar to the previous one (Fund 7).", "q2r": 3, "assessor": "z_assessor_3079", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8926, "q0": "Since Brazil is one of the largest country in the world, spreading knowledge on blockchain is very important in such country, so the proposer wants to bring a online course in Portuguese which is a great idea , the professor has great idea of selecting students at first, because most of the randomly selected students will loose interest over course eventually , completing such half way course is useless. hence, the idea of selecting students and helping them to understand in native language is a great idea.", "q0r": 5, "q1": "The mentioned task has minimal risk involved in it , where selecting the students and setting up a online classes for students can be achieved without much difficulty, the proposer herself is an professor and she has a teaching experience of over 15 years which is great to hear, she can use this experience to make students more comfortable in learning the new topics, the task also involves in adding assessments, where proposer can make unique way to assess students, so that students find it fun in learning on block chain projects. hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has presented clear goals of the proposer, which involves mentioning basic topics which are needed to cover at the first phase of the project, the proposer has even provided details of her experience, and her previous collaborations with MIT.\nThe proposal has clear idea of selecting students, maintaining assessments, which is needed, it also has proper budget breaking idea and detailed timeline to complete the project. hence, The information provided is sufficient to audit the progress and the success of the proposal.\n", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 13451, "q0": "\nBrazilian Universities lack courses on blockchain which has left  students out of many technological advances stemming from blockchain. There is also a major problem of language barrier as most educational contents are in English, but most  Brazilians speak Portuguese. This has led to very low interest in blockchain technology among many students and institutions. This proposal offers  an introductory course on blockchain and Cardano technology  to Science, Technology, Engineering and Mathematics (STEM) undergraduate and graduate students. This will be done by  providing free lectures, given in Portuguese for engineering and natural science students about blockchain and Cardano from a scientific perspective.  Introducing Cardano blockchain technology to STEM students will spark the interests of students and stakeholders, and make them see the relevance of  blockchain technology in  institutions, companies, start-ups, and communities. This will help to increase the presence of Cardano in South America and onboard more people.", "q0r": 5, "q1": "This proposal is a continuation of a project that has previously been implemented successfully. The plan for the project is that classes will be part in-person at the University of Pernambuco, Brazil, and part on the online platform zoom with a total of 10 hours. These classes will run for a period of three months per semester by highly qualified lecturers who are doctors the field of physics and have relevant expertise with Cardano blockchain technology. The set budget is reasonable and can be used effectively to achieve the goal of the proposal. It is thus evident that the proposal is very likely to succeed.", "q1r": 5, "q2": " Information evident from the feasibility and auditability categories is enough to show that the proposal can be audited successfully.  These categories describe extensively, the implementation procedures, the metrics used to measure success and key performance indicators.", "q2r": 5, "assessor": "z_assessor_3648", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 8368, "q0": "The proposer has taken a very good initiative of introducing courses on blockchain and cardano to the university students in Brazil in Portuguese language as the proposer has mentioned that many people do not speak english in brazil and introducing the courses in their local language in university curriculum will benefit a lot of young minds in gaining knowledge on these future technologies and build interest in students to pursue carrer in these fields. The proposer has identified the need for introducing a curriculum in universities for portuguese speaking students to gain knowledge on blockchain and cardano. By doing so, the proposal will benefit more numbers of students and gain more users to the Cardano community which will in turn increase the value of cardano ecosystem and its users. The key metrics specified in this proposal gives a better understanding and defines the success of the proposal and is aligned to achieve the goal. The proposal can be scalable to address the future challenges as it can be implemented world wide with different languages.", "q0r": 4, "q1": "The proposer has provided enough information to support their experience required for this proposal but has not mentioned about the team members and their experience which would have been better if mentioned. The proposer has not provided enough reference links to support their proposal. The budget has been mentioned clearly which is 5000 USD and is reasonable for this proposal . The proposer also offers a realistic time to complete the proposal as they have the necessary resources for successful implementation. The proposer has also mentioned the challenges or difficulties faced during implementation of the proposal and has considered them and is prepared for the successful implementation of the proposal.", "q1r": 3, "q2": "The proposer has provided a roadmap with the steps for the completion of the proposal within the specified time and the provided information is sufficient to audit the progress of the proposal after the funding and is doin g a very good job of educating students about the future technologies in their local language. The key metrics mentioned in the proposal defines the parameters for success of the proposal. The proposer has identified the problem and has provided a solution that addresses the problem which is most likely to succeed. The proposer has provided all the necessary information and has analyzed the problem to be solved efficiently. Hence I feel the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_2976", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 8032, "q0": "The problem that the petitioner wants to address is that there is a lack of courses on blockchain in Brazilian universities. As a result, students ignore these technological advances. Most of the educational content is in English, but the Brazilians speak Portuguese. The petitioner aims to address this issue by offering an introductory course on blockchain and Cardano technology in Portuguese to undergraduate and graduate science students. (VOICE) The blockchain and Cardano introductory course will be offered at a Brazilian university. Some of the lessons will take place live and others via the online platform zoom. This proposal could have a positive impact on the Cardano ecosystem if many universities will take advantage of these translated courses. The main goals included correspond to the challenge setting outlined. No risks are included. It might be useful to take the risk that other universities may not be interested in these translated courses.", "q0r": 4, "q1": "The petitioner's relevant experience and skills are included in the proposal. You can check her experience on linkedin. Gilvana is a senior lecturer at Brazilian Pernambuco University. Since 2007 she has experience in teaching. This experience will be necessary to be able to carry out this project in a good way. The breakdown of the budget is clear. The posts are recognizable that need to be financed. (website, marketing,..) The budget is reasonable to achieve the goals. (3 months) There will be a return for additional funding to provide further courses on Cardano blockchain. A realistic timetable has been included to implement this proposal. This project will last 3 months. It is good that milestones have been included in this timetable. There is a clear plan stating what and how everything will be carried out. The plan clearly states the resources needed to carry out everything. The proposal describes the content of the course. The advantage is that Gilvana works in the university and can therefore follow this project closely. No risks are included in the proposal. The risk that other universities do not want to use these courses could also be included.", "q1r": 4, "q2": "A road map with associated milestones has been included. It also clearly describes what will happen in these 3 months to complete this proposal. It is good that there are monthly milestones to be achieved. A number of KPIs are included in the proposal. (number of accesses and views, number of questions, student feedback) These KPIs are well chosen and will provide transparency as to whether the project is successful or not. This proposal addresses the problem that there is little educational content about blockchain in Portuguese that causes Brazilian universities to neglect these technological advancements. The proposer will provide a translated course on this content that will give these Brazilian students the opportunity to be immersed in the world of the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_2940", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7740, "q0": "For the next generation of Science, Engineering, Technology, and Mathematics (STEM) students, understanding blockchain technology is essential because they can use it to advance industries like cryptocurrencies, supply chains, data management, healthcare, governance, and more. Nevertheless, there aren't many courses on this crucial subject offered in our Brazilian educational institutions. The majority of students who are interested in learning about this technology must be fluent in English and take international online courses on it.\nThe purpose of this proposal is to offer free, Portuguese-language courses about Blockchain and Cardano from a scientific standpoint to engineering and natural science students.\nAt a university in Brazil, a basic course on blockchain technology and Cardano will be offered. There will be a total of 10 hours of instruction split between in-person sessions at the University of Pernambuco in Brazil and online sessions on the platform Zoom.\nThe challenge's objectives specifically call for this. The proposer has also listed the crucial criteria that are crucial to the success of this proposal. The proposer has already mentioned the challenges they will experience, and they are scalable and offer alternate answers.\n", "q0r": 5, "q1": "Considering the data it contains, I believe this proposal can score highly for viability. The Fund7 project (https://cardano.ideascale.com/c/idea/381790) is being continued in this project. The initiative will go on because they want to turn a Brazilian university into a center for blockchain and Cardano technology. The students are ready for more funding after the initial Fund7 initiative was a success. In Brazilian academics, there aren't many initiatives to spread blockchain technology. They think it is time for the students to study Cardano and blockchain from a scientific point of view.", "q1r": 5, "q2": "The project accomplisher has a well-planned road map. The 5000 USD in financing that the proposal's author is requesting, together with a breakdown of all the expenditures that can be calculated, seems reasonable and essential to achieving the goal. The proposal has understood, recognized, and is actively seeking a solution to a real need, therefore the materials provided are sufficient to audit the progress. The competence and understanding of the proposer and his team raises the likelihood that the idea will be implemented successfully.", "q2r": 5, "assessor": "z_assessor_2916", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 7646, "q0": "The problem described in this proposal is closely aligned with the challenge. The problem is a lack of courses on blockchain in Brazilian Universities (especially in Portuguese) leaving them lacking knowledge in that field. The proposer has done a great job by putting the proposal at the right challenge. The proposal clearly provides a precise a solution to the problem through the offering of free introductory course on blockchain and Cardano technology in Portuguese to Science, Technology, Engineering and Mathematics (STEM) undergraduate and graduate students. \nThe proposal clearly articulates how it will add value to the Cardano ecosystem because it will introduce the blockchain and Cardano technologies to STEM students which will ignite this field of research and its applications in Brazilian institutions, companies, startups, and communities. This will only serve to push Cardano deeper into North America and its environs especially in its higher educational institutions and academia. \nThe key metrics and goals of the proposal align with the outlined challenge settings through increasing the number of proposals that could be collaborated with other engineers.  And also, the proposal is able to scale to address future challenges by training more students in STEM it means we will have more cryptographers, programmers and scientist who can help cardano write its history in the now and future. The proposal has a plan for the project's future sustainability because the proposer and team intend to create a hub of blockchain and Cardano technology in a Brazilian Universities.\n", "q0r": 5, "q1": "The proposer provides evidence such as references, links, etc. of relevant skills and experience needed to implement the proposal. The proposer goes further to indicate the experience that the team has and the fact this is a continuation of an earlier Fund project which means the proposer knows what is needed, the type and number of team members required to implement the proposal successfully if funded. \nThe budget is properly outlined and clearly broken down into identifiable items. The budget is also reasonable to achieve the set goals of educating both graduate and undergraduate STEM students about blockchain, Cardano amongst others. \nThe proposal offers a realistic timetable to complete the work which is estimated to run for three months. Moreover, the proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how and by whom is doing it. For instance in the project timeline \nMonth 1 Milestone: Courses preparations\n1. Disclose the course for STEM students in Engineering and Science in our local University. \n2. Communication with the community: engage students, professionals, and enthusiasts. The plan describes all the resources necessary to implement the proposal. \nAnd finally, the proposer has considered challenges and risks relevant to a successful implementation of the project which in this case there seem to be no challenges and risks associated with the proposal since it is a continuation of an earlier funded project.", "q1r": 5, "q2": "The proposer provides a clear roadmap with milestones and a clear time horizon for achievement. This proposal will run for a period of three months. The first month will be used for courses preparations and the second and third month will be used for material, lessons and challenges. \nFurthermore, the proposer has also outlined the Metrics/KPIs that define the success of the proposal such as the number of access and views on the online class platform, the number of questions on the Q&A service and \nStudent’s feedback.\nAlso, the proposer provides a clear understandable description of the targeted problem that can be measured against the proposed outcomes. That is the target is the students and the proposed outcomes is the University of Pernambuco becomes a hub of educational content in Blockchain and Cardano with students learning and inculcating STEM into it. \nFinally, the proposer has provided an accessible public channel for delivering regular updates to the community for auditing progress which is through using Twitter, Facebook, Telegram, Slack, and Instagram posts and discussions. ", "q2r": 5, "assessor": "z_assessor_2908", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7599, "q0": "The problem described in this proposal is closely aligned with the challenge, the proposer has done well by putting the proposal in the right challenge. The proposer  seeks to offer an introductory course on Blockchain and Cardano at a Brazilian University .More importantly the proposer aims to provide Free lectures given in Portuguese for engineering and natural science students about Blockchain and Cardano which will be geared towards further sceintific advancement in the field of cryptography ,data management , health care among others which will be beneficial to the Cardano network. The key metrics and goals of this proposal perfectly aligns with the goals of this challenge because it is going to bring onboard alot of Portuguese students who will put up proposals in the challenge. More over  it has the potentials to revolutionaries Cardano using STEM. The proposal scales to address future challenges by creating a hub to continuously train students on Blockchain and Cardano technology which is essential to the future of Cardano.", "q0r": 5, "q1": "The proposer has provided evidence with links description which shows the relevant skills and experience needed to implement the proposal .The proposer also knows the type and number of team members required to implement the proposal if it is funded in this case it is a one member team.\nThe budget is clearly outlined and is also broken down into identifiable units, and it is reasonable to achieve the set objectives of the proposal. Moreover,The proposal also offers a realistic timetable to complete the project in 3 months .The proposer has also considered the challenges and risk associated with the successful implementation which is minimal from the proposer.", "q1r": 5, "q2": "The proposer has provided a clear roadmap with milestones and a clear time horizon for achievement of the set objectives of proposal .The proposer will measure and track the project progress through the following , the number of access and views on the online platform and the number of questions on the question and answers services students feedback tracker among others. Also the proposer has provided a well thought metrics/KPIs that define the success of the proposal that includes how many projects to dessiminate Blockchain technology in Brazilian academy  , how many students are able to learn about Blockchain technology from a sceintific perspective among others. Furthermore the proposer provides a clear description of the targeted problem which is Portuguese speaking students that can be measured against the number of Portuguese speaking students that have learnt about Blockchain and Cardano. The proposal has also provided an effective solution that addresses the problem with a measurable definitions of success.The proposer has provided an accessible public channels for the delivering of regular updates to the community such as social media accounts to be uploaded on zoom meeting, Instagrams among others.", "q2r": 5, "assessor": "z_assessor_2906", "no_vca": 11, "ne": 0, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 7133, "q0": "I think the proposal is suitable for this challenge setting, and the contribution it makes is decent. As for context, this proposal is a continuation of the same idea from Fund 7. One of the problems right now is that students, even from IT backgrounds, don’t get a formal education on what blockchain is. This is critical because the students are the ones who will drive technology development in the future, so equipping them with blockchain materials would help them use it to solve current problems that might exist. What I like best about this proposal is that the syllabus is very basic, which helps students understand what kind of usecases the blockchain would allow, why it exists in the first place, and why it is designed the way it is. Therefore, after the course, the students are more versed when discussing how blockchain could revolutionize the world. I appreciate that the proposer put Cardano specifically in the syllabus.\n\nThat being said, I do wonder if there are any changes compared to the previous implementation. Maybe there are certain topics that need more time, or maybe new topics that need to be added to the syllabus. I would very much want to hear the proposer’s opinion about what’s lacking in the previous lectures or what could be improved in general. It's a missed opportunity to not supplement the proposal with reflective tweaks, but in the end, I still agree with its contribution.", "q0r": 4, "q1": "I tend to agree that the proposal could be implemented successfully, mainly because the proposer has done it in Fund 7. I watched one of the recordings from the courses and the lecturer used Cardano's official documentation and Charles' whiteboard video as the main sources, which shows that they refer to reliable sources. There is no problem with the timetable as it is the same as with previous lectures. Overall, based on the Fund 7 implementation, there seems to be no major hindrance that might occur.\n\nHowever, I would like the proposer to break down the budget a bit more precisely. The budget allocated for book expenses, websites, and services should have an explanation to justify them. For example, why does the proposer need to buy books (can’t they just use online resources)? Which books are they buying? Why is there a budget allocated for a website when the previous lectures used Zoom? What services do they mean exactly? Why is the professor's payment 4200 USD? How many professors do they provide? How many hours are spent on lecturing? These are some guiding questions that might help the proposer better justify their budget request.", "q1r": 4, "q2": "With current information given to us, it is unclear how we could audit their entire process or results. The milestones provided are sufficient, and we could kind of imagine what the overarching timeline would be. The metrics the proposer used are the students' feedback, the number of views, and the number of questions. I find these metrics to be reasonable enough, but we can’t really publicly access this information. One way to mitigate this is perhaps by creating a publicly available, shareable Google Drive, in which the proposer would upload the aforementioned numbers. It also allows the proposer to upload in-person class notes and Zoom recordings to the same place. As of now, there isn’t really a way to see any updates regarding the classes.", "q2r": 3, "assessor": "z_assessor_2878", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 5783, "q0": "The proposal is in line with challenge's objectives to help bring blockchain education close to the door steps of the students. In doing so, the students have the interest and interact with lecturers to explore ideas that could be converted into problem solving tools with smart contract. Once these students are exposed to the concept of blockchain and cardano, they would like to explore for ideas that can be functional. \n\nThis approach would help the students through STEM to develop themselves where developers could be scouted and contribute to building apps on the cardano blockchain. The proposal is also to bridge the gap language gap and with the minimal risks it is therefore achievable ", "q0r": 5, "q1": "The proposal has systematically showed working of the deliverables and timelines for a successful implementation. There is no ambiguity in the timelines and activities to put in place. At the same the budget details are very cute and simple to understand what the funds would be used for. Finally, looking at the proposer's background and educational credentials, it seems the proposer understands the blockchain and smart contract and could implement this project. The information and plans provided are also realistic and could successfully implement the proposal. ", "q1r": 5, "q2": "The proposer has provide some KPIs which is not that bad to assess progress but the information provided are not that sufficient to help in the evaluation of the proposal. The KPIs to me is scanty because, the proposer could look at the number of students that completed the course. number of referrals made for others to participate and number of students with STEM ideas that could be supported by the engineers or catalyst for funding. These important KPIs with metrics to measure each would see the impact on the cardano ecosystem. \n\nThe details provided may not be enough to have a full scale evaluation of the proposal.", "q2r": 3, "assessor": "z_assessor_2749", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 4929, "q0": "As a proposal oriented towards local-language teaching of blockchain and Cardano specifically to STEM students in such a vibrant and growing emerging economy as Brazil, located in highly unequal region such as LatAm where much of the population lacks access to TradFi, this idea stands out within the realm of possibilities to be funded within the Student Challenge setting due to its impact on attracting future developers to the Cardano blockchain.", "q0r": 5, "q1": "The plan seems straightforward insofar as it maps out a curriculum for the classes to be had, and specifies that given funding it will be free for students attending; that will ensure a high student turnout. Also, as the continuation of a proposal from Fund 7 intended to create a hub of blockchain and Cardano technology in a Brazilian University, there is already a captive audience that can expand its influence via local networking. For future iterations it would be interesting to know if, perhaps in association with LATAM Cardano Community, the course could be made more widely available in a virtual/hybrid format for interested STEM students from other countries in the region.", "q1r": 4, "q2": "The University of Pernambuco, as a public institution, can provide easily auditable proof of the progress of the proposal once implemented, and although the KPIs could be expanded or refined further under a wider audience (YouTube presence of the uploaded classes with number of views/subscribers, social media presence and engagement, etc), they are more than sufficient to audit the development of the specific proposal as it stands.", "q2r": 4, "assessor": "z_assessor_2636", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 4895, "q0": "The proposal recognizes the need of courses on Blockchain to bring the Portuguese STEM university students into the field of Blockchain technology. It proposes to offer students free of cost an introductory course on Cardano technology.\n\nThe proposer is a Doctor of Physics and associate professor at a Brazilian Engineering college. \n\nThe introductory course includes 13 syllabus and it will be conducted in real person and online with a total of 10 lecture hours.\n\nThe proposer believes that the course will bring the students into this field and triggers research and develop applications for the benefits of the Brazilian community. It also expect that a ripple impact arousing further interests in the technology.\n\nI see the proposal does create benefits to the Portuguese community and it meets the challenge objective of encouraging students to take active roles in the ecosystem. I therefore strongly agree this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposal will involve lecturers who are holding doctors of physics.\n\nThe proposal requests for USD 5000 for various expense items, the highest cost is the payments to the (lecturing?) professors, totalling USD4200. I am not clear however why the cost of translation is missing in the budget. Is it that the lecturer will conduct lecture in Portuguese from the English books? \n\nI have a problem understanding that in its proposed solution, there will be lecturers, plural, whereas the details of the people who will work on the project is only the proposer herself.\n\nNotwithstanding the foregoing I would agree that it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal provides three metrics to measure the project progress, but the progress on real person classroom attendance seems to be missing in the metrics. \n\nIt does not provide a timeline neither it set the goals such that the success can be measured. \n\nTherefore I disagree that the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 2, "assessor": "z_assessor_2631", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4797, "q0": "\nThe problem of the lack of blockchain courses in Brazilian universities is pointed out and the proposer offers a solution by offering an introductory course on blockchain and Cardano technology in Portuguese for Science, Technology, Engineering and Mathematics (STEM) undergraduate and graduate students. The proposer explains how Cardano content in languages other than English will add value to the Cardano ecosystem and this proposal can be scaled to meet future challenges. We can say that the key metrics and goals of this proposal are aligned with the challenge settings.\n\n", "q0r": 5, "q1": "\nThrough the LinkedIn link, it is transparently shown that this is a lecturer who has been teaching for years and who has all the necessary skills, knowledge and experience for the realization of this project. Budget is outlined clearly and it is broken down into identifiable items and it is reasonable to achieve all the goals set in this proposal. The implementation plan together with the time frames within the project will be realized is well developed and presented. The proposer claims that the possible risks in this project are very small, accordingly solutions have been offered.\n", "q1r": 5, "q2": "Roadmap with milestones have been worked out, but I would like to see when the project starts. Is it Q4 this year? Or Q1 2023? KPIs are worked out and an idea of what project success looks like is presented. Maybe it would be good to create a public channel where community could see updates or maybe to record the lectures? The community can follow the development of this project because the proposer specifies the ways in which they will monitor and measure the progress of the project, namely: number of access and views on the online class platform, number of questions on the Q&A service and student's feedback.\n\n", "q2r": 4, "assessor": "z_assessor_2616", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3834, "q0": "Due to lack of Cardano educational content in Portuguese (language of Brazilians), Universities in Brazil are left out of blockchain technology education. This is the explanation of the problem statement of this proposal which is quite clear. \nTheir solution, as stated, is to offer an introductory course on blockchain and Cardano technology in Portuguese language to Science, Technology, Engineering and Mathematics students. Topics to teach on have been listed in the proposal, which include Introduction to Blockchain technology and Cryptology of Blockchain, among others mentioned in the proposal. \nTo address the challenge, this proposal by introducing graduates and undergraduates to the blockchain technology, will attract the academia in Brazil to become members of the Cardano ecosystem, thus effectively addressing the challenge. According to the proposal, this project will disseminate  Cardano in Latin America. \nIt is mentioned in the proposal that there is minimal risk associated with this project.\nWith all this said, this proposal has addressed the challenge effectively. ", "q0r": 5, "q1": "From the information given in the proposal, this project is a 3 months project which has been divided into monthly timelines with specific duties to be carried out. The outline is very detailed showing some activities such as in Month 1 is for courses preparation, months 2 and 3 for material, lessons and challenges.\nThe budget request is $5000, just like the maximum required in this challenge, and it is broken down into smaller budgets for books expenses, marketing and website, services and Professor payment (which is highest).\nThe proposer's name is Gilvania, a Phd and an Associate Professor at Pernambuco University in Brazil. His credentials are impressive and LinkedIn reference given for further checks. \nThe proposer intends to seek further support from Catalyst in next funds to continue the work to grow Cardano in the schools.\nMy rating is 4.", "q1r": 4, "q2": "This proposal has stated the how the progress of work will be measured by metrics such as the number of access and views on the online class platform; the number of questions on the Q&A service and students feedback.\nHowever, there is no link as to where reports will be sent.\nAs listed in this proposal, success will be seen as dissemination of blockchain technology education in Brazil academia, and students will know much about blockchain and Cardano. University of Pernambuco then becomes a hub of educational content in blockchain and Cardano.\nThis project can be implemented successfully. My rating is 4.", "q2r": 4, "assessor": "z_assessor_2483", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}, {"id": 3504, "q0": "The fundamental motivation behind the \"Challenge & Scouted for Students\" Challenge approved by the Catalyst community last fund, is to provide college and university students a space completely separate from the regular Catalyst funding environment, in which they could bring their projects to our ecosystem and get base funding, nothing financially ambitious.  Clumsy projects, with flaws or weaknesses if any, but with an authentic innovative and creative student spirit, insolent and daring, that could find in our community a place to learn and get involved, a playground endowed not only with money, but even more valuable, with the possibility to get your hands on the best technology in the industry while having access to the knowledge, experience and sense of collaboration of Catalyst members. A new concept for Catalyst no doubt, but an efficient one: in the student community of the planet lies that needle in the haystack that ends up changing the game we play so tightly with other blockchains and the legacy world, and it is our obligation to build the best of the magnets to find it.  That's exactly what this Challenge is trying to do: build a suitable habitat for students.\n\nBecause of my affinity with this Challenge (formal experience in education at the college, university, corporate level) and my experience in Project Catalyst (actively participating in 90% of the community positions that exist: CA, VCA, Challenge Team member, funded proposer, involvement in multiple projects in Catalyst) I have been following it closely since it was approved at F8, because it never ceases to amaze me how often the scoreboard seeks to augment itself with topics of undeniable importance (Developer Ecosystem, Cross-Chain Collaboration, The Great Migration (From Ethereum)) to the point of discarding areas that in the real world have proven to be an inexhaustible source of ideas, creativity and results, such as those related to students.  \n\nAs an educator and Catalyst member, I understand the intent behind the proposal and consider it completely valid.  However, the proposal is designed FOR students but not BY students. And that is a fundamental requirement of the Challenge.  I quote (excerpted from the Challenge information) \"By creating a category of students and increasing exposure for their ideas, they can expect easier funding and to be scouted by engineers\" (section What does success look like?). \"Most student entrepreneurs suffer from a shortage of resources, especially when it comes to funding and hiring engineers\" (Why is this important? section). \"However, the number of proposals to Catalysts is increasing rapidly, and the community does not readily perceive small-scale proposals from students. .... Therefore, to make it easier for the community to recognize new ideas from students, we will establish a new category exclusively for students\" (Challenge brief section).  \n\nIn conclusion, to maintain the spirit of the Challenge “Challenge & Scouted for Students” I have to remove three stars from the final score.", "q0r": 2, "q1": "In my experience as an educator, the implementation plan and budget correspond to the line of work the proposer wishes to execute.  The proposer's track record is astounding, a compendium of knowledge, experience and accomplishments that any student in practice could wish for.  And it is precisely there where the weakness of the proposal lies: it is competing in a category whose guidelines it is not respecting.  As evidenced in the Impact section of this evaluation, the Challenge guidelines are clearly stated with respect to the profile eligible to submit proposals.  Therefore, I must remove three stars from the final rating.", "q1r": 2, "q2": "The KPIs provided by the proposal can accomplish the performance measurement tasks required.  In general, the project presents a feasible and measurable scenario.  However, proceeding to measure its performance would mean measuring the performance of a project that is outside the guidelines that were clearly given to the Challenge “Challenge & Scouted for Students”  competitors.  Therefore, similar to trying to break a physical law, I see measuring the project as impossible.  Consequently, I must remove 4 stars from the final rating.", "q2r": 1, "assessor": "z_assessor_2462", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8277, "q0": "I think this is a really good proposal. Brazil's universities are highly qualified and the country produces important scientific reasearch. So it is natural that we take advantage of this environment to bring qualified people to the Cardano ecosystem while creating space in one of the biggest countries in the world for Cardano to have an impact. I liked the proposed syllabus, and I think it would be even more complete if there were a module on Cardano and social impact. We could use this opportunity to create consciousness about the ability of Cardano to have a positive social impact in an unequal country.\nI would like to know why Universidade de Pernambuco was chosen, and if there is a previous study to understand its potential. Regarding the risks, I think it could be considered the lack of interest from the students. ", "q0r": 4, "q1": "The proposal seems feasible, as it is not overly complicated. However, I think the milestones seem a bit rushed. I think month 1 could be more focused on marketing + enrolling students. I wonder if digital marketing would be enough, or if there could be some face-to-face promotion with the students. If so, the budget should also consider transportation expenses. \nThe proposer seems to fit perfectly with the project and I believe they have the needed skills to complete it.", "q1r": 4, "q2": "I believe there could be some KPI to track the project's progress and deliverables. I would also like to know more about how the students' feedback would be collected: would it be informal and organic: Would there be a questionnaire: If so, what would be asked? There could also be some follow-up to understand if the classes had any impact on the students, for example, if any of the joined the Cardano community.", "q2r": 3, "assessor": "z_assessor_2971", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 13728, "q0": "I believe that the idea of the project is very good, however, it does not aligns well or effectively addresses the challenge. The brief of the challenge clearly states that this is a exclusive space for students to put their ideas and to be seen by the engineers in the Cardano Ecosystem. The KPI's provided by the proposer make sense with the project, but they do not match the ones indicated in the challenge. \nI agree that the project presented a solution to a existing problem in Brazil, addressing even the language barrier, and the local impact is significant to the students interested in Cardano and blockchain technology, which would add a high value to the Cardano Ecosystem with more and more people interested in the subject. But I see some problems with the proposal:\n- The proposer is not a student;\n- Once the project scales, by the construction of a blockchain and Cardano hub, how would these courses be offered to all Brazilian community, since some of the classes should be taken personally? \n- One important KPI that the proposer should take into consideration is the number of submitted proposals by students that took the course (which would be a great measurement of success as well);\nFor these reasons, I deliberate the assessment above. ", "q0r": 3, "q1": "There is no doubt that the proposer's experience is aligned with the project's objectives, already having a successful stage back in Fund 7. The roadmap and milestones are well explained and the planning is well described. However, what bothers me the most is the budget. Since this is not a student project, but a very well qualified proposer project, the costs only for a professor payment is 4200 USD. Moreover, the proposer says that the lecturers of the course would the doctors in physics, but does not include any information of these other players in the body of the project. There are costs for marketing, website and services. Will it be a person other than the proposer working on these areas? If the answer is yes, why are they not mentioned? \nBy all things said, and the budget in the limit of the what was proposed in the challenge, I do believe that the budget should be adjusted and more detailed.\n\n", "q1r": 2, "q2": "In Brazil, it is common for Educational Institutions to use the Moodle Platform to offer courses for their students. Each institution has its own platform, and for one to have access to the classes, it is required a registration with a CPF number. This number is unique, and all Brazilian citizens and legal foreigns have it.  The course mentioned in the project, is lectured inside this platform and a lot of the community members would not be able to audit it, since they do not have this CPF number. Considering this, I would recommend either creating a open platform (such as a YouTube channel) or, specifically for this course, make the registration easier (non-compulsory CPF number) or lectured in another platform.   \nAlthough what was said above limits the auditability of the project, I think the roadmap was well prepared with clear milestones. However, the KPI's do not go in the same direction of what was proposed by the challenge. ", "q2r": 3, "assessor": "z_assessor_3768", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "It will be offered an an introductory course on blockchain and Cardano technology in Portuguese to Science, Technology, Engineering and Mathematics (STEM) undergraduate and graduate students.", "experience": "Doctor in Physics and associate professor at a Brazilian Engineering College. She has experience in teaching classes for STEM courses since 2007. She is a researcher in spintronics and has worked in collaboration with the Massachusetts Institute of Technology, USA, since 2017."}