{"id": 421479, "author": "sustainableada", "title": "Youth Block Resource Development", "url": "https://cardano.ideascale.com/a/dtd/421479-48088", "category": 26599, "amount": 5000, "description": "Schools are failing to equip youth with the skills to access networks, navigate, and flourish in a globalized digital economy. An education for sustainable development Cardano Youth program is absent.", "f6_no_assessments": 19, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 3168, "q0": "I appreciate the need for more learning resources, and I believe these can make a difference in onboarding more youth (and therefore students) to the Cardano ecosystem. However,  this proposal is missing a level of detail that I need to understand its impact, and its relevance to the Campaign:\n--> WHAT YOUTH are you targeting? In a couple places this proposal says \"All youth\" which is nice, but to me that just sounds like you have not found any specific youth who will use your material. It would be great if your platform eventually grows to serve \"All youth\" but it will need to start with some specific youth.  Who are they? How will they find you?\n--What do you really mean by youth? Are you creating materials for children? Teenagers? College undergrads? Grad students?\n--WHAT makes these resources different than the ones that are made for non-youth? Is it cartoons? Tik-toks? I'm joking, but also not. It's not clear what these materials are, and what makes them especially relevant to youths, and who the youths are, and how the youths will find them.", "q0r": 3, "q1": "This proposal is difficult because it includes a lot of vague work, like \"Doing research\". The only concrete deliverables that I see are getting a website domain, and releasing 2 courses on Beanchain. I would rather have seen a more concrete presentation of the idea to create two courses for Beanchain, with a more clear description of what those courses would be. However, I think that creating two courses is very achievable for this budget and timeline, and have little doubt that it is feasible.", "q1r": 4, "q2": "The only clearly auditable result is the 2 courses released on Beanchain. This will be very easy for the community to see and audit. There are a bunch of other KPIs that are vague, with no measurable numbers given, and no details about HOW they will \"Share with the community\".  To me, it would be ok to present this as a much smaller proposal - it's only a 5k budget for heaven's sake! - along with clearer, more concretely auditable results.  All the vague and lofty aspirations of this proposal will be difficult to audit.", "q2r": 3, "assessor": "z_assessor_2404", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12975, "q0": "The proposal is about to educate the youths about the cardano eco system .\nBy educating youth about the cardano ecosystem and by providing them needed resources \nwe can easily help them quip with the skills to access networks, navigate, and flourish in a globalized digital economy.\nThe proposer have provided the detailed solution to the challenge, \nfirstly by introducing them to the block chain and then teaching them that How to work with crypto wallets .\nEveryone in the Cardano community, the larger blockchain community, and beyond will be able to access these resources \nThe purpose of the proposal is to address the rapidly expanding and increasingly  Cardano community. \nMany young people will join, engage with, and contribute to this ecosystem for a very long time.\nThe proposal clearly adds the value to the cardano ecosystem,\nThe key metrices and the goals of the proposal align with the outlined challenges.", "q0r": 5, "q1": "The proposer have provided a detailed plan, including timeline and key milestones for delivering the project. The proposer have mentioned the clear detailed timeline for the proposal and Budget mentioned in the description is very reasonable. The proposer have also described the relevant skills and \nthe links  in the description which are needed to implement the proposal.\nThe team looks very professional and very experienced and have mentioned the skills and the links of their work.\nThe proposers have actively participated in the previous catalyst funding's.\nThe Budget is reasonable to achieve the goals and The proposer have considered the risks and the challenges to a successful implementation Upon reviewing the proposal i strongly agree that the proposal is likely to be implemented successfully.\n", "q1r": 5, "q2": "The progress of the proposal can be tracked on social media platforms like Youth Block Twitter, and Sustainable ADA/Cardashift social streams.All the materials, presentations, and progress reports will also be posted in google folders Additionally, Their will exclusive Telegram and Discord channels for conversation and information sharing. \nThe collaborative party must consent for the meetings to be recorded and shared.\nThe team have provided the clear understandable description of the challenge and The Solution is also mentioned .\nThe metrices and the Kpi's mentioned in the proposal define the success of the proposal\nThe proposer have proposer have provided the sufficient information to review the proposal", "q2r": 5, "assessor": "z_assessor_3521", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 12583, "q0": "the problem in the challenge that needs to be addressed here is that schools are not equipping teens with the skills to network, navigate and thrive in the globalizing digital economy. There is no Cardano Education for Sustainability Program for Youth. it will add value to the Cardano ecosystem by creating a resource development plan for the first few courses, the first step is adding the courses to the Blockchain Learning Center. Once the first two courses have been created, they will be published on the Blockchain Learning Center allowing open access to this material before the Youth Block program is further developed. The main goal of the proposal is that the Cardano community is growing at an extremely fast rate, seeing that a lot of young people will join, join and become a part of this ecosystem in the future. with this proposal in line with the stated challenge settings. The proposal can be scaled to address future challenges.(it will create business value by the group's new youth education model. At the same time, it will contribute back to the community. Cardano to improve the ecosystem and support new users). I totally agree I believe this proposal solves the challenge effectively. I rate 5*.", "q0r": 5, "q1": "The proponent provides full information on the relevant skills and experience required to implement the proposal. (Mr. Benjamin Ben Zvi is an 18-year-old international business student at Grenoble Ecole de Management. Speaks fluently in 4 languages ​​and has learned 3 more. Trishala Adwaine Suresh - Impact Team Leader at SmartChain, Impact Assessment Team Leader Active Cardashift, Active Cardano Community Member Cole Bartlett The Cardano4Climate.com (C4C) community consists of over 200 members and growing....). The proponent has come up with a budget that they require is 5000 reasonable budget to achieve the stated goal. The proponent provides a detailed timetable with 17 weeks and divided into 3 phases. The proponent pointed out the risk involved in doing the project that without a platform Youth Block may find it difficult to grant access to the type of material we plan to release on a future platform. but I found that the proponent has not yet provided a solution to this risk. If the proponent still has not found a solution to this risk, I am afraid that when the implementation is unfortunately encountered, the possibility of success of this project is very difficult. I rate this project 4* and hope the proponent can add to the project to make it successful.\n", "q1r": 4, "q2": "As well as the feasibility side I was told the implementation roadmap of this project will be in 17 weeks. The proposal when implemented will provide the first stepping stones towards an open innovation platform where people fulfill roles that are meaningful to them and contribute to overall success. These first two courses will enable the development of an implementation plan for the future program that it intends to bring to youth globally and the Cardano community. Clear, easy-to-understand solutions to problems (Adjust existing resources and develop educational resources specifically designed for adolescent learners. As part of structured educational content for teenagers, bridging them with the Cardano community.) I completely agree, I rate the project 5* I believe this proposal provides me with enough information to gauge my progress towards the goal.", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 12273, "q0": "We get that the idea seeks to provide the youth with resources to navigate the ecosystem and this is a good start for young people who are interested in doing so. The plan did not however mention the specific schools targeted or how they can first develop interest in students to learn these resources that will be available to them. I anticipate an issue with reporting on the teams progress given this challenge. ", "q0r": 4, "q1": "It will be important given the idea by the cardano community to make the proposal tailored to students and how they can get involved. Beyond creating content for the youth, there is the need to ensure that they are able to make practical use of it but the proposal did not include a clear plan on how the skills learned will be transferred unto an increase in onboarding ideas from the ideas main target audience (students). The team however has enough enough experience to be successful on the project.", "q1r": 2, "q2": "The proposer did not provide a considerable amount of information enough to measure the success of students. One of the ways to measure the impact of a course is through assessment but with no plans in place to assess the performance of the learners on the course, it will be difficult to tell how well the youth are performing or if actually, they are able to finish the entire course. An alternative could be an open comment section of the course or rating scale to be made public so the community will see what students feel about the impact of the course.", "q2r": 2, "assessor": "z_assessor_3378", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 11552, "q0": "The problem presented by this proposal is related directly to the challenge. The proposal's authors conducted extensive research on previous approach for developing a platform that would connect crypto-interested youth with the Cardano community and the Cryptospace in general, and specifically depicted how their education program would approach the problem, how their approach would differ from previous approaches, and what the project's long-term prospects are. The proposal's entire solution is nicely supported by market research linked from Binance, statista.com, and other portals.  Furthermore, the proposal does a good job of explaining WHY the entire project is a good idea, using specific examples in the context of Catalyst and Cardano. The Cardano ecosystem is likely to grow and scale as a result of the formation of such a well-thought-out community establishment and open-source educational course for youlth, proving how well the idea converges with the Cardano ecosystem values. Furthermore, the proposal's overall context aligns with the challenge for a variety of reasons: 1) It aims to guide youth through the often-confusing blockchain system; 2) It aims to expand their skill set for future digital economy solutions by providing the necessary resources. 3) Its goal is to connect young people/students with more senior Catalyst members. While I think the proposal is well written and contains a lot of information and statistics, I think some of the statements are overly ambitious, such as \"We aim to offer a program for all youth, and plan to have a lead on each continent, multilingual program, transformative education.\" However, if the program is successful, it will most likely be easily scalable and have a global impact. The proposal's only weak point is that it is difficult to navigate through because it contains a lot of copied information about various organizations such as UNESCAP and ACCELERATE 2030, making the proposal difficult to read.", "q0r": 5, "q1": "For a number of reasons, I believe the project will be completed successfully. The team members are and have been involved in Catalyst for several years, working on a variety of projects. The team also benefits from collaborations with WADA, Catalyst School, UNESCAP, and others. Furthermore, the team is made up of motivated students, experienced educators, and Catalyst veterans with relevant work experience for the current project, all of whom are linked to their social media platforms. The only thing missing from this section is a description of the roles of the team members mentioned only mentioning who will be the work management. The detailed timetable, which includes a roadmap divided into multiple phases, is another reason I believe the proposal will be implemented. The budget is not particularly detailed, but the total budget is within the challenge limit (5k USD). It would be best to specify some costs in the budget, such as \"content creation\" - creating/designing brochures, providing incentives for students involved in the work, and so on. Furthermore, the proposal mentions \"domain acquisition,\" which is not mentioned in the budget. Overall, I think the project to be cost-effective.", "q1r": 4, "q2": "The KPIs, deliverables, and roadmap are all clearly defined. The proposal clearly states where the KPI's and deliverables will be found - twitter/discord - and the timescale of the meeting/sharing - monthly, so I believe the community will be kept up to date on the ongoing activity. Furthermore, the team intends to communicate directly with the community via social media, specifically Discord. Another strategy how the team aims to inform the community about the ongling process are porogress reports on a dedicated Google-drive. The only information I am missing from the proposal is whether there will be a designated person in charge of the auditing process.", "q2r": 4, "assessor": "z_assessor_3256", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 11094, "q0": "Today, schools are failing to equip teenagers with the skills to network, navigate, and thrive in the globalizing digital economy. With that in mind, you have proposed: \"\" Adjust existing resources and develop educational resources specifically designed for young learners to bridge them with the Cardano community. \" I see this as a very valuable proposition that contributes to the achievement of the Sustainable Development Goals: ensuring inclusive and equitable quality education and promoting lifelong learning opportunities for all. and promote sustainable, inclusive and sustainable economic growth, full and productive employment and decent work for all I support your proposal.\n", "q0r": 4, "q1": "I really like the first solution: Design learning materials that are open source and free to use by anyone in the Cardano community, the larger blockchain community, and more. This is the solution to attract a large number of students to participate; Second, lowering barriers to blockchain entry by allowing youth and blockchain professionals to make meaningful connections, access professional guidance and expert mentorship, and new opportunities are created to synergize to catalyze cooperative positive feedback loops. Currently your budget table is not detailed, the spending content is not specific. In my opinion, the expenses should be calculated by working hours and then converted to USD for clarity and transparency. You have provided quite enough information about the people who will work on the project. I see that they are all qualified and experienced people, I feel very good.", "q1r": 4, "q2": "You have provided information about the outcome of the proposal, but have not provided information on measuring the progress of the project. The success of the project has not been described in detail. This is a potential new project, I hope you will add adjustments to make the proposal more complete. Good luck.", "q2r": 4, "assessor": "z_assessor_3216", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}, {"id": 10306, "q0": "Is it right for a project to solve a problem that provides a complete set of skills to access, navigate, and thrive in the globalized digital economy. for sustainable development Cardano for Teens trains young people with trading skills on the cardano system, solving problems that challenge presents. Ra is focused on creating material for the Youth Block and will allow us to develop a full model and structured process to develop more content and find the best solutions to be effective. and have an impact.\nIt also allows us to take the next steps towards creating our global Youth Education program. Help drive overall program success and strategic planning, a plan for greater impact as we bring our programs and resources to youth globally.\nIdentify risks and challenges in real life Adapt existing resources and develop educational resources specifically designed for young learners.\nI think this project has the potential to help many young people gain access to information technology and become proficient in computers in accessing the internet, learn many transactions, and improve human thinking.", "q0r": 4, "q1": "Is the milestone process clear and reasonable, highly feasible?\nFuture technology advocates, next generation of blockchain advocates, upcoming blockchain advocates + Enable the blockchain natives of tomorrow.\n\nGaps/unmet need - Not all teens have access to + advanced subjects + protocol communities that are difficult to join/join in the first place.\n\nRoot Cause - Information / new towards the developer community / working professionals --- more inclusiveness is needed in sharing and brainstorming about this new technology.\nCreate elevation. Cardano and the Catalyst community have the opportunity to position themselves as the first choice for young people who are increasingly aware and interested in actively participating in activities and projects that have a positive impact on the environment. and social.\nThe most popular cryptocurrency with young people\n 31% of 18 to 29 year olds have used it, compared with 21% of 30 to 49 year olds, 8% of 50 to 64 year olds and 3% of 65 and older.\nThe required budget is detailed, reasonable, and clear, with the right amount to spend\nCompetent team capacity with potential with related experience\nTo create a technology community platform that takes the industry to a high level\nI see this project has a lot of potential this project funding will create a step to create a lot of jobs for the youth and create a strong community of candano and vpha good luck for the project", "q1r": 4, "q2": "Project success metrics and metrics share updates throughout the process and track all of our documents generated during the proposal period.\n\nUpdates will come via Youth Block Twitter and Sustainability ADA/Cardashift social streams.\n\nAll information/content generated will be open source and shared with the community.\n\nWe will have dedicated google folders where we will gather all the documents, presentations and progress reports.\nopen telegram and discord channels dedicated to communication and information gathering and sharing\nBe realistic and creative, fit the challenge and all the pressures\nAchieving KPIs will be an important indicator of success.\nWe will also demonstrate success with the release of the first two courses on the Blockchain Learning Center and make all of our developed resources open source and open to all.\nThis is a brand new proposal that will help us take the first steps towards building a Youth Education Program\ninclusive and equitable education and the promotion of lifelong learning opportunities for all\nPromote sustainable, inclusive and sustainable economic growth, full and productive employment and decent work for all\nBy 2030, significantly increase the number of young people and adults with relevant skills, including technical and vocational skills, for employment, decent work and entrepreneurship\nthrough education on sustainable development and sustainable lifestyles, human rights, gender equality, promotion of a culture of peace and non-violence, global citizenship and appreciation of cultural diversity and Culture's contribution to sustainable development", "q2r": 4, "assessor": "z_assessor_3171", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 9718, "q0": "The problem is clearly identified in this proposal and is closely aligned with the challenge as there seems to be a student entrepreneur part of the team that’s looking to add value to the Cardano Ecosystem by providing educational resources to youths. As blockchain technology and the Cardano ecosystem is still in their early days it is important to accelerate the growth by increasing the exposure of Cardano to youths through educational resources, programs and access to connect with blockchain mentors and professionals. This project will also add value to the Cardano ecosystem in both the short and long term. The project has a very well thought out plan on how it will achieve its goals. Sufficient key metrics were used to support the problem that they are aiming to solve. This gives me confidence that they understand they have done their research and have a deep understanding of their target audience. I believe that the proposer hasn’t successfully identified the future challenges and risks of their project. Instead of stating that they have ‘minimal risks’ to implementing their project. It would be more beneficial for the proposer to approach this with an acknowledgement of future challenges and how they plan to address them. An example could be ‘technical issues on their youth block platform’ and addressing this with ‘consulting with the right developers or engineers to mitigate the problem’. The proposal clearly articulates a detailed plan for future sustainability and team members have shown the necessary qualifications and backgrounds to implement this. ", "q0r": 5, "q1": "Relevant Skills and experience are clearly shown and it gives the impression that the team are very capable of successfully implementing the proposal. The proposer also supports this by providing relevant Linkedin and Twitter links for reference of each team member. A clear and detailed roadmap is provided with realistic timeframes to complete the work. The budget requested seems reasonable and the outlined budget is clear. Although this is the case, there are no further details on the particulars of how the funds will be allocated which makes the budget appear to be a little vague. Even though this fund is at a smaller scale compared to other funds it is still important to break down the budget into identifiable items. The proposer outlined a budget of ‘content creation – 3000USD’, for example, if this was further expanded by stating that 1000USD will be used for course 1, 1000USD will be used for course 2 and 1000USD will be used for youth block platform development or broken it down in a similar approach – It would have reassured me of their financial stability in implementing their project. A sensible and conductible plan has been presented through their roadmap although there is no clarity on which team members will be accountable for certain tasks to complete work. It would be beneficial to identify tasks and specific goals with responsible team members to better understand their productivity, streamline work processes and clarify every aspect of a task. The proposer doesn’t have sufficient information on technical aspects crucial for the implementation. And provides no information on future challenges or risks relevant to a successful implementation. Because they are wanting to create an open-source model for their program – A risk they may consider is ‘intellectual property issues’ on the educational content provided or challenges in ‘training’ as youths may not be familiar with open-source models.", "q1r": 4, "q2": "It is easy to understand the problem that the project is aiming to fix. It is clear that the proposer also has an understanding of the need for bringing blockchain awareness and educational resources to youths. There is clarity in the roadmap and each phase seems realistic to complete the work. The proposed budget and allocation of funds appear to be vague, it is important to understand the specifics of the funds allocated. The proposer provides key metrics and KPIs to define the success of the proposal. I suggest that they should also explore how their key metrics and KPIs will be measured (not just what they will measure) and their relation to the short-, medium- and long-term success. I believe that there is a problem that the proposer is aiming to fix as there is a clear understandable description of the targeted problem that can be measured in the proposed outcomes. The proposal gives sufficient information on its plan to create an accessible public channel for delivering regular updates to the community through google folders, social media and their youth block open-source platform. This will enable the community to audit the progress of the project. The information provided in this proposal is sufficient to fully audit the progress and success of the proposal.", "q2r": 4, "assessor": "z_assessor_3086", "no_vca": 13, "ne": 4, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 13507, "q0": " The idea of this proposal corresponds with the challenge, but the description is very brief and general. I agree that Cardano Community needs more resources for educational programs to involve the younger crowd in the community and educate them. But I haven’t found any specific information about how this educational program will be different from many others which already exist, and why will it be better for students than other similar courses? For example, when you search on Google you can find a lot of free resources to learn about blockchain. It's very accessible and you can even get a certificate of completion without paying anything. Here are some examples of some free blockchain courses: https://www.mygreatlearning.com/, and https://www.upgrad.com/.\nThe Youth Block education community claims to create 2 courses:\n1. What is Blockchain?\n2. How to work with crypto wallets?\nMy question here is are we talking about the course about Blockchain in general including Cardano blockchain or are we talking about a course about only Cardano blockchain? So, this needs to be clarified.\nThen the proposal says that they will publish the first two courses in Blockchain Learning Center and make them free to use. I’m not sure how Cardano Community will benefit from it. It will benefit only if students will be enrolling in this program and will really learn something from it. But the proposal doesn’t explain why students will be interested to enroll in specifically that course? What does make this course so unique? Authors just talk about creating content and open-source platform, and they only assume that students will be enrolling just because this course exists. How do we know that people will really learn something from it? The main challenge here should be not creating content but making people interested in learning about the Cardano blockchain and getting educated. And I didn’t find a clear explanation of how we will reach that goal.  \n", "q0r": 3, "q1": "The proposal provides detailed information about each team member including background, education, skills, and links to social media profiles; however, it doesn’t specify the roles they have in this project. (Except for the Co-founder Trishala Adwaine Suresh). So, we can only assume who will be responsible for research, content creation, design, etc. The proposer also mentions the list of communities that will participate in this project: Cardano4Climate.com, SustainableADA.com, Cardashift, Catalyst School. But there is only information about what they do in general, and no information on how these communities relate to Youth Block and what\nexactly they will do for that project. For instance, the proposer says “Cardashift supports this proposal via their Impact assessment team”. Supports how? This sounds too vague; it would be great to know more details to evaluate feasibility.\nMeanwhile, the budget is divided between “research” and “content creation”. And it’s not clear how it correlates to roadmap which is divided into 3 Phases. Research is included into Phase 1. The total amount of 5000$ sounds reasonable. But there is no explanation why the budget for research is 2000$ when it will last only 4 weeks and the project itself is planned for 17 weeks. Phase 3 is related to project release. If that is not considered as “content creation”, then where is the budget for Phase 3? \nThe proposer offers a realistic timetable to complete the work in 17 weeks. But again, it’s very superficial. The proposer states that one of their main advantages will be a multilingual program, but why it’s not mentioned in the roadmap? Who, how and when will be translating courses into different languages?\nThere are some risks which hasn’t been considered in the proposal. For example, it might happen that students won’t be interested in these courses, or the competitors will offer a better product. What solutions will be offered for that scenario?\n", "q1r": 3, "q2": " The team established good metrics to evaluate the process of work and track the progress: the number of created materials, and the number of created courses. But these KPIs measure only the quantity. There are no metrics to measure the quality of the content and customer satisfaction. In other words, there are no metrics to evaluate the results of the project and how positively it will impact the Cardano Community. Also, the proposal says that the team will focus on the youth 18-25 years old. So how it will be measured that this project will be beneficial for that age group?\nThe proposal includes a briefly described roadmap with a solid time horizon for achievement, but only till the release phase. There is no description of what goes next (for example, it can be usability testing and customer feedback gathering). That makes this proposal hard to audit through the information provided.\n", "q2r": 3, "assessor": "z_assessor_3660", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8929, "q0": "As we see their are lot of school who wants their students to learn coding ,web development, AI etc. but none of them are concerned about developing financial ideas of the student , Hence to overcome such state the proposer wants to develop a tool to make student improve his financial idea and participate in cardano eco system and gain the experience of cardano eco system, so that students can get structured educational content for youth bridging them into the Cardano community. which will definitely make cardano eco system more stronger and wider in the future , Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Developing a framework or tool regarding blockchain has been done by many and tailoring this resources for school educational resources where it can be used as part of a structured educational content is achievable ,As proposer has been in cardano eco system and has been working on funded projects since fund 4 and has even worked as educator in schools , with all experienced gained related to cardano and syllabus developed in school , he can make the best framework where schools can adopt or students can learn through online mode by reaching his website created , Hence with enough experience provided any minimal risks involved plan presented it is highly likely this proposal will be implemented successfully. ", "q1r": 5, "q2": "The proposed solution has clear goal on how to nurture the idea of cardano in the you ,so that students can enter into cardano ecosystem without any fear or doubts ahead, the proposer even has mentioned on how is going to limit the syllabus so that students shouldn't feel it as burden , where they can learn in simple and effective way.\nThe proposed solution effectively tackles the current challenge which will provide more effective results in the upcoming future, the proposed solution has detailed timeline to complete the project the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 7824, "q0": "The proposal has effectively addressed the challenge and has also been entered into the right challenge. It has provided information  to help students  and young entrepreneurs to become well informed about the opportunities Cardano ecosystem has to offer them. The proposal intends to create a resource bank of information for young entrepreneurs to get all the information they need so as to be better informed about project catalyst and the Cardano blockchain.\nThis proposal has met the requirements in the challenge and for that matter I gave it a 5 star rating.", "q0r": 5, "q1": "The experience of the team matches well with the project. The proposer intends to do a lot of collaborations with other projects with similar goals so as to get tailor made resources for its target audience.\n\nThe budget however is not very detailed. Only two items were stated which used up all the $5000. I suggest that the proposer gives some details of its expenditure.\n\nNevertheless, looking at the plan presented and the experience of the team, this project is highly likely to be implemented successfully when funded. A 4 star is my rating for this proposal.", "q1r": 4, "q2": "The proposal contains social media sites which the team intends to use to provide updates for the community to track progress and success of the project.\nHowever, Key metrics and milestones were not clearly stated. This will make auditing of the project cumbersome.\n\nI will suggest that the proposer should include these KPIs to make auditing the project easy. For this reason I will give it a 3 star rating.", "q2r": 3, "assessor": "z_assessor_2924", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 7742, "q0": "Given how quickly and steadily the Cardano community is expanding, I believe this is the ideal solution for this challenge. Long into the future, a large number of young people will join, take part in, and contribute to this ecosystem. Giving people a forum to talk about and share their opinions on blockchain, decentralization paradigms, and new economic models is essential to jointly creating the world of tomorrow.", "q0r": 5, "q1": "Regarding viability, I totally concur that the project has a high chance of success because every aspect is thoroughly defined and the community is simple to navigate. This proposal provided a 15–17 week plan in great detail, complete with milestones, objectives, and anticipated completion dates. A clear roadmap and thorough descriptions of each step of the plan make it simple to monitor the project's success and progress. The budget items are likewise described in great detail, covering every component of the budget. The group behind this proposal has a lot of experience working on the project-related activities. They not only take an active role in the neighborhood, but they also support other ideas and projects. With the above reasons, I would once again say that the feasibility of this project is high.", "q1r": 4, "q2": "The proposal provides a very detailed road map, with checkpoints and tasks that must be finished every week until final delivery. This makes it straightforward for sponsors to test the proposal and then provide the necessary reports to the IOG. The KPIs are easy to monitor, very relevant to the proposal's objectives and scope, and very clearly defined success metrics that can be used to assess the proposal's influence on the goal. I am confident that the team will complete the project successfully despite the fact that this is a brand-new proposal that has never obtained funding before because of the team's background and what the proposal stands for.", "q2r": 4, "assessor": "z_assessor_2916", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 5333, "q0": "This proposal will provide a good amount of knowledge to young people all over the world. As the project mentioned, the number of internet participants in the world is very large, but access to accurate information about blockchain is extremely limited. By connecting young people with blockchain and cardano with the Youth Block program, it creates an opportunity for young people to have a deeper insight into blockchain and cardano. This project will create an abundant human resource for the cardano community, allowing young people to connect with professionals. from here will create a strong cardano community. The idea of both creating business value and giving back to the community is a good idea.", "q0r": 5, "q1": "Personally, I am very interested in the content of knowledge that projects impart to young people. I am really surprised that Only 20 USD I can learn what is a blockchain?,a Bit of a history,.... and many other knowledge on blockchainlearning.center . This is a world-class project, but its members have very good knowledge and skills. With very quality support from Cardashift, Catalyst School, C4C. I believe this project will be successful.", "q1r": 5, "q2": "The development target to 2030 shows that this is a carefully built project, developing step by step. Although there are no specific parameters for auditability, the project has dedicated google directories where it will be. Gather all documents, presentations and progress reports. with the foundation of the Junior Education Program shared in the 8 fund. So I have no doubts about the auditability of this project.", "q2r": 5, "assessor": "z_assessor_2693", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 4800, "q0": "The problem of schools that fail to equip youth with the skills to access networks, navigate and flourish in the globalized digital economy is clearly pointed out. The proposer offers a solution to this problem by developing an education for sustainable development Cardano Youth program. In the section “describe your proposed solution”, the proposer nicely elaborates and presents how this project would add value to the Cardano ecosystem. A plan for future sustainability is clearly presented. The proposer lists key metrics that meet the parameters of the challenge and the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "The team is presented transparently so that we know who will work on this project and how many people the team consists of. From the links provided by social networks, the community has a clear insight that the team has all the necessary skills and knowledge, experience and expertise for the realization of this project. The team presents a budget that is realistic, but I would like to see exactly where the money will be allocated and how many hours it will take to complete the work. A more detailed budget breakdown is also missing. The team presents a plan for implementation with a time frame within the project will be realized, but I would like to see which of the team members do the tasks presented in the plan and how many working hours are required to maintain certain parts of the project. The proposer points out that this project has small risk and that the team is ready if risks arise.", "q1r": 4, "q2": "I would like to see when this project starts, is it this year or next year? It would be great to know the beginning of the project is it in Q4 2022, and the end of the project is it in Q2 2023? Through the KPIs presented by the team, the community can monitor the progress and development of the project. ", "q2r": 4, "assessor": "z_assessor_2616", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 4003, "q0": "This proposal aims to create educational material (or adapt existing material) so that it is tailored to youths (focus group of around 19-24 years old). For this project, the proposer aims to conduct research, publish the material on the Blockchain Learning Center and develop a community called the Youth Block Open Source Education Program. Basically, the proposers wants to build a foundation for young people that enter into the blockchain/Cardano world, step by step. Looking at the larger plan and how the proposal fits into the larger scheme, the proposal has great opportunity to bring great value not only to Cardano, but also everything Blockchain-related. \n\nIn my experience as a teacher and researcher, I know by fact the value of the need to adapt educational material to what group you are teaching. Not only in order to reach the target group, but also for them to understand the material in the best way possible. And this is exactly what the proposing team seems to understand. Lowering the barrier of entry to learning about blockchain technology, creating networking platforms where people can connect and communicate, updating and growing the educational approach, collaborating with different organizations. It all matters. The proposal itself may be tiny in proportion to the big picture, but it is an important step. As stated in the proposal, the potential market is up to 738 million youths, even reaching out to a fraction of that number would be valuable. And by incorporating collaborations and networks, it will (hopefully) grow by itself. Having collaboration partners like Wada and Catalyst School may help in increasing the outreach of the project, and act as guidance since both groups have plenty experience from different angles of the Cardano Ecosystem. \u2028\u2028 I would have loved to see a deeper explanation on how the proposer means to incorporate these youths becoming proposers themselves (in accordance to the challenge brief), even if this is a first stage of the process it would be nice to see some details on the planned journey from unknowing youth to proposer. I agree that the proposal effectively address the challenge, even though it is missing parts of the specific focus described in the challenge. ", "q0r": 4, "q1": "We are presented with 5 core team members, and a couple of big collaboration groups, all of them trustworthy and well known within the Cardano Community (Cardano4Climate, SustainableADA, Cardashift, Wada, Catalyst School, etc). The teams expertise is listed (and can be verified through LinkedIn-profiles and official websites), but considering the large scope of the people involved, I would have liked to see some clarifications on responsibilities for each person. Who will work on what, and what level of involvement will the collaborating groups have in the development of the project? This information is well needed when assessing the workload connected to the roadmap. \nThere is a clear roadmap provided with milestones on a timeframe, which looks realistic (depending on the workload of each team member). It is probably a good decision to post the first batch of educational materials on an already existing platform, that will take some pressure off of developing their own platform in tandem with the material. \n\nThe budget could be expanded upon by adding details on which team members will be part of conducting research, who will make the educational content, etc. Even better if there was also an estimate of the working hours for each team member, in relation to the budget and the roadmap. For example: Person X works with edu-material 15h/week for Y amount of USD per hour during Phase 2 of the development process. At the moment the budget could be a lot of different things (since it only contains Research - 2000USD and Content creation - 3000 USD). \u2028\u2028In order to achieve the long term goal of the idea behind this proposal, the team will have to apply for further funding, which they state in the proposal. \u2028\u2028Worth mentioning is that the people involved in this proposal also Is part of other proposals in this fund. Since there are a few different people involved it is very important to be transparent on who does what (as mentioned before) and if these people are working with other projects in tandem. A quick look through ideascale show that one of the team members is part of at least 3 other proposals, which might affect the work performance of this one. In my experience as a recurring PA, fragmented time and attention may run the risk of fragmented time and performance. There is nothing wrong with being involved in many projects, but it is my opinion that this should be clearly communicated to the community. There is a lot of really great information in the proposal, but I would suggest to make that information more clearly presented, so that the reader won’t have lots of questions at the end. Based on the reasons stated above, I neither agree or disagree that this proposal will be implemented successfully. ", "q1r": 3, "q2": "Like I’ve hinted at before under ’feasibility’, transparency and communication is key. Luckily, the proposer addresses this and provide us with both an official Discord channel, and Twitter handle. It is a widely used means of communication, and the community will be able to follow the development progress easily if the team posts somewhat regularly. Using the social channels of SustainableADA and Cardashift is also a good strategy to increase exposure. I also love the fact that the team aims to have monthly summaries of their development progress. \nAs mentioned before, the roadmap is detailed and provide us with a clear timeframe, divided in three phases. \n\u2028The proposers intends to measure the success of the (hopefully) implemented project by tracking number of educational materials created, courses created and new partnerships. A suggestion here would be to include number of people who is partaking in the educational material instead of partnerships (since this challenge is focusing on student entrepreneurs and engineers, and not collaborations).\n\u2028One of the USPs for this project is the fact that it is open source, which is great for both transparency and inclusion of new people. \nConclusively, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_2504", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3836, "q0": "This proposal aims to use existing resources and develop tailor made educational resources for youth learners, educate them and get them into the Cardano Community. The problem statement is clear and easy to understand. \nThe proposer wants to create an open source model for the program called Youth Block, which is a platform for the youth to connect.\nFor the proposal to address the challenge, mention is made of the fact that most student entrepreneurs are suffering from resource shortages, especially in funding and engineer recruitment; and for this reason, the proposal seeks to help provide more resources to youth, onboarding them into the blockchain space; provide these youth with the appropriate skills to properly be onboarded and educated about blockchain technology and crypto currencies. \nIn partnership with the Commonwealth, UNESCAP, Wada, Catalyst School, etc., they aim to offer a program for all youth, and plan to to have a lead on each continent, multilingual program and transformative education. \nThe proposal mentioned that there is minimal risk associated with the project.\nThis proposal has effectively addressed the challenge. My rating is 5.", "q0r": 5, "q1": "The plan provided by this proposal shows phases of the work outlined in the proposal.\nThe roadmap shows a duration of 17 weeks of project work which has been divided into weeks of specific duties and activities. \nThe 1st phase of the project indicates March to June, and the rest in that order in weeks till 17th week. However the particular year is not showing here, whether it is 2022 or 2023.\nThe budget requested is $5000 which meets the maximum required. However the breakdown is not comprehensive. For instance, the research budgeted cost could be sub divided into payment for researchers for a period of months, calculated in that order, to make it clearer.\nThe team is made up of about 8 people with various experiences which are relevant for implementing the project. With Catalyst School's involvement, the project can be very successful. \nThe proposal has indicated that they may propose again in next funds to continue to support the youth who wish to join the blockchain space. \nIt is indicated that the team is involved in other proposals in Fund9.\nWith the few issues raised above in respect of the plan and the budget, I will give 4, but on the whole the proposal can be implemented successfully.", "q1r": 4, "q2": "In tracking the progress of work in this proposal, the proposer has mentioned that updates throughout the process will be put on the Youth Block Twitter, and Sustainable ADA/Cardashift Social streams. Also indicated that information will be shared with the community. Metrics to measure the work are records of meetings, monthly summary of videos and content, to mention a few. \nAccording to this proposal, success will be seen as people fulfilling roles that are meaningful for them and that contribute to shared success. Also young people helped by Catalyst to reach their potential is a success story.\nAt the end of the project, another success is about the release of their first two courses on blockchain learning center, and making all of their developed resources open source and open to all.  It is indicated as a new proposal. \nWith all the given relevant information, the audit of this proposal will be successful. My rating is 5. ", "q2r": 5, "assessor": "z_assessor_2483", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 3506, "q0": "Of the large team of proposers, young Benjamin Ben Zvi seems to be the only one eligible to participate in the Challenge \"Challenge & Scouted for Students\".  I find the experience and knowledge of the other team members admirable and outstanding but outside the guidelines clearly stipulated by the Challenge to which they are submitting this proposal. The fundamental motivation behind the \"Challenge & Scouted for Students\" Challenge, approved by the Catalyst community last fund, is to provide college and university students with a space completely separate from the regular Catalyst environment in which they can bring their projects to Project Catalyst and secure base funding, nothing financially ambitious. Clumsy projects, with flaws or weaknesses if any, but with a true innovative and creative student spirit, insolent and daring, that will lead their authors to find in our community a place to learn and get involved, a playground endowed not only with money, but more importantly, with the possibility to get hands on with the best technology in the industry while having access to the knowledge, experience and sense of collaboration of Catalyst members. A new concept for Catalyst no doubt, but an efficient one: in the student community of the planet lies that needle in the haystack that ends up changing the game we play so tightly with other blockchains and the legacy world, and it is our obligation to build the best of the magnets to find it. That's just what this Challenge is trying to do: build a suitable habitat for students, designed primarily by the students themselves. \n\nBecause of my affinity with this Challenge (formal experience in education at school, university, company level) and my experience in Project Catalyst (actively participating in 90% of the community positions that exist: CA, VCA, Challenge Team member, funded proposer, involvement in multiple projects in Catalyst) I have been following it closely since it was approved at F8, because it never ceases to amaze me how often the scoreboard seeks to augment itself with topics of undeniable importance (Developer Ecosystem, Cross-Chain Collaboration, The Great Migration (From Ethereum)) to the point of discarding areas that in the real world have proven to be an inexhaustible source of ideas, creativity and results, such as those related to students.\n\nAs an educator and experienced Project Catalyst member,  I understand the intention behind the proposal and consider it completely valid. However, it is evident that it is not being completely proposed by the type of students that the Community decided to support through this Challenge, therefore it does not fit the parameters of the Challenge.  I quote (excerpted from the Challenge information): \"By creating a category of students and increasing exposure for their ideas, they can expect easier funding and to be scouted by engineers\" (section What does success look like?). \"Most student entrepreneurs suffer from a shortage of resources, especially when it comes to funding and hiring engineers\" (Why is this important? section). \"However, the number of proposals to Catalysts is increasing rapidly, and the community does not readily perceive small-scale proposals from students. .... Therefore, to make it easier for the community to recognize new ideas from students, we will establish a new category exclusively for students\" (Challenge brief section). \n\nTaking into account the above reasoning, I must remove three stars from the final rating.  \n", "q0r": 2, "q1": "As an educator, I understand the process being pursued.  It is reasonably in line with the efforts of projects of this kind that are usually implemented.  On the other hand, the budget definitely needs to be more detailed and connected to the implementation activities being described in the plan.  The experience of the implementation team is stellar.   It is precisely this last characteristic that makes the current proposal inadequate in its execution: it is competing in a category whose guidelines it is not respecting.  The Challenge guidelines are clearly established.  Taking into account all of the above reasoning, I must remove four stars from the final rating.", "q1r": 1, "q2": "\nThere is no doubt that the proposers have a great willingness to have their proposal audited.  It is possible to perceive a great openness of access to information along with a wide availability of highly reputable channels to deliver it.  However, the most important issue to keep in mind is: measuring the performance of this project would mean measuring the performance of a project that is outside the guidelines that were clearly given to the Challenge “Challenge & Scouted for Students”  competitors.  Therefore, similar to trying to break a physical law, I see the measurement of the project as impossible.  Consequently, I must remove 4 stars from the final rating.", "q2r": 1, "assessor": "z_assessor_2462", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8050, "q0": "We know that young people in general have come into contact with digital content at an increasingly early age. However, if they are not correctly directed towards acquiring knowledge, they may waste valuable time in the search for knowledge that is really relevant. Although we learned many things as we went along, due to the lack of prior knowledge of our predecessors, since most of the knowledge in this area was not accessible to our parents or grandparents, we currently have a very different situation, in which the younger people generally know more about digital technologies than we do.\n\nUsing the knowledge we have had so far with our mistakes and our successes for the education of the youngest is a fundamental tool for them to obtain individual and collective success, accelerating in time the achievement of results that perhaps we would take much longer to achieve, in case we didn't follow a satisfactory plan. The clarification of what the system is, the correct way to use it for the benefit of the community, and the advantages that the system can bring to the human development of the community, and of humanity itself, through the exchange of experiences, will have resulted very positive in training future developers.\n\nThe basic model of education, always in need of transformation and development to better deal with the diverse talents that students have, directing their skills to certain areas of knowledge, will be even more revolutionary in the face of the challenge of a new proposal for the provision of services and their remuneration. However, this new model will serve to better take advantage of the talents of people who will be involved in projects with which they really identify. And in this new model of communication between countries, the formation of diverse groups with different ideas and different previous experiences will greatly enrich the composition of ideas for the planning of innovative projects.\n\nThe success of a model in which we can obtain the best results for a given project basically depends on the way it is built. The promotion of distance education in the digital model can offer young people and children around the world the possibility of taking advantage of an innate talent, however different it may be. The performance of a remunerated activity in a fair way and compatible with your reality is the final objective of this education, because there will always be a specific market for each of these skills, even if not locally available, but facilitated by the possibility of providing a service to the distance. Even though children probably hear about cryptocurrencies before the age of 18, solid knowledge about these new technologies and the best way to deal with them, including for better planning for their future, should materialize from when they already have. are of age and autonomy to manage their own assets. The transformation of service delivery systems and their remuneration will undergo a transformation that is an irreversible path, and therefore it is necessary to prepare our young people to deal with this new technology in a responsible and productive way.\nThe proposal to create mechanisms for the absorption of young people into the labor market in a model different from the conventional one, usually offered to them, will provide the possibility of selecting work opportunities compatible with their individual abilities, seeking the necessary motivation to carry out an activity that bring not only a fair remuneration, but also maintain interest in a motivating project throughout their lives.\n", "q0r": 5, "q1": "Considering the need to educate young people so that they know better how to manage their own patrimony, and understanding that it is necessary to build a society in which everyone has access to knowledge and the sustainability of projects, we conclude once again that early education on new technologies will be of great value to avoid future inconveniences. The challenge is to do this efficiently, since it is a new idea, with new values to be learned, with new perspectives and also new purposes. And for young people to learn how all this works, it will be necessary to build innovative teaching material that is easy to understand at the same time. The idea of exploring individualities and systems, whether in relation to ecology or sociology, no longer fits into an idea of a sustainable world. The challenge is to make the new generations pay attention to the importance of learning to deal with values and talents in a fairer way. For these purposes, the team proposes an initial phase of content creation, looking for previous examples to be improved, adapting them to the existing resources today. In the second phase, once the models to be followed have been chosen, the team will dedicate itself to developing the first materials to be offered to young apprentices. This phase also includes the presentation of the materials to the partners, for internal adjustments, before the presentation. From the seventeenth week, the proposal is to share the first content with the community. We consider that this is the most important phase of this planning, because the correct choice of matrices to be developed will determine the success or not in reaching the final objective. The $5000 resource distribution is split between: $2000 for research and $3000 for content creation. As for this distribution, we imagine that the proportion may not be the most adequate, since the research will probably involve fewer people and less time than the second phase, which is dedicated to the actual creation of the content, in which much more time will be required. As well as the creation of content, which will require the participation of several professionals in different areas, such as pedagogy and technology itself. Although there is no influence on the total value which is limited to 5000, we believe that the distribution of $1000 for the research phase and $4000 for the creation phase is more coherent.\nAs for the description of the team, it seems to us to be well-prepared, with sufficient knowledge about the technology in question, in a mixed team in which younger people associate with more experienced ones, which can enrich the experience of building a new educational model. focused on Cardano blockchain technology. The proposition of exchanging experiences with partners involved in various development problems around the world provides a better foundation for the construction of this educational project, which needs to contemplate the needs of young people in different parts of the world, adapting locally to the needs of each of these places.\n", "q1r": 4, "q2": "As important as implementing a good project, is being able to measure its results. To promote its success in the long term, it will be important to keep the teaching materials constantly updated, especially as it is an innovative subject that will require educators to have the ability to adapt content that is not yet part of conventional education, to a language easy to understand. The proposal to keep the meetings recorded for future adjustments of doubts and the preparation of monthly summaries accessible to everyone involved in the program will facilitate the auditability of the project. It is also important to feed an information system on the follow-up of the work in which the people trained by the project will work. Knowing how many of them perpetuated in the performance of jobs involved with blockchain technology, and measuring the number of projects they were able to get involved in will be a good way to audit the success of the venture. A kind of database that records the trajectory of these students, after their initial training, will be able to show how many of them really engaged with the new technology, and managed to continue working with it. The natural tendency is that with the increase of the market that embraces the new technology, more content has to be taught to those who intend to work with it. And with that, the continued transformation of the material used for this teaching becomes fundamental. Understanding the effectiveness of these transformations, which are constantly necessary, will have a fundamental impact on the understanding of the results achieved. Monitoring the final results of the projects in which these future students will be involved is one of the ways to measure the success of the initial project. It is not enough just to provide initial information, about the number of students who graduated, soon after the work was concluded, about how many of them dedicated themselves to a project involving the new technology. However, continued monitoring, over the years, will bring more consistent information about the achievement of goals to be achieved for the future. Something that can be fed by the student himself, recording his performance in engagement in projects, over months, or maybe years. The awareness of these students about the importance of feeding this database will be fundamental for future evaluations on the impact that this action will have over the next few years, regarding the training of new project developers. The team's proposal looks good, but it can be improved in terms of auditability, and here are some suggestions for this.", "q2r": 4, "assessor": "z_assessor_2941", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 14279, "q0": "The proposal effectively addresses the challenge because it shows how students suffering from resource shortages (funding and recruitment opportunities) will be granted help by onboarding them on a blockchain space to be given the necessary resources in order to avoid confusion in the blockchain ecosystem. This proposal can project a lot of youthful ideas and create a broader understanding of the blockchain. Kudos to the proposal team!", "q0r": 4, "q1": "It can be implemented successfully because research is being applied to the proposal so thus, they can give concrete facts with relevant statistics on whether the youth will be interested in the blockchain. Also, they have a formidable team who have worked on different proposals in previous funds. They are also creating an open source network which always people easily monitor their progress when the need arises.", "q1r": 4, "q2": "The information provided for this proposal is more than enough to track its progress and measure its success. The proposal also meets the requirements of two sustainable development goals and its subgoals. Even though the information provided for their risks and its management was insufficient, their rate of success looks promising", "q2r": 4, "assessor": "z_assessor_3955", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1}], "solution": "Adapt existing resources and develop tailor made educational resources for youth learners. As part of a structured educational content for youth bridging them into the Cardano community.", "experience": "Cardashift, Sustainable ADA, Cardano4Climate, Highly engaged Cardano + Catalyst veterans funded in Fund 5,6,7,8, experienced educator in schools + universities, researchers, entrepreneurs, business development."}