{"id": 423099, "author": "mustapha", "title": "Catalyst for MBA Students.", "url": "https://cardano.ideascale.com/a/dtd/423099-48088", "category": 26599, "amount": 5000, "description": "There is a no reliable open fundraising platform for student entrepreneurs nor a business incubator for students to access free resources so they can successfully start and grow their businesses.", "f6_no_assessments": 19, "f6_rating": 4.12280701754386, "videos": [], "media": [], "f6_assessments": [{"id": 3515, "q0": "Most of my career I have been involved in education, both at the formal level (school, university, companies) and at the informal level.  In fact, in one way or another I have stuck my head in as many educational processes as I could.  Thanks to that, I can clearly understand what is involved in the process of creating and defending an idea, trying to do something good, something positive, with what you have, while enduring the pain as much as you can.  So I understand the young people who are presenting their proposals in this challenge.  \n\nA blockchain whose purpose is to be around for the next 100 years (as is the case of Cardano) should cultivate this kind of outreach events that highlight our attributes as a platform for innovation and productive creativity and that leave aside any speculative type of promotion.  These types of events become working cells where students can begin to explore their possibilities and progressively understand how they as creators can fit into our ecosystem.  If we add to this the fact that this proposal is aimed at a nascent cohort of new entrepreneurs, and in general young people with a productive and creative life ahead of them, it can be concluded that basically this proposal is a hotbed of new Catalyst members with the possibility that their projects will bring new users to the Cardano blockchain.  This type of public already has its ears and mind completely open to new scenarios in which to propose, create, build, collaborate, share. \n \nConsequently, I find this proposal in line with the objectives of the challenge and with building the future of Cardano.  ", "q0r": 5, "q1": "From my experience I can say that the proposal suggests a simple execution scenario, easily controllable for the executor.  The line of development of the project presented by the proponent corresponds to an educational process that tries to acquaint students with the ins and outs of an ecosystem such as Catalyst, all from a practical approach.  The way in which the budget is intended to be invested corresponds to the reality of carrying out this kind of events and projects in general in developing countries like Ghana: the purchase of equipment that seems excessive in a first world country is an insurmountable obstacle in third world countries (just the kind of places where Cardano wishes to act to the best of its ability).  The difficulties in these places are real.  At the same time, I note that with the proponent's attempt to stretch the reduced budget ($5000) to the maximum of its possibilities, including providing the finalists with seed money for their projects ($200 becomes an interesting incentive at an exchange rate level that sparks curiosity about what is possible at Catalyst and Cardano).  On the other hand, a review of the information on his Linkedin page shows a work in education that is not afraid to roll up its sleeves: his resume includes a wealth of work in education and volunteer work in the same area.  The photographic material provided allows us to see Cardano's promotional work already well underway.  Therefore, I find the implementation of this project feasible and in line with the reality and needs of developing countries.", "q1r": 5, "q2": "As I said in the Feasibility assessment, this type of projects are easily controllable: it is easy to follow the variables involved in their execution.  Evidence of efficient or irresponsible execution is easy to extract.  The ways of measuring project progress outlined in the subsection \"Please describe what you will measure to track your project's progress, and how will you measure these?\" present tangible measurement parameters.  The project vision, described in the subsection \"What does success for this project look like?\" describes a project that will reduce the time it takes for a new member to adapt to the dynamics of Catalyst: graduates of each cohort will arrive in our ecosystem with a clear understanding of where to go and what to do.  Therefore, I find it feasible to measure the results of this project, whatever they may be (positive or negative), in the framework of a process that would function as an introductory school for new members to Project Catalyst.  ", "q2r": 5, "assessor": "z_assessor_2462", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 13402, "q0": "The proposal should meet the challenge, but it is not well-thought-out to be implemented. The proposal contains a couple of omissions, Financially, it is unrealistic due to the fact that a lot is invested in it. It may still happen that students are not interested enough because their goal is to interest at least 100 students. This proposal does not include a reward, which would demoralize the participants who would not see the purpose of their efforts. This problem does not have a stated solution in the proposal. So it would lead to the very failure of this entire project, and at the end of the day, this proposal would not effectively fulfill the given challenge.", "q0r": 3, "q1": "Previous projects mostly aimed at students as their audience, however, this proposal has in mind the inclusion of the entire civil society in addition to students. The proposal is based specifically on Vienna, on the dissemination of information about the Cardano platform throughout Vienna. Cardano strives to expand awareness of this platform to as many people as possible, and this proposal fully fulfills that. The problem may be that people would not be fully interested in this project. People would not put a lot of effort into completing the tasks, because they would not see the goal, nor the reward of everything that. No man would spend so much energy in something that will not pay off. Just joining the Cardano world should be a reward for those participants, however, what if they don't have enough time to participate in all those workshops? The workshops would last a longer period of time, which is too much for the average person to meet, due to his own obligations (school, work", "q1r": 4, "q2": "We have received a number of information from the field of finance and time, as well as contacts. The main contact is specifically described, which is quite enough for one proposal. However, the information that is not listed in full is the solution to another problem, which is also not listed. It is impossible to exist only one problem. There is no solution for the problem of students' lack of interest, because there is still a lack of motivation for their complete dedication and investment of effort. This amount of information would be too small to meet such a challenge.", "q2r": 3, "assessor": "z_assessor_3617", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 12276, "q0": "The proposal addresses a problem in the challenge that needs to be solved. Targeting students at the graduate level will be more beneficial since they already have the experience from previous studies and are more likely to be committed to seeing their business ideas succeed. The proposer is a single person and did not include a plan to involve other people to enhance the training program.", "q0r": 3, "q1": "The proposer is already used to the online system of teaching and learning and his approach to his proposal is within an environment that he is well informed. He indicated in the budget that 10 successful projects will be selected and funded which is a good initiative that will motivate the participants even before they are fully onboarded unto project catalyst and the cardano ecosystem. To ensure the validity and reliability of the 10 successful proposals that will be selected out of the total (50) projects that will be presented to him, it will be necessary to employ the assistance of other team members who equally have knowledge on the cardano ecosystem and project catalyst to assist in choosing the best 10.", "q1r": 4, "q2": "The proposals KPIs are clearly stated and can be easily audited. The budget also indicates where the funds will be allocated and the use of a database to track the participants makes it easier to know the progress at each stage of the challenge. With a plan to return in the next round of funding, I will suggest that he presents a team that will assist in the training process.", "q2r": 4, "assessor": "z_assessor_3378", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 12168, "q0": "Having an education level such as MBA is prestigous and also seen as well-mannered group of people who dedicate themself to have an advanced stage toward business career and entrepreneurship. Many alumni of MBA are also having a good situation of work, by connection and more aware about perspective of business. Not only education, trainning on them will be very good atmosphere. They tend to have more solution and practical based mind toward one thing to another. The proposer clearly know the advantage of being a student of MBA and can not wait to have more ideas and startup, which we all know, in time of crypto winter ( btc winter at first ) is known as valuable time of investing on startup, especially local token creation and their utility until it produce mass product and being adopt by traditional or conventional market. The proposer outlined that, if the students able to have new business model with the backup of blockchain, in this case is Cardano blockchain, they will automatically provide and support Cardano core value and information to be widely spread. The future challenge that being address at this very moment is their lack of infrastructure from goverment, which, blockchain (DAO) will help them in various way, its core value and the conceptual thinking on the beginning of the introduction material.", "q0r": 5, "q1": "Business plan to proposal writing, ideas to generate new problem solving method, specific number of 100 students is a legit number for STP(segmenting, targeting,and positioning),50 business ideas will be the product of this proposal. Graduated students will have more opportunity and productivity on this ecosystem. The feasibility studies toward funding request is still make sense due to the risk of their challenge (router etc), support to other students on technical issues. But incentives for host around 4 time attendance is a little bit expensive ( only one people manage this project). Turning online MBA timeframe to offline meetup will also be a new challenge.", "q1r": 3, "q2": "Yes Indeed, a tracking will be necessary to be done afterward. on how the Proposer create a sustain project will be necessary too. Since tagging and repost are a small step to support the Cardano ecosystem, the expectation to MBA Students are rather be high. They can accomplish more bridging channels and new potential leads, then turn them into a new partnership or even conduct an event locally with many key actors. Having a reward for 10 innovative business ideas will make them encourage at first, but if the Proposer let them to be involved on the next agenda, fund9 and more, They will have a wide perspective more, of course.", "q2r": 5, "assessor": "z_assessor_3362", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 11968, "q0": "This is a great doorway for younger generations to gain knowledge of Web3, especially in the field of business. I believe this is a real impact that could flourish students in Ghana about the importance of blockchain technology, moreover, Cardano. Project Catalyst have so many entrepreniural challenges that could improve students' ability to enhance their business skills. The fact that this is done in Ghana, is a plus, as this is providing opportunities to a place/country with small accessibility towards digital developments. With Cardano's open-source and great community, there is always room for the youth to get involved with the pioneers here in the ecosystem. From this bear market, we have learned that times ahead are more towards how cryptocurrencies have use cases that impact daily lives of ordinary people. We need to move on from protocols that circulate only around the ecosystem, and make true value for helping the ones that need to carry our future in the digital age. I truly support this idea, and would love to see the objectives are met. ", "q0r": 5, "q1": "The budget required is very reasonable, and I have such respect on the project. I believe that the team/host have relevant experience as how the proposal have stated.  Though, I think that the proposer can provide a more detailed points on their education programme and their intensive training. For example, First Saturday, hours of session on Catalyst introduction can be stated - as well as what are the content of the session on Catalyst introduction and so on. This would help the voters to have more clarity on its programme. Also, the proposer have also mentioned that they will be expanding outreach to more students in other schools which shows that the project's vision have the potential to increase more users into Cardano. The proposer have also provided a link of his social contacts which will be very easy to reach. Overall, I think this proposal will be implemented successfully but as stated above, its plan can be further explained.", "q1r": 4, "q2": "The metrics and KPIs were well chosen and I believe they are good indicators for evaluating success, though the proposer does not detailed out much about its social media marketing and also as stated the plan. It would be great if the proposer could breakdown further on every session of the google meet/zoom, what are the contents to provide quality tracking of the project. ", "q2r": 4, "assessor": "z_assessor_3320", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 11951, "q0": "The proposal mitigated the risk very well. The scope of problem has also properly limited, however, the publication and community reach is properly planned and explained, making the impact would immensely great and publicized. The proposal has also articulated a very good reasoning by bringing up the fact that student expands their knowledge through hobbies in extra-curricular activities, and moving from that reason, it is indeed will ignite more interest from the participant relating to knowledge of Cardano and Catalyst, bringing entrepreneur community and academic studies along with it. Along with providing knowledge of Cardano to students and academy, this will also bridge towards employment and creative ideas from opening opportunities through new knowledge especially for aforementioned MBA students.", "q0r": 5, "q1": "The proposal has broken down a very good budget plan. It might need to reduce the cost for laptop since it won’t need a very hyperperforming specification (assuming the program would be only webinar as proposed). Since it will be online session, there should be only a little risk of failure and it should also be simple to execute. A little advice, a day for material in each Saturday have not mentioned the amount of hours it will take. Since the activity only existed for a day in a week, by assuming the the students might need additional session to learn further, additional day/session might needed in each week to deliver more material or opening a QnA session for the students.", "q1r": 5, "q2": "The proposal has provided related contact and relevant experiences. Recordings will also be made and along with recapped data, both will be reported to the communities. The proposal has also mentioned that activities and announcement will be published on social media, making the events and program easy to be checked and audited.", "q2r": 5, "assessor": "z_assessor_3319", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 11821, "q0": "Yes, the given proposal does effectively address the challenge. Education is one of the most important and powerful tool to empower the masses. The block chain technology is relatively a new idea to many. Only 7% of the people are aware about crypto currency of which only 3% are aware about the underlying block chain technology. Spreading awareness about the upcoming technology will not only benefit the masses but as a community we are able to grow into bigger and healthier community, with inputs from the young minds. Especially the students and younger generation will be the most benefited from acquiring the knowledge about this block chain technology and its many uses. It would encourage the innovative young minds to come forward with their ideas and plans and would give them an opportunity to proceed with their projects and overcome many challenges.\nMBA students are the future entrepreneurs and business minds. Many of them might have great ideas and plans that they want to implement but are not able to due to many challenges , of which one of the major ones in proper funding. The proposal when executed properly will give an opportunity to these students and encourage them to  participate in future project catalyst funding.\n", "q0r": 5, "q1": "Since the proposal is more focused on spreading awareness and knowledge, I believe the team will not face much technical challenges. The team has given a clear weekly roadmap on  how the plan is going to be implemented. Since the target audience is only the students of Manipal Academy of Higher Education,  and since the proper is a graduate from the same institute, the plan has very high chances of success.\nA budget breakdown was given by the team but I did have few questions on that. “$1500 for an administrative laptop.”  Is a new laptop really required?  But “$2000 for innovative startup ideas” was a great way to encourage students to start up with their ideas .  I personally felt the grand total of $5000 a bit high for the proposed plan. \nA suggestion would be to expand the project into other institutes. With the amount asked, I believe the team can easily expand the awareness program and workshops to few more institutes.  \n", "q1r": 4, "q2": "The team was clearly given a weekly schedule for the plan. The team has also provided clear methods for tracking and auditing the progress of the plan.  $2000 reserved for  10 innovative ideas is a great encouragement for students to  speak up and move forward with their ideas. The key mile stones are clearly mentioned. Around 100 students are expected to participate . The database and the media bog will help in auditing the progress of the project. \nThe project is mainly focused on spreading awareness and encouraging students to stand up and proceed with their ideas. There is no technical challenges as such that the team may face other than conducting the workshops which is via zoom or Google meets which are easily feasible. There with the amount asked I believe the team easily pull of such a workshop and can even try to expand the workshops to other institutes if possible\n", "q2r": 5, "assessor": "z_assessor_3284", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11462, "q0": "Proposal to raise the issue There is no trusted open fundraising platform for student entrepreneurs and no business incubator for students to access free resources so they can start and grow their businesses your business success. Their solution was to introduce Project Catalyst to student entrepreneurs, especially recent graduates, by educating and training them to leverage the funding and resources in Catalyst to support their ideas. or their startup. This will help limit graduate unemployment and improve economic growth and development. It fits the goal of the challenge.", "q0r": 5, "q1": "Target to train 100 MBA students within 4 Saturday sessions of October\n+ To train 100 MBA students on the Cardano project catalyst in the first week of October\n+ Provide intensive training to 100 Manipal MBA students on busines planning and proposal writing mid-October\n+ To organize an introductory advertising program for 50 bright business ideas\n+ Closing ceremony and awarding of grants\n- Required budget is $5000\n- The proponent is Mohamed Mustapha Yakubu a graduate of Manipal Institute of Higher Education (MAHE) pursuing an online MBA. He is a meeting organizer in Cardano, also works with proponents in Ghana, and is skilled at hosting webinars and physical meetings. He is experienced in organizing online as well as face-to-face meetings\n- The proposal does not specify how many hours the working time of a meeting is\n- To introduce blockchain as well as cadano platform for newcomers to be able to write a business idea based on it is quite a bit of time.\n", "q1r": 4, "q2": "The information provided to assess the progress and success of the proposal is appropriate\n1- Register and extract the database of participants to be reported with catalyst\n2- Record webinar trainings\n3- Media blog published at the end of the project\n4- Social media marketing of the project and the project catalyst with the Catalyst community tagging and the Cardano ecosystem\n5- 100 students fully participate\n6- 10 creative business ideas selected and funded\nThe success of the project is:\n- 10 innovative business ideas receive a grant of $200 each to work on.\n", "q2r": 5, "assessor": "z_assessor_3247", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 13967, "q0": "This project fits the requirements of this challenge perfectly. The purpose of this challenge is to give creative students the opportunity to get their ideas off the ground and start their own businesses. The challenge is intended to support the implementation of their ideas by educating them on how to use the funds and resources available in Catalyst. Therefore\nThis project will introduce 100 MBA students from Manipal Institute of Higher Education to Catalyst and equip them with the skills and resources to grow their businesses and start their own businesses.", "q0r": 3, "q1": "This project proposal has only one person, he is the host of CARDANO MEETUP, the task of this project is not difficult, I believe that experienced people are able to host four teaching activities, he expects to spend four Saturdays a month to teach CATALYST online to 100 students, the funding part of the purchase of computers as part of the project funding, because he himself is already hosting I believe he should be able to use the same computer to do this project, and I hope this funding can be used to promote CATALYST. In addition, $5,000 is a relatively high amount of money for four online events, in my opinion. Therefore, even though the project is feasible, it is suggested that the funding could be improved for a more effective use.\n\n", "q1r": 3, "q2": "Although the project submitter stated that the teaching and training would be divided into four weekends, the effect of 100 people attending the online activities at the same time may not be as effective as the live lectures because there are too many people and I am afraid that all students cannot be taken into account.\nDue to the large number of people in the online teaching is usually not effective, I think it is not easy to implement, even if the number of people can be audited through the video, whether it can really achieve the implementation of training and teaching is not known\n\n", "q2r": 3, "assessor": "z_assessor_3848", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 11414, "q0": "Project catalyst aims to build systems that enable the Cardano blockchain to become self sustaining by creating an ecosystem of growth and development. At the heart of this is the concept of decentralised governance, whereby the Cardano community selects shared ideas and priorities for funding, forming a cycle of sustainable and virtuous growth. As there is no reliable open fundraising platform for student entrepreneurs introducing them to project catalyst support their ideas or startups. This proposal effectively addresses the challenge and I agree with the proposal.", "q0r": 5, "q1": "The project plan includes target audience - MBA students at manipal academy of higher education, sessions on catalyst introduction, sessions on business plan and proposal writing, business pitching program,  closing and funding ceremony. The budget is outlined clearly and broken down into idenfiable items. The proposal offers a realistic timetable to complete the work. The people working with the proposal has a graduate at Manipal academy of higher education who is persuing MBA and is also a cardano meetup hosts has skills in hosting webinars and physical meetups. Given experiences and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The project progress can be tracked by extracting database of participants to be reported to catalyst and recording of webinar training, media blog published at end of project, social media marketing about the project catalyst with tagging of catalyst community. Students can achieve business ideas to receive funding of each implementation and clearly understanding more insight into cardano stands and catalyst blockchain values. Knowing the network and refreshing Pep talks with peers in catalyst community also increases the success rate. This information provided is sufficient to audit the progress and the success of proposal.", "q2r": 5, "assessor": "z_assessor_3243", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}, {"id": 8972, "q0": "As there is unemployment all over the world even for graduates, Some graduates among them would be having excellent start up ideas but they are denied for financial supplies hence this project helps in fundraising for such projects.\nThe proposed idea helps introducing the project catalyst to enthusiastic students and help them get the funding through catalyst projects which will help in boosting the importance of cardano's project among the people and helps those students to develop economically and help new ideas hence This proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer here lacks experience since he is still a student and he hasn't worked with any team before for completion of such projects .Other than that, project doesn't involve any risk as it mainly depends on the speaker ,how he'll be able to attract the people who are enthusiastic towards start up and new world catalyst ideas with less risk involved in the project plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "Proposer here has failed to explain how he'll find the true enthusiastic students and how he'll be able to keep up with other students once the project is completed. Other than that it has proper timeline mapped for the project and it has proper budget breakdown facilities, the proposer should have presented some of his experience in catalyst project which would have helped the proposal more effectively , hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 8285, "q0": "\nCardano \nCardano \n100%\n10\nE17\n\nI think this proposal succefully fits the challenge and can achieve some of the challenge's objectives. I think one the risks that couldn't be considered is that the meet-ups won't engage the students and they will abandon the classes. I have seen from personal experience that when we start a project, or a class, or anything with 100 people, we always lose some along the way: some realize that it wasn't for them, some don't find it interested enough, some can't keep up because of other activities in their lives. So I think the proposers could give some thought on ways to increase the retainment. Is it by carefully selecting the students to make sure they fit the project's profile? Is it by collecting their feedback in each meet-up to make sdjustments in the following ones? Is it by making classes dinamic and interactive?\nI think there could also be some follow up with the sutends to understand how the meet-ups impacted their life, and maybe to create a network so they are successfuly integrated in the Cardano ecosystem. \nPara ativar o suporte para leitor de tela, pressione Ctrl+Alt+Z Para saber mais sobre atalhos de teclado, pressione Ctrl+barra\n \n \n \t\t\nI think this proposal successfully fits the challenge and can achieve some of the challenge's objectives. I think one of the risks that couldn't be considered is that the meet-ups won't engage the students and they will abandon the classes. I have seen from personal experience that when we start a project, or a class, or anything with 100 people, we always lose some along the way: some realize that it wasn't for them, some don't find it interested enough, some can't keep up because of other activities in their lives. So I think the proposers could give some thought to ways to increase the retainment. Is it by carefully selecting the students to make sure they fit the project's profile? Is it by collecting their feedback in each meet-up to make adjustments in the following ones? Is it by making classes dynamic and interactive?\nI think there could also be some follow-up with the students to understand how the meet-ups impacted their life, and maybe to create a network so they are successfully integrated into the Cardano ecosystem. ", "q0r": 4, "q1": "I think the plan could be more detailed. I suppose the project itself starts before the classes, with activities such as: gathering the students, enrolling them, selecting the speakers, and preparing the meet-ups. The same can be said about what happens after the meet-ups. If 10 ideas will be funded, will there be a follow-up with them to measure their progress? So I would have liked to see more of this roadmap that goes beyond the meet-ups. \nAs for the budget, it seems feasible. The proposer seems capable, and I like how there are links to verify their background.", "q1r": 3, "q2": "I think the topics to be measured are aligned with the project and the challenge. I think the metrics could be a little more data-driven, to make sure the outcome isn't too subjective. For example, will there be a test, or a final exam to measure if the students properly absorbed the content and acquired the intended skills? Will it be measured how many of the students' projects will be funded on Project Catalyst? Will it be measured in their engagement with the community, or with each other? All in all, I think the objectives are relevant and well-selected, but there could be some more thought on how they will be measured.", "q2r": 4, "assessor": "z_assessor_2971", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 7757, "q0": "The proposal satisfies the conditions of the challenge. Both the issue and the fix are made explicit. Students are constantly looking for extracurricular activities to participate in, so they should do something outside of the classroom to build and hone the technical and soft skills that will help them achieve their career aspirations. These students have many business ideas that they would like to implement while still in school in order to address societal issues by creating a good or offering a service that will pay for themselves to live on campus. These students, however, are unable to implement their ideas because they lack the necessary support mechanisms, including money, business development training, and essential equipment. 100 students with business ideas connected to blockchain and financial technology will be educated and onboarded via this webinar.The goal and objective of this proposal are to introduce 100 MBA students to Manipal Academy of Higher Education in order to catalyze their business development and entrepreneurial skills development and to provide them with the tools and resources to do so. With the goal of instructing 100 MBA students on the Cardano project catalyst in the first week of October, as well as to give 100 Manipal MBA students extensive training on business plan and proposal writing by mid-October, to organize a business pitching event for 50 original business concepts.", "q0r": 4, "q1": "The proposer has an excellent track record and extensive experience in their sector. This proposal plans the budget and breaks it down, demonstrating that the author knows what is required to carry it out. A detailed roadmap outlining the objectives and actions taken is available. This proposal has a good likelihood of being implemented effectively given the experience and a well-written one, but I find it a little challenging because there is only one person on the workteam. I therefore chose to award it a score of 4.", "q1r": 4, "q2": "The proposal's author seems to be doing a reasonable job of outlining all the costs that can be calculated and to be asking for 5000 USD in funding, both of which are necessary to achieving the goal. The plan has recognized, understood, and is making efforts to address an actual need, therefore the resources provided are adequate to audit the progress. The knowledge and understanding of the proposer increase the likelihood that the proposal will be implemented successfully.", "q2r": 4, "assessor": "z_assessor_2916", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 7654, "q0": "The problem described in this proposal is closely aligned with the challenge.\nThe solution the proposer want to introduce to these students is  entrepreneurial skills through education and training opportunities on how to leverage for funding and resources in Catalyst to support their ideas or startups. The proposal clearly articulates how it will add value to the Cardano ecosystem through organization of webinars which will educate and onboard 100 students and  their business ideas related to Blockchain and financial technologies. The key metrics and goals of the proposal align with the outlined challenge which is looking at empowering tertiary students at Manipal Academy of Higher Education (India) into catalyst and equip them with business development, entrepreneurial skills and resources to fund their own projects independently or in groups. \nThe proposal is able to scale to address future challenges by empowering students with the practical skills and technical knowhow to participate in future projects on project catalyst. And the proposal clearly articulates a plan for the project's future sustainability by imbibing the sustainable development goal 4 - Quality Education. \n", "q0r": 5, "q1": "The proposer has provided relevant links to show the competence and how the project will be executed if the proposer receives the funding.\nThe relevant skills and experience the proposer posses that will be used to implement the proposal as the proposer is a Cardano meet-up host, and has skills in hosting webinars and physical meetups. The proposer appears as someone who is passionate about business development and startups. The budget is also clearly stated and outlined which is broken down into identifiable items. The budget is also reasonable to achieve the set goals and targets of the proposal. Moreover, the proposal offers a realistic timetable to complete the project. And the proposer has considered challenges and risks relevant to a successful implementation and how to mitigate them for the successful implementation of the project.\n\n", "q1r": 4, "q2": "The proposer has provided a clear and simple outline on how to measure the progress of the project and well-thought out Metrics/KPIs that define the success of the proposal should it be funded. Such as, 10 innovative business ideas are able to receive funding of $200 each for implementation,\nUnderstand clearly and have more insight into what Cardano stands for, Catalyst and blockchain technology. have a better knowledge and comprehension of the Cardano potentials for decentralized banking and store of value, learn the best practices and strategies to adopt to effectively and efficiently communicate and lead for Cardano (Project Catalyst), and be able to plan and prepare a concise project proposal on IdeaScale. \nThe proposer has also provided an accessible public channel for delivering regular updates to the community for auditing progress\nwhich are register and extract database of participants to be reported to catalyst, recording of webinar trainings, media blog published at end of project and social media marketing about project and project catalyst with tagging of Catalyst community and Cardano ecosystem amongst others. ", "q2r": 4, "assessor": "z_assessor_2908", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7398, "q0": "This is an incredible proposal which seeks to educate and train student entrepreneurs with brilliant ideas about catalyst and the opportunities available to support their ideas and start-ups. The idea in this proposal is to organize webinars which to me will serve as a platform to educate and onboard 100 students of Manipal Academy Of higher education. This is a brilliant idea since we are dealing with student entrepreneurs, business students are likely to have brilliant business ideas but mostly do not have the motivation and needed resources to implement those ideas to solve societal problems in their various communities. Therefore this project is an avenue for that,a platform where they are trained to write good proposals,educated on cardano and its blockchain and also providing startups for 10 innovative ideas which I find very interesting. With this said,I believe this proposal aligns and serves the purpose and goals of this challenge.  The only weakness of this part of the proposal is that,the proposer did not make it clear to us how these  MBA students will be scouted by engineers in the community,will they be scouted through the ideas they present on ideascale so that these engineers get to collaborate with them? This is not made clear to us in the proposal. Nonetheless, this proposal has an excellent idea. It aligns closely to the challenge and I believe has the likelihood of impacting cardano greatly.", "q0r": 4, "q1": "I found the timeline for delivering this project rather confusing. The author plans on using 4 days in a month( October) in delivering this project via zoom or google meet. The timeline to me is very short for such a project. The writer also talks of providing startups for 10 innovative catalyst ideas as mentioned in the budget. Does the author hope to do this via the  zoom meetings? Is he not supposed to meet these students physically before providing the start ups for them in order for him to be able to safely track the progress of those businesses? This was not soo understanding to me. The timelines and delivery dates are also not soo convincing to me.\nSecondly, though the budget meets the limit for the challenge setting,it is quite vague to me.is the proposer using $1500 dollars in purchasing just an administrative laptop? This is ambiguous to me. That amount ($1500) allocated to purchase that item(laptop) is quite vague to me and also relatively high. Also $500 dollars as incentives for the host, apparently,the author is the only host here and $500 for one person is way too much in my opinion. Again what I see in this proposal is only one person described which I believe to be the author himself, meaning he is the only one going to handling the project and I believe he has the expertise to handle the project, moreover this is going to be an online project and one person can handle this in my opinion. It is no doubt that the author has some level of experience in the cardano community. He has managed to draw a visual concept of him in our minds, from the picture at the beginning of the proposal to the attached images at the end of the proposal only tells us that the author has hosted several cardano outreach programs and for this reason has some level of experience. The only problem in terms of experience is that,the author did not tell us how capable he is,in handling this project,as in more details for us to be sure this project is likely to scale in his hands, though he stated he has skills in hosting webinars,it would have been more convenient if we got to see some sessions of webinars he hosted.", "q1r": 3, "q2": "For auditability, the author stated numerous ways the project can be tracked by the community. A media blog published at the end of the project, recordings of the webinar trainings, registering and extracting database of participants to be reported to catalyst are correct ways of tracking the success of this project. There are no delivery dates but the metrics of this project are measurable to some extent, except the funding of $200 each for 10 innovative ideas. How does the author intend to track the progress of these startups,of course,he should be able to find out the outcome of the $200 he gave out for those startups and also report back to the community on their progress. That was not made known to us and I will advise the proposer to be able to keep tracks of those startups if possible, physically, to make sure they are making progress if this project is fortunate to be funded. ", "q2r": 3, "assessor": "z_assessor_2890", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 5736, "q0": "This proposal is drafted by a student interested in making Cardano attracting to student entrepreneurs. The project desires to provide insights into Cardano for students who wish to do business with Cardano. The project is planning to fund for the ideas that are feasible to implement, thus fulfilling the most important pursuit of the challenge.", "q0r": 5, "q1": "Although the plan seems interesting and implementable, I am worried about the proposed budget for this project. First, the award for each winning startup idea, which is $200, is not enough for the students to carry out their business idea in real life. If the project could not provide a better award for the winners, the proposer should reduce the number of winners. Moreover, the proposer should consider cutting unnecessary budgets like the Internet or technical gadgets as participants can prepare these by themselves. I believe this can save more than $2000 compared to the original proposed budget, and the project can use this saving to award more to the startup winners.", "q1r": 4, "q2": "I need to know a few more things. Why do MBA students (lots of undergraduate or CS students have good Cardano startup ideas)? What is the marketing plan for the workshops? Who will qualify to host these workshops? What is the relevant experience of the proposer/host?", "q2r": 3, "assessor": "z_assessor_2741", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"id": 3846, "q0": "This proposal is about introducing Project Catalyst to student entrepreneurs, especially graduate students and supporting their students and supporting their ideas and business startups, to solve the problem stated in the proposal. These identified students, while in school have many business ideas that they can implement in order to solve societal problems by producing a product or providing a service that they can earn income from to support themselves on campus. This project webinar, according to the proposer will educate and onboard 100 students who have business ideas related to blockchain and financial technologies. It will be a one month virtual meetup for 4 Saturdays. \nAddressing the challenge, this proposal is about providing student entrepreneurs the opportunity to raise money to start or grow their businesses. This is exactly what the challenge is for, that is scouted for students.\nThe proposer has mentioned the risk associated with this project as poor internet connection. To mitigate, he said a strong laptop and 4G LTE router will be used for smoother successful webinar series. \nWith this information, the challenge is well addressed by this proposal. My rating is 5", "q0r": 5, "q1": "There is a detailed plan with milestones and timeline in the proposal. The whole project will be done and completed in the month of October 2022, as indicated. The proposal is targeting MBA students at Manipal Academy of Higher education, and they will use zoom or google meet. Topics for the 4 Saturdays in the month have been listed as well. \nThe budget requested for is $5000 which is the maximum amount allowed in this challenge. It has been broken down further into smaller budgets for various cost items like purchase of Admin laptop, 4G LTE router, incentive for Host, etc. , among others. \nThe Proposer's name in the proposal is Mohammed Mustapha Yakubu, who is a graduate at Manipal Academy of Higher Education, pursuing online MBA, a Cardano meet up Host, Proposer in Catalyst, who has passion for business start ups. LinkedIn reference has been provided in the proposal. \nThe proposer has indicated that he will return to Catalyst for more support to expand the outreach activities. He indicated again that he is not involved in any other proposal in Fund9. The information will help the proposal to be implemented successfully. My rating is 4", "q1r": 4, "q2": "Tracking progress of work in this proposal entails measuring of these parameters, such as, registering and extracting database of participants to be reported to Catalyst; recording of webinar trainings; media blog published at end of project, . to mention a few. The proposer has again said that reports would be sent to Catalyst. \nThe success of this project will be seen as 10 innovative business ideas at the end of the project; 100 students to participate fully, among others. \nIt is indicated as a new proposal.\nThe information provided will help to audit this proposal. My rating is 4.", "q2r": 4, "assessor": "z_assessor_2483", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"id": 11104, "q0": "Currently, there is no reliable open fundraising platform for student entrepreneurs, nor is there a business incubator for students to access free resources so they can start and successfully grow their businesses. mine. Faced with that situation, you made a proposal: \"Introduce Project Catalyst to student entrepreneurs so they can leverage funding and resources in Catalyst to support their ideas or startups.\" This contributes to improved access to quality and equal distribution of finance and resources for students. Proposing to give some possible risks, I think the risk is not too great, you guys have a suitable way to reduce the risk.", "q0r": 4, "q1": "Currently your plan is not specific. In my opinion you need to be clear on how you can get 100 MBA students at the Manipal Institute of Higher Education to participate in the seminar. The goal you build is to train 100 students in anointing, but with only 4 Saturdays time is not reasonable. In my opinion, guiding students to write proposals is not easy, you should have time to guide students to develop ideas, write proposals and then send drafts to you for further advice and guidance to be effective. The detailed budget table does not mention the payment of salaries for project members. Through the information about the people working on the project, I see that you need to invite some experts in the field of Blochchain technology, about Project Catalyst to make the conference really more quality.", "q1r": 4, "q2": "You build the proposed implementation plan in 4 Saturdays, actually that time is not enough to implement the plan. The content of the work in the plan is not specific. You have not provided specific information to measure project progress. This is a new project, the purpose of the project is very good, but I think you need to supplement and adjust to make the project more complete. Good luck.", "q2r": 4, "assessor": "z_assessor_3216", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 14282, "q0": "The proposal’s budget is a bit costly for the list of items shown. The proposal’s title is too broad and should be specific to the area or school’s MBA students who need this education. It is much advisable for the proposal’s writer to make the initiative more continent specific to make the reader better understand the need for better internet connectivity and network issues. Apart from that, the proposal addresses the need to educate students on Cardano through webinars and face-to-face meetings.", "q0r": 3, "q1": "The plan can be either be successfully accomplished or not because observing from the proposal, it is only one person who is going to organize and set up face-to-face meetings and webinars which can be a bit overwhelming without any help. The budget again does not favor face-to-face meetings which was included in the proposal.", "q1r": 3, "q2": "The information provided is successful to audit and track its progress because some key metrics have been stated which will be used in checking the success of the proposal overtime. The explanation also given about the purpose of the challenge is enough especially about the geographic location in which the proposal idea will be conducted. Some pictures show groups of people with brand t-shirts who seem to have an idea of Cardano and block chain which serves as a positive source of feedback to examine.", "q2r": 4, "assessor": "z_assessor_3955", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "To introduce Project Catalyst to student entrepreneurs especially graduate students by educating and training on they leverage the funding and resources in Catalyst to support their ideas or startups.", "experience": "Mohamed Mustapha Yakubu is a graduate at Manipal Academy Of Higher Education (MAHE) pursuing online MBA. He's a Cardano meet-up host, works also proposers in Ghana, and has skills in hosting webinars and physical meetups. He's passionate about business development and startups."}