{"id": 396662, "author": "yantirta", "title": "SPO Delegators Communal CNFT", "url": "https://cardano.ideascale.com/a/dtd/396662-48088", "category": 26444, "amount": 15000, "description": "Local single SPO’s are struggling to survive.", "f6_no_assessments": 6, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 3247, "q0": "The problem with the proposal is that single SPOs are economically difficult to maintain. With the team's solution of marketing SPO, NFT, and Cardano to NGOs, local culture is a smart way to get cardano to reach a large population that is unknown to web3 and Blockchain, unaware of Blockchain benefits, staking, SPO. The team proposes to leverage the NFT topic to reach more people; organize online seminars and SPO, NFT, Cardano for the community of artists, musicians, dancers. This is aimed at an audience of writers and artists who are completely unaware of technology, their access to blockchain is difficult work, so it is better to approach them as blockchain users.\nThe risk presented is that the coordination to organize the seminars is heavy so project management skills and experience play an important role in the success of this project. The proposal also provided a solution, detailing the implementation roadmap, appropriate budget allocation... I think they anticipated the tasks and risks to achieve the proposal's success.", "q0r": 4, "q1": "The proposed group has given each specific work and has a detailed plan for each week. Each job is given in 3 phases (Coordination Phase, Execution Phase, Editing Phase) in great detail. The content for each category has also been detailed by the proposed team, in addition to the detailed planned media channels such as Instegram, Twitter, Youtube, Telegram...\nThe cost is also detailed and reasonable by the team.\nThe team consists of 4 members: Yan Tirta, SPO Kawan Team, Ziemotion Studio and Ziemotion Studio are individuals with experience in SPO, Management, communication, public relations, Speakers and all have social networking links that are clear and transparent.", "q1r": 4, "q2": "Proposal builds website, Discord, telegram, Instagram (in English, Japanese, Vietnamese, Indonesian). Web consists of 2 parts, Gitbook and Landing page. At the end of the project, there are products such as: 3 workshops about SPO, NFT... 5 videos about SPO, 2 videos about NFT, 50 interactions/day on telegram and Discord. minted and air-dropped NFT... in addition, there are timelines corresponding to each product. All of these products are measurable.", "q2r": 4, "assessor": "z_assessor_1632", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3804, "q0": "This proposal has a very good impact to introduce Cardano widely to the public, especially in developing countries such as Indonesia. It is true that many people are not familiar with blockchain, but NFT in general has gone viral, especially on social media. The involvement of a single SPO will be a driving in introducing and providing guidance on blockchain, cardano, catalist projects and will publish traditional art that will be used as NFT as well as social programs which will certainly have a very good impact in publications that will trigger the spread of cardano, adding to the new SPO or add new delegators to existing SPO in order to keep the single SPO operations.", "q0r": 5, "q1": "This team showed a very good plan regarding the implementation of the project such as the creation of the NFT, the publication process, the involvement of artists who will be the source of the content as well as examples of links that can be used as a basis. It is even complete with a timeline or time for each activity process. It also shows that all the social media that are most often used by millennials are put to good use to expand promotions. But we don't see Facebook, which is also still widely used in developing countries, whose insight has the potential to promote wider content because it can also post to Instagram.\n\nFor SPO series video content for beginners, apart from providing knowledge about SPO, it would be nice to briefly explain what cardano is in general, although there are many videos on Youtube that explain this.\n\nThe budget is also very complete for each stage or sub-activity. The core team who are experienced in their field are also fully listed along with their technical abilities", "q1r": 5, "q2": "The team mentioned all the media that they will use to discuss the development of the project such as discord, telegram and instagram in several languages (English, Japanese, Vietnamese, and Indonesian). Even the website is made into 2 parts which will show the source code as well as the project explanation from the landing page. As a user or who will study this project, of course, all of this is very transparent for auditing and learning. The team has also provided an overview of the required budget, which of course we hope that they can provide reports on all the use of the budget through all the media they use.", "q2r": 5, "assessor": "z_assessor_1681", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5012, "q0": "The proposal states that it will market SPO, NFT, and Cardano to NGOs, Artists, Musicians, and Dancers as blockchain users. Aiming to develop CNFT, SPO markets in Indonesia. So it's a perfect fit for the challenge. They have foreseen the risks and have contingency plans to deal with those risks.", "q0r": 5, "q1": "The proposal provides a roadmap of the proposal divided into 4 cases, each with a detailed plan for each week. Budgets are listed into specific and logical sections. The project team has 4 members who have the experience to successfully execute the project and prove it with links to their experience.", "q1r": 5, "q2": "The information on the implementation roadmap includes defined timelines, specific KPI metrics that can measure the progress of the project. So I completely agree on the auditability of this project.", "q2r": 5, "assessor": "z_assessor_1820", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 7718, "q0": "Proposer did not mentioning any place in this proposal, until I found that proposer collaborating with Indonesian SPO and Indonesian NGO. Mentioning the place in your \"Problem Statement\" can help readers understand this proposal quickly.\nProposer take the NFT virality with holding events and inviting local artists (+ their circle) to educate community about NFT and smoothly educate them about blockchain, crypto-verse, Cardano, etc. It's a great idea to be funded!", "q0r": 4, "q1": "This proposal have a lot of work, and the team members are only 4? I hope there is a team inside a team. Outside of that, I love the idea for partnering with the relevant community! All team member credentials (LinkedIn, urls, etc) have been written completely by the proposer. Budgets detail all provided completely, and the roadmap and milestones are realistic, clear and objective.", "q1r": 5, "q2": "There is clarity in the problem, solution and in their alignment with this challenge. The metrics and KPIs described seem to be good indicators for auditing the performance and checking the success of the proposal. Progress of their projects and the key metrics will be update in Git Book. Roadmap and milestones are clear and objective, which makes checking deliverables and performance easier.", "q2r": 5, "assessor": "z_assessor_639", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7748, "q0": "This proposal identifies the problem within the challenge, which is to leverage from the case of struggling Single SPO’s community. It’s hard for single stake pool operators to maintain operational cost, while maintaining to keep it profitable. From the data, only 23% consist of Single Stake Pool, and the rest are a giant stake pool group (https://datastudio.google.com/u/0/reporting/3136c55b-635e-4f46-8e4b-b8ab54f2d460/page/p_6xvww3zcoc). This proposal tries to solve the problem by leveraging NFTs technology to attract people into the Cardano NFT  and SPO community. This proposal explains clearly on how they will implement such solution in details, from activities with SPO and CNFT community with workshops, to engagement between NGOs, artists, and local communities. Since this proposal is directed toward East Asia community, which consist around half of the world population, it will have a huge impact because it will include the non-english speaking community, and to grow East Asia community within Cardano ecosystem.", "q0r": 5, "q1": "This proposal is comprehensively written, from the team profile, detailed plans, budget breakdowns, and roadmap. They’ve also included four main activities, explained in detail, e.g 1) Communal CNFT Project involving SPO delegators, NGO’s, artists, with locals; 2) Donation with a high-profile NGO (Floating Hospital RSA dr. Lie Dharmawan); and other plans, which is evidence that the team knows what their goals and plans are. They’ve explained clearly what the content of their workshops are, e.g the contents about “SPOs for beginners”, their metrics for content creation in social media (Instagram, Twitter, Youtube, Discord), and their general community engagement. In summary, this proposal is about creating activities and community engagement together with artists and SPOs, using NFTs to attract people to join and further grow the East Asia SPOs community. Looking at their team, it is proven that they have the skill necessary to make this project a success in the long run. From the aspect of how detailed and comprehensive this proposal is written, and their team proven profile and experience, I will give this proposal a 5 star", "q1r": 5, "q2": "This proposal provides their roadmap in detail, for each of their activities. The metrics is also clear and concise, such as the number of videos created, conducting online press conference with NGOs, etc. They’ve explained well about the solution for their targeted problem, which translates into their metrics and KPIs. They will upload their progress on GitBook and their Landing page, so it will be easy for the community to track their progress. Because this proposal is transparent, clear, and concise, I will give this proposal a 5 star regarding the auditability.", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8934, "q0": "This is certainly a great idea which aims to create a series of marketing and public events that educates on SPO’s, NFT and Cardano. The author explains a list of activities of the action plans in a very good way, that makes us to be able to have a vision of the project in general. In my opinion, the proposal fits with the challenge very well because if it is successful, it will:\nincrease the number of Stake Pools and Stake Pool Operators (SPOs) based in East Asia, increase the number of proposals originating from East Asian participants in Project Catalyst, increase the number of active Cardano wallets, attract people to the financial possibilities of using CNFT, attract people to know about Catalyst Project. Therefore, it certainly adds big value to Cardano ecosystem and helps to grow Catalyst Project.", "q0r": 5, "q1": "The author provides roadmap, milestones and timetable of the project in a fully detailed and clear way to make it feasible: each of activities in the action plans has reference included (a Youtube link of Indonesian traditional music, a link of donate website for healthcare, a video on NFT education); each of those activities has sub-action plans on its own, which is explained understandable clear. Additionally, the contents of video series “SPO’s for beginers” and the content of conference presentation are also listed, and “social media channels calendar” section tells us what will be uploaded, on what social channel and how often to do as well as where and when community can be connected. Budget is broken down very clear and reasonable into identifiable items, allows us to know what the money is asking for and how much for each of them. About the team who build the project, we have information of the author with Linkedln, and his teams with links included. This project is certainly in the good hands, as I click onto each of the links and I can see their experience and skills related to the conducting this project, but I can not find out information of each of them, I think it would be more benificial if we know more about the teams, their names, their photos, how many experienced years they have, how to contact them, ect, rather than just their functions. That’s just my bonus opinion, due to all the information given, I rate the feasibility with the top of score.", "q1r": 5, "q2": "We have more than enough information to audit the success of the project: the author describes success metrics, milestones is so detailed and understandable clear that the proposal will be easy to be tracked, or we can follow activities in the action plans and sub-action as I mention above, because the author mentions all the content will be upload on the basic website (which has itself 2 parts GitBook and landing page) to be transparent to public. Therefore, the proposal is totally auditable.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Social and marketing project that educates on SPO’s, NFT and Cardano through collaboration with delegators, NGO’s and rare local culture.", "experience": "Single SPO Operator, Social Media Manager, IT Manager, GitHub admin, Event & Art Management, Public Relation practitioner, Marketing Communication Manager, Eastern Town Hall member, Indonesian Community enabler, Challenge Team member, Community Advisor."}