{"id": 397039, "author": "twomin", "title": "2Min Review by Japanese Voices", "url": "https://cardano.ideascale.com/a/dtd/397039-48088", "category": 26444, "amount": 75516, "description": "Voters and stakeholders in non-English communities, such as Japan, find it hard to understand Catalyst proposals written in English.", "f6_no_assessments": 13, "f6_rating": 4.205128205128205, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal \"2-minute assessment of The Japanese Voice\" has identified a problem in the challenge and that issue has a broad impact. It has presented a problem in the development of the Cardano community, the proposed problem is in line with the challenge, the idea is to provide a solution for community advisors, helping them facilitate the process of finding, reviewing, and evaluating other proposals in the Catalyst program of the Cardano platform. With the development of more and more proposals from catalyst funds, it will make it easy and quick for CA's to find and evaluate proposals. The proposal presents the problem clearly and convincingly. It has come up with solutions to a problem in the development of the Cardano community, which is the development of catalyst's advisory community. The specific solution of the proposal is to create short 2-minute videos and podcasts that make it easier for co-advisors to access information about proposals in fund challenges. In 2 minutes the video/podcast team gives general information, pros and cons of each proposal, and put it on youtube/Spotify. Therefore, based on the proposal tool, community advisors will shorten the time it takes to search and evaluate other proposals in the fund and are likely to consider many other proposals. Thus increasing the performance of comments and reviews in their community advisory roles. The team proposes to present concrete evidence in the presentation with arguments with specific and feasible numbers, with high efficiency. Showing that the proposing team has carefully studied the development of proposals across each fund and the needs of community advisers, answering the question: How to increase the effectiveness of evaluating proposals that meet the requirements of voters? The specific objectives of the product you propose are: to gather information related to the recommendations of the funds, to give advantages and disadvantages thereby helping community advisors, in the shortest time but the most evaluated and the most quality. The proposal identified several risks during implementation and came up with solutions to overcome all those risks. You have pointed out two risks in the process of doing the job and have solutions to overcome and limit those risks. In the first risk, the proposing team indicates that it is possible to miss out on quality proposals throughout the fund, which is inevitable, and the solution you come up with is a budget to ensure quality, which is a viable idea. In the second risk, the proposing team has pinpointed the problem that many other proposals also raised, which is true, which is the price movement of ADA Token in the market and you have come up with the appropriate solution. with the current cryptocurrency market, including ADA Token. However, I have suggestions for the team on solutions to overcome and limit the risks that you have indicated. In the first risk, you can only solve one side, which is internal, I expect you to separate the product into challenging groups, it will be effective and highly specialized; In the second risk, you need to come up with a long-term solution, when the price of ADA Token in the market fluctuates sharply, it will ensure the interests of participants and the success of the proposal. I rated: 4 points.", "q0r": 4, "q1": "The proposal has set clear, detailed, and reasonable timelines for carrying out work with specific objectives. The proposal clearly defines clear and reasonable timelines and work results along with detailed objectives for each job. In terms of timelines, the proposing team presented the target plan in fund 9 (500 videos) and fund 10 (600 videos) with specific and very feasible numbers. The results in the implementation of the proposal are easy to check and constantly update through tools, video products, and podcasts on popular social networking platforms such as Telegram, Youtube, Spotify of the proposing group. The proposal accounts for less than 50% of the fund's budget capital ($75,516 for both funds 9 and 10) and plans to allocate reasonable expenditures for each specific activity. Have a detailed plan for budget allocation, which is specific, clear, and transparent. The proposed plan in the additional budget is quite reasonable. However, an additional provision is needed in case more videos and podcasts are shared than expected. The proposal assigns specific tasks to each member; Experience related to assigned tasks; The identities of team members are easy to verify. The proposal also analyzes tasks for each specific, appropriate, and highly specialized group of members, each of which will be in charge of a public department. The work is based on the competence and experience of each team member. The list of core groups and members is easy to identify, has YouTube links, has telegram, Twitter, Linkedin, Facebook accounts. I rated: 5 points", "q1r": 5, "q2": "The proposal provides KPIs, making it easy to accurately quantify the effectiveness of the proposal and easy to check. The proposal has three figures/KPIs to measure project performance and progress (Telegram, Youtube, Spotify). Metrics/KPIs are easy to measure and easy to check (video, watch time, viewed rate, new subscribers). Accessible at any time, anywhere clearly showing the number and work results. The proposal has clearly defined success and has been successfully tested in practice. This proposal is feasible and very successful. The success of the proposal clearly describes the results achieved with videos and podcasts, the number of participants, and the number of visitors. The goal of the proposal is to shorten the time it takes to find information and evaluate proposals throughout the fund as quickly and easily as possible. The proposal has never been funded but the project has been funded, namely 4 proposals and funded in funds 6 and 7.  I rated: 4 points.", "q2r": 4, "assessor": "z_assessor_1410", "no_vca": 7, "ne": 4, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "This proposal is very useful and certainly achieves the objectives of the challenge, because it aims to create summaries of Catalyst proposals in video/audio format (maximum 2 minutes in length). With this, it is intended that such information be disseminated in a clearer and more democratic way, since the team intends to create these summaries in a more accessible way, so that both a lay public on the blockchain and experienced people have a good reach of the contents. created. This directly affects what we are looking for in the challenge as such media would be created in Japanese, thus favoring one of the countries located in the targeted geographic area. Certainly, with the realization of this project, people from the chosen location would have a better participation in Catalyst, as they would be aware of more proposals and thus improve their voting quality, as the authors themselves explain. One of the reasons why this project is necessary is the undeniable fact that the number of proposals has been growing exponentially with the passage of funds, making it very difficult for CAs, voters and members of the Cardano community to have time to follow all the news. in the various challenges. With this, the specific objective of “increase the participation of the Cardano community and Catalyst teams with East Asian residents” would be fully addressed. \n", "q0r": 5, "q1": "The roadmap is very detailed, the team takes care to explain what small tasks would be necessary for the larger product to be created. However, I believe that some of these tasks could have a further explanation, for example, they say that first the proposals to be summarized would be filtered. Who would do this, and what criteria (they cite there are criteria) would be adopted? The review of audios and videos would be performed by whom? I felt a little lack of more detail regarding these things. However, they divide the phases well, according to the funds, they could also establish the duration of each task, that is, how long each specific thing would take to be performed. Regarding this part, I believe it is good, but with such improvements it would be even better. Talking about the budget division, it is very well explained. We know exactly how much money would be used in each fund and what it would cost how much, including the value of the working hours of the professionals involved. The calculations are done so that we have a solid idea of ​​what adds up to what results in the final amount, excluding any doubts about this part of the project. And finally, about the team involved, we also have a great amount of detail. We know the name of each team member, what they would do in the project and they attach links that prove some of the activities they have developed previously. In this way, total confidence is transmitted in the team to execute this project successfully - for me this is the best way to present the team, through proof of their CVs. So everything is great on this topic, I just suggest more detail in the script, but not that it is bad, but that it could be even better. \n", "q1r": 5, "q2": "Finally, regarding auditability, this proposal is once again very well considered. Does the team care about establishing goals and KPIs that would serve as the material for us to analyze the progress of things, that is, is what was promised actually being fulfilled? It is entirely possible to monitor the results based on the different goals they establish, both by the 3 indicators mentioned, which analyze the relationship of users with the videos (for example, how much time of video was watched and what is the time goal to be reached ). They also plan the number of proposals to be summarized and the number of new entries over time, giving us more information to track when it comes to results. About the process, it is also very possible to follow it, through the tasks that are described in the previous topic. In this way, we can not only see if the goals were achieved, but if what was promised to be done is being fulfilled at the right time, in the right way and by the intended people. In summary, it is a highly auditable proposal, it is enough for some member of the Japanese speaking Cardano community to follow it closely and bring the information to the rest of the community. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 10, "ne": 7, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "In the challenge that encompasses this proposal, aspects are needed that promote a greater impact of Cardano in regions of Asia that until then have some barrier preventing the knowledge on a larger scale of the proposals and ideas of the ecosystem. In this case, the impediment is a linguistic barrier for those who do not speak English.\n\nThe main scope of the project is to create videos and articles that summarize the ideas of certain proposals, with the main detail that these materials will be translated into the Japanese language. We thus perceive the innovative characteristic of the project, as it allows Cardano to reach a greater number of people, and we also realize that this idea fits perfectly into the spectrum of the challenge.\n\nIt is already expected that the project will have an impact in the short term, since the F9 and F10 funds translated into Japanese will already be produced. The total amount requested, $75,516, seems consistent with what will be produced as will be discussed below.", "q0r": 5, "q1": "As with the proposal 2Min Review by Vietnamese Voices, the team of professionals involved here seems capable of a successful execution of the work and one of the factors that help us to indicate this is the previous experience of projects related to Cardano by the authors of the proposal. in question.\n\nThere are clear ways of contacting the professionals involved in the project, since several contact links were made available. For example, you can find the co-proposer Hieu Tran via linkedin: https://www.linkedin.com/in/hieutran981. Similarly, the other participants in the proposal have clear ways of locating.\n\nIt is also worth mentioning that the steps developed by the team involve several activities that go beyond the production of translated content and play an important role in the dissemination of the project. Among these activities we can mention the administration of tools such as Youtube and Spotify.\n\nWe were able to see a clear path that the team traced so that the objectives of having a more inclusive material are achieved. Each of the stages of this path has clearly defined the capital that will be spent on it, and all the values ​​seem consistent with the effort that will be spent. These steps clearly indicate what you want to produce, the time taken to do so, and the fixed hourly cost of achieving the objective.\n\nSimpler goals have a lower cost, like YouTube and Spotify administration costing $181 each. On the other hand, more expensive steps have higher expenses, such as translating content into Japanese, which will cost $4,350. It is also worth mentioning here that this cost, when compared to the cost of translation in the proposal 2Min Review by Vietnamese Voices, is higher; however this is understandable since the project managers are not local in Japan and it will be more expensive to carry out the translation.", "q1r": 5, "q2": "Regarding the ways to monitor the progress of the project, we noticed that the team defined very clearly metrics so that not only the completion of the projects, but also the adoption of these by the users are confirmed.\n\nTherefore, there is a clear way to observe the results of the proposal. And one of those ways is to analyze the average view indicator of each video and see if it reached the value expected by the team. It is also possible to audit the results by observing if the average monthly growth of subscribers to watch the videos is reaching the rate expected by the team in F10, around 10% monthly.\n\nFinally, another possible parameter to analyze the results would be to try to observe some kind of preference about the content being produced and try to establish a correlation of this preference with the locality or language spoken by users. Possible preferences found could also indicate which types of proposals should be focused on for the production of videos and articles with summaries for the next funds.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This is an interesting idea. It is true that many Japanese do not have a good grasp of English, but there is currently a Japanese ambassador who translates all projects into Japanese and shares them with Japanese holders. Furthermore, if only 25% of the projects are taken out for video analysis and sharing, then the other 75% of potentially excellent projects will not be exposed, it may affect the principle of fairness. After all, everyone has their own preferences and expertise, and any kind of preselection or filtering should be avoided, and everyone should have the opportunity to look at the projects fairly and objectively. I think this is the true spirit of CATALYST.\n", "q0r": 3, "q1": "Although these films were to be made for Japanese, they were planned and arranged by non-native Japanese speakers. How do they evaluate whether the professional contents of those Japanese films are translated correctly, whether they are translated properly, whether the editing process will not go smoothly because of language problems, whether the translators have sufficient knowledge of CARDANO? Because of the language knowledge and translation involved, the translators must have some knowledge and well understanding of CARDANO to translate, and the 25% selection mechanism is not very fair for others, so the feasibility of this project could be improved.\n", "q1r": 2, "q2": "Results can be audited through their videos, but this process may not be fair enough and therefore may affect the fairness of the results", "q2r": 3, "assessor": "z_assessor_1245", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "I agree with the proposers that language is a barrier for people from non-English speaking countries to access Cardano information. Even with recent development of translation tools such as Google translate, this difficulty is remained as quality of technical translation in specific domain is still unsatisfactory. I appreciate the project owner effort to make the review for Japanese people and I think it will provide a great help.", "q0r": 5, "q1": "The team plan to produce the review for 500-600 proposals and it should be done before voting time, which I think it is a challenge for the team with only 4 people. Based on the team profile, it looks like they do not have any Japanese native speakers or Japanese language proficiency. I am wondering how they can check the quality of Japanese text and voice. I think the team should clarify this point in their proposal. Furthermore, there might have biased review of proposal influencing voters decision and I did not see this was mentioned as a risk in this proposal", "q1r": 3, "q2": "The project has two phases for fund9 and fund10 with concise evaluation criteria as the number of proposals to review. This criteria is fit with the project objective and easy to verify as the timeline to complete the project is not so long (the video review should be completed before voting phase)", "q2r": 5, "assessor": "z_assessor_1353", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The count of proposals in each fund is increasing. It means, the volume of information in each fund also is sharply increasing. It is really a challenge for an ordinary person, busy stakeholders (ex: businessman, students, housewife etc.), especially voters in non-English countries to grasp the general information, advantages, and disadvantages of each proposal in funds. This proposal adresses the production of short videos/podcasts lasting 2 minutes in Japanese. Their contents comprise compiled, analyzed and evaluated datas for about 25 % of proposals in Catalyst fund 9 and fund 10. Products of this proposal will help voters in Japan or the Japanese people in the world get an overview of proposals submitted in fund 9 and fund 10, understand the impact, feasibility and auditability of proposals in the videos/podcasts. Thereby, the quality of voting at each fund in the japanese community will be improved. This proposal fully meets the requirements set forth for the challenge.", "q0r": 5, "q1": "This proposal is driven by a highly qualified team. One of the tasks of this proposal is translation English into Japanese. The funds are disbursed for 9 tasks: proposal translation to Japanese; articles of proposal review and summary article commenting, filtering; podcast production; video production; Youtube Channel administration; Spotify Channel administration; reserve budget; reserve to watch out of flippage ADA price. Because the videos/podcasts produced in this proposal will support the cardano community in Japan, I thought it would be a good idea to develop a marketing plan to attract Japanese people to know about these produced videos/podcasts. Based on the clear written and detailed plan, I strongly agree that this proposal will be implemented successfully.", "q1r": 5, "q2": "The metrics provided can easily serve to audit and track the progress on the proposal. 03 main indicators are focused on evaluating the success of the channel, including average view duration, average percentage viewed, new subscriber on Youtube and Spotify channel. The proposal team is going to produce 500 videos/postcad based on 500 proposals in fund 9 and 600 videos/postcad based on 600 proposals in fund 10. All these videos will be published on the 2Min Review youtube channel before Fund's voting deadline. I strongly agree that this proposal provides complete and comprehensible information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_1400", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Identify a challenging problem, large scale of impact. The community of investors in Japan is very large. They recognized the problem of accessing and evaluating projects in the Catalyst of the Japanese community due to the English materials from Catalyst. Therefore, this is a necessary proposal to help the Japanese community better access projects on Catalyst. Identify a few problems of the challenge, make reasonable arguments. The solution of filtering out and analyzing 25% of the proposals in fund 9 and fund 10 through the creation of 2-minute videos is very suitable. The community will have a filtered quality channel, evaluating analytics from people with in-depth knowledge and experience. A number of risks have been raised and there are solutions to all risks. They anticipated the risk and had a solution. This proves that they are a team with the knowledge and experience to carry out projects like this.", "q0r": 3, "q1": "This proposal has a clear, reasonable timeline with specific goals. The time to complete the targets is fully and clearly expressed. The focus on filtering out 25% of quality proposals to introduce to the Japanese community also shows that they have experience evaluating Catalyst projects. Focusing on filtering out the most quality, effective and high-impact suggestions is reasonable and useful. The fund proposal is more than 50%, there is a reasonable explanation. They came up with a detailed plan with a detailed budget attached. It was clear to me that they had researched and made financial plans for translation from English to Japanese at $14.50 an hour. The remaining jobs are also statistical and have very appropriate financial calculations. The team is assigned; Appropriate experience; Identity is easy to authenticate. They are experienced investors in building and developing the Cardano ecosystem. Detailed, transparent members' information can be checked at the links they provide. This proves that they have built a team strong enough and towards success in implementing this project. However, this is a project in Japan, so if they can have someone who knows Japanese or is culturally savvy, Japanese investments will probably help them better.", "q1r": 4, "q2": "There are KPIs/indicators, the whole is easy to measure, easy to check. Planned tasks have clearly quantified targets. With their detailed plan, it is easy to realize the rationality and feasibility for them to successfully implement the project. This blueprint will also help Cardano monitor their implementation process easily. It's been a success, but it hasn't been tested yet. Goals are clearly defined. I've seen them do a number of community support projects participating in the review in Catalyst. They have had many videos of Cardano and Catalyst in Vietnamese. Therefore, I appreciate that they will be successful for the same project to support Japanese-language sources of information to the Cardano community in Japan. Funded in the past but not related to this proposal. They have had a few funded proposals in supporting the Cardano Vietnam community to access and understand those projects in Catalyst. This helps the community evaluate recommendations in Catalyst more efficiently, faster. It also contributes to the expansion of the Cardano ecosystem.", "q2r": 3, "assessor": "z_assessor_1638", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "This proposal of using short clips to consolidate key information for Japanese is great. The team has done an excellent examination of how reading proposals might become overwhelming and difficult in the long run. Despite the fact that Japan is a developing country, recent researches reveal that fewer than 30% of Japanese people know English at any level. Fewer than 8%, and maybe as few as 2%, speak English fluently, which I believe prevents many individuals from engaging and sharing their thoughts in such an English-speaking group. The plan might result in a more robust Cardano community in the future.", "q0r": 5, "q1": "The team has provided detailed information about money usage and expertise of each core members. \n\nHowever, team forgot to mention who are competent in japanese, since all of core members are not japanese.Team should also provide more information about current Japanese communities to consolidate the feasibility of this project. Moreover, team should provide a roadmap, when each work will be accomplished, and which techniques will be employed to attract viewers who are interested in Cardano-Catalyst", "q1r": 3, "q2": "Returning views and the ratio of positive to negative comments are measures I suggested to be tracked. Views number sometimes might be misleading; for example, if the contents are difficult to understand, viewers will have to watch it again and again, therefore the comments section may be a useful source of analysis. Adding more metrics will have voters have more confidence in proposal's auditability. Moreover, tracking social channels interaction is another source to follow progress of the project, check if japanese community is growing in active platforms (telegram, facebook,...), not only focus on Youtube's metrics", "q2r": 4, "assessor": "z_assessor_1693", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Voters in non-English speaking countries such as Japan and some East Asian countries have difficulty in evaluating Fund proposals because proposals are in English, a proposal averaging around 500 English words. Meanwhile, the number of proposals in the Catalyst Funds is growing rapidly, for example, the number of proposals in Fund 8 is expected to exceed 1,250. Therefore, the amount of information that 1 voter receives to vote is too large. This is difficult for the Cardano community in general, especially for voters in non-English speaking countries. This affects the quality of votes.\n\nTherefore, the proposal presented a solution, which is to produce short videos and podcasts in Japanese. Each video and podcast will be posted to Youtube and Spotify, it will briefly provide the Japanese community with general information, the pros and cons of some specific recommendations.\n\nThis project can help the Cardano community in Japan to evaluate the proposals of Catalyst Funds, help the voting, thus contributing to the expansion of the cardano community in Japan. The goal of the proposal suits the challenge's goal of developing the Cardano ecosystem in East Asia.\n\nHowever, in my opinion, the proposal team should only provide general information of the proposals such as what the impact is, the proposed solution, the budget request, the implementation time, the results achieved... should not give pros and cons of these proposals because these pros and cons are just the personal opinion of the reviewer.\nBesides, the video/podcast is about 2 minutes long, such a length video provides necessary information enough for voting?\n\nThe risk presented by the team is that the filtering of 500-600 proposals depends on the 2Min Review community, so there is a risk that some high-quality proposals will be filtered out of the list. The team just mentioned spending 5% of the total budget as a reserve for the purpose of ensuring the quality of the content without saying what is the solution or specific way to do it?\n", "q0r": 4, "q1": "The roadmap of the Proposal is to make videos/podcasts for Fund 9 and Fund 10 with the specific amount being: Fund 9 is 500 proposals, Fund 10 is 600 proposals. The team set out specific tasks to complete such as filtering suggestions, receiving articles, evaluating articles, receiving videos, and evaluating videos.\n\nHowever, in my opinion, there should be a native Japanese person to check the quality of the translations, the videos to see if they are appropriate and understandable to the Japanese. This will ensure that the proposals evaluation of the Japanese is easy and accurate.\n\nBesides, the proposal team has set a target for Fund 9 of 500 proposals. As far as I know, the time from receiving the proposal to the voting deadline is about 2 weeks. According to the team's presentation in the cost section, the time to complete for each proposal from filtering articles, summarizing, evaluating proposals, translating into Japanese, producing videos, podcasts is about 5 hours, then the time completing 500 proposals is 2,500 hours, working time of 1 day is 8 hours, it needs about 312 working days. The work needs to be completed in 14 days, the number of people needed will be 312/14 = 22 people, this number of people will work continuously for 14 days. Therefore, the team needs to find personnel to complete this work on time.\nTotal estimated cost is $75,516: $34,365 for 500 proposals of Fund 9, $41,151 for 600 proposals of Fund 10. The team has detailed cost for each stage: translation into Japanese, summary, evaluation Suggestions, comments, article filtering, video production, podcasts... Each stage has a detailed unit price. In my opinion, the cost is reasonable.\nThe project implementation staff includes 04 people, 01 is the founder of 2Min Review, 03 is the core member of 2Min Review. They are all experienced in blockchain and Cardano research, having participated in the evaluation of many proposals at previous Funds. The team was funded at Fund 6, Fund 7 to build the foundation of 2Min Review which is the website and mobile application. Therefore, the team can successfully carry out the project if it hires staff for the evaluation, translation, video production, podcast, and it will be more secure when there are local Japanese people to check the quality of the videos before post.", "q1r": 5, "q2": "The team came up with 3 metrics to measure the growth of the project: average view time, Average Percentage Viewed, new subscribers. These indicators can be easily checked by the community on the team's channel.", "q2r": 5, "assessor": "z_assessor_1768", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Your team can recognize the problem of the challenge and pinpoint it. The big deal comes with it, which is the scale of the impact. Interestingly, the Vietnamese team worked on a proposal related to Japanese, which proves the limitless creativity of the team members. It is also a very important point in the development of Catalyst in particular and Cardano in general. Because the Cardano community in Japan is huge. And they have a high rate of knowledge. I noticed that many countries in the world do not speak English and they have great difficulty in accessing Catalyst and Cadarno. If this proposal continues to be implemented, it will have a major impact on the current and future Cardano ecosystem. I highly recommend this. I understand that some of the issues of the challenge were not easy to define, but you did and made a reasonable argument that addressed the requirements of the challenge. It makes sense for you to write a proposal \"2Min Review by Japanese Voices\". In life in Japan, a lot of Japanese people, especially the Japanese knowledge team, are always busy, they don't have time to look at the proposals in the Catalyst. And 2Min Review helped them do it in 2 short minutes in Japanese. I would like to add that it has a huge impact on the Cardano community and ecosystem in Japan in particular and the world in general because the number of Japanese people interested in Cardano accounts for a high percentage of the world. If all of these people know Cardano and Catalyst well and join Catalyst and the Cardano ecosystem that would be great, very good for the whole Cardano ecosystem. Several risks were mentioned by the team as a result of careful study of the problem and its associated solutions to it. There is reasonableness in the risks you mentioned. I wonder if the team can make this proposal well when you are Vietnamese and make the proposal related to the Japanese community - not the Vietnamese community? Also, do you have to capture all the high-quality recommendations and get them out to everyone? I think this is a good way to provide information to the community - improve the reputation of the 2Min team. The problem here is the language (non-native) barrier, and the team may miss more or less high-quality proposals since we can't read and review all of them. However, I think the team has the right methods to do it, along with my advice that you should read all the proposals in the Fund, then make a 2-minute evaluation video, for Proposals cannot make video reviews because of insufficient human resources and time, you can take notes for readers so that readers can refer to the suggestions that you have taken notes. ", "q0r": 3, "q1": "I think the team has done serious research to map out a clear and reasonable timeline with specific goals. I appreciate this of you. I found the team's proposal convincing. Specifically, the team divided the tasks to be completed in each Fund (funds 8, 9, 10). Even if it is work done with Japanese (not anti-native language) but with specific goals and tasks, I believe you will do well according to the outlined work route. We are currently at Fund 8, but you mentioned Fund 9 and Fund 10, I appreciate this very much because it is both planning and calculating for the future, not just the present. I hope this proposal is successfully implemented, it will increase the prestige of the team in particular and the Vietnamese nation in general. A proposal that offers more than 50% funding speaks volumes about the team's confidence in developing the proposal. They have grounds to offer such funding. A proposal from Vietnam to think that funding more than 50% of the total funds allocated in Challange is not easy to see in the proposals of the Vietnamese. \"Big think\" was clearly expressed through this. I only slightly doubt if the team can make good on this proposal? Please wait for the results. That is interesting. Your team is professional, cooperative, and works with good quality. The division of work, available experience, public identity will attest to this. Through reading the proposal, I found that the members of the team are people with expertise and experience in the field you are in. I like that you guys have revealed your identities through social networks, proving that you are serious people and thereby creating more trust for the community. I think that you should show more of your identity on the proposal so that members of other countries have more confidence in the team and the proposal, especially the Japanese community, more trust, and team, although you are already quite familiar with the Vietnamese community. You have shown the seriousness and professionalism of the Vietnamese people, thereby raising the prestige of the Vietnamese nation. ", "q1r": 4, "q2": "You know KPI is a measurable value that demonstrates how effectively a company is achieving key business objectives. A quality proposal will have a good KPI. This is what Catalyst wants to see. The team worked hard to implement the proposal and set easy-to-measure KPIs: average view duration, average percentage viewed, new subscribers. We all know the importance of KPIs. I'm interested in you setting goals through KPIs. And the question is whether the goals are achievable or not? What is the basis for you to set such achievable goals? Can I ask if the Fund can increase the KPI after each time? For example, when the 10th Fund KPI achieves the target, will the following Fund's KPI increase or stay the same? I ask that because it shows growth in teamwork. Surely the members of the team can completely answer these questions. Thereby, I advise the team to present more specifically the basis for solving the problem in the proposal. I look forward to a practical test of your proposal. That is the best way to demonstrate success. I know the team has done \"2Min Review by Vietnamese Voices\" and is well on its way to success with this proposal. Recommended \"2Min Review by Japanese Voices\" is also a similar product but has not been tested on the Japanese community. Even so, I still believe in its success. I have advice for the team that when making proposals related to Japan, the team must understand the characteristics of the Japanese nation, Japanese culture, Japanese people, customs, and language. From there, make recommendations accordingly and improve efficiency. Your proposal is similar to many other proposals that have never been funded by Catalyst. I think that's completely normal. I know this is the team's new proposal. The team is on the way to success with a similar proposal (applicable to the Vietnamese community). I hope the team will be funded to implement this proposal and I am confident in its success. This is an overview after carefully reviewing what the team wrote in the proposal. Although the proposal is new and has never been funded, that does not mean that there is no opportunity for implementation and it has brought interest to readers. ", "q2r": 2, "assessor": "z_assessor_642", "no_vca": 5, "ne": 2, "ng": 2, "nfo": 1, "vca_o": 1}, {"q0": "The proposer identified a common problem for Catalyst Community Advisor - to have a quick take or review on Catalyst Proposal in \"spare time\" for voters to choose or screen. Although it is a good idea to help the voters, to select 25% out of thousands of proposals by a small group of people - although it was selected by the \"two min\" community and other filter criteria - just doesn't feel right. It may just create a new problem on the rest 75% \"unselected\". As a CA I would suggest seeking a different approach to curate these proposals - the methodology - to find the quality proposals - maybe by collaborating with other Cardano Communities in East Asia and more aligned with the Campaign Challenge.\n\nThe mitigation plan also not entirely solves the problem, I believe in East Asia, the EHT team and Catalyst School is trying to fix the same problem, as a CA I would suggest this proposal collaborate with the EHT team", "q0r": 3, "q1": "The proposer describes in detail the timeline, roadmaps, and resources needed to implement this proposal successfully. The team also has the skills and experiences to make this happen and delivered it as promised.   \n\nThe budget unfortunately is very high, considering the total budget will absorb about 50% of the total Challenge budget, even if it is split into Fund 9 and Fund 10 - are still high about 20-30% of the entire Challenge Budget. As a CA I would suggest starting a smaller fund proposal (less than 10%) by collaborating with - for example, the Eastern Town Hall (EHT) - or Japanese Community to reduce the scope and budget.", "q1r": 3, "q2": "The proposer share a simple KPI measurement and how it will be measured to see the progress of the project. The target is also described in detail and with an understandable solution. As a CA I would suggest creating a simple Cardano Forum Thread or Github project page to track the progress the implementation - also can be a learning process for new proposers.", "q2r": 4, "assessor": "z_assessor_646", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "It is certainly that the project is a great idea and fits very well with the objective of the challenge. A short video and podcast in which a proposal’s information is analyzed with advantages and disadvantages in Japanese would help Japanese Cardano community easy to understand that proposal with a covenient way and saving time (a video just 2 minutes long). We well know that a fulfilling detail proposal has never been short, people in non-speaking English countries find hard (in term of language and busy time) to read through all of it to understand it. If this project is executed successfully, it will help Japanese voters to choose proposals to vote better and our community will have more quality projects which are capable to get fund. This is extremely important because increasing the quality of voting is rasing the growth of Cardano system. It also helps to increase the number of Japanese people who want to be onboarded when the language barrier is removed. The proposal is also able to scale to future challenge. For example is that the project can be broaden to summarize 50% (even 75% or more) amount of proposals each Fund. It’s just an example which might be considered if the project would be in collaborations and be supported by partnerships in future, especially the 2Min Review Integrated Platform, which was funded in Fund6, are going to complete soon. \nActually the team is also planning to produce short videos and podcasts in other languages to help people who do not speak English easy to catch up the increasing of information of proposals each round. Here are links of them: \n2Min Review by Voices for busy voters (English videos)\nhttps://cardano.ideascale.com/c/idea/397021 \nand\n2Min Review by Vietnamese Voices\nhttps://cardano.ideascale.com/c/idea/397023 \nIn addition, the team has plan to broaden this plan with other non-English content in Southeast Asia as they said.\nBecause of all the advantages I mentioned above, I rate the Impact with the top score.\n", "q0r": 5, "q1": "I have a strong belief that this project is built by expert hands with a lot of experience and will reach the best result because the team has already executed successful proposals before within the Cardano ecosystem. Links of the funded proposals are included. We have a description in detail about information of each team’s member, what their professional areas are, how many years they have worked in their fields, how many years they have participated in Catalyst project and what they have been done, and so on. They also provide photos and their social links account where we can get to know them better and connect them if needed. \nRegarding to the goal and tasks of the project which are set and explained in an easy and succinct way to understand, we can take a general view of the entire project. Additionally,\nthe financial amount is broken down into items in a very clear understandable and reasonable way, so that we can see how much each part would cost and the roles of these parts in executing the project.\nThe challenge and risks that the project could be faced through out the delievering are also explained right above the budget section, and due to the “flip-page ADA price” risk, we can understand the final amount of money  which is listed in budget of each Fund.\nAs the team’s statement, 25% proposals in Fund9 and Fund10 would be summarized and analyzed in short videos and podcasts, approximately 500-600 proposals each Catalyst Fund if the project is successfully implemented. I would like to know more about the 2Min criteria to filter that 25% among thousands proposals that will be submitted in F9 and F10. It’s just a bonus question, with all the advantages I mentioned above, I rate feasibility with the top score.\n", "q1r": 5, "q2": "The authors make it very clear what the goal would be with 3 main indicators: view duration, percentage viewed, and new subscriber. \nSince the KPI, success metrics and timeline are very specific with numbers of articles, videos and podcasts of proposals which will be upload on the 2Min Review youtube channel, the project is easy to monitor its progress by the challenge team and the Cardano community. Therefore, I assess the proposal is auditable.\n", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This is a very useful suggestion. The number of proposals in each funding round is increasing, Japanese people make up a large number of the Cardano community, however, English is a barrier for them. This proposal will help them know the general information, advantages and disadvantages of each proposal, save time (2 minutes for each proposal), based on which they can easily evaluate and vote. Since then, helping to increase the number of Japanese people participating in Cardano, promoting the strong development of the ecosystem.", "q0r": 5, "q1": "The team consists of members of 2Min Review. According to what is provided, they have enough skills and experience to carry out this project. The members have also achieved certain successes: Catalyst community advisor (CA) and vCA, holding many important positions,... More specifically, they have been funded in previous funds: (1 proposal at fund6, 1 proposal at fund7). This increases confidence in the success of the project. The contacts are also fully listed, making the information about the team more transparent. With that mentioned, this team is fully capable of carrying out the project.\nThe risks, challenges, as well as ways to mitigate it have been identified. The roadmap is very specific, the goals to be achieved in each stage are very detailed. This makes job description and budget allocation easy. Budgets are allocated transparently and accurately (determined based on workload, number of hours worked, hourly wage). KPIs to measure progress and success are also provided (After fund 9: List of 500 proposals, 500 videos,...) with these specific numbers, people can easily track and evaluate the success of the project.", "q1r": 5, "q2": "The information provided is complete (talented team, has a lot of experience in previous funds, clear roadmap, ...), CAs can base their assessment on that. This project can completely succeed, because 2Min Review has achieved success in previous funds. In this proposal, if successfully implemented, it will have an impact on the overall quality of votes, help increase the number of Japanese people accessing Cardano, and promote the development of local communities in Cardano. I fully believe in its success, I will vote for you!", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "Producing short Japanese videos & podcasts lasting 2 minutes containing analyzed information for 25% of the proposals in Fund 9 and Fund 10.", "experience": "The 2Min Review team consists of CA, vCA, community builders, researchers, and video producers."}