{"id": 397463, "author": "vcoincheck", "title": "Blockchain and Cardano Library", "url": "https://cardano.ideascale.com/a/dtd/397463-48088", "category": 26444, "amount": 11500, "description": "Knowledge and news about Cardano are mostly in English,it is difficult to reach Japanese community, affecting the expansion of Cardano...", "f6_no_assessments": 9, "f6_rating": 4.518518518518518, "videos": [], "media": [], "f6_assessments": [{"q0": "- This is a great idea that is very useful to the community, especially the Vietnamese community and the Japanese community, these are two communities with relatively large technical English language barriers.\n- Currently on the internet there is a lot of information about blockchain, most of which are fragmented pieces of information that have not been logically arranged according to each group of categories as well as the difficulty of the information. Therefore, it will frustrate a lot of technology enthusiasts, they don't know where to start to learn, what information to learn first, what information to find later.\n\n- The project helps technology enthusiasts save a lot of time to synthesize knowledge in a coherent way.\n\n- The project helps users have an overview and multi-dimensional view of blockchain, cardano and catalyst\n\n- In the future, the project plans to let the community self-post information, self-assess posts and will be rewarded for providing useful information to the community. This creates a great motivation for users to delve deeply and analyze carefully about blockchain, cardano and catalyst. Thereby creating a knowledgeable community and the website will become a trusted place for people to find information as well as contribute useful information to the community.\n***Suggestions/ advices:\n- At the stage when users can post information on the website themselves, in order to select quality information for readers, the project can build a mechanism to accumulate points for those who post information on the website. . In addition, it is necessary to build a mechanism so that it is possible to filter out users with good expertise, who have posted high-quality and useful articles for the community, and then can classify them according to each level. Thereby helping the community to access the best quality knowledge first automatically. Because if only based on the assessment of the community in the early stages, the quality of the assessment may not be high, because the community has not much knowledge and is not deep enough.\n- If the project can add a tool to scan duplicate content of articles, it will eliminate duplicate articles, make the website have cleaner content, and help users save a lot of time when looking up information.", "q0r": 4, "q1": "- The project has a clear work plan according to each item for each month\n- The evaluation indicators have also been clearly quantified by month\n- The project has envisioned a general format for the website, how to distribute content, divided by levels from basic to advanced. This requires good general knowledge and the ability to assess the need and difficulty of the content posted on the website.\n- The project has now built 2 Vietnamese facebook communities who are passionate about projects on the Cardano platform, with a large number of members and frequent interactions. When the project is formed, it will reach a large number of members in the existing community. Or will find members who are willing to experience the project's services in the initial stage to give evaluations to help the project complete.\n- Expenses are clearly allocated for each work item. Most of the cost is for information search and translation.\n- The cost for translation is relatively low compared to the common ground. The content that the project translates is all technical content that is difficult and picky for translators. This speaks to the project team's desire to contribute to the community. This is also the strength and weakness of the team, because the low cost will lead to difficulty in adding additional human resources from the outside.\n- The team has a large force with knowledge and experience that is very suitable for the project:\n+ Lots of experience in participating in the cryptocurrency market\n+ In-depth knowledge of blockchain\n+ High level Japanese translation team from N3 to N1\n+ English translation team with many years of experience in teaching English, skilled technical team\nWith these skills, I think the project is completely feasible and can do more for the community in the future\n- Information of each member is publicly and transparently easy to contact\n***Suggestions/ advices:\n- The project should re-evaluate the cost of translation, especially Japanese translation, or build a reserve fund so that it can easily add additional resources from outside in case a team member for some reason unable to participate for a period of time. This will help the project have more flexibility in terms of human resources.\n- Besides, the project needs to add a marketing plan as well as a marketing budget so that more people in the community know and use the project. A good product, but if it is not widely communicated to the community, it will be very wasteful and will not spread value to many technology enthusiasts.\n- Currently the project does not have a Japanese community, so if the project can have a plan to build a Japanese community now to prepare for the future when the website has a Japanese version", "q1r": 5, "q2": "- The project has its own website\n- The project has clear specific commitment indicators for each stage. This speaks to the strength as well as the careful preparation of the project team\n- The project knows what it has to do to be successful. They know what the project will look like after success, which helps team members have the confidence to follow the project for a long time.\n- Indicators can be easily checked through the website. Besides, the project also commits to publicize other website indexes if necessary, this demonstrates the transparency of the project.\n***Suggestions/ advices:\n- In phase 2, the project will let the community provide information and self-assess that information. Therefore, classifying information providers is very important, it helps readers to quickly select quality information, saving readers time. Besides, it also stimulates information providers to try to provide better quality information to receive more incentives from the project. From there, the project can build one more indicator on the number of members providing quality information to be achieved in each stage to serve as one of the criteria to evaluate the success of the project.", "q2r": 4, "assessor": "z_assessor_1192", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The proposal gives the idea of ​​building a library for the website, which stores articles about Cardano and research articles on blockchain knowledge. These documents will be translated into Japanese so that the Japanese community can understand and contribute to the evaluation of projects. This proposal is in line with the Grow East Asia challenge, Grow Cardano. The idea is to bring the expansion of the Cardano ecosystem to Japan, a country where English is not the primary language and there are very few people who can master English.\nI completely agree with the challenges posed by the project. It helps the proposer to be more prepared, better and anticipate possible risks.", "q0r": 4, "q1": "I appreciate the quality of each member of the team. The team is all people with deep knowledge of Blockchain technology with many years of research, the translation team is fluent in the Japanese language. Information sources can attest to the accuracy of the project's delivery.\nThe roadmap of the work to be completed is very scientific and specific. This shows that the proposer knows what the plan needs to do, there is a preparation in advance to implement the idea.\nThe budget allocation is also very clear with how each work item is spent (USD for an article, for an hour of work).\nThe above factors have contributed to increasing the feasibility of the project.", "q1r": 4, "q2": "The KPI milestones set out are perfectly reasonable for measuring the success of the project. I have an additional suggestion to make the proposal more effective, which is to have a metric measuring the reception and response from the Japanese community. For example, a survey, poll on the level of information reception, the usefulness of information from the community.", "q2r": 5, "assessor": "z_assessor_1394", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "Currently, knowledge and news about Cardano are mostly in English, which is difficult to reach for Japanese people, affecting the expansion of the Cardano ecosystem. The solution to this problem is that we will create a knowledge library. Cardano, Catalyst, Blockchain to share a friendly connection with the Japanese community has 2 stages of development, 3 risks, solutions for those risks, in my opinion, there must be a team specializing in translation and language editing. connecting Japanese and Vietnamese communities.\n", "q0r": 4, "q1": "The timeline has 4 months each month, allocating details of the total cost for the translation table 11500usd, the expenses are explained\nOutstanding members have contributed to the project. Team leader Jimlee, Ms. Ha Nguyen, Mr. Vu Do, Mr. Quang Daniel Chief interpreter Mr. Tony Nguyen, Mr. Giang Phung, Mr. Sang Nguyen, Mr. Gia Huy, Mr. Do Manh Hung, Mr. Duc Dang, Ms. Diem, Ms. Quyen, Ms. Oanh, Ms. Nhi, Mr. Kawamura. The team has 15 members, each member has different tasks, these are people with a lot of experience. Currently, they are working in a large corporation in Japan.\n", "q1r": 4, "q2": "This proposal promises to be transparent, the content editing library will perfect the best system for 3 languages Vietnamese, Japanese, English Has 100 new users from the Japanese community, attracting 4,000 viewers\nThis proposal is brand new, unfunded.", "q2r": 4, "assessor": "z_assessor_1531", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Impact of this project is real:\n- increase information about the catalyst, blockchain and Cardano in the East Asia region;\n- promote access to information by more people interested by the cardano ecosystem, and allow new one's to join\n- create an interactive platform where people may share their knowledge around the catalyst community, and support community in the process of preparing and submitting proposalls to the Catalyst project.\nThese projects acivities align with some of this challenge goal, while they may scalable and expanded geographically and demographyically.", "q0r": 5, "q1": "The proposers team is formed by some members who have been involved in the Catalyst community and who got their previous proposals approved for fundind, which increases the chance of success for the current one. They are also membres who are secialists in japanese translation, which is the main goal of this proposal.  \nThe budget is detailed and takes into consideration all the activities. \nThe aspect of creating an interactive platform may be an ad-onn to attract new people to the ecosystem, as they may have their questions, concerns answered while exchanging with experts.\n", "q1r": 5, "q2": "The Voincheck platform is already online, at which the blockchain and cardano library will be hosted. That would help to audit the project implementation.\nRiska have been mentioned and solutionns proposed, but the number of online contributors to the library may be low than expected, would it be a good idea to insure the incentives given to them be in ADA? So, they'll be connected to Cardano and start using the coin. ", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Blockchain knowledge in English which is a barrier in reaching Japanese community is affecting expansion of Cardano in Japan. This proposal is creating a Cardano Catalyst and blockchain knowledge library that is friendly to Japanese community. \nThe impact will be that the proposal will create a place to store blockchain information and knowledge with high reliability, which is a tool to help breakdown the English language barrier, help the Japanese  community access Cardano and Catalyst faster, and promote development. There will be Japanese community producing CAs, vCAs and proposers.  The articles in the library will be highly reliable. The country will be equipped with blockchain knowledge and Cardano will improve the ability to self-assess projects reduce risks. \nThe proposal aims at creating a connection between East Asia community and the Vietnam community. \nMain challenge is that viewers may post inaccurate information due to copying on sites but the solution provided is to have a post review feature, giving suggestion for better posts, other risks mentioned in proposal. This section has enough relevant details to effectively address the challenge., so my rating is 4.", "q0r": 4, "q1": "The plan is detailed showing that the project is for 4 months. The first month is broken down into weeks of different activities such as building a library page, searching and researching, writing articles, checks and editing, etc. \nThe second month they continue to write articles, translate into Japanese, check translation, and others. The third and fourth months all have activities. \nThe budget is done very well breaking into various costs for each activity such as article writing, community incentive, transaction fee, with a total budget of USD11500 which is reasonable. \nThe team of 18 people with various skills and experiences such as 10 years in translation, marketing and editing. Their names have been provided with links for easy reference. I believe the team can deliver a successful project, hence my rating of 4. ", "q1r": 4, "q2": "The team progress of work is divided into months where tracking can be done. The proposal has 4 months of tracking progress such as posting 10 articles to the library in Japanese and Vietnamese and English; completing the login feature, users can self-post, users can rate and comment on published articles.\nSuccess can be seen when the library has content of 100 articles and displaying 3 languages- Vietnamese, Japanese and English; when there are at least 3 new users who post at least 10 users who participate in evaluation and counts for the articles. Attracting 4000 views. All these details will make auditing successful. So I give 4 tar rating.\nIn my opinion, this proposal can have a very good impact on Cardano when language barriers are solved. I recommend this proposal for funding.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "-Its proposal indicates clearly issue what Japanese community is meeting as: language barrier. The happening problem does not let easily Japanese approach information and knowledge about Cardano blockchain. Moreover, Japanese holds a lot of ADA coin from 2017, but contribution for Catalyst as Community Advisor is not proportional. \n-The proposal shows solutions in 2 phases. Phase 1 will be built library of blockchain information. Phase 2 that users let to be participated to contribute their ideas.\n-The proposal give clearly explanation about library content,structure of article, checking procedure.", "q0r": 5, "q1": "-The proposal' roadmap presents clearly. They show specific milestone in 4 months. Furthermore, each of months indicate specific works.\n-Each of months they focus on writing evaluated projects and articles in Vietnamese/English in 2 weeks. Afterward, they will check, edit, translate projects and articles to Japanense in next 2 weeks. They also give target for each months as total number of Cardano articles, Catalyst articles, Blockchain articles. \n-The coreteam members, who implement the proposal,have more than 5 years exprience in researching Crypto projects and translating Japanese language. Information of team members are provided by links, and can be checked honestly. ", "q1r": 5, "q2": "-The proposal's plan can be measured by checking projects/articles update every months.\n-They commit total number of articles, users' views that can be checked from vcoincheck site's database.\n-Target for each month shows total number of evaluated projects and articles clearly.\n- In conclusion, the proposal devides milestone and targets properly and all of them can be counted from their database.", "q2r": 5, "assessor": "z_assessor_818", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This is a powerful idea in expanding the Cardano community in Japan. The Cardano community in Japan will participate in Cardano and Catalyst activities more easily because they can understand information and knowledge in Japanese. Japanese people can see posts on the gallery and can post, comment, and rate other people's posts themselves. Library pages in Japanese, English and Vietnamese languages are also convenient for the Japanese, Vietnamese, and other international communities to find information. I think the library can develop into a place of communication between communities. The proposal meets the requirements of the Challenge.", "q0r": 5, "q1": "The execution plan is written in great detail. The library is divided into 2 phases of development and construction in 3 months. The content of the posts on the library is also listed in easy-to-understand details. I envision how this library is different from other crypto news and information sites. The knowledge about blockchain, Cardano, Catalyst will be the main part of the library page, not a place to call for investment, promote projects or give news about Bitcoin. But I think it would be nice to have more news items in the library.\nThe implementation plan and schedule are broken down and have a weekly deadline. There are a number of articles and translations made for each timeline. Proponents can manage progress well with this blueprint.\nRegarding the budget, the budget is listed in detail. There is a specific unit price and a number of articles. The translation unit price is equivalent to the market price according to my research on the internet.\nIn terms of implementation members, the team is quite large, with experience, knowledge, and skills in administration, translation, and technology from 2 to 5 years. The translation team has attached a certificate to prove Japanese language ability. The translation team has a Japanese editor. This ensures translation quality.", "q1r": 5, "q2": "The community can check the project's progress through the website.\nAnd it is possible to compare actual results and expected results with a detailed plan and roadmap. The project has clear KPIs and indicators for each milestone. Catalyst can check project progress easily.", "q2r": 5, "assessor": "z_assessor_823", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This is a useful proposition that represents an overarching vision. It creates a Cardano, Catalyst and blockchain knowledge library that is friendly to Japanese and Vietnamese Community. This will be a place to store blockchain information and knowledge with high reliability, which is a tool to help break down the English language barrier, help the Japanese community access Cardano and Catalyst faster, and promote development. Based on the positive impacts that this project brings, it can be seen that it has effectively solved the challenges posed.", "q0r": 5, "q1": "Full team information is provided. The team consists of many members, divided into 3 smaller groups: leading team, core team (Vcoincheck team), specialist team. They have full knowledge and skills, have many years of experience in different fields: blockchain, Japanese translation, project analysis, question creation,... In particular, this team has been granted a license. capital at the previous fund. Contacts, certificates of Japanese language N1, N2 are also provided, helping to increase transparency for the team. With a large and talented team, I have full confidence that they can carry out this project with ease.\nI appreciate you identifying the risk, the challenge, and how to mitigate it. This shows your overarching vision, it will be a solid foundation for the sustainable development of the project.\nThe route and timeline are clearly defined, the tasks in each time period are specifically assigned. Reasonable and transparent budget allocation (thanks to clearly defining the number of articles and salary for each article). Success metrics, you've provided specific metrics (4000 views, 100 new users from Japan,...), which makes it easy for anyone to judge.", "q1r": 5, "q2": "The information provided is very detailed and complete (clear roadmap, budget, reasonable KPIs,...). That makes it easy to comment on its success.\nThe proposal is an additional integration feature for the Vcoincheck project funds in Fund 7 (Create a solid platform for the East Asian community). It creates a place for knowledge exchange between the Japanese Community and the Vietnamese Community, developing a stronger and closer Cardano Community. With the positive impact and feasibility of the project, I have full confidence that this project will be successfully implemented.", "q2r": 5, "assessor": "z_assessor_862", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal has an essential challenge it seeks to solve. I believe one of the ways to do away with the ignorance and misinformation about Cardano is true the right education. \nAs in the proposal, the establishment of an online knowledge library about Cardano, Catalyst, Blockchain friendly with Vietnamese and Japanese people is in the right direction.\nThe knowledge library will be of great resource to people that access it.\n\nI understood from the proposal that there is going to be two phases of development:\n\n\n\nPhase 1: Create the initial basis for the library.\n\nIn this phase, \"Knowledge Library\" will be a place to post Cardano blockchain knowledge, Catalyst information, basic and advanced knowledge about blockchain.\n\n\nPhase 2: Users can participate in posting knowledge and contributing ideas.\n\nEach registered user will have the right to post content on the web, contribute knowledge to the community, comment and rate the content contributed by other users. \nI believe the proposers have a good and effective solution that addresses the challenge. \n\n\n\nFurthermore, with the incentive  they intend to introduce as part of their proposal, there should be much clarity. If it's to boast so many people and encourage the spirit of contributions from users in the community then it should be packaged and written very well, to help improve the quality of articles written and uploaded by users from the Japanese and Vietnamese communities to the library. The mode of rewarding the incentives should also be stated without delay. On a whole, this is a pretty good proposal that seeks to help solve the challenge. I recommend that they should be helped to get funding.", "q0r": 4, "q1": "The success of every project first of all depends on the kind of plan and well designed timelines. I can see from the proposal that plan itself does not give any technical barriers, as the goal is more focused on\nbuilding a knowledge hub or library with Blockchain and Cardano as it's emphasis. Information about the proposers is well presented with each of them having experiences in Blockchain activities. However, an addition about the social media pages of each team members could have been excellent since that will give us direct information about who you are and what you do in this space. I however think that the proposers have what it takes to execute this project when given support.", "q1r": 4, "q2": "There is enough information that can help in auditing the progress and success of the project. The metrics and KPIs were well laid down with agreeable and specific timelines. I believe they are good indicators for assessing the progress and success of the project when implemented.\n\nI was happy to read that the success of the project will look like:\n\n1. A Library knowledge will complete basic content with 100 articles and display in 3 language \n\n2. Vietnamese/Japanese/English\nThere are 100 new users from the Japanese community, there are at least 5 users who post and at least 10 users participate in evaluation and comments for the article\n3. Attracted 4,000 views.\n\nThis is commendable and I think it deserves the right attention it needs.\n", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "proposal will create a “Cardano, Catalyst and blockchain knowledge Library that is friendly to Japanese Community”. ", "experience": "Our core team Vcoincheck.io team, more than 5 years of experience in translating and interpreting Japanese and English, working with Japanese people and having at least 2 years of learning blockchain knowledge, knowledge of Cardano, information from Catalyst."}