{"id": 397574, "author": "eagle", "title": "Translate Pool Peek Mobile: Korean", "url": "https://cardano.ideascale.com/a/dtd/397574-48088", "category": 26444, "amount": 1900, "description": "It is not straight forward for non-English speaking users to onboard into the Cardano ecosystem.", "f6_no_assessments": 12, "f6_rating": 3.1944444444444446, "videos": [], "media": [], "f6_assessments": [{"id": 7303, "q0": "South Korea is a country that already has a good entry into the cryptographic market, and if we manage to consolidate Cardano in that country it will certainly be very interesting for our blockchain, because as the ecosystem gains space there, the number of investors will certainly also increase. That said, this proposal totally fits the challenge, South Korea is in the geographic region that we are looking to invest in this challenge. The proposal is about translating an existing application into Korean, which according to the author has a 4.5 rating on the play store, which helps its users to buy ada and delegate it to some pool. If this application is translated into Korean it will certainly be a substantial gain for us, because it will help to spread our technologies in a country that already has a good base for cryptography and in my view it is a key market. It would be interesting for the application to dialogue with all audiences, that is, to be understandable not only by those who already understand what blockchain, cryptocurrencies, etc., but also for laypeople. A short guide explaining the main concepts of the cryptographic world could be included in the application itself. Furthermore, yes, it is a proposal that perfectly aligns with the specific objectives of the challenge, in which we aim to invest in East Asia in order to increase the number of holders of Ada, transactions on the blockchain, NFT and future members of the Cardano community. And all this will be possible if we are able to establish a bridge between our technologies and the local population, and there is no better way to do this than producing content in the native language. \n", "q0r": 5, "q1": "Who would compose the team of this project would be the author of the proposal, who would be the developer, and some translator. Although the author already has experience in what he intends to do, as he says he already has 10 years of experience with mobile application development, and also has millions of downloads, I would like to see some examples of his work. It could be some applications that he has already developed, so we would get to know his practical experience. In addition, it is always important to know the relationship of the proponents with the Cardano ecosystem. How did they discover our blockchain, besides this app, does the author have any projects at Cardano? In addition to being a developer, does he have other occupations, what was your academic background? In the same way, in my opinion, it is necessary for us to know who the translator would be, for us to know a little about his/her curriculum, what other translation jobs he/she has developed so far, if this person understands anything about cryptocurrencies, etc. Ideally, the proposer would already arrive with his candidate for translator, but if this is not possible, he could even tell us how he intends to select this person. The proposal development process is not very detailed, we know that two parallel activities would take place here, the developer part and the translator part. Would one happen before the other, or at the same time? How long would each part take to work, in which month would these works start and what is their expected completion date? In the same way, the budget division is informed in a basic way, if we do not know how long the work of the two professionals would take, we cannot calculate the relationship between time and price, and thus it is a little difficult to assess whether the requested amount is fair. I also don't know how the author would go about spreading this translation, how would people in South Korea be aware of this app? Due to the absence of these details, I believe that feasibility, while possible, is not at its best, so I will give it 4 stars. \n", "q1r": 4, "q2": "Auditability is performed here based on very objective indicators: the number of downloads of the app in the Korean version and whether people who speak the language are using it, thereby increasing their participation in the process of delegating Ada. This is the essential thing to know, but we can also go further, seeking to know a little more about the impact of this proposal on their lives. As with the author's other proposals to translate his app, I think it would be necessary to establish some research here. Could a survey be carried out to understand if the target audience would be getting involved with the Cardano community in addition to this initiative, that is, would they be participating in Catalyst? Have they become CAs, vCas or even bidders? Are they betting more on our blockchain than others? Have there been significant changes in Korean investment in Cardano? As I say at the beginning of the evaluation, in terms of impact, it would be nice to understand if the focus was more directed to our blockchain with the help of this app, because South Korea is a great power, which already has a significant portion of investments in the cryptographic world, but as with most places, the most famous coins take up almost all the space, we need to invest in ways to strengthen Ada. Has this proposal contributed in this sense, based on the experience of its users? Finally, the auditability here is possible, but it can be deepened with some qualitative analyzes added to the quantitative ones, presented by the author. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 6, "ng": 2, "nfo": 1, "vca_o": 2}, {"id": 355, "q0": "For Cardano to achieve a global impact, it is increasingly necessary to reach a plurality of cultures and peoples. The proposal in question here aims to translate an application that helps teach how to allocate ADA in different staking pools. The target language of this translation is Korean, so we see that the proposal fits the purpose of the challenge.\n\nIt is easy to see that the proposal is not absolutely innovative with what it proposes, but that does not make its usefulness any less important. An impact is already perceived in the short term for this proposal, as an application translated immediately can attract users who speak the language.\n\nAdditionally, the total amount requested to carry out the work seems quite reasonable, as we will see below.", "q0r": 5, "q1": "As the final objective is reasonably simple, it will not be necessary to establish a very complex plan for the execution of the proposal. The main jobs basically consist of actually carrying out the translation and inserting this translated material into the application.\n\nThese two steps are described in the feasibility plan; $1,500 will be allocated for translation costs and $400 for development costs. A positive point to be mentioned here is that these values ​​are consistent with others that were requested in similar translation proposals.\n\nRegarding the team that will carry out the project, it was stated that the application developer is quite experienced, it was possible to find his contact in the play store: support@colorworkapps.com. This seems to be an indication that the application is scalable and that no major problems should be encountered in translating it.\n\nAs for the translation itself, it was indicated that a professional translation service will be used. It would also be valid to provide a contact that would indicate what this translation service would be, but this does not seem to be a problematic issue at the moment.", "q1r": 5, "q2": "The main way to verify the success of the project would be through the launch of the translated application on platforms such as the app store and play store. Because it is a relatively simple idea, its auditability is also quite straightforward. And we realized that this is exactly what was indicated as a work progress metric.\n\nThe way of perceiving the success of the project also seems very coherent, it was indicated that this perception would be given by the greater use of the ADA and its allocation in stake pools by the speakers of the Korean language, this is exactly what we expect as a result given all the features described so far. It remains to be noted that, as a further detail, some numerical parameter could be established to measure this adoption of the use of the translated application. Something like an expected average monthly downloads.\n\nIt is also interesting to mention that this proposal, as well as other similar translation proposals, has the power to jointly increase the influence of Cardano's ecosystem.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 14, "ne": 5, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 3337, "q0": "Note: This assessment would be similar to other of my assessments since these proposals are also similar.\n---\nIt’s great to help non-English speakers feel better to be with us in this ecosystem. However, reading and writing are no longer a problem with them since we’re having so many translating apps and websites. Now there are even devices for speaking and listening translation. How would this application be useful or even more useful than the others? ", "q0r": 1, "q1": "Note: This assessment would be similar to other of my assessments since these proposals are also similar.\n---\nAs I said in Impact. There are already a lot of translating tools, apps, websites, etc. Even if the app can be created and published successfully. Whether people use it or not will be another problem. The proposal said the success is when thousands of (Korean) people download and use this app. But how do thousands of people know and want to use this app? We need an advertising plan to promote the app, which the proposal did not cover. The information the proposer gives us is also little and lacks of evidence. In the team members, the proposal said about a primary developer with 10 years of experience without telling his name or contact address. The proposers need to write about this plan elaborately even when the plan is simple.\n", "q1r": 1, "q2": "Note: This assessment would be similar to other of my assessments since these proposals are also similar.\n---\nThe proposal gives really less information about the actual plan. The proposer only wrote about the breakdown budget and the expected success. The team seems to have experience in making translating apps since the proposer is very confident. However, even they are confident or the project is simple, they need to give enough information and cover what people want to know. Does the translator app translate audio or text or both? Is it available on PCs/laptops? Does it have a website to use without downloading? I don’t see the answer to these and more questions throughout the proposal.\n", "q2r": 1, "assessor": "z_assessor_1650", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4533, "q0": "Understanding data in native language gives more clarity over the subject and helps in communicating smoothly .so the proposal has a clear idea of capturing Korean people where more than 75 million people speak Korean, there are many translating apps around the market but most of them miss economical/financial terms ,since this application mainly concentrates on block chain related data which will definitely helps for people who wants to invest in block chain with the help of their own native language , apps like these brings more clarity over the subject for non english speaking people ,hence this proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer has done these kind of translations and have already listed the apps in google play store , the listed apps have already gained more attraction with result of 4.5 ratings, hence adding few more similar apps won't be big challenge for the proposer. By these apps proposer wants all the community people to show interest towards cardano and help the people understand the importance of cardano's project , since the proposal has very less chances of getting failed with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal has explained about all the experience of the proposer and has presented all their previous work in detailed manner. But the proposer hasn't presented his timeline of the project, so by what time the app will be listed ,and could have presented a better budget breaking in proposal , the proposal has even not concentrated on marketing strategy for the app developed ,so how can they make people to understand the importance of such apps for cardano projects , even how proposer's team will maintain the server of such apps is also a challenging task hence with information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 5044, "q0": "This proposal aims to expand access to the Pool Peek application in Asian countries where the population speaks Korean, thus expanding people's potential to be part of the Cardano community. The proposal does not clearly provide the blueprint for how it will add value to the Cardano ecosystem. The proposer has set a goal for thousands of Korean language users in Asia to download and use the app, so I believe the proposal is relevant.\n* The proponent created several similar proposals, the only change was the change of the language to be translated and the challenges focus on different continents. So I'm using standardized assessments.", "q0r": 4, "q1": "In the description of the proposal, the following statement was informed ''because we have already translated the application into several foreign languages'' when accessing the link and checking the website, I detected that the option for languages ​​other than English was not included, and when accessing the Mobile app encountered the same problem, which makes it difficult to assess feasibility. It is unclear how many people are needed to implement the given proposal. The proposer reported 10 years of experience in mobile development, but did not include a link to provide us with more details of their professional experiences. The budget was divided into two parts, translation and development, but there is no information on the amount of material to be translated. There is no estimated workload for the development part. The plan does not present a timeline to be evaluated. The proposal does not present an implementation plan, so there is no way to assess this criterion.\n* The proposer created several similar proposals, the only change was the change of the language to be translated and the challenges focus on different continents. So I'm using standardized assessments.", "q1r": 2, "q2": "There is no timeline with milestones and time for completion. The proposer intends that there will be thousands of Korean-speaking users in Asia (I raise the correction because the proposer entered the wrong continent in the proposal, stating that it is in the continent of Africa), downloading and using the application, despite being an uncertain number can be audited , I recommend including more metrics in the project.\nThe problem description is clear and understandable, but the solution could be more concrete.\n* The proposer created several similar proposals, the only change was the change of language to be translated and the challenges focus on different continents. So I'm using standardized assessments.", "q2r": 3, "assessor": "z_assessor_1828", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 5483, "q0": "Even though there are more and more resources regarding stake pools on Cardano, having others being published and especially if they have some interesting features, that are not present elsewhere - at least not to my knowledge - is always beneficial to the eco-system. As such, having Pool Peek translated into other languages will help get as many people as possible understanding how their ADA is staked, and what the difference is between one pool and another.\nDue to the information showcased and after trying out the website, I can conclude that the impact this proposal can have on the Cardano ecosystem is quite positive, and at the same time it addresses the challenge of Grow East Asia, Grow Cardano. The same review applies to his other proposals for translation into other Asian and African languages, since the proposal text is almost identical.", "q0r": 5, "q1": "The website of Pool Peek is fully functional, and even though I couldn’t get the Android app to install on 2 different devices, some more info about the plan and especially some links that could prove the skills of the proposer would have been important for assessment. Without any such links, the veracity of the facts cannot be proven, so we’ll have to take the proposer by his word. \nOtherwise, I found the budget to be reasonable and sufficiently described, the task of the proposal is quite simple, so there’s no need for any additional info.", "q1r": 4, "q2": "In the case of this proposal assessing the progress is quite simple: have the app published on the two mobile app stores and the success is having thousands of downloads from the Korean community, which in the case of Google App Store is verifiable by anyone on the app page.\nAs such, I find the proposal to be easy to track and assessed by the community. ", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5986, "q0": "I think that an app translated into Korean to help onboard new stakers is a great idea because language barriers are frequently one of the biggest hurdles to getting new members into the cardano community. There is a big market for a Korean app since the proposer did mention that there are over 75 million Korean speakers worldwide. This proposal is in line with the challenge setting because it has the potential to bring in many new members into the cardano community who will participate in staking. These new members could then become further interested in starting stake pools or even getting involved with catalyst. My only question for the proposers is with regards to their potential challenges, or lack thereof. How will the proposers market this newly translated app to Korean speakers? Will it be a challenge to get new Korean-speaking members to become interested in the app and therefore cardano? (score given: 4)", "q0r": 4, "q1": "Given the sparse information provided, I think the proposal could be successfully implemented, but I do not have much confidence due to the fact that the proposers have not listed any information about themselves. They claim that the primary developer has over 10 years of experience of mobile development, but there is no way to verify that claim (no linkedin or other names). Additionally, they claim that a professional translation service will be used. What service? If the proposer could list that information, it would greatly help voters understand who will be involved in the proposal. The proposers have also not listed any roadmap for progress of the translation. How long will this process take? What exactly will the development require? Answering all of these questions would greatly strengthen the proposal. (score given: 3)", "q1r": 3, "q2": "I believe that this proposal will be mostly auditable, but I do have some feedback for the proposer. The proposer mentioned that success will be measured by the publishing of the app in Korean on various app stores. While this is a good metric that can be tracked by the community, I do think that other KPIs could be included. For example, how many users will be on-boarded to cardano staking? What countries will these people be from (I assume mostly Korea, but the proposers mention Africa as well)? Since this challenge setting aims to grow cardano in east asia, I do think that the proposer can include more information to report to the community specifically related to growth in east asia. (score given: 3)", "q2r": 3, "assessor": "z_assessor_310", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 6504, "q0": "The problem presented in this proposal is within the scope of the challenge as there is a large Korean-speaking community in Asia and translating the Pool Peek app could increase the access of new Korean-speaking users to information about Cardano. The proposal plan does not clearly demonstrate how it will add value to the Cardano community, but considering the simplicity of the purpose (translating the app into Korean) i believe that the proposal is relevant and would have a positive impact on the challenge. A goal was set to get thousands of users on the app, which I consider a relevant goal, but I would like to see a more precise target in this goal (thousands is somewhat subjective) and metrics/KPIs that indicate the quality of the app could also be included to facilitate impact assessment. *This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible. *Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q0r": 3, "q1": "The proposer described relevant experience in mobile development, but there are no sources to confirm his expertise. There is no information on how many team members will develop this proposal (is it just the proposer?) I would like to see more clarity on this point. There is an intention to hire a professional translation service. An important point to note is that the proposer described that the app has translations in other languages(\"We will work with a professional translator to translate the Pool Peek mobile application and app store listing as we have done with other languages. \"), but I couldn't find a language option other than English in the app, I would recommend this clarification. The budget could be better detailed, as there is no information on the number of words to be translated, which makes it difficult to assess whether the requested budget is appropriate. A plan was not presented, I understand that the proposal has a low level of complexity, but I think it is important to have at least a basic plan and a timeline with an estimated delivery date for the translated version of the app. *This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible. *Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.\n\nThe proposer must have been confused due to the use of templates, Korea is in Asia (just to signal caution when using templates)", "q1r": 2, "q2": "There is clarity in the problem presented and in the relationship with the challenge. There is no plan, the solution presented could have a plan that more clearly indicates the development of the solution. There is no roadmap, no milestones and no timeline for app delivery, this negatively compromises the ability to audit the development of the proposal. The established goal (thousands of downloads) is relevant and a way to track the success of the proposal, but there could be a minimum target for this KPI, as thousands are somewhat vague (can be 2 thousand or 100 thousand, a significant difference) . I would recommend including more KPIs and metrics that allow you to gauge feedback from app users. *This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible. *Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 7836, "q0": "Note: I noticed the proposer has several proposals with the same template, but only changing the \"language\" - so As a CA, my assessment would be generally the same\n\nThe proposer offers a solution with no backup information of the problem they found - about translating their mobile application into Korean. Is there enough demand from the native spoken Korean for information about the Cardano stake pool operator? I would suggest the proposer present more research data on why they choose Korean?\nA simple google trend result or any English proficiency surveys might help. Also in Cardano Forum, we have quite a large Korean Community, if the proposer can conduct a survey and present the result with this proposal it will give us more insight into the demand.\n\n", "q0r": 2, "q1": "Note: I noticed the proposer has several proposals with the same template, but only changing the \"language\" - so As a CA, my assessment would be generally the same\n\nUnfortunately, the proposer did not share any detailed plan, or timeline to implement this proposal successfully. The budget proposed is not broken down in detail for me to assess if it is reasonable or not (for ex. how many hours estimated time to translate the content or how much they cost in detail to develop the app - because the English version is already live?)\n\nFrom the website link and checking the google App store, the mentioned app developer named \"Colorwork Apps\"  - but this information was not shared in the proposal if this is their internal team or external/third-party developer. As a CA it is difficult to assess with limited information given about their team and credibility. ", "q1r": 2, "q2": "Note: I noticed the proposer has several proposals with the same template, but only changing the \"language\" - so As a CA, my assessment would be generally the same\n\nThe planned timeline was not shared by the proposer, so Cardano Community will not able to track the progress until it's done. The proposer also not mentioned a detailed KPI or Target they want to achieve, but mention \"Thousands of Korean-speaking users in Africa\", which means they target African? As the detailed proposed plan is not shared it is very difficult for me as CA to assess this proposal.\n\nI would suggest the proposer do deeper research to back up their \"reasoning\" and more supporting data to show why and who will use this application. If the specific target is a country or region is it possible also to collaborate with the local Cardano Community there to create this proposal?", "q2r": 2, "assessor": "z_assessor_646", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 8141, "q0": "The first thing I want to say is that this proposal is a challenge. Proposal wants to build a Pool Peek Mobile application translated into Korean. This application will support the Korean community to use in the betting process. Since there are so many non-English speaking users participating in the Cardano ecosystem, it is a great idea to create an app that is translated into their language. The solution given is clear and reasonable. Overall, however, it's not informative enough for me to judge whether it can effectively tackle the challenge.", "q0r": 3, "q1": "The budget required for the proposal is quite low: $1,900 for this project, although in my opinion it is not clearly described to help the community better understand the amount of cost required. With 2 simple payments of $1,500 for translation costs and $400 for development costs. It would be better if the proposal could describe in detail what the translation fee would be, such as whether you would hire a translator or whether the translation fee would be charged per word or content to be translated. In addition, the proposal does not provide a detailed plan or any delivery timeline, which hinders the tracking of the proposal's progress. Finally, the information about the author is quite sketchy, I don't know who you are, how many people the group includes, it would be better if you provide a personal link like Linkedin or Twitter for the community. can be more easily accessible to you, as well as have grounds for confidence in your ability to carry out your proposal.", "q1r": 2, "q2": "Although the proposal is simple, the lack of information makes it impossible to assess the progress of the proposal. The idea of this proposal is good, but there doesn't seem to be a concrete plan to implement it. Looking at the proposal, I can't see any test roadmaps, KPIs or goals. The success of the proposal is described as \"Thousands of Korean speaking users in Africa will download and use the app\" I am questioning why Koreans in Africa but not the Korean speaking community . Given the above factors, I disagree that this is a proposition that can easily be judged in terms of progress and success.", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8194, "q0": "The problem of language barriers and content, which are most often in English, is clearly pointed out. Proposer offers a solution for creating a Pool Peek Mobile application (concerning the staking process) that would be translated into Korean language, which is spoken by 75 million people worldwide. It would be good (although it can be concluded in what way the project would add value to Cardano ecosystem) if the proposer has elaborated and has presented this item. It is necessary to develop better KPIs because they are crucial for the community as well, but also to be able to compare whether KPIs are suitable for this challenge. Due to lack of data the proposal is not able to scale to address future challenges.", "q0r": 3, "q1": "It would be great to know who is behind this project? Maybe the proposer and the team should be presented through links via Github, LinkedIn for the sake of transparency. The budget is presented and reasonable. It would be good to have more information about the scope of work, what is being done and how, in what way, how much time is needed to create applications and translations. It is necessary to create a detailed work plan and time frame within the work will be done. It is necessary to look deeper into whether this project has challenges and possible risks.", "q1r": 2, "q2": "A community without roadmaps and milestones cannot keep up with the development of this project. I would love to see elaborated KPIs that match with the KPIs of this challenge. KPIs are essential for monitoring and progress, project success. Due to the lack of necessary data, I do not resonate with this project, although the project itself is of great importance for the Cardano ecosystem.", "q2r": 2, "assessor": "z_assessor_656", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9880, "q0": "Note to VCa: this proposal being very similar to several other proposals by the same team, my assessment may include similarities.\nThis proposal offers to translate into Korean an existing web-app named “Pool Peek Mobile”. This web app educates and assists new Cardano users about staking, includes a pool map and a pool search engine. \nThis app has good reviews in Google and Apple app stores, and after having tested it myself, I found it useful, and I confirm I will keep it on my phone.\n", "q0r": 4, "q1": "The team intends to hire a professional translation service to support the work and evaluates the budget is 1.5kUSD. There should be no difficulty to perform this task, but as Korean is a not so widely spoken language, the proposer could have made it more clear by adding precisions about what the team has done so far to source this external translation skill.", "q1r": 4, "q2": "Success being defined as “the publication of the app on Google Play Store and Apple App store in Korean” does not align with the challenge brief. I recommend for a further application on Catalyst to include metrics that clearly relates the goal of the proposal to the challenge brief. In this case, for the “Grow East Asia, Grow Cardano” challenge, it is for example: the quantity and quality of funded proposals originating from East Asian teams.", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "We built Pool Peek Mobile to assist users with the staking process. We will translate the app into Korean (75 million speakers world-wide).", "experience": "Pool Peek mobile has already been translated into several over languages and has and average rating of 4.5 stars across the Google Play and Apple App stores."}