{"id": 397578, "author": "eagle", "title": "Translate Pool Peek Mob: Vietnamese", "url": "https://cardano.ideascale.com/a/dtd/397578-48088", "category": 26444, "amount": 1750, "description": "It is not straight forward for non-English speaking users to onboard into the Cardano ecosystem.", "f6_no_assessments": 12, "f6_rating": 3.0277777777777772, "videos": [], "media": [], "f6_assessments": [{"id": 7305, "q0": "The proposal fits partially with the objectives of the challenge, because it seeks to translate an existing application into Vietnamese, aimed at teaching people about how to acquire and delegate Ada. I say that it does not meet 100% of what we are looking for because Vietnam is not located in the geographical region targeted by the challenge, East Asia, but close to it. However, I believe that it is always good to make content related to the Cardano ecosystem accessible to the most varied number of people, and the most solid barrier we face in this process is linguistics. I am sure that Vietnam is a very strategic country for us to invest in, I say this because I have already evaluated several proposals aimed at it in the previous fund, it is a country that has a lot of activity in the cryptographic world. Instruction is never enough, so in the application there could be a guide with basic concepts about the Cardano ecosystem, such as what cryptocurrency, blockchain and a pool are, in order to clarify this initial part in case someone downloads the application out of curiosity but doesn't know it well. indeed to Cardano. I think the project will succeed because it is not something new, the author already has this application translated into several languages, according to himself; what would happen here would be just another version of a project that is successful. As much as it is not focused on the geographic point we want to invest in, I believe that by being close it would have an effect as necessary, increasing the number of Ada holders, transactions on our blockchain, delegations in community pools, etc. are the objectives of the current challenge. So I'll give it 4 stars (I would give it 5 if it was geared towards an East Asian country/language). \n", "q0r": 4, "q1": "We have the necessary information, but not to a degree of detail that I find satisfactory. I will explain: we know that the project will be executed by two people, the developer and the translator. Despite having a lot of experience and a successful application, we lack accurate information about who the author is. What's your name, academic background, example of other apps he's developed (I'd like to see them on my phone's play store), how does this person relate to the Cardano ecosystem? As much as he claims to be experienced and successful, it is always good to see examples of the work of the people involved in practice. And about the translator, I think the same; who would it be? How would you be selected? Does he have any knowledge about blockchain? What are examples of your previous work? I think trust is passed on to the bidder by the fact that the app already exists, but it would be even more interesting if we had a complete picture of who he is and his translator. Regarding the process, it is not detailed how long each of the two activities would take to happen. The development of this project should be specified in weeks, or months, I believe it would not take that long to do it since it is not highly complex, but a more detail would help the CAs, vCAs and voters to have a more solid view of the process . And about the budget, it's a low value for the standard of Catalyst proposals, but as we don't know how long this work would last we can't know the hourly value of those involved. Therefore, I suggest that such details be included, so that we can have a deeper understanding of the whole. We have what it takes, but not in such a detailed way as to be great. That doesn't mean it's not a viable enough proposal, what I said were some suggestions on how to improve it. \n", "q1r": 4, "q2": "Finally, when we talk about auditability, we know how to objectively measure the success of this proposal. This would happen through the amount of app downloads by the population of Vietnam. But as I have suggested for other translations of this same project, I think it is important that we always do a human analysis in parallel with numerical statistics. I think this could be done in two ways: one more immediate and the other long term. Thinking immediately, surveys could be carried out in the app itself, after just a few days of use, to collect data such as: are users participating in other ways in the activities of the Cardano ecosystem, beyond the app? Are people getting to understand, even if not so deeply, how the cryptographic world works? Are they participating in Catalyst? And in the long run, the author could contact those same users via email to do a deeper analysis, with those same questions but a little more specifically, perhaps. Could an analysis of the overall picture of Cardano Vietnam also be carried out, has the community there intensified its activities? Maybe the media started to give more space to our blockchain, was there an increase, even if small, of investment in the Ada currency? It would also be important for us to follow the process beyond the results, and this would be done more effectively if the author had established a detailed timeline on the feasibility part. In addition, auditability exists, although it is more focused on numbers, it is not a complex proposal, so its monitoring should not be that difficult either. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 8, "ng": 0, "nfo": 1, "vca_o": 2}, {"id": 357, "q0": "A notable way to increase interest around the Cardano ecosystem is to promote ways to allocate earnings to ADA. The proposal in question aims to make this type of action available to more people, by translating an application into Vietnamese that helps in choosing a stacking pool. In this way, we see that the project fits the objectives of the challenge and has the possibility of generating a positive impact on Cardano's visibility in the long term. We also realized that the budget of $1,750 is viable, and it is even on the same level as other similar translation proposals.", "q0r": 5, "q1": "The steps for this project to be executed are explained in a simple and direct way. Development and translation costs are detailed. It is also natural that the cost of translation ($1,350) is higher than the cost of development in this case, since the most laborious step would be to adapt the terms to Vietnamese, and the development itself seems to be more focused on changing these terms. terms in the application. Such a change also doesn't seem to be that costly, because the application is certainly well structured because it is already released and because it was created by a developer with more than 10 years of experience.\n\nIt is also worth mentioning that it would be interesting if the professional translation service to be used was indicated in the proposal, with a link directing to a portal of this service or to the profile of those who plan to do the translation.", "q1r": 4, "q2": "The way to monitor the success of the project, as well as the perception of its success, makes sense. But given the existing number of proposals similar to this one, it would also be interesting if some parameters for measuring engagement could be indicated here. These parameters would demonstrate the project's success in reaching the target audience in question. For example, the engagement of Vietnamese speakers around the ADA on social networks could be accompanied by the number of new followers, or the emergence of new pools more focused on projects related to this target audience could also be assisted.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 12, "ne": 2, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 3339, "q0": "Disclaimer: This assessment would be similar to other of my assessments since these proposals are also similar.\n—\nIt’s great to help non-English speakers feel better to be with us in this ecosystem. However, reading and writing are no longer a problem with them since we’re having so many translating apps and websites. Now there are even devices for speaking and listening translation. How would this application be useful or even more useful than the others? \n", "q0r": 1, "q1": "Disclaimer: This assessment would be similar to other of my assessments since these proposals are also similar.\n—\nAs I said in Impact. There are already a lot of translating tools, apps, websites, etc. Even if the app can be created and published successfully. Whether people use it or not will be another problem. The proposal said the success is when thousands of (Vietnamese) people download and use this app. But how do thousands of people know and want to use this app? We need an advertising plan to promote the app, which the proposal did not cover. The information the proposer gives us is also little and lacks of evidence. In the team members, the proposal said about a primary developer with 10 years of experience without telling his name or contact address. The proposers should try to write about this plan elaborately even when the plan is simple.\n", "q1r": 1, "q2": "Disclaimer: This assessment would be similar to other of my assessments since these proposals are also similar.\n—\nThe proposal gives really less information about the actual plan. Even the team is confident or the project is simple, they need to give enough information and cover what people want to know. Does the translator app translate audio or text or both? Is it available on PCs/laptops? Does it have a website to use without downloading? I don’t see the answer to these and more questions throughout the proposal.\n", "q2r": 1, "assessor": "z_assessor_1650", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4535, "q0": "Understanding data in native language gives more clarity over the subject and helps in communicating smoothly .so the proposal has a clear idea of capturing Vietnamese people where more than 70 million people speak Vietnamese, there are many translating apps around the market but most of them miss economical/financial terms ,since this application mainly concentrates on block chain related data which will definitely helps for people who wants to invest in block chain with the help of their own native language , apps like these brings more clarity over the subject for non english speaking people ,hence this proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer has done these kind of translations and have already listed the apps in google play store , the listed apps have already gained more attraction with result of 4.5 ratings, hence adding few more similar apps won't be big challenge for the proposer. By these apps proposer wants all the community people to show interest towards cardano and help the people understand the importance of cardano's project , since the proposal has very less chances of getting failed with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal has explained about all the experience of the proposer and has presented all their previous work in detailed manner. But the proposer hasn't presented his timeline of the project, so by what time the app will be listed ,and could have presented a better budget breaking in proposal , the proposal has even not concentrated on marketing strategy for the app developed ,so how can they make people to understand the importance of such apps for cardano projects , even how proposer's team will maintain the server of such apps is also a challenging task hence with information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 3, "assessor": "z_assessor_1747", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5046, "q0": "This proposal aims to expand access to the Pool Peek application in Asian countries where the population speaks Vietnamese, thus expanding people's potential to be part of the Cardano community. The proposal does not clearly provide the blueprint for how it will add value to the Cardano ecosystem. The proposer has set a goal for thousands of Vietnamese language users in Asia to download and use the app, so I believe the proposal is relevant.\n* The proponent created several similar proposals, the only change was the change of the language to be translated and the challenges of focusing on different continents. So I'm using standardized assessments.", "q0r": 4, "q1": "In the description of the proposal, the following statement was informed ''because we have already translated the application into several foreign languages'' when accessing the link and checking the website, I detected that the option for languages ​​other than English was not included, and when accessing the Mobile app encountered the same problem, which makes it difficult to assess feasibility. It is unclear how many people are needed to implement the given proposal. The proposer reported 10 years of experience in mobile development, but did not include a link to provide us with more details of their professional experiences. The budget was divided into two parts, translation and development, but there is no information on the amount of material to be translated. There is no estimated workload for the development part. The plan does not present a timeline to be evaluated. The proposal does not present an implementation plan, so there is no way to assess this criterion.\n* The proposer created several similar proposals, the only change was the change of the language to be translated and the challenges of focusing on different continents. So I'm using standardized assessments.", "q1r": 2, "q2": "There is no timeline with milestones and time for completion. The proposer intends that there will be thousands of Vietnamese-speaking users in Asia (I raise the correction because the proposer entered the wrong continent in the proposal, stating that it is in the continent of Africa), downloading and using the application, despite being an uncertain number can be audited , I recommend including more metrics in the project.\nThe problem description is clear and understandable, but the solution could be more concrete.\n* The proposer created several similar proposals, the only change was the change of language to be translated and the challenges to focus on different continents. So I'm using standardized assessments.", "q2r": 3, "assessor": "z_assessor_1828", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 5485, "q0": "The idea behind Pool Peek’s website and app is to access a tool that helps you visualise all the info about different stake pools and make a more informed decision based on that. There are indeed some other websites that offer similar services, but some of the features are not present elsewhere - at least not to my knowledge - that actually make Pool Peek a valuable tool to have and worth translating into other languages, that will help get as many people as possible understanding how their ADA is staked, and what the difference is between one pool and another.\nAs such, the impact this proposal can have on the Cardano ecosystem is quite positive, and it also addresses the challenge of Grow East Asia, Grow Cardano. The same review applies to his other proposals for translation into other Asian and African languages, since the proposal text is almost identical.", "q0r": 5, "q1": "Even though the website is up and running, some more info about the plan and especially some links that could prove the skills of the proposer would have been important in assessing the feasibility of the team and not just have to take the proposer by his word.\nOtherwise, I found the budget to be sensible and sufficiently described, the task of the proposal is quite simple, so there’s no need for any additional info regarding this.", "q1r": 4, "q2": "Assessing the progress in the case of this proposal is quite simple: the app will be published with the translation on both the Google Play Store And Apple App Store. The success metrics are also clear and easy to follow in this case, having thousands of downloads from the Vietnamese/international community, which in the case of Google App Store is easily viewable on the app page.\nAs such, I find the proposal to be easily tracked and assessed by the community.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5988, "q0": "This proposal is definitely in line with the challenge setting. It aims to translate the Peek Pool Mobile App into Vietnamese, which will open up the door to over 70 million people who speak Vietnamese worldwide. The potential impact of this proposal is huge because the people who come to know cardano through this app in Vietnamese could then go on to become stakers, voters, proposers, or CAs/vCAs. This would grow the cardano ecosystem into asia and make the entire community more diverse. However, I do have a question for the proposer. How will this app be marketed to the Vietnamese-speaking population? Is there a specific marketing strategy that will be used to find the new users after the app is translated? Otherwise, it doesn’t seem like the app would reach as many people and its impact would be lower as a result. (score given: 4)", "q0r": 4, "q1": "Given the information provided, I think that this proposal could be successfully implemented, but I do have some hesitations. The proposer has not listed what translation service they will use, so it is hard to say whether the translation will be completed with a high standard of quality. Despite that, I do think that the task is simple enough to complete. The proposer has also not listed any relevant links about themselves, so I cannot verify their credentials, but they seem to have good experience with this app and in software development. I do not have personal experience with translating apps, but I think that the funds requested are sufficient. The budget was broken into two categories, which makes sense given the smaller scope of the proposal. Overall, given the small things that I pointed out, I can’t say for certain whether the proposal will be successfully implemented. (score given: 3)", "q1r": 3, "q2": "Given the information provided, I can’t say for certain whether the proposal will be auditable. The proposer has listed the translation of the app as the main indicator of success (something that is very important and can be tracked), but there are no other KPIs included in the proposal. If the proposer could include specific quantitative metrics, such as the number of Vietnamese-speaking viewers or the number of app downloads from the Vietnamese versions of the app stores, it would greatly help the cardano community track and compare this proposal’s success. Thus, I can’t agree and say that the proposal is fully auditable. (score given: 3)", "q2r": 3, "assessor": "z_assessor_310", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6506, "q0": "The problem presented in this proposal is within the scope of the challenge as there is a large Vietnamese-speaking community in Asia and translating the Pool Peek app could increase the access of new Vietnamese-speaking users to information about Cardano.\n\nThe proposal plan does not clearly demonstrate how it will add value to the Cardano community, but considering the simplicity of the purpose (translating the app into Vietnamese) I believe that the proposal is relevant and would have a positive impact on the challenge.\n\nA goal was set to get thousands of users on the app, which I consider a relevant goal, but I would like to see a more precise target in this goal (thousands is somewhat subjective) and metrics/KPIs that indicate the quality of the app could also be included to facilitate impact assessment.\n\n*This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible.\n\n*Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q0r": 3, "q1": "The proposer described relevant experience in mobile development, but there are no sources to confirm his expertise. There is no information on how many team members will develop this proposal (is it just the proposer?) I would like to see more clarity on this point. There is an intention to hire a professional translation service.\n\nAn important point to note is that the proposer described that the app has translations in other languages(\"We will work with a professional translator to translate the Pool Peek mobile application and app store listing as we have done with other languages. \"), but I couldn't find a language option other than English in the app, I would recommend this clarification.\n\nThe budget could be better detailed, as there is no information on the number of words to be translated, which makes it difficult to assess whether the requested budget is appropriate.\n\nA plan was not presented, I understand that the proposal has a low level of complexity, but I think it is important to have at least a basic plan and a timeline with an estimated delivery date for the translated version of the app.\n\n *This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible. *Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q1r": 2, "q2": "There is clarity in the problem presented and in the relationship with the challenge. There is no plan, the solution presented could have a plan that more clearly indicates the development of the solution. There is no roadmap, no milestones and no timeline for app delivery, this negatively compromises the ability to audit the development of the proposal. The established goal (thousands of downloads) is relevant and a way to track the success of the proposal, but there could be a minimum target for this KPI, as thousands are somewhat vague (can be 2 thousand or 100 thousand, a significant difference) . I would recommend including more KPIs and metrics that allow you to gauge feedback from app users. *This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible. *Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7838, "q0": "Note: I noticed the proposer has several proposals with the same template, but only changing the \"language\" - so As a CA, my assessment would be generally the same\n\nThe proposer offers a solution with no backup information of the problem they found - about translating their mobile application into Vietnamese. Vietnam is one of the largest Cardano communities in East Asia, have the proposer discussed this idea with the local community? I am sure there is room for collaboration. I would suggest the proposer present more research data on why they choose Vietnamese? A simple google trend result or any English proficiency surveys might help.\n", "q0r": 2, "q1": "Note: I noticed the proposer has several proposals with the same template, but only changing the \"language\" - so As a CA, my assessment would be generally the same\n\nUnfortunately, the proposer did not share any detailed plan, or timeline to implement this proposal successfully. The budget proposed is not broken down in detail for me to assess if it is reasonable or not (for ex. how many hours estimated time to translate the content or how much they cost in detail to develop the app - because the English version is already live?)\n\nFrom the website link and checking the google App store, the mentioned app developer named \"Colorwork Apps\"  - but this information was not shared in the proposal if this is their internal team or external/third-party developer. As a CA it is difficult to assess with limited information given about their team and credibility. ", "q1r": 2, "q2": "Note: I noticed the proposer has several proposals with the same template, but only changing the \"language\" - so As a CA, my assessment would be generally the same\n\nThe planned timeline was not shared by the proposer, so Cardano Community will not able to track the progress until it's done. The proposer also not mentioned a detailed KPI or Target they want to achieve, but mention \"Thousands of Vietnamese-speaking users in Africa\", which means they target African? As the detailed proposed plan is not shared it is very difficult for me as CA to assess this proposal.\n\nI would suggest the proposer do deeper research to back up their \"reasoning\" and more supporting data to show why and who will use this application. If the specific target is a country or region is it possible also to collaborate with the local Cardano Community there to create this proposal?", "q2r": 1, "assessor": "z_assessor_646", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8142, "q0": "At first glance, this proposal and issue statement may seem a bit fuzzy on information, the problem is that there are a lot of Vietnamese who don't speak English participating in the Cardano community and the solution is to adopt it. The Pool Peek Mobile app will translate into Vietnamese to assist them in the betting process. The main idea of ​​the proposal is good but unfortunately, it is not clear and lacks many details on how the objectives will be met. I came across the application and found it quite interesting, but to receive funding from the fund, I think the proposal needs to be thought about and added more information to convince the community.\nThe proposal claims no challenge or risk if funded and I see the proponent also write 3 more similar proposals for the language: Thai (https://cardano.ideascale.com/c)/ Idea/397576), Korea (https://cardano.ideascale.com/c/idea/397574) and Burma (https://cardano.ideascale.com/c/idea/397580) in the same challenge broadcast to this East Asian development. However, I think to convince the community more, the proponent needs to provide more information such as more links about the team's qualifications, a plan with milestones associated with clear goals. The detailed and clear output will help the community be more confident in the ability of the project to succeed.", "q0r": 3, "q1": "About the team, we know that the lead developer of this mobile app has over 10 years of mobile development experience and his apps have been downloaded from Google Play and Apple App Stores several times . times, however, the proponent does not provide verification information that can verify the above certificate as well as the names of the team members, how many people will work on the project and more actively the proposal needs to be provided link to their profile.\nIt's a good idea, but that doesn't mean there aren't some tools for the community to track its progress, no columns or timelines. The required budget is 1750 $, also explain with an example diagram 1350 $ for the cost of translation, you need to clearly determine what content you will translate, about how many words, the clearer the explanation, the higher the charge. how feasible the solution is being implemented to address the challenge.", "q1r": 2, "q2": "It would be great if the developers put out some data on the number of users and how this has changed so that the voters can see how many people depend on it\nIt seems that the writer of the proposal is a newcomer to the Catalyst community so this proposal looks more like a plan than a complete proposal. I recommend writing a new proposal based on the Catalyst document, including all the items needed for the plan, such as the schedule, metrics, KPIs, and budget analysis. This proposal needs further editing to be properly evaluated.", "q2r": 2, "assessor": "z_assessor_654", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9882, "q0": "Note to VCa: this proposal being very similar to several other proposals by the same team, my assessment may include similarities.\nThis proposal offers to translate into Vietnamese an existing web-app named “Pool Peek Mobile”. This web app educates and assists new Cardano users about staking, includes a pool map and a pool search engine. \nThis app has good reviews in Google and Apple app stores, and after having tested it myself, I found it useful, and I confirm I will keep it on my phone.\nThe proposer explains Vietnamese is spoken by 70 million speakers world-wide, which partly explains the 3-star score for impact. \n", "q0r": 3, "q1": "The team intends to hire a professional translation service to support the work and evaluates the budget is 1.3kUSD. There should be no difficulty to perform this task, but the proposer could have made it more clear by adding precisions about what the team has done so far to source this external translation skill.", "q1r": 4, "q2": "Success being defined as “the publication of the app on Google Play Store and Apple App store in Vietnamese” does not align with the challenge brief. I recommend for a further application on Catalyst to include metrics that clearly relates the goal of the proposal to the challenge brief. In this case, for the “Grow East Asia, Grow Cardano” challenge, it is for example: the quantity and quality of funded proposals originating from East Asian teams.", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10165, "q0": "I see the impact of this proposal is to increase the ADA Staking of Vietnamese Holders into Pools by creating a Vietnamese version of the Pool Peek Mobile application. This is a good idea. Vietnamese people are currently staking into pools at the call of pool owners. If this application has Vietnamese language, users will enter and find a reputable pool and they will entrust Staking to that pool. However, I think you need a more detailed description of the features of the application, such as the ability to connect pools, the feature to score the reputation of the pools, for example. It helps Catalyst better understand this application, and be able to assess the need to create a Vietnamese version of this App.", "q0r": 4, "q1": "Regarding the plan, the proponent did not state the overall and detailed plan. The project can be simple, easy to implement, so the proponent does not specify the plan. However, a project, whether easy or difficult, needs to have clear steps to follow, so that the proponent can easily manage the progress and Catalyst can evaluate the project progress. I hope you can provide a plan for the translation of this application.\nRegarding the budget, you have 2 items: translation costs and development costs. If you can write down the details of the translation costs such as the unit price of 1 word, the correction cost... it will be much clearer. The budget, no matter how big or small, needs to be listed in detail for Catalyst to consider the reasonableness of the budget.\nRegarding the project development team, you did not specify the members of the team. The proponent mentioned the experience of the main developer of the application but did not identify, or attach evidence of experience. For feasibility review, we need clear, verifiable, and verifiable practitioner information.", "q1r": 2, "q2": "The roadmap is not mentioned. Progress metrics and KPIs are also not written out. And the expected time to publish the Vietnamese version of the application on Google Play and the Apple App Store was also not mentioned. The proponent should give an estimated time, for example, 1 month after the proposal is approved or 3 months after the initial funding is received for example.\nThe success of the project should be made clearer with specific estimates. For example, how many users in Vietnam are expected to download this application? What is the expected increase in the amount of staking from Vietnamese users to the pools on the app?", "q2r": 2, "assessor": "z_assessor_823", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We built Pool Peek Mobile to assist users with the staking process. We will translate the app into Vietnamese (70+ million speakers).", "experience": "Pool Peek mobile has already been translated into several over languages and has and average rating of 4.5 stars across the Google Play and Apple App stores."}