{"id": 397580, "author": "eagle", "title": "Translate Pool Peek Mobile: Burmese", "url": "https://cardano.ideascale.com/a/dtd/397580-48088", "category": 26444, "amount": 3200, "description": "It is not straight forward for non-English speaking users to onboard into the Cardano ecosystem.", "f6_no_assessments": 13, "f6_rating": 2.923076923076923, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal aims to translate an existing app into the Burmese language, mainly spoken by my research in Myanmar. This country is not located exactly in the geographic region targeted by the challenge, therefore, it will not specifically help to develop it, as is our objective here. It is a country close to Thailand; according to the author, about 50 million people speak this language. It would be interesting, however, to present the source of this information, some statistics that can prove the proponent's words, I believe that's it, but as it is a language a little less known by the general public, I think it would be important to have the source of this research. Other than that, I think it's a project that has everything to work out, due to the fact that the author already has the app, so it would be an extension of it, expanding it to new audiences and democratizing knowledge about how to acquire Ada and delegate them in a pool. Myanmar is really a country I don't know so I can't say how strong the crypto community is there, but it would be nice if the proponent included a basic guide on what Cardano is all about when users log into the app. This could introduce the subject if someone happens to download the app out of curiosity (I don't think that will be the case, but it's always good to be on guard). This guide could explain initial concepts like what is blockchain, Ada, Cardano, a pool and etc. Finally, although the country and language in focus here are not exactly what we are looking for in the challenge (favoring East Asian countries, educating their residents about Cardano ecosystem technologies, thus favoring people and blockchain at the same time) it is still a very positive proposal that could help the ecosystem to expand. I will give 3 stars because 1) Myanmar is not the target of the challenge 2) I would like some extra information about this country/language. \n", "q0r": 3, "q1": "The author is certainly well prepared to run this project successfully, because he already has some successful apps, according to him. It would be even better if he made available in the proposal links through which we could see these apps in the play store / apple store, so we would see in practice proof of his work. He could have included more information about himself here, such as his professional background (he is a developer, but what kind of developer? What is his connection with the Cardano ecosystem?) and what was the process of creating the application in question, which will be translated into Burmese. Now let's talk about the translator: as it is a less widespread language, it will be important to find a qualified professional, preferably a native of Myanmar, to do this translation work. Due to the specificity of the language, I would like the tenderer to present us with some candidates for the job, in order to verify if this person would be qualified for it. It would be important for us to know a little about his curriculum, in addition to the translation itself, would this person have any knowledge about the Cardano ecosystem? Regarding the script, the proponent did not include a timeline through which we could understand the development process of this project, whether through weeks, months, etc. It's a simple task, I see that he has launched several proposals to translate his application into different languages, but I would like to understand exactly how the work routine of the professionals involved would be. This would give us more clarity regarding the visualization of the process. And about the budget, it is a small amount in relation to the funding requested in the other proposals, but as I mentioned in the other cases of translation of this application, it would be important to know the total time that the developer and the translator would be working on it, that way we could calculate the hourly rate of work or monitor whether the asking price is fair. In general, the author provides us with the necessary information to understand what would happen, all that was needed was to better explain how it would happen and who, in essence, are the people who would work here? \n", "q1r": 4, "q2": "As in the other proposals by this author to translate his app, he points out numerical data that serve to measure the success of the project, which is important and necessary. But auditability can go further, there are more humane ways, let's say, of analyzing whether the project is achieving the desired impact. As I also suggest for other translations, a user survey could be carried out to understand whether Burmese speakers, in addition to being supported in the issue of purchasing and delegating Ada, would be interested in other technologies of the Cardano ecosystem. If so, would they be able to understand about, for example, Catalyst, how to participate, where they fit in, etc? I think it would be important to establish some kind of contact with this audience. This research can be done through the application itself or, also, another idea I had: contact them via email, some time later, in order to establish this bridge. They will be supported by the application and from this input we can understand if they would in fact be entering the cryptographic world, but specifically Cardano. The translation process would also need to be analyzed, we would need to verify that the work was being developed as promised, this can be done through a member of the Cardano community, a native of Myanmar. This person could stay in touch with the team and provide sporadic feedback to the rest of the Cardano community, as well as review the final product, ie the translated app. Anyway, there is a possibility of auditing this proposal, even if we can go further with this monitoring. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 10, "ne": 6, "ng": 3, "nfo": 1, "vca_o": 2}, {"q0": "The proposal aims to translate into Burmese a tool that shows options for allocating earnings in different pools. It is only natural that with Cardano's growing visibility and scope, more and more people are willing to learn about how to invest their earnings with the platform. And the more translations there are for tools like Pool Peek Mobile, the more people will be included in this learning process. Thus, we see that the proposal fits the goals of the challenge and can positively impact Cardano's ecosystem in the medium and long term. Regarding the budget being requested for the project, we realized that it is a fair value, as it follows the same range of values requested in other similar translation proposals. In fact, the amount that will be spent here on translation is higher than in other cases, but we also note that the language in question is also less common.", "q0r": 5, "q1": "Despite being an important idea, we noticed that it does not need a very complex plan to be executed, and the detailing of the steps described in the feasibility is not very detailed. The biggest challenge for the work to carry out the translation of the application is an adequate translation of the existing terms, in line with this, we realize that the biggest expense is exactly with this translation phase, $2,800.\n\nFor this, it was indicated that a professional translation service will be used, but it would be interesting to indicate what this service would be, to answer some questions such as, has this service been used previously by the team? Does it perform well when translating financial terms?\n\nAbout the amount that will be spent on the development itself, $400, we realize that this is a coherent value, as the work would be quite straightforward, since the application is already built and developed by an experienced person. It was even possible to find the developer contact on the google play store: support@colorworkapps.com\n\nAn observation that seems valid to be mentioned here is that similar proposals for translation into other languages ​​were also stated, so the application will have an objective of really reaching a great diversity of cultures. Given this, it would be interesting to allocate a number of resources later to promote the marketing of this one.", "q1r": 4, "q2": "The ways to verify the completion of the project and the perception of success that exists around it are consistent with what is expected of this modification carried out in the application. But again, due to the amount of translations similar to these being carried out, it would be interesting if some quantitative indicators started to be used as more specific goals that want to be achieved. Some possible parameters to check this would be:\n\nAn expected average increase in the number of downloads in certain regions where the Burmese language is widely spoken;\n\nAn expected amount of new pools being created by speakers of that target language in question", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "Burmese is spoken by more than 50 million people worldwide. Translate Pool Peek Mobile: Burmese is a proposal that, if successful, will make it easy for many Burmese speakers to use this tool to bet in the Cardano ecosystem. This could attract more people in the Burmese-speaking community to the Cardano ecosystem.", "q0r": 4, "q1": "Pool Peek has been translated into many different languages ​​and is highly appreciated on the app store. However, I'm sorry I couldn't find any information about the team. I think you need to give information about your team so that the community can better understand your experience and skills. For example, you can put Linkedin, Telegram, Twitter, etc. or anything that helps you prove to the community that what you share about your experience and skills is completely true. In addition, you also need to cover the risks that make this proposal impossible. For example: Can't find the right translator or the price slippage makes the cost not enough, etc. I think that if all these things are included, the community will appreciate your suggestion more.", "q1r": 2, "q2": "You also need to give more complete information about the route you will take with the proposal. For example, after 1 month what work will you complete? What work is completed after 3 months? In addition, you also need to be more detailed and transparent about the use of the $3200. For example: $2800 translation cost, how will you spend it? For how many people? In how long? You also need to make your proposal's KPIs more specific in terms of numbers so that it can be easily measured by the community. Example: How many downloads will this app get? How many Burmese speakers will join the Cardano community through this app? I believe that if you give this information enough, the community will appreciate it very much.", "q2r": 2, "assessor": "z_assessor_1213", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "This project is honorable, and a great idea, however since the Challenge does not seem yet to place much focus on staking and finding stake pools to delegate to, more so just operation and creation of stake pools, I’m not sure that it is well suited for this particular Challenge setting or Funding round. \nAlthough having things translated into local languages is awesome and will certainly help Cardano grow, and the app and website are already built so translation is the only thing needing to happen, with the impact of this project being only helping ADA holders to find a Stake Pool to delegate to, it doesn’t quite seem aligned to this Campaign. \nAgain, any project within Cardano that helps increase accessibility to speakers of languages beyond English is awesome, but since this project focuses pretty much exclusively on finding a stakepool, its scope is limited. \n", "q0r": 2, "q1": "The Feasibility for this project has things working both for and against it: \nSince the app and website are already designed, translation is pretty much the only thing to do. However, the Proposer mentions needing to seek out a professional translation service, which suggests that it is only partially planned out, and that the main component of this project – the translation – is still incomplete. \n\nThe tech side of things for this is great and already complete, but the lack of a team being spelled out in the Proposal and mostly just advertising the number of downloads that the app has had limits its Feasibility. Having translated the app to several other languages already boosts confidence that it can become a reality, but I would have liked to see more details broken down in the proposal. \n\nFurther, while solo work is respectable and amazing, this project appears to have only one team member, one Proposer, and one person to do all the work, which means there may become other stressors holding the project back; reducing the resilience of the project. \n", "q1r": 3, "q2": "The only piece that I see to audit the progress of this project is the very final end result, not the steps along the way to track its development. While it is a rather simple goal – just the translation of a relatively simple app – not seeing KPIs along the way such as a successful translation team being found, words translated so far along the way, I find it hard to rate this project higher in auditability. \n\nIn future proposals, which I hope will still happen and will still benefit Catalyst down the line, I would encourage this Proposer to spell out each step of the way piece by piece, so that there are more components for auditors to track or follow the progress of this project with. \n\nWhile it does not impact or change the auditability of this project, and while it may have been a slip-up in the moment, I find it notable that this Proposal’s Auditability section mentions that success looks like “Thousands of Burmese-speaking users in Africa will download and use the application…” yet Burma/Myanmar is a country in Southeast Asia and the Burmese language is native to only Bangladesh (east of India) and Myanmar/Burma, neither within 4,200km (2,600 miles) of Africa. \n", "q2r": 2, "assessor": "z_assessor_1446", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Disclaimer: This assessment would be similar to other of my assessments since these proposals are also similar.\n—\nIt’s great to help non-English speakers feel better to be with us in this ecosystem. However, reading and writing are no longer a problem with them since we’re having so many translating apps and websites. Now there are even devices for speaking and listening translation. How would this application be useful or even more useful than the others? ", "q0r": 1, "q1": "Disclaimer: This assessment would be similar to other of my assessments since these proposals are also similar.\n—\nAs I said in Impact. There are already a lot of translating tools, apps, websites, etc. Even if the app can be created and published successfully. Whether people use it or not will be another problem. The proposal said the success is when thousands of (Burmese) people download and use this app. But how do thousands of people know and want to use this app? We need an advertising plan to promote the app, which the proposal did not cover. The information the proposer gives us is also little and lacks of evidence. In the team members, the proposal said about a primary developer with 10 years of experience without telling his name or contact address. The proposers should try to write about this plan elaborately even when the plan is simple.\n", "q1r": 1, "q2": "Disclaimer: This assessment would be similar to other of my assessments since these proposals are also similar.\n—\nThe proposal gives really less information about the actual plan. Even when the team is confident or the project is simple, they need to give enough information and cover what people want to know. Does the translator app translate audio or text or both? Is it available on PCs/laptops? Does it have a website to use without downloading? I don’t see the answer to these and more questions throughout the proposal.\n", "q2r": 1, "assessor": "z_assessor_1650", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Understanding data in native language gives more clarity over the subject and helps in communicating smoothly .so the proposal has a clear idea of capturing Burmese people where more than 50 million people speak Burmese, there are many translating apps around the market but most of them miss economical/financial terms ,since this application mainly concentrates on block chain related data which will definitely helps for people who wants to invest in block chain with the help of their own native language , apps like these brings more clarity over the subject for non english speaking people ,hence this proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer has done these kind of translations and have already listed the apps in google play store , the listed apps have already gained more attraction with result of 4.5 ratings, hence adding few more similar apps won't be big challenge for the proposer. By these apps proposer wants all the community people to show interest towards cardano and help the people understand the importance of cardano's project , since the proposal has very less chances of getting failed with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal has explained about all the experience of the proposer and has presented all their previous work in detailed manner. But the proposer hasn't presented his timeline of the project, so by what time the app will be listed ,and could have presented a better budget breaking in proposal , the proposal has even not concentrated on marketing strategy for the app developed ,so how can they make people to understand the importance of such apps for cardano projects , even how proposer's team will maintain the server of such apps is also a challenging task hence with information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "This proposal aims to expand access to the Pool Peek application in Asian countries where the population speaks Burmese, thus increasing people's potential to be part of the Cardano community. The proposal does not clearly provide the blueprint for how it will add value to the Cardano ecosystem. The proposer has set a goal for thousands of Burmese language users in Asia to download and use the application, so I believe the proposal is relevant.\n* The proponent created several similar proposals, the only change was the change of the language to be translated and the challenges focus on different continents. So I'm using standardized assessments.", "q0r": 4, "q1": "In the description of the proposal, the following statement was informed ''because we have already translated the application into several foreign languages'' when accessing the link and checking the website, I detected that the option for languages ​​other than English was not included, and when accessing the Mobile app encountered the same problem, which makes it difficult to assess feasibility. It is unclear how many people are needed to implement the given proposal. The proposer reported 10 years of experience in mobile development, but did not include a link to provide us with more details of their professional experiences. The budget was divided into two parts, translation and development, but there is no information on the amount of material to be translated. There is no estimated workload for the development part. The plan does not present a timeline to be evaluated. The proposal does not present an implementation plan, so there is no way to assess this criterion.\n* The proposer created several similar proposals, the only change was the change of the language to be translated and the challenges focus on different continents. So I'm using standardized assessments.", "q1r": 2, "q2": "There is no timeline with milestones and time for completion. The proposer intends that there will be thousands of Burmese-speaking users in Asia (I raise the correction because the proposer entered the wrong continent in the proposal, stating that it is in the continent of Africa), downloading and using the application, despite being an uncertain number can be audited , I recommend including more metrics in the project.\nThe problem description is clear and understandable, but the solution could be more concrete.\n* The proposer created several similar proposals, the only change was the change of language to be translated and the challenges focus on different continents. So I'm using standardized assessments.", "q2r": 3, "assessor": "z_assessor_1828", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "Pool Peek is an app and website that takes all the information about staking pools on Cardano and presents it to you in a more digestible way, in order to make it as easy as possible to decide with which pool you’ll stake. As such, Pool Peek becomes a valuable tool to have and is worth translating into other languages, that will help get as many people as possible understanding how their ADA is staked, and what the difference is between one pool and another.\nAs such, the impact this proposal can have on the Cardano ecosystem is quite positive, and it also addresses the challenge of Grow East Asia, Grow Cardano. The same review applies to his other proposals for translation into other Asian and African languages, since the proposal text is almost identical.", "q0r": 5, "q1": "While the app and/or website are already functional (though I couldn’t get the Android app to install on 2 different devices) some additional info about the plan and especially some social profile links that could prove the skills of the proposer would have been important. Otherwise, the veracity of the facts cannot be proven, so we’ll have to take the proposer by his word. \nOtherwise, I found the budget to be sensible and sufficiently described, the task of the proposal is quite simple, so there’s no need for any additional info.", "q1r": 4, "q2": "The progress metrics are few and concise, having the translated app published on the Google and Apple app stores, while the success is having thousands of downloads from the Burmese speaking community, which in the case of Google App Store is easily verifiable by anyone on the app page.\nThe information presented leads me to conclude that the proposal can be easily tracked and assessed by the community based on these criteria. ", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Translating Peek Pool Mobile into Burmese to help onboard new stakers is a great idea because language barriers are frequently one of the biggest hurdles to getting new members into the cardano community. I think there is some demand for a Burmese app since there are over 50 million Burmese speakers worldwide. In my opinion, this proposal is in line with the challenge setting because it can onboard many new users into the cardano community who will participate in staking. These new members could then become further interested in starting stake pools or getting involved with catalyst. This would address the challenge setting’s goal of increasing the daily and monthly active wallets as well as the quantity and quality or proposals originating from east asia. I do have some questions for the proposers. How will they market this newly translated app to Burmese speakers? Will it be a challenge to get new Burmese-speaking members to become interested in the app and therefore cardano? A potential solution includes marketing the app on different social media platforms. (score given: 4)", "q0r": 4, "q1": "Given the information provided, I do think that the proposal could be successfully implemented, but I do have some qualms with the proposal. The task does not seem too difficult since the app is already complete and will simply be sent to a professional translator to be translated into Burmese. I would encourage the proposer to list who the translator will be because that would give me and voters more confidence in the success of the project. There was minimal breakdown of the budget provided, but I think that this is sufficient given that the scope of the proposal isn’t very large. I have not hired a professional translator before, but the requested budget seems reasonable. The proposer did not attach a name or proof to their work besides their qualifications, so I do not know if I can say that I have 100% confidence. I am quite confident in the proposal, but not fully. Including relevant information in the proposal with regards to personal identity would have helped strengthen my confidence in the proposal. (score given: 3)", "q1r": 3, "q2": "Given the information in the proposal, I do think that this proposal is somewhat auditable, but it could be better. The big metric to track success will be the translation of the app into Burmese, but there is no timeline presented by the proposer. When will the translation be completed? The proposal currently has no way for the cardano community to track the success of the proposal because they don’t even know when the project will be completed. If the proposer could include the information, it would make the proposal even better. Also, including some specific quantitative KPIs about who is using the Burmese translated version of the app would allow the cardano community to see whether there is traction from the Burmese-speaking population. The main goal of this proposal is to broaden the user base for cardano staking, so showing that the app is doing so would fulfill the challenge setting. (score given: 3)", "q2r": 3, "assessor": "z_assessor_310", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The problem presented in this proposal is within the scope of the challenge as there is a large Burmese-speaking community in Asia and translating the Pool Peek app could increase the access of new Burmese-speaking users to information about Cardano.\n\nThe proposal plan does not clearly demonstrate how it will add value to the Cardano community, but considering the simplicity of the purpose (translating the app into Burmese) I believe that the proposal is relevant and would have a positive impact on the challenge.\n\nA goal was set to get thousands of users on the app, which I consider a relevant goal, but I would like to see a more precise target in this goal (thousands is somewhat subjective) and metrics/KPIs that indicate the quality of the app could also be included to facilitate impact assessment.\n\n*This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible.\n\n*Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q0r": 3, "q1": "The proposer described relevant experience in mobile development, but there are no sources to confirm his expertise. There is no information on how many team members will develop this proposal (is it just the proposer?) I would like to see more clarity on this point. There is an intention to hire a professional translation service.\n\nAn important point to note is that the proposer described that the app has translations in other languages(\"We will work with a professional translator to translate the Pool Peek mobile application and app store listing as we have done with other languages. \"), but I couldn't find a language option other than English in the app, I would recommend this clarification.\n\nThe budget could be better detailed, as there is no information on the number of words to be translated, which makes it difficult to assess whether the requested budget is appropriate.\n\nA plan was not presented, I understand that the proposal has a low level of complexity, but I think it is important to have at least a basic plan and a timeline with an estimated delivery date for the translated version of the app.\n\n *This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible. *Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q1r": 2, "q2": "There is clarity in the problem presented and in the relationship with the challenge. There is no plan, the solution presented could have a plan that more clearly indicates the development of the solution. There is no roadmap, no milestones and no timeline for app delivery, this negatively compromises the ability to audit the development of the proposal. The established goal (thousands of downloads) is relevant and a way to track the success of the proposal, but there could be a minimum target for this KPI, as thousands are somewhat vague (can be 2 thousand or 100 thousand, a significant difference) . I would recommend including more KPIs and metrics that allow you to gauge feedback from app users. *This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible. *Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The proposer offers a solution with no backup information of the problem they found - about translating their mobile application into Burmese. Is there enough demand from the native spoken Burmese for information about the Cardano stake pool operator? I would suggest the proposer present more research data on why they choose Burmese?\n", "q0r": 1, "q1": "Unfortunately, the proposer did not share any detailed plan, or timeline to implement this proposal successfully. The budget proposed is not broken down in detail for me to assess if it is reasonable or not (for ex. how many hours estimated time to translate the content or how much the cost in detail to develop the app - because the English version is already live?)\n\nFrom the website link and checking the google App store, the mentioned app developer named \"Colorwork Apps\"  - but this information was not shared in the proposal if this is their internal team or external/third-party developer. As a CA it is difficult to assess with limited information given about their team and credibility. \n\n", "q1r": 2, "q2": "The planned timeline was not shared by the proposer, so Cardano Community will not able to track the progress until it's done. The proposer also not mentioned a detailed KPI or Target they want to achieve, but mention \"Thousands of Burmese-speaking users in Africa\", which means they target African? As the detailed proposed plan not shared it is very difficult for me as CA to assess this proposal.\n\nI would suggest the proposer do deeper research to back up their \"reasoning\" and more supporting data to show why and who will use this application. If the specific target a country or region is it possible also to collaborate with the local Cardano Community there to create this proposal?", "q2r": 1, "assessor": "z_assessor_646", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Proposer points out the problem of language barriers for people who speak Burmese language and offers a solution by creating Pool Peek Mobile and translate it into Burmese, a language spoken by 50 million people worldwide. We can conclude that the translation would have an impact and it would add value to the Cardano ecosystem. It is necessary to write down in proposal and work out how the project will have an impact and how it will add value to Cardano so that not everything remains in the conclusions. I would love to see elaborated KPIs that are in line with the KPIs of this challenge.", "q0r": 3, "q1": "My opinion is that the community should have an insight into the skills and experience needed to implement this project. The lack of transparency about the proposer and the team itself can raise doubts among the community as to whether the project will be realized. It is necessary to work out a better budget to know how many working hours it takes to translate from English to Burmese language. The budget is reasonably presented. I would like to see what time period is needed for the translation as well as a detailed work plan, what will be done and in what way. There are risks and challenges in every project so it would be good to think about the possible risks and challenges in this project as well.", "q1r": 2, "q2": "In order for the project to be followed and monitored by the communities and in order for the community to have an insight into the quality of the project itself, it is necessary to have an elaborated roadmap with milestones and KPIs that are completely omitted in this proposal. This proposal has its value and weight so I suggest that the proposer conects with members of the Cardano ecosystem to help him prepare a proposal for Catalyst F9.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Note to VCa: this proposal being very similar to several other proposals by the same team, my assessment may include similarities.\nThis proposal offers to translate into Burmese an existing web-app named “Pool Peek Mobile”. This web app educates and assists new Cardano users about staking, includes a pool map and a pool search engine. \nThis app has good reviews in Google and Apple app stores, and after having tested it myself, I found it useful, and I confirm I will keep it on my phone.\nThe proposer explains Burmese is spoken by 50 million speakers world-wide, which I personally do no consider is a huge number, which explains the 3-star score for impact. \n", "q0r": 3, "q1": "The team intends to hire a professional translation service to support the work and evaluates the budget is 2.8kUSD. There should be no difficulty to perform this task, but as Burmese is a not so widely spoken language, the proposer could have made it more clear by adding precisions about what the team has done so far to source this external translation skill.", "q1r": 4, "q2": "Success being defined as “the publication of the app on Google Play Store and Apple App store in Burmese” does not align with the challenge brief. I recommend for a further application on Catalyst to include metrics that clearly relates the goal of the proposal to the challenge brief. In this case, for the “Grow East Asia, Grow Cardano” challenge, it is for example: the quantity and quality of funded proposals originating from East Asian teams.", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "We built Pool Peek Mobile to assist users with the staking process. We will translate the app into Burmese (50 million speakers world-wide).", "experience": "Pool Peek mobile has already been translated into several over languages and has and average rating of 4.5 stars across the Google Play and Apple App stores."}