{"id": 397576, "author": "eagle", "title": "Translate Pool Peek Mobile: Thai", "url": "https://cardano.ideascale.com/a/dtd/397576-48088", "category": 26444, "amount": 2100, "description": "It is not straight forward for non-English speaking users to onboard into the Cardano ecosystem.", "f6_no_assessments": 12, "f6_rating": 2.9722222222222228, "videos": [], "media": [], "f6_assessments": [{"id": 1991, "q0": "(This Proposal is very similar, nearly identical, to several others, therefore I acknowledge that my Assessment is likely to be flagged by the similarity bot) \n\nThis project is honorable, and a great idea, however since the Challenge does not seem yet to place much focus on staking and finding stake pools to delegate to, more so just operation and creation of stake pools, I’m not sure that it is well suited for this particular Challenge setting or Funding round. \nAlthough having things translated into local languages is awesome and will certainly help Cardano grow, and the app and website are already built so translation is the only thing needing to happen, with the impact of this project being only helping ADA holders to find a Stake Pool to delegate to, it doesn’t quite seem aligned to this Campaign. \nAgain, any project within Cardano that helps increase accessibility to speakers of languages beyond English is awesome, but since this project focuses pretty much exclusively on finding a stakepool, its scope is limited. \n", "q0r": 2, "q1": "The Feasibility for this project has things working both for and against it: \nSince the app and website are already designed, translation is pretty much the only thing to do. However, the Proposer mentions needing to seek out a professional translation service, which suggests that it is only partially planned out, and that the main component of this project – the translation – is still incomplete. \n\nThe tech side of things for this is great and already complete, but the lack of a team being spelled out in the Proposal and mostly just advertising the number of downloads that the app has had limits its Feasibility. Having translated the app to several other languages already boosts confidence that it can become a reality, but I would have liked to see more details broken down in the proposal. \n\nFurther, while solo work is respectable and amazing, this project appears to have only one team member, one Proposer, and one person to do all the work, which means there may become other stressors holding the project back; reducing the resilience of the project. \n\nSomething that I am unsure how to feel about is that the budget breakdown in Feasibility calculates out to $1,500 + $400 = $1,900, however the Requested Funds for the Proposal is listed as $2,100. While that is only $200 among a Challenge that offers $150,000 available, the discrepancy between pieces of this Proposal suggest incomplete work, that may benefit from a more careful analysis and revision in subsequent Funding rounds, when I hope to see this project submitted again to become a reality. For this discrepancy I have to count off. \n", "q1r": 2, "q2": "(This Proposal is very similar, nearly identical, to several others, therefore I acknowledge that my Assessment is likely to be flagged by the similarity bot). \n\n\nThe only piece that I see to audit the progress of this project is the very final end result, not the steps along the way to track its development. While it is a rather simple goal – just the translation of a relatively simple app – not seeing KPIs along the way such as a successful translation team being found, words translated so far along the way, I find it hard to rate this project higher in auditability. \nIn future proposals, which I hope will still happen and will still benefit Catalyst down the line, I would encourage this Proposer to spell out each step of the way piece by piece, so that there are more components for auditors to track or follow the progress of this project with. \n\nWhile it does not impact or change the auditability of this project, and while it may have been a slip-up in the moment, I find it notable that this Proposal’s Auditability section mentions that success looks like “Thousands of Thai-speaking users in Africa will download and use the application…” yet Thailand is a country in Southeast Asia and the Thai language is native to only Thailand and surrounding areas, which is not within 5,200km (3,200 miles) of Africa. \n", "q2r": 2, "assessor": "z_assessor_1446", "no_vca": 6, "ne": 5, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 7304, "q0": "The proposal doesn't fit 100% for the challenge because it intends to translate an app that helps people buy Ada and delegate in pools to Thai, and Thailand is not exactly in the geographic region that we are targeting in this challenge. However, I think that if we are to think about Asia as a whole and the need to bring the technologies of the Cardano ecosystem to different areas and people, I still think it's worth funding it, especially since the app already exists so it wouldn't be something totally starting from the zero, and from what the proponent says it is well evaluated, that is, it would be a good business to expand it. Thailand is not an area where cryptographic activity is that intense, as far as I know, I apologize if I'm wrong, but I'm already in the community, I have 4 Catalyst funds and this is the first time I've evaluated any proposal aimed at that country . That's good and bad, I believe. It is good because we will be taking an application in the local language to territories that are not well supported in terms of knowledge about blockchain technologies, which can be a great boost for people to start taking an interest in the activity. It would be important, in my opinion, to include a small guide that talks about the main concepts of the cryptographic world in the application. Here's the suggestion: as soon as the person registered, an infographic would automatically appear on the screen that explained through images about what blockchain, Cardano, Ada, a pool and etc. are. Sometimes people go after these things because they think they will profit exponentially, but I believe that we all need to have a broader view of what Cardano is all about so that we can understand where we fit in in the community and how we can help blockchain, at the same time as investments and we managed to get some financial benefit out of it. If this little guide were inserted into the app, I believe it would be a good way (obviously it wouldn't teach anything beyond the basics, but it's a start). That said, I will give it four stars because, despite not being a country in East Asia, it is close and the more translations of Cardano-related content we finance, the better, in my opinion, since the language barrier is the main impediment to the mass expansion of the our blockchain. \n", "q0r": 4, "q1": "The auto claims that he already has 10 years of experience with the development of mobile applications and that some of them have millions of downloads, but it would be interesting for him to tell us more. For example, what apps are these? It would be amazing if he left the link for them on the play store / apple store, so that it was possible to know his work in practice. He'll do the development work, probably, it would be nice if he could tell us how that would go. And about the translator, I believe that finding a translator from English to Thai is not as fast as it is for languages ​​like Spanish and French, where many translators work with it. It is entirely possible to find someone who is qualified, but I would like to know about this selection process, or even better, if the bidder already has a few candidates in mind. It would be important to see previous examples of his work, that is, to analyze his resume, just to convey more confidence in the project team. Regarding the script, it would be nice if he had provided a schedule of how long this work would last, this would even help to audit the proposal, as I will talk about in the topic below. Anyway, without understanding how this work would be divided based on the passage of time, it is a little difficult to visualize the process. Even if it is a simpler task, where only two professionals would be involved, this notion of development would be interesting to have. And finally, as far as the budget is concerned, it is divided between the work of the developer and the translator, it is not complex, but a suggestion I can make is to determine the price of the hour of work - for that we would need to know how much How long would this translation take? For example, $1500 would go towards translation, right? But how long would that take, 1 week, 1 month? Depending on the time spent on this, we could have a better idea if the requested value was fair. In general, the feasibility of this proposal is good because of two factors: the author certainly knows what he is doing since he has a lot of previous experience and this would be an extension of something that already exists, and also because it is not a complex project . However, the suggestions I made could improve this part of the proposal even further, in my opinion, because details are never unnecessary. \n", "q1r": 4, "q2": "The auditability of the proposal is simple, the proposer indicates how we could monitor the success of the project based on the numbers of downloads of the application by speaking Thai, but I think he was wrong in the part that says that this audience is in Africa, because the Thailand is in Asia... right? Anyway, this is a pretty straightforward way to check if the main goal has been achieved, but I think we could do a little more analysis. Is it possible to measure the impact of this translation if we think about the more human aspects of the thing, for example, there was a survey in the app itself about whether these new users are able to understand the technologies of the Cardano ecosystem? Have they become interested in our blockchain to the point of doing other activities besides investing in Ada? For example, did they find out about Catalyst? Did they become CAs, bidders? Did they study about the cryptographic world, perhaps? That way, I think we would have a deeper understanding of the impact of translation on the selected target audience. But I also advise that we follow up on the translation process itself, if it is being done as promised, in the time it was planned, if the results of the process (not just the product) are within the limits. It would be positive if a Thai-speaking Cardano ecosystem member himself liaised with the project team (developer and translator) and brought feedback to the rest of the community. As in the previous topic about feasibility, I think this one is satisfactory, but I advise a further level of depth to understand the real impacts of translating this application on speakers of the language in question. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 8, "ng": 0, "nfo": 1, "vca_o": 2}, {"id": 356, "q0": "Proposals designated for this fund must assume that the purpose of the idea is to increase the influence of Cardano's ecosystem in regions where this technology has been little publicized until then.\n\nWith the main objective of translating an application relevant to Cardano into Thai, we see that the proposal fits the scope of the challenge. In fact, this is not a fundamentally innovative idea, but it is possible to easily observe what its impacts would be in the short term, but also in the medium, long term.\n\nThe purpose of the app is to provide its users with possibilities of stacking pools for the allocation of ADA. In the short term, those who already own the cryptocurrency will have more options on how to make this allocation and in the medium/long term, with the disclosure of Cardano, the expectation is that more projects will emerge in the Thai community and this flow of cryptocurrency allocations (and the yield of pools) is even higher.\n\nWe noticed that despite some occasional lack of information, the general idea is well structured, as well as the amount of capital requested is quite fair, let's see these points below.", "q0r": 5, "q1": "We see that the budget breakdown focuses on two main steps, the transaction costs, totaling $1,500, and the development cost, representing $400. In this fund, there are other similar translation proposals that are requiring similar plots, this is a good sign, indicating that these values ​​requested here follow the same pattern.\n\nIt was also pointed out that the main developer of the app (contact found on the play store: support@colorworkapps.com) has a lot of experience with development. One detail that was missing information here was the availability of some form of verification of the curriculum of this developer. This would not be such an impressive detail since the translation and development task to be carried out is relatively simple. However, given the history of other similar proposals by the author, which also did not present this information, we believe that this flaw could have been corrected.\n\nIt would be interesting if images were also available in the proposal to see the result of the translation of this application into other languages, proving the high chance of success of the current proposal. Additionally, indicating the professional translation tool to be used would also be a positive point.\n\nGiven these reservations, what was presented by the proposal to complete the objective is correct and has coherence in relation to the task it proposes to perform.", "q1r": 4, "q2": "The indicated ways of measuring the completion of the project and its subsequent reach are appropriate. The launch of the final translated application on the platforms and also its future use by the Thai community, increasing the capillarity of Cardano's ecosystem in more regions, are good indications of the success that this proposal seeks.\n\nAn additional point that could also be considered to validate whether the engagement generated by this initiative has met expectations is to look for ways to record new Cardano-related projects that are being created by the Thai community and compare these numbers to the time before the app's launch.\n\nIndicators of the emergence of more pools built by the Thai community, or of pools being used by them, is another idea of measuring the impacts and success of the project.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 13, "ne": 4, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 3338, "q0": "Disclaimer: This assessment would be similar to other of my assessments since these proposals are also similar.\n—\nIt’s great to help non-English speakers feel better to be with us in this ecosystem. However, reading and writing are no longer a problem with them since we’re having so many translating apps and websites. Now there are even devices for speaking and listening translation. How would this application be useful or even more useful than the others? ", "q0r": 1, "q1": "Disclaimer: This assessment would be similar to other of my assessments since these proposals are also similar.\n—\nAs I said in Impact. There are already a lot of translating tools, apps, websites, etc. Even if the app can be created and published successfully. Whether people use it or not will be another problem. The proposal said the success is when thousands of (Thai) people download and use this app. But how do thousands of people know and want to use this app? We need an advertising plan to promote the app, which the proposal did not cover. The information the proposer gives us is also little and lacks of evidence. In the team members, the proposal said about a primary developer with 10 years of experience without telling his name or contact address. The proposers should try to write about this plan elaborately even when the plan is simple.\n", "q1r": 1, "q2": "Disclaimer: This assessment would be similar to other of my assessments since these proposals are also similar.\n—\nThe proposal gives really less information about the actual plan. Even when the team is confident or the project is simple, they need to give enough information and cover what people want to know. Does the translator app translate audio or text or both? Is it available on PCs/laptops? Does it have a website to use without downloading? I don’t see the answer to these and more questions throughout the proposal.", "q2r": 1, "assessor": "z_assessor_1650", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 4534, "q0": "Understanding data in native language gives more clarity over the subject and helps in communicating smoothly .so the proposal has a clear idea of capturing thai people where more than 60 million people speak thai, there are many translating apps around the market but most of them miss economical/financial terms ,since this application mainly concentrates on block chain related data which will definitely helps for people who wants to invest in block chain with the help of their own native language , apps like these brings more clarity over the subject for non english speaking people ,hence this proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer has done these kind of translations and have already listed the apps in google play store , the listed apps  have already gained more attraction with result of 4.5 ratings, hence adding few more similar apps won't be big challenge for the proposer.\nBy these apps proposer wants all the community people to show interest towards cardano and help the people understand the importance of cardano's project , since the proposal has very less chances of getting failed with  given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal has explained about all the experience  of the proposer and has \n presented  all their previous work in detailed manner.\nBut the proposer hasn't presented his timeline  of the project, so by what time the app will be listed ,and could have presented a better budget breaking in proposal , the proposal has even not concentrated on marketing strategy for the app  developed ,so how can they make people to understand the importance of such apps for cardano projects , even how proposer's team will maintain the server of such apps is also a challenging task hence with information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5045, "q0": "This proposal aims to expand access to the Pool Peek application in Asian countries where the population speaks Thai, thus expanding people's potential to be part of the Cardano community. The proposal does not clearly provide the blueprint for how it will add value to the Cardano ecosystem. The proposer has set a goal for thousands of Thai-speaking users in Asia to download and use the app, so I believe the proposal is relevant.\n* The proposer created several similar proposals, the only change was the change of the language to be translated and the challenges of focusing on different continents. So I'm using standardized assessments.", "q0r": 4, "q1": "In the description of the proposal, the following statement was informed ''because we have already translated the application into several foreign languages'' when accessing the link and checking the website, I detected that the option for languages ​​other than English was not included, and when accessing the Mobile app encountered the same problem, which makes it difficult to assess feasibility. It is unclear how many people are needed to implement the given proposal. The proposer reported 10 years of experience in mobile development, but did not include a link to provide us with more details of their professional experiences. The budget was divided into two parts, translation and development, but there is no information on the amount of material to be translated. There is no estimated workload for the development part. The plan does not present a timeline to be evaluated. The proposal does not present an implementation plan, so there is no way to assess this criterion.\n* The proposer created several similar proposals, the only change was the change of the language to be translated and the challenges of focusing on different continents. So I'm using standardized assessments.", "q1r": 2, "q2": "There is no timeline with milestones and time for completion. The proposer intends that there will be thousands of Thai-speaking users in Asia (I raise the correction because the proposer entered the wrong continent in the proposal, stating that it is in the continent of Africa), downloading and using the application, despite being an uncertain number can be audited , I recommend including more metrics in the project.\nThe problem description is clear and understandable, but the solution could be more concrete.\n* The proposer created several similar proposals, the only change was the change of language to be translated and the challenges to focus on different continents. So I'm using standardized assessments.", "q2r": 3, "assessor": "z_assessor_1828", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 5484, "q0": "At first glance, one might think there is no need for another website or app that helps you stake your ADA. But when looking at how the website works, one can see the features that are not present elsewhere - at least not to my knowledge - and that actually make Pool Peek a valuable tool to have and worth translating into other languages, that will help get as many people as possible understanding how their ADA is staked, and what the difference is between one pool and another.\nAs such, the impact this proposal can have on the Cardano ecosystem is quite positive, and it also addresses the challenge of Grow East Asia, Grow Cardano. The same review applies to his other proposals for translation into other Asian and African languages, since the proposal text is almost identical.", "q0r": 5, "q1": "While the app and/or website are already functional (though I couldn’t get the Android app to install on 2 different devices) some more info about the plan and especially some links that could prove the skills of the proposer would have been important. Otherwise, the veracity of the facts cannot be proven, so we’ll have to take the proposer by his word. \nOtherwise, I found the budget to be sensible and sufficiently described, the task of the proposal is quite simple, so there’s no need for any additional info.", "q1r": 4, "q2": "The metrics of progress in the case of this proposal are quite simple: to have the app published on the two app stores and the success is having thousands of downloads from the Thai community, which in the case of Google App Store is verifiable by anyone on the app page.\nAs such, I find the proposal to be easily tracked and assessed by the community. ", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5987, "q0": "I think that translating Peek Pool Mobile into Thai is a great benefit to the cardano ecosystem because it will allow people who speak Thai to gain a better understanding of the staking landscape. The project is also in line with the challenge setting because it encourages the growth of cardano in asia. Translating the app opens the door to over 60 million Thai speakers who can then become cardano stakers, voters, catalyst participants, and more. I do have questions for the proposers. How will this app be marketed to the Thai population? Is there a specific marketing strategy that is in place to find the new users after the app is translated? Otherwise, it doesn’t seem like the app would reach as many people. (score given: 4)", "q0r": 4, "q1": "Given the information provided, I do think that the proposal could be successfully implemented, but there are a couple things that prevented me from having more confidence in it. The proposer did not include any references to their qualifications besides what they listed. Thus, I cannot verify their qualifications, which doesn’t give me full confidence. Besides that, I do think that the concept behind the proposal is solid. The task of sending the app to a professional translator seems simple enough. It would have been nice to also know the translation service that would be used because it would give both myself and voters more insight into and confidence in the proposal. There wasn’t much breakdown given for the proposal, but I think that it was sufficient since the scope of the proposal isn’t very large and the fees all make sense. I have not hired a professional translator before, but I do think that the delegated amount of money to that part of the proposal seems reasonable. (score given: 3)", "q1r": 3, "q2": "Given the information provided, I do think that the proposal can sort of be audited successfully. The proposer listed the translation of the app as the big KPI, but they did not include any date of completion for the translation. Thus, the community won’t know when to expect it will be done and can’t keep track of the progress as much. I would also encourage the proposer to include other quantitative KPIs, such as the traffic to the Thai translated version of the website/app. Since the challenge setting is to grow cardano in asia, it would be good to have goals for the exact numbers of Thai speakers who will visit the website. Having these KPIs would also help the cardano community to see if the proposal was successful. (score given: 3)", "q2r": 3, "assessor": "z_assessor_310", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6505, "q0": "The problem presented in this proposal is within the scope of the challenge as there is a large Thai-speaking community in Asia and translating the Pool Peek app could increase the access of new Thai-speaking users to information about Cardano.\n\nThe proposal plan does not clearly demonstrate how it will add value to the Cardano community, but considering the simplicity of the purpose (translating the app into Thai) i believe that the proposal is relevant and would have a positive impact on the challenge.\n\nA goal was set to get thousands of users on the app, which I consider a relevant goal, but I would like to see a more precise target in this goal (thousands is somewhat subjective) and metrics/KPIs that indicate the quality of the app could also be included to facilitate impact assessment.\n\n*This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible.\n\n*Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q0r": 3, "q1": "The proposer described relevant experience in mobile development, but there are no sources to confirm his expertise. There is no information on how many team members will develop this proposal (is it just the proposer?) I would like to see more clarity on this point. There is an intention to hire a professional translation service.\n\nAn important point to note is that the proposer described that the app has translations in other languages(\"We will work with a professional translator to translate the Pool Peek mobile application and app store listing as we have done with other languages. \"), but I couldn't find a language option other than English in the app, I would recommend this clarification.\n\nThe budget could be better detailed, as there is no information on the number of words to be translated, which makes it difficult to assess whether the requested budget is appropriate.\n\nA plan was not presented, I understand that the proposal has a low level of complexity, but I think it is important to have at least a basic plan and a timeline with an estimated delivery date for the translated version of the app.\n\n *This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible. *Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q1r": 2, "q2": "There is clarity in the problem presented and in the relationship with the challenge. There is no plan, the solution presented could have a plan that more clearly indicates the development of the solution. There is no roadmap, no milestones and no timeline for app delivery, this negatively compromises the ability to audit the development of the proposal. The established goal (thousands of downloads) is relevant and a way to track the success of the proposal, but there could be a minimum target for this KPI, as thousands are somewhat vague (can be 2 thousand or 100 thousand, a significant difference) . I would recommend including more KPIs and metrics that allow you to gauge feedback from app users. *This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible. *Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7837, "q0": "Note: I noticed the proposer has several proposals with the same template, but only changing the \"language\" - so As a CA, my assessment would be generally the same\n\nThe proposer offers a solution with no backup information of the problem they found - about translating their mobile application into Thai. Is there enough demand from the native spoken Thai for information about the Cardano stake pool operator? I would suggest the proposer present more research data on why they choose Thai?\nA simple google trend result or any English proficiency surveys might help.", "q0r": 2, "q1": "Note: I noticed the proposer has several proposals with the same template, but only changing the \"language\" - so As a CA, my assessment would be generally the same\n\nUnfortunately, the proposer did not share any detailed plan, or timeline to implement this proposal successfully. The budget proposed is not broken down in detail for me to assess if it is reasonable or not (for ex. how many hours estimated time to translate the content or how much they cost in detail to develop the app - because the English version is already live?)\n\nFrom the website link and checking the google App store, the mentioned app developer named \"Colorwork Apps\"  - but this information was not shared in the proposal if this is their internal team or external/third-party developer. As a CA it is difficult to assess with limited information given about their team and credibility. \n\n", "q1r": 2, "q2": "Note: I noticed the proposer has several proposals with the same template, but only changing the \"language\" - so As a CA, my assessment would be generally the same\n\nThe planned timeline was not shared by the proposer, so Cardano Community will not able to track the progress until it's done. The proposer also not mentioned a detailed KPI or Target they want to achieve, but mention \"Thousands of Thai-speaking users in Africa\", which means they target African? As the detailed proposed plan is not shared it is very difficult for me as CA to assess this proposal.\n\nI would suggest the proposer do deeper research to back up their \"reasoning\" and more supporting data to show why and who will use this application. If the specific target is a country or region is it possible also to collaborate with the local Cardano Community there to create this proposal?", "q2r": 1, "assessor": "z_assessor_646", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8195, "q0": "Proposer talks about a problem faced by people who do not speak English. His solution, he says, is to create a Pool Peek Mobile app to assist users with the staking process, which would be translated into Thai language. Proposer claims that 60+ million people in the world use Thai. We can conclude that this project would help people who do not speak English but it is necessary for the proposer to state how the project would have an impact and how would add value to the Cardano ecosystem. KPIs are missing so it is not possible to compare KPIs of this project with KPIs of this challenge.", "q0r": 3, "q1": "A video has been posted on the YouTube channel where we can get information about what kind of application proposer is talking about. To get votes and funds, I think it would be good if it was clearly presented via LinkedIn or Github who is behind this project, how many people are working on this project!? A proposer represents a budget that is reasonable. I would like to see exactly how the money is distributed and how many working hours it takes to realize the listed items. The project should have a clear working plan with given time frames within the proposal will be done, what is stated in the proposal. It would be good if the proposer would connect with the members of the Cardano ecosystem who will surely help proposer in drafting the proposal.", "q1r": 2, "q2": "The roadmap and milestones are missing so the community is completely deprived of that information. KPIs are mentioned in the proposal but this is insufficient for monitoring and ultimately progress for the success of the project. The community due to lack of all the above mentioned aspects cannot follow this project.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9881, "q0": "Note to VCa: this proposal being very similar to several other proposals by the same team, my assessment may include similarities.\nThis proposal offers to translate into Thai an existing web-app named “Pool Peek Mobile”. This web app educates and assists new Cardano users about staking, includes a pool map and a pool search engine. \nThis app has good reviews in Google and Apple app stores, and after having tested it myself, I found it useful, and I confirm I will keep it on my phone.\nThe proposer explains Thai is spoken by 60 million speakers world-wide, which I personally do not consider is a huge number, which explains the 3-star score for impact. \n", "q0r": 3, "q1": "The team intends to hire a professional translation service to support the work and evaluates the budget is 1.5kUSD. There should be no difficulty to perform this task, but as Thai is a not so widely spoken language, the proposer could have made it more clear by adding precisions about what the team has done so far to source this external translation skill.", "q1r": 4, "q2": "Success being defined as “the publication of the app on Google Play Store and Apple App store in Thai” does not align with the challenge brief. I recommend for a further application on Catalyst to include metrics that clearly relates the goal of the proposal to the challenge brief. In this case, for the “Grow East Asia, Grow Cardano” challenge, it is for example: the quantity and quality of funded proposals originating from East Asian teams.", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "We built Pool Peek Mobile to assist users with the staking process. We will translate the app into Thai (60+ million speakers world-wide).", "experience": "Pool Peek mobile has already been translated into several over languages and has and average rating of 4.5 stars across the Google Play and Apple App stores."}