{"id": 398994, "author": "dimitri777", "title": "Cardano in Laotian", "url": "https://cardano.ideascale.com/a/dtd/398994-48088", "category": 26444, "amount": 7100, "description": "Lack of official Laotian content . Laotian speakers cant learn in their language.  30 million native speakers  In Laos  and Internationally", "f6_no_assessments": 14, "f6_rating": 3.9523809523809526, "videos": [], "media": [], "f6_assessments": [{"id": 789, "q0": "The world's Laotian-speaking community is over 30 million people. Cardano in Laotian is a great way to help Cardano reach out to the Lao-speaking community. Translating Cardano and IOHK documents into this language will help the community of more than 30 million Lao speakers have more opportunities to know about blockchain technology and the Cardano ecosystem. The successful proposal will help Cardano grow even stronger in Southeast Asia.", "q0r": 5, "q1": "Under the leadership of Dimitri Fernando, an active member of the Catalyst community along with other members of the team. These are all passionate and experienced people. In particular, they all love the Cardano ecosystem. I believe this proposal will be successfully implemented by the team. In addition, I can also easily find the information of each member of the group. This will help the community a lot in connecting with team members. Some risks such as diseases or currency devaluation are also clearly addressed by the team. I believe the team has prepared very carefully for the success of this proposal.", "q1r": 5, "q2": "With a 3-month roadmap given. Each month the team will complete 120 minutes of video I believe the team will do a good job on this. In addition, the $7,100 budget is used openly and transparently by the team. I feel that this money is used properly. My little suggestion for you to get higher consensus from the community is that you need to specify the number of KPIs you give so that the community can more easily measure. . Example: How many people will subscribe to LanCardano channel on Youtube? How many downloads will there be? How many people will participate in the Cardano system through these videos? I hope you will do better next time.", "q2r": 5, "assessor": "z_assessor_1213", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 1998, "q0": "This Proposal is sure to have a strong Impact, aligned with the Challenge brief of growth into the developing economies and making our community more accessible. It clearly identifies a solution for expanding Cardano as a community and whole, via translating the content of IOHK into Lao, along with news and current affairs of Cardano, including Subtitles, ensuring a positive Impact. \n\nThe Proposer noted that “South East Asians are hard working and have been known to be natural coders and developers” which shows that the Cardano community will likely grow by expanding our talent-pool, growing the Cardano ecosystem, considering the cited 30 Million native speakers of Lao that this project could reach. Furthermore, teaching about blockchain and crypto technology beyond merely Cardano project, seems likely to have a bigger-picture Impact of expanding blockchain adoption altogether. \nSubtitles for each translated video ensure Deaf and Hard-of-Hearing speakers will also be included, potentially expanding the Impact of the project into the disability community as well. \n\nThe Proposer states that Emurgo and Cardano Foundation YouTube channels can be translated in the future, thereby adapting for future expansion, thus a cascading Impact and growth over time. \n\nThe Proposal addresses 13 of the United Nations’s 17 “Sustainable Development Goals,” further showing positive impact. \n\nIn my own research I see that Wikipedia lists Lao as a lingua franca that gets used all across Laos even for speakers of other languages, and also that Wikipedia says that Lao is mutually-intelligible with Thai and with Isan, therefore the Impact of this Proposal may stretch even beyond what the Proposal itself has stated. \n", "q0r": 5, "q1": "The Proposer sets a very realistically Feasible goal of how many videos by the end of 3 months, as well as the goal translation of a video every 3 days. Proposer cites 20 years of industry connections and experience in their “Partner network” of translators. \nThe cost-per-word of translation appears to be considerably cheaper than most commercial translation services, and the Proposal ensures that extra work done will not eat into budget requests. \nThe requested funding and cost is quite low ($7,100/$150,000 for the Challenge, = 4.7% of total Challenge budget).\n\n\nA very slight potential roadblock for Feasibility is, as the Proposer mentions, coining/translating unique blockchain or crypto jargon language into Lao, however the Proposer mentions a very clear path towards addressing this, with “Master Translators,” which all members of the listed team seem to have strong connections with from decades of field experience and networking.\n", "q1r": 5, "q2": "Monitoring the number of videos produced on the LanCardano channel and, as mentioned, view counts, Comments, total hours watched, as well as increase in international Cardano members or wallets, seems to be a rather strong set of Auditability measures. Any voter, ADA holder, Auditor, or anyone should easily, publicly be able to follow along the Month 1, Month 2, and Month 3 goals and see numbers, such as (Proposer’s words) numbers of subscribers to the YouTube channel, average views per video, number of comments per video, and of watching hours, and more metrics that anyone could verify. \n", "q2r": 5, "assessor": "z_assessor_1446", "no_vca": 9, "ne": 4, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 2583, "q0": "In the developing society and ecosystem. Many countries with their own voices, and are translated in language communication. However, in the Cardano ecosystem there is still a lack of official Lao language content. The proposed team had the idea to provide official Lao language content for Cardano. Applies to 30 million Lao speakers around the world. Add a number of new user communities for Cardano, helping the ecosystem grow and enrich. The proposed team was very careful and meticulous to find solutions to the risks they might face when implementing the project.", "q0r": 5, "q1": "The team proposes to apply the LanCardano Youtube channel to launch and build videos. The detailed roadmap will be conducted in 3 months with internal teams and professional translators to complete the project on time. The budget is proposed and explained in depth for each time, the work is allocated during the project implementation. What is even more important is that there are many details about the number of members involved. The members are all active members of the fund 6 and fund 7 communities. They are all people with professional knowledge in many necessary fields, suitable for performing the assigned tasks in the project.", "q1r": 5, "q2": "Proposals provide good performance metrics, have specific value, are easy to measure, and provide insight into project success. Detailed budget, coherent, enough information for audit. The proposal is completely new but has demonstrated the expertise in planning, transparency in the budget and the experience of the project team members. Power up the success of the project.", "q2r": 5, "assessor": "z_assessor_1535", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 3711, "q0": "Cardano should not be limited to one language, by translating Cardano into different regional languages would help it gain more popularity and more reach to the users. The proposer has identified the problem effectively and has addressed the solution to it. In order to effectively market or spread the knowledge on Cardano to all the people of the country, translation of the content of Cardona to local language is required and is the most effective way to reach a larger group of people. In this case, the local language would be Laotian , which is very huge community and they are very proud of the language. Hence translating the contents of Cardano in Laotian would reach a lot more people than expected and also be appreciated for translating into Laotian. Most of the people are educated in their local language and might face difficulties in English, by translating the content to Laotian it would benefit a lot of people in getting familiar with Cardano and also the advancements of it. The proposer has effectively addressed the challenge and I strongly believe this application will be a success to Cardano as it will be reach more people and more people will be knowledgeable through this with the comfort of learning in their own language. By doing this it would add a lot of value to the cardona system as it will reach worldwide. The goals of the project are aligned with the challenge. It is also a scalable project and could go global benefiting Cardona on a large scale.", "q0r": 5, "q1": "The proposer has a roadmap on how to implement the project as they have mentioned that he will be uploading a new video every 3 days in the Laotian language and hence by uploading the Cardona content in the  Laotian language on a regular interval of time would attract more viewers and gain more subscribers. The proposer has also provided links and their team has the relevant skills and experience to implement the proposal. It would also be helping a lot of people educate about Cardano in a better way. The budget is also clearly mentioned and they have shown the broken down budget and its use cases. This whole together will be indeed bringing a new community to the Cardona, once someone sees the content in Laotian they will be more likely to promote the videos on their own to friends and family to watch them and it will be of a better reach. The proposer has a proper plan and will achieve the goal in the projected time and also has pointed out the necessary resources required to complete the project. The experience of proposer and his team seems to be very impressive and the proposal is likely to be implemented successfully. The proposer has foreseen the challenges/risks they might face and also has alternative solutions to solve them. ", "q1r": 4, "q2": "The proposer has requested 7100 USD as funds to implement this project and he has also provided the breakup cost that will be spent on each individual requirement which seems fair. The proposer has also projected the funds for next 3 months and the money requested will be sufficient to audit the progress. The proposal is most likely to succeed as it going to reach over a community of 30 million Laotian speaking individuals. It will be very useful in reaching Cardona into the market by translating the content into regional languages and the reach will be more than expected in the future days. The proposer has also foreseen the difficulties they might face while implementation and also has alternative solutions for the same. The proposer has understood the problems of the locals clearly and has proposed the suitable solution which will benefit all.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 3925, "q0": "This proposal has the great potential to improve the knowledge base for Laotian by providing translated videos. Proposer provides analysis on the number of Laotian speakers, but in my opinion, should also provide more analysis on the level of blockchain understanding of Laotians. If blockchain understanding is low, then creating blockchain videos should be taken place first or parallel, before creating content about the Cardano ecosystem.", "q0r": 4, "q1": "Proposer provides enough information about the number of translated videos published each month, as well as the duration of videos. \n\nI would like to know more about the specific content of each video, to better assess whether the audience will get adequate fundamental knowledge about Cardano or not. \nThe information about team members is clear and reliable, the team as a whole has great experience in both Cardano and translation. \nHowever, information about the marketing campaign is missing.", "q1r": 4, "q2": "Proposer provides detailed roadmap with specific milestones for better progress tracking.  One metric I would recommend to add in is the ratio between positive and negative comments/feedbacks from audience. Number of comments is good metrics but sometimes misunderstanding if all of the comments are negative.", "q2r": 4, "assessor": "z_assessor_1693", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 4164, "q0": "The project highlights the scarcity of officially sanctioned Laotian material. As a result, Laotian speakers are unable to educate themselves in their native language. There are 30 million Laotian speakers on the planet. Because new members are joining the group on a regular basis, it will be difficult to reach them all. This problem may never be resolved. Although the project's solution is only available to a small number of people, it is a valuable solution that can help solve the problem in some ways.", "q0r": 4, "q1": "The project's creator possesses exceptional translation skills, which will be extremely beneficial to the project. This is a critical stage in increasing the chances of a project's success. The project also includes a detailed plan. Given the deadlines, I am confident that the job can be completed efficiently and on time. I appreciate how the effort gathers such detailed and accurate data.", "q1r": 4, "q2": "Projects can be tracked in a variety of ways. Because data such as the number of videos and video views are always public, I believe project participants may put their trust in the project's transparency and the project team's implementation strategy. Furthermore, the project establishes key performance indicators (KPIs) to track progress and increase transparency. I really like these KPIs because they have a lot of versatility. Participants will have reason to confidence in the team's ability to implement the project effect KPIs.", "q2r": 4, "assessor": "z_assessor_1710", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 4563, "q0": "Since people always love to learn all the new things in their native language, which will help them to have clear idea on the subject, this proposal will be effectively addresses such challenge. Since there are 30 mn native people speaking  Laotian, they are huge group of people to capture the market, where all these people will learn about the projects of block chain in more effective manner and definitely show interest in investing future cardano projects. hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "As translation model in YouTube videos definitely won’t be much difficulty, which has very less chances of getting failure with people like Muttiah Duraiswamy who has Over 30 years’ experience in Ministry of Languages as Official Languages translator, it will be an easy goal to achieve. With the details of all veterans provided, presented data is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "This proposal has clearly mentioned about survey of  Laotian speaking people and has provided the details of people who are working on this. This proposal has clear budget breaking, roadmap details and definitely provided excellent SDG goals for its success. It also has explained with what time duration videos will be provided for the audience with clearer idea hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 4635, "q0": "The proposer rightly addresses the need for translation of IOHK videos into a regional language. The videos in Native language can better convey the message to the needful and hence popularize Cardano and help new member induction. The impact of the proposal would be considerable in reaching the Laotians, with more than 30 million speakers in Laos, North-east Thailand and around the world.", "q0r": 4, "q1": "Rishantha Welikadage: MBA in business management from Australia===== Muthiah Duraisamy:LinkedIn profile mentions of \"Freelance Trilingual Translator at Home\".=====Dimitri Fernando-LinkedIn profile mentions \"CEO at Enigma Private Limited\" since 1996.===== Chamarie Ranasinghe-LinkedIn details not provided. The experience of the people involved should be enough to achieve all the goals of the proposal in terms of business management. The stated 30 years of experience of Muthiah Duraisamy in the field of translation should be enough to execute the tasks involved with respect to high quaity translations. Contingency fees could have been much lower for a 3month project also considering value of $2000 in terms of Srilankan/Indian Rupee.", "q1r": 4, "q2": "The deliverables are 360 minutes of translated videos in 3 months(15k words*3months or 120minures/month*3). A specific target number should have been mentioned for the metrics of followers/views/watching-hours/engagements considering $1500 being allocated for Social Media Campaign.", "q2r": 4, "assessor": "z_assessor_1748", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 5733, "q0": "Note to reviewers: When checking for similarity of wording, between all of these 19 \"Cardano in [language]\" proposals,  please consider.  Since this proposal is an almost exact copy paste of 18 other similar proposals by the same proposer, this assessment will be similar to the assessments I offered for the other translation proposals by this proposer. \n\nI have read and considered each of these proposals. The topic of this copy paste proposal by itself, could be beneficial to the Cardano community, if executed as promised. \"Provide translated videos in Laotian about Cardano ecosystem. Translate the entire content of IOHK. Also transcribed, subtitles offered.' \n\nTranslating very technical materials from the original English into other languages accurately and meaningful would be useful in making Cardano more accessible to non-english speaking potential and existing community members. \n\nBut the number and topics of the IOHK videos is too general to understand the scope, and how useful those videos would be. IOHK presents product updates mainly. They do not provide many, if any \"explainer or educational\" videos. Does this scope include Charles Hoskinson whiteboard videos? The proposals does not say. The list of videos should be specified to determine usefulness to new community members, and therefore enable assessors to determine impact. Thus he scope and methodology described is not clear enough to allow me to make a positive rating, good or bad.", "q0r": 3, "q1": "Note to reviewers: When checking for similarity of wording, between all of these 19 \"Cardano in [language]\" proposals,  please consider.  Since this proposal is an almost exact copy paste of 18 other similar proposals by the same proposer, this assessment will be similar to the assessments I offered for the other translation proposals by this proposer.  This proposal relies on the same human resources as do 18 other translation proposals, all to be completed within the same period of time. Though the proposal makes claims of significant resources and experience, no verifiable information or references are provided. \n\nFor example. The proposer describes this experience.\n\n1992-1995 Produced programmes at Sri Lanka Broadcasting Corp. Simultaneous translation\n+ 1995 to 2022 - 27 years of translations over 100 languages with native speakers.\nand...\nSerial Entrepreneur, INFJ, Marketer by profession, Creative by passion, Strategist, Writer, Poet, Storyteller Has background in multiple sectors and has run several companies with groundbreaking technologies in Sri Lanka\n\n+ 1992-1995 Voiced and Produced multiple programmes at Sri Lanka Broadcasting Corporation in numerous Services including Simultaneous translation on a Trilingual Stereo broadcast every day called City FM.\n\n+ 1995 to present - Over 27 years running a translation agency handling translations in over 100 languages with native speaking Master Translators all over the world.\n\nHowever, the linkedin profile that the proposer provides for reference says NOTHING about these lifetime experiences.\nDImitri Fernando\nhttps://www.linkedin.com/in/dimitrifernando777/?originalSubdomain=lk\n\nHave a look!\nIn another proposal requesting funding to provide food delivery services to the needy, the proposer offers a markedly different bio.\n\n\"I have been involved in social service projects for over 36 years, On planning committees and packing teams for  distributing dry rations during recent lockdowns. I also obtained a special pass to distribute of food rations from restaurants right through the curfew and lockdown\"\n\n'Serial Entrepreneur, INFJ, Marketer by profession, Creative by passion, Strategist, Writer, Poet, Storyteller Has background in multiple sectors and has run several companies with groundbreaking technologies in Sri Lanka. Having his first job as a department store Santa at age 12, he learnt how bringing joy to kids and the less fortunate would bring unspeakable joy to life. He worked at Sri Lanka Broadcasting Corporation on various radio channels under the English Service, and learnt the art of communication, presentation, audio and radio production, and program compilation. Working often in highly tense security situations due to the ever present threat of terror attack on the SLBC by the LTTE he learnt to be cool under immense pressure and not let any crisis affect him. He is a Chartered Management Accountant, and Chartered Marketer. He has also completed MBTI and FIRO-B certifications and is currently becoming an ICF accredited Coach and DISC certified trainer and consultant. He has experience in multiple sectors, including Business Development on a national scale for global brands. He has been involved in social service projects for 35 years. He has been distributing food to the hungry several times a week since July 2018. Even during lockdown he was able to get a special pass as he was engaging in essential food distribution services\".\n\nRemarkably different careers!\nVirtually impossible.\n\nTwo types of deliverables are described. Voice overs and transcriptions. \n\n\"We will translate full videos with its original duration. We will also provide a transcription of the video in the local language.'\n\nBut it is not clear if the transcriptions are of the translated voice, or of the original english language audio.\n\nThere is no mention of the cost or selection process for the voice over talent in Myanmar language.\n\nThen there is the question of the Master Translator responsible for translations in Fund 8 proposals in 19 languages, during the same 6 month period. A look at his linked in profile gives no information to confirm the bio presented in each of the 19 translation proposals\n\nMuttiah Duraiswamy https://lk.linkedin.com/in/muthiah-duraisamy-22498ab8\n\nMuthiah Duraiswamy has over 30 years of experience handling translations in the Ministry of Languages. He is an Official Languages translator having obtained his certification. \n", "q1r": 1, "q2": "Note to reviewers: When checking for similarity of wording, between all of these 19 \"Cardano in [language]\" proposals,  please consider.  Since this proposal is an almost exact copy paste of 18 other similar proposals by the same proposer, this assessment will be similar to the assessments I offered for the other translation proposals by this proposer.  \n\nGiven all of the uncertainties about the scope of work promised  (which IOHK videos) in this proposal, the lack of methodology, the questions about team experience and capabilities, the number of videos to be produced in 3 months, and the competing demands on the time of this proposer and master translator to complete 18 other similar projects in the same time frame, it is not possible for me to form a supportable opinion (agreeing or disagreeing) that either the progress or success of this (or any of the other 18 video translation proposals introduced by this proposer) would be auditable.\n\nThe metrics to audit success as provided will not measure during the proposal execution period. And will only be apparent long after the proposal has been completed.\n\n\"The metrics are\n\nNumber of followers to the LanCardano Youtube Channel\nNumber of average views per video\nNumber of watching hours\nNumber of comments\nNumber of shares\nNumber of downloads\n", "q2r": 3, "assessor": "z_assessor_251", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "THis guy is not reasonable.  \nHe is finding fault that i have two different bios in two different proposals.. \nWhy would I talk about my translation capabilities and professional achievements or team in my social service project?\n\nWhy would I talk about my food distribution effort and what made me be in social service projects from the age of pre teenager, in my translation projects?  \n\nIn each project I talk about the part of my life that is relevant. Are my life activities only translation and food distribution?  Of course not.  Theres a lot of other things I do.  Is he going to tell me that i cannot be doing those things?\n\nI cant help if he has a boring and monotonous life which he does only one thing day in and day out and cannot conceive of a person who has different aspects of life which are all interesting and exciting.  At this point of time has he watched all IOHK videos and concluded that they are all inappopriate for beginners?  Is he so smart to presume that IOHK and CHarles Hoskinson is a fool?  \n \nHe also writes\n Then there is the question of the Master Translator responsible for translations in Fund 8 proposals in 19 languages, during the same 6 month period. A look at his linked in profile gives no information to confirm the bio presented in each of the 19 translation proposals Muttiah Duraiswamy https://lk.linkedin.com/in/muthiah-duraisamy-22498ab8 Muthiah Duraiswamy has over 30 years of experience handling translations in the Ministry of Languages. He is an Official Languages translator having obtained his certification.\n\nAgain he shows his incompetence.  is he presuming that Muthah D is handling all 19 languages?  We have said over and over again that we are having external MASTER TRANSLATORS WHO ARE NATIVE SPEAKERS IN THEIR LANGUAGE.  This guy should be banned from ever doing CA work again because it wastes proposers valuable time to type out rationale for not only filtering it out but  for wasting people's valuable time. of Proposers and VCAs.\n\nVCAs if its not already clear to you for heavens sake filter this guy out."}, {"id": 6671, "q0": "Please note this assessment should be taken in context of a set of 19 similar proposals by the same proposer in two challenges, Grow India, Grow Cardano and Grow The only real difference between the proposals being the spoken language used (Thai, Burmese, etc.). In all other respects they are essential the same. Hence it is almost impossible to write 19 distinct assessments, I have tried to find specific differentiators but have also looked at the package of proposals as a whole as, I believe, this will add greater value to the voter. Looking at this specific proposal for translating videos into Laotian, it largely meets the challenge brief in seeking to broaden the horizons of the Cardano ecosystem. The proposer should be praised for taking the initiative. I would suggest the proposer uses the comments section to explain voters their rationale behind this multi-proposal approach. That should help with transparency and help people make an informed decision. For example: Are they looking for voters to decide on which languages they prefer thus restricting the choice to the existing community. This kind of defeats the purpose of reaching out to new communities. If this is the case I have done a rudimentary research on number of people speaking each language to help the voters make an informed decision. Given more time, an in depth analysis of demographics would be useful showing current literacy levels, access to technology, levels of education, English speakers, etc in East Asia. Burmese ranks 3rd so maybe not the highest priority? 1. Thai:50M 2. Burmese:36M 3. Laotian:30M 4. Khmer(Cambodian):15M Where the voter needs to pay particular attention is the entirety of the ask. The proposal therefore under assessment are: Grow East Asia, Grow Cardano – 4 proposals https://cardano.ideascale.com/c/idea/404470 https://cardano.ideascale.com/c/idea/403932 https://cardano.ideascale.com/c/idea/398994 https://cardano.ideascale.com/c/idea/398993 ", "q0r": 3, "q1": "The contents of feasibility are duplicated across all 19 proposals.\nIn simple terms we are looking at a total ask of $135,900 of which $38,000 (28%) is contingency. At a proposal level that is $7100 budget with $2000 contingency. \nMy project planning head immediately points to the 28% contingency. It is not clear what this is set aside for. A risk of ADA price fluctuation is noted in the proposals, however one of the proposed mitigations for that is a 10% contingency, the other being to sell funds privately to ADA holders.\nIn addition the proposals states “We have ample resources to complete the project on time and within budget’, once again raising the question on the need for such a large contingency in proportion to the budget?\n\n  \nNow looking at what is to be delivered.\nEach proposal states the YouTube channel will be launched with 6 videos. We have to assume that means 6 videos translated in all 19 languages should they all be funded. \nAfter 3 months 10-20 videos (each translated in 19 languages)\nThat gives us 380 translations in total at an average of 4 per day. I have run this by someone with experience in this area and their reaction was ‘its going to need a considerable team’. \n\nSo, let’s look at the evidence of a team with the skills to deliver this proposal.\nThe proposer claims to have many years experience in this field but this is impossible to verify based on the evidence (LinkedIn profile) provided.\nThe other key resource (Muthiah) presents as a trilingual translator. Specific languages are not mentioned so very difficult to validate of if they have the skills for this specific proposal\nTwo other individuals are listed, their LinkedIn in profile are well populated but don’t display the skills required to deliver this project.\nThat leave us with the “extensive network of Master translators”. Again no evidence of their existence of previous work exists so impossible to evaluate.\n\n\nI believe the proposer has a lot to offer the ecosystem and can suggest the following:\n•\tHelp the voter understand the need for 19 similar proposals\n•\tProvide evidence that they have access to the skills required\n•\tLook at a small scope with a set of languages he or Muthiah are comfortable with. Use this as a POC on both the translation and engagement side. SHOW the community this proposal is growing adoption.\n•\tTake the learnings (e.g. which types of video are interesting your audience) and if a larger (multi language) proposal is what is required submit it in a future fund leveraging in the economies of scale that will naturally provide on the maintenance of socials, contingency & marketing.\n", "q1r": 2, "q2": "The metrics are sensible in terms of measuring engagement on youtube which is a great basic piece to measure.\nHowever to really get to the crux of the challenge we need to see the conversion rates into Cardano and/or Catalyst\n•\tincreased interaction between Catalyst and Indian focused projects\n•\tNumber of Indian focused Catalyst submissions\n•\tNumber of Indian focused dapps/services actually built\n", "q2r": 2, "assessor": "z_assessor_45", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "\nThis has to be filtered out.  So many reasons..\nCombining into one proposal may make sense to this proposer who may not be from Asia and recognize the huge diversity from state to state or region to region. All languages cannot be done by same people or same social media campaign.  This is why we broke up. Smaller proposals enable people to clearly see we are not here to grab money.   Each language needs its unique Social media campaign to reach people.  We cannot lump everything into one.   \n\nSecondly Why consider the total ask?  The rules state that each proposal has to be considered on its own merit.  Therefore even if  i had a hundred language proposals, if i had a hundred teams of two Master Translators and Two Proofreaders, then it will get the job done. We are doing this for 25 years buddy.   We know exactly how to run a translation project.\n\n\n\nHe goes on\nThe proposer claims to have many years experience in this field but this is impossible to verify based on the evidence (LinkedIn profile) provided. The other key resource (Muthiah) presents as a trilingual translator.\nI have stated as below, we have and use our extensive network of Master Translator Partners.\n\nThe assessor has not read the proposal. It states clearly as follows\nThe number of people required to complete this task has been calculated.  \nWe will be using our inhouse resources as well as obtain our Master Translator Partner network to handle overflow of work to ensure that our deliverables remain on track. They would be brought on board as and when needed and budget would include their costs\n\nI can see clearly that this assessor is merely following the wrong ideas of some CAs to say that the feasibility is not good because they believe I alone  is doing Or Mr Muthiah D is doing,  the translations or this internal team is doing the translation of all the 10 languages.  This is completely WRONG.  As mentioned above we are using our External partners who are Master Translators with many years of experience and qualifications in translating as Native speakers of Tamil both in Sri Lanka and India. So his feasibility assessment is wrong. \n\nHow the budget was calculated has been clearly laid out as follows.. if he claims he has read the other proposals he will know that we are doing 15000 words per project. Each word costs 0.08 for complete translation to voicing. This cost comes to 1200 and into 3 months it is 3600.  Then this language needs its own Social media campaign since the users of one language would not care about social media campaigns in another language. So all languages cannot be lumped together to do one campaign.  The cost of that being 1500..  Then for contingency we have allocated 2000.    \nSome specific statements that are absolute nonsense=\nHowever, because the primary responsibility of this position is to translate text from English to Tamil, the proposer should include more specific information on their translators' expertise in their Master Translator Partner Network.   As stated we have been doing projects for over 25 years. The definition of Master translator if this assessor doesn't understand is a MASTER OF HIS CRAFT.  A SENIOR IN THE INDUSTRY.   Each one will have different qualifications.  As for our specific master translator, he is the ONLY ONE IN SRI LANKA to write for the Mahawamsa which is like the BIBLE OF HISTORY of SRI LANKA for over 4000 years. It has been written from the time of kings.  This is a role that he alone in Sri Lanka has. So this assessor is talking nonsense\nPlease filter him out.\n \n"}, {"id": 6840, "q0": "Impact and alignement to the challenge for this proposal:\n- translate existing content in a new language (Laotian)\n- the Cardano information breaking into a new market of almost 30 millions people (potential adopters)\n- board new members (Laotians speakkers ) onto the Cardano ecosystem\n- translate the entire IOHK content in Laotian. These elements show how this proposal is aligned with the challenge. the impact is first local thoru out the entire country, but also globally as whoever speaks Laotian would have accedd to info about Cardano in that language.", "q0r": 5, "q1": "A team of proposers formed by experts in translation 9Over 30 years of experience) and also people involved in the Catalyst ecosystem for long time. This could contribute to the success fo this proposal.\nthe plan of Youtube channel production is set with a time frame and detail about the financial resources needed, that are reasonable.\nWhat I would love to see is more information about the reality of local Laotians on how easy or difficult it may be for them to havve access to these great online resources around cardano (Access to Ineternet, to computer or cyber cafe). this would help assessors to suggest other means of offering the final results of this project to the Laoso local community.", "q1r": 4, "q2": "The proposers plan on sharing the progress update with the community through the Cardano telegram & Discord.\nA plan to mitigate the risks is in place. 3 months with 360 minutes videos produced in three months the duration of the project. This is one of the indicators of the quantitative output.\nNumber of viewers on Youtube, number of subscribers, number of likes...have been mentioned as other indicators.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1, "reply": "\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!"}, {"id": 8007, "q0": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project, there will be similar sentences\"). This proposal is intended to help Laotians understand Cardano, but the difficulty here is that Laotians cannot learn their language, so the author has provided a video translated in Laotian to help the people here. understand Cardano and the ecosystem it runs on. The purpose of this proposal is to overcome the ignorance of the people here to create a trusted platform for the 39 million Laotian people to deeply understand the ecosystem as well as Blockchain technology and cryptocurrencies. The idea is great. This proposal effectively addresses the challenge... The author has proposed a well-defined problem-solving approach that aims to provide a long-term solution, a defined path. . clearly define problem solving. . . The author has scaled with future challenges and the Laotian community on the Cardano ecosystem, blockchain basics help everyone here build better applications. build a community of players in Laotian. They also outline possible risks, also some risk solutions highlighting the challenge by looking at it from a legal perspective. This shows that the author is very cautious with the progress of their project.", "q0r": 5, "q1": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project there will be similar sentences\"). It is proposed to specify a clear period for activities to be divided into 3 months. The author has a team fluent in all languages ​​with more than 20 years in the industry. I believe the project's roadmap will be on schedule as the author promised. The budget is 7.100 USD, detailed and listed by the author for each category. With the amount listed for each month, I find the budget sufficient to check the progress of the proposal. Suggest an easy way to measure success through the metrics the author has listed. . . It is surprising with the number of years of experience that the group has given, the 4-member group has more than 20 years of experience. I do not doubt the experience of the propagandists, they are all elite members, members that we can follow through social networking sites. With a solid team of experts with good leadership, based on the information provided I think this project will be successful.\n", "q1r": 4, "q2": "(\"The author writes the proposal in different countries, but the content will mostly be the same, so when I analyze the project there will be similar sentences\"). The measurement indicators are detailed by the author in 3 months of implementation, each month will produce 120 minutes of video. Well-defined KPIs determine the success of the proposal through the number of views, several followers, shares... The author gives great ideas it tackles effectively the challenge, if it is funded I believe the project will be very successful it will have a good impact on making more people aware of Cardano. However, the success of this project is tied to the success of other projects so I think the risk will be multiplied. . . This project is completely new and is waiting for funding.\n", "q2r": 4, "assessor": "z_assessor_649", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "\n\n\nThanks for your fair review. if we make it you too are part of what made us succeed. So thank you once again!\n\n"}, {"id": 8218, "q0": "\nThis proposition clearly points the problem of lack of Cardano content in Lao language and the team offers a solution to this problem by translating all IOHK content from English to Lao. The team believes that translating the content will bring Cardano closer to Lao-speaking people, who number 30 million worldwide. The team points out when they would translate video content that would bring new people to Cardano and thus add value to the Cardano ecosystem. The KPIs presented by the team are in line with the KPIs of this challenge and proposal is able to scale to address future challenges.\n", "q0r": 4, "q1": "Links via LinkedIn and Facebook represent the team and we can see the necessary experience and knowledge for the realization of this project. The team represents a budget that is reasonable and the budget is break down to items. I would like the team to develop a detailed and feasible plan from which the community could get more detailed information on how they would translate video content with which tools in a given period of 3 months. It is good that the team has an elaborate idea of possible risks and challenges.", "q1r": 4, "q2": "The team claims that they will translate 10-20 videos in 3 months and will upload these videos to the YouTube channel they are about to make. The roadmap and milestones along with the KPIs in this proposal are clearly presented so that the community can easily follow the development and progress of this project.", "q2r": 4, "assessor": "z_assessor_656", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "thanks for your fair review"}, {"id": 8754, "q0": "This proposer submitted over 20 proposals in the Grow East Asia and Grow India Challenge categories. This is done using the same copy/paste template, with only very few details changed. Apart from the name of the language, in this case Laotian, the total number of native speakers plucked from the internet (Wikipedia?) was changed but otherwise the projects are pretty much identical. Sadly, no specific regard for the culture or people of Laos are provided. I have Laotian friends who speak very good English, and in Laos the Thai language is widely understood and very similar, and Thai TV is watched. There is a lot of Thai Cardano content that Laotian speakers who do not like to learn in English (for which I see a low number of potential Cardano users) could research or simply watch on daily updated Youtube channels. Whether speakers of Laotian actually want Laotian-language content, prefer videos or text was not studied by the proposers, and the same cost is applied to each proposal for each language (around 7k dollars). \nAll the proposals of this format offer\nto translate the entire IOHK website content, which should probably include product documentation and IOG Blog, plus transcripts of all (?) videos published on the Cardano Forum.\nThis completely falls short of the challenge setting, which is to improve Cardano, more interaction of Laotian proposers or proposals looking at Laos, stake pools in Laos, or improving the lives of people in Laos. The proposers offer one universal solution, meaning simply translating content into many, many languages and hoping that someone will care, without user feedback or even research into the locale. ", "q0r": 1, "q1": "The elephant in the room is the sheer number of proposals submitted by this proposer across Grow East Asia and Grow India challenges. Although the proposer and team-mate have experience in translation, we simply do not know whether they know or care about Laos, have worked with Laotian language before, or have done their research into the need for Laotian people to know about IOHK's content in their native language. We do get a certain amount of roadmap and budget breakdown, but no mention is made how funding for several or even all of these proposals would affect the timeline. It is also noteworthy that translation uses only about half of the budget and \"contingency\" and \"social media campaign\" consume the other half - a lot of money for one \"LanCardano\" project if all 20+ proposals should get funded.", "q1r": 2, "q2": "The copy/paste of template content into a lot (20+) language translation proposals by the same team has resulted in the KPI section containing no data / figures. The performance metrics are given but remain empty, and we simply do not know how many views, likes or shares are targeted to justify the implementation of the proposal. It will therefore be impossible to assess successful delivery of the proposal except the process of translation, which does not have to be carried out according to any quality standard or user satisfaction. I disagree strongly that the information provided could be used to audit the progress or whether the project has been a success. I judge it as very difficult to audit this proposal. The goal of converting the IOHK website and some Cardano forum content into Laotian without any research prior and no criteria for quality or viewership is not what a comprehensive auditability assessment (or business plan for that matter) should look like.", "q2r": 1, "assessor": "z_assessor_696", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "\nThe assessor has not read the proposal. It states clearly. \nThe number of people required to complete this task has been calculated.  \nWe will be using our inhouse resources as well as obtain our Master Translator Partner network to handle overflow of work to ensure that our deliverables remain on track. They would be brought on board as and when needed and budget would include their costs\n\nI can see clearly that this assessor is merely following the wrong ideas of some CAs to say that the feasibility is not good because they believe I alone  is doing the translations or this internal team is doing the translation of all the 10 languages.\n\nThere is no meaning to this sentence as well as many others he has written. \"The only thing that perplexes me is the level of the budget per word: $0.08, the team must provide the market standard of that amount, as well as a contingency cost of $2000 to be covered, and it must be expressly specified.  \"  What is this market standard we must provide?  That doesnt make sense as well as his entire premise doesnt make sense.  We dont cover a contingency cost, the contingency cost is there to cover in case of unexpected emergencies and problems.  \n\nAgain he shows his bias and attitude of nonsense when he talks the following\nOne thing to note is the amount of work you have to do in the first 1 month with 120 min videos and then the translation commitments for other Asian and Indian languages, besides Khmer, there are more than 15 languages ​​\n\nHe has not read the proposal and is biased. I have said this over and over.  We have times. Do you not understand that? Are you hard of hearing?  \n\nVCAs please filter this out. This assessor is clearly biased.\n\n"}], "solution": "Provide translated videos in Laotian about Cardano ecosystem. Translate the entire content of IOHK . Also transcribed, subtitles offered.", "experience": "1992-1995 Produced programmes at Sri Lanka Broadcasting Corp. Simultaneous translation\n\n+ 1995 to 2022 - 27 years of translations over 100 languages with native speakers.\n\nMuttiah Duraiswamy\n\nOver 30 years experience in Ministry of Languages as Official Languages translator."}