{"id": 398931, "author": "konmaorg", "title": "Cardano Malaysia Community", "url": "https://cardano.ideascale.com/a/dtd/398931-48088", "category": 26444, "amount": 27700, "description": "Malaysia doesn’t have a community that actively engages in Blockchain and Cardano. ", "f6_no_assessments": 5, "f6_rating": 3.5333333333333337, "videos": [], "media": [], "f6_assessments": [{"id": 1466, "q0": "The proposal identifies Malaysia, a Southeast Asian country, as having a multi-racial, multi-lingua community that can benefit from being more educated in Blockchain, notably the Cardano ecosystem. From there, it seeks to address challenges that should be overcome to drive more participation into the space (Cardano & Catalyst). The first challenge is people's reluctance to learn more about cryptocurrency and blockchain due to its inherent complexity. The second challenge is having to deliver what’s already a complicated topic in various languages. The third challenge is to assess the audience with varying levels of knowledge, interests and motifs. From my observation as a Malaysian, these challenges are all valid to me as news coverage, workshops and financial talks in Malaysia tend to shy away from any cryptocurrency-related topics due to its target audience who are less receptive to technology (middle-aged groups). Besides, cryptocurrency only became a recent household topic among most Malaysian youth in their 20s-30s due to price actions, exorbitant NFT sales. They merely view cryptocurrency as another means of trading, with minimal intention to actively participate in the space. \nIn light of these challenges pose by the Malaysian community, the proposal’s solution is  to create an exclusive tribe (group) called “Cardano Malaysia” through a decentralised, community-led platform called Konmahood. Under Konmahoood, pressing topics often discussed in the blockchain space such as lifestyle, art, earth and community are covered under Wings of Konma. This is bound to attract many people. \nI find CM to be an effective, well-thought out solution that can introduce more Malaysians to the Cardano ecosystem, which ultimately leads to Catalyst. Firstly,   CM has a dedicated team of moderators and content creators for exposing newcomers to Cardano, whilst remaining engaged with community members. Additionally, the team will curate content, training and activities of varying depths in multiple Malaysian languages to cater for Malaysians. Ultimately, this would reduce the community’s learning curves. Shall this come to fruition, I believe it will contribute immensely to Cardano and Catalyst. This is because most Malaysians are well-versed in several languages. Once CM becomes more established, it could extend its reach to several East Asian countries such as China, Hong Kong, Taiwan, Indonesia, Brunei, Singapore, India and more. Secondly, CM bears resemblance to Cardano’s and Catalyst’s ecosystem through its voting mechanism which is proven to possess high community integrity. voting mechanism to educate participants Given its decentralised nature with multitude of topics, it is expected of Cardano Malaysia (CM) to bore resemblance to Catalyst’s mechanisms. Notably, CM under Konmahood will have a voting system that is proven to have strong community integrity, leaving less room for potential exploitation. Thirdly, the community is founded on the spirit of comradeship (which is a form of empowerment). For instance, it provides participants a conducive, collaborative environment, coupled by proper guidance to share, discuss and refine their ideas for Catalyst proposals. To conclude, CM has provided a holistic solution to first introduce newcomers to learn more about Cardano, which then translates to encouraging participants to be involved in the Cardano ecosystem through collaborations and involvement in the Catalyst space.   \n", "q0r": 4, "q1": "Generally, I believe the team consists of members highly competent in the realms of education, entrepreneurship, community management and blockchain. Other than the team’s expertise and experiences, the proposal does not showcase any members knowledgeable in the Cardano space, nor does it demonstrate how these members can contribute to the project, Cardano and Catalyst. Without having this properly planned and delegated, this could be detrimental to the proposal’s goal of introducing Cardano to the masses. I would like to propose the team to clarify further in terms of the relationship between the team members and they seek to contribute to Cardano and Catalyst. \nI am satisfied with the proposal’s budget breakdown as it has covered multiple aspects important to the success of CM. The budget consists of  educational content curation, server maintenance fees, rewards for participants and manpower to maintain CM’s activities. What’s lacking is an explanation of what their allocated budget is for. To illustrate my point, the proposal allocates a total of $3600 to clubhouse & special event moderators. Question is, what are the tasks delegated to  clubhouse & special event moderators?  Assigning roles and task delegation must come hand-in-hand for more clarity. Besides, qualifications of recruited trainers are not provided under the proposal. Reflecting to the timeline provided, if qualifications of recruited trainers are not provided to Catalyst board, there is no way to ascertain whether one week is enough to ensure Train the Trainers (TTT) will produce trainers well-equipped enough to conduct workshops and moderate activities. \nThat aside, the timeline is well-defined. Milestones is certainly not an over-promised and pivots to Catalyst.  The deliverables on its own is not a complicated one as it does not evolve around technical complexities of the blockchain and Cardano. I am confident the listed deliverables are good indicators that allow others to gauge the effectiveness of CM when it comes to fruition.\n", "q1r": 3, "q2": "Due to the nature of CM for being mostly a community site/forum to engage with participants, auditability is fairly easy to achieve. The given KPIs can be easily provided by the team, and performance can be gauged by public through observations. Growing member count, growth report, community feedback and participants’ conversion to be a part of Catalyst are great indicators of the project’s success. Problems/challenges the proposal seeks to address are also well-defined, namely reaching Malaysian crowd through easily digestible, beginner-friendly and engaging content. \n", "q2r": 4, "assessor": "z_assessor_1373", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3077, "q0": "In Malaysia, there is an active community involved with blockchain and Cardano. It is good to include people of all various cultural differences in this community. The forum addresses approximately a population of 32 million inhabitants. This can certainly be an added value for the cardano ecosystem. A complete system has already been developed in which the forum will be built. The tribal system is a unique system that can ensure that a sustainable community is created and in which they can help each other. A clear upscaling has been made to challenges that may be encountered in the future. It is good that a few solutions have already been invented on how to avoid them.", "q0r": 5, "q1": "The team is clearly defined in the proposal. The advantage of these people is that most people can speak the language from Malaysia. The team has people with relevant experience to manage the project. A clear timetable has been included stating what this project wants to achieve. At the moment it only states what they want to achieve in the short term. It would be helpful to record the long-term goal as well. A budget has been drawn up that clearly states what the costs are to complete the project. It will certainly be possible to get about 150 – 200 new members in the community. I think they should aim a little higher. It is good to put part of the budget in rewards. This will attract people more quickly to work with. It would also be useful to include specific locations where the workshop will take place in the proposal. The technical aspects are not reflected in the proposal. The proposer takes into account the risks and challenges being considered. The most important thing will be to run a good campaign in which people are convinced to participate in this community.", "q1r": 3, "q2": "A clear roadmap has been drawn up with the milestones that the team wants to achieve. Several KPIs are included in the proposal to see if this project is a success. It is clear that a community needs to be started in Malaysia that will make the Cardano ecosystem known. This project offers a clear solution and tackles the problem directly. It will not be easy to start a motivated community because Cardano is almost unknown there. This project has a long-term future. It will take longer than a few months to build an extensive community.", "q2r": 5, "assessor": "z_assessor_1606", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8944, "q0": "The idea is interesting, about to create Cardano community in Malaysia with an existing community forum named Konmahood. The proposal definitely fits into the challenge as well as adds value to Cardano ecosystem, because the community would allow people in Malaysia have a place to learn about Cardano, to connect, share and support each other in Cardano engagement. If it is successful, the proposal will help to increase number of new members onboarding, number of active members (CAs, vCAs, voters, developers,ect) and number of proposals from Malaysia community.\nI found one of the authors propose this existing forum (Konmahood – the same link) to create another community hub in India in the proposal “Cardano India Tribe – Konmahood” with link following:\nhttps://cardano.ideascale.com/c/idea/398927 \nand the link of this proposal here:\nhttps://cardano.ideascale.com/c/idea/398931 \nI would like to ask: if these two proposals will get funded, is it possible to create 2 community hubs in India and in Malaysia on the same forum? (link the forum included https://linktr.ee/konma )\nThis is just my bonus question, I still agree this proposal is impactful.", "q0r": 5, "q1": "The proposers explain about the plan in details in a timeline 3 months with budget breakdown and information of the proposer for us to assess the feasibility of the project: Regarding to the plan, we can see what needs to be done in each of months in a period 3 months. The financial amount is broken down in details and explained very reasonable, which allows us to understand what needs to be spend money on, and how much it costs. The cost of multi-lingual resource development is for 7 languages, even though the authors do not tell which languages will be available in the plan, but we can understand those will be English, Malayalam, Mandarin, Tamil, Telugu, Hindi, Marathi due to the information of team members. Regarding to the team’s information, we can see their names, their professional majors, number of experienced years, and their social links where we can know more about them, I believe the project is in the good hands with fulfilling experience and skills relevant to conducting the project. However, I think it would be more benificial if the proposers could provide more information about the contents of “Train the Trainers” program. This is just my bonus for the proposal greater. I still strong agree the proposal is feasible.", "q1r": 5, "q2": "The proposers provide roadmap, milestones and KPIs understandable clearly as well as the section section “What does success for this project look like?”, that allows us to see what need to be measure, which goals the project aims to, and to have a vision of the project as a whole. Besides, all the results will be reported in the existing forum (the link has been  already included), the proposal is definitely auditable.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10171, "q0": "This idea helps to create an active Cardano community in Malaysia, connecting and enhancing the link between ADA holders and Cardano interested in Malaysia.\nThe community is built on the existing Konmahood platform. The special feature of the Cadarno Malaysia community mentioned in the proposal is the voting system, content streamlining, peer-to-peer communication, event hosting, the course offers... Cardano community is simply to post and share content about Cardano as usual. I am very impressed with the thought of connecting members in the community more by creating many playgrounds, events, exchange tools, periodic meetings, courses, and clubs to exchange among members. . Community members will find personal interest in community activities, which motivates members to be more active.\nI appreciate this project's ability to contribute to building the Cardano community in Malaysia.", "q0r": 5, "q1": "Regarding the implementation plan, the project stated that the preparation period for project implementation is 1 month (April 2022), and the official implementation time is 3 months. In which, the preparation phase has a specific schedule and work items to be performed, the official implementation phase of 3 months does not specify details of the work items to be performed, the specific schedule.\nRegarding the budget, detail the items and their respective costs. The budget is presented in a clear, easy-to-understand manner. Marketing expenses should be more detailed.\nRegarding project team members, experience is stated very specifically. The main experience of the members is mainly in business operation, training, and community building. However, there are a few experiences mentioned that are not suitable for the implementation of the project, for example, experience in aquaculture, clinical nutrition experience, mechanical expertise, aluminum alloy production...", "q1r": 3, "q2": "The project is a forum, community. Ways to measure metrics and track progress based on dashboard parameters. Weekly reports, community growth, feedback from members in the form of polls, number of members converted to the proposer, CA, Voters Catalyst will be reported to Cardano by the proponent, Catalyst.\nIf the proposer can point out specific indicators and KPIs to monitor and evaluate actual results against the target KPIs, Catalyst and the community will easily track the development and progress of the project.", "q2r": 3, "assessor": "z_assessor_823", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 10645, "q0": "the proposal aim is good which is to bring an active community around Malaysian members, however it will be more straight forward if the community itself is from malaysia or singapore. from my perspective, they can join cardano telegram or dischord and that way it feels more genuine. as we wanted to attract more new members into the blockchain. ", "q0r": 1, "q1": "to regroup all the active malaysian members, why do they need host and classes from other country. to attract more new members, i believe all we need is advertising such as from malaysian youtubers that share  crypto content. ", "q1r": 1, "q2": "In malaysia, main language is malay, followed by cantonese and tamil. and all malaysian understand malay because that is a mandotory subjects in school. same goes to english. so Multilanguage is not an issue. ", "q2r": 1, "assessor": "z_assessor_957", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "The idea is to create an active community for Cardano in Malaysia that will involve in different ways in the Cardano ecosystem.", "experience": "We have an existing community platform that has been beta tested with a member count of 80+ from various parts of the world. We have community managers, Train The Trainers and PR specialists in the team."}