{"id": 400496, "author": "defidiscussions", "title": "Networking/promotional events Japan", "url": "https://cardano.ideascale.com/a/dtd/400496-48088", "category": 26444, "amount": 15000, "description": "Cardano has only had approval to be listed in Japan for 7 months. We need more excitement generated for ADA now more than ever in the region", "f6_no_assessments": 10, "f6_rating": 2.9, "videos": [], "media": [], "f6_assessments": [{"id": 7406, "q0": "I think the idea is very good and necessary, and theoretically fits well with the objectives of this challenge. What we are looking for here is the benefit of East Asia, that is, a direct investment in this part of the continent, so that it can prosper economically, environmentally and humanitarianly. At the same time, of course, we need our blockchain to also take advantage of the situation, that it be popularized, that the number of Ada holders increase, that new digital wallets are created, CNFTs minted, Dapps built and so on. The proposal in question aims to promote some face-to-face meetings in Japan, which promote Cardano, giving lectures on our blockchain and its technologies, so that investors, technology students and blockchain enthusiasts (as the proponent himself lists) are captivated to adopt. Ada/Cardano on the Bitpoint market. The proponent explains that Cardano is now officially available for the Japanese market, but this does not exclude the presence of competitors, other more famous and widespread blockchains both in that country and around the world (such as bitcoin and ethereum, for example). In fact, the promotion of such events can generate more knowledge about Cardano, so that people discover the advantages of our blockchain compared to others, and are motivated to adopt it. The idea can cause a boom for our ecosystem in Japan, as we wanted in the challenge, and with that also directly benefit the Japanese, who can discover job opportunities (both as CAs and vCAs, or as developers/designers/advertisers/etc in the Catalyst funded projects), for example. The problem that I identify here is that everything is very good in the theoretical field, but in practice, little is explained about these face-to-face meetings. The proponent claims that most things, like their location, speakers, translators, etc., would be defined post-funding. As a result, we were unable to understand how these events would be constituted in practice, and especially what specific issues would be addressed here; this, in my opinion, is the scope of the project and we would really need to have this notion so that we could trust and fully understand the practical part of the thing. Therefore, I will give it 3 stars, because I think the idea is promising, but the impact is not well assured (it is not possible to understand and trust it) due to the lack of explanations and details. \n", "q0r": 3, "q1": "Unfortunately, a serious error occurs here. The proponent states that a plan will be made if they are financed. But for the funding to become a reality, we need to know several things about the project, including the planning, the roadmap. One thing must not come after the other, but before. All the things that the proponent claims are defined should already be present and well explained, namely: best locations for events, list of speakers, team of translators, etc. Therefore, I will suggest what an ideal schedule would look like in my view. First of all, we would need to know how many events would happen. How often too, for example a total of 5 events, 1 each month. Then we would need to know their exact location, as it is said, the list of speakers and translators. We would need to understand what would happen on each day of the event: the moment of the talk itself, then an open chat session, perhaps? Would some community members who already have funded and ongoing projects participate to report their experiences? Would there be a coffee break, where the focus would be networking? What exactly would happen in those moments of the encounter? What topics would be covered in each lecture? How would the aforementioned target audience (investors, students, blockchain enthusiasts) be contacted and enticed to participate here? Anyway, in addition to all the characteristics of the event itself, I would like to know how the pre-production process would take place, which activities would have to be provided before the meetings, and by whom. Ideally, the total time should be divided into months, and those into weeks, and that the activities of each week should be listed. And for the script to be 100% it would also be interesting to know when things would happen, for example, in June, the first event in city X. Now talking about the budget, a total of 15k USD is requested, which is a high value taking into account account that we do not even know how many events would be made. The explanation of the budget division should have been more detailed, for example, how do they ask for 1500 dollars for rent if they don't even have the locations defined yet? What if there is no money or money left for that part? What salary for translators, how many hours would they work? And finally, about the team, we are told the names and main functions of each involved. However, we would need more details here as well. I would like to know a small CV of each, examples of previous work, linkedin profiles of everyone (only those of some people are available), and that the relationship of each one of them with Cardano be explained more deeply (we know this information about some , but not all). Therefore, the viability of the project is not good, it has a lot to improve, mainly in the script part. \n", "q1r": 2, "q2": "This topic is also not good, the auditability is low. Regarding the roadmap, for example, we have little information that would serve as ways to measure progress. We know that the number of participants, digital wallets and interactions on social media are indicative of how big the reach of these meetings is. However, it is necessary that we know much more profound and varied information about the development of the project than just numbers. Starting with the improvement of the script. Without a detailed schedule, the Cardano community would not have the means to properly audit the project process, as we would not know what has to be done, when and by whom. We don't have small goals to continually achieve, nor deadlines to meet. Therefore, it is essential that this be resolved. Afterwards, the team must maintain direct and constant contact with the Cardano community. Some members of our community could be chosen, preferably Japanese, who could maintain closer contact with this team in order to receive feedback at least monthly. These feedbacks would serve to inform us not only about how many people attended the event that month or how many people are registered on the project's social networks, but also to understand the construction of everything done during the pre-production process. Regarding the final result, we know that the main objective is to strongly drive the adoption of Cardano in Japan, especially since our blockchain is officially available in this market now. But how can we understand this impact? The simplest way, in my opinion, is to do a direct survey with the participants of the events. Are investors investing in Ada? Did they buy a lot, delegate to any community pools? Are young students now captivated by learning about our technologies, such as the Plutus programming language, and do they intend to work on our projects in the future? How did the enthusiasts behave after the events? All this would need to be raised, summarized and taken to the community, whether through written forms, sharing of personal questionnaires (of course, with the proper authorization of each person involved there), video calls and etc. Therefore, as well as feasibility, I believe that this topic of the proposal needs to be reviewed and improved. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 10, "ne": 7, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 390, "q0": "We realize that the proposal has an objective to promote lectures in Japan that aim to disseminate the ADA. Thus, the proposal fits the scope of the challenge in question. However, we noticed a certain lack of detail on how these lectures will take place, which raises a little doubt about the possibility of the project having a positive impact for Cardano in the long term. Along with this, we see that a considerable amount of capital is being requested, and since we have little information about how the project will go, $15,000 seems to be a very unreasonable amount.", "q0r": 2, "q1": "Although we have a team of professionals who seem to have the technical skills to execute the project, since the main objective is to disseminate about the Cardano ecosystem through lectures, perhaps it would be interesting if more information had been given on how such lectures will to occur. For example, we noticed that the locations of the lectures are not yet defined, as well as the speakers have not yet been nominated. And while the cost of each event is set, this lack of information makes the $15,000 order not very reasonable.\n\nPerhaps it would be a better strategy to reduce the total amount of funds being requested and aim to produce materials with information that will be presented in the lectures. Then it seems like a good idea to define some test locations and choose speakers to present these produced materials, thus validating the project. In addition, it would also be a positive factor if the CVs of all professionals involved in the proposal were made available.", "q1r": 1, "q2": "Given that a viable path for the evolution of the project is chosen, we realized that the team knew how to choose good ways to audit the evolution of the proposal. For example, the number of portfolios being created and the amount of interactions on social networks around the project are good parameters to verify the success of the proposal. But it is worth mentioning that, in addition, as there is still not much information about the proposal, it would also be nice if some goals were established for better monitoring, such as a number of followers to reach in the first months or what the average number of participants expected in the lectures throughout the event.", "q2r": 3, "assessor": "z_assessor_1146", "no_vca": 10, "ne": 4, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 948, "q0": "The proposal could address the challenge, but may not have the impact they want to achieve. Since Japan is not only the CARDANO ICO country, but also one of the countries with the most Cardano holders, it may not be the main country that really needs to be promoted. In addition, language and cultural issues are also need to be carefully considered, due to the language barrier, the team mentioned that they need to find a translator to help them, sometimes the translation process will not be in place, the cost will also increase. From my experience of living abroad, organizing and promoting something abroad without knowing the language and culture will not be easy. It would be easier if you find a local CARDANO member to work together and organize the event.", "q0r": 3, "q1": "The feasibility of this project is not high, as mentioned above, they have to deal with language and cultural berrier, they have to assess whether the funding fits the local expenses, they have to organize a total of six events, but they still do not know where to apply. In addition, due to the Covid virus pandemic situation, Japan is still not open to tourists from many countries, or is open to some countries, but has to carry out more than 14 days of isolation, which is a potential risk that the project has to face, so the team members are recommended to learn about the latest developments of tourism in Japan.", "q1r": 2, "q2": "According to the above, this project will not be easy to implement before the current restriction in Japan is not fully open to tourism, moreover, if one of the auditable points is to see how many wallets are created during or after events, then they may have to analyze the wallet data, which will not be an easy way to analyze or be audited.", "q2r": 2, "assessor": "z_assessor_1245", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3253, "q0": "The proposal gave the idea is to create networking and promotional events in Japan. They gave information that crypto ADA was only approved to list in Japan 7 months ago, so it needs to be promoted more in Japan. Besides, ADA is also listed on Bitpoint exchange. The solution is to create bimonthly events, the audience is technology students, investors, Blockchain enthusiasts with the point of giving the difference between ADA and other coins on Bitpoint exchange. The proposal also introduces a risk that English is not a native language. They offer a solution is to use interpreters in events to interact with Japanese students and investors. I find that the problem and solution of the proposed proposal is reasonable and suitable for the goal of the challenge is to affect East Asia.", "q0r": 4, "q1": "Roadmap of the project is complete and detailed, such as searching for Japanese - English translators, finding locations and organizing time. Such a roadmap is reasonable. Proposed budget in detail: organize 6 events, each event costs $2,500, totaling $15,000. Expenses such as speakers, venue rental, meals, marketing are quite reasonable, but do not include the fee of the interpreter. If the proposal is approved, the team should detail and plan for this. The proposed team consists of many participants and has a very clear link attached and they have been funded at F7, so they can afford to succeed at this project.", "q1r": 4, "q2": "The proposal has clear criteria for tally such as the number of new wallets created, the number of social media interactions per day. The success of the project is to increase awareness of blockchain enthusiasts in Japan and this fits the challenge perfectly. This proposal says it is a continuation of previous funds but does not specify which projects to follow.", "q2r": 4, "assessor": "z_assessor_1632", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5535, "q0": "The team behind the project wants to organise promotional and networking events in Japan with the purpose of bringing awareness to Cardano. While this can be a good starting point for the proposal, the idea is not developed further in-depth and the team, not being from Japan, might need more time to research how to prepare, where to organise the events and what theme each speech should have in order to better communicate with the Japanese audience.\nAs mentioned before, I find this proposal to be a good beginning, though it needs more time for refinement and discovery of the nucleus of it, as to not have only a generic event proposal.", "q0r": 3, "q1": "The agenda the team describes in the detailed plan section is that they will start planning after the proposal gets funded “Once our project is accepted and funding is received, we will head right into planning” and “ We will plan out which cities are best”. \nAs such, this section cannot be considered as being covered at all, and there is no actual plan as of yet. \nAs for the budget, the team has envisioned an allowance per event, but considering that no speaker, location, translator or any other important detail has been decided yet, I find that the budget cannot be considered realistic or feasible at the moment.", "q1r": 2, "q2": "The way the progress of the project will be measured is accurate and can indeed provide sufficient data - ledger containing all attendees, number of people creating wallets and number of interactions on social media. The success is loosely described, with no conclusive numbers - “Bolstering up and energizing the rising Cardano enthusiast community in Japan.” - it has no clearly defined milestones that the community can be able to verify independently.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5901, "q0": "Good idea and totally aligned with challenge. Japan is highly connected to technology and, now that is listed in Bitpoint, has potential to grow even more its Cardano community, bringing valuable contributions. It Addresses challenges kpis as The number of proposals originating from East Asian participants in Project Catalyst, The observed impact of funded projects (meeting their KPIs) and  increase the participation of the Cardano community and Catalyst teams with East Asian residents.\nThe proposal could, however, bring more details on the dynamics that the events would work. Maybe give more details on the contets they are thinking of, how many days each event would last, if it would have discussion forums or just speakers, if it will be in eglish or japanese (with or w/o simultaneasly translation) and so on. Of course this can be better explored in project planning phase, once funded, but some idea on what proposers are thinking would be welcomed. A communication plan with Japanese community could be pre-elalborated also for the proposal. As eastern culture tends to be quite different, in many aspects, from the western one, it is imporant to check if this was considered/studied already and how it would be overcomed. A possible scope expansion would be to broadcast the event online, but this would raise challenge costs.\nLast, the target audience should also be better highlighted here. Specially when we are working with a different culture, it is good to start small, learn and then scale up. But, for this, it is essential to target the right group of people first.\nRisk management makes sense and there's a solid mitigation plan in place (work with translators and plan well). UN SDGs listed here also are sensible and good that are addressed.", "q0r": 4, "q1": "Plan could be better developed here. It is not time framed and only a few information on the phases are provided, without properly outlining the acitivites in it. I understand there are a lot of uncertainty but some estimates could be done. \nBudget breakdown is well done but I dont see any budget for translators.  There's also no budget line for trips. will proposers pay these costs  by themselves? Even if so, it could clear here, just so we know it was considered. I also wonder if budget was estimated considering Japan costs already (a pre study of it would be needed).\nFinally, as for the team, they seem fully capable of holding events in general. They have experience with this and with Cardano. The main hurdle here would definetely be language and culture barries, as none of them seem to speak japanese fluently.\n", "q1r": 3, "q2": "KPIs make sense and it is possible to extract some milestones from the plan - the key ones could be highlighted though, so we can see what is more imporant and track project development, not only its final results after events are held. The kpis could also have some target. How many atendees is considered a success? how many wallets created are good? Imporant also to track positive feedbacks from antendees.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6851, "q0": "By having the ADA listed on Bitpoint in japana, it becomes important to support that listing with promotion to the community (investors, students, Devs...) and thiis is what the current proposal is responding on.\nHosting a promotional event every 2 monts would help:\n- explain the particularities of ADA as a crypto compared to others;\n- attract new people to join the Cardano ecosystem;\n- channel efforts of various initiatives around Cardano in Japan\nAll this respond to the current challenge. ", "q0r": 5, "q1": "Team of proposals is multisciplinary and formed by people from different background and who have conducted other projects in the Catalyst in other regions of the globe.\nThis may be an assett to the success of the current.\nThe budget and timeframe are established and understandable, however the city, region where those events will be taking place are not identified yet. this would have been specified in this propoosal.", "q1r": 5, "q2": "Among the indicators of the project progress, you may have forgotten to mention the number of participants, but also the feedback (evaluation of satisfaction) under project implementation in addition to what was mentioned.\nAs they will be events taking place in physical spaces, wouldn't be an ideaa to incentivize the participants by organising a rafle for few prozez in ADA? And opening up wallet for new ADA holders.", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7844, "q0": "I believe this proposal does not align with the campaign brief, especially to the scope of promotional events targeted to Japanese investors. I would suggest the proposer focus on an educational approach within the tech students and blockchain enthusiasts. In addition, with language barriers, the proposer should approach the huge Cardano Japan Community and try to collaborate, which I believe they have many proposals like the conducting Cardano Expo, Festivals, and other community campaigns. ", "q0r": 2, "q1": "The proposer has relevant skills and experience and the team needed to run a promotional event, but not in Japan, and culture and language barriers do exist. It will not easy for them to overcome this without the support of the local Japan Community, which I suggest collaborating and it will need more research before proposing this project. The project timeline is not defined and mentioned (only bi-monthly event, but when?) in the proposal which as a CA is difficult to assess \n\nThe budget requested is in mid-range, although not detailed calculation such as cost/pax and how many participants were targeted per event? or have they researched the costs needed?  Can they collaborate with Cardano Community there?", "q1r": 2, "q2": "From the 3 proposed measurements of : \n-Ledger to keep a measure of attendees \n-How many people create wallets\n-Number of interactions on social media (follows/likes/comments on relevant accounts)\n\nThere are no clear numbers to measure or how much targeted audience to attend this event, or the % of wallet creation (out of participants, or an active one?) and how many % growths of interaction on social media channels.\n\nI would suggest the proposer do more research and start a discussion with the Cardano Japan Community and how they can help and collaborate. ", "q2r": 2, "assessor": "z_assessor_646", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8168, "q0": "In my opinion, this proposal is within the scope of the challenge, the problem is relevant and noble, but the solution is not really clear. The proposal said holding events geared towards investors, technology students, and blockchain enthusiasts. However, it does not mention how the events will be organized, such as the size of the people, the content of the event you want to organize, the location, how it will be collected. Bring the community to your events. The proposal also measures the risk faced in implementing this proposal, which is the language barrier, the solution to overcome that barrier is of course to hire an interpreter, my suggestion is that you should find more teammates. Japanese people, share the same idea of ​​developing Cardano in Japan, this will help you easily overcome the barrier of cultural differences in this country of the rising sun. As mentioned the idea is great but need more information on how to do and plan this project. I encourage you to rewrite your proposal for your next fund, outlining why and how more clearly.", "q0r": 3, "q1": "It will be difficult to track the progress and success of this project as there is no launch date or roadmap with milestones provided, to be honest the proposal is a good idea but no plan specifically to do it.\nThe requested budget of $15,000 is pretty sketchy, the proposal sets a cost per event but doesn't mention how many events will be held? It's relative cost in my opinion but without a detailed plan it's hard to see feasibility.\nThe team involved in the creation of the incubator is really strong, we can know who each member is through the description of the proposal and on the attached website where we are informed about the area of expertise, their experience.", "q1r": 3, "q2": "There are 3 final indicators but none of them have intermediate targets or milestones. Since the proposal does not actually establish any explicit distribution, it is not possible to test progress or success. I'd like to see a suggestion to connect KPIs to project milestones. The project's success is called \"Supporting and Energizing the Growing Community of Cardano Enthusiasts in Japan\", which sounds pretty vague and it's hard to keep track of its progress. project. Finally, the proposal is mentioned \"as part of a more comprehensive project to bring Cardano network events to countries around the world\" without mentioning any \"comprehensive projects\". In my personal opinion, this project seems to be a completely new project, not a continuation of the project that has been funded from previous rounds.", "q2r": 3, "assessor": "z_assessor_654", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10180, "q0": "This is a proposal to sponsor an advertising and community connection event in Japan. The promotional event's target audience is investors, technology students, and blockchain enthusiasts. The goal is to make more people aware of Cardano's growth potential and promote mainstream investors to understand the value of ADA. This is not a new idea, but if implemented, it will contribute to increasing the awareness of Cardano.", "q0r": 3, "q1": "The project does not have a clear specific plan. The proponent intends to make a plan after the grant is received. However, the proponent should clearly state the proposed plan, work items, and expected implementation time to provide solutions. A clear plan will help the proposed team see the workload, manage the project by work item, and Catalyst can check the reasonableness and feasibility of the plan.\nRegarding the budget, the proposed team lists out the necessary expenses. However, because there is no plan, it is not possible to check whether these costs are consistent with the given work items. For example, the cost of meals, in order to consider whether this cost is reasonable or not, it is necessary to know if this cost is used for the proposed group or is the cost of a snack for the event participants? How many people does this cost include?... The budget for this project is 10% of the total Challenge budget. Catalyst needs to consider this budget.\nAbout the project team, have a lot of experience and hold many important positions in the work. Experience and work history can be checked via the attached Linkedin link. However, this team is mainly experienced in operating. Who are the members participating as direct workers? What role will the members mention in the proposal play in this project? If the proposed team is more specific about the roles and responsibilities of project members, then Catalyst can consider the suitability of the team more easily.", "q1r": 2, "q2": "The metrics given are the number of wallet creators, the number of social media interactions, and the number of attendees. However, there is no information from the proposal related to the call to create a wallet (maybe because there is no plan, it is impossible to assess the appropriateness of the proposed goals and indicators). Regarding social media interactions, there are no links to social channels for the community to check. The proposed team should provide specific metrics and KPIs for project items, and a way for the community and Catalyst to check the progress of the project.", "q2r": 2, "assessor": "z_assessor_823", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Promotional/Networking events in Japan. Now that ADA is listed on Bitpoint, it has the potential to grow massively in the region.", "experience": "Defi Discussions team is the managing of the \"Networking/Education LATAM\" team from F7 as well as networking events in Ethiopia F5. Our team is currently building and developing a global crypto network. Some of our team members have traveled in and throughout Japan multiple times"}