{"id": 400671, "author": "bionicwoman.008", "title": "Onboarding Manual for Dummies", "url": "https://cardano.ideascale.com/a/dtd/400671-48088", "category": 26444, "amount": 16800, "description": "For anyone new in Cardano, there's no easily available onboarding reference that is designed for 'dummies'.", "f6_no_assessments": 6, "f6_rating": 3.388888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 927, "q0": "An Onboarding Manual for Dummies is a good idea and the engaging, East Asian flavored style of the writer may resonate well with a prospective Cardano newcomer audience in the region. The \"Dummies\" branding and very basic style is a little too simple to do anything for the Catalyst ecosystem or Stake Pool operators in East Asia. The proposer/author does not go into the planned content in enough detail to convince me that this book will have a meaningful enough impact to justify funding the relatively large chunk of the available funding it is asking for. One third of the time needed to complete the project will be spend on researching blockchain and Cardano, so proposing a little bit later and maybe with a partner or co-proposer from the community may have boosted the quality and cost effectiveness of the proposal.", "q0r": 3, "q1": "Various social media profiles linked on the proposer's website do not work (\"this account does not exist\") and the only book published by the author is very short at 59 pages and ranks only 6 million or so on Amazon, which is given as a reference in the proposal. The website of the proposer however looks good and there clearly is a lot of artistic and creative talent involved. The budget breakdown is a little rough and seems on the expensive side, and no credible references are made to people or organizations that may be used to aid in creating this project - like publisher, other blockchain influencers or publishers that could help, the community in the Philippines or East Asia, other Catalyst proposals or communities. This project does have promise, but should have done more research and been more open to collaborate. I hope that the project will be successful in the future but assess the probability of successful completion and positive reception by the community with the presented business plan as relatively low.", "q1r": 3, "q2": "The proposer splits the auditing into onboarding and publishing, which is good so there is a check-in before all funds will be disbursed. The metrics presented however leave a lot to be desired. 20 survey responses for content do not seem enough data to judge the onboarding the research process by as the author has no previous experience with Cardano and needs to research basic content before beginning the project. The binary metric (book published or not) is also not ideal, and a more thorough process with other parties involved to realized the project could have improved the auditability tremendously. ", "q2r": 3, "assessor": "z_assessor_1243", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1264, "q0": "The proposal is partly effective in terms of addressing the challenge.\nThe solution proposed to tackle the issue seems to me like a generalised onboarding process rather than an Easi Asia specific one. \nThe manual created, if translated into specific East Asian languages can be a more region specific onboarding solution.\nI still give a rating of 3 because the potential impact is purely dependent on the team’s social media and advertising reach in East Asia.\n", "q0r": 3, "q1": "Based on the experience of the project manager, I believe that it's highly likely that the proposal will be implemented.\nThe project manager is well versed with creating engaging educational illustrations and storytelling. \nThe reason I give a rating of 4 is that this is a project where the research/writing team plays a pivotal role in the process and they are yet to be recruited.", "q1r": 4, "q2": "The proposal is highly auditable although it could have been clearly mentioned in the proposal.\nThe following are my suggestions for better audibility:\n\nMonth 1-2: User research survey on blockchain exposure is presented.  This survey gives a general idea about the current level of blockchain understanding that a random sample set has.\nMonth 3-5: \n1) Bi-weekly updates on onboarding sections as each one is completed.\n2) Version one user feedback is presented with break down on the insights collected.\nMonth 6: Final version is presented.\nPlease Note: The above is just a sample audibility breakdown to understand the process better and the team can do a much better job of it than I have.", "q2r": 4, "assessor": "z_assessor_1330", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6048, "q0": "The proponent identifies a common problem within our ecosystem: the need for simple texts that help understand a subject as complex as a cryptocurrency and its ecosystem. And to this she responds with a valid solution, but one that now abounds in our ecosystem, but still always helps to add value to Cardano.\n \nThe issue with the proposal is that it is not well framed in the challenge. This type of challenge, the spirit of this type of challenge, as it was in the fund7 \"Grow latam, grow Cardano\" or now in this fund8 \"Grow East Asia, Grow Cardano\" is aimed at helping in the adoption of Cardano in these different areas. No to generic projects from people of this area.\n \nThis project could perhaps have been better framed in this challenge, for example, if it guided the writing of the book in a specific East Asian language in which there is not much written content yet.\n \nOr maybe the realization of a hub with introductory concepts in some city in East Asia.\n \nBut the way the project is oriented does not correspond to the objectives of the challenge.\n", "q0r": 1, "q1": "I agree that the proposer has what it takes to lead a project like this. She attaches links to her extensive work inside and outside the community and writes in detail and professionally on this project field:\n \n-She makes a very well segmented and very reasonable budget.\n-She establishes a reasonable timetable with different well-organized tasks that denote that the proposer has the necessary tasks clear.\n \nI see this project as a very feasible realization.\n", "q1r": 5, "q2": "The proposal fails to clearly list the different kpis and milestones of the project. And these two requirements are key to the auditability of the project.\n \nThe proposer could make a timeline for writing the chapters, for example, which could be shared with the community little by little. This way the community could audit the process and, at the same time, collaborate and educate themselves.\n \nThe parameters of success are also necessary to evaluate in detail the provisional and final result of the project and its actions.\n", "q2r": 2, "assessor": "z_assessor_32", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7845, "q0": "Yes, this is what we need to onboard newcomers in Cardano and Blockchain Technology, the proposer identifies the problem with a solution that will benefit the Cardano Community in general - not only in East Asia but globally. The Cardano for \"dummies\" is a great idea, and looking at Pinky's sample book in Amazon, she might nail this one and this simple e-book will help many community managers across the globe if implemented successfully. \n\nThe proposer also mentions the challenges that she will face in the future with a detailed plan on how to mitigate/overcome them. It will not be easy to simplify a very complex new technology and illustrate it, but it's worth trying.", "q0r": 5, "q1": "The proposer shares her sample book in Amazon, and enough credentials of her past work to say that her experience and skills are relevant for this proposal. She also shares the detailed 6 months timeline which is reasonable.\n\nThe budget breakdown given looks reasonable for a small team of editors, artists, and Writers/Researchers. Although the other team details are not shared yet?", "q1r": 5, "q2": "The proposer shares detail of the target/achievement/milestone of this project - but have not shared how the community can easily track it. As a CA I would suggest the proposers create a GitHub site/project or a simple Cardano Forum thread for updates. The goal is if the proposers need help or find any obstacle, the community (especially in East Asia) can help out. ", "q2r": 4, "assessor": "z_assessor_646", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10182, "q0": "The proposal poses a problem and has a good way of looking at it. Those who have little knowledge of blockchain or want to learn about blockchain, Cardano, but have barriers in terms of expertise and specialized knowledge. To help these people quickly access Cardano without spending too much time and effort to learn, the proponent wants to create a book about Cardano, Blockchain that is easy to understand. This is a tool to help Cardano reach ordinary users and expand the community. However, in order for this book to reach a wide audience, be widely accepted, and achieve Cardano's goal of expanding the community, it takes a lot of work from the proponent. The impact of the project (the book) on Cardano would not be great without marketing efforts or promoting the book to many people.", "q0r": 4, "q1": "The proponent has a clear, detailed, and seemingly very conservative implementation plan. The book was drafted, edited, and printed in 6 months. The rather long period shows the seriousness and time investment of the proponent of this book.\nRegarding the budget, the costs are listed specifically. Expenses are mainly personnel costs for team leader/editor, painter, and writer. Average $1,200/person/month.\nThere is no basis attached as a preliminary quote for this cost. Therefore, it is not possible to check whether such costs are true to the actual market prices.\nAbout the implementation team, there is only information from someone who has a lot of experience in marketing. There is empirical evidence that the book is self-written.", "q1r": 3, "q2": "How the project's progress will be measured is not clear. Parts of the project are mentioned, but there are no details of the completion time, so it is difficult to check the progress of the project.\nProject success is defined as the final version of the book. That means being able to publish a book. Whether the real effect can expand the Cardano community or not is unknown.", "q2r": 3, "assessor": "z_assessor_823", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10227, "q0": "While we seen growth in blockchain technology adoption in these past 2 years. We have not seen mass adoption of it yet. Part of it might be that:\n\na. It is hard to see its real life use case yet.\nb. A lot of bad news reporting (ie. scams, rug pulls) can make people reluctant to use it.\n\nA \"for dummies\" book actually make sense to help solve this problem. I think the proposal have some promise. Though, in my opinion, to limit it to Cardano only could make it too specific for its purpose.", "q0r": 4, "q1": "Considering that the proposer have experience in self publishing her book, I trust that the proposer is experienced to prepare this task being proposed. With that regard, I believe a collaboration, with a publisher or a researcher in example, will be good for this task. \n\nThe proposal itself did not mention about any collaboration is planned. With this consideration I have a bit of doubt that the proposal can be implemented successfully.", "q1r": 3, "q2": "While I agree that for a book publication project to be considered successful is to finally have the book actually being published. This proposal need to be refined in its milestones so it can be better audited by its funder. \n\nI will suggest the proposer to reach out to her cardano catalyst community for guidance in preparing her proposal for next funding. ", "q2r": 2, "assessor": "z_assessor_846", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "To create a digestible, educational, and informative manual to onboard people who are new to Blockchain and Cardano.", "experience": "I am a skilled professional marketer, with management experience in brand marketing, brand strategy & product design for reputable fashion brands like Esprit, Police, Giordano, Chronofixe, Blackwell. I am a born artist (fine arts degree), an illustrator, and a book author.  "}