{"id": 400981, "author": "jtrube", "title": "Tokyo Cardano Summit: Episode 2", "url": "https://cardano.ideascale.com/a/dtd/400981-48088", "category": 26444, "amount": 25000, "description": "Japanese interest in crypto and blockchain technology is growing, but many are still hesitant to invest or participate in the community.", "f6_no_assessments": 10, "f6_rating": 3.1, "videos": [], "media": [], "f6_assessments": [{"id": 230, "q0": "Japan is currently the country with the highest participation in Cardano, so allocating the requested amount for an online event is a waste of resources that could be used for a face-to-face event, which would have a much greater impact than an online event.", "q0r": 2, "q1": "Despite having searched, I have not been able to find records of the event previously funded by our community, in the amount of USD 25000.- on the internet, nor on the website of the company they represent (https://www.eggworm.jp/).\nLikewise, in previous works, the logos and brands of several companies appear, but the work done for our community does not appear, so I do not see that they have successfully completed the previous on-line event by not having left any record easily accessible for those who want to relive that event on-line, so I doubt that they will do it in this new opportunity.", "q1r": 1, "q2": "They indicate as a measure to audit the work done, the amount of online views on YouTube, but there are no accessible records of the event previously funded by our community on YouTube or on the company's website, so evidently this method would not be working.", "q2r": 1, "assessor": "z_assessor_1093", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 929, "q0": "Organizing a live summit in Tokyo to promote all things Cardano and then making this content available to a broad audience on Youtube in itself is a good idea. The proposal does not demonstrate knowledge about either Cardano or the Japanese crypto community, and simply promises to bring the \"coolest things about blockchain, crypto, and Cardano\", create \"cool content, and connect cool people\" - this is as vague as it gets. The problem statement that the Japanese are hesitant or reluctant to get involved in blockchain or Cardano are simply untrue and ignorant about the vibrant community, large ADA holdings and active crypto trading happening in the country. There are a lot of things that could be improved, like taxation, adoption of DID, separation of blockchain use cases and crypto as a speculative asset for example, but the proposal does not mention any reasons in the specific. This is a shame, as Japan and the Tokyo Metropolitan area are not a bad place to start with realizing the challenge brief of getting wider adoption and more SPOs in East Asia.", "q0r": 2, "q1": "The individuals mentioned do not have surnames or Linkedin profiles, and their agency's website does not reveal the members or track record of the team or proof of involvement with the brands mentioned. As the proposal is called \"Episode 2\" I expected some information about a successful first event with the proposers involvement, but no such mention is made in the proposal. Although it is stated that the proposal is the \"second installment of a previously funded proposal\" the proposers do not have any such track record or Kudos inside their IdeaScale profiles. A Google search about a first Summit only results in information about the Tokyo Cardano summit that was part of the global Cardano Summit and organized by well-known members of the community, instead of the company or individuals referenced in the proposal. The attachment of the proposal does not work or provide meaningful content. This is a shame, as I am left with no information whatsoever to believe that the event can be carried out successfully by the proposers. It is also disappointing that the budget breakdown is not detailed and lacks information about hourly rates, items of equipment, information about hosts or talent to be invited.", "q1r": 1, "q2": "The proposal consists of a life event to be held within three months and a total life span of 12 months with 20,000 views on Youtube of the event in total. This is very likely to create a mismatch between the resources needed to hold the event, and the way the funds are disbursed to build successful rapport between the Challenge Team and the proposers. I see a conflict between feasibility and auditability arising because of this mismatch, which might require a complete resubmission of timeline and KPIs or a failure of the event, unless costs for hosts, talent, equipment, venue etc. are funded out of the proposers' pocket - which is unlikely given that it is not mentioned in the proposal.", "q2r": 2, "assessor": "z_assessor_1243", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 949, "q0": "Japan may seem openminded but it is still a conservative country in some issues. Therefore it is best to have local people involved when organizing this kind of event, as japanese are more traditional in this aspect. Besides, the problem statement \" That many are still hesitant to invest or participate in the community\" doesn´t really reflect or match the real situation, because CARDANO has a large community in Japan and there is a high acceptance of cryptocurrencies, which is somewhat different from what PROPOSERS described. As a result, events like this, require people who understand the local culture to run them, otherwise will have a lower chance of success.\nBesides,it´s hard to generate Impact via online.\n", "q0r": 2, "q1": "When we talk about the likelihood of success of a project, we are considering whether the results can actually be implemented, but when the above-mentioned problems are not the current problems faced by the Japanese community, it is less meaningful to assess its feasibility.", "q1r": 1, "q2": "There is no previous videos or references to see whether the project can be auditable. However, as previously stated, it is not easy to achieve the numbers they state due to possible cultural differences, and the funding requirements for only one online event may be too high.", "q2r": 1, "assessor": "z_assessor_1245", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 1674, "q0": "The proposers wish to organize a second installment in their already completed Tokyo Carano Summit in order to inform and educate people in Japan about the Carando Network and blockchain technology. This closely aligns with the challenge goal to raise awareness of regular people in East Asia about Cardano Network. Therefore I give this proposal a four star rating. However, to achieve a higher score I would recommend that the proposers specify the type of content and information the summit should include and inform the reader about the type of speakers and talents they wish to invite. This would give the reader a clearer understanding of the impact of the proposal.", "q0r": 4, "q1": "The proposers have already received funding and completed one installment of the Tokyo Cardano Summit, which makes it credible that they will successfully complete this project. The team members, Nick and Brano, have the relevant experience with event planning and content creation that is needed to achieve their plan. Furthermore, the proposers deliver a clear and detailed budget breakdown that explains how the funding will be used. Therefore I give the proposal a four star rating in feasibility.\n\n\n\n\n\n\n\n\n\n\nTo achieve a higher rating I recommend that the proposers discuss possible ways to mitigate the risks discussed in their risk analysis. Would it for example be possible to complete the event fully online in the case of stricter Covid 19 restrictions? I would also like to know how likely they deem changes in venue availability and talent bookings to be. I would also like to note that there seems to be a smal mix up in the “feasibility” and “audibility” section, as a more detailed plan to action is described in “audaility” and some KPIs are discussed in the feasibility section. I would recommend this to be  adjusted.", "q1r": 4, "q2": "I rate the proposal five stars in regards to audability. The proposers specify clearly outlined KPIs that are easily measured and inspected by the Cardano community, and that is relevant to the challenge goal. It would however be interesting to track whether the proposal results in an increased participation of East Asaian, in this case Japanese, residents with the Cardano community. \n", "q2r": 5, "assessor": "z_assessor_1403", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4316, "q0": "This proposal addresses the problem about Cardano adoption and awareness in Japan. It addresses the challenge by providing information and knowledge through content making and events. They provide a realistic plans by taking into the consideration current situation into their progress such as Covid restriction and the problem it may inflicted.", "q0r": 5, "q1": "The proposal provides a well thought out plan on how to implement and run these events, The budget have been broken down into details, which proven the ability of the proposer to identify the necessary resources required for the project. They have clear ideas regarding the events and achievable goals. With the clear and well thought 12 months roadmap, it looks feasible to complete this in a timely manner. It also help that they a dedicated team with good credentials. However, for the sake to further backed up their credibility. It might help to provide constructive links to each of the respective members.", "q1r": 4, "q2": "The proposal are clear about their metrics, such as number of attendees & views, and their KPI can be easily traceable through their social media such as youtube or other platform (links to these will also really help with the process, which I assume will come later). By considering these points, it will make tracking the progress easier and transparent to the community. ", "q2r": 4, "assessor": "z_assessor_1719", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7846, "q0": "The proposer offers a solution by holding a summit to increase participation within the community while raising awareness for the general public in Japan about Cardano and Blockchain technology which is aligned with the Campaign Challenge. As they mention in the proposal that this is the 2nd Summit, unfortunately, the proposer did not give any data or feedback regarding the 1st Summit (is it a successful event, and by what the impact was measured?) and in which area, the 1st Summit can be improved?\n", "q0r": 4, "q1": "The 12-month implementation plan is given, but not in detail and how they will achieve it, and why they want to achieve that target (ex. why min. 20,000 views within 9 months?) \n\nThe funds requested are in the mid-to-high range, maybe because this proposed budget is for 12 months i/o shorter terms? since the budget breakdown is not detailed enough, as a CA it is difficult to assess if the budget is reasonable or not.\n\nSince this is an online event, the proposer's team has enough relevant skills and experience to implement the proposal. Unfortunately, there are no links such as LinkedIn or other external resources to verify it.\n\n", "q1r": 3, "q2": "The proposer shares a timeline line of the project, with a clear KPI / target to achieve - but they have not mentioned the reason why they put these numbers? This is very important since for instance to target 150-250 attendees in a live event and grow that into 20,000 views in 12 months, what are the plans to achieve it? or why start with 150-250? why not 50 or 100? are these numbers based on the 1st Summit event? unfortunately, there is no data given about it.", "q2r": 3, "assessor": "z_assessor_646", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8019, "q0": "The Japanese interest in cryptocurrencies and blockchain technology is growing, but many people are still hesitant to invest or participate in the community as a problem to be solved and it is directly related to the challenge. this formula. At fund 7 the author has already opened a summit for the 1st time and this is the author who is producing the second volume of the Summit in Tokyo Cardano. The team showcased the most interesting things that Cardano has to offer the community to know and especially attractive for beginners. The risks of this project are that seminars cannot be opened because covid 19 is still ongoing, so crowds will not dare to gather, cannot find a suitable location. If all goes to plan, this will definitely be a big impact for the Cardano ecosystem and will help the community grow.", "q0r": 4, "q1": "Đề xuất bao gồm một lộ trình với các mốc thời gian tương ứng 3 tháng, 6 tháng, 12 tháng. Sau 3 tháng tác giả đã hoàn thành việc lập kế hoạch các bước chuẩn bị sau khi được phê duyệt. Tháng 6 chương trình được khỏi chạy trên các kênh youtube. Tháng 12 tác giả dự tính sẽ đạt được 20.000 lượt xem 1 con số khác lớn tôi mong rằng tác giả sẽ làm được như lời đã hứa nếu như dự án được cấp vốn. Ngân sách xin được cấp vốn của dự án là 25.000$ được tác giả liệt kê chi tiết cho từng khoản nhỏ với các số tiền tưng ứng với từng mục cần phải chi. Nhóm gồm có 2 thành viên chính là Nick và Brano được phân công công việc rõ ràng phù hợp với kinh nghiệm hiện tại của họ, ở đây tôi chưa thấy tác giả liệt kê số năm kinh nghiệm của các thành viên. Trang hồ sơ cá nhân mơ hồ vì họ không có gắn các link liên kết để người xem dễ theo dõi và dễ biết họ là ai ở đâu và làm về mục đích gì.", "q1r": 3, "q2": "The author measures specific development progress through months. The first month will bring the brand, image, web infrastructure and establish relationships. 2nd month of programming, talent, community referrals and nurturing relationships. 3rd month author sourcing equipment, technology, preparing studio and building community. From the above things, I see that the author is very interested in the implementation progress of the project. KPIs are described very clearly and in detail the indicators are enough to audit success as a destination. Clear roadmaps and timelines make it easy for followers to check the success of their performance. This project has been funded in fund 7 with a score of 3.58 points equivalent to 535 votes. In this fund 8 the project continues to write for topics in fund 7.", "q2r": 4, "assessor": "z_assessor_649", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8174, "q0": "This proposal falls within the scope of the challenge as its solution concerns how to develop Cardano in Japan. According to the author, Japanese interest in cryptocurrencies and blockchain technology is growing, but many are still hesitant to invest or participate in the community. I really like that they bring ideas with a visual identity. The target audience is Japanese people who have heard something about these issues, but do not have enough guidance, to believe in these technologies and thus adopt Cardano or actively participate in projects like catalysts. The solution is the Tokyo Cardano Summit, which showcases the most exciting things Cardano has to offer, attracting newcomers to blockchain. By hosting online events, the proposal will create interesting content about Blockchain, Cryptocurrencies and Cardano that will help newcomers get more interested in learning. The problem raised and the solution presented in the proposal match the challenge in a clear and logical way. The negative point of the proposal is that it has introduced a number of possible challenges and risks, but has yet to offer remedial measures.", "q0r": 4, "q1": "This team has 2 main members with interesting and relevant backgrounds, but I don't know if they are ready to lead this project, they don't show any kind of connection to Cardano in the description their. surname. They give us a short description of who they are (this description could be more detailed). It would be beneficial to suggest if there is some evidence to verify the experience of the team, e.g. Linkedin or the website. As for the step-by-step implementation of this project, I found it very superficial. Little is known about what will happen in 3, 6 and 12 months, it is better to suggest providing a step-by-step plan with broken down timelines and specific goals. Also, the division of money is done quite specially, the required funding is $25,000 divided into several parts, but only the topic of project management is well explained.", "q1r": 3, "q2": "The proposal provides a baseline for measuring project progress. KPIs are also available in two sections, one part where the KPIs themselves cannot be measured without metrics, while the other part is established in their roadmap. THAT is the number of people attending the event and the number of people visiting their Youtube page. Since this is a sequel to the \"Tokyo Cardano Summit\" proposal https://cardano.ideascale.com/c/idea/383421, I thought it would be more convincing if it provided the results already obtained from fund 7. It will be the most valuable evidence for the community to know the ability of the proponent and also the best measure to evaluate the progress and success of this proposal.", "q2r": 4, "assessor": "z_assessor_654", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8705, "q0": "After reading this proposal, the main focus is to produce a second episode of the Tokyo Cardano Summit bringing out things that Cardano can offer to beginners as the Japanese interest in crypto and blockchain technology is growing. \nThe proposal basically is saying that they want to show off the coolest things about blockchain, crypto and Cardano to the Japanese people and get them excited. They will hold a second online event for the individuals in Japan who may have limited idea about crypto and have no idea where to start from. They will create content and connect cool people, create a space for people to voice out and be heard. \nIn addressing the challenge, growth and adoption of Cardano in Japan can become a powerful paradigm shift , as they continue to grow into neighboring countries.  \nThe main challenge would be accurate forecasting of unforeseeable circumstances such as increased Covid 19 restrictions, changes in talent booking and changes in resource availability, but no solution was provided for these stated challenges in the proposal. With all this information the challenge is effectively addressed., hence my rating is 4. ", "q0r": 4, "q1": "The plan presented in this proposal is quite clear that the project is for 9 months duration- 3 months, 6 months and 12 months. \n1st 3 months - complete planning, preparation, launch \n6 months - After launch, upload the videos to YouTube \n12 months- Achieve a minimum of 20,000 views within the 9 months following the event. \nThe budget is also having a detailed breakdown showing costs of Zoom business license, newsletter and mailing, web development to mention a few.\nThe team is made up of 2 experts in brand development, PR and event planning , visual identity development and brand messaging. The two are Nick and Brano. \nWith all these information the proposal can be successfully implemented . So my rating is 4. ", "q1r": 4, "q2": "Measuring the progress of the proposal, there are 3 months of tracking events, \n1st Month - brand, visual, web infrastructure, establishing a relationship.\n2nd month - programming, talent, community onboarding etc. \nIn measuring the success, the following will be considered -  \n3 months - sourcing equipment, tech preparing videos\n6 months - After launch - upload videos to YouTube \n12 months - achieve a minimum 20,000 views within the 9 months.\nThe information provided is sufficient for successful auditing. ", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 10185, "q0": "This is the idea of ​​creating the 2nd Cardano Tokyo summit. This event helps connect Cardano with Japan better because Japan is very welcoming of blockchain and cryptocurrencies. At the same time, Cardano was born in Japan. This idea fits the requirements of the Challenge. \nHowever, before implementing this project, I think it is necessary to review the results of the 1st Tokyo Cardano Summit. What did the 1st time achieve and what did not achieve? If the second time is implemented, what points need to be improved? If we can analyze past results, we can offer a better direction for the second time.\nIt is recommended that this workshop be held offline or online. In the risk section, you mentioned the issue of the Covid 19 epidemic, but if you organize it online, you can reduce the risk of the impact of the Covid epidemic.", "q0r": 4, "q1": "Regarding the plan, the proponent briefly stated the implementation plan for 3 months, 6 months, 12 months. I think a workshop should have a more specific plan, the example of content, schedule, location, expected time, expected number of participants, approach, how to send invitations to attend a conference, for example. The more detailed the plan, the clearer the roadmap, the work to be prepared, and the necessary costs for each work item.\nIn terms of budgets, listed by category, however, are only the major categories, and the total cost for each major item. It is necessary to list more detailed items and detailed budgets so that Catalyst can assess the reasonableness of the proposed budget with the content of work to be performed. And, it is necessary to clarify whether to deploy online or offline seminars, because, for each form, the proposed cost estimate will be different.\nRegarding members, the two main executors have experience in implementing marketing campaigns, brand identity campaigns, organizing, and leading events.", "q1r": 3, "q2": "The roadmap is clear but only summarized, not details.\nTarget KPIs for 3 months, 6 months, 12 months are stated in the proposal. These KPI results can be tracked on the youtube channel and the actual attendance results.\nSince it is a proposal for the second part of the previously funded Tokyo Cardano Summit, in my opinion, the KPIs and indicators presented in the proposal in fund 8 need to be calculated. The estimated number of attendees for this 2nd time is based on past data + XX% (*XX% is the expected increase due to improved ABC marketing effectiveness based on shortcomings of the first time for example).\nI think if you make such an argument, your proposal will be much better logical and persuasive.", "q2r": 3, "assessor": "z_assessor_823", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1}], "solution": "Produce a second episode of The Tokyo Cardano Summit, showcasing the coolest things Cardano has to offer, appealing to absolute beginners.", "experience": "Over a decade of event production and content creation in the Japanese market for clients such as Google, Porsche, Ralph Lauren, and more."}