{"id": 401077, "author": "proofspace.nick", "title": "Translate no-code SSI to Japanese", "url": "https://cardano.ideascale.com/a/dtd/401077-48088", "category": 26444, "amount": 26481, "description": "Ability to grow Cardano is constrained by lack of translated documentation and products for scaling local ecosystem", "f6_no_assessments": 8, "f6_rating": 3.875, "videos": [], "media": [], "f6_assessments": [{"id": 4581, "q0": "As there is lack of documentation related to cardano in Japanese language , people can't understand the importance of cardano's project. Since by providing no code SSI platform it will help local users to find the right tool for the job. And user can explore WordPressMultisite, Bubble, Adalo, Stacker, Glide, Fliplet, Dropsource, Outsystems, Appsheet and many others. where people can use the tools without requirement of any instructor which will also boost Japanese people to invest in cardano related projects hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "ProofSpace is a no-code platform for building & deploying SSI, since ProofSpace Dash and ProofSpace App are ready for localisation, the team is also an multilingual which has people of all languages. As it has right partner of ProofSpace ,it just needs one Japanese expert to translate all the data in the form of documentation, later which can be implemented and tested and check the outcomes of the translation, which is not difficult task to complete. So with the less risk involved and with provided experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The information contains the lead members of ProofSpace and their experience in the presented field, the proposal even contains how it will boost cardano in the future,the proposal can create local people to involve in development of ideas without requirement of any code. The proposal is very clear on timeline and budget breaking, it even contains excellent key indicators to measure the success of the model , with a long vision provided the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8020, "q0": "The author makes the point here that it is very clear that Cardano development is limited due to lack of translated documents and products to scale the local ecosystem as a problem to be solved in the challenge. The question here is how can we develop the Cardano ecosystem in East Asia in a holistic and supportive manner? How the community can easily track the progress and development of the project. The author has translated documents available for local users to easily apply Cardano products to their business and daily life to help local residents better understand the Cardano ecology. The team also outlines some of the risks and how to minimize them, which shows how much they care about the project they've written. I believe that if the project is funded, the project will be successful.", "q0r": 4, "q1": "The proposal provides a clear roadmap that allows the community to easily follow it. Tasks and delivery milestones are clearly indicated by the author. But in my opinion here the author should list more translations for each possible milestone (for example, January can release 10 translations, February can release 20 translations). The funding required for this project is $26.481  detailed by the author for each small item with amounts corresponding to each item to be spent. But here I think the author should add the estimated budget because almost for all large and small projects, we should add the estimated budget, I think it would be better if there is anything more, there is still something to do. spend. The team consists of 5 members who are clearly assigned jobs that match their current experience through the number of years of experience listed by the author. The project team will be presented much better if there are more of their main linking pages such as Twitter, LinkedIn ..... then the credibility of the team members will be more recognized by everyone. work will also come easier.", "q1r": 3, "q2": "The project's transparency and metrics are clearly listed by the author through existing community channels, the reporting process is shown to be compatible with the months. It is recommended to provide information that is sufficient for a successful audit to be the destination. This project has been funded in fund 7 with a score of 4.57 points with a vote of 246. I think if it is funded in fund 8, the project will be more successful.", "q2r": 3, "assessor": "z_assessor_649", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8069, "q0": "As a person who lives in a country that uses English as a second language, I think the idea of this project is vital to help scale up the Cardano community and project at local - the scope of this project is in Japanese. They want to make a platform that helps translate products and open documentation from English to Japanese. The objectives and audience of their project are very clear but I think the proposer should give us more detail about how their platform will work, at least in feature/ function explanation or better is a case study or user flow. The key metrics that the proposer state is very clear and align with the challenge set that I believe they strongly understand how worthy it is to the Cardano ecosystem. Moreover, some risks were listed and the team also had solutions for them that I think can help a lot. ", "q0r": 4, "q1": "\"It's better if the proposer can detail their implementation task to help the assessor understand their plan easier, and also help assess their required budget and roadmap whether reasonable or not. For example, they can outline detail about categories of products that they will translate, or detail tasks of their implementation translations, or else... \nAs I mentioned above, the required budget is hard to assess whether is reasonable or not, I really don't understand some costs that they break down to. For ex: why does the team have to pay for recruiting translators but also pay for translator fees and completing translation documents?\nThe good thing that the proposer provided in this session is their key members that I think their ability can help to develop this project. \nOverall, I rate this for 3 because they didn't provide enough detail for understanding their plan. Not sure that it will work or not. \"", "q1r": 3, "q2": "The proposer shows clearly what outcome will be delivered after months of development. These key metrics can help the community to track and assess their progress and performance after being funded. They also state the successful image of their project which is very inspiring. But I hope that they can provide to the community some channel or tool to support the tracking and monitoring of their progress easier and better.", "q2r": 4, "assessor": "z_assessor_651", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8122, "q0": "Translate No-code SSI to Japanese fits the challenge of Grow East Asia, Grow Cardano well as it is aimed to have the no code SSI available to the East Asian community. However, in one of the key metrics: was there an increase in Daily/ Monthly active wallets, they admit that they wouldn't have the number of interaction between a user and the service provider and hence, the impact of this proposal to the East Asian community could be limited. The download App number alone would not be sufficient to validate the impact of proposal towards the community. They should add more key metrics that are quantifiable as the proof of traction of their solution. Also they should offer more explanation as to why they place their \"translate no-code SSI work to Spanish\" language in the Miscellaneous challenge while the \"translate No-code SSI to Japanese\" in the grow East Asia to ensure that the focus of this proposal to grow East Asian community is genuine and not just for the strategic purpose of obtain funding.", "q0r": 3, "q1": "Their official website or profile of team members ( linkedIn) are not listed in the proposal. Whencomparing the translation cost No-code SSI to Japanese proposal VS. the translation cost No-Code SSI to Spanish, both numbers are on-par and sensible although they don't specify translation working hour. The project timeline (May-September) is corresponding to the translation workload. The proposal will improve if they provide their reference/link and disclose future funding and the number of languages they plan to come back to the community in future funding round.", "q1r": 3, "q2": "Suggest that the proposer consider extra reporting venues (in addition to the monthly report). So far no website link is given making it very challenging for the community to check the progress and what had been done in the previous fund. Also if there is no number of interaction between a user and the service provider that proofspace can detect after translation no-code SSI to Japanese is launched, how the team could show the production use cases in Japanese. The project need additional metric that could be obtained from the East Asian community to show that the project delivery is completed in an effective way and that it increases adoption by the East Asian community. ", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8953, "q0": "The idea is interesting, it is about to translate no-code SSI SaaS platform (which is the product of the funded proposal in Fund7) and documentation into Japanese. This idea will bring a big impact on Japanese community, because once it is success, it will help Japanese users to adopt Cardano products into their businesses without the language barrier, and help growth in use of Atala PRISM. Moreover, the authors explain about the key metrics of the proposal which clearly align with the outlined challenge settings:  increase the number of proposals originating from East Asian participants in Project Catalys, increase the participation of the Cardano community and Catalyst teams with East Asian people, incresing the number of active wallets. ", "q0r": 5, "q1": "The proposers give us to understand which tasks need to do in the project with milestones from May to September.\nCertainly the proposal has a good team because the detailed information about team members helps us to know who they are, what their professional majors are, how many experienced years, as well as their previous experiences, detail of projects they have already done, especially the funded proposal is the strong evidence to prove they are definitely capable. \nAbout the financial amount, I think it is split quite fair and reasonable as we can see how the money asked would be use and how much it costs. I think it would be greater if the cost for “On-going translations effort” is explained clearer.\nThey also explains the challenges/risks that they have to face when executing the proposal as well as how to mitigate the problems. The well-prepared plan and the description budget give us a vision of the project as a whole. Therefore, I give the feasibility with a score of 5.", "q1r": 5, "q2": "I see this part of the project is complete, we have enough material to monitor the project, consist of roadmap with milestones and time hirizon, allow us to understand what would happen, how it would happen, in which order and vision, which final products. About the results, it is possible to monitor them through the section \"What does success for this project look like? \". Besides, it will be easier for existing ProofSpace users, the translations in production will be available on the platform, as the authors mention. In summary, the proposal is auditable.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9903, "q0": "Warning to VCa: this proposal being very similar to several other proposals by the same team, my assessment may include similarities.\nThis proposal offers to translate from English to Japanese the app and the documentation of an existing product funded in Fund 7 that fosters adoption of SSI by the support of ATALA Prism (https://cardano.ideascale.com/c/idea/385204).\nImpact of this proposal is related to the accelerated adoption by japanese-speaking users of the no-code SSI platform. Japanese is spoken by more than 120 million people, therefore this proposal is aligned with the “Grow East Asia, Grow Cardano “ challenge.\nThe proposer mentions several metrics listed in the challenge brief and demonstrates how translated materials can accelerate Japanese developers and project leaders on-boarding. To give a 5 stars impact score, I would have expected more information about the Japanese user base, like an estimation the size of today’s Japanese cardano developers community compared to African developers community for example.\n", "q0r": 4, "q1": "One risk is listed about maintaining the translation while the products would continue to evolve. To mitigate this risk a part of the budget of this proposal is retained for future work, which I consider is a good practice. \nTasks for completing the proposal are well listed. The translation will be supported by a dedicated translator that remains to be recruited. The budget breakdown details how much translation work will be required, between translator recruitment, documentation translation and product translation itself. Some items could have been more explained in this breakdown, like why is there a generic “translator fees” not related to a specific part of the work?\nThe team shows evidence of having enough project management and computer science skills to complete what looks like a simpler project than what it has accomplished so far.\n", "q1r": 4, "q2": "Success is defined as the availability of the translated documentation and product, and as a real growth in the japanese community in use of Atala Prism. \nSeveral milestones are listed to enable the community to monitor this 3-month project, including beta versions of the translated material.\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10186, "q0": "This proposal is a project to translate SSI No code into Japanese. The purpose is for the Japanese community to have more documentation on how to use SSI. This idea contributes to helping the Cardano community access SSI No-code more conveniently. However, I think you should find out the Japanese community's need to use SSI No-code before translating this document. If the demand is not much, the translated document will not be used much and the contribution to the expansion of the Cardano community in Japan will not be much. I think this is a pretty good idea but needs more consideration on the extent of necessity.\nRegarding how to deal with risks, in addition to adding explanations for specialized terms with common words, you can use many easy-to-understand visual illustrations for users to easily absorb the content of the document.", "q0r": 3, "q1": "The plan should be written in more detail, for example, the translation will include rough translation and correction. It is advisable to clearly write down the content of the work and the duration of each job. Currently, the plan is being written quite generically.\nAs for the budget, I think the proposed team probably has a detailed spreadsheet so the costs are shown in odd numbers. If possible, the team recommends attaching a spreadsheet for easy checking of details. For example, the stated translation fee is $5,250. How many pages does this document have and how much does it cost to translate one page? If you can list such details, the budget spreadsheet will be much more logical. The budget for this translation project accounts for about 17.6% of the total budget of this Challenge. This is also a point to consider about the reasonableness of the budget.", "q1r": 3, "q2": "Implementation results and progress will be reported by the proposed team through existing Catalyst channels. The team can offer ways to measure the progress of the project, for example, using product screenshots, the number of shared translations... Although there are no clear indicators and KPIs, the proposed team also lists quite comprehensive ways of assessing actual and planned results.", "q2r": 3, "assessor": "z_assessor_823", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10281, "q0": "In my opinion, this project is very useful. Translate a no-code SSI SaaS platform (ProofSpace), including products and open documentation, from English to Japanese. This will make it easier for local people (specifically Japanese) to apply Cardano products in their business and daily lives. On the other hand, promoting more suggestions from the Japanese community by taking advantage of the translated documentation and the no-code capability of the platform.", "q0r": 5, "q1": "Currently, your team consists of 5 members. They are experienced people, multilingual team, >80yrs full stack dev, distributed systems research & translation experience (e.g. Portuguese, German, Arabic). Based on the provided knowledge, experience and skills, they are fully qualified to carry out the project. However, it would be great if you provide more of their contacts (eg: linkedin, telegram, ...), that will be a tool to help people verify the above information.\nI appreciate you identifying the risks, challenges, and ways to address them. This will be a lever for the long-term development of the project.\nTasks and milestones have been listed. However, I have a question: How will people know about your platform?, how will you do the marketing?\nYou have provided how to allocate the budget, it is quite reasonable. However, I think it is better to calculate a more specific budget, e.g. determine the number of hours worked, the hourly rate. This will help the budget become transparent, giving people more confidence in the project.\nCriteria for measuring success have been provided. However, listing specific numbers is easier to evaluate, for example: number of production using ProofSpace in Japanese is 20,...", "q1r": 3, "q2": "To make it easier for people to gauge the success of this project, I think you should be more specific about the parts I mentioned earlier (clarifying budget, providing team contacts,. ..).\nThis is a pretty good idea, however, given the information provided, I'm not sure if this project will be successful. Don't give up, let's work together, clarify the issues so that people can believe in your project. I hope in the future, or in the next funds, you will give more complete and valuable information, then I will definitely vote for you.", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Translate a no-code SSI SaaS platform (ProofSpace), including products and open documentation, from English to Japanese.", "experience": "ProofSpace is a no-code platform for building & deploying SSI. ProofSpace Dash and ProofSpace App are localisation-ready. We’re experienced, multilingual team, >80yrs full stack dev, distributed systems research & translation experience (e.g. Portuguese, German, Arabic)."}