{"id": 401313, "author": "thhddnordr", "title": "CNFT Festival Japan Meets the West", "url": "https://cardano.ideascale.com/a/dtd/401313-48088", "category": 26444, "amount": 15000, "description": "There are language and cultural gaps to adopting Cardano. The best way to bridge cultural and language barriers is through creating NFT art", "f6_no_assessments": 9, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 7427, "q0": "The proposal fits the objectives of the challenge, but more details would need to be provided about the project so that we could really assess its impact. We know, as the proponents say, that one of the best ways today to attract people to the crypto world and to our blockchain is through CNFTs, as the concept is on the rise and everyone (practically) is interested in it, in addition to of not being something so technical and complicated, such as, for example, understanding how a smart contract works, which makes it easier for people to fully understand and get involved with the thing. From what I can understand in this proposal, the CNFTs festival is already a reality in japan, probably this was a proposal launched in some previous fund and financed; it is clear that it is an event that brings together English and Japanese speaking communities, in favor of the purchase/exchange/exhibition of CNFTs. However, not much is specified about the festival, some doubts such as: if it is in person or online; if in person, where it takes place; who are these people who participate, who exactly is the target audience, we know that they are English and Japanese speakers, but this information could be more specific; we know what activities will make up this stage of the project, but what has happened so far in this festival, and how has the public reacted? Anyway, in general, I couldn't visualize as clearly how it would happen in practice, and with that I can't measure the impact it would have either. It certainly seems to me a proposal that would meet the objectives of the challenge, that both the expansion and popularization of the Cardano ecosystem, through the purchase of Ada/CNFTs, creation of digital wallets, new people becoming active members of the community, new smart contracts being brothers-in-law at Cardano and etc; and for the benefit of the geographic region in question, that is, East Asia, driving this territory to grow both economically, with a more social and human bias, as well as environmental and so on. This proposal seems that it will certainly popularize Cardano in Japan, through the dissemination of CNFTs, as well as benefiting its local population, since they would be getting to know and starting to consume a technology relevant to the system and will probably also research more about, and with this they will be able to enjoy the advantages and ease that our blockchain offers. That's why I'm going to give it 4 stars, because I think the idea is good but it should be better explained. \n", "q0r": 4, "q1": "We know in detail what will happen after funding, that is, what activities would be developed. This includes the theme of the conference, its dates, times and who will present it, which professionals will be involved. Really, the only thing that was outstanding in my opinion was the issue of location. All conferences would be and a single location, which one? Or would they be in different locations across Japan? Online, on which platform? It really isn't clear to me. I believe it will all be in the same corner, but I would like this information to have been confirmed, so that we could fully understand the project development process. Generally, I suggest that a script be established that includes exactly what will happen and when, I think this is already exposed in the proposal, another thing that could happen would be a greater detail in relation to pre-production, that is, what would be done before these meetings, so that it would become possible. However, this is just a suggestion on how to make the script even more fun, because the way it is is already very good. As for the other things, budget and staff, I think they're presented quite adequately as well. We know how the total amount would be split quite clearly, although this could have been further specified, for example when they ask for “$5000 - Hiring Video Production team and Video Graphics”, why would it take 5k for that? How many videos would there be, so what their individual price? Likewise, other expenses could also be better detailed. Regarding the team, in this case it is a duo, a lot of information is provided about them, which relate to professional CVs about what they have done so far and also how they relate to the Cardano ecosystem (it is not so explicit which it would be Timothy Vang's work in the community, though). I think it's a good level of detail so that we can get to know them, but their things were still missing, seeing: both a way to prove their CVs, either through a linkedin profile or some other platform that can prove the information said, how much to explain what the tasks of each would be, exactly. With this information attached, I believe we would be 100% sure who they are and if they are indeed equipped to perform these tasks. However, because this proposal is the continuation of another that already exists, a certain confidence is already transmitted in the team. For these reasons, I think the feasibility of the project is good, but to become ideal there are still things to improve. \n", "q1r": 4, "q2": "I don't think this part of the proposal is as good as the others. It's not bad, but it has a lot to improve. Only a few ways to monitor this project are given, which, in my opinion, are superficial. Basically, the suggested audit forms are through videos uploaded on youtube, which would be recorded from the event, and also by the festival itself. But these ways are very basic, I would like to suggest some improvements that could be made here. Regarding the development process, other ways could be created to monitor how activities are being developed. Before the festival starts, the pre-production would be carried out, this could be informed to the rest of the Cardano community if the two proponents elaborate some kind of return to the community. This could be done in several ways, such as establishing video calls, or even through office reports, in short, some way for us to make the information about the progress and preparation of activities for the festival to take place known. of all. Regarding the final results, I think it would be useful if, in addition to the event videos, the proponents made a summary containing basic information about each day: approximately how many people attended, how these people interacted with the speakers and also with each other, how they did captives of participating in the Cardano community and if so, in what way, in general: direct ways to understand how the days of the event itself were. In addition, further research could be carried out, some time after the event, so that we would know how these people would be getting involved with the technologies of the Cardano ecosystem, if they are acquiring, exchanging or exposing CNFTs, etc. This contact could be done by email, as a kind of satisfaction survey about the event and a way to deepen our understanding of its impact. Through these improvements, I think it would be possible to establish a more specific auditability, in the way it is suggested by the proponents, it would be a somewhat superficial follow-up, in my opinion. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 6, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 231, "q0": "The proposal coincides with the desired objective, combining art (one of the most powerful communication tools) with Cardano's CNFT technology, and a mix of artists from the West and East, will undoubtedly make Cardano grow and spread in East Asia.", "q0r": 5, "q1": "They have previous experience doing this type of event successfully (funded by Fund7), so they have already demonstrated that they have the necessary skills to carry it out. As a member of the community, I would love to see them continue to raise the level of the event on an ongoing basis.", "q1r": 5, "q2": "The information provided and the key indicators are sufficient, although it would be good if there were some easily accessible record of the event previously funded in Fund7 and its videos, as they say they are going to do in this second event.", "q2r": 4, "assessor": "z_assessor_1093", "no_vca": 11, "ne": 1, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 1265, "q0": "Yes, the proposal effectively addresses the challenge.\nThe team has managed to assemble a fantastic lineup of cardano influencers and CNFT projects with great communities. Both the influencers and the projects bring about eyeballs to the festival and in the process give fantastic exposure to participating Japanese artists.\nAlso with such established folk as the centre of attention, I think the quality of the content will be assured. \nTo add to that, the visiting Japanese folk are easily funnelled to the discord server hence giving further opportunities for collaboration and education.\n", "q0r": 5, "q1": "The team has the required experience to successfully implement the proposal.\nTeam members have experience in project management, video & event production, document translation and stake pool operation.\nWith all the events and speakers lined up, the implementation of video production, translation, subtitling and marketing in my opinion is the easier part in terms of implementation.\n", "q1r": 5, "q2": "Although the number of Youtube views is a sufficient way of auditing progress, it doesn’t give the auid team the exact impact made in Japan.\nAlso I’m not sure how the team plans on tracking the number of CNFT creators entering the space. \nMy suggestion is to track the number of Japanese folk joining discord by a simple announcement with ‘country flag’ reacts.  \nOne other way is to create a channel for Japanese language chat and track the members on that channel.\nOne last way is a shill channel exclusive for Japanese art on Cardano.\n", "q2r": 3, "assessor": "z_assessor_1330", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3811, "q0": "The proposer wrote well the identification of problems and challenges that needed to be solved with the aim that cardano was increasingly recognized by the public in Japan and could be widely used. The focus is on the introduction of NFT, which has become a hot topic, especially among artists, to protect their works from piracy and ensure their authenticity. The CNFT Festival got the right moment with the Blockchain Expo which is the largest Blockchain expo event in Japan. Everything related to the NFT and Cardano Blockchain will be translated into Japanese so that more artists or creators can save their work in to CNFT.", "q0r": 5, "q1": "The festival is held by presenting several experienced speakers in 3 days. The working team have qualifications and experience implementing projects and are already utilizing cardano and working for the community. It would be better if all team members included a linkedin or other link to verify each other's expertise. The use of funds is detailed, but the implementation of the work in the use of funds calculated in those hours should provide a date of start of work so that it is easy to evaluate because we can see for example that video editing takes 200 hours or 8 days more, while the closing time of the festival is May 8, expo started taking place on May 11. So the plan to broadcast this translated video to the blockchain expo will be late.", "q1r": 3, "q2": "The success of the project is well described and can be measured by the number of youtube viewers and the number of artists joining the CNFT environment. And this is a continuation of the Cardano NFT Art Festival project. It's a good idea to also distribute the clips through Instagram, Tiktok or other social media that are widely used to attract more viewers in Japan. As well as providing implementation progress in the form of reports through the community website and distributing it through telegram groups.", "q2r": 4, "assessor": "z_assessor_1681", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5552, "q0": "The proposal wishes to create an annual CNFT Festival for the Japanese Cardano community in order to inspire Japanese artists to join the blockchain space and later on the NFT space. For the Festival they will be organising an online event stretched throughout several days, with speakers from all over the world, who are already implicated in the Cardano or CNFT space.\nThe proposal’s objective aligns with the challenge brief and has the potential to positively impact the Cardano ecosystem.", "q0r": 4, "q1": "The team has a detailed plan for each of the events, all the guests are planned, the time is set, it looks like they have everything planned for launch. The budget is broken down for each segment, with number of hours and skills included.\nThe team members who will be creating this event have provided us with sufficient backgrounds of their skills, although they have not  put up any links to their previous work for verification, but they have given the link to the event.\nFrom the details provided, it looks like the team has budgeted the funds realistically and has the necessary skills to successfully implement the project.", "q1r": 4, "q2": "For the progress measurement, I find they could have provided more objective metrics to assess them independently, but even as they stand right now, they are enough for a basic assessment of progress. For example: the number of people watching the events live, the numbers of people watching afterward, number of comments, number of social media mentions, number of Japanese artists joining the NFT space as a whole etc.  \nThe success description is well written, with clear milestones presented.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7847, "q0": "The proposer wants to bridge language barriers (Japanese & English) through the NFT art festival. The impact of NFT ( with visual / music / other media ) will gain awareness from the masses to the Cardano CNFT and as a whole - as it will be broadcast at Japan Blockchain Expo.\n\nThey also have a plan to overcome the challenge to keep this event to continue in the future - with maintaining engagement via AMAs and Discord channel and paying the labor cost for all the resources needed (translator, video production, etc).\n\nAs a suggestion, to align with the Campaign - they might want to focus more on collaborating with CNFT artists or teams in East Asia i/o with the US or EU-based CNFT artists and speakers, a bigger portion for every future event (Ex. start from 50/50, and raise East Asia up to 80/20 in the future). This will help East Asia Cardano Community as a region the recognition they deserve within the global community.", "q0r": 4, "q1": "The Proposer team has the relevant skill and experience to implement this proposal successfully, with various backgrounds from event organizing, CNFT artist, translation, up to experienced Cardano Community Manager and Ambassador in Japan.\n\nThe budget is broken down in detail, and it is in a middle range which is reasonable with the target output they are looking for.\n\nAs for the timetable, my understanding is after the live session (CNFT Festival) they have about 2 days to produce the videos, translate, etc and broadcast at the Expo which is a bit tight but doable with given experiences.", "q1r": 5, "q2": "The proposal/project progress is measured in a simple quantitative using YT viewers and CNFT creators who join the space, as a CA I would suggest this achievement or progress can be easily tracked by the community either through a GitHub page or Cardano forum thread. They also collaborate with another team (Cardano EXPO) Japan to make this proposal have a higher chance of success to gain awareness", "q2r": 5, "assessor": "z_assessor_646", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8021, "q0": "To overcome the cultural and language barriers in Japan through the creation of NFT art is the problem to be solved in this challenge it helps the people here better understand Cardano. To solve this problem, the author has connected the Japanese / British community with the annual Cardano NFT art festival in Japan with domestic and foreign artists. The goal of the project is not only to help people better understand the ecosystem, but also to attract new people to join the Cardano Blockchain through NFT. I think this proposal not only effectively addresses the challenge, but it also identifies a strong need in the community and future growth of the entire Cardano ecosystem.", "q0r": 4, "q1": "I find the author's project implementation plan very neat. From the guests to the time of the officers are listed in detail and clearly. (The opening conference, guests, moderators, singers....the issues of the opening date and time are listed in detail by the author). The funding required for this project is $15,000, detailed by the author for each small item with amounts corresponding to each item to be spent. The group consists of 3 main members: Timothy Vang, Yuri Hayashi (Yunya) and Yuki Oishi (Adviser). Through the group's profile, I see the author clearly lists what the group's current work is doing and the number of years of experience of each member. With a lot of useful information listed in the group I believe that if the project is successfully funded, it will come to them.I find the author's project implementation plan very neat. From the guests to the time of the officers are listed in detail and clearly. (The opening conference, guests, moderators, singers....the issues of the opening date and time are listed in detail by the author). The funding required for this project is $15,000, detailed by the author for each small item with amounts corresponding to each item to be spent. The group consists of 3 main members: Timothy Vang, Yuri Hayashi (Yunya) and Yuki Oishi (Adviser). Through the group's profile, I see the author clearly lists what the group's current work is doing and the number of years of experience of each member. With a lot of useful information listed in the group I believe that if the project is successfully funded, it will come to them.", "q1r": 3, "q2": "Measuring the progress of the project by uploading YouTube Videos about the author's CNFT Festival in Japan through which we see the number of views and the number of followers. To know if the project is successful or not, after the festival lasts for 3 days, we will know the success rate of the group. The project's video is a demonstration of powerful potential. This project is a brand new project and is waiting to be funded.", "q2r": 3, "assessor": "z_assessor_649", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8178, "q0": "According to the proponent, there are linguistic and cultural gaps in the adoption of Cardano. The best way to overcome cultural and language barriers is through the creation of NFT art. The solution is to connect Japanese/UK communities with the annual Cardano NFT Art Festival in Japan featuring local/international artists. The event will also be broadcast at the Cardano booth at BlockChain EXPO, the largest BlockChain IT event in Japan. There is clarity in the description of the problem and the solution presented and proposed is appropriate to the challenge. If this proposal is successful, it will solve the challenge of growing the Asian community by inspiring current artists in Japan to participate in the Cardano Blockchain through NFT and fostering the community by how to bring together successful Cardano projects from around the world to share knowledge with the Japanese Community. One good thing about the proposal is that it anticipates the possible challenges and risks, and has a suitable solution for all of them.", "q0r": 5, "q1": "The proposal presents an extremely detailed plan, with 2 face-to-face conferences to be held in 2 days May 7 & 8, 2022. The proposal presents all the details related to the conference to make it easy for me. visualize time, scale, and content. presented at the conference. Besides the 2 live conferences, the proposal also holds the events of the 3-day CNFT Festival that will be broadcast on screen at the BlockChain EXPO in Tokyo Cardano Booth (the largest BlockChain IT event in Japan), These are the proponents who will prepare CNFT promotional materials and distribute them at the event, as well as answer questions about CNFT at the event. The requested budget is fully aligned with the plan, making it easy for the community to check budget disbursements. The 3-member project team Timothy Vang, Yuri Hayashi and Yuki Oishi have provided enough evidence to demonstrate the skills and experience required to implement the proposal, it would be more interesting to know the profiles of those involved.", "q1r": 4, "q2": "A very detailed plan is presented, the proponents have the experience and skills to execute the project and the required budget is reasonable. Key metrics are provided, which can lead to a measure of the success of the proposal. This proposal is a continuation of the Cardano NFT Art Festival sponsored by foundation 7 https://cardano.ideascale.com/c/idea/385123 which represents the organization of a festival that has an appeal to the audience. with the community. With the above reasons, I have enough grounds to evaluate the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10228, "q0": "In my opinion, NFT is a great way to onboard non crypto people to use them. Admittedly, Cardano and its CNFT is lagging far behind other blockchain in this regard. Being active in NFT space for this past 5 months I also felt that Japan in particular also have low numbers of projects and/ or artist doing NFTs.  \n\nA CNFT festival can be useful to address this problem. While this won't be a be all end all solution to the problem, a festival can raise awareness of non crypto people to its function and how can interact with it for their need. I probably preferred if the festival is conducted offline, but probably it is not as easy to do this with pandemic limitation.\n\nThe proposer plan to use youtube videos and to be active in discord will also ensure the festival will have a longer shelf life.", "q0r": 4, "q1": "Being a continuation of a previous proposal (I am not sure if it is funded or not), the plan in the proposal is already quite detailed. I think much effort has already been done to organize the event.\n\nThe team behind the proposal also does look to have the experiences and connections to execute it well. ", "q1r": 5, "q2": "The proposal goals are easily measurable but so I think it it sufficient to audit its progress and success. \n\nI still think there should be more to be done to promote CNFT. This is not only the responsibility of the proposer but also the whole Cardano community in general.", "q2r": 5, "assessor": "z_assessor_846", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We will bridge Japanese/English communities with an Annual Cardano NFT Art Festival in Japan with local/international artists.", "experience": "11 Years Project Manager/8 Years Events Coordinator for the DOD/Catalyst Fund 7 Winner\n\norganizer of CNFT Community\n\n8 years Accountant in Japan/Cardano Ambassador/Catalyst Fund 2/7 Proposal and Winner"}