{"id": 403756, "author": "sabrinaliu47", "title": "Cardano Community Hubs in Taiwan", "url": "https://cardano.ideascale.com/a/dtd/403756-48088", "category": 26444, "amount": 9240, "description": "There is small interaction among CARDANO community members in Taiwan, and there are few opportunities for face-to-face interaction.", "f6_no_assessments": 13, "f6_rating": 4.282051282051282, "videos": [], "media": [], "f6_assessments": [{"q0": "Taiwan is one of the most developed Asian countries, and an extremely important technology player in the world (TSMC, Asus, Biostar, Acer, BenQ, Dlink, ADATA, AOC, etc), but with little participation in Cardano, which makes it a huge potential market to develop.\nBeing Sabrina, such an active member of the Cardano Community on Twitter with the DOG pool, and her experience organizing and participating in different large events, the impact of these monthly events will be very positive for the entire Cardano community, so as to adding new members and consolidating existing ones.", "q0r": 5, "q1": "Reviewing the proposer's experience, it is clear that she is very committed to Cardano and knows our community first hand. Also, watching the video you can appreciate her experience in large scale events, so I have no doubt that the project being presented will be successful.", "q1r": 5, "q2": "The proposal includes the creation of a Cardano Hub group, where to upload photographic records of the events carried out, so that the audit process can be carried out perfectly.", "q2r": 5, "assessor": "z_assessor_1093", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "Taiwan is a country with a nice banking and financial system, so less people invest in cryptocurrencies. Therefore, there is still a lot of space for CARDADNO to develop in Taiwan. Having monthly presential events like this can make the community more interactive and give Cardano members the opportunity to collaborate among them, therefore this kind of events can have a very positive impact and it is very much needed.\n", "q0r": 5, "q1": "According to her past experience in events, besides ASIAN pageants, volunteer work, student exchange and video editing, It is not difficult to realize that she is an outgoing, active, meticulous perosn and very suitable for coodinating this kind of events. Organizing events need a lot of prior arrangement and planning to make them success.  With her personal experience of participating many large events, it would be easier for her to plan and coordinate every details in advance. Besides, being an active CARDANO Community member , she is absolutely the right person to organizing events and I believe she can handle the them successfully.\n\n", "q1r": 5, "q2": "The proposer provided the number of participants in each event as the basis for auditing, so the criteria of auditing will be based on the the number of people that attend the event with photos, videos provided, name of the attedees and so on, and I think it is fully in line with the auditing criteria and it´s totally auditable.", "q2r": 5, "assessor": "z_assessor_1245", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge and helps with grassroots community building in Taiwan. This can also serve as a template for other Cardano enthusiasts to expand the model into various other parts of Taiwan.\nI think the proposal would have greatly benefited from mentioning a document that consolidates details about Marketing, community building activities, road blocks, etc. This would act as a roadmap for others to start their own hubs as well.\n", "q0r": 4, "q1": "Given the experience of the proposer as a community manager and participant in various high profile events, I believe they are well equipped to implement the proposal.\nI do think giving a more detailed breakdown on how the event would be conducted along with icebreaker activities to aid the community interactions would have fetched a higher score in my opinion.\n", "q1r": 4, "q2": "The current audibility criterion is only photos during the event, which is very limited. I’d strongly suggest including feedback forms, a shared excel sheet (at the least) with sections for skills, projects attendees are working on, contact info, stake pool operators (if any) etc. This would help the community reach out to one another if there is something they can collaborate on or add value to.\n", "q2r": 2, "assessor": "z_assessor_1330", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal raises the issue that currently in Taiwan, there is little interaction and Cardano community members have very little opportunity to meet in person. So they want to host monthly Cardano community hubs to facilitate networking and attract new people. Therefore, this proposal is in the directions of challenge and appropriate. The solution is to host on-site events that positively impact Cardano developers, investors, and enthusiasts. In this impact section, she also gives KPI project evaluation criteria such as in the first 3 months, each seminar has 30 students participating; the next three months, the number of students participating increases to 60 and the next six month, 80 students will participate. These quantities are workable and measurable. Besides, she also introduced the risk that there is covid and the alternative is to organize online, so the proposal also saw the risk and anticipated, came up with the alternative.", "q0r": 5, "q1": "It is proposed to give milestones after 3 months, after 6 months and after 12 months which are very detailed and specific but do not match the above KPIs, for example: from the 3th month to the 6th month, KPI is 60 participants/event but here are >40 participants/event; or from the 6th month to the 12th month, 80 participants/event, in this section, it is 50 participants/event. The proposed team needs to agree on this number for accuracy so that it can be counted at the end of the tally. The cost of the detailed proposal is clear, but the hourly rate of 20 USD/hour is suitable for students working overtime. In which, an important part is missing, which is the remuneration for speakers who have experience and knowledge in the field of Cardano and Blockchain to lead the event and attract participants.", "q1r": 3, "q2": "The project has measurable information that is the number of events, the number of event participants with each stage that can be measured. This part I agree and find it suitable for challenge.", "q2r": 4, "assessor": "z_assessor_1632", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "I like the idea of the proposal, which aims to bring knowledge to Taiwanese community and strengthen the connection between Cardano community and newcomers. These meetups and seminars organized by Cardano members play an essential role in increasing awareness of Cardano in particular and blockchain in general to Taiwanese community. As the host has strong relations with other Cardano industry professionals, I believe the hub will maintain and enhance a good network.", "q0r": 5, "q1": "Proposer has provided a timeline when each event will be organized, as well as budget breakdown for each  task. \n\nHowever, I think there are 2 things should be considered:\n- What specific topic will be presented/discussed in each events?\n- What strategy to take place if the number of audience decrease after 2 months and they prefer online meeting, that could lead to redundancy in renting cost.\n- Link/reference to proposer's experience in Cardano ecosystem should be provided.", "q1r": 4, "q2": "I think there should be more methods to assess the progression during the developing phase. Posting images from the event is insufficient because it's in the launch phase.\nThere also should be more metrics to keep track to better evaluate how success would look like. For example: \n- Feedbacks/commemts about the events.\n- Interaction level in the group chat\n- Increasing in the number of Taiwan proposals.", "q2r": 4, "assessor": "z_assessor_1693", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The Cardano community in several East Asian countries including Taiwan is currently small in size, mainly communicating through social media platforms such as Facebook and Line. The proposal raised the idea of organizing presentation events for Taiwan Cardano community members to interact and collaborate with each other. Through events, developers, investors, and Cardano lovers will have the opportunity to learn more about Cardano such as new projects, Dapps, CNFT... thereby attracting people to learn about Cardano, become a member of the Taiwan Cardano Community. The idea suits with the challenge's goal of growing the Cardano ecosystem in East Asia.", "q0r": 4, "q1": "The proposal has set out a plan to hold a monthly event for 12 months, from the first to the 3rd month each event has more than 30 participants, from the 3rd to the 6th month each event has more than 40 participants, from the 6th to the 12th month each event has more than 50 participants.\nHowever, the proposal does not detail how long the event will be held, what content will be exchanged during the event, who the speakers at the events are, who will be invited to attend, etc. It is recommended to detailed and specific in order to implement successfully.\nThe required budget is $9,240 including expenses for 12 events such as logistics, photo editing, video, snacks, drinks, organizers…but no speaker cost yet. The costs are quite reasonable.\nProject staff is only 1 person who is a student with 3 years of experience in organizing university social events, Co-SPO for DOG Pool, has close relationships with other experts in the Cardano industry . But she did not specify what major she studied, how knowledgeable about blockchain and Cardano. On the solutions section it is mentioned that some of the Cardano Community developers and Catalyst project proponents are invited to share their experiences, however, the planning section does not see who the guests at the events are. There is no charge for this. Therefore, recommend that the team should invite blockchain and blockchain and cardano experts to share knowledge and experience in the event, the event will be more successful.", "q1r": 3, "q2": "The proposal gave numbers as the number of event participants as a criterion to evaluate the success of the event: the first 3 months, each event more than 30 participants; The next 3 months, each event 40 participants; The next 6 months, each event more than 50 participants.\nThe above numbers are specific, the community is easy to check. However, in the evaluation KPI section, other numbers are given: in the first 3 months, each event has more than 30 students participating; in the second three months, achieved participation of more than 60 students for each event; In the latest 6 months, more than 80 students participated in each event. The proposed team should provide consistent numbers so that after completed it will be easy to evaluate.\n", "q2r": 4, "assessor": "z_assessor_1768", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This activity is in line with CHALLENGE, I am very happy to promote such activities in Taiwan, I have always felt that Taiwan, South Korea, China ´s  participation in CATALYST is not high, if we want to strictly examine the name of this CHALLENGE is East Asia according to WIKIPEDIA actually only includes China, Japan, Mongolia, North Korea, South Korea, Taiwan, unless it is changed to Southeast Asia, East Asia, then strictly speaking, this Many projects on the challenge may are not correct. As one of the true seven countries of East Asia,Taiwanese are more introverted and don't like to compete with others, so they seldom participate in Catalyst projects and give the opportunity to others, so that is why there are so many projects from other countries try to get the fund from this Challenge, which I believe cannot really be promoted to people from these countries. So this Cardano community hubs in Taiwan is really in line with this  Challenge´s goal.", "q0r": 5, "q1": "Based on her personal experience of attending large events in the past, I think she will be able to host or arrange this event, In addition to beauty pageants, volunteer work, student exchange, and entering the selection finals, it is possible to examine whether a person has the characteristics of love, patience, perseverance, determination, independence, decisiveness, overcoming difficulties, and problem solving to plan, conduct, or host an event. As we can see from the photo, she also attended the CARDANO SUMMIT event in Taiwan last year, so she is a brighter figure, plus her experience in the Miss Asia pageant, she will be able to attract more people to attend the CARDANO event, so the feasibility for this event is very high.", "q1r": 5, "q2": "We can use the video and pictures of the event to examine or audit whether the proposer has achieved the goal of success, the number of participants and the number of registrations , and from her personal video clips we can also see that she has a very high demand for video shooting and details, and we believe that she will successfully complete this project with the same rigorous attitude.", "q2r": 5, "assessor": "z_assessor_1866", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposer realizes that there is small interaction among CARDANO community members in Taiwan, and there are few opportunities for face-to-face interaction. Hence she proposes to host monthly Cardano Community Hubs in Taiwan to facilitate connection among Cardano community members and to attract newcomers. Through the events organized, the Cardano community may be more connected and strong but I wonder whether the number of newcomer attending the community could be increased a lot or a little. In general, this model can be implemented for long time but we have not yet had the particular calculation on the Cardano value gained as to newcomers after the hub organization. I evaluate this criterion at mark 4.", "q0r": 4, "q1": "Firstly, it is not clear whether the members attending the proposal have good enough experience in Cardano. They are the students from 1 university, have some skills through the competition, exchanging program. The host of the events could be described more in details of skill and experiences related to the field they present.\nSecondly, I do not see the detailed content of the presentation. The proposer can show an example for the presented content, since this may affect to the presentation quality and then the attraction to newcomers.\nThe proposer has particular KPI to evaluate the success of the proposal, which is expected to last in 12 months. She also considers the risk may be faced with is the affection of Covid-19 resulted in the impossibility of event organization. In this case, the event will be organized online, which may not attract people as many as when the event is organized directly.\nThe estimated cost for this proposal is 9240 USD broken down into logical items.\nIn general, I appreciate the clear brief of budget and success evaluation but expect to learn more from the proposer about the skill and competence of the team members as well as the particular content of the hubs expectedly organized in 12 months. I give mark 3 for this criterion.", "q1r": 3, "q2": "This proposal has main schedule to develop and also target for each phase in totally 12 months. It is expected to attract 30+ people per event in the first 3 months, 40+ people per event in the next successive 3 months and 50+ people per event in the last 6 months. The KPI to evaluate the success is the number of people attending the event. As for me, the author could use some other KPIs to evaluate such as the interact level of Cardano community, the number of newcomer attending per event. In general, the proposal is clear and can be described more in details to raise the fund. I evaluate this criterion at mark 4.", "q2r": 4, "assessor": "z_assessor_1870", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The problem being less interaction among Cardano community members and less opportunity for a face to face interaction in Taiwan\nThe proposer is trying to resolve this by Hosting Cardano Community Hubs monthly in Taiwan. This does help to increase the interaction among community members and will also be helpful to onboard new people by introducing them about cardano eco system.\nThis proposal do identify a issue which needs to be resolved. The proposal add value to cardano eco system by increasing opportunities for community members to meet new members and also by adding new people to the ecosystem. The goals of the proposal does align with the outlined challenge settings.\nThe proposal can be scaled to meet the future problems by increasing the frequency from monthly to weekly and also increasing the marketing to onboard new members.\nBased on the above observation the proposal effectively addresses the challenge   ", "q0r": 5, "q1": "Based on the information given in the proposal the proposer does have the relevant experience and required skills to execute the proposal. The proposer hasn't mentioned any team members in the proposal based on this I believe the proposer alone will be heading the proposal but they have already mentioned in the budget breakdown things needed to be done to implement the proposal and there are lot of things that goes into hosting and heading it alone will be very hard and I would suggest to form a team. The proposal does consist of a detailed budget breakdown and the budget looks practical to implement the proposal. The proposer has given a clear step by step timeline to achieve the goals which seems realistic and achievable. The proposer has taken account of resources needed to execute the proposal. The proposer has considered the covid risks and challenge that may effect successful implementation of proposal and have also provided a solution of taking it online. Based on these above consideration I believe it is highly likely this proposal will be executed successfully", "q1r": 4, "q2": "The proposal does consist of a Key Performance Indicator with a clear timeline. The proposer has give a detailed targets to achieve and each with a deadline this will be very helpful to audit the proposal and to measure the effectiveness of the monthly hosting. In the proposal the proposer mentioned that they will be creating a group and will be posting images of the event this does help to track the progress of the proposal. The proposer has provided a clear understandable solution for the problems. The proposal does consist of a detailed budget breakdown which intern will be helpful for auditing. The milestones mentioned in the proposal is balanced without promising too much and the budget asked seems reasonable. With all these observation I believe information provided is sufficient to track the development and the success of the proposal", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal would be an addition to the cardano ecosystem as it'll:\n- create a space where old and new Cardano lovers will mem meeting\n- facilitate in person meet-up\n- create an opportunity to share information and resources through the hub\n- Attract new members to join the Cardano ecosystem and learn new info about it.", "q0r": 5, "q1": "The proposal would have a chance to successed but few interrogations may bbe raised:\n- how will that space (physical hub) be sustained after the period of the project^\n- Only one person as proposer, they may be overwelmed with work. Why not increase the team?\nAnother element, no information is given about the area where the hub will be installed and the reasons of the choise of that location.", "q1r": 4, "q2": "One of the risksk mentioned is the possibility of resurgence of the Covid-19 pandemic that may affect the project.\nWith that scenario in mind, wouldn't be preferable toplan a hybrid system (physical and online) hub. This would allow an easy switch in case of the pandemic, but also would allow peoplel who live far from where the hub located to participate, but also those who may not be regular physically.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposer wants to host monthly face-to-face interaction within the Cardano Community in Taiwan to connect and to attract newcomers that align to the Campaign challenge to gain awareness about Cardano and Blockchain technology in general. With a small community, these small events will gather people and if managed well, it could be a good start for Cardano Taiwan.\n\nThe proposer is also aware of the pandemic / covid situation if it gets worse by mitigating using online events. ", "q0r": 5, "q1": "With experience organizing social events in the past,  the proposer should be able to execute the event accordingly with the help of part-time organizers. The budget requested seems fair and within the low-to-mid-range areas which are reasonable. Maybe breaking this proposal into up to 6 months events will mitigate the risk of any Force Majeure event or any economic downturn in near future plus prepare a contingency plan (and cost) for that.", "q1r": 4, "q2": "The proposer offers group chats to track the events which should be improved by creating a more common platform within the Cardano Community;  either a GitHub site,  Cardano forum threads, or an \"official\" blog/medium post.  ", "q2r": 4, "assessor": "z_assessor_646", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "The proposer has stated clearly the problem as small interaction among Cardano community members in Taiwan, and the solution is to host monthly events in Taiwan to facilitate connection among the community members and also attract newcomers. The main aim and expected impact is that face-to-face interaction would unite everyone and make the whole community more interactive. The proposer wants to achieve impactful goals as getting first-hand information about the latest news in the Cardano community like dApps, CNFT, and interesting projects; face to face Cardano developers, investors from various fields in Taiwan will interact with one another; as the community grows, they can have a stronger impact on the outside world to encourage viewers to join in building the ecosystem. \nIn addressing the challenge, the proposer mentioned that they will promote and enhance interaction in Cardano community in Taiwan; allow Cardano members from different fields to interact and learn about Cardano projects; provide space where Cardano community members have the possibility to participate in some projects and find business opportunities; invite experienced Cardano developers to share experience; and hold events once a month for 12 months. KPIs are clearly stated in the proposal. \nThe main risk mentioned is that in case the Covid situation worsens, face-to-face events cannot be held and online events will have to resume. \nWith these details the challenge is effectively addressed and hence my 4 star rating of this category.", "q0r": 4, "q1": "There is a detailed plan outlined shows monthly meetings broken down into groups with the expected number of attendees. First, three months expect 30+ attendees; 3 to 6 months expect 40+ attendees; 6 to 12 months expect 50+ attendees. However, I think an agenda with specific duties or activities should have been added. \nBudget breakdown shows cost of logistics, part-time organizers, materials, and preparation, among others have been clearly stated in the proposal. \nThe Proposer's credentials are stated as being Miss Asia 2020 Intelligence, Volunteer, AFS participant, Co-SPO for DOG Pool in Taiwan. \nI recommend that the proposer will collaborate with other experienced organizers of blockchain events to help her deliver effectively. ", "q1r": 4, "q2": "The proposer stated that there will be a startup of Cardano hub group chats where images from the event will be posted for views and comments. The road map shows the three months intervals of meet ups with the expected number of people to attend as 30+ in the first 3 months; 40+ in the 3-6 months and 50 + within the 6 to 12 months. \nSDG ratings were not chosen and I recommend that SDG rating could help to add more impact to the proposal. KPIs were not listed in this category, hence my 3 star rating for this category.", "q2r": 3, "assessor": "z_assessor_688", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Based on what I see in Indonesia, building community with the same interest, Cardano in this case, could accelerate growth and onboarding. While nowadays meetings can be done online, there is something lacking without actual in person meeting. This proposer is very much aware of this need.", "q0r": 5, "q1": "Event organizing does not require computing skills, but definitely need a lot of passion and persistence. Judging only within this proposal, I think the proposer have enough experience and also the connections needed (by being previously active in Cardano online community, event, and also have SPO connection) to organize it properly.  ", "q1r": 5, "q2": "The proposer plan to report the progress of this proposal only by updating images to group chats is not adequate. \n\nI would like to suggest that the proposer also made a recording of the talks and/ or discussions happening and posting it on social media. This way, events can both be audited more easily and also the recorded documentations can be available to public as well.", "q2r": 3, "assessor": "z_assessor_846", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Host monthly Cardano Community Hubs in Taiwan to facilitate connection among Cardano community members and to attract newcomers.", "experience": "Host: Sabrina Liu\nMiss Asia 2020 of Intelligence\nVolunteering in 2019 Overseas Youth English Service Camp Zhongshan Elementary School\nParticipate in AFS exchanging program in Ounsdale High school in 2018\nCommunity Manager of DOG Pool"}