{"id": 405015, "author": "victorcorcino", "title": "Win-Win Japan Expansion", "url": "https://cardano.ideascale.com/a/dtd/405015-48088", "category": 26444, "amount": 15000, "description": "Legal tech platforms such as Win-Win need to do some research to localize their products according to other countries' laws and culture.", "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is very relevant and fully aligns with the objectives of the challenge. The idea is to expand the activities performed by the Mediators.ai platform (formerly known as Win-Win) to Japan. A good snippet of the proposal that might sum up what Mediators.ai is “a decentralized dispute resolution platform and marketplace built on the Cardano blockchain. It allows disputing parties to find a suitable mediator to help resolve their dispute in a timely and cost-effective manner outside the court system.” That is, people seek to resolve their conflicts by avoiding bureaucracy and involving blockchain technology in this action, through so-called mediators. The problem here is that this platform has much more scope in the United States for the simple fact that most of the team that makes up the administrators of the platform is from there, so it is much simpler for them to perform activities in an already known system. . It is said in the scope of the proposal that in order to expand this activity to different locations, a study is necessary, because as I have already mentioned, each country has its own laws and its own operating logic. Therefore, the proposal is based on doing such a market study, a research that makes the evolution of the Mediators.ai platform safe. I think this aligns with the challenge because it would help the Japanese a lot, as the opportunity to solve problems in a more transparent and less bureaucratic way would be available to them. Also, it would be an extra income opportunity for those who become mediators. In addition, this project, if successful, will certainly be a good way to popularize Cardano across the country. So both Japan and our blockchain would benefit, we know that it is necessary that all proposals are interesting in order to give return to Cardano. Another positive point that we can take into account is: the team at Loxe Inc. already carried out an expansion in Latin America, so they already have some previous experience with the issue of evolving their activities, molding them in a new context. With this, a lot of security is passed that this new stage will also be a success. \n", "q0r": 5, "q1": "I found the proposal script quite simple to understand and very detailed. We know the activities that will be developed each month, they are listed in a linear order and that allows us to have a very solid view of the process. I don't think more detail would be needed in the case of this proposal, so I consider that the development process is already very explicit. Regarding the funding requested, of 15 thousand dollars: the amount is quite compatible with the complexity of the proposal. It is not cheap, but at the same time it is fair in the sense of providing the remuneration necessary for those involved in the proposal to work properly. The total amount is apportioned based on participant salaries (Japanese mediator compensation: $2,000/month + mediators.ai team member as part-time support: $2,000/month + mediators.ai platform location for Japan: US $3,000). I think the only thing I would like to suggest to raise the level of understanding of this part even further is: the hours that the mediator and the mediators.ai support member would work on this project could have been reported. How long in the weeks would they devote themselves to this? I believe that if this information had been passed on, we would have had an even more specific view of the budget. Now talking about the team, there is a lot of trust in each of the professionals involved. We know their names, areas of academic training and professional performance, as well as we have listed several activities/tools/projects that they have already been involved in. They are very experienced people in what they do and also very active within the Cardano community, so I believe they would be very capable of successfully developing the proposal. Therefore, I will give maximum marks for feasibility, because despite the observation I made about the working hours of those involved, I think the information that is attached is enough for us to understand very well what would be done, how, by whom and for how much money. . Not to mention the fact that the proposal is an evolution of a pre-existing project, and that in itself has already contributed a lot to trust that this new stage will work. \n", "q1r": 5, "q2": "The auditability of this project is very high. To monitor the process, the team states that it would use a methodology called Agile, I don't particularly know this methodology and I think it would add a lot to the explanation of this issue if it were briefly explained. However, what we are really looking for is for the team to take responsibility for delivering partial results to the community, and they promise to do this through monthly meetings with the IOG coordinators, which are standard procedure in our ecosystem. It would be interesting if these reports were available for the community to consult as well, especially the Japanese public, which I believe would be very engaged with the project. Now talking about the final results, the proponents inform in a very rich way what is targeted in the 3, 6 and 12 month periods. We know the number of institutions and mediators that are targeted, so we have a good understanding of the level that the proponents want to achieve. In addition to such quantitative data, I would like to suggest that after a certain period of funding, when they are already relatively stabilized in the Japanese market, a survey be carried out with those involved in the project to understand two things, firstly so that conflicts would be resolved in a more transparent, secure and faster way. Second, I think it is very fundamental that we understand exactly how this project helped Cardano to become popular in the country in question. Could it be that we are seeing an increase in the amount of Ada in circulation, new digital wallets are being created, in short, was this a way for the Japanese people to understand one of the possibilities of using blockchain technology? I think that if this research were done and delivered to the Cardano community, the level of auditability would grow even more. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "This proposal not only effectively solves the challenge, but also makes sense for society. As disputes in cyberspace become more and more intense, Win-Win, a decentralized dispute resolution platform, can solve this problem. decide that. Win-Win was highly rated and appreciated by the community at F6, then expanded to South America at F7, clearly showing the app developer's growth. The development of a dispute resolution application in Japan, helping users to understand and be confident, choose the most suitable mediator for themselves, as well as help mediators build a personal brand, share, help increasingly civilized and advanced society.", "q0r": 5, "q1": "with the experience, skills and planning described above, along with a developed Win-Win application, ready for testing and integration, there is a high probability that the proposal will be a great success. The proposed team has proven their track record not only in F6, F7, but through their involvement in the community has given the community confidence and confidence in their abilities, largely the work done is complete and integrated, the rest is optimization. Besides, they also see the challenges and risks with their smart solutions. Development roadmap and reasonable budget for a potential proposal.", "q1r": 5, "q2": "The information provided is enough to successflly evaluate the proposal, the team uses Agile methods to manage and track the development progress of the project, so it will be flexible, specific, interactive and integrated to achieve the goal. fastest spending. What I most want is for the team to propose and add the NPS index through an index that can evaluate the quality of the mediator, thereby making more appropriate and timely adjustments, helping the application develop more and more. , contributing to the development of community and human society...", "q2r": 5, "assessor": "z_assessor_1533", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Expanding Mediators.ai into Japan at the stage of research on how how to approach that expansion and which Alternative Dispute Resolution organisation or mediators to put on board, while using the Cardano blockchain at which the mediators.ai (Win Win) is developped on .\nImpact:\n- Use of the cardano blockchain to develop a needed service in a new country (Japan)\n- Use of the research results to best develop a service that suits the reality of the region\nGoing to Japan is an expansion of the service from other countries, which demonstrated the scalability.", "q0r": 5, "q1": "There may be a typo in the proposal where \"India\" is mentioned in lieu of japan, which may confuse readers (Under challenge section)\nThe team of proposers is composed by various expertise in research, technology, computer, programming, ...and with some members being involved with the Catalyst project foor a certain time, with previous funded proposals, with this one being the continuation. The success rate is high.\nThe plan defined and budget detailed. ", "q1r": 5, "q2": "Thhhe main phase of this project as I read is focusing on research, and based of the results, the indicators are presented on a road map of 12 months:\n- board a number of institutions and mediators into the Mediators.ai\nThe community would be able to track the project implementation through the montly meetings with the Challenge team, which would be great for people to get updated\nNo major risks have been mentioned  by the proposers probably   bssed on their previous experience is some other regions where Win-Win was implemented, however realities may differ based on the results of the research in Japan, and the team would have to adjust to that.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposer offers a solution in the legal / dispute resolution service and marketplace within the East Asia Region, focusing on Japan to save time and costs for the disputing parties outside the court system. Unfortunately, they have not shared any backup facts or data to support this proposal - especially how is the dispute resolution condition in Japan. And why expand in Japan from other countries in East Asia was not clearly explained.\n\nUsing Cardano-based solutions as decentralized legal marketplace services are very interesting project to develop in East Asia and will raise awareness to Cardano in general if succeed. I am not sure why the proposer mention the Indian-focused dapps/service and connecting a local mediator in India as the main challenge while they plan to implement this in Japan - is it a typo? Although agreed in most Eastern Asia countries there will be ALOT of local custom and cultural barriers to overcome. ", "q0r": 4, "q1": "The detailed plan given is very clear and the team needed to implement is mentioned both in the proposal and on their website (more details on their whitepaper) with a reasonable budget and timeline. With vast experience in dispute resolution, software engineers, and as Cardano Ambassador the team experience should help this project to succeed. One note though since the team is in the US time zone, while the mediators will be in Japan, the proposer must consider the difficulties of maintaining the intense discussion between them and the Japan team (including governments working hours?)\n", "q1r": 5, "q2": "The proposer describes a clear milestone and targets they want to achieve with an easy-to-track report about their progress to implement this proposal in a timely manner. With 12 month timeframe, there should be enough time to adjust and adapt to the cultural barrier (if any) and the time zone limitation. As ADR is a very complex matter yet depends on the human side, interesting to see how they will board the Japan mediators and build the solution from thereon.", "q2r": 5, "assessor": "z_assessor_646", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Being a high impact dApp from Cardano to solve real life problems and improve human life in general, there is a high chance solution such as mediators.ai is need on foreign market outside of USA. Japan as one of the most developed and advanced countries are promising market in term of value and adoption. Japan is also no stranger in Cardano and one of the most prominent nation-state in term of ADA holders which should making introduction and penetration easier due to warmer audience there. Law in Japan and US, although fundamentally different with Japan being civil law country and US being common law country, still shares few commonalities. Due to reasons above, I can see some mutual benefits and positive impact for Cardano and Japanese population arising from the implementation of this proposal. On a totally separate topic, proposer may want to double-check before assessment and proofread before submission to avoid mentioning other country name in a proposal designated for a specific country. An honest mistake that is not affecting my rating. All love to Japan and India including the Cardano communities there!", "q0r": 4, "q1": "Loxe Inc. has experience in writing many proposals and it shows on this one (including the exhaustion). The best thing I can do is walk us through the mandatory three parts on this aspect which are timeline (usually accompanied with the deliverables on each period), budget breakdown, and the team capabilities. Overall, the three parts are presented well and on-standard for a Catalyst proposal writing practice. Looking at the timeline and action plans, I found no issue since they look realistic and necessary to achieve good implementation of this proposal, especially partnering with universities are a great way since lot of talents we can recruit and support us with good contributions to some degree and also example cases that can help us research the necessary information. Budget also looks solid and rates are normal and according to local standard. For quick (probably non-relating) comparison: a fresh bachelor graduate in Japan likely gets monthly salary of USD 2k in 2022. Based on the soft fact above, figures in proposal could afford decently experienced associate-level for part time support for the sake of this proposal implementation, just justifying my rationale a bit here. Moving on to the team, we can see the usual suspects from Loxe here. Experiences are abundant and we can skate to their LinkedIn if curious. Fun fact, Matthias the CEO holds an associate degree-equivalent in Japanese. I know from reading Loxe ADR whitepaper available on their website. So yeah, I am serious about this. There is a small risk mentioned but the reward could be greater so probably nothing.", "q1r": 4, "q2": "Loxe Inc has lots of skin in Catalyst so I really trust them doing their best to deliver every proposal Catalyst funded and working hard to achieve satisfying results on each of those. Everyone in the team is a highly experienced professional with involvement in tons of projects. I believe they are expert in Agile or Scrum they are using to manage and monitor progression and they are not the type to miss the report or meeting with Catalyst or IOG team. Their social media are also rich so community can receive regular updates there and ask few questions too. The choice of metric and KPI are good and suitable to measure accurately the implementation of this proposal. Success seems modest but fitting the budget they requested and stellar delivery of this proposal might be extremely meaningful and valuable both to Cardano community and Japan people in general in the long run.", "q2r": 5, "assessor": "z_assessor_943", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Outreach universities, legal bodies and local governments in Japan to expand and localize Win-Win services.", "experience": "Loxe Inc. team, Sr. Software Engineers, Plutus Pioneers, Gimbalabs PPBL veterans, legal experts and dispute resolution specialists."}