{"id": 405214, "author": "metafrontier", "title": "DID Business Ideas Hackathon", "url": "https://cardano.ideascale.com/a/dtd/405214-48088", "category": 26444, "amount": 30000, "description": "Asians do not have the opportunity to think about business ideas in Cardano, so there is less development.", "f6_no_assessments": 5, "f6_rating": 2.933333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal can have a huge impact if done successfully, attracting Asian Enterprises by showing business ideas and opportunities possible in Cardano environment. Mixing together 20 business people and 20 undergraduate student sounds like a good brainstorming. The mix should also bring together both the business and academic world, and raise a great awareness in their own separate rings.", "q0r": 4, "q1": "With the lack of details given to the team members, the detailed budget, as well as the detailed timeline, one can clearly see that it is hard to foresee that this project can be run on time and on target. The proposer can improve a lot in the Feasibility part by detailing on the above (team members, detailed budget, and detailed timeline).\nOne interesting part about this proposal is while it mentions DID (I assume: Decentralized Identity), I could not find any explanation about how DID is going to be used. The proposer can give a better connection between title and the body of the proposal. The proposer should also pay attention to questions coming in Ideascale (especially on this matter) and try to address those.\n\nThe proposer introduced the link to [https://www.metafrontier.inc](https://www.metafrontier.inc/) for the team, but not much information about the team nor the skills and experience that can be extracted from the website. It shows however that the company was established only very recently, on 14 February 2022. \n\nThe proposer should pay extra attention to the correct name of team members, as well as summarizing the profile, instead of just copy-pasting the information from the website.\n\nBudget wise, it is understandable on the amount allocated for the prizes of the competition is in a big lump sum, however, it would make a much better proposal if a detailed estimation can be provided for the ‘labor cost’, for example, how many hours are going to be spent on how many members in the team.", "q1r": 2, "q2": "While the Impact can be huge, the plan of auditability seems low on this proposal.\n\nSome KPI/metrics (i.e.: weekly updates) are introduced, which can be improved by introducing some numbers as the measurement. The measurement and numbers can also be developed into milestones that can be tracked publicly.", "q2r": 2, "assessor": "z_assessor_1208", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This is a project with high impact for East Asia as it brings one of the strongest Cardano products, DID and Atala PRISM, to developers who can have a dedicated hackathon in their own community and own language. I am sure after organizing a hackathon, there will be one or several \"killer apps\" that emerge from this. The challenge setting is asking how we can attract more users in Catalyst and Cardano in East Asia and a dedicated event like this can be the highest return on investment for this, better in my opinion than just community events, language translation and videos. I score 5 for impact out of 5, and 5 for challenge alignment out of 5.", "q0r": 5, "q1": "The company and proposer behind this idea are established and have credibility to pull it off. The business plan, timeline and ambition of the goal as a \"business-idea-athon\" is not what I was hoping for when reading the idea high level outline. It is not very thought-to-the-end and seems more like idea at this stage. A more organized event like hackathon of other blockchain or oracle would have been better. I think that the team can do what they say, but the final product could be less excellent than I was believing after reading the problem and solution statement that will be the only thing the voter can see.\nThe translation is a little bit strange and not sure if the level of the event is what it could have been with more local partners involved. The roadmap is quite clear but ratio of labor cost to prize money is high.", "q1r": 3, "q2": "The KPI is sparse and hard to make a good audit over the 4 months preparation period. Response time for website inquiries is not provided. It will be nice that the proposers plan to attend Eastern Townhall every 2 weeks but unfortunately they say it is only \"if possible\". I think they make a good attempt but should have given more detail. \nShowing some understanding of DID and PRISM application and making some content format or categories to show performance of the applicants and participants and planning the event better is missing.\nTranslation is not necessary in Catalyst for this Auditability category. Provide more numbers for audit.", "q2r": 3, "assessor": "z_assessor_1405", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal meets the challenge requirements by promoting Cardano in Asia by gathering 20 students and 20 business people and incentivising them to come up with creative business ideas that can be built on Cardano.  This would be expected to improve knowledge of Cardano and potentially provide business opportunities for people of Asia.\n\nThe proposal indicates the winning ideas will be publicised, but does not contain any further plan for developing the ideas other than mentioning the hope that the ideas “lead to specific Catalyst proposals or implementations”.  It would be good to have some plan for how idea owners will be mentored/guided to have their ideas developed.", "q0r": 4, "q1": "The proposer says there are many team members, but only provides the name and experience of one member “Tuda”.  The experience for Tuda seems to match the experience of “TSUDA TORU” shown on the website linked by the proposal https://www.metafrontier.inc/ .  The proposal directs readers to their website to view “many very diverse and numerous team members”.  However, the website does not show these team members, only Tsuda Toru.  No linkedin or other job profile websites are provided.  This makes me uncertain as to the sincerity of the proposal and therefore feasibility.\n\nTsuda appears technically qualified in programming and various business ventures, but lists no Cardano expertise or previously running idea-a-thon / hackathons.  The proposer says they have created their own NFT platform, but evidence of this is not provided.  No NFT platform is evident on the website provided.  This also makes me question the proposal’s feasibility.\n\nWithout the involvement of Cardano expertise, it seems very unlikely a Cardano focused idea-a-thon would accomplish anything meaningful.  A fundamental part of the event is determining compatibility of the ideas with Cardano blockchain technology.  Cardano expertise is essential.\n\nA budget is provided, but not detailed.  The budget only shows a split between prize money and labor cost.  No indication of venue expense, signage/advertising, or any refreshments is provided.  \n\nFor these reasons I do not think this proposal will be implemented successfully.", "q1r": 1, "q2": "The proposal provides sufficient information to allow it to be audited, with a two month timeframe for acquiring attendees and 4 months to hold the event.  The proposer says weekly progress updates on these timeframes will be publicised.   The occurrence of the idea-a-thon event itself and the publishing of the ideas should be verifiable.  Overall, this proposal provides sufficient information to assess progress in attaining its stated goals.", "q2r": 4, "assessor": "z_assessor_1614", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "I love the Proposer's pre-work. Proposer already did dialogues and surveyed over 100 Asian companies about blockchain knowledge as a foundation of this proposal. I think this proposal will have a great impact as their Ideathon will encourage companies and business people to deep dive blockchain knowledge in Cardano ecosystem. But I think this proposal should be submitted in Business Solutions (B2B & B2C) as their problem and solutions aligned with Business Solutions challenge. Proposer can start it in East Asia, but as Proposer inform us about they have High PR Skills & Marketing and Planning skills as their weapons, if this projects get a funding, proposer can submit a follow up proposal to expand in bigger areas to have much bigger impact.\n\nOutside of that, the \"DID\" in their title really got me. I tried to find about Decentralized Identity (DID) but I find nothing. I believe it's a typo thing.", "q0r": 4, "q1": "Love that proposer's well-written and an interactive website. The budgets are reasonable but not broken down. Since the proposer didn't explain about their team (only their Co-President), and the asking labor cost was $10k, it might be a good thing to explain what the money was used for (example: marketing budget, event budget, etc). Proposer was not explaining about their timetable either. Maybe create some simple feasibility timeline can help Ideascale's reader understand what will you doing / what progress have you done.", "q1r": 3, "q2": "The KPI are too simple. Proposer only have 2 metrics (written in Impact column): Complete the audience attraction within 2 months, and The event will be held within 4 months. Since proposer already have a pre-work (like surveyed over 100 Asian Companies, inviting business people, etc), maybe proposer can write key metrics such as: number of companies / business people / undergraduate students applying the Ideathon, number of ideas submitted, etc.", "q2r": 2, "assessor": "z_assessor_639", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposer identifies an important problem but do not share the factual data to back its findings - it would be great if the proposer share the 100 Asian Companies feedback about blockchain knowledge, even with hidden names/entity. To focus in raising awareness amongs the corporate world would be beneficial to Carano Ecosystem and Community as a whole, and this small to medium scale (about 40-80 people+) event with in-depth discussion which involves both business people and undergraduate (young) people is a very good idea and can act as incubators which proposer explain it the top 5 (out of 200 ideas) will be delivered into Catalyst Funding", "q0r": 5, "q1": "The proposer unfortunately do not share the details of their complete core team how to make this proposal implementation successful, other than the key person Tuda, which more into IT background and Business Enterprising. Checked into their website also do not have a team member details, so it's very difficult to assesed. A mitigation plan / or risk also not clearly mentioned in this proposal.\n\nA breakdown of funding requested also not given, which give me as a CA very difficult to asses the budget is reasonable or not - where the proposer asks for prize money 2x as the labor cost - but there is no breakdown budget for the event itself (venue, meals, etc) - it also not clear if the event will be done offline or online.", "q1r": 1, "q2": "The proposer seems to prepare the proposal in the same template, so as a CA i found the same \"issues\" with other proposal submitted which the proposer lack of a detailed plan or timeline. A KPI metrics although mentioned, but not clearly given, other than to try achieving the KPI (not so clear which one). I would suggest the KPI should be in numbers / qualitative so we as community can easy track the progress - such as number of participant for each category (business people, undergraduate, experts) for instance measuring invited vs attending and what is the success rate of top ideas becoming funded in Catalyst Project.", "q2r": 1, "assessor": "z_assessor_646", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Organize a business idea-a-thon to encourage business ideas.", "experience": "We have created our own NFT platform and have experience in development; we have 12 years of experience as an IT company."}