{"id": 405289, "author": "accelerate2030", "title": "Cardano for Asian impact ventures", "url": "https://cardano.ideascale.com/a/dtd/405289-48088", "category": 26444, "amount": 15000, "description": "Lack of in-depth knowledge of exact needs of impact entrepreneurs in Asia, and awareness of how blockchain solutions can be of help", "funded": 1, "upvotes": 45020504, "downvotes": 919263, "votes_result": 44101241, "votes_cast": 150, "f6_no_assessments": 3, "f6_rating": 4.5555555555555545, "videos": [], "media": [], "f6_assessments": [{"id": 8079, "q0": "\"Asian startups are growing fast these years, there are a lot of disruptive ideas were founded and developed every year. But, with the development of blockchain technology, its impact on the Asian entrepreneur communities is still not too much impressed, particularly on the Cardano platform. This project will help Asian companies and entrepreneur communities to understand blockchain technology's impacts better, and develop new strategies for their business with blockchain technology. As the proposer provides in the proposal, this project will deliver 3 practical activities to help to make their objectives. And the provided content is very clear and detailed in actions, places, objects, outputs... to help the community have a well understanding of their values to Asian entrepreneur communities. Moreover, the proposer also state their concentrated goal of expanding Cardano adoption in East Asia with this project. Going with their metrics I believe that this project will help to make an extraordinary impact on the Cardano ecosystem in Asia. \nLast but not least, making a good output from surveying is always hard and that's their big challenge in this kind of project. But they did have a plan to offset this challenge well. \"", "q0r": 5, "q1": "\"From my experience with this kind of project, the team did have a great and detailed implementation plan that is shown in the proposal. This project will be run in 4 months from May to September 2022 with tasks that I believe will support their objectives perfectly. The proposer does not only provide a well-detailed explanation about tasks in each month, but also clear deliverables and outputs. Hence, I think this plan is suitable for the scope of this project and has high feasibility. \nIn addition, the budget is outlined with groups of activities that fit with their implementation plan and I think it's reasonable. \nLastly, the info of founders/ co-founders of this project and key persons that are in the proposal can help me to believe that they're the best fit for this project because of their experiences, abilities. Going with their clear and detailed plan above, I appreciate rating this proposal with 5. \"", "q1r": 5, "q2": "The team will set up a monitoring and evaluation plan to help the community track their progress based on the project plan and attached KPIs. I believe that these KPIs are tied to their objectives and well-aligned with the objective of the challenge and clear enough to help track. Moreover, as their content about success picture for this project I believe that is very easy to understand what they want and help the Asian companies to get that highly relevant to their needs. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1, "reply": "Thank you for the review."}, {"id": 10194, "q0": "The proposal matches the requirements and criteria of the Challenge. Proposal to partner with Accelerate2030 - a global program to support entrepreneurs from developing markets. I went through the website, the profile of this organization, and really saw the vast network of Accelerate2030. If Accelerate2030 combines with Cardano to introduce blockchain to entrepreneurs in Asia, I believe the speed of Cardano awareness and blockchain adoption will increase rapidly. In this section, the proposal mentions that the opinion of a group of 50 entrepreneurs will be examined on the use of blockchain to improve traceability, supply chain management, identification and payment, measurement, then conduct seminars to introduce the Cardano blockchain in Asia. In my opinion, 50 entrepreneurs are not too big a statistic. Therefore, in order to provide highly reliable survey results, Accelerate2030 needs to select 50 influential entrepreneurs in Asia who are entrepreneurs in many fields and are able to apply blockchain in business models. of their business.\nI appreciate Accelerate2030's thoughts on this proposal. Accelerate2030 has considered the risk of difficulty in collecting survey responses if there are no compelling benefits attached. And Accelerate2030 has come up with a solution to this problem. With that solution, I think, you should explain Project Catalyst and the benefits a business can get through this project before inviting them to take part in the survey.", "q0r": 5, "q1": "Accelerate2030 offers a specific, and careful step-by-step plan to introduce Cardano Blockchains to entrepreneurs. One thing I'm worried about is the implementation time is only 4 months, isn't it a bit short? Because the connection of surveys and seminars takes place in many parts of Asia, I think you should take precautions against the impact of the Covid 19 epidemic.\nRegarding the budget, the proponent has specifically listed the work items and implementation costs. I think if possible you should list more details.\nRegarding team members, I have looked at the information written in the proposal and information on the website, your team will probably have no difficulty implementing this project.", "q1r": 4, "q2": "Indicators to measure success are given specifically, but if you can give specific KPIs, it will be much more convincing.\nAnd Accelerate2030 should provide a way for the community to track progress and compare actual results and KPIs (e.g. publicly reporting results on the Accelerate2030 website, periodically reporting progress during Catalyst meetings, for example) term...)", "q2r": 4, "assessor": "z_assessor_823", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for the review."}, {"id": 10686, "q0": "Currently, the business community is not paid much attention on Cardano. This is a project that has a very good idea of connecting more with this community. The current project focuses mainly on surveying, however, I highly appreciate the development potential of the project. (my score: 5)", "q0r": 5, "q1": "The project has a clear implementation roadmap and the participants are all experienced. However, the project should give a more detailed plan on how to support businesses in applying blockchain and Cardano in their businesses and assess the impact of that. (my score: 4)", "q1r": 4, "q2": "The project has a specific disbursement, but the measure of success through each stage of the project is still not specific (as the project mentioned, it is difficult to estimate). However the project should still have a minimum goal to be achieved. (my score: 4)", "q2r": 4, "assessor": "z_assessor_969", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Thank you for the review."}], "solution": "Research impact entrepreneurs' blockchain needs, offer intro workshops & develop concrete use-cases to increase adoption of Cardano in Asia", "experience": "Accelerate2030 is a global program supporting entrepreneurs from developing & emerging markets to scale their solutions for the Sustainable Development Goals. Launched in 2016 by Impact Hub & UNDP from Geneva, implemented across 33 countries, supporting nearly 500 entrepreneurs"}