{"id": 405218, "author": "metafrontier", "title": "Web3 x Cardano ADA Cafe in Japan", "url": "https://cardano.ideascale.com/a/dtd/405218-48088", "category": 26444, "amount": 50000, "description": "There is no place to meet and discuss the use of Web3 despite that collaborations between web tech person and Cardano person is necesarry.", "f6_no_assessments": 5, "f6_rating": 2.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 467, "q0": "According to the proponent, cooperation between the web tech staff and the Cardano staff is necessary, but in Japan there is no place to meet and discuss the use of Web3. So having meetings and seminars is really important. The solution is a coffee shop where people can hold meetings in person or online. This proposal is on target of the challenge because I think this implementation is core to the Cardano community, which will help more developers to come to the playing field and grow the Cardano ecosystem in Japan.\nAs the proposal mentioned crypto-asset-based cafes have a history of operating while prices are booming, but closing when prices are down, and the team also argues that there are plans to reduce costs. of Cardano & Web 3.0 Cafe to the limit and create a model that can withstand a drop in price. It would be good if the proposal could be transparent about what the above cost reduction plan is, and how it can be countered with the price drop if the market is volatile.", "q0r": 4, "q1": "This proposal does not provide a roadmap with milestones. The proposal states that the cafe will be opened within 2 months and maintained for 1 year from the date of opening. It would be better if the proposal provides details such as the start date, location and size of the shop, strategies for maintaining the shop and how you can get the community involved. The $50,000 request budget represents 33% of the entire challenge's funding, but it's explained in a rather general way. In order for the community to be easily auditable, I think the proposal needs to clearly list each item with the amount spent in more detail. Examples of labor costs: how many people will be hired, how long will it take, the cost per hour worked? What are the required equipment and other costs that the proposal talks about? This proposal does not have a link between the budget by workload and labor, making it difficult to assess the feasibility of the budget.\nRegarding the project team, it is described that there are so many members on the team that it is impossible to write them all down and only list one key member, which is president Tsuda Toru. After reviewing his profile, I agree that he has the appropriate experience and qualifications to undertake this project. His work can be easily understood through the link https://www.metafrontier.inc/. However, this proposal lacks a detailed plan that would greatly affect the testability of the proposal. For the above reasons I do not think this proposed possibility will be implemented successfully.", "q1r": 2, "q2": "With that said, this proposal does not have a specific roadmap, has no budget breakdown nor describes specific actions, so it is difficult to assess the progress and success of the proposal. The nice thing is that the proposal provided key metrics to measure that seemed doable and a good indication of a successful challenge setup. It would be great if the developers put in some more data on the number of participants (growing month by month) and the way this changed so voters can see how many people depend on it. This proposal is a completely new proposal that has never been funded before.", "q2r": 2, "assessor": "z_assessor_1167", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1271, "q0": "The proposal in my opinion needs to give more clarity in terms of the uniqueness of the Cardano cafe.\nThese are the questions I’d like to see answered:\n1) How is this better than finding an existing cafe and making it a local spot for the cardano community to meet? (Having web3 books is unique but seems to me it can be implemented in existing cafes)\n2) Adding an explanation how interior design can aid more ideas and collaborations.\n3) How does the cafe aid in interactions with the community outside of Japan? (Eg: Conference space where Townhall meets are live streamed, Computer access for small groups to discuss Catalyst proposals etc.)\n\nI do think there is a merit to the idea if the cafe itself is named after Cardano or ADA. This will serve as a publicity tool and bring more eyeballs.\nTo add to that, it can possibly become a great hub for a budding catalyst community.\n\n", "q0r": 3, "q1": "I give a rating of 2 for implementation because there are not enough details presented.\nIt’d really help the proposal if the expenses are broken down further.\nEg. Rent per month, List of equipment and individual costs, Interior design cost, Number of employees and salaries, etc.\n\n\n\n\n", "q1r": 2, "q2": "Yes, weekly updates are sufficient to audit the progress of the proposal but I think this section also needs to be broken down in detail.\nWhat do the progress updates include? (Month 1: Interior design & employee recruitment, Month 2: Equipment sourcing and set up etc.)", "q2r": 3, "assessor": "z_assessor_1330", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6426, "q0": "The issue being lack of location for people to meet and discuss about web3 Also it is necessary that web tech persons and Cardano person work together The proposer is suggesting to provide In-person or online meetings in the cafe The In-person meeting or seminar is real important to increase the collaboration between the web tech Person and Cardano Person This also helps to reduce the issue of not having locations for people to discuss about web3 This will be also helpful to onboard new people into cardano ecosystem by introducing them about the opportunities available in cardano and also to onboard new people who are already interested in web3\nThis proposal does addresses the challenge and helps to resolve it It also addresses how it will add value into the cardano ecosystem\nThis proposal will be able to address the future challenge of lack of locations for real meetings by partnering with more restaurant operators and increase number of locations for in-person meetings. Therefore this proposal does effectively address the challenge ", "q0r": 5, "q1": "Based on the details provided in the proposal and after visiting their website provided in the proposal. The proposer has a very good experience in the web3 space but it would have helped a lot if the proposer had provided any details on previous work in cardano related project if any. Based on the above analysis the proposer has enough experience to implement the proposal successfully. Based on the proposal the proposer knows the type and team members required to implement the proposal. The proposal doesn't have a clear detailed budget breakdown. Without the clear budget breakdown it would be hard to analysis if the budget asked is reasonable to meet the set targets. The proposal consist of rough timetable to complete the work without much detail. The proposal does describes the resources required to implement the proposal.\nThe proposer has explained all the risks and problems they would face to implement the proposal and have also mentioned how they will be deal with these challenges. After above observation the proposer and their team have enough experience to implement the proposal but without a clear detailed plan this proposal somewhat likely to be implemented successfully", "q1r": 3, "q2": "As per the proposal the proposer will be providing a weekly updates on the project to the public But the proposal doesn't consists of a clear roadmap with milestones and also they have provided a rough time horizon to achieve the goals. The proposal doesn't consists of detailed key perform indicators to define the success of the proposal. The proposal does \neffectively addresses the problem but fail to explain a clear plan on how they will be implementing it. They have provided a rough budget and also rough timeline without the detailed budget breakdown and detailed step by step timeline it would be hard to track the progress of the proposal. Based on the above observation the information provided won't be enough to audit the development and the success of the proposal", "q2r": 2, "assessor": "z_assessor_419", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7853, "q0": "The proposer raise an idea to open a web3/crypto friendly cafe in Japan but not clear about the benefit for the Cardano community in general. The cafe might become a cool place to hangout for Cardano or other crypto community, but as a CA I have not see any fresh idea or uniqueness of the cafe other than a specific web3 / crypto interior design. With the pandemic still in horizon, proposer aware of the risks but have not provide it's own mitigation plan to keep the cafe open with backup concept. ", "q0r": 3, "q1": "The proposer unfortunately do not share the details of their core team to make this proposal implementation successful, other than the key person Tuda, which his experience are lacking in food and beverage business, but heavy on IT and entrepreneurship. The budget shown also not breakdown into more details that as CA can asses to see if it is reasonable or not. If the proposer can add details on these informations, it probably a good niche market (although not a new idea) to bring this into the market and focus not only with Cardano Community but a web 3 builders in general.", "q1r": 2, "q2": "The proposer unfortunately do not share a detailed plan or timeline to be assessed regarding this proposal. A KPI metrics although mentioned, but not clearly given, other than to keep the cafe alive for 1 year. I would be great if the proposer can elaborate the goals at least in  short & medium term for me as CA to understand the steps or milestone and what are the cafe wants to achieve in numbers.  ", "q2r": 2, "assessor": "z_assessor_646", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 10193, "q0": "The project to build online and offline coffee shops is a meeting place, conduct seminars related to Cardano and the web 3. The idea is quite interesting. However, the impact on the expansion and connection of the Cardano community in East Asia in a specific and logical way has not been clearly stated. Proposer mentions increasing the number of Catalyst proposals to 5 or more in a year. However, there is no basis for this data.", "q0r": 3, "q1": "The coffee shop will be opened after 2 months and maintain operation for 1 year.\nIn addition, there is no detailed plan to build a Coffee shop. I think the proponent should have a more specific plan. For example, in 2 months, for an offline Coffee shop, there will be stages such as searching for premises, designing, purchasing materials, building, taking over, creating menus, recruiting service staff... For an online coffee shop, it is built on the website platform, there are stages such as web ideation, interface design, feature programming, content creation, test implementation, editing, and completion... Each stage will have a specific completion date. With the plan stated in general as in the present proposal, it is difficult to assess the feasibility of the project accurately.\nIn terms of costs, the proposed budget is $23,000, however, there is no detailed spreadsheet. The budget is only the sum of the cost of labor, equipment, and other expenses. The budget should specifically state each cost corresponding to each work item, which will be more logical.\nRegarding the composition of the team, it would be great if the proponent could write down the information of the main active members and have a link to the CV, proof of experience, and skills. I understand that your team can be very large, but we need more information about the implementation members before we can check if your experience and skills are suitable for the project. Mr. President Tuda is really a very smart person, with very good experience and skills, but he will definitely need the support of other experienced members as well. We hope that you will clarify the member information more clearly in the next fund.", "q1r": 2, "q2": "The project's roadmap is not specified. Therefore, it is not possible to track the project progress.\nProponents describe how to measure project progress and development with weekly updates on project status that are publicly available and will receive inquiries through the website. Or the team will report in periodic Catalyst meetings.\nThese are great ways to measure progress, but it is difficult to ensure the accuracy of the information in the reports and the actual implementation. Therefore, we need you to provide a tool, a place where the community can track and check the project progress.", "q2r": 2, "assessor": "z_assessor_823", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "The real meeting and/or seminar is quite important. We will provide the good opportunity to real and online hybrid meeting on cafe.", "experience": "We are already working on the Web3Cafe concept with restaurant operators in Osaka and Kyoto."}