{"id": 380972, "author": "felixweber", "title": "Catalyst Swarm Operations", "url": "https://cardano.ideascale.com/a/dtd/380972-48088", "category": 26248, "amount": 8000, "description": "催化剂群需要资源来奖励除会议和活动之外的关键和重要的社区参与。", "funded": 2, "upvotes": 61219224, "downvotes": 4424347, "votes_result": 56794877, "votes_cast": 209, "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Swarm community initiative has matured into a thriving organism in supporting Catalyst's mission and its path towards Voltier. There is a need to give it a bit of team and firepower to take it to next level. The proposal has identified the areas of work and is addressing the challenge head-on. ", "q0r": 5, "q1": "The proposer is an active Catalyst circle member and an influencer in the swarm. The swarm is also performing major onboarding exercises to evolve the entire Catalyst movement to grow. With this experience, the proposal will likely be implemented in earnest. ", "q1r": 5, "q2": "There is no doubt that Swarm is performing a fabulous job and needs more resources to take it to next level. However, there is a need for an auditable KPI and codified task list to stand scrutiny in the future. It is going to be a long and hard march ahead and should not rely on purely voluntary efforts to move the caravan. Laying down parameters will help the movement in long run. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 23, "ne": 1, "ng": 18, "nfo": 4, "vca_o": 1}, {"q0": " Relation to personal qualifications: I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects    Also, I know the Cardano Ecosystem and ist actors pretty well by now so I am sure I can confidetly evaluate this ptoposal. The proposal identifies an important problem - the opportunity cost of voluntary work - and adresses it. We can clearly see the value the Swarm adds to the ecosystem and it would be a shame if their engagement got lowered because they'd have less time for financial reasons. It is clear that this proposal needs to be supported in order to support the current work of the Swarm and ist scalability.", "q0r": 5, "q1": "The Catalyst swarm are a really active and vital part of the Catalyst community. It can be seen all the time how much they do for the ecosystem and how they are basically ist backbone. While they are probably investing a lot more time than what is represented in the budget, it is still appreciate that they leave this space to other proposals and are modest in their demands. The feasibility of the swarm's work cannot seriously be doubted as it is so very present all over catalyst, which is the best proof that they deliver on their promises.", "q1r": 5, "q2": "As of it's nature, this Proposal requires no metrics. Auditability can however still be assessed, just by looking at all the other work that is constantly done by the swarm", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 5, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The SWARM sessions are a great success story in the decentralized governance wing. Is essentially the first community consensus platform I agree this needs to have some sort of permanent funding/tresury to continue the great work and expand it further.", "q0r": 5, "q1": "The team has extensive experience in the decentralized governance aspect here in project Catalyst and the value has been synonymous  to each fund growth and awareness.", "q1r": 5, "q2": "The funds and plans are quite transparent and have confidence this will be deployed successfully.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 23, "ne": 2, "ng": 10, "nfo": 11, "vca_o": 1}, {"q0": "I can see that this proposal focuses on forming a Catalyst Swarm Treasury to reward extraordinary and important services from the Community for the Community. This great and interesting idea is convincing and meaningful. The problem as well as the solution are clearly described, and explained in detail so that it addresses this challenge, shows the clear impact on the Cardano ecosystem as a whole in long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "This team description is unclear, without any personal profile provided, therefore, I can not see any proof of feasibility from the team profile. The budget structure is clear and quite logical, however, working hours and other calculation explanations are not provided [ex: why \"(A) Catalyst Swarm - The Maintainers - 2000 USD\" ?]. Besides, the risk is not defined. Therefore, based on the given information, I am neutral with this proposal's feasibility, I would rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of meaningful information, however, there is a lack of some important information, including: (1) Personal profiles of this team with external links for verification; (2) Budget explanation [working hours, for exam ple]; (3) Risk and mitigation. Therefore, based on the given information, I disagree with this proposal's auditability, I would rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 14, "ne": 2, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "Catalyst swarm has been a great resource for the entire community, the proposal goes into detail on the swarm teams plan to scale up their current operations.", "q0r": 5, "q1": "the team has a track record of delivering value to the catalyst ecosystem and a nuanced plan in place to deliver on this proposal's goals.", "q1r": 5, "q2": "There is information provided on current operations and future plans in this proposal. A team that's consistently provided a high level of value to the Cardano catalyst ecosystem. ", "q2r": 5, "assessor": "z_assessor_735", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "This swarm operations proposal could be placed in any Catalyst growth challenge and fits equally well in this misc challenge category.", "q0r": 5, "q1": "The team behind this proposal runs the catalyst swarm process following weekly townhall events. They present a sufficient plan to continue building out swarm resources for catalyst proposal teams/CAs", "q1r": 5, "q2": "The information provided is sufficient to audit the proposal progress and the team is top tier/deeply engaged in catalyst operations. ", "q2r": 5, "assessor": "z_assessor_736", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}], "solution": "创建一个催化剂群库，以奖励社区为社区提供的非凡和重要的服务", "experience": "全职社区成员、社区顾问、受资助的提案人、提案导师和催化剂专家、Cardano大使"}