{"id": 381388, "author": "vcoincheck", "title": "Project Evaluation Website", "url": "https://cardano.ideascale.com/a/dtd/381388-48088", "category": 26248, "amount": 16875, "description": "很多投资者因为投资于诈骗项目和缺乏客观信息而失去了资金，无法有效地投资。", "funded": 2, "upvotes": 64936281, "downvotes": 13114992, "votes_result": 51821289, "votes_cast": 333, "f6_no_assessments": 12, "f6_rating": 4.972222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "\"The number of projects currently on the crypto market is very large and eliminating scam projects and finding good projects to invest in is a real need. Most of the scam projects are very good at marketing, so investors are easily led by the fake information of those projects. This Proposal helps people answer important project-related questions for themselves is a great way to keep investors from being led by misinformation.\r\n\r\nIn addition, people can develop the ability to self-assess projects that they are interested in. This will help investors improve their knowledge and they can take full responsibility for their investment decisions.\r\n\r\nThis proposal also creates an objective source of information because the website's content is built largely from the community\"", "q0r": 5, "q1": "\"I can definitely see that the proposer and his team have many years of experience with analyzing projects on Cardano and others blockchain platform.\r\n\r\nEach team member's experience is highly relevant to the specific jobs listed in the proposal.\r\n\r\nThe Roadmap and KPI of the proposal are also very specific in terms of the number of people participating in the assessment and the number of reviews in a specific time, and with the number of community members of the team about 2000 people, the goal of the proposal is completely feasible\r\n\r\nProposer also specifically lists the risks that can cause the proposal to fail and the solutions for those risks\"", "q1r": 5, "q2": "The proposer has outlined the costs, roadmap and major elements of the work behind this proposal. All the information about the projects that have been evaluated, the number of people accessing the website, the number of people evaluating the projects on the website, etc. are displayed on the website which is a great way to track the results of the proposal. Anyone can check the success of the proposal easily.", "q2r": 5, "assessor": "z_assessor_645", "no_vca": 18, "ne": 4, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "The project is highly realistic, is the idea of ​​creating a website to evaluate and rate projects through asking questions for the community to contribute knowledge and multi-dimensional perspectives. This is an assessment tool based on criteria such as: identity of the project owner, technology solutions, tokenomics, influence of the project through communication. In addition, this is a repository of information about blockchain projects, and connects financial resources to quality projects.", "q0r": 5, "q1": "The project is highly realistic, completely feasible. When the project criteria and questionnaires are scientifically and systematically built, it will be helpful for the community to conveniently contribute their opinions to build a reputable project evaluation site, Currently, an evaluation tool like this is not available and is absolutely necessary to help filter quality projects in financial investment objectively.", "q1r": 5, "q2": "I have read KPI for the first 3 months of the project. I found this project's results completely testable by looking at the number of projects evaluated, the set of questions and evaluation criteria when it was made public. Also I appreciate the experience of the project founding team.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This is a proposal on evaluating and ranking projects with clear goals and implementation, KPI in 3 months of the proposal. The working team has many years of experience in the crypto industry, enough expertise to do it. It is hoped that the proposal will be implemented soon to make project information transparent and avoid risks for investors. This is the important data store of the entire cardano ecosystem, where an idea like this is not present in the ecosystem.", "q0r": 5, "q1": "The team has a lot of experience, KPIs and implementation methods are very clear. The goal of building a database of project information, and at the same time evaluating the project from the entire community, will avoid bias in evaluation. Funding for grant is also quite clear and reasonable in the first 3 months of the group.", "q1r": 5, "q2": "When this website started construction and users saw information on the group, we saw the number of projects evaluated from the community, the source of information through questions for the community to build a new style. richness as well as the quality of this information. The greater the number of constructions, the more objective and verifiable it is to be.", "q2r": 5, "assessor": "z_assessor_652", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The notion of building a website to review and grade projects by asking questions for the community to contribute information and multi-dimensional viewpoints is very plausible. This is an evaluation tool based on characteristics such as the project owner's identification, technical solutions, tokenomics, and the project's communication influence. This is also a collection of knowledge about blockchain initiatives, as well as a platform that connects financial resources with high-quality projects.", "q0r": 5, "q1": "The project is extremely viable and reasonable. When the project criteria and questionnaires are established in a scientific and systematic manner, the community will be able to easily contribute their thoughts to the creation of a credible project review site. Currently, such an evaluation tool is not available, despite the fact that it is critical for objectively filtering quality proposals in financial investment.", "q1r": 5, "q2": "For the first three months of the project, I read KPI. When the results of this research were made public, I found them to be totally testable by looking at the number of projects evaluated, the set of questions, and the evaluation criteria. I also value the project's original team's experience.", "q2r": 5, "assessor": "z_assessor_678", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is about building a website to help investors self-assess the projects they are interested in through questions to know if the project is good or not. This is a very great and useful idea. The problem is clearly described and explained in detail. The solution is clearly defined with a procedure of 02 steps and roadmap ad specific KPIs. This solution shows the clear expected impact on the Cardano ecosystem in short term and long term.\r\nTherefore, based on the given information, I strongly agree with this proposal's impact, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile, roadmap, and KPIs are clearly described. This all shows proof of feasibility. Especially, risks (and mitigation) were analyzed in detail.\r\nTherefore, based on the given information, I strongly agree with this proposal's feasibility, I can rate it with a score of 5", "q1r": 5, "q2": "This proposal provided a wide range of information with reference/proof (documents/links,...) for verifying. My only advice is: for better understanding, you should integrate KPIs into the roadmap; this would help the community easier to track this proposal's progress.\r\nTherefore, based on the given information, I strongly agree with this proposal's auditability, I can rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "This proposal seeks to help investors make the right decisions and invest profitably and avoid scam projects. This proposal can fit into Fund 7 challenge setting so that it can benefit the larger community globally. \r\nThe impact as stated in the proposal is to create objective information from communities and help everyone get rid of scam projects and find out good projects to invest their money.", "q0r": 5, "q1": "The team are blockchain experts who have analyzed a lot of blockchain projects and shared a lot of knowledge to communities. The team members have abilities suitable for the work. The detailed outlined plan shows that a website would be created where everyone can evaluate in the crypto market especially Cardano by answering questions about the project, thus helping people to get rid of scam projects. Sample questions are detailed in the proposal. This proposal can be implemented effectively.", "q1r": 5, "q2": "The road map showing 3 months of project work is very detailed with every assigned task. It shows the number of expected evaluated projects as 100 during the period. The budget breakdown is clear and comprehensive. Good proposal.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 14, "ne": 2, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The Crypto's uptrend season and the covid 19 pandemic have brought many people to the crypto world, but because of that, the number of investors losing money by scam projects is very huge. The reason is that there are too much scam, bad projects and investors themselves lack basic knowledge about blockchain to be able to distinguish whether a project should or should not invest. Proposal has outlined a solution to help investors avoid losing money through a project self-assessment website. Currently, there are also many websites or social channels that give project reviews, but they are very general. I was completely impressed with how the proposer rated the project when I checked out the clips they posted on the proposer's youtube channel. They evaluate a project in great detail such as team members, financial games, marketing activities, especially about the project's technology solutions (they perform technology evaluations based on document analysis and peer-review). knowledgeable people). If this model is applied to the website of the proposal, it will be a huge impact on the community. Through the website, the community can view quality, transparent and decentralized reviews because the assessment will be done by the community itself. According to the proposer's description, to see a review of a project, viewers must contribute to the community itself to get points and redeem points to see the project they want to see. I see that in the future this will become a large community and operates base on knowledge and transparency\r\n   ", "q0r": 5, "q1": "Proposer listed a team with 10 members. All their identity and experience can check through sources that provided by proposer. Most of the team members are Cardano investors since 2017 and some are SPOs, admins of the Cardano communities where they live. When I went to watch a clip of them that evaluating the Ergodex project, I was surprised when they evaluate this project in front of a community of hundreds of viewers within 2 hours and still haven't evaluate it all. Their review clip was even retweeted on Ergo's tweeter channel. It can be seen that proposal's team will work seriously to process their proposal because this team itself is also the admin of the communities. \r\nI also don't see a problem with the project's roadmap and KPIs. They are very detailed with full numbers achieved for each specific milestone\r\nThe funding breakdown is also detailed and reasonable to process the proposal.\r\nThe feasibility of this project is very high. I really like this project and would love to have the opportunity to participate in the evaluation of crypto projects on the proposal website.", "q1r": 5, "q2": "All informations to audit were listed in proposal:\r\nTeam member experience: Can join their telegram community and audit\r\nRoadmap, KPI, funding breakdown are detailed with specific number. We can audit through proposal website's activities.\r\n  \r\n", "q2r": 5, "assessor": "z_assessor_783", "no_vca": 15, "ne": 6, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal will help investors to get rid of scam projects. \r\nVcoincheck.io website is the page what posts crypto projects and investors can read, search  and review projects objectively.\r\nVcoincheck.io website not only posts crypto projects, but also evaluate these projects to be good or bad that investors can avoid and pick up good ones.", "q0r": 5, "q1": "The members of the proposal build the website platform and share knowledges of blockchain to everyones.\r\nBlockchain is a new technology. A lot of scam and good projects are existing disorderly.\r\nThe proposal relizes the problem by they create table of ranking evaluation in order to filter out scam projects. The way will bring valuable knowledge to investors that they can put their money to invest confidently.\r\nThe proposal is different with other website, share and shill projects generallly. However, vcoincheck.io evaluates every projects in detail and carefuly and pick up good ones.", "q1r": 5, "q2": "Through their roadmap, the process of building website is feasibility. They focus on evaluating more than 100 projects in 3 months firstly. These projects are evaluated by the member of the website and their communication. \r\nEach of week, the member of the proposal will evalutate more than 10 projects per week. And then after 3 months, thay can get 100 projects. The number is reasonable and their roadmap will be done promply.", "q2r": 5, "assessor": "z_assessor_818", "no_vca": 16, "ne": 3, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "Right from the start, the author of the proposal succinctly and efficiently explains to us the key issues involved in the analysis of a project by kols, youtuber and social media that misleading the investors.\r\nMy understanding is that there also certain of websites and mobile applications provide the scoring for the projects but the investors also don't understanding how such scoring process works. \r\n\r\nIt is the great idea to provide the framework (ie the yes/no questions) for investor to do their own evaluation and system will keep that work for others investors to reference. This proposal fit to the challenges since the investor can use to evaluate cardano's projects.\r\n\r\nOne points I would suggest is that the proposer consider to distribute the evaluation into blockchain then it show the transparencies of each evaluation (ie: could not edit, delete...)", "q0r": 5, "q1": "The proposal team clearly have the skills, range, and embedded-ness in their communities and they have experience in doing such evaluation, I believe they can implement the proposal well.\r\n\r\nAlso the team's diversity feels like an example of the proposal in action, which is good to see. Also, good to see the roles of the team so clearly defined\r\n\r\nThe timeline and milestones looks achievable since the most time consuming is the development of questionnaires which i believe they already have since they have done may evaluation already when I visit their youtube channel.\r\n\r\nIt would be great if the proposer provide in detail about the time consuming and rate charge by each people when doing the most important task of this proposal which is develop the questionnaire since the budget for this session is 10.500$ which is occupied more than 60% of total budget. ", "q1r": 4, "q2": "The KPI provided were clear and easy to tracking by the communitive. \r\n\r\nAs you said on the proposal, the more people do the assessment provided is more objective. The team should add more KPIs about the website visitors as well. Since visitors may not do their own assessment but they can refer to other assessment and verify it with the resource. \r\nLastly I hope you make it, I'm rooting for you and will be glad to be one of your future users.", "q2r": 5, "assessor": "z_assessor_819", "no_vca": 13, "ne": 6, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal indicate investor's problem directly. \r\nThe website will provide tools to clarify scams projects and helps investor to relize good projects so that they can put their money at right projects.", "q0r": 5, "q1": "The proposal' plan deploys clearly.\r\nThe member of the proposal will implement in 3 months. The timeline is devided properly so that each parts of the project would be finished on time.\r\nMoreover, the member's experience and knowledge can help to solve investor's problem through sharing knowledge, videos, feedbacks from community forum.\r\nThe proposal also has a special question list that can filter out scam crypto projects. This is  a special key that make the proposal be different with other proposals.", "q1r": 5, "q2": "Their plan is described carefully from the proposal's roadmap that the proposal can accomplish their timeline on time.\r\nInformation gets from the proposal that can achieve their mission to help investors to avoid scam projects", "q2r": 5, "assessor": "z_assessor_820", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This is a good proposal. It is proposed to identify the problem that many investors lose money because of lack of knowledge to recognize and evaluate projects, leading to high risks when investing. This proposal develops a tool to help investors self-assess the project and minimize investment risks. If this tool and website develops into multiple languages, I think it will help many investors in the world invest more safely and effectively.", "q0r": 5, "q1": "The proposal provide relevant documents explaining details about the upcoming project to be implemented and specifying the number of members and appropriate experience to build and develop the project.\r\nRegarding the implementation budget, the proposal clearly states the necessary details, but I think it will be easier to understand if a detailed spreadsheet is attached.\r\nThe proposal clearly states the plan, implementation method, and steps to use the project evaluation tool.\r\nHowever, I think the project needs more clarification on how to identify and manage the information that the community make and inputs to this Project Evaluation Website (for example, there is a reward system for users who detect poor quality information, and sanction, restrict access for users who contribute untrue information...). I hope the develop team will have more improvement initiatives to bring high quality assessment tools to the community.", "q1r": 5, "q2": "The proposal provide a clear development roadmap.\r\nThe proposal outlines the goals for each stage and the KPI for evaluating the goals.\r\nThe proposal a clear, easy-to-understand description.", "q2r": 5, "assessor": "z_assessor_823", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "A systematic approach, The \"filtering\" and \"clear criteria\" approach will help to shortlist the top Blockchain platform and then the Layer 2 project develop on top of that. This will save time, resources and provide quality information for the community. Thank you for sharing and love to see this idea in implementation. One question: is there any plan to incentivize the Community Member to join in the filtering process ~ similar like CA \"concept\" of Catalyst to leverage the strength of community members.", "q0r": 5, "q1": "The team member profiles were very well-published and each member shows experience and versatility in the blockchain overall and Cardano platform specifically.  The approach and demo website also very highly appreciated.", "q1r": 5, "q2": "The budget is well-broken into details and clear KPIs metrics and milestones to achieve the proposal stage. Also, it also showcases clearly the mechanism to attract the evaluators. One source of truth is the website to see the progress updated by this proposal", "q2r": 5, "assessor": "z_assessor_824", "no_vca": 17, "ne": 2, "ng": 12, "nfo": 3, "vca_o": 1}], "solution": "建立一个网站，帮助投资者通过问题对他们感兴趣的项目进行自我评估，以了解项目是否好。", "experience": "我们的团队从2017年开始加入加密货币市场，并做了很多关于分析Cardano和其他区块链项目的网络研讨会。"}