{"id": 383482, "author": "dcspark", "title": "Milkomeda ADA Audit", "url": "https://cardano.ideascale.com/a/dtd/383482-48088", "category": 26248, "amount": 40000, "description": "Milkomeda由多个未经审计的新概念组成，以Rust编写的Cardano包括多个开源组件。", "funded": 2, "upvotes": 112760382, "downvotes": 13980804, "votes_result": 98779578, "votes_cast": 276, "f6_no_assessments": 6, "f6_rating": 3.4444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a short and clear proposal from a superb team (ex-IOHK / Emurgo). Alligned with the challenge brief, funds are requested to audit this Protocol to provide EVM capabilities to Cardano, bringing value to ADA and the entire ecosystem (and by being open source, they provide value to all other projects too). This team has already demonstrated their aptitude and are more than qualified to receive funding, complete their protocol and release an incredible value that is currently locked on Cardano.", "q0r": 5, "q1": "The team is superb. Being in the code audit phase indicates that the protocol is almost finished, so its development and impact is not under discussion. (you can infer the quality of it too). While the Budget seems a lot at first glance, it is reasonable, audits for crypto projects are really expensive (and even if you have the money it's difficult to contract this service because of the demand and particularity of each project.). I think they may even come up short on money with this, but it will certainly be well used.", "q1r": 5, "q2": "Since it is a contracted service it is understandable the difficulty to present progress metrics, but the team is committed to present the audit reports to Catalyst authorities and through its multiple channels of diffusion (Twitter and official Web pages). If it were another team behind the project one would have to be more cautious, but I think this case is an exception and there will be no problems.", "q2r": 5, "assessor": "z_assessor_277", "no_vca": 19, "ne": 4, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Connecting Cardano to EVM is a great solution to scale and connect Cardano with other blockchain platforms, especially Ethereum. But I really haven't seen a specific plan, roadmap or a specific description of the product of the proposal, so I still don't really know how the product will be implemented and what the specific solution is. . Although the proposal wants to be funded to audit the project, the proposer also needs to be more specific about the product", "q0r": 2, "q1": "\"Proposer said their Team is composed of well known ex-Emurgo and ex-IOHK employees who have been building the Cardano ecosystem for the past several years but no evidence provided of team's experience and size of the team. Providing profile links, github pages or links to past projects your team worked on will boost voter confidence in your capabilities in making this project a reality. \r\nIn addition, a specific description of the project's product and roadmap is indispensable to know the feasibility of the proposal.\"", "q1r": 1, "q2": "\"There is no specific product description, no roadmap, No info has been provided to show how this project will solve the problems it wants to solve. There is no way to track the progress or success of this project.\r\n\r\nProposer said they plan to start the audit as soon as possible. They will release the final audit report to the community once we have addressed any issues found. But we don't even know what their product is\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 18, "ne": 2, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "This is a great proposal, introducing openness to existing developed projects. The impact is not doubtful will be significant to Cardano's ecosystem and ensure its interoperability with other ecosystems in the future. ", "q0r": 5, "q1": "Should include the audit time frame and who will be chosen to do the audit to check their capabilities. There's no risk at all with this proposal. On the other hand, it's important to find any risks or loopholes during the audit process.  ", "q1r": 4, "q2": "The proposers should add the communication channels to announce the audit milestones and results. Instead of checking the website, the proposers can use their other channels,  such as Twitter or Discord. ", "q2r": 4, "assessor": "z_assessor_647", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "This proposal focuses on auditing all components of Milkomeda that are required for the Cardano deployment. In the context of the Milkomeda project as a whole, auditing is required. However, the proposed detailed plan is still very abstract [no roadmap, budget distribution, KPIs, ...]. Therefore, based on the given information, I do not agree with the impact of this proposal, I can rate it with a score of 2", "q0r": 2, "q1": "Team profiles are provided and are descriptive enough to understand, with appropriate skills and experience to perform [composed of well-known ex-Emurgo and ex-IOHK employees], along with references/evidence (https://dcspark.gitbook.io/milkomeda/details/team) to verify. So the team's profile convinces me of the feasibility. However, this is related to the audit, therefore, some aspects should be clarified more: (1) Who/which organization will audit all components of Milkomeda ? (2) Budget breakdown should be provided in detail; (3) Milestones and KPIs/metrics. Therefore, based on the given information, I am neutral on the feasibility of this proposal, I can rate it with a score of 3.", "q1r": 3, "q2": "As mentioned, the team profile convinces me, however, this is related to the audit, so some aspects should be clarified more: (1) Who/which organization will audit all components of Milkomeda ? (2) Budget breakdown should be provided in detail; (3) Milestones and KPIs/metrics. As a result, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal outlines the auditing of different components that are used within the implementation of the Milkomeda sidechain. The Milkomeda sidechain helps to provide EVM support for the Cardano blockchain through the use of Milkomeda. Due to the amount of Ethereum and other EVM compatible applications the Milkomeda sidechain could see a large amount of growth and adoption. In that event the importance of ensuring the code is audited becomes increasingly important due to a growing amount of liquidity and information that would flow through the sidechain. Audits of the required components provides an impactful way to prove to the wider community the security guarantees of what has been developed by dcSpark.", "q0r": 5, "q1": "The team consists of people who have worked within or closely to IOG and Emurgo. The team has since created their own company  dcSpark and delivered on numerous proposals that were funded through Catalyst. The team has sufficient evidence of their skills and track record to deliver proposals. \r\n\r\nWhat is missing from this proposal is more information on who will audit this proposal as this really dictates how feasible it is that the components can be audited correctly. An indication or list of potential options would have been useful for advisors to gage that there are suitable options available that they already may have started talking too.", "q1r": 4, "q2": "The team suggest they will be starting as soon as possible. No KPIs or success metrics are provided. It would have been good to have more clarity on the auditing companies selected and process here as that would have given more confidence in how the community can review the audits that are made and what to expect. For instance each companies audit process is different so knowing which ones are options would reveal exactly what to expect in the audits based off their previous reports they have released to the public. Success outcomes could have specified the types of coverage that will be achieved from the audits.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 16, "ne": 4, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "Interoperability is the key to popular adoption of blockchain and cryptocurrency technology in general. Interoperable Cardano will also accelerate it to the mainstream tech as more people in crypto space will onboard the blockchain. Cardano as blockchain had promised, and so far delivered, safety and reliability as two major qualities it has and Cardano will need to maintain this achievement and reputation. As we are in the Basho era of scalability and interoperability, the execution of this proposal should match the timeline and the focus. Third party audit will be a necessary start to achieve this objective and as a community we can support this through Catalyst.", "q0r": 5, "q1": "Although the motive of this proposal is quite sound, we will need to see more detailed breakdown of plans such as the timeline, deliverables, service provider, etc. Still, the team behind dcSpark are well-known and reputable engineers who have the experience, knowledge, and skill capable of delivering this proposal's objective. Perhaps we will have more information on Fund8 if we could not fund this proposal yet in the current fund.", "q1r": 3, "q2": "It might be my lack of technical understanding as a layman but I cannot yet see the metric we can use the measure the success of this proposal. Perhaps attachment of example of audit report on a launched testnet or from different blockchain can make things clearer for most advisors. I am glad that I also get the opportunity to enhance my knowledge and understanding while assessing proposal, especially about sidechain from this proposal.", "q2r": 3, "assessor": "z_assessor_943", "no_vca": 15, "ne": 3, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "审计Cardano部署所需的Milkomeda的所有组件", "experience": "我们的团队由知名的前Emurgo和前IOHK员工组成，他们在过去几年里一直在建立Cardano生态系统。"}