{"id": 383705, "author": "despas.damien", "title": "ADAGLASS Data Intelligence Platform", "url": "https://cardano.ideascale.com/a/dtd/383705-48088", "category": 26248, "amount": 28525, "description": "没有一个平台可以让Cardano的利益相关者监测和可视化生态系统的性能、增长和机会", "funded": 1, "upvotes": 27701499, "downvotes": 18772501, "votes_result": 8928998, "votes_cast": 93, "f6_no_assessments": 3, "f6_rating": 3.777777777777778, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=10531"], "media": [], "f6_assessments": [{"q0": "作为一个数据分析师，我明白高质量的数据对于做出明智的决定的重要性。缺乏一个平台来监测和可视化Cardano生态系统的性能、增长和机会，限制了用户、SPO和代表从他们的行动中获得最佳结果的能力。该建议通过一个定制的和强大的平台来解决这个问题，该平台不仅对整个社区有利，而且有助于解决[改善和增长可审计性]和[新SPO商业机会]的挑战，通过提供有意义的数据给可审计性和可操作的见解来吸引新SPO。通过订阅计划的盈利潜力为社区和项目的经济可持续性增加了更多价值。也有可能通过基础设施投资，扩大平台规模，以涵盖用户群和生态系统的指数级增长。", "q0r": 5, "q1": "该团队显然拥有足够的背景知识，可以凭借他们在提供端到端IT和数字服务方面的20多年综合经验，成功地实施该提案。他们的技能组合应该允许他们以安全和敏捷的方式进行。虽然他们指定了所需的团队成员的类型，但他们没有说明所需的数量以及如何找到这些成员。预算似乎是合理的，并被分解成可识别的项目，但不清楚哪一个将是每个项目的提供者。额外的资金将通过众筹和提案人的初始投资获得，这表明他们对实施该提案的意愿和信心。实施计划说明了每项任务，但没有详细说明每项任务将如何完成。时间表似乎很现实，预计在一年内全面实施。对所引用的方面进行更详细的描述应该能提高提案的可行性。", "q1r": 3, "q2": "每个季度都有几个任务，可以有单独的截止日期，以便更好地跟踪进展。3个月、6个月和12个月的里程碑显示了可衡量的指标，除了 \"社区的知名品牌 \"是模糊的，它没有具体说明核心团队的规模和质量。尽管如此，列出的步骤应该能够令人满意地跟踪进展。", "q2r": 4, "assessor": "z_assessor_951", "no_vca": 23, "ne": 12, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "The end-to-end data and intelligence platform with community-provided data can bring out the health of the ecosystem and identify opportunities for new entrepreneurs. Business intelligence is crucial for value commitment and to generate analytical frameworks to handle projects. Considering these points if feel the proposal is addressing a challenge. ", "q0r": 4, "q1": "The proposer team has a strong foundation in the technical domain with the required education. The sustenance of the initiate by stake pool is not very clear. In the present-day competition in the SPO community, there is a need to estimate the staking requirement for any meaningful profit to finance a data aggregation company. More clarity of the subscription model for revenue generation also was required. ", "q1r": 4, "q2": "The fund requested is reasonable for the activity as mentioned in the proposal. However, for sustenance and growth, a viable business model will be a critical requirement. The proposal would have been more auditable or verifiable if it includes tokanamics and more info on the stake pool operation.  ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 17, "ne": 0, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "As there does not seem to be another challenge within this proposal fits the proposal is correctly placed here. The proposal accurately  identifies a problem and provides a solution of a data Intelligence platform. It clearly highlights the benefit it will bring to the ecosystem if correctly implemented.   ", "q0r": 5, "q1": "The team appears to have the requisite experience with external links provided. The funds requested are in line with the time frame and scope of initial work as the proposal states it will be also generating funds through a token launch. It would be great to see possible challenges and risks to the project with specific regards to security defined in future proposals.", "q1r": 4, "q2": "The project has defined a very ambitious roadmap and metrics with which to measure success. However it would be great to see KPIs directly related to the requested funds and not the project as a whole as without this it is difficult to determine the audibility of the proposal", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "引入数据智能平台，观察、定向和分享数据，以获得e2e的可见性、无偏见和可操作的洞察力", "experience": "20年以上的团队经验，为公共和私营机构提供E2E IT和数字服务，涉及CX、云、网络、数据等领域。"}