{"id": 384355, "author": "heinz.gassner", "title": "DLT Classification offside the hype", "url": "https://cardano.ideascale.com/a/dtd/384355-48088", "category": 26248, "amount": 10000, "description": "区块链领域目前充满了炒作和有毒的游说。瞥见市值和流行语正在支配着现场", "funded": 1, "upvotes": 32135320, "downvotes": 25354978, "votes_result": 6780342, "votes_cast": 119, "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": " Relation to personal qualifications: I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. Also, I know the Cardano Ecosystem and its actors pretty well by now so I am sure I can confidetly evaluate this proposal. The proposal provides a great idea that will be of great benefit Project Catalyst and to the ecosystem in general; mapping and classifying blockchain ecosystems. It will be really important to have this serious scientific backing in order to help establish Cardano and blockchain in general. It will help a lot towards future scalability for sure.", "q0r": 5, "q1": "DLT360 has so far shown (with their proposal from F6 they currently govern) that they are a serious and competent project partner for catalyst. I is highly likely that they are up for the challenge. The proposers know the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 21, "ne": 3, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "The Proposer has explained that currently block chain is characterized by toxic lobbying, so they want to establish protocols to bring objectivity into block chain discussions. They claim that their block chain monitoring and rating framework will provide value to the Cardano community. I think they might make some useful impact.", "q0r": 3, "q1": "The team is already funded in Fund 6 and have a track record. Their plan is detailed enough for successful implementation, making mention of some over 30 years of work experience as well.", "q1r": 4, "q2": "The road map is detailed and clear stating beginning of work from February 2022 to August 2022 with detailed schedules outlined in the proposal. The budget is broken down into details and KPIs also clearly stated for easy auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 19, "ne": 1, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "As an active Catalyst member and a Technical Builder I found the proposal aligned with general Cardano vision and agree with the proposers that is not a good fit for other challenges, aligning with the miscellaneous challenge objectives. The impact for the Cardano ecosystem could be great by creating an objective classification and study of all protocols and compere them based on rationales and research, but there is no analysis on what that impact could be or how to measure it. Which is something that could be added to show the Return on Intention of the project better.", "q0r": 4, "q1": "The team experience it is a great fit for the project, and they have shown committment and delivered previously.\nThe timeline and milestones are reasonable and doable in my opinion, per the assembled team.\nThe Business Model Canvas approach, allows also to understand the different components of the business model and how this project will seek to deliver value, to whom, how they will make it sustainable and its cost structure and revenue streams. So even though risks can materialize they can iterate the business model to adapt it as required in order to deliver.\nIn terms of budget the breakdown is clear and all the main costs were identified, the rates used for the different roles are aligned with the market, even the experts that will do the QA.\nThe only piece I'd add to the project is to better identify risks and its mitigation.", "q1r": 5, "q2": "Progress KPIs are provided, are very detailed and clear, though Impact or Return on Intention KPIS could've been detailed or at list analyzed so.the expected impact could be quantified and understood.\nWith the detailed milestone and the progress KPIS, this project could be easily tracked and audited by the community.", "q2r": 5, "assessor": "z_assessor_288", "no_vca": 20, "ne": 3, "ng": 17, "nfo": 0, "vca_o": 1}], "solution": "我们希望通过建立一个审计和比较主要协议的分类方案来促进讨论的客观化。", "experience": "超过30年的行业领导经验，以及灵活的核心团队和著名的领域专家网络。"}