{"id": 385019, "author": "allisonfromm", "title": "Catalyst Circle Mentorship", "url": "https://cardano.ideascale.com/a/dtd/385019-48088", "category": 26248, "amount": 10000, "description": "催化圈（CC）成员的服务时间很短。需要前一个圈子的指导，以确保顺利过渡。", "funded": 2, "upvotes": 72145436, "downvotes": 4789758, "votes_result": 67355678, "votes_cast": 250, "f6_no_assessments": 4, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "该提案旨在通过在该过程中加入导师角色，确保催化剂圈不同版本之间的过渡得到优化。根据我对该建议的理解，这是为了保证不同版本之间的质量，并保证新的圈子在重新开始时有一个坚实的基础。考虑到催化剂治理正在不断变化（旨在实现权力下放），我认为（作为一个有经验的社区成员），这对增加被选入催化剂圈子的人的稳定性非常有价值。这将影响整个催化剂的生态系统，并随着在整个Cardano生态系统中的重要性不断增加，对整个Cardano社区产生积极的影响。由于要求的资金只占总挑战预算的5%，对于整个生态系统的长期投资来说，这似乎是一个非常小的经济投资。从宏观和微观的角度来看，该解决方案与问题陈述直接相关，并且在提案中清楚地解释了过程的细节。作为Cardano和Catalyst的经验丰富的社区成员，相关人员对这个过程和项目有深刻的理解。总的来说，我非常同意这个提案有效地解决了这个挑战。", "q0r": 5, "q1": "参与的人都是催化剂社区的知名成员。在写这份提案的时候，ideascale对提案人的资料进行了匿名处理，因此很难核实提案团队的经验和身份。提案的详细计划为我们提供了一个清晰的结构和对所做选择的基本解释和推理。我喜欢整合CCv1的想法，尽管他们的服务期已经正式结束。从我参与 \"催化剂 \"的时间来看，我同意提案人的重点是让过去的CC成员参与进来，以便获得更广泛的视角和最大限度的学习。旨在完善CCv3的选举过程也是提案目标中的一个不错的内容。预算细目被清晰地呈现出来，并将资金分配给CCv1/CCv2的成员，这些成员在社区内都是众所周知的。我同意，这个提案极有可能成功实施。", "q1r": 4, "q2": "提案中提供了一份明确的可交付成果清单，以及在CCv1和CCv2之间划分的一些关键绩效指标。为了提高提案的力度和清晰度，我希望看到路线图中包含一个估计的时间框架。尽管我们知道每个CC的服务期为3个月，而且该提案的目的是关注CCv1/v2以及在某种程度上CCv3，但如果能包括一个更清晰的估计时间框架，将是有益的。我可能遗漏了一些信息或误解了，但如果这个提案将与 \"催化剂圈子 \"一起工作，这也意味着有关进展的信息可能包括在每周的市政厅里？如果是这样的话，这将是一个很好的方式，让人们能够关注提案的成功进展，以及整个项目的透明度。我也希望看到对风险管理的一些反映，或可能出现的潜在挑战（以及团队旨在如何处理它们）。这将进一步提高提案及其背后团队的可信度，并增加对 \"催化剂圈 \"的信任，因为这将表明团队有能力看待问题。总的来说，我同意该提案为我提供了足够的信息，以便评估实现其既定目标的进展。(", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 19, "ne": 14, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "这个问题在这个提案中得到了明确的阐述和解释。  为了使Catalyst Circle随着时间的推移不断发展和完善，新成员需要能够直接进入他们的任务和责任，而没有太多的时间来学习。  这就需要前成员指导和引导新成员，传授意见、技巧和建议，甚至不做什么。  可以说，去中心化是Cardano未来最重要的方面，这个提案很好地解释了解决这个问题（无报酬的校友）将对Cardano的未来治理作出贡献。  现在每个人的时间都越来越有价值，激励校友为指导新成员提供他们的时间和精力是个好主意。", "q0r": 5, "q1": "这个建议与大多数建议不同，因为它对手头的问题很简单，对如何解决这个问题也很简单。  真的不需要技术解释，只有几个变量需要考虑。  预算被分解成催化剂圈的v1和v2，但并不涉及到每个校友如何得到补偿的问题。  预算是合理的，不会占用其他潜在项目。  对于那些不知道圈子里有多少成员的投票者来说，知道每个成员将如何得到补偿可能是有益的，但总的来说，这是一个好主意，而且容易执行，这样未来的催化剂圈子就能很好地完成他们的工作。", "q1r": 5, "q2": "如上所述，该提案的路线图和关键绩效指标的复杂性并不像大多数提案那样以相同的标准来要求，因为该提案所要求的是简单和必要的。  然而，包括与新成员会面的规定次数对校友来说可能是有益的，这样他们就知道对他们的期望是什么，以及他们必须如何管理他们的个人时间。  我认为，问题和解决方案已经明确界定。  同样清楚的是，如果校友们没有动力在新成员服役后对其进行指导，那么这个问题有可能在未来发展。  我们都希望Cardano及其治理系统最终能够完全去中心化并取得成功。  这个提议显然是为确保这一点而需要采取的第一个步骤之一。", "q2r": 5, "assessor": "z_assessor_990", "no_vca": 27, "ne": 17, "ng": 8, "nfo": 2, "vca_o": 2}, {"q0": "Cardano Circle has added value and provided a core base for the community to take responsibility. There is a need for continuity and to ensure accountability it will be better for the community to pay for the services it gets from its representatives.", "q0r": 5, "q1": "The proposal does not involve significant efforts from the proposer to implement. It is just a request to the community to pay for the services rendered by Community circle members. ", "q1r": 5, "q2": "The proposal is for paying an outgoing member to mentor the new incumbent. This payment process is required for maintaining the continuity. To ensure accountability, there is a need to pay the appointment holders. In this perspective, the proposal is auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "It proposes something logical, to receive money for work that is currently being carried out and that receives no compensation, which is unfair in proportion to what they contribute to the community.", "q0r": 5, "q1": "This proposal has been submitted by a Catalyst Circle member so this person is spending a lot of time trying to help other people to do and understand the roll for what they have been elected. This shows by itself proven experience.", "q1r": 5, "q2": "Yes it is, it tells really well all the duties of the Catalyst Circle members and all the tasks they have to do to contribute to the Catalyst project.", "q2r": 5, "assessor": "z_assessor_765", "no_vca": 15, "ne": 1, "ng": 7, "nfo": 7, "vca_o": 1}], "solution": "通过 \"催化剂 \"提供资金，以确保前一圈的成员有足够的时间为新圈提供指导和帮助。", "experience": "CC校友是来自生态系统关键部门的催化剂社区的当选成员，以确定和解决共同利益。"}