{"id": 385160, "author": "fireflyshire", "title": "Cardano Eco-Village of the Future", "url": "https://cardano.ideascale.com/a/dtd/385160-48088", "category": 26248, "amount": 15000, "description": "没有足够的地方可以在日常生活中体验加密货币和NFT的未来，或者突出Cardano作为绿色区块链。", "funded": 0, "upvotes": 17657449, "downvotes": 29406132, "votes_result": 11748683, "votes_cast": 98, "f6_no_assessments": 5, "f6_rating": 3.066666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Based on the information provided, this proposal could potentially be a better fit in the community events challenge. The goal of the proposer is to host community events both online and in person that will increase awareness of ecovillages and the potential benefits to our society in the future. However, many of the features in this proposal also do not fit under any specific challenge, so it does have a place in the miscellaneous challenge. The proposers aim to fund a ecovillage in the Pacific Northwest, which is a very unique proposal. (score given: 3)", "q0r": 3, "q1": "Given the experience listed by the proposer, I do think that they can be successful in implementing this proposal. They have knowledge in the fields of resort management and large-scale organizing. \r\n\r\nMy only concern with implementing this project will be funding long-term. How will the proposers gather enough funds to sponsor an entire village? I would imagine that there must be immense costs associated with this project, so if the proposer could elaborate more on their business model or funding mechanism, it would greatly strengthen the proposal. (score given: 3)", "q1r": 3, "q2": "The proposers have provided good information to audit the progress and success of the proposal. For example, their end goal is the delivery of the event space by the end of next year. Additionally, they listed a few key performance indicators that can help the cardano community track the progress of the project. The phases of the project listed will be the most important part for tracking the project because they provide the most concrete milestones for the project. (score given: 4)", "q2r": 4, "assessor": "z_assessor_310", "no_vca": 19, "ne": 4, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement is relevant with the development of cardano community but it is not strong enough to be prioritized. The team address not enough places to experience the future of crypto & NFTs in everyday life, or that highlight Cardano as the green blockchain by creating themed eco-village hosting Cardano community events, workshops, festivals, and retreats in the pacific northwest run on $ADA. The target demographic is very limited to People living in or willing to travel to the Pacific Northwest of the US only and there is no specific location mentioned that make it difficult to assess the potential public exposure to the project.", "q0r": 3, "q1": "Given the combined experience provided by the team, it is likely that they could deliver the project. However, the absence of blockchain developer in the team make the project success depends on their ability to hire a blockchain developer with only 4000 USD budget. The project will be part of greater project independent from catalyst funding run by the team creating a risk of whether the team can focus on delivering their promise.  Furthermore, according to its roadmap, the project will be run in Q4 2022 so it's better to be funded in the Fund 8 or Fund 9 instead of Fund 7.", "q1r": 2, "q2": "The team does not provide detailed roadmap for the project itself and instead only give detailed roadmap for their bigger Firefly Shire project. Although the goals are achievable, the KPI given is only relevant to their Firefly Shire project that is independent from project catalyst. The success criteria given is also unclear and not detail. There is no detail plan on how the community can audit the budget spending, and project progress. The team can improve by providing the detail roadmap and auditability of this project and submit the proposal in Fund 8 or Fund 9.", "q2r": 2, "assessor": "z_assessor_643", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "The proposal seeks to launch a themed eco-village to host Cardano Community events, workshops, etc. and run on $ADA. Their aim is to set up a Cardano Community event space at the Shire. They want to spread Cardano and make it more accessible, while showcasing real-world uses-reduce environmental impact through sustainable building methods and green best practices in power, services etc. The challenge is well addressed.", "q0r": 4, "q1": "The team is made up of experts with over 10 years experience on eco-resort, building, solar install, managing tech teams, event planning, education which will all enable them implement the proposal effectively. The plan mentions , among others, increase adoption of Cardano; Host community events, , etc. to implement the proposal effectively.", "q1r": 4, "q2": "The number of NFTs minted, onboarding collaborations, completion of phase deliverables, the road map mentions January 2022 to Sept 2022. The budget breakdown is clear and comprehensive. All the facts will make auditing effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 16, "ne": 2, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "As this proposal is for the set up of a Cardano community space I believe this proposal would be better placed in the community hubs challenge. The project clearly outlines the benefit it would bring to the ecosystem however and so I am neutral.", "q0r": 2, "q1": "The team seems to have the relevant experience for developing a community hub, It would be good to specify if the blockchain development will be performed in house or outsourced as those may be skills that are lacking. The budget is well broken down. Hourly rates would be preferable but the amount is small enough to validate its current structure.", "q1r": 4, "q2": "The roadmap and KPIs do not refer specifically to  the requested funds or the proposal if I am understanding it correctly and so I am unable to say how auditable the project will be. It would be great to see KPIs in terms of number of people using the space etc.", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is about integrating Cardano in everyday life an eco-village, or highlight that Cardano is a green blockchain. A general recommendation is to strengthen the proposal with regard to how Cardano contribute to the aspect of being a green blockchain. For now the main purpose of ADA is to use it for payments, which is not such a new area in itself. \r\nThere exists many proposals and studies on how to use blockchains for energy applications exist literature, which you can take ideas from. This could be for example for selling electricity from producers to consumers. ", "q0r": 3, "q1": "According to the information on their website they have been involved in organic farming, eco-resorts. They are looking for collaborators and need to strengthen the skills in e.g. blockchain development, solar installation, legal advisory. So the success will also depend on if they manage to attract those skills.\r\nThe proposer claims that the proposal will be implement with our without Catalyst funding. It is not explicitly said how the rest of the funding is raised, but it appears from the sale of NFTs which are discussed in the roadmap. \r\nThe Catalyst funding would be used for ADA booking calendar, website tokengating, power source, soundy system, and live-event gamification. The propose could specify how large share of the total costs these estimates cover. The proposer could be provide more details about size of solar power, what type of blockchain development., type of community outreach, and legal and admin accounting. \r\nThe original team could implement some of those topics themselves, but other would depend on if they attract collaborators. They have a good chance to attract collaborators. ", "q1r": 3, "q2": "There is a budget breakdown for different areas. It is recommended to explain how much of this is spent on equipment and on cost for development. The time schedule of the development/construction for the areas that ask for funding from Catalyst should be specified.", "q2r": 2, "assessor": "z_assessor_997", "no_vca": 32, "ne": 12, "ng": 16, "nfo": 4, "vca_o": 1}], "solution": "一个主题生态村，在太平洋西北地区举办卡达诺社区活动、研讨会、节日和静修会，由$ADA运作。", "experience": "10年以上：经营生态度假村、建筑、太阳能安装、管理技术团队、活动策划、教育和大型组织工作。"}