{"id": 397210, "author": "sustainableada", "title": "Youth+Women Cardano NFT4Good Party", "url": "https://cardano.ideascale.com/a/dtd/397210-48088", "category": 26436, "amount": 49000, "description": "Lack of a cross-chain Cardano education program, equipping + empowering youth + women with 21st century skill sets + unlocking creativity.", "funded": 1, "upvotes": 38261957, "downvotes": 27778985, "votes_result": 10482972, "votes_cast": 210, "f6_no_assessments": 2, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 6038, "q0": "The proposer's intentions are commendable. It finds a very real problem within our ecosystem, and the crypto ecosystem in general, and substantiates it in great detail using a lot of data and tools. And I agree with their solution to this problem: education.\n \nBut it is no coincidence that it fails to give an answer to the question \"Please describe how your proposed solution will address the challenge?\". I think the proposers forced the idea into the challenge, when perhaps they could have entered, for example, the hubs challenge.\n \nOne of the possible answers to this question that they provide in their extensive Impact text is: \"Like they say 2 heads are better than 1! With a gathering of multi-skilled individuals from various blockchain communities, different perspectives and problem solving ideas will inevitably collide to spark new initiatives and solutions.\", but that's not what this challenge is looking for.\n \nThis challenge is directly aimed at finding projects that facilitate interoperability with other blockchains, not in previous educational preparations for this to happen in the future.\n \nSo I repeat. Although the intentions of the project are commendable and it responds well to the spirit of Cardano, it does not respond well to the requirements of the challenge.\n", "q0r": 2, "q1": "There is no doubt that this team of proponents is ideal for this type of project, as they certify through different links that they have the skills and experience to carry out a project of such magnitude.\n \nThe timetable is very well done, with detailed tasks that prove to us that the team knows how to carry out this project from start to finish.\n \nThe budget is well outlined, but it doesn't seem reasonable to me. Not because such a project is not very expensive, which it is. But because it is more than 10 percent of what this challenge offers.\n \nI have no doubt that by funding this project, the team could carry out this project in a successful manner. So my score in this category is almost the highest. But it is not the highest because the budget seems excessive for this particular challenge.\n", "q1r": 4, "q2": "Milestones and kpis are well described, in detail, in this proposal. It is evident that the proposers know perfectly the necessary tasks and all the steps that are required to be successful in their project.\n \nThe precision with which these two requirements are described will make it very easy for the community to audit this project. Above all because of the good number of channels that the project offers so that the community can closely follow the development over time.\n", "q2r": 5, "assessor": "z_assessor_32", "no_vca": 5, "ne": 1, "ng": 2, "nfo": 2, "vca_o": 1, "reply": "The CA comments for Impact are invalid and do no conform with the CA guidelines, furthermore they indicate a lack of understanding of the Challenge brief it its entirety, and a lack of a thorough read of the entire proposal. Also the rationale for a 4 star rating doesn't conform with the CA guidelines and represents an inherent bias."}, {"id": 10110, "q0": "The project is about creating educational, innovative leadership programme, gathering youth and women in physical and digital spaces to connect and encourage them to join Catalyst and other blockchain community. The idea of ​​promoting young people and women more exposure to crypto is a great idea because the potential of these audiences is still undeveloped though they account for big popularity. It is true that like all other tech-related things, all resources and support communities on blockchain and crypto currency are now more accessible to men. This leads to an imbalance in the structure of the participants in the crosschain network and will lead to a loop of imbalance. Encouraging the development of spaces for youth and women, especially by creating their own resources, will contribute to changing this imbalance in a positive way. This project is also consistent with the goal of sustainable development, ensuring long-term development of the community.", "q0r": 5, "q1": "The proposal is very detailed and complete, the team very convincingly explains the motivation and goals, as well as how to implement the project. They also do a lot of research related to the topic, making the proposal more convincing about the importance and urgency of the issue of imbalance in the audience participating in cross-chain communities. They listed things need to create training courses and educational materials tailored to the women’s needs, which makes their plan actionable. Another positive point is that they are the winner in Fund 5,6,7, which is very impressive. The fact that they continuously participate in Cardano funding rounds and win shows their enthusiasm and passion for their projects. They also have 200+ active Cardano community members and impact changemakers from public, private and third sectors. In addition, they are also member of other big chain communities, Therefore, they already the network to initially implement the promotion and action plan they set out. ", "q1r": 5, "q2": "The key metrics and success criteria are on point. The proposal includes roadmap with stages and activities in each stage. They promise that all the information will be open source, and shared with the community. In each stage, we can easily track their progress by looking at their visible outcomes. The team seem knows clearly about the importance of transparency so it's likely that information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Connect youth + women with structured pathways to engage within the Cardano Community, find roles + collaborate creatively across chains.", "experience": "Global, creative, diverse, decentralized, multidisciplinary team. Fund 5,6,7 winners. 200+ active Cardano community members and impact changemakers from public, private and third sectors. Youth Block, Cardashift, SustainableADA, UN, Ngos, Commonwealth and NFT artists."}