{"id": 400303, "author": "wolfram.blockchain.labs", "title": "Wolfram Cross-Chain Framework", "url": "https://cardano.ideascale.com/a/dtd/400303-48088", "category": 26436, "amount": 75000, "description": "The future of crypto is multi-chain and Cardano needs to accelerate the experimentation of cross-chain services.", "funded": 2, "upvotes": 265279737, "downvotes": 6266468, "votes_result": 259013269, "votes_cast": 1291, "f6_no_assessments": 7, "f6_rating": 4.80952380952381, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=27768"], "media": [], "f6_assessments": [{"id": 5647, "q0": "This proposal is aligned well with the challenge of cross chain collaboration. The resulting research could bring valuable cross chain interactions and use cases that benefit the entire crypto industry. The problem statement includes \"Cardano needs to accelerate the experimentation of cross-chain services\" which this proposal will address directly through research by a highly respected organization (wolfram alpha) This proposal will likely scale to future challenges and set the foundation for future cross chain transactions and various interoperability functions. ", "q0r": 5, "q1": "The proposal is rated highly for the feasibility, given the reputation and track record of Wolfram Alpha, and their previous and ongoing work with Cardano and IOG. The budget is clearly broken down and itemized, and the project timeline is clearly stated as a nine-month timeline for the execution of all items in the plan. The tasks have been detailed and itemized with a realistic timeline and budget. ", "q1r": 5, "q2": "Given the clear plan, with auditable key metrics, timelines and budget, and the below deliverables listed below, I rate this project highly for auditability and clarity:\n\"complete report from internal partners and external community members that shows \nHow we accepted feedback\nHow we sought feedback\nHow we structured the report\nHow we gave presentations\nHow we fared based on the KPIs established above.\n\n2.) Proof-of-Concept using oracle system on Cardano for a cross-chain a simple use case\nA simple use case completed as a Proof-of-Concept\n3.) Defined program for attracting additional blockchain ecosystems to work on cross-chain use cases inside Cardano.\n\nThe only suggestion I would have for the proposing team, is to clarify how much, if any, of this work will be open sourced to the Cardano community, as my understanding is that a majority of the work and research done by Wolfram Alpha is not open source. If the Cardano community is going to fund research and development, it should be for open source initiatives that can benefit the entire community. The long term vision for Cardano should be to avoid creating (funding) siloed blockchain teams that use open source funding initiatives to gain an unfair advantage within for profit organizations. Despite these concerns, I believe this is an excellent proposal that is well written, and the outcome will provide value to the Cardano Community and Catalyst community.  ", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 6010, "q0": "This proposal realizes that the future is multi-chain and the need to accelerate the experimentation of cross-chain services. This fits within the Challenge settings which is to create connections and collaboration between Cardano and other blockchains. 5/5 here.", "q0r": 5, "q1": "Wolfram Blockchain Labs has multiple years experience with blockchains and Cardano frameworks. They are running tesnet and mainnet nodes across multiples blockchains, they have the experience and knowledge to start researching a cross-chain experimental framework. The roadmap is very detailed and well designed. The budget is clearly explained and makes sense. I am therefore happy to back this proposal with a 5/5.", "q1r": 5, "q2": "The KPIs are clearly articulated and listed in a detailed way from research to experimentation and implementation making it easy to assess if the project was successful or not at each stage.", "q2r": 4, "assessor": "z_assessor_314", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10763, "q0": "The Cross-Chain Collaboration challenge specifies that  it is an open-ended challenge - which is a very important qualification, as we are at the very early stages of exploring interoperability and cross-chain collaboration. The proposal here was submitted by Wolfram Blockchain Labs (WBL) with the aim of helping to experiment with these new inter-chain connections by developing programmable functions for connecting Cardano to other chains. There is a solid basis already for this proposal as WBL states it has Integrated UTXO (think Bitcoin/Litecoin) and account-based (think Ethereum and EOS) blockchains into the Wolfram Language already. The team states it is ready to to begin working on cross chain experimentation immediately. Three key parts of the proposal to keep in mind (i) research (ii) experimentation and (iii)  \"Proof of Concept\" oracle framework. Impact-wise all three are key, but the third one already gives us a glimmer of a new world as the team expects to be able to enable sharing Cardano blockchain data through oracles. This proposal is not only about bringing Cardano to other blockchains, but also bringing a well-known team from Wolfram into our wider ecosystem. I'd say there is no doubt about the alignment, this is a new approach and new team willing to look at these critical issues from a grounds up approach. The team sees potential for scaling, if the first principles approach is implemented. Great. ", "q0r": 5, "q1": "The team behind the proposal is impressive and has at its fingertips the collective experience of Wolfram Blockchain Labs and Wolfram Language and its blockchain function. One really important aspect of the proposal is that the team intends to priortize specific use cases and then experiment on them. However, it will not be done in a vaccuum but will be tightly intertwined with collecting research externally by utlizing community generated inputs.  The nine-month timeline sounds to be at a quite nice pace for a research/experimentation and demonstration package. It would have been nice to find our from the team whether they have also applied for additional funding from other blockchain projects keen to promote interoperatability as this could help to make this wider initiative more sustainable and valuable - through a greater cross-chain awareness of the potentials for cross-chain collaboration based on the findings of this project. In essence, I expect this proposal to generate new and valuable insight into new pathways and identifying value prospects for establishing ties between blockchains. The interaction phase aims to educate Catalyst community of what occurred over the three phases. The $75,000 budget has been broken down into Team Costs - $50,000 USD to be spent on two teams (technical and research),$20,000 for hardware and $5,000 for marketing. The teams competencies are available and documented on WBL page (https://www.wolframcloud.com/obj/stephen26/Published/Cloud%20Notebook%20-%20Cross-chain.nb) What I think could be improved is that the Outreach effort is focused primarily on the the Cardano and larger decentralized community. I think that there must be opportunities for WBL to promote, communicate and evangelize its findings inside the wider Wolfram Research and Wolfram ecosystem, as well as potentially to corporate partners that could benefit from the new know-how. There might be room for a new proposal there in the future...\n", "q1r": 5, "q2": "Straight into KPIs. I like their presentation and the division into KPI Technical Deliverables vs KPI of Performance or Community Seminars. The KPI Technical Deliverables are extensive and incisive for the Discovery stage, the experimentation KPIs seem adequate - but somehow is there room for quality and performance parameters? The Experimental Implementation KPIs will be exciting to see, of course we can't see the future. The research and education results will be delivered in the form of a complete report from internal partners and external community members, while a valuable result will be the Proof-of-Concept using oracle system on Cardano for a cross-chain (simple use case). Most exciting potentially is the \"Defined program for attracting additional blockchain ecosystems to work on cross-chain use cases inside Cardano\". It would have been good to have more information on this last deliverable - what does a \"Program\" in this case entail? Will it be a Wolfram Program for implementation or a collection of ideas? With an important organization such as WBL, I do not expected auditability problems. One thing that will facilitate Auditability is the inbuilt component for collecting Catalyst Community feedback. It remained unclear to me whether the Smart Contract Templates will be open-sourced or available for reuse by the Cardano community? Will this proposed library of templates - to connect different blockchains to Cardano - be of exclusive use for WBL and its customers? The team states that at the end of each phase it will will have regular communications with the Catalyst and extended Cardano community, although this segment lacks feedback about the definite modes of communication and the planned tempo and formats of this communication. The interactions are proposed in the form of blogs, videos and other services. Yet, as this is an integral part of the success of this proposal, I feel a two-way communication plan should have been fleshed out in more detail, hence a 4. Probably bi-weekly progress updates for this 9-month long proposal would be a good choice. \n", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10924, "q0": "I think the proposal has everything to do with what is sought in the challenge: the interaction between Cardano and other blockchains. The company Wolfram Research, according to what is said in the scope of the proposal, already has a lot of experience and integrates several blockchains. They intend to develop programmable functions and connect, through experimentation, NFTs, tokens, carrying out transactions and smart contracts between Cardano and other blockchains, according to them. I found the whole to be very well explained, the process would be divided into 3 parts - research, cross chair experimentation and Wolfram cross chair framework. Each part is very detailed. Despite being a very technical proposal, it is possible to understand what will be done, as the actions are explained in an accessible way. Therefore, I believe that the impact can be maximum if everything is done in the planned way.", "q0r": 5, "q1": "The feasibility is ok, and it can improve in some points. Regarding the roadmap, it is detailed what activities would be carried out, but the problem is that the time periods informed are very extensive. For example, in the trial phase, it would take 6 months. What would happen at home one of them, exactly? As much as the phases are well explained, this lack of temporal specificity compromises our understanding of the whole. Talking about the budget, the asking amount is high and it is divided into two parts. Same thing with the script. It's given a good breakdown, but we don't know within those parts how much each thing would cost. If this had been defined, we would certainly understand the monetary use better. The team is very well presented, we know in detail the areas of expertise of each professional and also their CVs, but I wish the linkedin profiles had been provided as well. I think this would increase confidence in the information passed, as we could prove what is said.", "q1r": 3, "q2": "Certainly, the auditability of the process is well considered. It is said what would be measured in each phase of the project and also how the conclusions of the proposed items would be. Reports, meetings and demonstrations would be made so that all this information would be disseminated to the Cardano community, from what I understand, but it is not clear how often these things would be done or the communication channel that would be used. That's my only suggestion for this part. Talking about the final results, unlike most proposals, here we have a concern about how the project would affect Cardano, beyond the success of what is done itself. Again, it would need to be clearer how the Cardano community would know about all this. Due to the more complex nature of the proposal, my suggestion is that a final meeting be held, displaying the results in a simple and direct way. I found that auditability is great, needing simple improvements.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10930, "q0": "The idea and reasoning between this propsal are excellent and will sure provide a great use to the Cardano ecosystem: Enabling NFT cross-chain compatibility and also generating SC templates will not just help give the Cardano blockchain more traction, but also lower entry barriers and possibly make it more scalable (We've seen in the past that sometimes cross-chain/off-chain solutions help lower network congestion). I think this solution will be of great benefit to the Cardano ecosystem.", "q0r": 5, "q1": "The team behind the proposal shows that they are incredibly competent, not just by the work they have already done, but also by the good project plan: A detailed implementation plan has been laid out that splits the projects into identifiable phases and sub-steps and the budget has been explained by a good, reasonable rationale. Technical details are explained sufficiently and have made a contingency plan. I also note positively, that compared to the last fund, you have made your proposal a lot more detailed and transparent. Well done!", "q1r": 5, "q2": "The problem and solution description are clear and accessible. A detailed roadmap enables auditability along the way of implementation and well-reflected KPIs for each phase enable excellent success monitoring. This proposal really has a great base for being audited from the start to the finish.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10955, "q0": " No one, academic or blockchain technologist has presented a supportable argument for only a winner-takes all future in the industry.\n\nWolfram identifies cross-chain technologies as probably the most important functionality in the future os cryptocurrencies. And Wolfram have cross-chain experience having integrated blockchains into a single interface through Wolfram Language\n\nAlready Wolfram hosts multiple blockchain MainNet and TestNet nodes already including ARK, Bitcoin, Bloxberg, Cardano, Ethereum, Filecoin, Tezos and more.\n\nThey have four potential cross-chain use cases to test immediately with the experimental framework and provide Text & Visuals to support their claims https://wolfr.am/Cross-chain\n\nTh level of writing in this proposal strongly illustrates the professional calibre of Wolfram.", "q0r": 5, "q1": "If there is one organisation active on the Project Catalyst space that can be relied upon to deliver their promises - it is Wolfram. This proposal, as opposed to 95% of other funded proposals is made by a well established, highly reputed technology innovation organisation. From areas of groundbreaking developments far beyond cryptocurrencies. The team they dedicate to this proposal is led by the CEO, the CTO and other key players in Wolfram divided into a Technical Team of 6 led by the CEO (named and referenced) and a Research Team of 4, led by the CTO (named and referenced). Additional high level team members are also named and referenced. Several having long associations with Wolfram and high level experience in their fields. \n  ", "q1r": 5, "q2": "Looking at the structure of the project we can see the level of auditability.\n\nWolfram identifies specific cross-chain use cases:\n\nA. NFT Import/Export \nFunctionalities to import non-Cardano blockchain NFTs into Cardano as native tokens. Also, exporting CNFTs to other blockchains.\n\nB. Tokens Import/Export\nFunctionalities to import non-Cardano blockchain tokens into Cardano as native tokens. Also, exporting Cardano native tokens to other blockchains.\n\nC. Cross-chain Transactions\nSupport for transactions to be sent between blockchains.\n\nD. Cross-chain Oracles\nOracles that can execute actions in blockchains triggered by events in other blockchains.\n\nThey organise the work to be done in clear segments.\n\n1) Research\n2) Cross-chain Experimentation\n3) Wolfram Cross-chain Framework\n\nAt the end of each phase they propose to have regular communications with the Catalyst and extended Cardano community. \n\nAll of the data and feedback we get from the community will be processed and analyzed and shared with the community.\n\nThey clearly explain what is to be done inch phase\n\nI. Research (Phase 1)\n\nThe initial phase focuses on research. This phase has two components: 1) Wolfram feedback and 2) Catalyst Community feedback. \n\nThe second part is about collecting Catalyst Community feedback. They involve the Catalyst community.\n\nII. Experimentation (Phase 2) \nThis phase is about experimentation. \n\nExperimentation is important because we have several ways to use cross-chain functionality and it requires experimentation to find the most useful solutions. \n\nIII. Wolfram Cross-Chain Framework (Phase 3)\nAfter they complete the discovery/research gathering and experimentation phases, they propose to create a \"Proof of Concept\" oracle framework. \n\n\nA. Smart Contract Templates\n\nThe third phase is time to reflect and understand the results of experimental cross-chain solutions. In addition, we will create smart contract templates. Smart contract templates will be useful to experiment with on additional Catalyst projects as well. \n\n\n ", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 11007, "q0": "I have often thought there are certain projects which IOG should fund directly and outside of Catalyst because of its criticality to Cardano's mission, and in this case its with Cross-Chain interoperability goals. And to further stress my point, in this case it's Wolfram asking for funding and presenting a very professional proposal. To anyone with a broad spectrum of interest, Wolfram is known to sit at the forefront of many technological advances which is why IOG has partnered with the group particularly to provide Cardano with Oracles. Its discoveries and applications, though not widely used, are avant garde. This proposal focusses on taking Cardano a step closer to the broad inter-operability which Charles himself have set for the ecosystem. As a former assessor of tenders for a university, I can only give my strongest agreement that this aligns with the challenge and can bring about tremendous impact to our ecosystem.", "q0r": 5, "q1": "Wolfram has presented a very credentialed team in this proposal. Each are listed on the proposal with further descriptions provided on the website provided, including urls to their linkedin profiles. The three stages of their journey are well-described including the rationale for the budget requested. What gives me confidence to agree this is highly feasible is their reliance on Catalyst community members' participation in establishing the parameters of their research and the trajectory of developments. This partnership with Catalyst means we as a community have a part to play to ensure this proposal meets its goals and achieve success.", "q1r": 5, "q2": "The proposer states that each phase will be reported on and communicated and will result in a wrap-up presentation (likely on their youtube channel) at the end to present their findings. The participation of the Catalyst community on the research phase means most of us will be a part of the journey and will be able to tick off audit points along the way. I also don't doubt these audit points will be updated onto their website for the rest of the community to digest on their own time. The proposal has listed very ambitious KPIs  which if they achieve means we as Catalyst achieve as they may lead to future Challenge Settings we have never yet considered. What wolfram is proposing to achieve would lead to infrastructural changes to the way our blockchain communicates and interacts with others. I would not blink an eye if this is the only proposal approved in this challenge but given the relatively low budget requested, I am hoping it is one of many. Good luck.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Develop programmable functions to experimentally connect Cardano NFTs/tokens/transactions/smart contracts to other blockchains.", "experience": "We have already integrated several UTXO and account-based blockchains into Wolfram Language over the past four years. This experience has positioned us to begin working on cross chain experimentation immediately."}