{"id": 402020, "author": "oliverross", "title": "OnChainUniversity - Free Education", "url": "https://cardano.ideascale.com/a/dtd/402020-48088", "category": 26436, "amount": 26500, "description": "Pathways for learning about blockchain and cryptocurrency are very chain-specific, and often do not promote cross-chain collaboration.", "funded": 2, "upvotes": 46744434, "downvotes": 8783309, "votes_result": 37961125, "votes_cast": 206, "f6_no_assessments": 6, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 2666, "q0": "We need to teach the up-and-coming generation the importance of blockchain technology. Engaging the youth and young adults would grow the entire industry by leaps and bounds, especially if courses were offered for free. ", "q0r": 5, "q1": "The team experience that you bring to the table seems more than able to handle the stated goals, however, I think you guys would benefit from advertising of some kind. Someone that can promote via social media, on discord, and even reach out to college campuses to help grow the amount of people that could utilize this type of educational content.", "q1r": 4, "q2": "Metrics such as growth aren't always the most important. I believe that if you were to find someone willing to program some sort of native token for incentives could kick-start this project and take it to the moon. Cross chain collaboration is what will take blockchain, and with it Cardano, to the next step in mass adoption. Kudos to the team! We need more projects like this in our space!", "q2r": 4, "assessor": "z_assessor_1548", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3046, "q0": "I believe that this proposal aligns with the challenge as it will create collaboration between Cardano and other blockchains through education. People openly seeking education (using the proposed website) and wanting to learn from one another (engaging in the proposed discord group) have the potential to create strong bonds even when they come from different chains. \nBlockchain courses are indeed chain-specific. Having a platform that provides multi-chain courses will benefit up and coming developers and the community members. Developers will be able to better understand how other chains works and will be in a better position to create better cross chain dapps. The community that take these courses will also have a better understanding of other chains and they may be more likely to build bridges when engaging with members form other chains. ", "q0r": 5, "q1": "The budget is pretty straightforward and sensible with the main the main portion (43%) going to the instructors for the creation of lessons. This makes sense since this initiative is all about teaching and they will need teachers to teach. A minor drawback relating to the budget is that the proposer used a rounded amount in the “Requested funds in USD” part instead of the actual amount. Because of this, the funds requested does not equal the budget breakdown. I would recommend that since they have an accounting guy (Raymond Visser) onboard, he is involved in the budgeting process to provide pertinent accuracy. This is to avoid possible negative remarks on the proposal. \nThere are reference links to all of the team members and they are multi-skilled. There skills include accounting, education and IT. All of them are involved in the Cardano community in some way, either by creating music NFTs, Cardano articles on Medium or being a team member on a Cardano project.  \nThe team has already created a sleek website. They have on-boarded first instructors. One the instructors is none other than Bucky Roberts from the thenewboston(https://www.youtube.com/user/thenewboston) who has 2.6 million subscribers and 4,442 videos at this time of writing. Getting him on board is huge for this initiative as not only does he have a massive following but he is also an excellent educator. ", "q1r": 5, "q2": "The roadmap and deliverables are clearly defined and can be easily traced from their website of socials. \nThis makes for easy auditability.\nThe proposer went to great lengths summarize the risk and their strategy to counter these risks. This shows that a lot of thought has gone into this section. I especially appreciated the table they included on their website (https://onchainuniversity.com/market-positioning/) comparing their competitors.  The virtual teaching source they plan to use, themeum.com, has excellent reviews from Trustpilot (4.6 from 61 reviewers, https://www.trustpilot.com/review/themeum.com). \nRegarding their crypto-friendly platform on discord, I have a suggestion regarding some channels channels:\n#bitcoin2cardano\n#polkadot2cardano\n#xblockchain2yblockchain\nBasically the idea is to have groups for people from blockchain X who want to learn blockchain Y.", "q2r": 5, "assessor": "z_assessor_1602", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5946, "q0": "The proposer has identified a problem and a solution to the problem and the proposal seems to fot into the challenge brief for some sort of education. It will be more interesting if one of its goals will focus on the interaction between 2 or more communities from different blockchains. Being in its early stage the project requires a lot of involvement from a lot of people but, at least on paper, it has a good chance to succeed. (how about offering some offsite learning materials?)", "q0r": 4, "q1": "There are traits about the experience of the team in creating content. My opinion is that a marketing specialist is required for taking care of promoting activities and some people for administrative tasks.\n\nThe budget is broken down into identifiable items and seems reasonable to achieve the set goals. (it is not clear if additional funding is required)\nIn my opinion the proposer has not considered some challenges and risks relevant to a successful implementation (being a free for all service how it will be sustained? Sponsored courses have some limitations as they are promoted on their native platforms mostly.) Another aspect to be taken into consideration, data protection (GDPR and other constrains) - how people are protected?\n", "q1r": 4, "q2": "There are KPI/metrics defined to measure the success of the proposal. A timetable with achievable milestones is presented. In my opinion it is recommended to follow a KPI/metric about the number of courses (and topics) that are to be deployed on the platform and their impact for the audience. (is there a demand for a specific subject or the curriculum is made without the users' interaction?)", "q2r": 4, "assessor": "z_assessor_309", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8022, "q0": "Learning about blockchains and cryptocurrencies is very chain-specific and often doesn't foster cross-chain collaboration is an issue to deal with with this challenge. The team-clear problem-identification proposal also proves successful in the educational fields so that users can mine Cardano and chains. The metrics linked to the challenge create a healthy balance in the ecosystem and can help accelerate community growth.", "q0r": 4, "q1": "A roadmap with milestones has been provided for 3 months, 6 months and 9 months. Clearly listed by the author month by month what they will achieve: Time in 3 months (80 students on board, 15 instructors on board, 1,000 Twitter followers, sponsored course creation, training program trainer creation released, regular live tutorial events). Duration of 6 months (220 students on board, 25 instructors on board, 2,000 Twitter followers, crowdfunding campaign NFT, free backup if needed, best practices testing and evaluation) best in place). Duration for 9 months (400 students on board, 40 instructors on board, 4,000 Twitter followers, new UI and improved UX, Skills-Based Certification partnerships). A clear roadmap with detailed outlines gives the community of followers a broader view. The funding application budget is $ 26,500, detailed by the author for each small item with the corresponding amounts for each item to be spent. The amount spent by the author is 4 stages: instructor creating the course - $11k (173 hours @ $65ph), web design $5k (78 hours @ $65ph), community manager $5k (78 hours) @$65ph), $5k educational consulting (78 hours @ $65ph). Was surprised with the detailed listing of the group. The group consists of 3 members, Raymond Visser, Peter Mishler and Oliver Ross, through the group's profile, I see the author clearly lists what the group's current work is doing and the number of years of experience of each member. The group also put their personal linkedin, twitter links on it, which increases the transparency and trust of the community for the group even more.", "q1r": 4, "q2": "They provide roadmaps with milestones at 3 months, 6 months and 12 months. Our team will continuously research new use cases for cross-chain collaboration and seek excellent guidance from experts in that use case. The author fully explains what actions they will take and how they will use that collected data. The author's success through increased cross-chain participation through the development of courses related to multiple topics and cryptocurrencies. This project is a brand new project and is waiting to be funded.", "q2r": 3, "assessor": "z_assessor_649", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9977, "q0": "This proposal’’s problem is focus on the chosen blockchain. This proposal is eye-opeing for the crosschain collaboration. The solution is focus on the OnChainUniversity - Free Education which will open the pathway for collaboration and ETH migration and even cross smart contract blockchains. One positive comment is that the team well-identified the market of online education and nail down their position for the solution at  https://onchainuniversity.com/market-positioning/ The team also finds the incentivized-based approach as the model of Atala PRISM. In their demo website, the CA already saw some projects such as TERRA, CARDANO and BITCOIN, basic blockhains and tokenomic and economics.", "q0r": 4, "q1": "The team has show a really detail plan for a longterm project of 9 months basically happening on the website platforms. The team members are experienced in teh field of Cardano and education background Raymond Visser, Peter Mishler and Oliver Ross. ALl of the core team shared their Linkedin and Twitter account, epically Oliver Ross who is very active member in teh Cardano space ranging from Content creator, writer and creator of many quality contents on the Cardano community. The total funded requested is 26,5000 which is 6.7% of the total fund for this challeng setting which is reasonable with the total proposers. The cost is breaking down on a hourly basis which is make senes for the web design/ community management and education consultant.", "q1r": 5, "q2": "This is a long-term proposal for 12 months with the clear Students and instructors onboarded KPI. There should be an final exam or evaluation of the total team. The team also well thought of the risk for the end stage of the contingency fuding plan. The exit program should be a real cross chain tangible materials for the community to be benefits form. The success metrics are bsed on the users feedback and participation and accreditation raite via a trusted blockchain technology such as https://atalaprism.io/ From a CA point of view for such long term project and new proposal which was not funded in the previous catalyst fund, it should be a more frequent update to the CA coordinators so that the community can keep track the progress of the proposals.", "q2r": 4, "assessor": "z_assessor_782", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10132, "q0": "Focusing on education to increase understanding of blockchain and cryptocurrency is a good way to create a Cross-Chain Collaboration community because the cryto-currency market is currently still up-trending that many people have the need to learn more knowlegde about it. So a web-based to learn about many crypto currency including Cardano is a great way to attract interested people. However, the project should focus more on building a community rather than just a platform that people go to join online course but not really connect to other members.", "q0r": 4, "q1": "The proposal is really detailed with clear analysis about the market and challenges that they might face. The team members backgrounds and profiles are well-presented that they have relevant experience. They also already have the website to demonstrate better how the platform will look like. However, just like other education related project, the success of it will depend much on the teachers participating and how they build their curriculum, which has not yet known (The team said that they will recruit high-level educators but didn't mention to the way they assess the educators level, which I believe is very important to the success of the project). Beside, the development strategy has not defined fully (Almost all of thing is in future tense).", "q1r": 3, "q2": "The proposal includes roadmap which metrics to audit the success. However However, there is no detailed plan with when the desired outcomes of the project can be expected to reach. I think the goal about Twitter followers is quite little (They should aim for more marketing and promotion activities so as to attract more people to join the community because after all, a good product - well designed platform can be failed with little participatents). ", "q2r": 4, "assessor": "z_assessor_809", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "https://onchainuniversity.com/ will feature multi-chain courses exploring current and future use-cases for collaborating cross-chain.", "experience": "Our team has demonstrated success in the fields of education, computer science, and platform development. Together, we've built a sustainable education platform to show how Cardano and other chains can be harnessed by users, especially in collaboration."}