{"id": 404679, "author": "checkpoint", "title": "Cross Chain Multiverse Travel", "url": "https://cardano.ideascale.com/a/dtd/404679-48088", "category": 26436, "amount": 32000, "description": "There is no real motivation for people to use multiple blockchains and no clear way that assets are cross chain compatible.", "funded": 1, "upvotes": 28982704, "downvotes": 20360714, "votes_result": 8621990, "votes_cast": 136, "f6_no_assessments": 7, "f6_rating": 2.714285714285715, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=2751"], "media": [], "f6_assessments": [{"id": 7455, "q0": "The idea is theoretically quite aligned with the objectives of the challenge, but in practice this is not so clear. In theory, the Checkpoint platform would aim (according to the proponents) to allow users to access their digital assets, which includes NFTs (I don't know what else would be included, it would be interesting to clarify this) in wallets integrated with content of different blockchains. Users would be able to view and share their assets as long as the blockchain in question is supported by the shared digital wallets. The idea is to work with cross-chains, allowing an exchange of experience between Cardano, his names, and the other members of other cryptographic communities. This is very much in line with the specific objectives of the challenge, such as they are mentioned in the scope of explanation present in ideascale; in my view, several required topics would be covered, such as: the number of technical implementations capable of connecting Cardano with other blockchains; ideas from other chains implemented by Catalysy and project and Dapps from other chains implemented in Cardano. This can be seen from the moment that the core of this idea is to maintain an explicitly direct bridge with other blockchains. However, this is very theoretical, the proponents do not explicitly explain how this apparently very complex technology could actually be built. Due to the lack of direct explanations of how the project would be developed, I really can't be completely sure that the intentions (which are great) will be achieved. As much as the roadmap should be presented only in the topic below, on feasibility, it is always necessary for proponents to explain very clearly how the idea would leave the theoretical field for practice, that is, which parts would constitute the whole; which phases would need to be developed for the final product to be delivered; which professionals would be working here; metrics called “deliverables”, which can tell us what needs to be done, when, how and by whom; so that we then have a solid view of the project creation. In other words, even though the idea is fully aligned with what we are looking for specifically here, I don't feel safe to give a good rating for the impact of the proposal. If the proponents had attached the explanations that I cited, this would certainly be different, because in addition to understanding what would have to be done, we would know how it would happen and with that we would have more confidence as to the impacts that the project would generate for the Cardano ecosystem. So, I think it is necessary for the proponents to reformulate the presentation of the idea, specifying better the commented issues. \n", "q0r": 3, "q1": "The development process of this project is very superficially informed. We know what activities would be done during the year 2022, however, we don't know important things like 1) how long each of them would take 2) in which months of the year each would be happening 3) who would do each thing 4) how they would do it. It would be essential for proponents to detail each of these activities in good detail, the way they are presented, we only have a notion of what would be done, not a solid understanding of how this would be possible. The same thing I said about impact, it is not enough to inform what the objective is, and without how it will be achieved through small tasks that will be completed in a progressive way. A certain part of the proposal arrives where the proponents explain how the sharing of the NFTs would be (in “Initially, Checkpoint will offer commercial NFT cards. These cards will be released as albums, consisting of 20 cards per album, each with a unique design, etc etc. ...). I found this explanation great and super necessary for us to understand more clearly what would happen in the day-to-day usability of the platform. However, this still does not clarify how its construction process would have to be done in detail. In other words, this part of the proposal is inadequate, requiring better detailing. Moving on now to the budget analysis: this part is also very superficial. We know that the total funding is split into 3 parts and how much would go towards each (Smart Contract Creation - $25,000 + Marketing - $5,000 + Contingency - $2,000 USD). However, there is no detail on each of these parts. For example, in smart contract, which professionals would work here? For how many months? For how many days a week, totaling how many hours? What would the hourly rate be? What is the justification for the 25 thousand dollars? The marketing part should also be better explained, we don't know which marketing strategy will be adopted, so we don't know if the asking value is fair or abusive. Will there be a social media campaign? More traditional media? How will members of different cryptographic communities become aware of this project? And about the last expense: what is a contingency fee? Why does it cost 2 thousand dollars? I can't clearly understand how the money would be used, too much detail is talking. Finally, analyzing the team involved in the project, this part is much better. We know the names and a very rich curriculum of each team member, so we understand a little about their careers and what areas they work in. Two things worry me, however: the fact that no one attaches linkedin profiles or provides some résumé by which we can verify everything they say and also no one seems to be an expert in Cardano; How can we ensure that they are technically prepared to handle our blockchain technologies? In general, the feasibility is low, especially the first two topics should be much better explained. \n", "q1r": 2, "q2": "There is no way to monitor the process. Proponents already explain auditability by turning to the end results, that is, how the application could be considered properly constructed and successful. This would be understood by the number of people using cross digital wallets, amount of tokens traded, rewards received for mitigated content; and also, when the application is self-sustaining, that is, when the marketing costs were all supported by the generated revenue. In fact, these are good ways to understand if what was created got where it was expected to go, but there are many things that are pending here. Let's start with the first part that should be supervised: the process. How could project development be measured? What measurable metrics would be adopted? What quantitative and qualitative data would need to be constantly monitored? How could we ascertain whether the work routines of professionals were being followed and respected? It is essential that the script, first, be better detailed. With that, we would be able to have good material to serve as a basis for monitoring. In the second instance, the proponents should update at least monthly the IOG coordinators and the members of the Cardano community on the partial results, the small advances. It would be necessary for some contact to be established, whether via discord, telegram, gitbug, video calls and etc. Really, the platform is the least. The most important thing is to ensure that all content that needs to be monitored is actually monitored and that this is done at the correct frequency. Turning now to the success scenario, the proponents focus only on the direct results of their application, not thinking about verifiable ways to see how this all affected Cardano. Has the objective of this challenge, that a good exchange between our blockchain and the others be made, been achieved? How can we see better engagement of our community members from this project? Did the number of Ada and CNFTs in circulation grow from this idea? How to measure, prove it? I think that, unfortunately, auditability leaves a lot to be desired, several necessary things would not be analyzed according to what is being informed to us, requiring a reformulation of this part of the proposal. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 6, "ne": 6, "ng": 0, "nfo": 0, "vca_o": 2}, {"id": 10247, "q0": "The space of NFTs has been growing rapidly in the past few months and proposing key ideas to make this space more useful and exciting for the end users, is always nice to see. This proposal might not add up greatly to the whole Cardano ecosystem but i am inclined to believe that it will have a positive impact its section and will be able to address future similar, or not, challenges. With that statement, i mean that the interoperability can be applied to also other assets except from NFTs. I can clearly get what the whole idea is about, so i totally agree with how the proposer decided to describe it, and that it is among the challenge setting of the cross-chain. All in all, i like this idea and i think it will seem quite appealing to the voters. ", "q0r": 5, "q1": "Team members have managed to assemble a very diverse set of skills and experience across a wide range of disciplines. Referrals on LinkedIn were not provided, so experience can not be 100% verified from that perspective, but that is to facilitate the voting process and assessment. The plan is described clearly but there is no timetable, it is devided in activities but there is no time horizon. The budget is there and has been broken down but I believe there should be a bit more information considering the items for example in the smart contract creation, i think you should mention the number and type of developers and how many hours are going to be needed and then refer to the budget of the activity and name the activity as \"development\". Great job when it comes to referring to the risks that might emerge when tacking such a proposal. However, be a little more specific to the kind of the resources needed for this purpose. ", "q1r": 3, "q2": "The fact that there is no clear roadmap and a time horizon makes me think twice of the success of this proposal.  The fact that the one KPI described is not accompanied by a number, for example how many people engaging with the product IPs will be needed to think of this proposal as a success, adds up to that questioning of mine. Keep in mind that the key metrics and how you measure them, is a key for the auditability of the proposal. What is more, there is no way to track the progress of the proposal apart from visiting the github account, as i can imagine, something that is not very useful. ", "q2r": 2, "assessor": "z_assessor_861", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 579, "q0": "I´m kind of confused about the idea, its a metaverse on its own or a program for other metaverses to implement? If its the first one, how will you \"allow the creation of a \"multiverse traveler\"\" or in other words, how will this be implemented to other multiverse projects, or is it only your own space of metaverses. If its the second option how it will implemented and promoted to other metaverses outside yours. I recognize that there is a problem, but I haven´t grasped the idea on the solution. Maybe next time work on a clearer definition of the platform, at first it seems like a solution for all Metaverse projects, then it seems to narrow down.", "q0r": 2, "q1": "On feasibility I can´t see a clear timeline, yes it has objectives, but we need at least aproximate monthly or weekly dates for keeping up. Will the project be done in 6 months or 1 year? Budget is not clear also, 25.000USD for Smart contract creation, Is that just for the NFT minting? How many devs you need? for how much time? The proposal would highly benefit from adding those details. The team seems qualified but no evidence was shown on the proposal, I would add LinkedIn Links.", "q1r": 2, "q2": "Traffic is a good KPI, but how much people are you expecting to hit? at which time? How will the community be able to audit trafic on your website? Social medias could be a good choice, but you need to put them on the proposal. If all of these things are corrected and fixed this could be a great proposal in the future. I would also recommend looking for partners on the Cardano Community, which might be able to help you!", "q2r": 2, "assessor": "z_assessor_1190", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1096, "q0": "It's clear what this proposal is aiming for and it does involve interoperability, and if successful could definitely enhance the ability of individuals to move their various avatars (in NFT form) across chains. \n\nI will say that the gist of their proposed solution--purchasing an NFT on the Cardano blockchain being packaged with access to NFTs on other blockchains that can then navigate game universes on each and such--can seem more like a workaround than a true solution. But workarounds can turn out to be important, especially in the blockchain field where interoperability is such a major challenge.", "q0r": 4, "q1": "This part needs more. The roadmap is more like a list of goals by the end of the year, which doesn't strike me as a real plan. It could work, but the traditional way to shape a roadmap is to mix milestones with a timeline. The budget they provide has none of the requisite details. If the proposers wish to spend $5,000 on marketing, for example, they should, please, detail their ideas for how to go about marketing these NFTs. \n\nTheir team has some impressive accomplishments under their belts, but it's not clear who the lead developer for this tech project will be (and thus who, I would suppose, would get the lion's share of the pay from the smart contract development budget). All this, unfortunately, introduces uncertainty into the proposal. But this should all be easy to resolve in future proposals.", "q1r": 3, "q2": "This proposal needs to mention how they will go about reporting their progress milestones to the community that funded them. Will they issue reports, note progress on a blog, or something else? Auditing can be highly reliant of the forthcomingness and sense of responsibility proposers demonstrate and while this team has some impressive resumes, a new project like this can take steps under the auditability section to reassure the community and establish trust.", "q2r": 2, "assessor": "z_assessor_1275", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5567, "q0": "The proposal aims to deliver on so many things, that it fails to clearly convey each of the goals and the connection between them. \nThe proposers are working on Checkpointhub, a website that will provide content about video games, for two distinct audiences, both for adults as well as for children, in several different formats: as digital magazines, podcasts, videos, VR and more. There is also a podcast for bedtime stories, that supposedly helps children and adults fall asleep, and it also aims at providing schools with learning materials.\nBesides all these, the team has been working on a “multiverse”, that will become the future access point for all the content that will be produced in the future. From the images shown in the video, that metaverse looks like an online 3d gallery of articles from the magazine, that one can explore in VR. And on top of all this, Checkpointhub will be releasing NFTs, with an initial set of NFT trading cards and also develop a wallet that will display NFTs from different blockchains.\nAfter having been presented with all this information, there is no clear specification on what the proposal aims to do. From the feasibility section, I have been left with the impression, that the proposal is about the NFT trading cards, but from the impact section, it seemed it’s more about the metaverse and the development of wallets for different blockchains, while the auditability section talks more about the digital magazine and the possibility of selling advertisement in their “multiverse” (unfortunately, it seems one cannot escape ads even in the so-called metaverse).\nSince there is no clear structure throughout the proposal, I cannot properly assess the impact it can have on the Cardano ecosystem.", "q0r": 3, "q1": "The is no clear structure about the timeline, there is a list of steps the proposers want to implement during the year 2022, but no mention on the approximate duration of each step or a finalisation of the entire project. \nThe budget is only divided in 3 sections, with no clear description of how these numbers have been calculated. There is no number of hours provided, no rate per hour described, no fixed fees mentioned.\nThe team has supplied descriptions about each member, however, they have provided no links to a professional social platform, GitHub or any other 3rd party link that would provide some insight and verification into the descriptions and skills provided.\nAs such, due to the lack of so many important details throughout the feasibility section, I cannot properly assess it.", "q1r": 2, "q2": "The progress development question has not been addressed, the proposers start with “The success of the project will be measured by the number of people engaging with the product IPs”, that is a somewhat valid point for the other important question in this section.\nBut even for the success description, the importance of clearly defined milestones and metrics is very important, as without them, the community cannot be able to identify and evaluate the advancement and positive outcome of the project.", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5677, "q0": "The problem statement is confusing and debatable, as I believe there is a strong motivation and desire for people to use multiple blockchains. The problem solution is valid and one that many organizations in the crypto space are working towards. I do not believe this project will have a positive affect on Cardano because the team is more concerned with journalism, marketing, and selling IP (their own intellectual property, that they would like Catalyst to fund) They have discribed success of this project below:\n\"The success of the project will be measured by the number of people engaging with the product IPs. We’re able to see what traffic is across our brand and the ability to be able to sell advertising on our platform in the multiverse (and other properties) is a clear indication of the success. As well as, of course, rewarding our community for engaging with the content.\" This statement appears to show their focus exclusively on profit and self interest, and it is not clear to me how this companies success will be tied to the success of the average ada holder who will be funding them. ", "q0r": 2, "q1": "The proposing team appears to be professionals in marketing and branding, however it is not clear that they have the technical domain expertise to implement on this grand vision that is shared by many. The team mentions various successes in their past, and high budget projects, yet it is not clear then, why do they require the assistance and funding of Catalyst? Furthermore what value is it to ada holders to fund the development  and creation of intellectual property for Checkpoint, and then market it for Checkpoint. It does not appear to be open source, and it's not clear how this investment will benefit anyone other than checkpoint.  ", "q1r": 4, "q2": "The auditability section is almost devoid of any relevant metrics, and includes the following: \"As previously stated, success looks like people consuming our content across the brand. In addition, it is also measured by the fact that we're able to secure marketing spend from game publishers for advertising across the brand.\" The key words here are \"our content\" and \"the brand\" So again, this shows me they have only one goal of securing funding from others to generate profit for their marketing enterprise. I believe Catalyst should be used to fund projects that benefit the entire cardano ecosystem, or society at large, not closed and centralized for profit companies. They have many other ways to fund their enterprise. ", "q2r": 1, "assessor": "z_assessor_215", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6239, "q0": "By including a “Earn to Engage” concept into the Cardano Cross Chain Collaboration initiative, the Proposer offers an innovative and creative approach on creating Cross Chain Environments. The Proposal aims to offer a joyful interaction between different blockchains by targeting the vibrant NFT Community and therefore definitely alignes with the challenges purpose\n\nAs the proposed solution definitely shows a great intention and concept, it is not fully clear how the concept which is based on a trading card NFT Exchange will be built up, nor how the platform aims to connect exactly with different blockchains. Will there be light wallet integrations and partnerships with already existing NFT Marketplaces to increase the Projects impact ?\n", "q0r": 4, "q1": "The Proposer comes with an already well established platform which will be used to implement a trading card based Cross Chain NFT trading Platform which allows an effective roll out of the proposed solution. The Team behind the Project seems to be a fully Professional Team with a strong experience and skill set which makes a successful implementation of the Proposal very likely.\n\nHowever, it is not mentioned if this team is already experienced in working together, is it the same team which has built up the CheckPoint Project ?\n", "q1r": 4, "q2": "The Proposer is able to track the interaction ( and with that the success of the Project ) on their already existing platform. But the Proposer does not mention if those information will be accessible to the community", "q2r": 3, "assessor": "z_assessor_362", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "If able to share digital assets (such as NFTs) and display them across the metaverses on different chains, they are more desirable", "experience": "I've been a journalist for over 20 years and have come from a BBC and Guardian background - broadcast journalist (award winning) . My team are veterans in their relevant fields.\n\nI have been in the games industry for over 15 years and have an already established audience."}