{"id": 405252, "author": "daynavision", "title": "Cardano+Ethereum Lifesaving NFT's", "url": "https://cardano.ideascale.com/a/dtd/405252-48088", "category": 26436, "amount": 80000, "description": "It’s hard for creatives to build multi-chain awareness and community through NFTs due to lack of cross chain teams, strategy, and resources", "funded": 1, "upvotes": 43605202, "downvotes": 30896449, "votes_result": 12708753, "votes_cast": 354, "f6_no_assessments": 1, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 758, "q0": "Think of the funding proposal as a marketing/fund raising operation for a movie, in the form of an NFT drop.  But also think about just how much work and passion is going into this project, not just as an artistic mission for a movie, but from a desire to see humans be treated with respect and empathy, which is apparent in the themes of the movie, the teams built up around creating it, the collaborative spirit with which members of Ethereum and Cardano have embraced the message, and in the building of communities to support the effort.  As a critical part of the movie's production roadmap, a series of marketing and fundraising NFT drops are planned that will bring known artists from the Ethereum space, along with experienced NFT teams from both Ethereum and Cardano, and these drops will require community spaces to be built out, where the best elements of cross-chain collaboration are cultivated, and the where the worst elements of FUD and maximalism are shunned.  Where this project has a chance to shine in this area, is that this is no milquetoast \"can't we all just get along?\" singalong:  these communities have a real chance of maintaining the civility and respect needed to secure collaboration because they are rooted in rock-solid values, like caring for the mental health of war veterans, honoring the stories of First Peoples, and providing empathy and support for the suicidal.  Some things are bigger than maxi youtube shows, and this is the kind of project that can bring those things to the forefront.", "q0r": 5, "q1": "The team they have includes an artist from the Ethereum space who is also a veteran, and NFT teams from Cardano which also includes veterans, as well as a native american artist to help create some of the exclusive and rare drops.  Their ability to fall back on this underlying theme is going to be the piece of the puzzle that is able to hold the project together.  The roadmap for the entire project is well laid out (movie production begins this summer with release planned for Spring 2023) and they have broken down the details of NFT drops in great detail, from the initial collabs to the timing of special community airdrops.  The community buildout, usually a critical component of an NFT drop hasn't been ignored either, with a fair share of the budget to build and maintain it.  It is worth noting the maintain part of that equation, as the Proposer correctly indicates that a risk to the collaboration project is the toxicity that generally surrounds Eth/Ada maxis creating toxic communities.  A healthy budget to incentivize the constant patrolling and the time taken to inform and educate on the project's mission, in order to keep the spaces healthy.  This is also a strength of the project that I think makes it more likely to succeed here than other might be, as the values subscribed to here, and the communities base constituents of vets and first peoples, should make it easier to define and enforce community guidelines.", "q1r": 5, "q2": "The included list reads more like a tech stack, but the timeline and roadmap give us most of the details we need for auditing:  there are monthly deliverables including the actual drops, but also meet ups with artists, executing specialty or exclusive elements of the drops, such as their golden tickets.  Because much of the cross-chain collaboration will be a measure of the health of the communities they build, it would be good to have tracking metrics for the growth of the discord servers, as well as the NFT markets that emerge from the drops.  A difficult thing to plan for, but the team may also try to stay on the lookout for emergent community based collabs, such as using the channels to support other projects, in effect spreading the spirit of collaboration.  This is of course, a two-edged sword, and it probably isn't helpful to say that \"they will know it when they see it.\"  Project fulfillment looks less like a final deliverable than it does a series of completed milestones that add up to having generated enough funding from the drops to continue making the movie.  That indicates that total value of the NFT drops will probably be used as the final impact metric when the final drop has concluded.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 7, "ng": 5, "nfo": 0, "vca_o": 2}], "solution": "Provide a Cardano+Ethereum proof of concept & create the playbook for assembling an all-star team and deploying successful Cross Chain NFTs.", "experience": "Dayna - https://www.linkedin.com/in/dayna-kovacic-a0821365/\n14+ yrs sales experience, specializing in cross-functional team leadership, creative business development, and new product launches for Nevada & North America at the state & national levels.\n@DaynaVision on Twitter"}