{"id": 405482, "author": "matthiasksieber", "title": "Adatar.me for IOTA", "url": "https://cardano.ideascale.com/a/dtd/405482-48088", "category": 26436, "amount": 8000, "description": "IOTA’s hashed public key based wallet addresses are not human-readable and do not offer personalization.\n\n", "funded": 1, "upvotes": 33628006, "downvotes": 26136770, "votes_result": 7491236, "votes_cast": 200, "f6_no_assessments": 14, "f6_rating": 3.7380952380952386, "videos": [], "media": [], "f6_assessments": [{"id": 236, "q0": "The project's stated goal of adding human-readable names for the IOTA chain will clearly bring value to a problem IOTA has with long addresses.   However, the focus of the challenge is on collaboration, and interoperability.   This project seems to be a standalone solution for an IOTA problem, that while leveraging an existing Cardano focused team and solution, doesn't otherwise increase the collaboration between the chains.\n\nWith the IOTA Foundation also offering innovation grants, this would seem to be a better fit for funding by that entity than by the Cardano community treasury to solve their problem.", "q0r": 2, "q1": "The existing working Adatar project on the Cardano chain would lead one to believe the team can deliver a similar solution to the IOTA chain.  The team seems strong and well versed and I have confidence they can deliver the project.", "q1r": 5, "q2": "The measurement process suggested is a binary one, did it launch or not?  The challenge is looking for collaboration and interoperability, which are not addressed by simply launching the site.  Will successfully launching Adatar for IOTA lead to any impact on Cardano or the community?  \n\nThe assessment doesn't allow for a differentiation between failure, good and excellent results.  Either the project launched or didn't.  If the project launches, but no one uses it, then that doesn't add value to IOTA or Cardano.  If the project launches and thousands of IOTA addresses are purchased, that is good for the IOTA users, but where is the benefit to Cardano?  \n\nI would have liked to see a process of evaluation that tied benefits to the Cardano ecosystem and a way to differentiate between fail, good and great.  As there isn't really a link to benefits to the Cardano ecosystem, this doesn't seem possible. ", "q2r": 2, "assessor": "z_assessor_1097", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}, {"id": 309, "q0": "While the challenge brief is written in a way that expresses broad interpretation of collaboration, it is unclear that adatar.me 's IOTA integration would actually serve cross-chain collaboration.  Instead, I see signs that it serves the proposer's commercial interest very clearly.  On this basis, I'm not indicating disagreement, but neither am I adding any points for \"agreement\".\n\nAdditionally, when reviewing the key metrics suggested from the challenge brief, and comparing it to the proposed metrics for success of this proposal, the proposed impact is NOT in alignment for me with the challenge brief.  I'm not deducing points for this point of my disagreement with the proposal, only due the challenge brief's other very broad language.  \n\nA suggestion for the proposers would be to describe more clearly a specific benefit.", "q0r": 3, "q1": "The relatively modest scope of this plan and the level of community involvement, and their demonstrated ability to learn new technical material (that may be essential to an IOTA connection) of its participants are signals to me that, if funded in the proposed way, that it would likely be delivered.  Note that this assessment is informed also by some direct exposure to the individuals, and by my own deep technical experience.", "q1r": 5, "q2": "While all-or-nothing evaluation criteria such as \"launch in testnet\", \"launch in mainnet\" and \"successful implementation\" are very clear-SOUNDING, their binary nature and lack of any metrics-oriented indicators does not show me positive signs that the project would do things measurably in support of the challenge or show how the project is actually progressing.", "q2r": 3, "assessor": "z_assessor_1139", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1553, "q0": "[Disclaimer: The Loxe Inc. Team have submitted 19 proposals that are all related to the addition of support for various blockchains to Adatar.me. These proposals are very similar in their structure and vision. As a result, the assessments for this set of proposals will also be similar.]\n\nAs explained in the campaign brief of this challenge setting, multi-chain adoption is a necessary issue that the future blockchains will have to address. Long and tedious addresses have been a topic (and issue?) within the blockchain domain for a long time. Long addresses are hard to handle, easy to misspell and there are multiple variants of malware that swaps the receiving address when a user copy pastes an address during a transaction. These are a few of the arguments as to why the functionality in the solution is needed.\nBy providing this alias solution to IOTA we also increase the possibility of their community discovering Cardano and Project Catalyst. This might also lead to an increased amount of new member on-boarded to the community.\nThe team behind the proposal is doing a good job proving that their solution hold a strong coupling to the goals set in the campaign. In terms of impact, the proposed solution proves impactful to a strong degree within cross-chain collaboration. In line with the arguments mentioned above, this proposal is rated 5-stars in terms of impact.", "q0r": 5, "q1": "The Loxe Inc. team consists of experienced members that have been involved within the Cardano and Catalyst ecosystem for a long time. They have already delivered the foundation of the Adatar.me platform from a previous funding round. Their credibility is unquestionable and the proposal is deemed feasible to the highest degree. However, the proposal acknowledges the project as a low-risk project where much of the solution is already built and it's only a question of connecting the backend to their platform. It would be interesting if the proposers reflected a bit on the technical challenges of integrating IOTA into the Adatar.me platform. In the current state of the proposal, the complexity is regarded identical between all blockchains. \n\nThis proposal is assessed individually, so the following reflections does not affect the score of this individual proposal but they are still worth mentioning.\nThere is a total of 19 related proposals submitted, that is around 150k dollars if all proposals were to be funded and that would equal over 35% of the total funding for the challenge. It is good to have that number in the back of the mind while voting in order to estimate the collection of proposals against other proposals that requests bigger sums of funding. \nAlso, it is mentioned that the integration will take one full month of work to complete. The proposers have acknowledged this in their estimate of delivery but there is a big difference of workload if only a few vs. all proposals got funded. In the latter case, 19 months of work will have to be performed until the end of Q4. This question could be interesting to expand further upon.\nTo sum it all, the proposal is regarded as highly feasible and receives a score of 5 stars.", "q1r": 5, "q2": "The milestones for measuring the progress is sufficient enough and it is deemed not necessary to report on a more detailed level given the scope, complexity and risk of the proposal. The success is partly defined by organic adoption by the IOTA community. It would however be interesting to have real numbers estimated together with this metric. As mentioned in the proposal, it is not a big challenge to measure the actual number of transaction made through the adatar.me platform. The wording of \"organic adoption by its community\" is rather vague and passive, indicating that even the tiniest adoption of the platform is considered a success. A more ambitious goal with real numbers would be preferable so that the community can follow up the success of the project more easily. Therefore, the score given in terms of auditability is 4 stars.", "q2r": 4, "assessor": "z_assessor_139", "no_vca": 10, "ne": 2, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 1691, "q0": "Please note that the proposers, Loxe Inc. have submitted over 15 similar proposals aiming to extend the adatar.me platform to a variety of different blockchains. Therefore, parts of my reviews of these proposals will be a general assessment of these similar proposals. However, the reviews will be customized to the relevant blockchain discussed. \n\nI give the proposers a five star rating on impact as the solution clearly aligns with the KPIs and goals of the challenge, aiming to implement cardano based solutions to other blockchains. Today's IOTA transaction technology requires a long and complex wallet-address which makes payments and transactions exhausting to complete. Providing an avatar based solution could greatly impact the accessibility of blockchain transactions. It would however be interesting to discuss how the proposers would ensure adaptation of the adatar.me solution by IOTA users that might be biased towards IOTA based technology.\n", "q0r": 5, "q1": "I give the feasibility of this proposal a four star rating. Seeing that the proposers have already received funding and successfully implemented a project from Fund 6, I find it very realistic that they would be able to complete this project. Furthermore the team consists of five established team members with long and relevant experience within the field which strengthens their credibility. The proposers also include a realistic view of the project timeline, taking into consideration the uncertainty of the number of their proposals that will get approved and how this could affect the time needed for completion. In order to receive a five star rating I would recommend the proposers to discuss the complexity of implementing a backend solution for the specific coin, in this case IOTA . Will it be more challenging to develop a solution for the IOTA blockchain than it was for ADA? Additionally I would recommend the team to give a more detailed budget and roadmap that breaks down what the development process would look like. Lastly, it would be good to give further reflections regarding what happens if all of the Loxe Inc. proposals in Fund 8 gets approved. How would this impact delivery times and would you be able to complete several projects parallel to each other?\n", "q1r": 4, "q2": "I give the audibility of the proposed project a three star rating as the reader is given only two explicit milestones to measure the progress of the project: when the extension launches in testnet and once it is launched in the mainnet. In order to achieve a higher rating I would recommend the proposers to break down the project into smaller milestones that could be communicated to the Cardano community along the way, allowing for greater transparency.  Furthermore I recommend that the proposers take a closer look at detailed KPIs of success when the extension is fully implemented in order to measure the actual value provided by adatar.me. Examples of this could be X numbers of users registering their IOTA wallet to adatar.me, X% growth in transactions using the adatar.me solution or numbers of IOTA transactions conducted using adatar.me avatars. This would ensure that the Loxe Inc. team could provide data regarding the actual adaptation of their solution.\n", "q2r": 3, "assessor": "z_assessor_1403", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5263, "q0": "I buy the argument that this is a low-risk investment for the further development of this project. The requested amount is relatively small, so it's not a huge risk of wasting a ton of money. Plus, they already have their main product developed and there's not a huge heavy task to accomplish what this proposal is looking for. It is, however, a big last step that enables much greater functionality to the Cardano ecosystem. Easy vote in my mind. ", "q0r": 5, "q1": "Here's something I greatly appreciate about this proposal: humility. They've submitted multiple proposals for this round, each with different goals and functions to develop, that work together to produce a greater product. They leave it up to the community to decide which features ought to be funded. They've got a clean and easy roadmap, with a ton of talent to back up the results, and a simple outline of what the money is going to. There's nothing I'm concerned about here. ", "q1r": 5, "q2": "I do wish they would've put just a little more thought into audibility here. I still give them a positive score because this is a simple proposal that doesn't take much to do. Still, I wish they wouldn't let themselves off so easy by identifying their KPIs as simple completion. Not what I would like to see, but it's pretty understandable. ", "q2r": 4, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6031, "q0": "The challenge is Cross-Chain Collaboration, and Adatar.me for IOTA is a project that fits within this challenge as it would provide IOTA users with a human-readable address and registry. I agree that human-readable addresses would be useful to all users in any blockchain. If it gets traction within the IOTA community, it has the potential to add some value to the Cardano ecosystem in the future. To note, this project doesn't connect IOTA and Cardano blockchains.", "q0r": 4, "q1": "On the technical side, I believe adatar.me can deliver what is promised by the end of 2022, as they have already done it on Cardano and they state themselves that the solution does not require any on-chain coding, and they \"just\" require to connect the front end to a wallet. The budget might be a bit high for this connection - I would question if an $8K/month dev is really required for this project - but it still fits within what's acceptable. More technical information regarding the IOTA-specific implementation might have been useful.\n\nI  have rated the feasibility only 2 stars as the technical implementation is just a part of the work done. There is nothing in the current project that shows how they plan to introduce and market the tool to the IOTA community, what are the existing wallet solutions and how adatar.me is a better solution. There is also no market research to show that there is a need for this integration and if it is wanted by the IOTA community. A project can't be a success without adoption, and I only can fully back this project if there is a strong marketing plan - otherwise, we would be at risk of funding an expensive integration that won't be used.\n\nI would advise doing some market research first before any technical implementation and submitting a new proposal next round with the results of the market research, a marketing plan, budget, and the technical implementation plan.", "q1r": 2, "q2": "The information provided is not sufficient to audit the success of this IOTA integration. The project is missing the most important KPIs, in regards to the number of IOTA users reached to promote the app, the number of active IOTA users expected, the expected number of uses of the IOTA integration (number of payments?) per month. Not having these KPIs in place means the success of this proposal is entirely based on the technical completion of the integration rather than the commercial/community success of linking Cardano to other blockchains communities.", "q2r": 2, "assessor": "z_assessor_314", "no_vca": 2, "ne": 1, "ng": 1, "nfo": 0, "vca_o": 1}, {"id": 6560, "q0": "The problem identified in this proposal (poor UX in crypto wallets due to non human readable addressess) makes sense and is an issue that has been continuously discussed in the crypto community for a few years now. The common use of non human readable addresses causes strangeness and insecurity in less tech savvy users, so solutions that move in this direction are positive. The proposed solution is within the scope of the challenge. \n\nThere is no clear articulation on how this proposal will add value to the Cardano blockchain. Considering that the proposed solution doesn't require on-chain code at this time, there is no clear indication on how the Cardano blockchain will be used. I clearly see that creating a model that allows the use of custom and \"human readable\" addresses for IOTA DAG would bring great value to the IOTA ecosystem (increasing the ease of mass adoption) but there is no clear retribution to the Cardano community in addition to a possible increase in the prestige of Cardano and Catalyst for the recognition of joint development. \n\nAn item/risk that would be important to judge the potential impact of this proposal would be to know the competition of similar projects supporting IOTA addressess as well, as this would indicate the space for the development of a solution and the demand. Unstoppable Domains for example supports IOTA addresses and would be a potential competitor https://unstoppabledomains.com/\n\nThere are no metrics/targets that could facilitate impact assessment evaluation. I would recommend including metrics/KPIs that could more clearly indicate the impact of this proposal on the Cardano and Catalyst communities. \n\n**This proposal used a template due to the similarity between them. The team explained the reason for using the templates. The only significant change between the proposals is the target blockchain. Because of this, I will use standard assessments, modifying only the different points between them, which can cause similarity alerts in the assessment.**", "q0r": 3, "q1": "This is a proposal for the expansion of Adatar. The project was funded in F6, aims to deliver human readable addresses on Cardano, mainnet lauched in Feb 2022, is in full development and is offering support in several Cardano wallets. \n\nThe team described experiences relevant to the development of the proposal and there is evidence of their expertise on the website www.loxeinc.com \n\nThe budget will be completely used to pay developers. The value defined for the payment of developers for 1 month of work is compatible with market values. It would be important to have an hourly estimate for the development stages, testing and implementation of the IOTA extension to understand more clearly if the budget is appropriate, but considering the deliverables of this proposal, the amount is reasonable. \n\nThere is a forecast for the integration of adatar.me to IOTA to take 1 month, but due to the large number of parallel proposals proposed by the team there is uncertainty about when the project will be delivered, which made the team define the launch of adatar.me IOTA extension testnet at the beginning of Q4(2022) and the mainnet at the end of Q4(2022). From what I can understand, if the team gets funding for many proposals, there will be a considerable backlog, which increases the uncertainty about the roadmap. \n\nNo significant risks were identified for the development of the project. As the integration of adatar.me will not require on chain code, the complexity of the proposal decreases as it facilitates the integration with different blockchains. \n\n**This proposal used a template due to the similarity between them. The team explained the reason for using the templates. The only significant change between the proposals is the target blockchain. Because of this, I will use standard assessments, modifying only the different points between them, which can cause similarity alerts in the assessment.**", "q1r": 4, "q2": "The roadmap for this proposal could be more clear, this is partly justified due to the large number of parallel proposals that the team created. The proposal mentions that if many proposals come to be funded, there may be a backlog, so the milestones were defined for Q4, which helps in verifying the success of the proposal. \n\nThe goal of \"implementation of the adatar.me IOTA extension \" is clear, but \"organic adoption by its community\" is a subjective and ineffective definition of auditability. There are no metrics/KPIs, which undermines the performance evaluation capability of this proposal. \n\nConsidering that the deliverable of the proposal is the creation of human readable addresses, I would recommend that the team include metrics that could assess the use of the service by IOTA users, as this would be an easily verifiable metric and a good indicator of success/auditability. There is a clear description of the problem and the proposed solution.\n\n**This proposal used a template due to the similarity between them. The team explained the reason for using the templates. The only significant change between the proposals is the target blockchain. Because of this, I will use standard assessments, modifying only the different points between them, which can cause similarity alerts in the assessment.**", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8052, "q0": "(The author writes a similar proposal \"Adatar.me for ...\", but the content will mostly be the same, so when I analyze the project, there will be similar sentences. This is a great idea that BTC hashed public key-based wallet addresses are unreadable and do not offer personalization which is a significant issue and it needs to address this challenge. This Adatar.me for IOTA project is really useful and perfectly suited for scaling projects running on Cardano. The solution to this problem is that the creation catalyst is accepted by other chains and communities, and extending Cardano-based projects to other chains are also solutions that the author offers. This idea is suitable for the challenge of creating a healthy playground for the community to help the Cardano ecosystem grow.", "q0r": 5, "q1": "(The author writes a similar proposal \"Adatar.me for ...\", but the content will mostly be the same, so when I analyze the project, there will be similar sentences. The author's proposal defines clear timelines at the beginning of the fourth quarter and the end of the fourth quarter of 2022. Launch of adatar.me extension for IOTA in testnet early Q4 2022. Launch adatar.me extension for IOTA in mainnet late Q4 2022. The budget requested for this project is $8,000 of this amount will be spent on one software engineer or two part-time software engineers. This amount of money I see is consistent with the proposal of the project. The team consists of 5 people, I see the author clearly lists what the team's current work is doing and the number of years of experience of each member. They are experienced people in Blockchain and are assigned specific jobs suitable for each individual. The group profile is very transparent, detailed by the author through the link https://loxeinc.com, making it easy for the community to follow and know who they are and can contact them more easily when needed. With a lot of useful information that the author has listed in the group, I believe that if the project is funded, success will come to them.", "q1r": 5, "q2": "(The author writes a similar proposal \"Adatar.me for ...\", but the content will mostly be the same, so when I analyze the project, there will be similar sentences. If all measurable metrics are displayed on the system of adatar.me IOTA extension in testnet and mainnet at the beginning and end of Q4 2022 something related to the number of new Fund 8 proposals then I think this project will be 100% tested. This proposal is an extension of a previously funded proposal, from Foundation 6: https://cardano.ideascale.com/c/idea/367448 with a score of 5 points with a vote of 2502 single digit quite high. Proving that the project of fund 6 of the group has been watched and voted by the community a lot, I believe that with this fund 8, if the project is funded, it will definitely succeed.", "q2r": 5, "assessor": "z_assessor_649", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8642, "q0": "IOTA (MIOTA). “Adatar.me for IOTA” from the “Cross-Chain Collaboration” challenge aims to port the adatar.me service to IOTA. Loxe, the team behind the project has submitted practically identical proposals, for 18 different blockchain projects, plus a duplicate for LTC, which I assume the Catalyst moderation team will remove, so 19 in total at the time of writing, each with the intent to integrate the service with a different blockchain. Given the scope of the project(s), I don’t have a problem with this approach in particular, but there are some issues that I will address throughout this assessment.\n\nI have meticulously verified the text of all 19 proposals (including the LTC duplicate submission) in a text editor that allows for snapshots and comparisons between snapshots (Scrivener), to make sure the content of the proposals is the same. They are practically identical, only the name of the blockchain project changes from proposal to proposal. In accordance with this, I will be reviewing the proposals as a proposal set (group). Similar to the proposals, I will also change the name of the blockchain project in each one of my assessments and include the text “(this proposal)”, to mark the exact proposal, where relevant.\nUnfortunately, I cannot yet attach files to assessments, otherwise, I would have provided visual evidence of this.\n\nI appreciate the fact that the team has made an effort to acknowledge the fact that this proposal is part of a set of proposals by stating “in this fund, we are proposing a few proposals similar to this one, to extend adatar.me to some other blockchains”, but unfortunately, I don’t feel like they go nearly far enough to make this point clear and to provide sufficient detail regarding this. I would have really liked to see an attempt to better inform the community and the voters in this regard and include the exact number of proposals they have applied for funding in Fund 8, and a list of titles and links for full transparency.\n\nAs such, in an attempt to provide the voters with some context and for easy reference, I will be providing a full list of the “Adatar.me for [INSERT BLOCKCHAIN]” proposals:\n\n\t1)\tAdatar.me for BTC - https://cardano.ideascale.com/c/idea/398770 \n\t2)\tAdatar.me for ATOM - https://cardano.ideascale.com/c/idea/398773\n\t3)\tAdatar.me for EGLD - https://cardano.ideascale.com/c/idea/398776 \n\t4)\t Adatar.me for MANA - https://cardano.ideascale.com/c/idea/405373 \n\t5)\t Adatar.me for XRP - https://cardano.ideascale.com/c/idea/405382 \n\t6)\tAdatar.me for DOT - https://cardano.ideascale.com/c/idea/405390 \n\t7)\tAdatar.me for SOL - https://cardano.ideascale.com/c/idea/405394 \n\t8)\tAdatar.me for ALGO - https://cardano.ideascale.com/c/idea/405398 \n\t9)\tAdatar.me for AVAX - https://cardano.ideascale.com/c/idea/405404 \n\t10)\tAdatar.me for SHIB - https://cardano.ideascale.com/c/idea/405417 \n\t11)\tAdatar.me for LTC - https://cardano.ideascale.com/c/idea/405427 \n\t12)\tAdatar.me for LTC (duplicate) - https://cardano.ideascale.com/c/idea/405436 \n\t13)\tAdatar.me for DOGE - https://cardano.ideascale.com/c/idea/405412 \n\t14)\tAdatar.me for LINK - https://cardano.ideascale.com/c/idea/405441 \n\t15)\tAdatar.me for ETC - https://cardano.ideascale.com/c/idea/405444 \n\t16)\tAdatar.me for ETH - https://cardano.ideascale.com/c/idea/405448 \n\t17)\tAdatar.me for FTM - https://cardano.ideascale.com/c/idea/405467 \n\t18)\tAdatar.me for XTZ - https://cardano.ideascale.com/c/idea/405472 \n\t19)\tAdatar.me for IOTA (this proposal) - https://cardano.ideascale.com/c/idea/405482 \n\nI can understand  the thinking behind submitting a different proposal for each blockchain the team intends to port Adatar.me to, as opposed to having a single proposal with all blockchains. It allows the Cardano community to vote and fund those it deems necessary and views as worthwhile investments and voters can choose to allocate funds to as many as they want. Having said that, my concern is that the average voter will only discover and know of the existence of maybe 3 or 4 proposals as it stands because the existence of the entire proposal set isn’t clearly and transparently pointed out to them. \n\nI really wish that the team had taken the time to make this point clear and to provide context. As this is more than a simple assessment of a proposal and is in fact the assessment for the entire proposal set I want to take the time to provide the voters with some context about the selected blockchains. Of course, I can’t go into detail about each project, but I want to at least include one data point for quick comparison - their ranking by market cap. I know that’s not always the most relevant metric, but it can serve as an indication of a blockchain’s popularity:\n\nThe list will have the following structure:\n\nRank by Market Cap - Project Ticker (name) - Market Cap Value (in billion dollars on https://www.coingecko.com on 2022.03.24)\n\n\t•\t1 - BTC - $818B\n\t•\t2 - ETH - $365B\n\t•\t6 - XRP - $40B\n\t•\t9 - SOL- $31B\n\t•\t10 - DOT - $22B\n\t•\t11 - AVAX - $22B\n\t•\t12 - DOGE - $18B\n\t•\t15 - SHIB - $13B\n\t•\t20 - LTC - $8B\n\t•\t22 - ATOM - $8B\n\t•\t24 - LINK - $7B\n\t•\t28 - ETC - $5B\n\t•\t29 - ALGO - $5B\n\t•\t36 - EGLD - $4.2B\n\t•\t38 - MANA - $3.9B\n\t•\t43 - FTM - $3.3B\n\t•\t48 - XTZ - $3B\n\t•\t60 - IOTA (MIOTA) (this proposal) - $2.1B\n\nThe prospect of porting a Cardano native project to multiple chains is one with a lot of potential in theory, and it definitely addresses the objectives of this challenge and I hope this effort will help the Cardano community decide which ones the treasury should invest in.\n\nIf this proposal actually manages to attract a sufficiently large part of the IOTA community and actually use a product that has its origins on Cardano, thus exposing them to the Cardano ecosystem, the impact on the ecosystem could be huge. However, I have some reservations about that prospect actually happening based on the contents of this proposal, which I will outline throughout this assessment.\n\nMy main concern is regarding the potential impact of the adatar.me project as a whole is related to its potential for adoption, first and foremost by the Cardano community, something that I view as necessary for it to be adopted by users of other chains. I have visited the adatar.me website and I've discovered that only 96 users have signed up and only 76 adatars have been created so far (at the time of writing). I find these numbers to be low considering that the project has received the exposure of being a successfully funded Project Catalyst initiative, as the proposal mentions. This is somewhat concerning and may be a signal of the project not gaining traction and being met with disinterest by the community. To put these numbers into perspective, the adahandle project, a project very similar in scope, and which only recently fully launched already has tens of thousands of users and close to 100,000 handle NFTs minted (91,290 NFTs minted under the policy ID at the time of writing).\n\nDiversity in the ecosystem is a good thing and should definitely be encouraged, but it only matters if the “other options” actually gain some traction and manage to attract a user base. The “Adatar.me - Growth Acceleration” https://cardano.ideascale.com/c/idea/404995 proposal, submitted by the team in the Miscellaneous Challenge, is for marketing the project, but after reading that proposal I was left with the impression that marketing and promotion is an afterthought for the team.\n\nHowever, the team is competent, and from their past engagements with the community I know they are dedicated to the Cardano mission. Because of this, I’m awarding +1 to my Impact score as a reflection of the hope that they will find solutions to these problems and try to be more transparent with their proposals in the future.\n\nSide Note: \nIn addition to the 18 Adatar.me for [INSERT BLOCKCHAIN] proposals requesting $144,000, Loxe, the team behind the avatar.me project has posted an additional 5 proposals to 3 different challenges, requesting an additional $207,000 in funding for the adatar.me project. Personally, I don’t view this as a problem in itself, I just consider that the voting community should have been made aware of this.\n\nF8: DApps and Integrations:\nAdatar.me to NFT - https://cardano.ideascale.com/c/idea/405209\nAdatar.me Address Book - https://cardano.ideascale.com/c/idea/405041\n\nF8: Open Source Development Ecosystem:\nOpen API for Adatar.me - https://cardano.ideascale.com/c/idea/405179\nAdatar.me Website Widget - https://cardano.ideascale.com/c/idea/405027\n\nF8: Miscellaneous Challenge:\nAdatar.me - Growth Acceleration - https://cardano.ideascale.com/c/idea/404995 ", "q0r": 4, "q1": "Adatar.me for IOTA is part of a set of 18 (+1 duplicate) functionally identical proposals that aim to enable the adatar.me project to integrate with different blockchains. Each proposal is for a different blockchain.\n\nThe roadmap is rather sparse and I would have definitely liked to see a bit more details about the engineering part of it, to make me feel that the team has a good understanding of the project(s) they are embarking on.\n\nWhile I don’t necessarily find fault with the approach of submitting identical proposals for dealing with very similar tasks, that have only a single different parameter, for example, translations into multiple languages of the same content, or as is the case here porting the same application to multiple blockchains, I do think it’s a problem that the volume of work for each one is estimated to be exactly the same. Even if the developers won’t be interacting with the blockchains themselves, but with the wallets for these blockchains, as they mention in the proposal, still every wallet and every blockchain is different, built with different technology, or with different approaches and on different principles. If this estimate is an average I would have liked to see that mentioned in the proposals.\n\nThe budget breakdown is just one line, but that is perfectly ok in this case since the whole budget of $8000 is intended to go towards the salary for one month of one developer. That’s roughly $50/hour assuming a 40 hour workweek - that’s not a detail included in the proposal, but I think it should have been.\n\nThe budget requested for porting the Adatar.me solution to a single blockchain is low, but feasible, at $8000, however, the budget for all the 18 proposals (not counting the LTC duplicate) adds up to $144,000 out of the total challenge budget of $400,000. I don’t view this as a problem in itself, however, I wish the Loxe team would have been more transparent about this and made the info readily available in the proposal. That would have assured that the voters have a complete picture of what they are voting for.\n\nAs I’ve said, the proposals are identical, and a 1 month development time is given for each, but what will happen if all 18 or a large percentage of the proposals will be funded? Will they be done in sequence, meaning that it will take approximately 18 months to deliver the whole set? If this is the case what will determine the order of the sequence? In any case, that could mean the deliverables for this proposal(s) will be ready on mainnet at a much later date than the estimated Q4 2022. The proposals do mention that “other members of our team may be pulled into this work if needed”, but what will that mean for the actual development of the project? Is the team large enough, or will extra team members be hired? Most likely the team has some thoughts around this, and how they plan to execute, but I can only base my assessment on what’s in the text of the proposal(s), and unfortunately, the proposals are very light on details regarding this, and my feasibility score reflects this issue.\n\nA very good description of the team members involved with the development of this project is provided in the proposal, however since links to professional profiles (LinkedIn) or examples of other relevant previous work are not provided in the proposal, I had no way of verifying the claims around credentials and experience.", "q1r": 3, "q2": "Adatar.me for IOTA is part of a set of 18 (+1 duplicate) functionally identical proposals that aim to enable the adatar.me project to integrate with different blockchains. Each proposal is for a different blockchain.\n\nSince the team submitting this proposal has already received Catalyst grants they should already be very familiar with the auditability requirements of Project Catalyst. Given this fact, I was expecting to see a lot more clarity around the deliverables, milestones, and KPIs of this proposal. \n\nWhat is present is definitely a good start, but my score reflects the fact that in this iteration of the proposals the Auditability section, lacks sufficient detail and clarity.\n\nElements that would turn any of this set of 18 proposals into better versions of themselves in case they need to be resubmitted:\nA clearer description of its aim. Why is it important for a Cardano native project to integrate with other blockchains? And what would Cardano gain from that? \nA more descriptive, but still easy-to-follow plan for achieving its stated goals.\nUnambiguous, quantifiable, and trackable, metrics and KPIs for easy progress verification.\nAs an answer to the definition(s) of success question, try to identify milestones describing the expected, positive, results.\n\nNote:\nAssessing a set of 18(+1) proposals took approximately 2 days, almost the same amount of time as assessing 18 individually unique proposals, because of the steps I have described or included in the proposal, the cross-referencing with the other 5 avatar.me separate proposals plus the actual submission of 19 separate assessment on Ideascale with slight modifications.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8799, "q0": "This proposal does effectively address the challenge, as pointed out by the fact that they intend to extend this Catalyst funded technology to another chain. There is no direct tie back to the Cardano ecosystem other than the fact that it was done on Cardano first, but I still think this is a valid case given the definition of the challenge. It builds a bridge of goodwill and networking, though there is not a strong technical tie-in.", "q0r": 4, "q1": "I think this proposal has a reasonably good chance of success. The team is very experienced and has delivered on projects in the past. The only thing I would say is that there might be unknown dragons working on another chain, and I didn't see that any of the people working on this proposal has any prior experience working on IOTA. Therefore there may some \"unknown tax\" that the team will have to pay to get this completed.", "q1r": 4, "q2": "The only thing I don't like about this proposal, is that they shy away from declaring a more discrete and near term delivery date, even though they know that this will take a month to build. I wouldn't want to wait until the end of 2022 to know that this is complete if it should only take a month.\n\nI understand that they have multiple proposals out like this for other chains, but I would rather they be more direct on when this would be delivered if funded, then update the delivery date later based on how the other proposals go.", "q2r": 2, "assessor": "z_assessor_705", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9939, "q0": "Note to VCa : this proposal being very similar to several other proposals by the same team, my assessment may include similarities, intended to explain to voters the big picture project of the team.\nThis proposal covers an extension to IOTA addresses of an ongoing project ADATAR.me which has been funded in Project Catalyst Fund 6. Success is defined by the successful implementation of the extension, and adoption of this new extension. \nThis proposal matches the challenge main goal which includes the potential direction  “to expand Cardano based solution to other chains”. What I am lacking is how impactful the extension to this blockchain will be for the collaboration with Cardano, apart from the use on another blockchain of a Cardano originated service. \nAdatar.me offer to simplify the payment between people by offering an avatar connected to a wallet address and a search engine. One of the benefits is that it avoids doubling the payment fees, which happens when we make a first test transaction to verify that we target the correct wallet address. \n\n", "q0r": 4, "q1": "A functional prototype of ADATAR.me is available, and the proposal includes an instructive live demo made in a Gimbalab’s playground. Apart from this, the Loxe Inc. team is identified and show evidence of having the required skills to make the project successful.\nThe requested funding is low (8kUSD). No on-chain code is required. What must be done is a connection to a front-end wallet. The risk is very low for the community that the project would not succeed or that this funding would turn out as a bad investment. It is highly likely that this proposal will be implemented successfully. \n", "q1r": 5, "q2": "As this is a short project, the only metric proposed to monitor the progress of the project is the reach of the 2 milestones launch on test net (beginning Q4 2022)/ launch on main net (end of 2022). I would have expected intermediate milestones to follow the development of the wallet connection solution which is the main task of the project.", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10046, "q0": "Adatar is a proposal to offer each address holder a unique username or address name linked to their wallet. This was when transferring funds the user can simply share his ADATAR and the full cardano address will be instantly linked. \nThis can help avoid wrong transaction and facilitate addressbooks. \nSimilar projects exist in CArdano space and have over 100k address minted (ADAHANDLE). In addition the other ecosystems such as ETH have the .eth handles that are most common. \nThis does not necessarily mean exclusivity but most probably the first to market and most used address nickname service will overcome the rest. \nHowever adatar proposes a novel approach to cross bridge over new blockchain, which is totally a creative step to link various wallets from multiple blockchains with the same adatar. I would imagine for the majority of the users on cryptocurrencies have multiple wallets and would like a simple way to share their addresses with one unique nickname.  ", "q0r": 3, "q1": "ADATAR team have shown that their idea as original in the previous Fund6 and had a golden window to be the first to market and compete with Adahandle that currenlty has 100k different unique address nicknames. \nI would imagine if the team has shown momentum at the right time and utilised the previoius catalyst fund with other investors accelerated to market their idea. \nfor the delay or slowed onboarding of the previous project I would state there is a slight risk for similar results for this fund8 proposal. \nIn addition the breakdown of the cost rather small does not reflect the push needed to breakthrough many blockchains and amass a following. \nI have seen the adahandle hype and it was consistent push over several months to bring attention and light to the importance and benefit of carrying a adahandle. \nThe success of this project is unfortunately not techincal it is mainly marketing and for this reason the propsal is laking this segment for their success. \nFinally for the last nail, part of their KPIs is to bring awarness to their project and run the adatar system, but there isnt any guidelines or target needed. I would recommend to at least acheive 50% of the current existing adahandle wallet holders.  ", "q1r": 3, "q2": "Unfortunately, I believe this project is briefly described and was missing a major overlook to succeed. The auditing part is similar as there are limited ways to manage or observe the project progress. I am unable to list the parts the can confirm the work has been performed other than seeing a working website. ", "q2r": 2, "assessor": "z_assessor_785", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10367, "q0": "👉NOTE! Because of the similarity content in the proposals, my assessments and rating for the proposals started with: 'Adatar.me for...' submitted by Victor Corcino and his team members in the same campaign Cross-Chain Collaboration might look similar. This is my thought after spending a lot of hours reading on those proposals and the previously funded proposal. This was not copied from anyone.👈 The Adatar project is really useful for the projects that are being built on the Cardano blockchain such as SundaeSwap, MinSwap, Liqwid... able to scale up to other blockchains. Within this proposal, they provide a solution to help the Cardano-based projects can be adopted by the IOTA blockchain and its community. There are no significant risks during adding IOTA to Adatar.me at all. I rate 5 stars for the Impact.", "q0r": 5, "q1": "👉NOTE! Because of the similarity content in the proposals, my assessments and rating for the proposals started with: 'Adatar.me for...' submitted by Victor Corcino and his team members in the same campaign Cross-Chain Collaboration might look similar. This is my thought after spending a lot of hours reading on those proposals and the previously funded proposal. This was not copied from anyone.👈 \n\nFor the roadmap, I know what you are worried about that is not sure which proposals are going to be funded, so your solution is to write a proposal for each blockchain separately. Then, there are 19 proposals with similar content were submitted to the same campaign. But if other projects make proposals to request funds for every their small milestones like what you have done. Our Catalyst community will have an extremely large number of proposals. The CAs and vCAs will have to spend a lot of time to assess these proposals; The CA bonus base budget for each proposal will be broken down; The voting community also doesn't know which of your proposals to vote for.  My suggestion is to focus on 1 proposal to request a bigger total budget, and a broken-down budget to add separately blockchain. This will limit the dispersion of resources of the Catalyst community, and your Adatar project will be highly valued in the minds of CAs and voters. I strongly believe in that because you have succeeded with the previous proposal in Fund 6. \n\nAbout the budget, the $8.000 salary for 1 full-time (or 2 part-time) software engineer(s) is acceptable. It is the average salary for a software engineer in the US. But I have a question: Will you need 1 full-time engineer to integrate into the IOTA blockchain only or will need several engineers to integrate into other blockchains? My understanding is this is an iterative work, almost their work follows a process, it is similar to Cardano blockchain, needs only 1 or a few engineer(s) can complete these tasks. Furthermore, because this is a continuation of a funded project, part of the cost of integrating onto the IOTA or another blockchain is covered in the previously funded proposal ($84.000). Because of this reason, I will not rate the full stars. \n\nThe team has 5 people, who are experienced engineers, who have worked together for a long time in Loxe company. We can easily communicate with them through the profile links attached on their company website https://loxeinc.com/#team. One of them is Victor Corcino who is quite friendly with the Catalyst community, as he is the one who built the toolkit for CAs, vCAs, and Voters.", "q1r": 3, "q2": "👉NOTE! Because of the similarity content in the proposals, my assessments and rating for the proposals started with: 'Adatar.me for...' submitted by Victor Corcino and his team members in the same campaign Cross-Chain Collaboration might look similar. This is my thought after spending a lot of hours reading on those proposals and the previously funded proposal. This was not copied from anyone.👈 - It is a very clear success of this proposal is the successful implementation of the adatar.me IOTA extension and adoption by its community at the end of this year. This is an extension of a project that has been funded by Fund6. Its former name was 'Gravatar for ADA Wallets'. The proposal was on the top 5 of Fund6 power results and has attracted 2,502 individual wallets voted 'YES' with a total power of ₳401,288,824, which proves that the project has received great attention from the community. They have launched in mainnet in February 2022. For those reasons, I rate 5 stars for the Auditability.", "q2r": 5, "assessor": "z_assessor_89", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10634, "q0": "This proposal somewat meets the criteria of a Cardano-based project expanding into other chains. As Adatar is relatively new, it does not have the popularity or the wide use of Adahandle. That is not to say it should not attempt to compete. Competition is good. But it would seem better for Adatar to expand within Cardano than onto other chains. \n\nWhile it does not seem to have any interoperability effects, this proposal would benefit IOTA by having a Catalyst-created solution for the user experience problem of sending transactions easily. Adatar could also do very well there due to first-mover advantage.\n\nThe score reflects how this proposal benefits one chain more than the other, or both.", "q0r": 3, "q1": "This proposal has shown the team’s ability to deliver a product. Adatar is live on Cardano. The proposal includes the team’s experience and it is impressive. \n\nThe challenge however does mention “catalyst-created solutions adopted by other chains/communities” as a key metric to measure. Based on the Twitter account, Adatar does not seem to be well adopted by the community. This proposal would benefit from a marketing plan, as Adatar has first-mover advantage on IOTA and can succeed wildly if it markets itself.\n\nBesides this point, there is high conviction that the team will deliver on its milestones.", "q1r": 4, "q2": "This proposal includes two milestones and a reasonable time horizon. It would benefit the proposal to include more concrete metrics for what organic adoption looks like( x number of users by Jan). This proposal could also benefit from including a github or something similar for the community to keep track of its progress.", "q2r": 3, "assessor": "z_assessor_948", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Add IOTA support to adatar.me.\n\n", "experience": "Loxe Inc. Team. Experienced team of software engineers and Plutus pioneers.\n\n"}