{"id": 383578, "author": "secondlayer", "title": "Open-source Catalyst voting app", "url": "https://cardano.ideascale.com/a/dtd/383578-48088", "category": 26237, "amount": 75000, "description": "Catalyst Votingアプリはオープンソースではなく、ネイティブなアセットイシュアーでは使用できません。", "funded": 1, "upvotes": 44510158, "downvotes": 15124290, "votes_result": 29385868, "votes_cast": 264, "f6_no_assessments": 6, "f6_rating": 3.055555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "One of the most basic tools for a DAO is the ability to organise voting without too much hassle. Having an open-source voting app at the ready, would greatly incentivise projects and companies to start building their DAOs on the Cardano blockchain.", "q0r": 5, "q1": "Some of the proposers are highly valued members of the community, due to their implication and participation in all matters in regard to the development and well being of the Cardano ecosystem.\r\nThe development team for the d'app has a verifiable record of successful projects, bringing a lot of confidence in the favourable outcome of the proposal. The plan is described succinctly, but has no loopholes that would hinder its assessment.", "q1r": 5, "q2": "The timeline is shortly presented, and it could have included a bit more details for a better assessment of the progress, but the KPIs are very clear and indicate that the team is well prepared and set to successfully develop the project. While not ideal, the proposal will have no problem in being evaluated for its progress.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 19, "ne": 1, "ng": 16, "nfo": 2, "vca_o": 1}, {"q0": "This team is proposing a new open source Catalyst voting App. In my opinion this proposal touch important problem. From a high level perspective this tool could be used in general to govern decentralized systems. So therefore it is within the challenge setting. Of course a better and foremost decentral and open source voting app will help to improve the Catalyst process and therefore positively impacts the development of Cardano. ", "q0r": 3, "q1": "The plan for implementation is only roughly described. Also the scope of the project doesn't get clear as details about technical implementation or basic underlying mechanism are missing. \r\nAlso there is not real proof of life of the proposer team nor references about relevant experience. Yes, they want to partner with someone to deliver the solution. However, by the given information it is not comprehensible how this will be done. Also the budget is not described in details, so it's hard to say if it's feasible or not.\r\n", "q1r": 2, "q2": "The presents a time horizon and has defined success criteria. But not measurable KPIs or metrics are presented. Also a documentation source to track the progress of this proposal is missing. I miss in this area that the proposer has not mentioned possible difficulties for the development and implementation. Creating an app is one thing, but how can you make sure that it will be used for the catalyst?", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 21, "ne": 2, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "The challenge is about decentralized organizations, but this proposal speaks about building an open source application only. It does mention multi-sig, but there are almost no technical details about this project, making it hard to judge.", "q0r": 2, "q1": "The company that has been chosen lists some of their customers, but we know nothing about the project they have been involved with. There are no crypto related projects certainly.", "q1r": 3, "q2": "This proposal is in the right direction, but just need more work. I would like to see more detailed description of how the application would work from technical point of view. Also, deliverables are little bit too open - what devices will be the voting app supported on? How long would it be supported? What is the feature set?", "q2r": 2, "assessor": "z_assessor_490", "no_vca": 18, "ne": 0, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "This open-source catalyst voting app proposal will introduce the first time open-source DAO voting app. It would encourage the native token holders to participate in decentralized governance process and hence it fits within the challenge nicely. ", "q0r": 5, "q1": "The proposer team will engage sub-contractors to deliver the proposal. About 80% of budget will be paid to the sub-contractor. The timeline looks quite short as it is expected to hit the market in 3 months. The proposal also did not specify the risk and challenges in successful implementation.", "q1r": 3, "q2": "The proposal need to address challenges that might incur during implementation and define the KPIs in numeric term so that the community can measure the performance of the team better.", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 16, "ne": 3, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "In the proposal, the team briefly points out the problem and also offers a solution in brief. It is not clear how this project can positively impact the Cardano ecosystem and the question is how will it add value to the Cardano and Catalyst ecosystem? The KPIs listed in the proposal do not match the ones indicated in the challenge. The proposal is not able to scale and address future challenges.", "q0r": 3, "q1": "In the proposal we have all the necessary information via the website about the team. The team is corporate oriented and as such does not have the skills and knowledge to implement this project. Through its IT recruiter it would be necessary to hire external collaborators to realize the idea from the proposal (developers, blockchain gurus). It is not clearly defined how many people will work on this project but the budget has been presented. Since the budget is not broken down into identifiable items it is difficult to discern whether the budget is realistic and whether the project can be realized. The team does not ask for any additional funds. It would be good to have a detailed implementable plan and also details of actionable tasks and order of execution. The proposal sets out the timeframes within the project should be completed, but it would be good if it was elaborated in more detail in terms of dates, months, Q1, Q2, Q3. It would be good to list the necessary resources and show the technical aspects needed for the implementation of this project. There are potential risks in any project so it would be great to have a clear insight into the potential risks and an idea of how to address those risks.", "q1r": 2, "q2": "Unfortunately the team does not state a roadmap with milestones but the time horizons for achievement are clearly communicated. Although KPIs do not match the ones indicated in the challenge they could be used to quantify the success of the project and make sense. Unfortunately, the community cannot track the development of this project because the proposal itself has not been elaborated and does not provide all the necessary information.", "q2r": 2, "assessor": "z_assessor_656", "no_vca": 17, "ne": 5, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "I completely agree with this idea, at present, Catalyst voting still has many problems to solve such as (transparency, real-time results, easy to use, easy to follow) and the development is also slow. Regarding this proposed solution, it is not clear, information that changes or improves compared to the old way should be added. Will the voting results be posted on the blockchain?", "q0r": 4, "q1": "Identity, experience and expertise should be clearly introduced, how many people will be involved in the construction of the team. The new proposal states the orientation without a solution, the steps to be taken, and the parameters related to the construction of the DAO. The proposed cost is not clear what to use for only the total amount, it will be difficult to determine the cost to meet the successful implementation of the project or not.", "q1r": 2, "q2": "The proposal still lacks a roadmap over time, and there are no criteria for measuring success according to the roadmap. The risks and challenges need to be taken into account and added to the proposal. In addition, the long-term orientation should be stated when voting can be used with the functions that will be built further", "q2r": 2, "assessor": "z_assessor_697", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "投票アプリ「Catalyst」のオープンソース版を開発", "experience": "私たちが選んだサブコントラクターは、深いモバイルアプリ開発の経験を持つ https://www.aikitdigital.com/clients です。"}