{"id": 383801, "author": "vinaydeva", "title": "KONMA DAO", "url": "https://cardano.ideascale.com/a/dtd/383801-48088", "category": 26237, "amount": 75000, "description": "伝統的な統治形態では、手続きの調整や実施のために多くのレベルの管理者が存在するため、意思決定が遅くなる。", "funded": 1, "upvotes": 33154336, "downvotes": 14412439, "votes_result": 18741897, "votes_cast": 214, "f6_no_assessments": 6, "f6_rating": 3.7222222222222228, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=1196"], "media": [], "f6_assessments": [{"q0": "社会生活のための技術的インフラを構築するという野心的な提案です。まさに野心的なプロジェクトです。しかし、チャレンジの説明書には、このチャレンジは、\"...CardanoでDAOを管理するための、他のブロックチェーンよりも、より多くの、より良いソリューションをもたらすこと \"と明記されています。KONMAとは？それは、\"・・・透明性、セキュリティ、分散性などの特徴を持つ、ブロックチェーン技術によって駆動される分散型の自律組織 \"です。このように、この提案は、DAOを作るインフラの提案ではなく、DAOを作ることを説明・正当化しているため、一見すると、課題に効果的に対処しているとは思えません。このため、この提案は最初の星1つの評価となりました。\r\n\r\nしかし、提案者は目標のセクションで、成功とは「...KonmaとそのDappsを統治するのに役立つ完全に機能するDAO」であると書いています。また、\"一度DAOがコミュニティの助けを借りて設計・開発されれば、Konmaがさらに多くのDAOをCardanoのエコシステムに取り込み、Konmaや他のコラボレーションの下で様々なdAppsを統治するのに役立つだろう \"と書くことで、この課題がCardanoをDAO作成のための最良の選択とすることを意識していることをほのめかしています。しかし、Konma DAOの創設が、カルダノ上で構築された優れたDAOとして、他の人にもカルダノを使ってみようという気にさせること以外に、どのようにしてこれを達成しようとしているのかはまだ不明です。\r\n\r\nこのプロジェクトは、ソースコードがオープンであるという寛大な解釈をすれば、世界中の組織の立ち上げに役立つDAOインフラになる可能性があります。提案者が本当にそのような意図を持っていると仮定すれば、KONMAが解決した問題は、DAOを作るインフラとして簡単に活用できるでしょう。\r\n\r\nフィードバック提案チームには、チャレンジの説明と何を求めているのかをよく考えることをお勧めします。このチャレンジはDAOのインフラに関するものであり、Cardano上でDAOを作るための資金調達ではありません。この提案書の問題記述を見ると、提案者はガバナンスとそれがどのように効果的でないかについてかなり懸念しているように思えます。そこで私は、意思決定に特化したDAOランチャー・プラットフォームを開発することを提案します。つまり、DAO作成者がDAOを立ち上げる際に選択できるいくつかの投票プロトコル（直接民主主義、代表制、いくつかのミックスなど）を開発するのです。", "q0r": 3, "q1": "このチームは、Web3開発や他のブロックチェーンでの開発に関連した経験を持っていることが示唆されています。さらに独自に調べてみると、このチームを評価できるLinkedInのプロフィールがいくつか見つかりました。このスタートアップは数年前から存在しており、ウェブサイトはかなりプロフェッショナルなものになっています。彼らは明らかにブロックチェーンの分野に精通しており、一人はEMURGOのブロックチェーンコースを受講して証明書を取得していました。+星1つ\r\n\r\nしかし、彼らがCardano（HaskellとPlutus）を扱う上での課題を認識しているようには見えませんし、この分野で成功するために必要なスキルを身につけることができるPlutus PioneersやPrism Pioneersプログラムを認識しているようにも見えません（次のラウンドへの強い推薦）。もしこれが示されていれば、もう一つ星が追加されるだろう。\r\n\r\nこれをオープンソースとして展開しようとしていることは、これがDAOのインフラの基礎となりうることを示しています。したがって、この提案にはもう一つの星が与えられます。+星1つ\r\n\r\nフィードバックこの提案を実行するあなたの能力について信頼できるケースを作るためには、チームのスキルを検証するのに役立つ簡単にアクセスできる情報を評価者とコミュニティに提供することが不可欠です。あなたの場合、これはLinkedInのプロフィールリンクやGithubリポジトリの資料を提供することを意味します。もうひとつのフィードバックは、予算額を低めに設定することです。予算が多ければ多いほど、コミュニティにエビデンスを提供するという点でハードルが高くなります。3～5万ドル以上を要求するプロジェクトは、最低限の実行可能な製品か、非常に強力な実績を持っているはずです。したがって、ホワイトペーパーを書いたり、パートナーシップを確立したりするためには、少額の予算を要求することが望ましいのです。", "q1r": 3, "q2": "提案者は、プロジェクトの週ごとの目標を明確に示し、時給の構成要素とコストの見積もりに分けられた非常に精巧な予算を持っています。そのため、5つ星としました。しかし、今後は、透明性の面で改善の余地があることを指摘しておきたい。以下のようなギャップがあるため、この提案は星を1つ失ったことになる。\r\n\r\nフィードバックコストの一部が構成要素に分解されていない。例えば、マーケティング費用が10,000ドルというのは大きな金額ですが、適切に正当化されていません。また、開発の時給が米国レベルに設定されていますが、チームがインドを拠点としていることを考えると、その正当性は明らかではありません（DAO開発に120時間の予算を組んでいますが、これはフルタイムの開発者であればわずか3週間であり、求める機能の多さを考えると現実的ではありません）。提案者はEmurgoにこれらの機能の開発を依頼しているのかもしれませんが、提案書ではその点が明確ではありません。また、「初期のブーストラップへの補償」が何を意味しているのか、さらなる説明が望まれます。", "q2r": 4, "assessor": "z_assessor_582", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This project proposes to impose a DAO and along with the other proposals that this project has filed for fund 7, they are aiming to create one of the larger (if not, the largest) DAOs on the Cardano blockchain. The ambition and magnitude of this project is huge and could pave the way for mass adoption in areas of operation, propelling the Cardano blockchain forward. All of this would start with the successful implementation of this DAO. So it has to be recognised that the potential impact of this proposal is big. ", "q0r": 5, "q1": "The team is currently incomplete, but there is an indication of intention to move fast and assemble needed additional developers within a timespan of 2 weeks. A suggestion that might help to find them is to simply use the seek-tags in the proposal. Further improvement would be to better identify the existing team by publishing each team member and their respective skillset so it can be determined what functions are still needed. This project has a very defined plan of operations in mind. The determination and organisational skills are exceptional. ", "q1r": 4, "q2": "The proposal is very auditable and contains every criteria prescribed in detail. The only thing in terms of improvement apart from team identification that I could find that would prove useful if clarified is how the ICO is meant to be conducted in the future.  ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 26, "ne": 3, "ng": 20, "nfo": 3, "vca_o": 1}, {"q0": "This proposal aims to support the governance of the Konma organization by creating a DAO. This challenge is asking for solution that will help to make Cardano the go-to-blockchain for DAOs. Comparing the challenge setting with the goals of the proposals I don't see a full alignement between challenge and proposal. It seems that KOnma has an active community, so at least we can expect that new people would enter our ecosystem.", "q0r": 3, "q1": "The team seems to be able to implement the proposed solution. Nevertheless, it would be helpful to provide more detailed references or a proof-of-life. The plan describes many details that are planned to include into this solution. To be able to further assess this proposal and see to full scope of this proposal some more details regarding the technical implementation would be helpful. The budget refers to the payment of different development tasks and  from this point of view, the amount can be fairly classified. The marketing budget could be explained in more detail.", "q1r": 3, "q2": "The schedule and the exact end result are described. For a better auditability it would be good to provide a documentation source. In addition, to measure success, not only general metrics could be mentioned, but clear numbers as a target. This would make it easier for the community to assess whether the implementation met expectations in the end.", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Konma is an existing \"Web2\" market place for food, art, and lifestyle items.  The proposers aim to evolve it to a \"Web3\" entity, and the purpose of this proposal is to build support for governance via a \"fully functioning DAO\" on Cardano.  There is a note regarding intellectual property that Konma DAO will remain a product of Konma, with \"rights reserved\", trademark, etc.  However, the proposal also says something to the effect that MIT open source license will be used, which presumably means that others could benefit from it as well, although perhaps only after modification and customization for their own purposes.  This makes me feel that this proposal perhaps does not fit the Challenge goal perfectly of delivering *tools* for managing DAOs.  Nonetheless, it may offer some value.  There is also some suggestion that Konma can bring other DAOs into the Cardano ecosystem, though I find the discussion of this too vague to be compelling.", "q0r": 3, "q1": "The team has some experience with Web3 hackathons, creating smart contracts, but no apparent background with Haskell or Plutus, and they plan to outsource the work in this regard; they hope to work with either EMURGO or MLabs.  There is not much material to convince voters that they proposers have experience in other important areas, for example DAOs, governance, etc.  The roadmap provided lacks much detail to assess.  The first priority is apparently to acquire Haskell/Plutus developers, and then design what they should build.  Strangely, the last two weeks (23 & 24) are simply stated as \"ICO\", which has not been mentioned elsewhere in the proposal.  The bulk of the proposal is heavy on jargon and light on details, which makes it difficult to assess what the project would even like to achieve, let alone how feasible it is that it will be achieved.", "q1r": 2, "q2": "Again, the roadmap is fairly vague and lacks detail, making it difficult to see how the project can be accountable.  A few KPIs are listed, but without any quantities (the reader/voter has no idea what would constitute \"high\" values of the proposed KPIs).  Apart from being unquantified, each of the KPIs is vague and makes reference to aspects that have not been explained in the proposal.  Overall, I cannot see this project being sufficiently accountable, especially for the relatively large budget requested.", "q2r": 2, "assessor": "z_assessor_499", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1, "reply": "Impact/ Alignment\nResponse:\nKonma in an existing web2 ecosystem (marketplace, community forum, upskill etc) we plan to convert all of them into web3, for which a DAO will exist to govern the above ( this includes the Dapps and other wings we are going to co associate with .\n“It will remain an intellectual property of Konma”, doesn't mean we are not allowed to give it to the community for free, such as access to the source code . Only entities with the name “Konma” will remain Konma's. But the code, usability and so on will remain accessible to the community \n*Our aim here is so that no one uses the name Konma, without our consent and knowledge * \nWe have plans for various DAO’s (NFT DAO, charity Dao, Trust Fund DAO etc). These will also consist of “tools” to manage such DAOs. \nWith respect to “bringing other DAO” we are highly collaborative with other NGO entities . for example Trees X Konma. Planting trees and afforesting in India. This entity will be made a DAO, an NFT DAO in specific, as such any other collaboration will also be made a DAO \n\nFeasibility\nResponse:\nHaskell devs are quite scarce , hence our collaboration with Mlabs and Emurgo. The confirmation with Mlabs and Emurgo arrived after the proposal submissions and we did not have the chance to make changes. Our guidance arrives from Mlabs and Emurgo as well as other DAOs we have researched.  Please get in touch with us for new updates, as we have updates on a daily basis. If nothing works with Mlabs and Emurgo (worst case scenario) our mitigation strategy is to employ devs as such and commence work . Any token would need to go through an ICO phase, either stealth launch or fair launch . week 23 & 24 will consist of Quality assurance , final auditing and the ICO phase.\n\nAuditability\nResponse:\nThe discussion forum for the DAO will be in Konmahood, as such a safe space for proposals and voters to come in consensus for further development . this will have a certain number of people present our KPI will be associate to the tribe running the discussions, hence as we grow we expect more in number and at this moment it is hard to pinpoint . the quantitative analysis is directly proportionate to the number of members present in the tribe"}, {"q0": "This is a DAO for their platform, Konma, which is a decentralized marketplace ranging from food to life-style products. DAOs on Cardano are still very few in existence, and this one will add some DAOs into it. This proposal envision to create a DAOs that govern their set of Konmas platform, from DEX to their marketplace. ", "q0r": 5, "q1": "The proposal provide the team profile on their website. They have their action plan laid out in details for the next 6 months. They're capable of identifying the team needed to recruit, complete with salary expectation and criteria (e.g the skills for Haskell developers are preferably a Plutus pioneers, the need of governance model designers, etc). However, it will be helpful if they explained about how the DAO is being developed, what are the core features to implement, and how it will be done. For example, the feature of being able to vote for the next DEX swap token, vote on community made proposal for Konma, etc. This is a rather important aspect since creating a DAO is complex, hence narrowing it down to identifiable items (of goal and achievement) will help the development to be more focused on the objective.", "q1r": 4, "q2": "The metrics and KPIs is well defined, the roadmap is laid out in week interval, and they also have a website to check on. However, since this is supposed to be a DAO and open for audit for the public, it would be better if they mention or provide link for their source code repository. This will make audit process more transparent and available to the public.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 17, "ne": 5, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The project that this team shows in the project will help to solve the slowing decision making/ delivering of traditional forms of governance by designing a DAO with features like transparency, security, and decentralization. Surely they're within the challenge of DAOs <3 Cardano. \r\nTheir included KPIs show that this project is aligned with the challenge givens, more than that these KPIs affect directly the number of the proposers, validators, and voters. Therefore, this project is vital and essential for the development of Cardano ecosystem now and then. ", "q0r": 5, "q1": "The team shared their very detailed implementation plan is not just in user features but also tech. These detailed explanations can help us to clarify what they put in the detailed roadmap. \r\nIn addition, the budget they asked for is reasonable with their plan and the roadmap. \r\nThe only thing the team misses here is the proposal is their faced risks that will appear in their action plan. Hope that they can be aware and have plans for limiting these risks. ", "q1r": 4, "q2": "They have a roadmap that divides into 2 weeks periods and outlined KPIs that will help Catalyst community audit the project clearly. \r\nThe team also has a great view of the problem context that was described into examples. It helps easier to understand the standing problem then helps us understand how the solution can solve it effectively. So, I think all the detail in the proposal are clear and concentrate on what the team wants, and they're all clarified. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "DAOは、KONMA ORGとそのdAppsを管理し、より簡単に分散型コミュニティを提供するためのものです。", "experience": "Web3のハッカソンに参加し、ETHとBSC上でERC20、ERC721、ERC1155を利用したスマートコントラクトを作成しました。"}