{"id": 384243, "author": "mlabs", "title": "MLabs DDAO", "url": "https://cardano.ideascale.com/a/dtd/384243-48088", "category": 26237, "amount": 72000, "description": "カルダノでのDApp開発は、開発者やコミュニティ構築者にとっていくつかの課題があります。", "funded": 2, "upvotes": 151536528, "downvotes": 1305407, "votes_result": 150231121, "votes_cast": 649, "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal addresses the problem of DAOs needing tools to build and manage themselves. They will ad value to the Cardano ecosystem by driving more users to Cardano as the need for DAOs and tools for DAOs is increasing. The key metrics of this proposal is directly aligned with the challenge and is able to scale as the community gets to vote on protocol changes and improvements.", "q0r": 5, "q1": "The relevant experience and team has been provided via Github page and they are very active in the Cardano community. Involved in several well-known projects. Like SundaeSwap etc. The budget is broken down into identifiable items with hours to complete. Total hours to complete this project comes down to 900 hours which seems reasonable. They describe all the different parts they have to build and how they will function. Not so much technical detail is given on the frontend and backend development. This info can reveal a lot about your product and some voters would want to know this. Any unanswered questions could steer voters away. They haven't considered any risks, but giving  the community the power to vote will make them resilient to future risks and challenges.", "q1r": 4, "q2": "They have a 12 month roadmap with milestones. They haven't provided any user/transaction based KPIs. The more KPIs you have the easier to track your project's progress and performance. The problem they are trying to solve is the need for tools to ease the pain of creating a DAO from scratch. They solve this by creating a governance protocol that is configurable and modular and able to deploy a DAO for communities.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 23, "ne": 6, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "This proposal will create a governance protocol for the running of DAOs for communites. Overall, this is a very mature proposal, well written and easy to follow even though its complexity. First, the proposer identified a pain point of DAOs, This well-needed solution could have a great impact on our ecosystem in general and in addition will support developers in creating related applications more easily. This could definitely accelerate adoption of Cardano.", "q0r": 4, "q1": "The presented plan has all details that you want to see on such a complex project. Also the team behind this initiative is very experienced and has already proven their ability to deliver such a software. the outlined plan, the experience of the team make a successful implementation very likely. Budgeting and tasks are linked together. From my perspective this budget compared to the impact of the proposal is very reasonable. Of course it is always possible to provide more technical information, however the outlined plan, the experience of the team make a successful implementation very likely.", "q1r": 5, "q2": "The proposer presented a clear roadmap, a clear timeline and a clear deliverable.\r\nThere is a already a repository linked, which is not filled yet, but it gives the community the possibility to track the progress of this project. The only thing that probably could be improved is to reflect more about the challenge that might occur in trying to get market acceptance for this project. Overall, this is a very well thought-out project that is ready to be implemented. Auditability is very well possible for the community.\r\n", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 19, "ne": 3, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The challenge clearly looks for DAO infrastructure proposals, which this proposal addresses by providing a DAO deployment platform with unique governance system based on a double tiered DAO and SaaS type system. ", "q0r": 5, "q1": "MLabs is a development company that works with IOG. They are deemed to have the necessary skills. Furthermore, the plan presented contains monthly metrics that we can measure such as the motherDAO launch dates and hourly breakdown estimates of what it would take to develop each component of the proposed plan. ", "q1r": 5, "q2": "Even though this is a company with IOG partnership, they do not indicate whether this will be open-sourced code. Nor do they indicate that they have some GitHub or Discord server which would allow the community to follow the proposal. Now, given that it is a company, I believe that they will be receptive to such demand of the community. Hence they still receive 4 stars because I give them the benefit of the doubt. \r\n\r\nFeedback: provide the community with some link where they can see what is going on, e.g. github or discord server to ask you about it. ", "q2r": 4, "assessor": "z_assessor_582", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "\"I agree with the idea of ​​a configurable and modular governance protocol, implemented to create DAOs for the community. Helping Cardano Dapps Grow Fast. The proponent also states the function the solution will perform and the rights of the participating parties holding the token. Highlights are the \"\"Epoch System\"\" and the Double DAO. MLabs also submitted an MLabs DTF proposal in Boosting Cardano's DeFi challenge. I also appreciate the team's ability to follow you guys work on the Githup link.\"", "q0r": 5, "q1": "The implementation plan of the proposed functions of the group is also clearly stated, but the group should also add details of the necessary solutions and parameters. For example how are the stakeholder interests calculated, how the treasury works and is optimal, is there any documentation that demos or demonstrates this method is better than other project methods, and then how the voting mechanism, how DAO smart contracts are automatically deployed and developed. The amount of money proposed to be allocated for each stage should be more clearly added, and the number of personnel involved in construction should also be fully supplemented.", "q1r": 3, "q2": "Project development roadmap and features fit on time and clearly documented headers, it would be great to include KPIs to measure how the work gets done. In addition to the project's risk challenge, many DAO projects are developed on Etherium, so you can refer to it to draw problems that need to be solved or made better.", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 16, "ne": 3, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Excellent proposal. Collect the objectives set in the challenge. This would have a great impact on the Cardando community. I would like to create my first DAO with your platform. In the development of the proposal, clearly identify a problem within the challenge that must be solved.", "q0r": 5, "q1": "I believe that if all the milestones set out in the roadmap are met, we are facing a successful project. MLabs provides information on the achievements and experience of the work team on its website. This is important because of the size of the project and the challenges that may arise and the capital requested.\r\n    ", "q1r": 5, "q2": "It has a 12-month roadmap, quite realistic timetable. There are audits. The calendar does not mention the creation of the website, or any mechanism to make progress transparent to potential users.", "q2r": 5, "assessor": "z_assessor_743", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "MLabsは、設定可能でモジュール化されたガバナンスプロトコルを実装します。私たちのプロトコルは、コミュニティのためのDAOを作るために展開することができます。", "experience": "MLabsはIOGのパートナーです。65名以上のHaskell開発者と、エコシステムで最も著名なクライアントであるSundaeSwap、Liqwidなどがいます。"}