{"id": 384327, "author": "heinz.gassner", "title": "EU-Compliant DAO Blueprint", "url": "https://cardano.ideascale.com/a/dtd/384327-48088", "category": 26237, "amount": 25000, "description": "DAOは、スマートコントラクトを導入したことによる論理的な帰結です。現在、多くのアプローチが不確実な法的領域を通過しています。", "funded": 2, "upvotes": 208245435, "downvotes": 2824133, "votes_result": 205421302, "votes_cast": 1166, "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": "The Proposal does not only address this specific Challenge very effectively, but shows with the project at general how well this project is designed. This Proposals is a part of an assembly of proposals which all together, build a series of very well stated proposals which are in the specific proposal we are assessing here. The Proposal is well aligned to the challenge's purpose and provides an effective and impactful solution.", "q0r": 5, "q1": "I do fully agree that the Team brings the needed experience and qualification and surely strong skills and a very committed engagement which is needed to successfully implement this proposal.  The KPIs and OKRs are well defined and realistic, the provided roadmap is sufficiently displayed and the proposal provides an overall strong intention in full alignment with the ecosystem which underlines the Proposals and the Proposers values.", "q1r": 5, "q2": "Given the fact that the proposing team is, as funded proposer from Fund 6, already familiar with the reporting process the likelihood of an accountable reporting process is very likely. The Team also presents their progress in the Catalyst Town Halls and shows a good intention to stay close to the community regarding the reports of the funded proposals.", "q2r": 5, "assessor": "z_assessor_362", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This team presents an idea on how to establish an EU-regualtion-compliant DAO-Blueprint. This could accelerate the adaption of DAOs in Europe and also help other DAOs to be set up the right way Therefore this proposal fits into this challenge. A solution like this could attract the blockchain gamer community to Cardano, which shows the potential positive impact of this proposal.", "q0r": 5, "q1": "The team is very active in the community and has the skills and enthusiasm to realize their vision. The plan presented is well developed and gives a good understanding of the newly created use cases. A little more information about the technical implementation would help to better understand the overall scope of the project. The budget is understandable and reasonable from my perspective. In general, I see it as very likely that this proposal will be implemented. ", "q1r": 5, "q2": "The goal and the result are clearly formulated. The team also clarifies by when the solution will be implemented. Success metrics are also clearly stated. The only thing that can be improved in this regard is to make appropriate documentation available, through which the community can monitor the progress of the project. Overall, the project is good to audit.", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 19, "ne": 2, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities and governance processes are for democratic and economic empowerment. DAOs are a powerful tool in this respect. I want to bring in my personal knowledge and experience on various governance models into action by assessing proposals in this challenge. The proposal adresses a clear problem, the complicated regulatory framework in the EU regarding DAOs and supranational organisations in general, as both EU-specific and nation-specific regulations need to be considered. Providing a blueprint framework for DAOs to deal with these regulatory challenges seems both reasonable and very effective, and since it will facilitate the forming of DAOs within the EU it will sure be beneficial for the Cardano ecosystem. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "DLT360 has so far shown (with their proposal from F6 they currently govern) that they are a serious and competent project partner for catalyst. I is highly likely that they are up for the challenge. The proposers know the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 3, "ng": 9, "nfo": 8, "vca_o": 1}], "solution": "私たちは、最初から正しい方法で物事を行うために、適応性がありEU規制に準拠したDAO-ブループリントを確立したいと考えています。", "experience": "30年以上にわたる業界リーダーとしての経験、柔軟なコアチームと著名なドメインエキスパートのネットワーク"}