{"id": 381114, "author": "seba", "title": "Cardano in Spanish", "url": "https://cardano.ideascale.com/a/dtd/381114-48088", "category": 26252, "amount": 6000, "description": "Falta de contenido oficial en español para el proyecto Cardano", "funded": 2, "upvotes": 99912313, "downvotes": 1758075, "votes_result": 98154238, "votes_cast": 314, "f6_no_assessments": 15, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"q0": "Enseguida me acordé de esta misma propuesta en f6 (https://cardano.ideascale.com/a/dtd/Cardano-Project-in-Spanish/366882-48088). Me parece muy válido que autores sin financiación cambien algunas cosas y lo intenten de nuevo, aunque aquí no queda muy claro si el autor consiguió financiación o no (creo que no, si no probablemente lo comentaría). La propuesta cumple muy bien el objetivo del reto de llevar contenidos del ecosistema Cardano a otros idiomas, y en este caso, al español, a través de la traducción de varios contenidos de youtube, puestos a disposición en un canal que ya existe y que ya tiene un amplio alcance de público . Aquí hay varios hechos positivos, empezando por el hecho de que el autor lleva mucho tiempo haciendo este trabajo y aportando beneficios a nuestra blockchain, también que el canal ya tiene mucha visibilidad, lo que acorta la etapa de promover una difusión intensa para que el dinero se financie, y también que el español es uno de los principales idiomas a trabajar para potenciar el alcance de Cardano. Por lo tanto, creo que esta propuesta tendrá un impacto muy alto.", "q0r": 5, "q1": "El autor demuestra de muchas maneras que está muy bien preparado para llevar a cabo esta propuesta. Primero, porque ya tiene el canal de youtube con muchos vídeos, suscriptores y visualizaciones, como nos informa a través de datos numéricos. Luego, por el vídeo que adjunta, en el que demuestra que tiene mucha facilidad para comunicarse y un dominio total del idioma español. En cuanto al presupuesto, la financiación se destinaría íntegramente al trabajo de traducción de los vídeos, incluyendo la edición, etc.; me gustaría entender dos cosas: ¿todo el trabajo de traducción lo haría el autor, o se contrataría un equipo? Creo que el trabajo sería individual, pero siempre es bueno estar seguro de cómo se desarrollarán las cosas. Otro punto es que, aunque el canal ya es bastante grande en cuanto a suscriptores y visualizaciones, creo que sería positivo que el autor destinara parte de la financiación a la difusión, tratando de ampliar aún más la audiencia. Respecto al paso a paso, creo que en este caso es bastante sencillo. El autor nos dice de dónde vendría el contenido a traducir (en definitiva, de canales que hablen de nuestra blockchain y que ya estén bien consolidados), y también cuál sería la frecuencia de publicación. Punto para el autor, que dejó esa información muy vaga cuando lo propuso en el f6. Por lo tanto, creo que todo está muy bien en este tema de la propuesta, sólo faltan algunas aclaraciones como el tema del trabajo individual/en equipo y cómo se haría la comercialización.", "q1r": 5, "q2": "Aquí la aubitabilidad es bastante sencilla. El autor describe detalladamente cómo sería el éxito, dándonos el contenido necesario para establecer el seguimiento. Lo que tendríamos que hacer ahora es literalmente monitorear. Tal vez elegir a unos cuantos miembros de la comunidad de habla hispana para que sigan el canal a diario y vean si se cumple lo prometido; ¿También sería muy positivo que el autor diera feedback a la comunidad cada, no sé, 6 meses? Para demostrar cómo está creciendo el canal, cómo es la interacción con el público, si algunas personas han mostrado interés en participar en Catalyst o en utilizar el blockchain, etc. Sabemos cuántos vídeos se publicarán, así que tenemos todos los datos necesarios para supervisar el proyecto, lo que tenemos que hacer es seguir realmente el canal a lo largo de los meses.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2, "reply": "IMPACT: No, unfortunately the proposal was never funded yet.\nFEASIBILITY: For the moment it is an individual work, I hope in the future the proposal can translate more words per month and also become a team. As for marketing, I was expecting Catalyst proposals offering SEO (search engine optimization) or those kinds of things, where other proposals could use their services to expand their audience and so forth. \nAUDITABILITY: To see if what was promised was done is quite easy by checking the Youtube Channel, Cardano Forum and so forth. Sure, reports can be offered monthly, every two months, 6 months, whatever.\n\nBut it would be nice to have a kind of audit from the same audience. There are several viewers of the channel that also understand English very well. Generally, they say that it is easiest and more comfortable for them to listen in Spanish rather than in English. These community members could serve as “auditors” of the content being published (not sure how). This could also be something implemented for Cardano translations across different languages.\n"}, {"q0": "This proposal is important regarding creating awareness in the spanish speakers which don't speak english, however, my feeling is that it doesn't solve the bigger problem, which is building methods to the person who is watching the videos to start walking by himself. The majority of the content in crypto in the world is in English, then maybe try to help these people develop the knowledge would, maybe, help more.\r\n\r\nHowever, this proposal reach the challenge, which includes non-English content and foment this community (which has this barrier). And it is astonishing how fast the visibility is growing.", "q0r": 4, "q1": "I remember this proposal in the last fund and it has adapted and got better. It is clear that the method proposed is feasible and the channel is growing each year.\r\n\r\nSince this is a continuous work, if you do not get funded, it will affect the production? Another point is maybe consider growing and allocating more people in this project and expand beyond youtube. Every month there is more people entering the cardano community and publishing more content – therefore there'll have more content than you'll be able to translate.\r\n\r\nOther idea would be open a platform where you could translate the ideas of spanish speakers to allow them to enter in the next funds. And not just translate, teach them and explain all the process and how to propose, etc.", "q1r": 5, "q2": "Since everything is published in the youtube channel, it's quite visible if it is delivering or not.", "q2r": 5, "assessor": "z_assessor_25", "no_vca": 17, "ne": 5, "ng": 10, "nfo": 2, "vca_o": 1, "reply": "IMPACT: There are much more community contributions, like written traduccions of blogs, of official Cardano Twitter accounts, Yoroi was and is translated by the community to help the non speaking english ones. There is another proposal named “Aldea” that also helps hispanic community members with Catalyst related things. This proposal is just one more thing in the whole. There are hispanic community Telegram channels with +12k subscribers where several tips are provided to the newcomers, which right at the beginning includes a recommendation to subscribe to the Cardano Castellano Youtube Channel.\nFEASIBILITY Let’s hope that if proposal is not approved will not affect production, up to this moment it was done without Catalyst funding. \n"}, {"q0": "Having contents translated into spanish is good and address so many countries (at least most countries in LATAM and Spain) and can be a valid entrance door, if done with quality and easy to understand. It does address the challenge.\r\n\r\nMy only concern here is that once Spanish speakers are engaged by the series of videos, when they enter to really deal with Cardano (invest, use catalyst, etc) they would still face a language barrier as most content is still in english.\r\nCreating a strong community can be a way to partially overcome this. Maybe it should be considered as next step or ascope expansion, proactively helping people to post their own proposals - provide guidance, mentorship, translation services, etc.\r\n\r\nHowever, based on the good numbers these series of videos already have, it can be safe to say that the impact of this project is good.\r\n\r\n", "q0r": 5, "q1": "As proposer already has the series of videos place and with good numbers, it's safe to say that this project is feasible.\r\n\r\nas the requested fund is only to keep doing the current jov, there's no need for a proper implementation timeline here. Budget breakdown is clear and sensible and its not an expensive project.", "q1r": 5, "q2": "There's a clear target to post one video per day and this is easy verifiable. Mabe it could be added also some sort of expansion rate as another metrics.", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 20, "ne": 3, "ng": 15, "nfo": 2, "vca_o": 1, "reply": "IMPACT: There are much more community contributions, like written traduccions of blogs, of official Cardano Twitter accounts, Yoroi was and is translated by the community to help the non speaking english ones. There is another proposal named “Aldea” that also helps hispanic community members with Catalyst related things. This proposal is just one more thing in the whole. There are hispanic community Telegram channels with +12k subscribers where several tips are provided to the newcomers, which right at the beginning includes a recommendation to subscribe to the Cardano Castellano Youtube Channel.\nAUDITABILITY: It is quite difficult for the proposal to provide expansion rates, number of new subscribers per month, number of views or those kinds of metrics. After almost 3 years of publishing content, there is quite a lot of historic data showing how unpredictable everything is. The following is a quite average Charles video that performed quite well when published. However, a very long time after that, 180 days, Youtube algorithm for some reason just decided to show the video again, and it got thousands of additional views and almost 600 subscribers. \nOn the other hand, there are amazing Charles videos, where he provides very important updates, that have even gotten negative subscribers (I can only imagine that is people angry with the project due to unrealistic price expectations or something like that) \nhttps://youtu.be/CyJZpyCDguo\n\nPerhaps following proposals can provide expansion metrics as KPIs and then address the highly fluctuable audience issue in the risk section. Would like to know CAs and vCAs opinion on this.\n"}, {"q0": "The proposer identified the problem of Cardano's lack of content in Spanish and presented as a solution the translation of videos about Cardano into Spanish. This proposal presents a good idea to increase the participation of Spanish speakers in Cardano's ecosystem, in line with the multilingual challenge. The proposal does not present a plan to remain financially sustainable in the future.", "q0r": 5, "q1": "The proposer provides evidence (YouTube channel) of his experience which shows that he has the necessary skills to implement his proposal. However, the number of people involved in the process is not specified. The budget has been detailed and seems reasonable. A plan of what will be done has been presented. The established deadline seems adequate. No relevant risk for project implementation was considered.", "q1r": 4, "q2": "The target problem was clearly presented, and its solution was also well clarified. A roadmap with milestones was not presented, which would be important to monitor the progress of the work. KPIs were provided but in a vague way, I think if I had a target number for example reaching 200k views per video etc it would be better to assess the project's success.", "q2r": 4, "assessor": "z_assessor_429", "no_vca": 19, "ne": 3, "ng": 13, "nfo": 3, "vca_o": 1, "reply": "IMPACT: The idea is, if we get funded, to continue submitting proposals for future funds, to grow the scope of the work, let’s say from 50k words per month to 100k per month. For the moment I’m doing this alone, it would be great if more community members could join this effort, we are looking for that\nFEASIBILITY: We will try to add risk and challenges to our next proposal, thanks. AUDITABILITY: It is quite difficult for the proposal to provide expansion rates, number of new subscribers per month, number of views, those kinds of metrics. After almost 3 years of publishing content, there is quite a lot of information that shows how susceptible to change everything is. The following is a quite average Charles video that performed quite well. However, a very long time after being published, 180 days, Youtube algorithm decided to show the video again, it got thousands of additional views and almost 600 subscribers. On the other hand, there are amazing Charles videos, where he provides very important updates, that have even gotten negative subscribers (I can only imagine that is people angry with the project due to unrealistic price expectations or something like that) \nhttps://youtu.be/CyJZpyCDguo\n\nPerhaps following proposals can provide expansion metrics as KPIs and then address the highly fluctuable audience issue in the risk section. Would like to know CAs and vCAs opinion on this.\n"}, {"q0": "The problem needing to be solved been identified and articulated namely lack of official Spanish content for the Cardano Project. This proposal falls within the scope of the challenge brief . This proposal show clearly how adds value to the Cardano system by increasing the visibility to Castellan speakers as well as daily increasing the volume of videos and transcriptions. This is an ongoing successful project. Key metrics are clear, reasonable and realistic.The key metrics and goals of the proposal fall within the scope of the challenge. Proposal can scale to address future challenges by increasing the output of videos and transcriptions if they so choose. In this one they have identified an output target of 1.4 videos per day on average,or at least 1 video per day. This project will have a positive impact on Cardano system\r\n", "q0r": 5, "q1": "The proposer has provided evidence of relevant skills and experience needed to complete the project. They have shown their youtube channel, Github, spreadsheet of all available videos and Profile information. These links are sufficient.I have visted links and contacted relevant people.They are highly competent, having done translation prior to this project and already having translated over 1000 videos over 800 days of the projects existence. The project is ongoing and successful so the number of people has been previously successfully identified. He has rationally and logically laid out his team structure and breakdown and is already successfully implementing the project.The budget has been outlined clearly and broken down into identifiable items which is a flat rate per word to cover costs of transcription, dubbing, editing, publishing. The budget is very reasonable to achieve the set goals. The proposer has not provided a verifiable plan if additional funding is required, but since this project has gone through several successful funding rounds there is no reason to suggest that additional funding would be needed for this round, since he would likely apply for more funding from F8 when it comes around. There is no plan for additional funding. \r\n\r\nThe timetable is realstic to continue the output started in previous funding rounds. The proposal provide a sensible and conductible plan for implementation in terms of the materials to be translated as well as how output would be generated. Resources  necessary to implement the proposal are well described.\r\nThe proposal clearly explains  technical aspects such as transcription, dubbing, editing, publishing which are steps needed in a localization project.The proposer has not considered challenges and risks relevant to a successful implementation\r\nBut this is not of concern since this is a long running successful localization project, and the funds required are to continue for a six months period.\r\n\r\nGiven experience and plan presented it is highly likely this proposal will be implemented successfully so I have given this a 5 star review. \r\n\r\nIf it doesnt get funded you can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n", "q1r": 5, "q2": "There is a clear roadmap with milestones and a time horizon for achievement. These include Monthly output of 50k words and number of minutes of video per month namely 360 minutes (6hs) of Spanish content.There are clearly defined Metrics/KPIs that define the success of the proposal namely volume of words translated , transcribed. Number of video minutes output and uploaded. There is a clear understandable description of the targeted problem as well as a clear understandable solution to solve it.Possible hurdles, challenges and difficulties have not been identified by the proposer but since this is a successful project , going over several funding cycles with success, it is unlikely to imagine that unforeseen problems will arise.  Nonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 21, "ne": 10, "ng": 5, "nfo": 6, "vca_o": 1, "reply": "FEASIBILITY: Unfortunately the proposal was never funded yet. This is the fourth time it will be presented. As the proposal says, no additional funding is required, even if more work than budgeted is done it will stay the same.\nAUDITABILITY: Thank you very much for your advice, I already took a look at Notion, hope something of this can be included in future proposals.\n"}, {"q0": "Due to the amount of views and videos that their youtube account has, it is clear that they have put lots of time and effort into this. They have a reasonable budget, and clear goals. As well as this, they also have  lots of experience in this area as they have already been posting translated youtube videos for 800 days.", "q0r": 5, "q1": "The proposer/s have given some concise goals, they have explained that they want to release one translated video each day. They have years of experience in this area and clearly know what they are doing. Something to add next time would be a set amount as a goal for the amount of views.", "q1r": 4, "q2": "This proposal will be easy to audit as it has achievable goals and a clear plan showing their pathway to getting 360 minutes of translated videos a month. They have goals that are easy to follow up as they succinct. One thing to improve on might be to add a timeline in shorter periods of time.", "q2r": 4, "assessor": "z_assessor_585", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1, "reply": "FEASIBILITY: It is quite difficult for the proposal to provide expansion rates, number of new subscribers per month, number of views, those kinds of metrics. After almost 3 years of publishing content, there is quite a lot of information that shows how susceptible to change everything is. The following is a quite average Charles video that performed quite well. However, a very long time after being published, 180 days, Youtube algorithm decided to show the video again, it got thousands of additional views and almost 600 subscribers. On the other hand, there are amazing Charles videos, where he provides very important updates, that have even gotten negative subscribers (I can only imagine that is people angry with the project due to unrealistic price expectations or something like that) \nhttps://youtu.be/CyJZpyCDguo\n\nPerhaps following proposals can provide expansion metrics as KPIs and then address the highly fluctuable audience issue in the risk section. Would like to know CAs and vCAs opinion on this.\n\nAUDITABILITY: Sorry, I didn’t get what you mean by “add a timeline in shorter periods of time”. I do not understand if you mean that a 6 month proposal is too long or something else. Thanks\n"}, {"q0": "Proposing to be a translation channel and introduce cardano on youtube in Spain. This is to promote the dissemination of necessary information and knowledge to non-English speaking countries, and should be encouraged in recent years. The proposal presents just enough content, but needs a detailed plan using PKI instead of being general.", "q0r": 4, "q1": "Proposals related to translation are not too strange at Catalyst, and are also easy to access and execute through the working group's youtube channel. So I think the feasibility of the project being completed is high. However, your group needs to have a clearer strategy in choosing what to share as well as how to reach the community.", "q1r": 4, "q2": "Through your group's youtube channel, we will see if the content is built seriously, according to the plan, so it is essential if you can calculate the number of videos with a specific length. , and the deadline you will complete the video.", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1, "reply": "IMPACT: It is quite difficult for the proposal to provide expansion rates, number of new subscribers per month, number of views, those kinds of metrics. After almost 3 years of publishing content, there is quite a lot of information that shows how susceptible to change everything is. The following is a quite average Charles video that performed quite well. However, a very long time after being published, 180 days, Youtube algorithm decided to show the video again, it got thousands of additional views and almost 600 subscribers. On the other hand, there are amazing Charles videos, where he provides very important updates, that have even gotten negative subscribers (I can only imagine that is people angry with the project due to unrealistic price expectations or something like that) \nhttps://youtu.be/CyJZpyCDguo\n\nPerhaps following proposals can provide expansion metrics as KPIs and then address the highly fluctuable audience issue in the risk section. Would like to know CAs and vCAs opinion on this.\n\nFEASIBILITY: What to share: Everything possible related to the Cardano project. As the proposal states, mainly the Charles, IOG, CF and Emurgo Youtube channels, but there is also much more Cardano related content being translated, as different interviews provided by Charles in other Youtube channels and so forth.\nHow to reach the community: The proposal also has a twitter account with +1.5k subscribers, content is shared (for the moment) in three hispanic Telegram channels with a total of around 20k subs.\n\n\nAUDITABILITY: \"Calculate specific length of videos:\" As proposal describes, the channel always tries to respect original video lengths. Charles AMAs are cut in pieces for audience ease and for a video library to be created\n"}, {"q0": "The proposal definitely fits into the challenge because providing translated videos with content about Cardano Project in Spanish would allow Spanish speakers to learn about Cardano and increase its adoption worldwide. In Campaign brief of the challenge 'Multilingual resources' we can see an example about the shortage of Cardano resources in Spanish. It states this proposal (if it is successful) will be an important contribution for the growth of Cardano ecosystem.", "q0r": 5, "q1": "The proposal provides a YouTube channel where over one thousand videos in Cardano already published and an attached document about what is being done very clear. They are strong evidences for the author's experience and relevant skills for the successful implementation. Therefore, feasibility of the proposal should not be a problem. \r\nThe budget is outlined clearly and broken down into identifiable items and be reasonable to achieve the set goals.\r\nI recommend the proposal should add information about the author for readers (as well as videos viewers) to know who he is, to connect him (if neccessary) and to raise the trust.", "q1r": 5, "q2": "I strongly agree the proposal is fully auditable because all video materials will be published in the Youtube channels and the success metrics are easy to see as well as to audit (number of followers to the Youtube Channel; the number of average views per video; the number of watching hours).", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 13, "ne": 1, "ng": 11, "nfo": 1, "vca_o": 1, "reply": "FEASIBILITY: Hi, I am Sebastian, a Cardano fan, a community member since almost 4 years ago. I have studied English since I was young. Making Cardano related translations for almost 3 years ago.\n\n\nPeople contact me through the Youtube Channel, through the Twitter account, through the channel email (cardanoencastellano@gmail.com), through Telegram, through idea scale. I am one of the administrators of the largest Cardano Telegram channel with over 12k subscribers, so I am in touch with several different SPOs, community members, etc. I am also one of the Cardano ambassadors.\n"}, {"q0": "It is important to explain all the news about Cardano and Catalyst to the Spanish speaking community.", "q0r": 5, "q1": "It is a Youtuber with proven experience in what he wants to develop. Indeed he already has started without funds as he shows in the link of the description. He is a native Spanish speaker so he can do accurate translations.", "q1r": 5, "q2": "He gives a budget to develop the work during six months, but he doesn't shows any scalability. He could mention that if he has success in YouTube increasing his followers and the community, he could run the channel in the future without the Catalyst funds, because Youtube would pay him for each video repetition.", "q2r": 3, "assessor": "z_assessor_765", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "AUDITABILITY: Youtube monetization is turned off. Youtube pay the channel only a few cents for content with even thousands of views. Most likely this is because Youtube algorithm is classifying content as “not original” or “not fully original”, therefore monetization from Youtube for this channel is almost non-existent. Also, in the country where I live, Argentina, it is very difficult to receive a foreign currency, and if you do, the government will keep at least half of the amount, if you are quite lucky.\n"}, {"q0": "This proposal successfully addresses several of the objectives of the challenge eg. integrating new people to the Project Catalyst, increasing meaningful participation and number of participants in events by translating Cardano based English videos into Spanish and getting the Hispanic community involved through YouTube and Odysee channels.  The proposers provides a link to the YouTube channel where he claims to have translated and published over 1,000 videos in the past 2 years, a full list of published contents have also been provided.  Having visited his YouTube channel the fund requested of $6K is justified based on the number of subscribers and traffic flow and the number of videos he is proposing to publish in 6 months. The proposal is well written and should be easy to understand by voters. ", "q0r": 5, "q1": "Based on the information provided it is highly likely that the implementation of this proposal will be successful as the proposer already has an existing Channel with more than 8.9K subscribers and has over 500K views on YouTube.  The timeline and deliverables are simple to understand and look achievable.  The sum requested for the proposal is good value for money because it is proposed that one Cardano related video per day will be translated and published for 6 months as oppose to other proposals in this challenge where the funds requested are for a single event.", "q1r": 5, "q2": "The metrics are clear and measurable, they also look achievable.  The KPI's can be easily tracked by visiting the proposers channels for the number of continued followers and viewers of this project.  The proposer has also mentioned that transcript of video is published in the Cardano Forum, which will provide full transparency.\r\n", "q2r": 5, "assessor": "z_assessor_774", "no_vca": 15, "ne": 5, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The proposal identifies the problem that Spanish-speaking people encountering english language barrier within the challenge which needs to be solved. Providing translated videos in Spanish for educating and informing about the Cardano Project could engage the Cardano community and help to develop ecosystem. Number of non-English speakers joining Cardano community and Number of courses translated to different languages are the key metrics and goals of the proposal align with the outlined this challenge setting in the next 3-6 months. The proposal is able to scale to address future challenges.", "q0r": 4, "q1": "Proposer has available Youtube and Odysee channels, a really good Youtube channel has +8k Subscribers and +500k total Views approved good ability of the author in  attracting and engaging community. Right from the start, I could not find any link of Odysee channel but I received his latter replying on my comment  and it could help understand more about his proof of work. The link of sample video with simultaneous interpreting podcast help me know his relevant skills and experience needed to implement the proposal. But I could not find any reference link of team members to know about each members with their skills and background, so it's better if proposer could give out more details about team such as: Twitter, Linkedin,...\r\nThe budget is outlined clearly and broken down based on per word with transcription, dubbing, editing, publishing  included and is reasonable to achieve the set goals. The proposer still continues working on this proposal in future funds after 6 months so it's better to provide a verifiable plan for additional funding.", "q1r": 4, "q2": "The roadmap and milestones are clear for achievement. But the KPI is just continuously increasing the number of followers, the number of average views per video, the number of watching hours in common. So it's better if it is quantified by the particular number such as the increase number or percentage of viewer or follower per month that would make it easier for the community to follow up. \r\nIt'll be perfect if the proposer mention possible difficulties and how to deal with them, such as the quality of translation that need to get feedback for improvement from community.", "q2r": 4, "assessor": "z_assessor_775", "no_vca": 12, "ne": 4, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "FEASIBILITY: For the moment it is an individual work. The idea for the future is to expand, to translate more words per month and to become a team. Hope more community members would like to contribute to this proposal.\n\nHi, I am Sebastian, a Cardano fan, a community member since almost 4 years ago. I have studied English since I was young. Making Cardano related translations for almost 3 years ago.\n\nAUDITABILITY: It is quite difficult for the proposal to provide expansion rates, number of new subscribers per month, number of views, those kinds of metrics. After almost 3 years of publishing content, there is quite a lot of information that shows how susceptible to change everything is. The following is a quite average Charles video that performed quite well. However, a very long time after being published, 180 days, Youtube algorithm decided to show the video again, it got thousands of additional views and almost 600 subscribers. On the other hand, there are amazing Charles videos, where he provides very important updates, that have even gotten negative subscribers (I can only imagine that is people angry with the project due to unrealistic price expectations or something like that) \nhttps://youtu.be/CyJZpyCDguo\n\nPerhaps following proposals can provide expansion metrics as KPIs and then address the highly fluctuable audience issue in the risk section. Would like to know CAs and vCAs opinion on this.\n\n"}, {"q0": "This project will help people that speak Spanish to understand cardano more clearly by continuing to provide helpful videos for the next 6 months, which is obviously very important due to the large amount of people in the world who speak Spanish. They already have this account so growing it will be easier than starting a new account.", "q0r": 5, "q1": "This person has a good background in this area because they have had a youtube account that has been helping people learn how to use cardano for over 2 years, if you decide to fund this project it will grow and help a lot of spanish speaking people around the world. This plan seems simple and easy to accomplish, and because this person has already got 8k subscribers and their account is growing they have a good amount of experience and should be able to continue their youtube account easily.", "q1r": 5, "q2": "They have provided a simple plan with deliverables per month and a budget broken down with a cost per word. They said they would like to watch their youtube account grow but it would be useful to set goals on how much they think it is possible for their account to grow. Overall I think they have provided good milestones to reach with daily uploads and word counts.", "q2r": 4, "assessor": "z_assessor_776", "no_vca": 12, "ne": 3, "ng": 8, "nfo": 1, "vca_o": 1, "reply": "AUDITABILITY: It is quite difficult for the proposal to provide expansion rates, number of new subscribers per month, number of views, those kinds of metrics. After almost 3 years of publishing content, there is quite a lot of information that shows how susceptible to change everything is. The following is a quite average Charles video that performed quite well. However, a very long time after being published, 180 days, Youtube algorithm decided to show the video again, it got thousands of additional views and almost 600 subscribers. On the other hand, there are amazing Charles videos, where he provides very important updates, that have even gotten negative subscribers (I can only imagine that is people angry with the project due to unrealistic price expectations or something like that) \nhttps://youtu.be/CyJZpyCDguo\n\nPerhaps following proposals can provide expansion metrics as KPIs and then address the highly fluctuable audience issue in the risk section. Would like to know CAs and vCAs opinion on this.\n\n\n"}, {"q0": "This proposal identifies the problem in english language barrier within the challenge which needs to be solved that Spanish speaker could not access content of Cardano project easily. The proposal will bring translated videos in native language for educating and keeping Hispanic community that help Spanish people know more about the Cardano Project, engage and grow up the Cardano community and developers therefore Cardano ecosystem developing at an exponential rate.  The goal of increasing interest in the Hispanic communities in learning and building realistic applications on the Cardano is well aligned with the outlined this challenge setting.  But the proposer need to provide more details about key metrics like: the increased number of followers to the \"Cardano Castellano\" Youtube Channel or its increased percentage ratio compared with the current situation after 6 months.\r\nThis more interest of  Hispanic community will approve that the proposal is able to scale to address future challenges.\r\nWith these above reasons, I believe that this proposal has good impact to Cardano community and ecosystem.", "q0r": 5, "q1": "Proposer has + 1k already published videos in Cardano Castellano Youtube channel with nearly 9k subscribers and nearly 600k views (at the time of assessment) showed potential capability of the author in  cheering the community. The attached spreadsheet for full details of published content and the uploaded videos with interpreted speech approved his relevant skills and experience needed to implement the proposal. The proposer also take in advantage of Odysee channel for a very wonderful repository.\r\nBut the only one thing missing is I could not find any reference link of the Author and team members (in any), so I don't know whether just the Author does all things or a team behind. So it'd positive if the proposer provide more details about team by reference link to know about the background and experience. \r\nThe budget is outlined and broken down into per word, a minimum unit for funding calculation of translation work, very clear for community to know and estimate what budget used for. And I think the proposer still continues working for this community so it's better if he could provide a verifiable plan for additional funding after 6 months of this proposal. ", "q1r": 4, "q2": "The number of published video, the number of followers, the number of average views per video, the number of watching hours are good metrics/KPIs to help community measuring the success of this proposal and appropriate to this challenge. But it would be clearer if it is estimated in specific numbers such as how many viewer or follower increased per month. If so, it could help the community  easily for checking and tracking. \r\nThe roadmap is 6 months for translating  and publishing videos from various different sources of Cardano with 50k transcripted words per month is so clear enough  no need to provide more about milestones. \r\nIt would be positive if the proposer's author implies the possible risks and how to mitigate them, for example the quality of translated content or the increased number is not reached as expectation.\r\nIn general, I think this proposal has good auditability enough for community tracking and following.", "q2r": 4, "assessor": "z_assessor_777", "no_vca": 12, "ne": 4, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "IMPACT: It is quite difficult for the proposal to provide expansion rates, number of new subscribers per month, number of views, those kinds of metrics. After almost 3 years of publishing content, there is quite a lot of information that shows how susceptible to change everything is. The following is a quite average Charles video that performed quite well. However, a very long time after being published, 180 days, Youtube algorithm decided to show the video again, it got thousands of additional views and almost 600 subscribers. On the other hand, there are amazing Charles videos, where he provides very important updates, that have even gotten negative subscribers (I can only imagine that is people angry with the project due to unrealistic price expectations or something like that) \nhttps://youtu.be/CyJZpyCDguo\n\nPerhaps following proposals can provide expansion metrics as KPIs and then address the highly fluctuable audience issue in the risk section. Would like to know CAs and vCAs opinion on this.\n\n\nFEASIBILITY: For the moment it is an individual work. The idea for the future is to expand, to translate more words per month and to become a team. Hope more community members would like to contribute to this proposal.\n\n\nIf proposal is approved, after six months following proposals will be submitted, hopefully being able to expand the proposal, forming a team, providing more and more Spanish content.\n\nAUDITABILITY: It is quite difficult for the proposal to provide expansion rates, number of new subscribers per month, number of views, those kinds of metrics. After almost 3 years of publishing content, there is quite a lot of information that shows how susceptible to change everything is. The following is a quite average Charles video that performed quite well. However, a very long time after being published, 180 days, Youtube algorithm decided to show the video again, it got thousands of additional views and almost 600 subscribers. On the other hand, there are amazing Charles videos, where he provides very important updates, that have even gotten negative subscribers (I can only imagine that is people angry with the project due to unrealistic price expectations or something like that) \nhttps://youtu.be/CyJZpyCDguo\n\nPerhaps following proposals can provide expansion metrics as KPIs and then address the highly fluctuable audience issue in the risk section. Would like to know CAs and vCAs opinion on this.\n\n"}, {"q0": "This proposal identifies a crucial problem within the challenge and will allow adding value, leading thousands of potential users to access the cardano ecosystem. Thanks to a simple and clear approach, the proposal presents metrics with clear objectives that perfectly align with the configuration that the challenge presents.", "q0r": 5, "q1": "The proponent presents irrefutable evidence of his skills and experience to implement the proposal, a channel is presented in current operation with a significant number of followers. It is necessary to better clarify the conformation of the necessary team for its development, as this is not evident. The budget is described with absolute clarity, the value is in words and there is an approximate number of words per video. The proposal is accompanied by a realistic timetable. It does not present information about the need for additional funds that may be required. However, the whole plan is sensible and feasible giving absolute clarity to the reader. One could delve a little into technical aspects, such as which is the translation dictionary, what type of control the translations have. In this regard, the most relevant challenges and risks could be improved.", "q1r": 4, "q2": "A roadmap is presented and yet you have to work on the periodicity of the videos. It would be preferable to have some kind of control that will guarantee the publication and a possible schedule. However, the metrics guarantee the success of the proposal and there is a broad and clear description of the problem to be addressed. This proposal is necessary and complies with the aspects.", "q2r": 4, "assessor": "z_assessor_778", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1, "reply": "FEASIBILITY: People contact me through the Youtube Channel, through the Twitter account, through the channel email (cardanoencastellano@gmail.com), through Telegram. I am one of the administrators of the largest Cardano Telegram channel with over 12k subscribers, so I am in touch with several different SPOs, community members, etc. I am also a Cardano Ambassador\nAUDITABILITY: Control seems to be quite easy, anyone can check the content through the Youtube Channel, the Odysee Channel, the Cardano Forum, and so forth. There are several Cardano community members who understand English that are also part of the Cardano Castellano Youtube channel audience, perhaps, in the future, they may also would like to serve as auditors of the work being done.\n"}, {"q0": "Having Spanish-language resources is incredibly important for the success of the Cardano community. This fits the challenge and also would help with the goal of the grow LatAM challenge.", "q0r": 5, "q1": "This team is currently already putting out content and therefore has proven their ability to implement. Their proposal also includes financial and strategic information", "q1r": 5, "q2": "KPIs and budget breakdown are included which ensures that the community can audit the project. I wish they included a roadmap, but otherwise very exhaustive proposal.", "q2r": 5, "assessor": "z_assessor_779", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1, "reply": "AUDITABILITY: A roadmap is something that can be considered for further funds, thanks for the advice."}], "solution": "Proporcionar vídeos traducidos al español para educar y mantener informada a la comunidad hispana sobre el Proyecto Cardano", "experience": "+ 1k videos ya publicados en Cardano Castellano Youtube\n+ 8k Suscriptores\n+ 500k Vistas Totales\n+ 40k Tiempo total de visionado (horas)"}