{"id": 381405, "author": "dwayne", "title": "DAO-NET: Multilingual Translation", "url": "https://cardano.ideascale.com/a/dtd/381405-48088", "category": 26252, "amount": 19000, "description": "La traducción y la creación de plataformas multilingües requieren una financiación sostenida, pero los fondos Catalyst se destinan a proyectos específicos.", "funded": 2, "upvotes": 68055931, "downvotes": 3385966, "votes_result": 64669965, "votes_cast": 174, "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "La propuesta cumple bien los objetivos del reto, ya que pretende crear un DAO que proporcione financiación a diferentes traductores para que trabajen en diferentes proyectos, con el objetivo de traducir inicialmente una página de votaciones. La idea aquí es, según entiendo, conseguir traducir la mayor cantidad de contenidos de este tipo al mayor número de idiomas posible. Lo que me ha resultado un poco confuso es si el proyecto pretende traducir sólo este tipo de contenido (las votaciones) o pretende, más adelante, empezar a producir otro tipo de proyectos. Es positivo que los autores ya hayan definido a los traductores y a los socios, porque este proyecto no se va a materializar sólo desde el punto de vista técnico, y tener en mente a profesionales de este ámbito de la traducción ya acelerará parte del proceso de desarrollo. Por lo tanto, creo que lo que faltaría sería la comprensión de lo que sucedería más allá de la traducción de los contenidos de la votación; aparte de eso, creo que la propuesta es muy relevante para el desafío, ya que aborda directamente la premisa de llevar el contenido del ecosistema Cardano a diferentes personas que no son de habla inglesa.", "q0r": 4, "q1": "Los autores de la propuesta tienen mucha implicación con nuestra blockchain, siendo pioneros de Plutus, operadores de SPO, CAs y etc., según se dice. Se nos proporciona una breve descripción del dúo, en la que podemos identificar sus nombres, áreas de experiencia y también se adjuntan sus perfiles de linkedin, donde podemos ver más sobre su trayectoria y conocerlos con más detalle. Creo que confían mucho en su capacidad para impulsar este proyecto, ya que tienen mucha experiencia con el blockchain y ya participan en el ecosistema a través de sus pools y Catalyst. También adjuntan una hoja de ruta, que desglosa en meses lo que se haría a través de un listado de temas. Con esto, es posible tener una visión de conjunto, una comprensión sólida del proceso, porque sabemos qué actividades se harán y en qué orden para dar lugar al producto final. Y, por último, se comparte cómo se utilizará la financiación. Sobre esta parte, me gustaría comentar que, en mi opinión, podría haber tenido más detalles en los dos temas que no son Contrato Inteligente DAO Algorítmico. Por ejemplo, en la parte de la traducción, reservan 6.000 dólares de los que no sabemos cuántas personas se repartirán, cuál es el coste de la hora de trabajo del traductor, si todos los traductores ganarían la misma cantidad (o de repente quien sepa traducir un idioma menos común , que es más difícil de encontrar traductores, ganaría más...). Por lo tanto, esta parte deja un poco que desear en cuanto a detalles, si hubiera más explicaciones, tendríamos una visión más concreta de lo que pasaría con el dinero solicitado.", "q1r": 4, "q2": "Los autores establecen una serie de KPIs que permiten conocer de forma objetiva los principales resultados que se pretenden alcanzar con este proyecto. Se observa que dialogan directamente con los objetivos del desafío, reforzando aún más la cuestión del impacto; y a través de ellos, es posible monitorear de manera simple si se logró lo propuesto. También se proporcionan las definiciones de éxito según los meses, es decir, los autores se preocuparon por detallar los objetivos específicos según el paso del tiempo, haciendo totalmente posible la auditabilidad del proyecto. Desde mi punto de vista, al tratarse de una plataforma que guiará a otras plataformas, y al haber varios idiomas que se trabajan, con personas muy diferentes a las que se llega, es complicado elegir a miembros de la comunidad para que trabajen con la auditabilidad de este proyecto (hay muchas cosas diferentes que monitorear y tendrían que ser personas que hablen los idiomas presentes). Creo que es mejor que el propio equipo del proyecto, junto con sus traductores, promueva este seguimiento y organice los datos recogidos en informes para exponerlos a la comunidad. Esto podría hacerse junto con la presentación de los resultados de otras propuestas financiadas del reto, por ejemplo, durante el Ayuntamiento o por otros medios de comunicación con la comunidad de Cardano.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Very good idea! Creating a dao for translators can basically solve this challenge fund for good! \r\n\r\nDefinetly in accordance to the challenge goal and being very effective!\r\n\r\nRating given 5.", "q0r": 5, "q1": "Based on the information in the proposal, it is highly likely that they will implement the proposal successfully.\r\n\r\nI find their experience and skill suitable for the aim, the only drawback are missing positions to be filled.\r\n\r\nBesides that, I am confident.\r\n\r\nRating given 4.", "q1r": 4, "q2": "The roadmap is provided in very detail, sufficient for audit.\r\n\r\nAlso, the relevant KPIs are stated, along with a budget description increasing the possibility to audit.\r\n\r\nAlong with addressing possible risks and their mitigation, IP being open source, the progress and the outcome will be transparent.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "Cardano is a growing ecosystem, and adoption is crucial part for its success. Multilingual resources is still limited, and needs initiative and funding (for example, through this Fund 7 challenge setting). This proposal will create a DAO, that will govern around this multilingual resource ecosystem in Cardano. Although we already have Project Catalyst to fund these project, it just wouldn't enough to kickstart and fund a lot of multilingual resource in this early stages. DAO-NET will help to address this, by creating a DAO specifically to fund translators for various documentations, software interfaces, videos, etc. However, this proposal doesn't belong in this challenge, since the product they're building are DAOs, not the multilingual resource itself. It should be placed under 'DAOs <3 Cardano' challenge category. I acknowledge that this team have another proposal on DID challenge setting, but it would be better if they could combine this to one single DAO-NET proposal under the DAO challenge category. ", "q0r": 3, "q1": "This proposal provide team's linkedin profile, and able to prove that they have the experience needed for this type of project. This proposal can identify the skill requirements for Product Manager and the Lead Developer, both explained well. This proposal laid out the plan in details, from the roadmap, action plans, goals and achievement for each months. The budgets is explained in identifiable manner, and future funding consideration also provided. The team able to identify the risk and explain the mitigation solution, such as DAOs regulations, and bad actors from the participants within the DAO ecosystem. Overall, this is a well written and comprehensive proposal and have a high chance of successfully implemented. ", "q1r": 5, "q2": "The roadmap is well explained, with achievements and goals laid out in details. Metrics and KPIs are also provided, such as number of non-English speakers joining Cardano/DAO-NET community. However, it would be better if they provide the target number for each metrics, such as 100 people minimum joining the DAO-NET community.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "It is true that AI-based automatic translation tools have many shortcomings, but I think that it should still be focused on developing them rather than investing in traditional translation. Automation is the trend of current world. We need to invest in the right places to minimize waste of resources. However, in the short term, traditional translation still proves its superiority based on accuracy and sensitiveness.", "q0r": 3, "q1": "The team has many years of experience in the related field and present it well in the proposal. The proposal also includes a specific and reasonable plan (including phases and desired output for each phase). They also analyze risks and have corresponding provisions for those risks.", "q1r": 5, "q2": "The proposal includes KPIs along with Success Definition. Moreover, the outcome of project is easy to audit (output is document).", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Crear una DAO, con financiación sostenida para los traductores, para proporcionar traducciones para las interfaces de software, documentación, reuniones y vídeos.", "experience": "Un equipo experimentado de desarrolladores de Blockchain, pioneros de Plutus, operadores de SPO, asesores de la comunidad y analistas de soluciones."}