{"id": 396564, "author": "cerpofficial", "title": "Cardano ERP (CERP)", "url": "https://cardano.ideascale.com/a/dtd/396564-48088", "category": 26445, "amount": 600000, "description": "An ERP solution currently does not exist to encourage and excite mass commercial and government adoption of the Cardano blockchain.", "f6_no_assessments": 7, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1711, "q0": "Proposals are presented clearly, easy to understand, core ideas and great can solve the challenge posed. The software system is launched on the Cardano ecosystem. The proponent of ERP software is a collection of different applications that help employees and operators build a standard process that interacts on the basis of enterprise resources. The resource system develops, the business power increases and the ecosystem develops. The team estimated the risks and solutions for the project. This will help the team minimize the risks when implementing the project.", "q0r": 5, "q1": "The core team exhibits full evidence of proven skills, techniques and with over 30 years of experience in ERP solutions. The team created positive confidence in the success of the proposal. The proponent gives a clear roadmap for each phase, each task to implement the project. The team proposed a budget of $600,000 for a 6-month budget to implement the project's steps. However, the proposal would be more transparent if the team added a breakdown of the budget for each time period the work was done for the project. Example: Proposal has 5 teams: time, work and budget to be allocated to each team?", "q1r": 4, "q2": "The solution is detailed and the description is clear. However, for myself, I am not sure how the progress and success of the project is. There seems to be a lack of audit information. It would be better to have KPIs in different timelines. It will increase the clarity and transparency of the proposal.", "q2r": 3, "assessor": "z_assessor_1409", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal.\n\nYour assessment clearly demonstrates you have read the proposal and linked Vision Paper.  You have a terrific understanding of what we want to do with the funds and with the project.  Your assessment is very fair.\n\nHOWEVER, there appears to be a slight misunderstanding which I hope to clarify for you.  Hopefully, the process will afford you an opportunity to revise your assessment accordingly without it being flagged, should you decide to do so.\n\nAuditability - \"It would be better to have KPIs in different timelines.\"\n\nThis proposal is only for Phase 0.  There is only one timeline.  The deliverables for Phase 0 are set forth in the proposal and within the linked Vision Paper (page 6).  KPIs are not a fit for a Phase 0 deliverable.  Phase 0 is all about preparing several experienced ERP developers for developing on Cardano, preparing an administrative team, and vigorously architecting solutions to various challenges.\n\nWe will also publish complete spending details for Fund8 received and a more detailed budget for future funding requests.  Our intent is for CERP to remain fully transparent.\n\nWe hope this additional feedback helps.  We also hope we have earned your vote.  Please contact Jay at feedback@cerp.dev should you have questions or require more clarification. :)"}, {"id": 3236, "q0": "The team raised a crucial issue on a large scale. Blockchain is growing day by day, and it is gradually being applied to businesses, industries, and governments around the world. However, it still has many limitations, so developing ideas about enterprise solutions is necessary. ERP is considered one of the most successful business management solutions today, turning resources into resources, saving costs, increasing competitiveness, and bringing long-term benefits to enterprises. But most undersized businesses, large enterprises, corporations, or governments use a centralized ERP solution. If this proposal succeeds as intended, then CERP will be the leading solution running with a decentralized and distributed blockchain subtitle. I think Cardano ERP (CERP) meets the challenge will drive the perpetual growth and adoption of the Cardano ecosystem. \nTeam solutions have identified most of the problems, clearly written and logical reasoning, towards adding value to the Cardano ecosystem. Apply Cardano to businesses, industries, and governments of all sizes. There are countless opportunities to innovate and create modules tools and provide support. Define, innovate, create and shape commercial and government standards. Provide Catalyst Fund recipients with accountability and transparency. Create many opportunities for partnerships inside and outside the Cardano ecosystem. Leverage thousands of experienced developers to train and develop solutions on Cardano. \nBesides, the team has given some possible risks when implementing the project and delivered specific solutions for them.", "q0r": 4, "q1": "Reading the experience summary and Cardano ERP - Vision Paper, I highly appreciate the project team. The founders are international ERP consultants and have over 30 years of experience scoping ERP solutions, testing, implementing, supporting, training, customizing, and hosting for vendors leading ERP solutions. They have a good understanding of the Cardano ecosystem. Each person was given a clear work assignment per their experience and knowledge. However, it will be even better when I identify them. I would like to see more information to verify the creators of this project, such as Facebook, Twitter, Linkedin,... so that I can make sure that they are not impostors, they have professional experience. They are regularly active on social networks and have updated news about the project. \nThe implementation roadmap is divided, including phases 0-3. This proposal is phase 0 of the project (planning phase). The project's proposed budget is relatively high ($600,000 accounting for 60%) for Phase 0- Planning phase. The budget is divided into 3 sections, giving clear and detailed explanations for each item. Reading the Cardano ERP - Vision Paper with my basic understanding of ERP, I think this proposed budget is reasonable. The talent of an experienced ERP developer is costly, but the team has come up with a precise hourly wage calculation, and other costs are explained in detail.", "q1r": 4, "q2": "The proponent did not give any numbers or KPIs to measure the progress and development of the project. Instead, they only say how to use the money received; and the reports will be posted periodically and transparently on their website. Progress will be measured when the timelines are met. However, when looking at the project's website posts, I would like to know what metrics I should pay attention to and how much they are.\nThis is a brand new project. Not tested yet, only in phase 0, so this proposal's success is essential. If not funded, the following stages will be considered eliminated. I think the team should put it on the test first to fix any problems they may encounter and create specific achievements; then, it will build trust and make it easier to apply for funding.", "q2r": 2, "assessor": "z_assessor_1631", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal.  \n\nYour comments are fair and demonstrate you actually read through the proposal and the linked Vision Paper.\n\n\"I think the team should put it on the test first to fix any problems they may encounter and create specific achievements; then, it will build trust and make it easier to apply for funding.\"\n\nYour words are a paraphrase of our stated intentions.  By delivering on Phase 0, we hope to build reputation and goodwill with the community.  We intend to leverage our success when requesting funding for future Phases.  :)\n\nWe acknowledge your concern about the lack of KPIs.  Phase 0 is the planning phase.  Unfortunately, planning activities do not lend themselves well to KPI reporting.  Hence we do not offer any for Phase 0.  In our opinion, projects are not all \"cookie-cutter\".  The \"requirement\" for KPIs does not fit every project or project phase and the suggestion that KPIs are \"required\" may need to be tempered somewhat.  After we architect the solution, we should have plenty of KPIs to share for future Phase funding proposals.  Providing bogus KPIs such as \"We expect to have 3 ideas from every Team member\", or \"We expect to write 100 lines of code for the MVP\", or somesuch during this planning phase would be a transparently bogus attempt to \"check a box\" and immediately seen as such by an astute community.\n\nIf, after reading our proposal and linked Vision Paper, you have some suggestions for KPIs for Phase 0 (only), we will certainly consider them for publishing to cerp.dev.\n\nWe hope to earn your vote and invite you to send any questions or feedback to us at feedback@cerp.dev.  You will receive a timely response.\n\n\n\n"}, {"id": 3343, "q0": "The proposers make it clear about their purpose to call funds for phase 0 of their long-term project. Therefore, their activities will all focus on this preparation stage including research, discussions, team-building, implementation plan. Additionally, they are open about how many phases in this project and the main mission of each phase provided in the vision paper, therefore, the Catalyst community can get the whole picture of the project, which greatly facilitates them in decision-making.\nThe benefits of their solution are well presented with additional use cases that can be viewed at an external link. Their outcomes are expected to address the existing challenges and improve perpetual growth and engagement of the Cardano ecosystem\nThe proposal well illustrates the main challenge their team has to confront and sound solution orientation. At this early stage, building a team and ensuring their commitment can be really hard, which they clearly understand", "q0r": 5, "q1": "The provide a realistic timeline to accomplish their tasks. The expected deliverables are also exhaustively illustrated, they break down at two milestones with very clear explanations about their outcomes\nThey calculate their budget need for phase 0 only based on the initial purpose of this proposal, however, the ongoing costs and anticipated CERP costs are fully provided in the vision paper attached in the beginning. These spendings are in tune with their detailed development plan \nThe proposer describes quite well the essential positions in this project and existing members with considerable experience within the scope of ERP solutions implementation. Although they are in the team-building process, they have clearly visualized what their team will look like and how many members needed  \n", "q1r": 5, "q2": "A leading robust legacy ERP will be used to measure and deliver reports for assessing the progress and development of the project, which is specifically discussed. They also show the logical coherence using all aforementioned deliverables as the key metrics to define the success of project ", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal.  \n\nYour comments are fair and demonstrate you actually read through the proposal and the linked Vision Paper.\n\nWe hope we have earned your vote.  If funded, we will absolutely deliver on all things described within the proposal.  This project will absolutely be a global game-changer.  :)"}, {"id": 3597, "q0": "This proposal suggested a data management solution, ERP, which is aligned with the challenge. It provided a link to the details of the project. However, the proposal itself should summarize some key information related to the solution's features, functions, components, and activities involved. The proposal did a great job in listing its impact on many stakeholders including the whole Cardano ecosystem.  However, it did not mention how it will impact businesses' activities. Besides, the part of mentioning some challenges arising when executing the project, it was well-written. The challenges were given and the plan to overcome them was also presented.", "q0r": 4, "q1": "A summary of what will be executed in phase 0 was given. But it lacked a timeline for each activity in this stage. It should add more technical information in the description of each step as well. However, it is highly evaluated that it mentioned what should be achieved in each milestone to make sure that the project is still on track and on progress. The budget breakdown was given, but it was quite general and lacked details. For example the cost for teams, it should describe how many people are included in a team, how much budget would be distributed for each person. Another point to mention here is that this proposal stated that the detail would be included in the Vision Paper in the attached file, but it would be more convenient and easy to follow if  it provided all details here in the proposal. The project is led by a talented team. The project founder possesses 30 years of experience in leading ERP solution vendors. He is also an active supporter of the Cardano mission and vision. Therefore, it is likely that this project will be directed in the right way. The project manager is also an outstanding person in the field of ERP solution scoping, testing, implementation,...with more than 30 years of experience. Another highlight here is that it provided the structure of the team divided into 5 teams including members in each one, and all teams can support each other. All in all, this project seems to be highly feasible.", "q1r": 4, "q2": "With clear goals mentioned on the plan with a specific timeline and reports would be periodically and transparently provided on CERP.dev. It seems to be possible to track, trace, and audit the progress of this project. The success was also mentioned, if more details were added, it would be easier to visualize it and how it will have a certain influence on the execution of the next phase. Besides, it should confirm this is a new project and don't relate to any other projects that were funded before.", "q2r": 4, "assessor": "z_assessor_1665", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal.  \n\nYour comments are fair and demonstrate you actually read through the proposal and the linked Vision Paper.\n\nWe acknowledge your critical feedback and hope to earn your vote.  As we were already at more than 30 pages for the Vision Paper, we had to sacrifice some details such as business impact projections.  Googling \"ERP statistics\" provides a plethora of information which might then need to be distilled and related to CERP.  That may have added another 5-10 pages.  So, we opted to not include that lest \"regular folk\" face-plant while reading it all.\n\nWe are ERP nerds and invite you to send any questions or feedback to us at feedback@cerp.dev.  You will receive a timely response.  :)\n"}, {"id": 4205, "q0": "The goal of this proposal, according to the author, is to fund Phase 0, the planning phase. They bring up the issue that numerous industry vertical and governmental minutiae and nuances must be investigated to ensure that the entire system is built to accommodate all scenarios and modules that will eventually rely on and integrate with CERP. To address this issue, the team intends to do extensive research on current open-source and proprietary ERP systems; the proposal also includes plans for meetings and discussions to identify, assemble, and ready teams. This proposal's purpose and measurements, in my opinion, are in line with those needed by the challenge. The proposal is well-written and well-organized, the objective is obvious, and the methodology is clear. I have nothing but praise for the team as they present the likely risks and have already made plans to address them.", "q0r": 5, "q1": "The proposal timeline and milestones are clearly outlined, and the number of events can be achieved. The team is composed of two dedicated and experienced developers, who are not only very active within the community, but also already delivering on other initiatives and projects. They demonstrate a good combination of skills and knowledge to form a diverse and well-prepared team that really is up to the challenge. This proposal would be more convincing if there were links for verifying them, and there should be more details of the standards for applying for the spot in the core team structure. The budget requested though is detailed and very specific, is kind of conservative. Given that the majority of the funds requested are for team building, it would be preferable if the proposer included specific information on hourly rates and work estimation. In conclusion, this is an overall well-written proposal, and thus I am confident that it will be implemented successfully.", "q1r": 4, "q2": "Concerning the project's auditability and traceability, the proposer ensures that the budget funded will be submitted on CERP.dev on a regular and transparent basis. More platforms, such as Discord channels, Telegram channels, social media, media stories, and so on, that everyone who funded the project is a part of the project and can easily keep track of, is something I thought of here that might further increase this auditability. There is a roadmap with simple yet easily understandable and traceable milestones. There is a detailed description of the problem being tackled as well as the solution presented. The metrics offered are crucial to the proposal's success, and a clear \"Definition of success\" is also provided.", "q2r": 4, "assessor": "z_assessor_1712", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal.  \n\nYour comments are fair and demonstrate you actually read through the proposal and the linked Vision Paper.\n\nWe acknowledge your critical feedback and hope to earn your vote.  Although, naturally, we may lean into the project with known Team members, we will absolutely post openings as opportunities become available.  We will, for example, require a Cardano guru for our ERP gurus to bounce ideas off and let us know what we may be doing wrong, alternative approaches to do things right, and generally show us our blind sides so that we may improve.\n\nWe will absolutely hire a Community Engagement team to reach out on all relevant social media.  That will allow CERP leadership and developers stay focused on success.\n\nWe invite you to send any questions or feedback to us at feedback@cerp.dev.  You will receive a timely response (usually from Jay).  :)\n"}, {"id": 5302, "q0": "This project is funding phase 0: Cardano ERP planning. Phase 0's success will be a huge step forward for the later phases, and it necessitates a great deal of effort and experience. The proposer has stated in considerable detail how this proposer will be critical to many of the benefits that businesses, industries, and governments would derive from developing on top of Cardano. My warmest congratulations to the team for devising such a fantastic plan, with each component meticulously planned. Not only do the proposers anticipate the difficulties they may face, but they also provide solutions for each risk. This creates a sense of security, and each circumstance will have its own script.", "q0r": 5, "q1": "Phase 0 will be ready to go in the next 6 months as soon as the funds are received. The required fund for phase 0 is $600000, which has been precisely calculated. The phase could be completed on time and on budget. All of the team members have significant ERP knowledge, which will be extremely beneficial to this project's success rate. The budget is appropriate; however, it would be more helpful if the proposer clarified whether the budget is split evenly between the first three and first six months based on the timeline. I see that there are already three persons with prior experience, and that there will be five teams in total, each with one leader. How do you choose the other leaders and determine whether they are capable? I am giving it a five-star rating since not only is the timeline well-planned with a fragant mark, but the team members' backgrounds are also solid.", "q1r": 5, "q2": "Because phase 0 is simply a planning stage, the progress itself is proof of the fund's transparency. To track progress, the proposer uses CERP Project Tracking and Reporting. However, the proposer should elaborate on how phase 0 will be defined as a success and how it will be appropriate to proceed to phases 1, 2, and 3. I will give it 4-star rating", "q2r": 4, "assessor": "z_assessor_1934", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal.  \n\nYour comments are fair and demonstrate you actually read through the proposal and the linked Vision Paper.\n\nWe acknowledge your critical feedback and hope to earn your vote.  We anticipate we will require funding in traunches of 20%, 40%, 20%, and 20% during months 1, 2, 3, and 4, respectively.  We expect to have administrative expenses from month 1, administrative and development talent expenses from month 2, and administrative, development talent, and travel expenses from month 3.  Barring delays, we will attempt to deliver all deliverables comfortably within 6 months.\n\nWe invite you to send any questions or feedback to us at feedback@cerp.dev.  You will receive a timely response.  :)\n"}, {"id": 7878, "q0": "\"This is an initiative on developing an ERP (Enterprise resource planning) standard system that refers to a type of software that organizations use to manage day-to-day business activities such as accounting, procurement, project management, risk management and compliance, and supply chain operations.\nThis is a proposal to standardize and systematize business information and work on the cardano platform, and I find it necessary to professionalize work items and facilitate evaluation. and support for any project on the cardano platform. The scope of influence of this project is not limited by geography, so it can be applied to the business developer community in any locality or different type of business.\"", "q0r": 5, "q1": "Although the idea is realistic and possible, I disagree with the presentation of the cost of this project. The project asked for $ 600k a huge amount of money, and the cost of meeting travel, I found this to be an unreasonable part. Your working group should only ask for the minimum cost to implement the work. If you say that the staff has more than 30 years of experience in implementing this work, your resources are almost available and you just need to upload it to the blockchain, not doing too much. Because blockchain is only different from other technologies in the way of data recording and transaction transparency, the thinking about processing work is almost unchanged. You should reconsider the cost. Thanks alot.", "q1r": 5, "q2": "I think it's not too difficult to double-check the results of this project, as long as they publicize the code and tools they will develop for the cardano platform. I appreciate people with experience in their field joining blockchain development. This shows that the cardano blockchain is increasingly attracting professionals who are serious about this project. However, here they have not clearly presented the personnel files as well as the official channels that can check the progress of this work, hopefully they will add information for the next time.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "Thank you for taking the time to assess our proposal.  \n\nYour comments are fair and demonstrate you actually read through the proposal and the linked Vision Paper.\n\nWe acknowledge your critical feedback and hope to earn your vote.  Pages 24-28 of the linked Vision Paper address your concerns regarding cost.\n\nWe hope to earn your vote and invite you to send any questions or feedback to us at feedback@cerp.dev.  \n"}], "solution": "Cardano ERP (CERP), built with the Cardano blockchain as its backend, will drive perpetual growth and adoption of the Cardano ecosystem.", "experience": "The Founders are international ERP consultants.  Each possesses 30+ years of ERP solution scoping, testing, implementation, support, training, customization, and hosting experience for leading ERP solution vendors. They have implemented and supported hundreds of organizations."}