{"id": 396673, "author": "henokp50", "title": "Crypto banking", "url": "https://cardano.ideascale.com/a/dtd/396673-48088", "category": 26445, "amount": 50000, "description": "Lack of ADA payment processors", "f6_no_assessments": 6, "f6_rating": 3.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 2386, "q0": "With the current rapid development of technology, the whole world is racing with the 4.0 technology era to come up with the idea of ​​​​putting a payment processing and banking system supported by blockchain. is an extremely necessary idea, here the proposed group has raised the issues that will make electronic money popular and can be used for payment like any other currency today, especially in africatooi finds this proposal well-suited to the challenges it needs to scale up to bring to life for the whole world to enjoy a super fast payments app. in the challenge solving section, I see the group has raised 2 contents: ada owners can spend to buy goods and businesses can accept ADA as payment I find this solution very useful. In accordance with the problems in challenge, the evidence presented by the team is quite reasonable, besides, the team also points out certain potential risks such as Fait Deposit and Withdrawal Gateway. The regulations of some countries are friendly with cryptocurrencies and difficulties in language communication, but I see that the group has not yet outlined options to deal with those risks. I want the group to come up with solutions to solve these problems. Take the risk appropriately and I think it's also a very good project", "q0r": 4, "q1": "In the section providing the plan and time, the proposed team has given specific timelines that are about four years the workload is also broken down for each period I think the above timeline is as well. It is reasonable to complete the tasks set out as Expansion and market penetration in 2025. The progress of the project is also very easy to check and track by the community. with great deals as mentioned. With a budget of about 5% of the full challenge budget and divided into five topics, I think it is very reasonable, but it is advisable to have a contingency plan in case of additional budget when needed for the presentation of the members. The team I saw that the group has listed four members and has assigned specific tasks to each member, all members are highly qualified people with many years of experience and especially their identities have been confirmed. Verification with reference documents below the link I see with this team will definitely complete the work that has been done.\nsuggest", "q1r": 4, "q2": "in the progress measurement and project development section, I see the team has given the figures but only generally step the progress will be communicated to the public for each speaking each case. I would like the team to have a more detailed report on the progress measurement. In the success description, the team listed several successes and divided them into three phases with certain goals to be achieved, namely Ennarea Finance services in action and Full Fundraising. The $10 million startup uses the platform.\n  Success is also related to future challenges, but the project seems to be in the concept of an idea and has not been tested in practice. as this is a brand new project that has never been funded but I think this is a good project i hope the team will get a lot of support from the community", "q2r": 4, "assessor": "z_assessor_1486", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6206, "q0": "Impact\nIMPORTANT NOTE: This review might be susbstantially similar to the reviews of two other proposals by the same team as the other two proposals differ in name, but are proposing the delivery of the same *The Ennarea Exchange*, with the same Roadmap, with the same Financial Plan and the same definition of success.\nThis proposal has attracted some considerable effort from the proposing team, which gives it a serious note. It is also aligned in general terms with the Challenge, although its impact may be not as large as the scope of the proposal may indicate. \nI like the fact that the proposers are focused on providing services, however at the very beginning and then reading through the proposal, I wasn't able to precisely pinpoint what was the real focus (it kept shifting as I read through). Let me explain. The proposal's name is \"Crypto banking\", - which I understand as managing of digital currency at a financial service or banking provider.\nHowever, moving on to the Problem Statement, the proposer mentions that the problem is a general \"Lack of ADA payment processors\" - which I understood as a global payments issue. Effectively, how to pay for services and goods around the world, by utilizing ADA. \nThe proposed solution is \"A blockchain-powered banking and payment processing system,\" which reintroduces the word \"banking\". I mention this as \"banking\" has a lot of legal implications in all jurisdictions, requires central bank licenses and is highly regulated. \nFinally, as far as I was able to discern - the proposal is really for a pan-African crypto exchange, effectively a cryptocurrency trading platform. Hence, if the proposal is not acepted now, I would advise to reformulate the problem statement and solution. \nWhile the problem statement was global in nature, the proposed solution is Africa-focused, although it may turn out to be country-specific (not sure after reading the proposal). The proposers suggest a service \"available in all African countries that will enable users to invest and trade digital assets using their native fiat currencies\". That is 54 countries and many native fiat currencies. The scope of the project is massive, as it involves fiat currencies in all of Africa. My advice would be to narrow down the proposal to specific markets, even if it is only one initially. \nSo, if Ennerea does have larger ambitions, that is normal and welcome. However, the proposal itself must have a more limited focus if it is to succeed with the limited funding. The specific impact on Cardano remains to be seen, as the proposers have not documented the available market alternatives and competition in their key markets and how will their own project compete with the existing players and why would consumers choose Ennarea to buy ADA, over other specific options. \nThe team does specify that it foresees several risks to deliver this project successfully, including a (1) Fiat currency deposit and withdrawal gateway. (2) Regulatory approval in some countries. These (especially, the second one) seem to me to be big risks and the project will not be able to get off the ground without resolving them. I would like to know the basis for the following claim: \"some of the destinations our exchange can start its operations without regulatory challenges. 1. Ethiopia 2. Gahanna 3. Nigeria 4. South Africa 5. Angola 6. Egypt.\" . Do these markets have regulations? How will the regulation issues be addressed? Why are there no regulatory challenges? Seems like a sweeping statement, but it would be good to back it up with a rationale. \n", "q0r": 3, "q1": "The proposed Ennarea digital asset exchange and management platform seems to be very expansive in its scope. The team sees it as a one-stop financial solution for blockchain-powered products such as cryptocurrencies, NFTs, Central bank digital currencies (CBDC), tokenized security, stocks, and other traded commodities. This is a large project and does seem somewhat tangential to the \"Crypto Banking and Payment processing service\" mentioned earlier in the proposal. It seems that the proposal's feasibility may suffer from the enormous scope. The team mentions that the architectural and application design of Ennarea is being finalized, however I visited the ennarea.com domain and was not overly impressed. The site named Ennarea Finance seems very early in development. As regards the demo, available at https://pilot.ennarea.com , it seems like a template demo, not a work in progress (not a criticism, just an observation). This same project has been in different forms submitted for funding in the F6 and F7 funds, which means that the team is persistent. It would have been good if the team could have reported on any specific progress since then. Then we come to the budget. According to the proposers, Ennarea Finance requires $350,000 for the first year of project development and management. Apparently, no other sources of financing (outside Catalyst) have been secured - or this has not been documented in the proposal. The team is requesting roughly $150,000 (less than half of the money) in this funding round and the remaining budget will be requested in another funding challenge. The initial roughly $150,000 budget will be disbursed among 3 different proposals in Fund 8. This proposal being reviewed here - is just one of the three. However, if only one proposal is accepted in this fund 8 -what happens to the project? The team has not addressed this clearly and it seems that the risk of partial funding is a real danger. Does the team intend to return the funds if only 1 or 2 (out of 3) proposals are funded in Fund 8? This needs to be addressed, if Feasibility is to be assessed properly. If the team secured additional funding from other sources, it would be good to list them in the proposal. Tentatively, the team members do seem to have the qualifications to pursue a software project of this type from the links to their Linkedin URLs. ", "q1r": 2, "q2": "The auditability of the project seems to be relatively straightforward in general terms with some general specific commitments listed and deadlines. There is a big weakness though, which undermines auditability. The budget for this proposal $50,000 is not broken down into components, while a breakdown is available for $138,500 worth of expenses for the entire project - to be funded from three Fund 8 proposals. Hence, it will be almost impossible to audit the implementation of this specific proposal as it does not have a budget breakdown - on its own. This proposal is part of a larger budget breakdown - and individual components cannot be attributed to this single proposal. \nSome deliverables still seem to be too vague. It is good that the team intends to use its social media platforms as well as webpage blog posts to announced progress. I would advise the team to commit to deeper weekly progress reports (on a regular schedule) - due to the amounts of funding involved from Catalyst. Also, I think that the expenses and engagement of personnel and payments should also be easily auditable. \nThe three month goal includes a commitment to \"enable users to buy and sell ADA in our exchange\". This is not sufficiently clear. Users from which jurisdictions? From Africa? From Ethiopia? Which payment methods will they be able to use? WHo will be performing KYC? The goal of having 10,000 active users on the platform after three months, seems optimistic to me as an outsider. But great. However, to make it clearer it would be good also to provide insight into the definition of an \"active user\" - a user with an account or a user that has performed a trade? Also, how will the auditability of this project be impacted if the other two Fund 8 proposals for the Ennarea exchange are NOT funded? Will this proposal - on its own - be auditable - if the team misses out on obtaining funding from its other two proposals? We are left to ponder about this, so it would be best if the team addressed these funding issues and also if the team were to reveal why are other sources of funding not available for a project that seems so promising? The project expects at least 50 thousand active users in 12 months, there must be other potential sources of capital. If these have been approached, what was the response? \n", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 7894, "q0": "This is an ambitious project when developing a crypto and fiat currency conversion channel in Africa. This is also a necessary item to promote cryotp payment application in life and business more. However, this project needs to provide detailed solution, current legislation and plan how to implement it in their locality especially working with traditional banks to incorporate currency exchange when necessary for the people. Because the solutions here for crypto payments and exchanges are not simple if they do not have a highly specialized technical team as well as legal involvement in each country.", "q0r": 5, "q1": "The project is responsible and dedicated, has a detailed plan and goal of supporting African countries to have access to cryptocurrency, and to apply it in life and business. However, the reach and expertise in Africa for crypto is very weak. I hope the project will add market education, professional and technology education to enlighten this land, then the new project will become more feasible. And to do this is not easy, requires a company with a clear legal entity, a team of professionals willing to work and dedicate.", "q1r": 5, "q2": "\"I think you should have a youtube channel or a similar media channel to update the project progress. Allowing the community to read the code publicly on platforms such as github will ensure the project is reviewed and supported every step of the way.\nI appreciate the ambition of this project because it is also a sticking point in many projects and countries to bring crypto and blockchain into practice.\"", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 8298, "q0": "The proposal addresses a wide number of problems facing the cryptocurrency industry and the Cardano ecosystem. They note that most African countries lack crypto payment processing services. The proposal also addresses the need for more trading pairs that involve Afrian currencies, the need for a better UX for cryptocurrency exchanges, and the need for blockchain crowdfunding/ICO platforms in Africa. Providing a solid response to even one of these challenges would add value to the Cardano ecosystem by promoting broader adoption. It is hard to tell how scalable their existing platform is based on the demo, but presumably the back-end systems are designed to handle the large volumes the team predicts and desires. The only reservation regarding the project is that the team seems to be tackling a huge set of problems spread across a huge geography. They might increase their impact if they narrow their focus, particularly in the early stages. ", "q0r": 4, "q1": "The proposal provides a video and demo demonstrating that construction of their trading platform MVP is well underway. The five team members have a variety of skills including software engineering, media management, and general business leadership experience.  Given the wide array of financial products the team plans to offer, they seem to have underestimated their legal and regulatory costs. I suspect that hiring one lawyer at the cost of $7,500 will not be sufficient to secure the necessary licenses to allow the company to transact with other people’s funds. Particularly if the platform will allow users to trade fiat for crypto, any bank providing the platform will access to fiat funds will want to see evidence of solid KYC (Know Your Customer) and AML (Anti-Money Laundering) compliance practices and policies. These are requirements from the global FATF organization, whose requirements are translated into national laws and regulations by each country’s separate financial regulatory authority. While the specifics will differ from country to country, each jurisdiction will have some method of complying with FATF requirements (otherwise that country will be placed on the high-risk list, which causes significant international banking complications). \n\nSeparately, one of the comments suggested that the team explain how their merchant payment processing gateway differs from the COTI solution, given that COTI is Cardano’s preferred partner.  It would have strengthened the proposal to address this question. ", "q1r": 3, "q2": "The KPIs are specific and measurable. The first three months are focused exclusively on the trading platform and nothing is measured regarding the merchant payments functionality. The six month metrics are vague, so it isn’t clear which capabilities are being targed. For example, the metric is an “intensive marketing campaign to reach 25 thousand users,” but it isn’t clear which functionalities those users are accessing. Similarly the “affiliate and referral program launch” could refer to the trading platform, the merchant payment services, the ICO capabilities, or all of the above. I think it would increase the team’s likelihood for success if they break the milestones into much more concrete and specific KPIs, which will also increase the auditability. ", "q2r": 3, "assessor": "z_assessor_662", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8740, "q0": "Crypto-currency banking and exchange solutions in Ethiopia featuring ADA/ETB right now as Cardano and Ethiopia are rolling out their adoption of Atala PRISM for education and identity in the country seems like an excellent business opportunity and good use of funding in the B2C category. I am going into more details of the Cardano/Ethiopia relationship and potential risks in the next section, Feasibility, but as far as Impact and alignment with the Challenge setting are in question, this can be answered in the positive emphatically. In my opinion exchange where there is a gap in the market or likely strong growth, as in Ethiopia, is a perfectly valid business idea and should help other businesses and the Cardano ecosystem as a whole to thrive.", "q0r": 5, "q1": "This project is incredibly difficult to assess in that it looks great from the information provided in the proposal, but there are some reg flags. I am listing the two red flags here first, and then move on to assess the rest of the proposal in good faith.\nRed flag one: there is no risk assessment and the targets, extremely high and \"easy\" customer onboarding and no mention of local competitors and bank regulations make the project look \"too good to be true\".\nRed flag two: the website is a placeholder and the LinkedIn profile belongs to a single individual in the US, not in Ethiopia. So this project may or may not be legit.\nNow I continue with the assessment on face value:\nThe project is incredibly ambitious: launch a crypto exchange in Ethiopia for local currency pairs and the 6 top crypto pairs (including ADA, obviously). The team is experienced and has a test version / prototype / mockup of their exchange up and running and very detailed ideas about the team required to run this operation with a physical presence and a sales and legal team. I expect that the biggest risk and difficulty will be liaison with the National Bank of Ethiopia and overcoming restrictions on the fungibility of the birr.\nhttps://en.wikipedia.org/wiki/Ethiopian_birr\nhttps://en.wikipedia.org/wiki/National_Bank_of_Ethiopia\nIt is unfortunate that the proposers have not referred to risks in the proposal, but generally speaking, this has been done before and Ethiopia is quite far along in the creation of on-ramps for crypto:\nhttps://pursa.co/\nThe country is also having a working relationship with Cardano and government support for ADA on-ramps should be high.\nhttps://www.coindesk.com/business/2021/04/30/ethiopian-education-minister-confirms-cardano-blockchain-partnership/", "q1r": 2, "q2": "Please also note red flag warning in Feasibility section. Assessment on good faith follows:\nAs I said before, the goals of Ennarea are highly ambitious. Gladly, there are several milestones along the way that allow the proposal if funded to be audited and potential blockers addressed or removed. After 1 year, it is targeted that Ennarea Finance is fully operational and 50000 active users have been onboarded. The company then plans to raise a substantial amount in external funding to expand further, but for the relatively modest Catalyst funding requested, it will be possible to tell by the first milestone, after 3 months, if 10000 users have indeed been onboarded and trading does occur, which in my view is very bold and would be an amazing feat for a Catalyst funded exchange. So in terms of risk and audit prior to disbursing all funds, this project looks strong.", "q2r": 4, "assessor": "z_assessor_692", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8935, "q0": "This is an interesting idea, it is about to build a crowdfunding platform, which provides a merchant service for business to accept and process crypto payments.\nIn order to do this plan, the author proposes it as 3 proposals in different challenges. They are:\nhttps://cardano.ideascale.com/c/idea/396673 (This is I am assessing)\nhttps://cardano.ideascale.com/c/idea/396654\nhttps://cardano.ideascale.com/c/idea/396652\nThe proposal certainly fits very well with the challenge “Business Solutions” in both ways B2B and B2C solution as the clear author’s explaination, and also adds value to the Cardano system. If success the platform will help to contribute to the mass adoption of the Cardano blockchain increase the quality and quantity of Cardano engagement.\nIt is great when the author considers 3 challenges/risks that he/she has to face to implement the project successfully, but it would be greater if these challenges/risks could be explained more in details and the author could consider the mitigation of each of them. It’s just my suggestion for the proposal be greater. I still strongly agree the proposal is impactful.\n", "q0r": 5, "q1": "The platform is currently under the development with link and video included for readers to have the first vision of how the product will be, and it is the strong evidence of the author and his/her team’s talent, experience and skills relevant to executing the proposal. The type and number of team members as well as their roles in the project are showed, even though there is not much about members’ information, but we can see more about them in their social links which are included. The plan is well written in a very clear, succinct and understandable way with lists of activities that the team needs to do. Because of it we can understand about Ennarea and Ennarea pro, what and how it helps users trade and invest through the platform, and so on. \nAbout the financial amount, I see the big plan need a big amount budget, it is broken down into identifiables items in reasonable and clear way, and the author did mentioned $150K is request in this Fund in three proposals (as I said above). This proposal’s budget requesting is $50K, for lists of items as the author’s explaination: office setup, talent acquisition, team building, hosting, data center development, and other management expenses. I would have a suggestion here: if the $50K budget of this proposal could be shown in seperating section, it would help readers see easier and clearer.\nIt is interesting about the explaination of the problems and solutions of delivering the Ennarea product, it shows that the author has a deep research about them, however I think it would be more interesting if that research could be showed with links or any reference about: how low the adoption and development of blockchain technology in Africa are; the number of this statement in the proposal “Out of fifty-four countries, only five countries' fiat currencies have trading pairs on major exchanges, the remaining forty-nine are not supported and don't have trading pairs” (Where is the number from?), and so on. Besides, it would be more beneficial if we know more detailed about the security features which will be applied on the platform, to raise the trust in the platform for traders and investors.\n", "q1r": 5, "q2": "The author shows the well-done preparation for the plan of the project by including the long term vision, success metrics, KPIs and roadmap as well as the short term. The information is provided with a good level of detail, so that we can understand what results would be expected and what the specific goals are in the periods of 3 months, 6 months and 12 months. Moreover, the team commits the progress will be shown on social media platform to be easy monitered by the challenge team and the community, so I do not doubt about the proposal’s auditability. \n\n", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "A blockchain-powered banking and payment processing system.", "experience": "Software Engineer and blockchain developer. Developed a production-ready cryptocurrency trading platform."}