{"id": 396657, "author": "machdiamond", "title": "Business on the Blockchain in MIAMI", "url": "https://cardano.ideascale.com/a/dtd/396657-48088", "category": 26445, "amount": 185000, "description": "Need easy to use, fully integrated Business-on-the-Business (DAO) platform where Cardano can be used as the central medium of value-exchange", "f6_no_assessments": 8, "f6_rating": 3.9166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal clearly outlines how it will be a B2B/B2C solution for Cardano. DAOs will be at the heart of driving real world adoption on Cardano for B2B/B2C use cases, and the goal of this project is to make it simple and easy for businesses to create and manage their DAOs. \n\nThe proposer clearly shows they have been critically thinking about this concept for a long time through the inclusion of previous catalyst proposals that break the larger vision of this proposal into smaller components. It would be beneficially for the community to understand the status of those proposals in more detail.\n\nAs mentioned in the proposal there seems to be a focus on getting real estate developers and start ups in the Miami area to start operating as DAOs after the completion of this proposal. Tooling for these use cases will likely need different capabilities. \n\nOverall, I believe this proposal addresses the challenge because it aims to lower the technical barrier to entry so that businesses and real world organizations can operate on the blockchain as DAOs.\n", "q0r": 4, "q1": "It is unclear whether the team/individual will be able to implement this proposal successfully. While the individual proposer has an impressive background in spacecraft software and is located in a hotbed for crypto adoption, building DAO infrastructure wrapped in an easy to use interface is a highly complicated and large task.\n\nI am left with questions: Does the proposer have experience coding in plutus? Are there more individuals on the team trying to accomplish this project? Is this project talking to businesses wanting to become DAOs in Miami? Were the previous proposals communicated in this proposal carried out or worked on at all? The proposer can potentially shed light on some of these questions.\n\nI am familiar with a few other projects and development labs working to build easy to use DAO infrastructure within the Cardano ecosystem and encourage the proposer to get in touch to see how synergies between their projects and this proposer can be made. There might be more, but as previously mentioned it would be beneficial to see how this proposer can collaborate with other projects building similar solutions.", "q1r": 2, "q2": "The proposer has provided clear and understandable KPIs for after the completion/launch of V1, but due to the roadmap lacking identifiable time horizons it seems audibility of this proposal would be difficult. \n\nIt would be useful for this proposal to commit to providing a monthly/bimonthly update to monitor progress should funds be won. In general it is not obvious that this proposal can be easily audited as the roadmap does not detail time horizons and there is no mention of how the proposer/project will update the community as they embark on building DAO infrastructure.", "q2r": 3, "assessor": "z_assessor_1087", "no_vca": 13, "ne": 5, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is aligned with the Challenge.\nThis proposal clearly stated how they want to help the business enterprises using the Blockchain & smart contracts to solve their business problems. If executed properly this proposal will bring several enterprises to the Cardano ecosystem.\nThe proposal currently targeting the Miami area, subsequently, this project can expand their focus area to include larger geography based on their progress and performance. ", "q0r": 5, "q1": "The proposer mentioned that he has relevant experience as a developer but no link has been provided to verify the same. But the proposer is a Cardano community member as he is running the ‘MIAMI’ stakepool. The proposer has clearly mentioned the required team members to execute this proposal.\nThe fund requested is required to just get them started (seed funding) and they are subsequently going to get the additional funding through the DAO.\nThe fund requested is almost 20% of the challenge but considering the idea stated in this proposal, it should be funded.\nThe allocation of the requested fund as mentioned will be provided by the proposer.\nThe roadmap is clearly defined but the timeframe/months required to complete the proposal has been missing. It will be great if the proposer can provide the timeframe to complete the proposal. \n \n The proposer mentioned the main challenge is to convince the enterprises to use ADA as the base unit of value as it is volatile but with the introduction of the most awaited stable coins in Cardano ecosystem, this challenge can be eased. \n \n I think the main challenge will be to convince businesses to introduce the use of blockchain in their business. Considering the details provided by the proposer in helping the businesses in projected cost savings & auditability of blockchain, it seems the proposer is more likely to onboard many firms.", "q1r": 4, "q2": "As mentioned by the proposer the proposal can be audited/tracked with the completion of a security audit and subsequent successful launch of the DAO.\n As stated the proposal is already ‘work in progress’ and can be seen on the website mintmatrix.io.\nOther metrics can be seen after the successful launch of the DAO & subsequent onboarding of the Businesses. Such as the number of business firms onboarding/using the program, projected cost savings, projected revenue increase & the growth in mainnet & testnet activity. \n \n Apart from the timeframe and specific budget breakup, all details such as the roadmap & team required to carry out the proposal are provided", "q2r": 4, "assessor": "z_assessor_1444", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This proposal refers to optimizing the business on the enterprise, it will be very good if the platform is applied in practice and very suitable when the era is increasingly developing like today, but I need a solution. I prefer more clear details so that when the experts work together with the group of proponents there will be no overlap I hope this proposal will be expanded to address future challenges though However, the solutions do not have specific proofs. The studies are based on the research of the proposer group. I hope the group will come up with specific solutions so that the foundation model can be put into practice soon. However, besides that the project also has certain risks that we may not be able to foresee. It is necessary to have a specific plan to minimize the risks for ourselves and to prepare solutions so that when there is an accident, we can still stand. so that the project can still be completed on schedule that we have set", "q0r": 4, "q1": "Proposal is certainly highly qualified to attract experts as the project has a very good background to outline the field of experts and their impressive experience but to convince the experts our team must submit determine a certain timeline and whether that timeline is enough to complete the project or not. When the project is put into practice, I strongly believe that the project will save human resources and economic costs for businesses in terms of a budget of 3,460,000 ada and has been divided for each item as suggested by me. I think it's very reasonable, but it is necessary to leave an estimated budget to supplement in case of need or if not, there must be a backup plan when necessary. About members to work, I think that's too thin not to say whether the members' capacity is suitable or not if the project is successful, it is expected that there will be at least 100 financial organizations on the platform. If we have 500+ people making money through a compensation system that has at least 100 fiat-to-crypto ramps then I think this project is very viable.", "q1r": 4, "q2": "the team suggested they outlined how they wanted to approach the topic step by step pretty well as a CA I found this project pretty comprehensive on how an audit once run on minmatri.io's chain all the numbers will be in announced very transparently, no organization or individual can fake or change transactions with signs of metadata proving added value, the success rate is very large, but successful of the project is currently only an estimate and has not been specifically tested besides need to review the single vote ranking again I would like to find more specific description of how this is implemented should a concrete plan How I appreciate the team's projects and I fully believe that these projects will come into reality in the future.", "q2r": 4, "assessor": "z_assessor_1486", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "The good point of this proposal is that it’s very clear about the target audience, actions deployed, and positive impacts that the project might exert. All the information is presented under the bullet-point form, which gives the community a clear path for understanding. Their outcomes are well aligned with the key metrics of the challenge setting, effectively approaching the current problems.\nThe proposers clarify their solution by providing 3 main important KPIs they need to address followed up with further action plans and successive results, which visibly show their potential for development. The biggest challenge for this project is also well recognized allowing them to offer a good confronting orientation with a close explanation", "q0r": 5, "q1": "The detailed roadmap is provided, there are also some updates about their status in each stage, which allows the community to smoothly follow the implementation process. A full estimated cost is mentioned together with the detailed breakdown attached in the reference link. They also ensure a precise allocation plan for the funds to be provided soon, proving they are very professional and careful when it comes to the financial stage. \nThe proposers clearly identify all the positions needed and the expected numbers, which helps the community determine the scale of this project. However, a more detailed description of information related to employees’ skills, relevant experience to effectively execute the action plans would be preferable.\n", "q1r": 4, "q2": "In this part, the proposal concisely expresses how the team will measure the progress and development of their project using MintMatrix.io, but this tracking system needs to be discussed more its features, key metrics to assess the progress. Another good point is that they offer specific numbers for each figure they aim for, which is very useful for the Catalyst community to visualize their success and evaluate whether they achieve their goals or not. In case, these numbers are not positive, they also can easily figure out the problems, then operate further adequate action strategies.", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This proposal suggested an integrated system and a set of tools to conduct financial business activities on the blockchain. It mentioned the target audience of its solution clearly, all activities involved. It just listed impacts on businesses, how it will improve their accounting system. Detailed explanation about businesses’ needs and why they should employ this solution should be added to show how it helps solve the demand of businesses. From that, the description about how impactful it is to business would be more persuasive. However, the proposal did such an excellent job in explaining how this solution met three key metrics of the given challenge. With a simple funding portal of the project's MVP, it will raise additional funding to the stage. This solution also helps reduce a whole lot of overhead costs with the assistance of the blockchain system. An example illustrating this benefit was also provided to make it even clearer to see. Also, this solution will boost the Cardano network as it employs Cardano as the main currency for all business transactions. Another great point in this part is that it determines a challenge and makes a plan to overcome it as well. In conclusion, this suggested solution is aligned with the challenge.", "q0r": 4, "q1": "The roadmap was given, but there is no timeline included. Therefore, it should add the timeframe for each activity in the roadmap. However, it is good to see some KPIs to deliver this project. The cost breakdown was provided. But it should mention the total cost in USD so that it could be aligned with the requested funds at the beginning. It mentioned that most of the funds would be used for auditing and scaling software development. It would be better if this point were clarified. Why does it need to put a lot of financial resources into this activity? Regarding human resources, the proposal did list the number of members needed for this project. However, the information of staff was not provided. Instead, it should include the background, skills, and related experience of some talented and outstanding staff to prove that they are suitable and beneficial to operate this project successfully, which ultimately boosts its feasibility.", "q1r": 3, "q2": "The proposal mentioned the project would be traced via MintMatrix.io. However, the progress and the development should be able to be tracked as well. In fact, it should state that it would use the KPIs mentioned on the plan and add some timeline to see what is expected to achieve in each period of the project. From that, sponsors could see which stage the project is in and what it had achieved so far. However, it did a great job in listing details of what the success looks like by adding some numbers.", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is well written and briefly structured with the idea of creating a system and toolset for organizations to make Cardano as a central medium of value-exchange. I do agree that the proposal overall meets the challenge and does provide value to the Cardano Ecosystem. The intention is clear and the methodology is clear but I think it would be better if some explanations can be provided in the action list so that the community can understand the reason why that action should be taken. Besides, I would like to ask if it’s possible to use real numbers instead of just mentioning “$ additional funding” or “% growth” when referring to the number of proposals under the KPI section. Though I imagine that this might be hard to do. But if it can be done, it will further increase the level of auditability of the project as a whole.", "q0r": 4, "q1": "There is a very detailed roadmap with deliverables list in order to identify the development of this project. Though there are no milestones provided, I notice that the team actually updates their stages at the end of each task. The reference link provided for the budget is quite brief but I hope to see a more detailed allocation plan for the funds requested in this proposal since there is no explanation for each required sum of money. Regarding the team, I do not have any details. I know that the team would consist of developers for different professional fields but I do not have any specific information about each one. It would be necessary to know their names, a brief history of what they did before, what their direct connection with the Cardano ecosystem is. It would be also great if their profiles were made available on Linkedin for verification purposes.", "q1r": 3, "q2": "The author has provided simple but clear key metrics. I think it would be easy to keep track with the development since the system is inherently an auditing system in itself. They mentioned that the project will be tracked via the MintMatrix.io DAO's and other data value will be added on their website. It’s a very auditable proposal, it is enough that such monitoring is put into practice.", "q2r": 5, "assessor": "z_assessor_1702", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The team is proposing to establish a fundraising platform that will use cryptocurrency as the primary means of exchange. The project's target audience will include not just those who are already participating in the Cardano blockchain, but also new people who have an interest in it. The fact that one of their development goals is to on-ramp traditional small businesses onto the blockchain, hence assisting the community's growth, is worth-praising. This proposal's purpose and measurements are in line with the requirements of the challenge. It's also interesting to see the proposer define the objectives for each metric so that the impact may be estimated. Nonetheless, I would advise the developers to present more details on how it will meet the needs of the users of Cardano. Also, I would have preferred a clearer or more specific formulation of the problem statement and solution. Overall, such a project would have a positive impact on the Cardano environment, and if correctly built, this solution could easily scale up.", "q0r": 4, "q1": "Unfortunately, in terms of feasibility, the plan fails to give not only a description of the team's talents and expertise, but also a reference to verify them. This proposal, in my opinion, would benefit much from a brief presentation of the core team, as well as adequate connections to validate their skill and experience. Perhaps a link to previous work or LinkedIn profiles would be really beneficial. From the proposal, the majority of the funding would be spent on security auditing and scaling software development efforts. Although there is a roadmap with described events, it would be helpful to include extra information on the duration of each step. A well-defined timeframe with exact figures at monthly or yearly intervals is strongly advised. I would suggest that the amount of the budget (or percentage of it) spent on these areas be made public. Furthermore, developers are a part of the team; how the budget is divided among the individuals, as well as how many working hours are projected for each job, would greatly boost the viability of the idea. In conclusion, I recommend that the team consider providing a clear statement that these concerns were taken into account.", "q1r": 3, "q2": "The proposal includes some valuable information about measurements of success with specific numbers, which is incredibly easy to track the progress. According to the proposal, the project will be monitored via the MintMatrix.io DAO's on-chain activity with links to the proposed metadata identifiers. Auditability can be measured through the points that the authors address. It is, in short, the number of users participating in the platform (individuals, companies), the successful transactions, which all are measurable. However, I believe the proposer should provide much more information on the project's development and approach. It would be extremely helpful if we could see a detailed roadmap with milestones. For example, where is the project after three months, six months, nine months, and twelve months? Aside from the mentioned Mint Matrix,io, through what methods would the community be able to track the project's progress? To summarize, I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 3, "assessor": "z_assessor_1712", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The idea is to complete business registration forms for businesses that want to develop on blockchain and use cryptocurrency for payments. This section will be limited by geography, because each country's laws and administrative documents are completely different. But I appreciate the practicality of the project. This will be a useful transformation tool, helping businesses to legalize soon through available standards and documents to support them to participate in the crypto environment and apply blockchain to business.", "q0r": 4, "q1": "I appreciate this idea. However, the working group has not yet come up with a detailed implementation plan. In addition, the specific cost of each work item as well as the staff does not really have a clear personal profile. I hope you will soon add this information to ensure the transparency of the project. This is a practical idea, has been implemented many times in practice, but has not yet been applied to blockchain. So I think it is possible, but need more detail with your plan.", "q1r": 5, "q2": "\"Here is an idea that has been implemented in practice by the working group:\n\"\"At least 100 organizations operating their finances on our platform\nAt least 500 unique users earning money via the payroll or bounty systems\nAt least 100 fiat-to-crypto off ramps\"\"\nSo I think it's completely possible to re-examine the amount of work they deploy at the moment. They have their own website detailing their ongoing work. And the idea is simply to move the existing idea system onto the blockchain and allow payments with crypto. This promotes the use of crypto in business practice. However, I have not seen the details of their implementation on the issue of currency exchange payments in the country they deploy.\"", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Develop fully integrated system and toolset for legally registered (or unreg) organizations to conduct business activities on the blockchain", "experience": "My background is in spacecraft flight software which is requires the same level of high assurance and robustness as in financial systems. I've developed an MVP for this solution (2 years of dev) and currently positioned in the epicenter of crypto adoption in Miami."}