{"id": 396703, "author": "cristh.tejada", "title": "Industry 4.0 On-chain Platform", "url": "https://cardano.ideascale.com/a/dtd/396703-48088", "category": 26445, "amount": 98000, "description": "Industry 4.0 lacks tooling and proper guidance to seamlessly integrate Cardano's and other web3 Technology to their repertoire of solutions.", "f6_no_assessments": 4, "f6_rating": 3.25, "videos": [], "media": [], "f6_assessments": [{"id": 2387, "q0": "With a rapidly developing society in technology like today, the on-chain industry 4.0 platform is extremely necessary, but in order to implement the project, the challenge is not small because there is still a gap. there is quite a large gap between wed 2 and wed 3 in terms of scalability, processing speed, and operating costs but if the proposal is implemented I believe it will solve future challenges for the whole world Besides, I need the proposal team to have a report on more specific solutions so that they can convince the experts they embark on to cooperate and develop. Besides success, every project will have There are certain risks in this proposal, I see that you have not mentioned risks such as accessibility to most of the applications that are built independently, but not integrated with the popular and familiar web application. 2 is doing, it will reduce accessibility to users, in addition, the cost of developing a project is also very expensive and the cost of auditing I hope you will come up with a specific and appropriate risk management plan to convince the experts.", "q0r": 4, "q1": "My team's proposal is very feasible and capable. The timelines and phases are also very specific and I think with that timeline is also ideal to complete the proposed work. however i need the team to suggest how to make it as easy as possible for the community to check and track the progress of the project, with a budget of less than 10% of the total of a challenge i think the team recommends It's reasonable to split it up like that, but I think the group should also leave a budget to estimate in case it needs to supplement the budget at a certain stage or if there is no specific plan, I agree with the group on your recommendation here. I see there are eight members, all of whom have specific tasks, their experience and qualifications are very good. They have many seniority in the profession. the task assigned to each person I think is very suitable I fully believe in the feasibility of the proposal", "q1r": 4, "q2": "I see the proposal has given specific metrics that have been divided into three phases that are business, project, and the successful development of each stage has been described quite carefully. successful to overcome the challenges mentioned and also related to the challenges of the campaign, but the project is still at the idea, not tested in practice because this is a completely new project. so it hasn't been funded yet but I think this project is very good and very necessary for the current industrial age. I hope the project will be approved so that it can be put into practice soon.", "q2r": 2, "assessor": "z_assessor_1486", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 3023, "q0": "The proposal is based on a platform where industry might inquire on the solutions.\nWith my industry background I can say that it is not integration of specific blockchain that is needed but what kind of solutions allow increase in efficiency, productivity or savings. It is not clear from the proposal and would need more in-depth market insight. Would the platform provide such solutions or just act as connection point between ecosystem and blockchain experts?\nIndustry 4.0 is mentioned, but no details in regards to what specific solutions can be provided.\nKPIs and metrics are only descriptive with no estimates of values given.\nScaling of the project is not addressed.\n", "q0r": 3, "q1": "Team members are experienced IT professionals with verifiable links provided.\nThe budget is provided but lacks details and breakdown in each category.\nThe risk of lack of funding or the need and solution in case of additional funding is not addressed.\nThe plan for integration and building is very general and lacks details, especially in line with the requested funds which relate to a larger development.\nTechnical aspects of the implementation are lacking and/or underdeveloped.\nThe risks are mentioned and are great since the success is linked to community providing expertise as well as business requesting the service. Mitigation plan of these risks is not provided.\nOverall, the idea has promise but lacks refinement in many areas.", "q1r": 2, "q2": "Milestones are present and time horizon provided.\nMetrics to be measured are provided but lack estimates for orientation of values or an anticipated usage.\nThe problem statement is clear as well as provided solution.\nOverall, if the project is implemented it would be possible to audit the progress and success.", "q2r": 4, "assessor": "z_assessor_160", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 3600, "q0": "The suggested solution is to create a platform to come up with solutions for businesses using Cardano blockchain tech. The proposal clearly stated its main target audience including businesses, entrepreneurs who want to venture into Cardano Blockchain, which is aligned with the target object of the challenge. Besides, it also aims at attracting developers, business strategists who want to share or exchange their knowledge and experience in related use-cases from the main target audience. It listed the solution's main components, supplementary features, and other considerations and proposed features. However, it seems a bit vague about what the solution is all about. In fact, it listed all parts of the solution but there were no explanations about them to make everything clear and easy to visualize. It could be improved by mentioning a detailed description of the solution, giving more detailed information related to technical aspects explaining each component or each feature. It also showed the impact of this solution on businesses, but if more insights were provided in analyzing in great detail each benefit the solution offers to businesses, it would be more persuasive. It could do that by proving study cases or technical emphasis. It determined that the project would face the challenge related to building up the first communities of experts, developers, but no plans were suggested so it would be better if a short description to face off that challenge was given.", "q0r": 3, "q1": "The plan separated into 4 phases from the initial phase to phase 3 was given along with some milestones and a timeframe for executing that phase. However, it should explain more the details of each phase. For each milestone, there would be something needed to do, the details of that should be given including technical information as well. About the budget breakdown, it listed some types of cost along with the proportion of each. This is good to see which activity needs to invest a lot of capital resources. However, it should clarify more about each cost. For example, the cost for development, how it is calculated, the cost is used to pay for how many people or any other reasons. Regarding human resources, it listed names of the staff working for this project and the Linkedin link of each one.  Despite the fact that it mentioned at first that the team includes people with diverse experiences in  startup, business consultancy, software development, including machine learning and blockchain. They also work together towards solving real-world problems. But it should give a brief summary of their background, skills, and related experience or their outstanding achievements to show how suitable and beneficial they are to the project.", "q1r": 3, "q2": "The proposal listed some criteria to measure the business, projects, and development. However, it lacked figures to measure. In fact, it should set up criteria in accordance with the timeline of the plan so that it could be easy to follow. In each phase, it should mention indicators that help track, trace, and audit the proceeding process, which stage it is in, how long it takes to complete it, or some other criteria to evaluate the level of completion of each phase. The description of what the success looks like seems unclear. Again, more numbers should be added to make it clear and transparent to evaluate. Also, it should indicate this is a new project or a part of another one that was funded before.", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4208, "q0": "To be frank, I believe the proposed achievement goal is incompatible with the challenge settings. While the challenge requires innovative products and services that improve efficiency, transparency, and stakeholder engagement while also expanding business into new areas, the proposed solution's main focus is to create a platform interface for developing community driven solutions for a wide variety of real-world businesses using 4.0 technologies. I’m struggling to find a direct correlation between these two. But look on the bright side, this proposal is well-written with outlined main ideas. The team already laid out the main and supplementary target with full explanation of why they are listed. The solution is carefully described and there is an anticipation of risks. However the proposers did not show in which ways or methods would they overcome the problems. In my opinion, the proposal is extremely ambitious, but if successfully implemented it has a long way to go.", "q0r": 3, "q1": "At first sight, the proposal's team member content is very short with information about their names and roles, but they already provided reference links to verify relevant skills and experience of each member of the team, so I finally realized specialties of the author and works produced by the team. Together they formed a diverse team which I believe to have enough potential to carry the project. This team has introduced a clear roadmap with milestones that provide a foreseen vision of where the project will be after the specified time period. My recommendation is that additional information should be given, explaining exactly what would happen in each phase and how to assist the milestones and outlining them in a small paragraph below to clarify. The budget allocation is transparent, and it describes reasonable resource distribution for project maintenance. 60% of the fund is destined to cover Development so it would be helpful to list each team member's particular workload, as well as their hourly rate of work. Also, the cost of Marketing should be explained in a careful manner, each item should have a cost, not just a number in total expense.", "q1r": 4, "q2": "The author of this proposal just listed all works to do, along with a clear roadmap, defined milestones, and a time horizon that I believe is reasonable for completion. The roadmap explains how the project will advance step by step. The proposer had made certain that the metrics provided were in line with the expected metrics of the challenge. The KPIs are likewise explicit and provide easy-to-measure numerical goals for the project's various stages. As a result of these considerations, I believe this proposal has strong auditability for community tracking or following. The team should provide some kind of platform for auditors to connect with one another and know when and how the project is progressing.", "q2r": 4, "assessor": "z_assessor_1712", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Create a Platform interface for developing community driven solutions for a wide variety of real-world businesses using 4.0 technologies.", "experience": "From tech startup creators, to business consultants, and a wide variety of experiences in software development, including machine learning and blockchain. Our team is composed of a multidisciplinary team with a background working together towards solving real-world problems."}