{"id": 396820, "author": "ceo", "title": "Decentralized AI Drug Development", "url": "https://cardano.ideascale.com/a/dtd/396820-48088", "category": 26445, "amount": 56000, "description": "Large corporations are slow to adopt blockchain solutions due to lack of proper use-cases outside of finance causing unnecessary low utility", "f6_no_assessments": 7, "f6_rating": 4.80952380952381, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims to bring to Cardano a decentralized AI system for computational drugs and therapeutics that rewards computation and data. The solution would be useful in industries similar to  biotechnology, artificial intelligence, chemical synthesis, and other high-computation sectors.  \n\nAll of these sectors have a bright future ahead of them and are high growth, knowledge-intensive sectors. It is premature to say that there are significant scaling opportunities here that can benefit from a blockchain solution, but I think that the high rewards possible in case of a successful implementation definitely deems this proposal worthy of being voted for. I would assimilate it with buying a way out of money call option for a very low price. Five stars for the high potential.  ", "q0r": 5, "q1": "The team behind the proposal has two members, one of which has extensive experience in advanced research activities, and the other being an AI / web3 expert. The project would take 8 months to unfold, and would consist primarily of prototyping activities, algorithm development, training AI models and other practical applications. The budget is dead simple - funding the two AI developers for 8 months with 3.5k USD/month. \n\nFeasibility of the project? In this case it really depends how you define success. Using “classical” tools to measure this, of course you end up with a high degree of uncertainty. But there is definitely more to the research than that (which exceeds the purpose of this review), so four stars from me for.  ", "q1r": 4, "q2": "Again, it’s difficult to assess the auditability of this project. We are offered of course a plethora of KPIs (accuracy and scalability of simulations, projected cost savings for companies using the solutions developed, partnerships with academic institutions, etc.). A fascinating topic and a well thought-out proposal. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses the problem of disharmony/incorporation of physics information, data, knowledge, and algorithms in a cohesive and synergistic manner. the goal of this project is to create mass adoption of Cardano-based protocols in the computationally-oriented scientific communities including academia, industry, start-ups, and individual community members. It addresses this challenge by develop a minimum viable product (MVP) that can be built on Cardano to begin collaborating with pharmaceutical industries and biotechnology with the goal of being the decentralized cloud solution for AI-based drug and therapeutic development.", "q0r": 5, "q1": "This proposal provides a well-thought-out plan by offering several phases from developing MVP, collaboration, smart contract creation, and the last automation. The budget has been broken down into details (hours, number of people involved, etc.), which proven the ability of the proposer to identify the type of team members needed, as well as what resources are needed. Furthermore, the proposer as well clarifies the plan even after the fund. It looks feasible to complete this in a timely manner as it was explained to do jobs in months periods. The team members have clear knowledge and experience in handling this work. ", "q1r": 5, "q2": "The proposer provides a clear 8 monthly roadmap with their goals and expected results. To achieve those goals, this proposal provides activities and targets for each targeted month. This proves that the proposer knows what the problems and the solutions are.", "q2r": 5, "assessor": "z_assessor_1799", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal’s aim is to develop an MVP for a Cardano-based, decentralised protocol for the simulation of physical systems derived from the Nunet protocol, with the concrete purpose of developing a decentralised AI based drug development solution. By building this MVP, that will be coupled with a tokenomics model, it will incentivise community, industry and academic collaborations and involvement.\nBy reading the proposal, I have found it to be not only highly interesting, but also well researched and with great potential if successfully implemented, with a big possibility of having a positive impact on the Cardano ecosystem.", "q0r": 5, "q1": "The plan is very detailed, contains a lot of technical particulars and offers a good perspective on the entire process of the proposal.\nThe budget is simple, it as requiring a monthly salary for 2 developers for 8 months to implement the described MVP. The monthly salary is realistic and feasible.\nThe team working on this have provided ample description about their skill, and have also added 3rd party links to back up their claims.\nFrom all the information gathered, I see no details lacking and the team seems capable in successfully implementing the project.", "q1r": 5, "q2": "The progress metrics are very comprehensive, intertwined from time to time with success metrics, although there has been another detailed paragraph provided for the succes the team envisions for their project, and goes on to about 5 years after the launch of the project. From the information provided one can see that the team has been planing this project for some time and have given a lot of thought to all the aspects.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal hopes to open the computational development market of phamaceuticals, biotech, and more to Cardano. This means bringing the possibility of bringing major industrial entities into the Cardano ecosystem. By developing on Cardano with Nunet and Snet, they want to develop computational services that are traditionally developed by third-parties in academia or other startups. Here it seems like they want to develop a core team to work on the protocols for simulations and AI guided development of drugs, therapeutics, and other materials. They also want to eventually offer computational resources to the community once their ecosystem grows. All and all, it seems like this proposal accurately addresses the challenge. ", "q0r": 5, "q1": "He is a PhD student with various experiences in academia from AI, physics, chemistry, etc. So, it seems his knowledge for implementing this type of technology is there. Also, it looks like they are actively working with Nunet, to some degree. Nunet itself is developing on Cardano with a decent sized team. One issue that may arise is they are looking to hire someone, and the uncertainty in this makes me rate 4 and not 5. ", "q1r": 4, "q2": "They describe a series of key metrics that will be key to the success of the project. For instance, they mention peer-reviewed articles. This would be great if they could show the  benefit of their solutions over centralized competitors. They also mention increases in collaboration, which would be helpful to determine their growth and ability to tackle larger problems. And they say they will come out with a white paper in the first few months. Overall, they have clear over-all goals. ", "q2r": 5, "assessor": "z_assessor_2012", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The \"Decentralized AI drug development\" addresses the challenge \"Business solutions (B2B & B2C) by creating a decentralized protocol for the simulation of physical systems. The technology of which is useful for Biotechnology market. Community will be rewarded for supplying data. They want to build minimum viable product and collab with pharmaceutical industries for AI-based drug development. They will use their technology along with SingularityNet and NuNet for this purpose. If they manage to project successfully, it could be disruptive in drug development using AI and put Cardano ahead in MedTech.", "q0r": 5, "q1": "Project duration is 6-8 months after funding and they will need further funding afterwards. The budget breakdown has some mission information on AI developer cost. Overall, the budget is reasonable enough for the phase 1 to complete successfully. The proposal would have gotten the better rank if they inspect the figure before proposal submission.", "q1r": 4, "q2": "The proposal is very methodogical and has a well thought out roadmap. The AI based drug development proposal although is very technical but the progress of which can be inspected by domain expert like SingularityNet or other third parties who are qualified to inspect their promised algorithms. Also it should be obvious at eight months whether they manage to have working prototypes. They plan to update their progress on twitter also.(please consider adding social media channel in the future proposal) The funding now will build infrastructure that is needed for a decentralized platform of simulation based solutions that could be a game changer in drug development in future.", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This proposal introduces a solution infrastructure for a decentralized data ecosystem to help AI systems simulate more accurately, overcoming the problems of centralized data center such as local storage, redundancy, proper meet to the needs and interests of each organization.\nThis solution will provide accurate results from Deep Leaning, making AI advancement and help overcome problems that the old system could not be solved. The project will help add value to medical simulations and create a background for AI development.\nIf this proposal is well implemented, it will increase the number of transactions on the Cardano platform. \nThis proposal address the tasks of Challenge.\n", "q0r": 5, "q1": "The proposer presents full detailed roadmap by month and specific results. It is professional presentation with details and insights.\nThe budget for the project is reasonable because the most portion is for the personnel costs, other investments be paid by themselves to improve the results of the project.\nThis proposal has strong team with a rich AI experience related to biological, chemical and physical environments, who have good working background and clear profile.\n", "q1r": 5, "q2": "This is a large and long-term running proposal with a period of 3-5 years. The plan is described in professional way with the completed results by specific jobs. \nThe proposer provides set of KPIs showing that they are doing a lot of real work, which I believe they have clear understandable solution that addresses the problem. The roadmap /timeline are transparent making it easy for auditability.\n", "q2r": 5, "assessor": "z_assessor_759", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The goal of this proposal, in simple terms, is to run complex models and simulations using the Nunet platform, that allows Cardano users to provide underutilized computing resources in a decentralized and permissionless way.  The final goal of the project is to develop an autonomous drug development  system, but the scope of this proposal is limited to implementing a MVP with specific AI models relevant to drug development. \nThe intent is, in my view, perfectly aligned with the challenge, as it's opening  an avenue to collaboration with an industry that is right now not involved in the Cardano community.", "q0r": 5, "q1": "There are inherent risks in a project such as this. Some could be mitigated with more resources, but I think the plan and budget hit a sweet spot on being just the right size to explore the area, and decide if the results are promising, both from a technical and business standpoint.\nThe team combines academic competence (research at several high profile institutions) and entrepreneurship skills (the founder of an AI startup), and I think they can definitely implement this proposal successfully, with the caveat that \"\"success\"\" might mean finding out the models don't work as expected, or the cost of running them on distributed infrastructure come up too high.\nFinally, there's a hint on medium term plans for sustainability that I find really interesting, subsidizing research institution use of the models, in exchange of the model refinements and data derived from it. This might be the kernel of a Cardano drug development DAO, that could be huge.", "q1r": 5, "q2": "The proposed metrics are really toughtful, and the team proposes an interesting set of deliverables, geared towards encouraging adoption of the project (projected cost savings, paper comparing with centralized solutions), and also the wider \"compute on Cardano\" platform (metrics on the scalability of Nunet). I miss some metrics to track progress on model development.   I gather it's not easy, but I understand the team could report on the progress on simulations, the process of implementing models in Nunet, or just on the status of each of the four planned models.", "q2r": 4, "assessor": "z_assessor_941", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Decentralized AI startup for computational drugs and therapeutics while rewarding computation & data, with percent of profits to community", "experience": "Justin Diamond - PhD Candidate - AI Researcher in Physics, Chemistry, Pharma, Bioinformatics at academic institutions including University of Michigan, Toyota Technological Institute of Chicago, Boston University, University of Luxembourg, and University of Basel."}