{"id": 397127, "author": "henrik.metsamaki", "title": "Employment Credentials on PRISM", "url": "https://cardano.ideascale.com/a/dtd/397127-48088", "category": 26445, "amount": 60900, "description": "With thousands of recruitments done every day in Ethiopia, job seekers still don't have access to Proof of Employment-Credentials on PRISM", "f6_no_assessments": 3, "f6_rating": 3.7777777777777772, "videos": [], "media": [], "f6_assessments": [{"q0": "By building Employment Credentials on top of Atala PRISM in Ethiopia where Cardano is already used in the education sector and working with the Ministry of Education on a student credentialing system has the potential to be highly impactful. It could be used by other businesses to build on Cardano in Ethiopia, and generate \"critical mass\" for a blockchain based society and economic system in the country eventually. It is therefore highly aligned with the targets of the Challenge setting and very brave to compete in this difficult category against other B2C and B2B solutions instead of the \"relatively easy\" (or so some say) Grow Africa setting. \nIf successfully implemented, the Employment Credential SaaS could achieve that existing Cardano-based companies propose additional  solutions and new businesses make the leap to offer Cardano-based services or products. I strongly agree that this proposal thereby effectively addresses the challenge.", "q0r": 5, "q1": "This is an excellent presentation of Feasibility with roadmap, timelines, proposer profiles and external references to explain and back up the business proposal. There is a large and strong team behind the proposal that have worked together before and made up of Atala PRISM pioneers, IT veterans, Haskell programmers and business people, as well as team members with experience doing business and living in Ethiopia. From the information provided it seems highly likely that the project can carried out successfully. Inherent risks in the political situation in Ethiopia and delivering blockchain technology to verify digital identity. ", "q1r": 5, "q2": "The Auditability section of the proposal is not as strong as the other two sections, with KPIs named but not matched against any targets that the proposal aims to achieve and some not very clear references to the adoption of Credential adoption. It appears that the KPIs are given as a timelines and that they are purely qualitative in nature. I would assume that given Employment Credentials to Ethiopians is not an easy task and will not begin on mainnet until this MVP-style proposal is finalized. However, it would have been very helpful to see some efforts made to describe what success looks like during testing, on the testnet, what research can be published, externally verified and so on. Just saying that the proposal will be highly beneficial and should hit certain milestones over a period of 12 months is not sufficient to audit this proposal independently and we would have to trust the integrity and professionalism of the proposers.", "q2r": 3, "assessor": "z_assessor_1357", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "It described its solution but more technical information should be provided to clarify how it applies Atala Prism to issue Proof of Employment-Credentials benefiting both job seekers and businesses. It clearly described the functions and the process of issuing a Proof of Employment -credential. It did show the impact of this solution on job seekers. However, it lacks pointing out its impacts on businesses. It stated that this solution would help businesses with a low incentive system to join the credential issuing process without encountering any barriers. Explanations should be provided to clarify this part. Also, it should explain what are the benefits that businesses could gain and motivate them to part-aking in this process because as mentioned earlier in the proposal, businesses do not care much about the issuing proof of credential process as there are no clear benefits that they will receive. It also lacked mention of how this solution will impact the Cardano Ecosystem as well. However, it listed in great detail some challenges that it may face when delivering. And the plan to overcome was also provided as well.\nOverall, this solution seems suitable to the challenge as it provides a solution based on Cardano that helps job seekers and businesses to benefit from the process of issuing Proof of Employment. However, it should emphasize more on what business can get from it so that it would be more persuasive to say  that it is what businesses are looking for.", "q0r": 3, "q1": "The proposal did a great job in listing the general process of executing this project, then providing detailed information about each milestone of the plan. Apart from describing what to do in each step, it also provided how it would be done through technical analysis. The plan seems to be so thoroughly prepared, but it lacked a timeline. It should indicate each milestone will last for how long, how many weeks or months. The budget breakdown given was detailed. It listed the cost for each milestone listed in the plan. In each milestone, the budget was distributed for different activities. It is good to see in this section that it mentioned what it is used for, how long it is used for, and how to calculate it. Everything is quite clear and transparent to follow and audit. This also shows that it has a clear financial distribution plan, which also partly proves its feasibility. Once again, the section related to human resources was well-written. It first listed the team needed for each milestone in accordance with what is planned, mentioning who will do what. This makes it so clear to visualize from the plan to the budget detail to the workforce that in each milestone how it will take place with the involvement of who, and how much capital resources are needed. Besides, a detailed description was also given. It included the background, skills, and relevant experience of the team members involved. The link to their profile was mentioned as well for reference. All in all, this project seems to have a high possibility of executing successfully as it gives a detailed plan in combination with a transparent cost breakdown and a high-quality workforce.", "q1r": 4, "q2": "Although, it gave three KPIs to measure the progress and the development of the project. It lacked specific figures in it to make it clear and easy to audit. Moreover, as it has a clear plan with different milestones, it should provide KPIs for each milestone so that sponsors could track, trace, and audit the progress and how each milestone is conducted. However, the success of this project was measured through specific figures. Besides, it should mention whether this is a new and independent project or a part of a previously funded one.", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal team describes an interesting opportunity to use PRISM technology in the job seeking and recruitment process in Ethiopia. They provide a fairly detailed plan and their proposal would certainly spread usage of Cardano, if businesses were to issue employees credentials using Cardano’s PRISM technology. What the proposal is lacking is a clear articulation of the exact problem being addressed. The proposal’s problem statement explains, “Job seekers still don’t have access to Proof of Employment-Credentials on PRISM.” The proposal does not explain why this is a problem. The proposal needs to describe why integrating PRISM into the current process flow would make the experience better in some tangible way. The proposal states that proof of employment credentials “can be leveraged to gain better credit score for insurance and banking or maybe find a new job or apply to a university.” The proposal would be strengthened by explaining how the current system inhibits these activities, and in what way using PRISM would solve the problems. Otherwise, it will be difficult to convince any business to invest the time and resources to integrate a new and unfamiliar technology into their business practices. The proposal states that using Fairway’s technology provides the best solution for all parties “and fur the businesses the easiest possible way to participate in the process of issuing and verifying Proof of Employment.” While Fairway may make it easy for a business to issue a Verifiable Credential, the proposers need to explain why any business would want to change their current practices and issue a Verifiable Credential in the first place.  ", "q0r": 3, "q1": "The proposal team consists of a number of individuals with a range of skill sets including business skills, development skills, PRISM experience, and connections in Ethiopia.  It might be helpful for the team to resesarch the existing work Cardano is doing in Ethiopia to use PRISM to develop a student credentialing system, as I would think they could leverage this work to support their project (https://finance.yahoo.com/news/cardano-plans-build-national-id-073828481.html) The team has a reasonable plan and timeline regarding the technological feasibility of their project. The biggest feasibility issue relates to the potential to onboard businesses to use the technology, as was described in the prior section", "q1r": 4, "q2": "The KPIs are specific and tangible. It should be easy to track how many DIDs are created, how many credentials are issued, and how many of those credentials are verified. It is also clear that getting businesses to use Cardano’s technology will increase the blockchain’s global adoption. The auditability section states that the project will increase adoption “in a market that…needs these solutions the most.”  It would be helpful to explain why this market needs DID solutions, and how the participants will benefit from the project’s success. ", "q2r": 4, "assessor": "z_assessor_662", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "We have created a user-friendly SaaS software that can apply PRISM making the issuing of Proof of Employment-Credentials efficient and easy", "experience": "Fairway team:\nIs established in Ethiopian market with good connections to local businesses, universities and to the Labor Information Director in the Ministry of LaborIs enrolled on PRISM Pioneer ProgramHas experience in SC's, Dapp's and NFT's"}