{"id": 397114, "author": "janasanovsky", "title": "Help2Health: Cardano + Citaldoc", "url": "https://cardano.ideascale.com/a/dtd/397114-48088", "category": 26445, "amount": 34760, "description": "Lack of healthcare solutions to integrate patients, doctors & stakeholders in the use of ADA and Cardano smart contracts to protect privacy", "f6_no_assessments": 8, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1592, "q0": "I completely agree that the proposal under the Business Solution challenge is reasonable because the project offers opportunities for collaboration with businesses and consumers. Propose solutions that will add value to the Cardano ecosystem. However, it would be better if you could make a demo of how your app works in English to reach the vast majority of users, how you integrate the payment gateway through the app.", "q0r": 4, "q1": "The proposal is feasible when giving specific timelines to complete the works, the project team also provides information of project members with experience in the healthcare industry. How to allocate capital according to the jobs in a reasonable way. However, in integrating ADA/DJed as a means of payment, it will be clearer if you provide specifics on how you integrate, or cooperate with partners in the payment space. \nIn addition, I think that if you provide more evidence about the agreements reached with the government, the pharmaceutical laboratory will make your project more feasible.", "q1r": 4, "q2": "The project provides a specific development roadmap, but to make it easier for voters to check, the project should include additional performance metrics when completed. For example, there will be 30 face-to-face meetings with partners and photo-proof evidence, or all 50 registered professionals. A specific number will be practical to measure the success of this project.", "q2r": 4, "assessor": "z_assessor_1394", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 2083, "q0": "This proposal is according to the challenge, specifically, they want to adapt their functional Argentine Platform to run on Cardano.\n\nIn the different meetings, the team of Cita al Doc expresses that want to use blockchain to amplify their market all around the world and end with the bureaucracy of banks.\n", "q0r": 5, "q1": "The proponents have 20 years of experience and the platform of telemedicine is already working. It is very easy to implement this idea and develop it with the right team because the main website is already working and have active users. However, they will have to work a lot on the user experience of the page, and not only hire developers, but also a marketing team with experience on the blockchain.", "q1r": 5, "q2": "They must think about a plan to how to catch new users and doctors to use their platform with blockchain technology compatibility. Also, they say that want to educate users and doctors about blockchain technology, and that is a very useful thing for Cardano, but how is the team gonna make it? Tell them only how to pay and receive that payment? Or explain to them why they choose cardano and the fundamentals of Cardano technology, with security, efficiency, and transparency. It's very important to present a plan for the education of doctors and users.", "q2r": 4, "assessor": "z_assessor_1452", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2390, "q0": "As we all know, with an increasingly developed society, health care for patients and doctors is an issue that all countries around theare solutions in many countries to integrat world are aiming for. However, at present, there is a lack of healthce patients and doctors. With the idea of ​​bringing ADA and Cardano smart contracts to protect privacy. I think this is a very good idea. Here the group has raised the issue that, countries around the world are having to invest a lot of money in the health sector. and the introduction of Citaldoc technology into healthcare management. As we all know Citaldoc is a flexible, extensible platform where B2C and B2B models coexist. The team's solutions are very good and suitable for the future challenge, which is to balance the opportunity to access safe, affordable, and quality healthcare services. Will start testing in Latin America and the Caribbean and later expand to the world. I found this proposal to be able to solve the problems in the challenge. The group also gave very reasonable evidence, studies, and arguments. on risk management. The group also pointed out the risks that the project may encounter very specifically as stated in the project. and also suggest ways to deal with those risks. However, I would like to emphasize one more risk. Currently, Cardano and ADA are not widely available, so accessing the medical education industry will take a lot of time.", "q0r": 4, "q1": "in providing detailed plans and timelines. I see in the proposal there is a specific timeline that will be completed in more than 1 year. and has been broken down for each specific period. I think with such a divided timeline, it is very reasonable to complete the set tasks. However, the progress of the project is not easily monitored by the community. with a budget of nearly 35% of the full challenge budget and has been broken down for each item as mentioned. I find that to be very reasonable. However, I think the group should have contingency plans in case the budget needs to be allocated when needed. in the section stating the list of team members. I see the group has raised four members. assigned tasks and tasks to each specific member. With team members who are leading experts, doctors, and directors, they have many years of experience in the fields. have a very high level of intellectual property certification, the identities of the members are verified and easily tracked by the community.", "q1r": 4, "q2": "In the description measure the progress and development of the project. I see the team listed 13 metrics. There is a lot of success to be achieved already stated in the indicators. However, the metrics are not easily tracked by the community. Besides, the success of the project is also clearly stated. it's short-term, medium-term success. This is a new project so it has not been funded yet but I think it will be a long term success and success. It must be said that if the project is put into practice, it will be quite successful. I find the success of the project very much related to the challenge. However, the project is still at the point of untested ideas. But I think this is a very good project. I hope the group will receive a lot of support from the community. I totally agree and appreciate this suggestion, good luck to the team.", "q2r": 4, "assessor": "z_assessor_1486", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 3348, "q0": "The proposal offers a very detailed solution description starting with the intensive market research with impressive statistics, which help the team clearly determine their target clients. Their product is also well described with clear main features. Besides, an exhaustive explanation of their business model with the combination between B2B and B2C with detailed examples are provided, helping the community fully understand how it gonna work. \nThe community can clearly see how the project is carried out by looking at the courses of action presented in the proposal. The website address is also provided for references\nThey have a clear vision of what they are capable of, a bunch of reliable external links concerning their product is attached for further information\nFor the risks management, the proposers go through a brief summary of their challenges and then offer deeper analytics based on collected data, showing careful considerations supporting the operation process. They also point out the opportunities before offering the synthesis of all challenges they may encounter. There is a need for the possible solutions to each difficulty to be planned.\n", "q0r": 5, "q1": "They submitted a very detailed and reasonable timeline in 6 months of running the project. All activities are split into 3 main areas: development, education - marketing, and backend - administration followed up by a precise schedule and time period. This delivery plan will allow them to achieve the goals aforementioned \nBased on their actions plan, they offer a compatible spending program including the number of features and the cost charged per hour and in total. By seeing this budget breakdown, the community will be able to see how they spend money on the project and therefore, evaluate whether it is effective or not.\nThe team is good with experienced founders and prospective members. Their past work will be a solid base for further development in this project. Their LinkedIn accounts are also provided for more careful considerations ", "q1r": 5, "q2": "The propose all the necessary KPIs, which match with their implementation plan, to measure the progress and development of the project. By these indicators, they also can easily detect any problems that might happen during the deploying process to have an appropriate strategy. \nThey define their own success in a specific way and then break it down to short-term, medium-term, and long-term success. They clearly visualize how their project will affect their target audience and the Cardano community in general, which can be counted as a good strategic vision.", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3601, "q0": "The business model of this proposal is what the challenge is seeking as it will convert an existing product, which is Citaldoc ( https://www.citaldoc.com ) is an already operational telemedicine platform, to run on Cardano. Every party involved in this project will all get benefits, from the patients, professionals, and other health stakeholders creating an overall positive social impact, which boosts stakeholder engagement. This aligns with the given challenge which aims to find out a product or service that increases efficiency, and the participation of all stakeholders.\nThe project aims at both B2B and B2C customers with a clear business model for each type of customer, which is totally aligned with the challenge. The product was introduced in full detail about what it is all about, its users, its features and how it helps make a profit. The proposal also highlighted the potential market in the medical segment in the Latin Market with statistics collected from reliable sources, which is a plus point to emphasize the impact of this project if it is incorporated with the Cardano ecosystem. A lot of opportunities and challenges were also mentioned, but it lacks solutions for those hurdles. Overall, this project seems to be quite impactful and prospective in creating values for all related and contributing to the development of the Cardano ecosystem as well.", "q0r": 5, "q1": "The proposal set up a 6-month plan which satisfies the requirement of the challenge that is looking for a long-term project lasting from 6-9 months. This plan was extremely detailed as the proposer divided the process of executing this project into three different segments, namely DEVELOPMENT - PROGRAMMING, EDUCATION and MARKETING, BACKEND AND ADMINISTRATION. In each segment, there is a detailed description of every step in the process attached with certain time milestones, which proves that the proposer knows what to do step by step to operate this project successfully. Another thing that is worth mentioning here is that the proposal provided a very clear budget breakdown going from the total of capital needed to the smaller sections. For each small section, the proposer listed out the budget required, how long it would be used for, and how it is used to reach a certain purpose of the project. It could be said that the budget was thoroughly allocated into many distinctive activities in order to avoid wasting capital resources.About the human resource distribution for this project, it consists of talented people who are used to be CEO of some firms and the mentor of a tech company in the medical field, and some developers. It would be better if the proposer included more information about the background of the developer team with their reference link to their profile to show how suitable they are to this project. All in all, the proposal proves a high level of feasibility thanks to  providing a clear step by step plan over a timeline, a detailed budget breakdown and the people involved in the project", "q1r": 5, "q2": "The proposal mentioned KPIs but lacked specific numbers to better measure and track the proceeding process of this project. However, it did a great job in describing what the success of this project looks like in great detail. It defined the success of this project first then going into short-term success, to a medium and long-term one with some figures. This proves that this project is so potential in the long run and it is also auditable as well. Sponsors can track the status of the project in different milestones.", "q2r": 4, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4225, "q0": "They have developed a comprehensive plan to make it easier for consumers to get medical services online. This project's possible objectives include not just medical parties, but also government or corporate entities. Extending the target audience will help the project become known to a large number of people, and the likelihood of success is extremely high. Furthermore, Citaldoc is a model that allows B2C and B2B to coexist, and it may generate a lot of profits when integrated with the Cardano ecosystem. The B2C vs B2B model, through a unique management mechanism, allows customers to enjoy both medical care advantages and incentives such as discounts or earn points. Furthermore, the recommended solutions are perfectly suited to this challenge. This will push the circuit to use cryptocurrencies like ADA to make the number of people accessing the Cardano system more and more. However, it can be observed that the proposer has discussed in full the issues that will be confronted in the coming, but the solution element - a crucial aspect - is lacking. I'm hoping that by leaving this comment, the proposers would be able to quickly come up with more precise answers.", "q0r": 4, "q1": "The percentage match between the plan and the required capital can reach up to 99 percent. hey provide specific items for the last six months of the year, separated by month or even hourly, and I am quite impressed. The fact that they can precisely estimate the number of hours of required labor to finish anything demonstrates that they have spent a significant amount of time conducting extensive research. I'd also want to compliment the project team. They all have several years of expertise and practically all have previously engaged in health-related activities, therefore they will undoubtedly bring success to this project. For the 1% missing here, I don't see in their budget is that they don't mention recruiting extra outside help. Maybe it's insignificant, but it would be better if they added this detail to their project.", "q1r": 5, "q2": "In terms of the success they seek, I wholeheartedly concur. Beginning with short-term success, growing the number of ADA users will provide several benefits to the Cardano ecosystem, particularly in areas with high medical expenditures like as Latin America and the Caribbean. In addition to the medium and long-term accomplishments, scaling to other continents and linking various professionals with different languages would assist the Cardano ecosystem in expanding to the global market. That is, of course, a very awesome spot. However, for the project's development progress, I urge that the proposer offer a timeline and particular statistics so that investors may track the process more closely.", "q2r": 4, "assessor": "z_assessor_1713", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5474, "q0": "The impact of blockchain across the health department would be extremely beneficial to both the patients and the doctors. Patients would have direct access to their files and at the same time the level of privacy would increase dramatically.\nHowever, promoting it as an incentive for telehealth appointments, especially in areas where doctors are available 24/7, not only reduces the number of people who would benefit from blockchain technology, but at the same time, it potentially reduces the level of privacy, through video conference apps, thus erasing and potentially creating a worse situation than would have been through a regular health visit, that could offer some if not all of the benefits of the Telehealth appointments.\nWith these issues emerged, I cannot safely judge the positive impact the proposal might have on the Cardano ecosystem.", "q0r": 3, "q1": "The details that have been provided are clear and concise, the timeline is comprehensive, the budget is well formulated, the team members have provided links to their previous work and for those who are not yet on the team (the developers) it looks like they know who to hire and what to ask for.  In conclusion it seems highly likely that the proposal will be successfully implemented.", "q1r": 4, "q2": "The KPIs presented are on point and specific to the proposal. The definition of success is detailed and distributed on a longer period of time than most projects, since this proposal deals with a lot of human variables that would be difficult to quantify in a short term.\nThe success definition is very comprehensive, and goes over a long period of time, with separate segments for each timeframe.  While most parameters are well written, I would suggest to the proposers that some are considered hype words, like “Health Metaverse” and “Transform into DAO” and as such, they should evaluate what they will be able to implement, especially as there is no information relating to a health metaverse throughout the proposal, except at the very end.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 7901, "q0": "This is a medical platform for online medical examination and treatment. They have a medical system and experts in the medical field, they want to apply blockchain technology to create smart contracts to make medical examination and treatment automatic, secure and transparent for everyone. customer. This is a good idea to automate and make the medical field transparent, and at the same time, the security of information when blockchain application is clearly more prominent than the usual centralized ways of information management.", "q0r": 5, "q1": "This project has a blueprint for 6 months and beyond. They aim to have a medical system in place and have a roster of more than 1700 medical professionals who will participate so I highly appreciate the feasibility of this project. This will be a medical platform that combines scheduling and saving medical records through blockchain - very suitable for the medical situation of the past 2 years when the Covid-19 pandemic occurred. At the same time, the platform also allows payments in ADA and Djed - the two main coins on the cardano platform. I hope they will get funding to deploy Plutus smart contracts for healthcare.", "q1r": 5, "q2": "This is a project among quite a few projects that I am satisfied with the detail of the project's success evaluation criteria, when they fully state the parameters to help the community base their assessment. progress and scale of applying blockchain technology to medical examination and treatment. In addition, they are willing to provide complete information on their existing website. I appreciate the feasibility and ease of testing of this project.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Promote healthcare by implementing smart contracts based on Cardano and ADA/DJED as a payment method with crypto bonuses and incentives", "experience": "Team with more than 20 years of experience in e-health, telemedicine and pharmaceutical industry.\nCitaldoc.com is a benchmark in telemedicine with more than 100,000 registered users (patients and health professionals). We are a reference company in telehealth"}