{"id": 397339, "author": "raz", "title": "Community Lead Generation", "url": "https://cardano.ideascale.com/a/dtd/397339-48088", "category": 26445, "amount": 29000, "description": "Businesses are looking to embed sustainable practices, however, very few are related to blockchain, and unlocking Cardano’s potential.", "f6_no_assessments": 9, "f6_rating": 4.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 3350, "q0": "The proposal starts with the description of Cardano and its impacts on businesses, which explains their motivation for creating an open-source, innovative product to increase the collaboration with impact businesses on the Cardano ecosystem. The community can clearly see that their solutions are closely aligned with the key metrics and largely solve the challenges approaching. They give a clear presentation of the project including explicit goals and its main features. They also visualize the long-term vision for their project, propose specific results such as improving the entire onboarding process, data management,...This obviously shows their intensive research and carefulness in proposing solutions, which can be taken into the proposal evaluation. \n\nThe proposal sensibly answers the question brought up in the challenge setting with practical examples. All the key metrics of challenge measurement are considered to be in the guidelines provided to the community. Some main issues they may encounter are well mentioned together with some initiatives to mitigate.\n", "q0r": 5, "q1": "A detailed roadmap is provided with 2 main phases in a total of 16 weeks. With each phase, they mention the central task and then split it into small ones to guarantee attainability. The specific KPIs are also provided for the community to easily track and follow the implementation plan. \nThe team is very clear and careful about their budget spending, which is detailedly broken down. They effectively present what and how much they gonna spend on each feature. And these costs are proven in tune with their action plan and schedule. \nThe team members' information and their highly relevant experiences in the Cardano community and blockchain area are described. They have worked together for the past 6 months and are promised to give a strong commitment, which benefits them in running the project smoothly.", "q1r": 5, "q2": "As they mentioned, all information will be open source, so the community will easily access to have the best picture of the project development. This also allows them to assure the great clarity of their project. There will be a report every month to explain the work done and KPIs (mentioned in the timeline) achieved during the month. They also have an external audit team to ensure the most attainable auditability. Their vision for the project’s success is very easy to understand and realistic based on the achieved indicators and the number of collaborating members.", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 3605, "q0": "The proposal pointed out real businesses' needs. Businesses today want to create impact-driven businesses or the transformation of business. It is commonly known that from big corporations to small-sized firms, they also strive to create a business that has a positive impact on society and the environment to achieve sustainable development. And the proposer also cited the case of Nestle as an example to illustrate this is a real business need. Therefore, the proposal suggested a solution that is totally appropriate to the needs of businesses and aligned with the problem of the challenge as well. The proposal also mentioned that in order to meet the demand of businesses in creating an impact-driven business and expanding their business scope and areas, Transparency and traceability are two things to focus on. And tools on the Cardano such as DID, smart contract, open ledgers, ...will be useful ones to solve this issue. In fact, this project will help make the best use of tools on Cardano to boost the ability of tracking and the level of transparency, and connect businesses in the Cardano ecosystem as well. This will attract businesses to join Cardano and this project also includes products to support them in the onboarding process. The proposal named some challenges related to how to build trust in businesses to join the Cardano community. It did suggest detailed solutions to overcome these challenges by providing the most sustainable contact and company within the Cardano ecosystem, guidelines in great detail, and a clear budget for external auditing of the project. In sum, this proposal did a great job in emphasizing the businesses' needs and suggesting a solution that is closely based on their demands. Also, it explained how useful it is to join Cardano to better achieve what businesses expect. However, it would be better if more details of some main features, functions of the project’s product related to technical aspects were added.", "q0r": 4, "q1": "A plan separated into two phases was mentioned, but it did not include the phase supporting businesses on the onboarding process in Cardano. A good point here is that it included the KPIs to describe what is expected to achieve when following this plan. A Budget breakdown was well-written including incentive budget and process lead budget. In each section of the budget distributed, it explained in great detail how the budget is used.The team working on this project has been cooperating with each other for the past 6 months, so it would be easier for them to communicate and collaborate to achieve the best outcome without wasting time adapting to the working style of each individual. Besides, the leader may know each member's weaknesses and strengths as they have been working together for a long time so that the job may be assigned more effectively to take advantage of the strong points of each team member.The team includes Nori with 30 years of experience in software development would be a highlight to prove the feasibility of this project. Besides, some staff have accumulated much experience in the Cardano community. All in all, the project is still feasible thanks to having a quite detailed plan, a proper cost breakdown in great detail and team members who have been working together.", "q1r": 4, "q2": "The progress of this project would be measured in months through monthly reports. The project also stated that they would use an external audit team to evaluate the progress using the DYOR form, which is transparent enough to track and trace clearly. However, it did not include information related to the status of funding for this project. Is this project totally new or was it funded before?", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4043, "q0": "There is an interesting problem raised by this proposal. According to the team, there are very few businesses’ sustainable practices that are related to blockchain and unlocking Cardano’s potential so a new model that generates business collaborations for people who seek to be blockchain for impact pioneers is a must. This project wants to create an open source model to collaborate with the community and generate a range of opportunities for collaboration with impact businesses, then onboard them to Cardano. This will be a great contribution with an even greater impact if it happens since it brings more businesses into our community and helps them take full advantage of the opportunities Cardano unleashes. The proposal identifies a problem fitting for the challenge setting. There is a clear idea of how this will improve the ecosystem. They even provide some examples and research based on Nestle’ 2020 annual financial report to prove their point. Overall, I do agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team members seem very committed and potential since they have necessary experience to cover a variety of skills needed for this project and more. It is also possible to verify the information and members’ achievements due to the reference links provided except for Melanie Russo. I hope her reference link will be included as soon as possible for verification purposes. The budget is very clear and detaily broken down to be understandable and provide enough information on the required sum of money. There is a realistic roadmap set for all stages of the proposal. The plan is sensible and the “how are we building this” is described as much as the “what are we building and why?”, which is quite great. all the necessary resources to implement the proposal are listed. Overall, this is a good feasible proposal.", "q1r": 5, "q2": "The key metrics and KPIs mentioned are relevant for the success of the proposal. No problems concerning traceability or auditability since these people are very active community members updating developments of the project through google folders( I hope a link will be provided soon). They also open discord and telegram channels for communication and information gathering and sharing so that voters and the community can easily audit the process.", "q2r": 5, "assessor": "z_assessor_1702", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4212, "q0": "The concept is well-explained, and the proposal is well-structured. This proposal is a continuation from one funded in F6 and, as I understood, it actually broadens its scope in such a way that really makes sense and makes it more robust. The goal is to create a new model that provides many opportunities as well as support for the onboarding process in collaboration with the community, which I believe is completely appropriate for the task. It is also evident how the proposal impacts the challenge in a credible way. The team discusses in depth the long-term vision for the next 6-12 months, including a strategy for achieving the set objectives.Another good point is the proposing team adding plans of scaling up the project, also they anticipate some potential obstacles and provide reasonable solutions to tackle, which highly grows confidence in everyone who is interested. All in all, the proposal does address the challenge, engaging and scaling up Cardano communities, possibly expanding business into new areas, and having the ability to spark various and fruitful discussions.", "q0r": 5, "q1": "It seems that the proposal can be implemented successfully as it has a very competent team behind. There are clear presentations of each of the team members knowledge, experience and competency, these are supported by both Linkedin profiles and mention of their initial works. As I understand, this project covers 16 weeks divided into 2 phases. The proposal timeline and milestones are clearly outlined, a detailed explanation on what events will be carried out in each phase so that we are able to keep track of the progress and know exactly where it is heading. A full mention of KPIs and deliverables are displayed. The funds requested to establish the project are very reasonable and the author of the proposal already demonstrated the budget allocation. Somehow it seems vague to me, which jeopardizes the feasibility assessment of the requested budget, as it would have been preferable if they had additionally included more information specifying the quantity of work for each phase/time required along with corresponding remuneration. Overall, I am confident that the project can be implemented successfully based on the information provided in this proposal.", "q1r": 4, "q2": "This proposal has a high likelihood to be audited based on the information given by the proposer. The team claimed that all the information will be open source, and shared with the community. Various platforms are included as a method of communication: discord, telegram,… The proposal represents a well-defined roadmap with a clear set of actions over the course of 3-4 months. A section of specific KPIs is displayed, and the proposal's accomplishment is very measurable by its set deliverables. There is a clear and understandable description of the targeted problem and the solution to the problem. I agree that the information provided is sufficient to audit the proposal's progress and success, hence I give it a score of 5.", "q2r": 5, "assessor": "z_assessor_1712", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4769, "q0": "My compliments go to the team for this fantastic proposal, particularly for the amazing articulation of the context and reasons why we need to handle the many edges of this complicated challenge. This project aims to develop an innovative 'Cardano Impact Community' model that generates business collaborations for those seeking to be the blockchain for impact pioneers by developing an open-source, innovative model to collaborate with the community, generating a variety of opportunities for collaboration with impact businesses, and onboarding them to Cardano. I liked the overall concept, the project proposal, and the overall stated tasks and milestones, which seemed like a reasonable notion to me, not only for the desired investment value but also for the entire project proposal. Also, the project's concept and design appear to be well-thought-out, and I will be accessible as an expert in this field to assist the concept and project implementation. There are various possible use cases associated with this concept that may be worth considering in a longer-term vision. The challenge goals strive to enable community events to increase engagement, onboard new members, build new teams, and so on, and this idea correlates extremely well with all of those purposes, offering appropriate KPIs to demonstrate as much.", "q0r": 5, "q1": "I have nothing but appreciation for the team in terms of feasibility. Each subject is discussed in depth. Regarding the remainder, all of the checkpoints are there, you can verify the team members' talents and expertise (through LinkedIn connections), and the budget is very well specified and aligned with the ideals. The degree of detail offered in the \"project detail” section helps the community comprehend the implementation procedures. There is also a high level of detail in the descriptions of the budget items, addressing all aspects of the budget. The only point that is not explicit in the proposal is the evaluation of risks that prevent successful implementation but it's not a big problem. There are already so many proposals that align with the goals of the proposed challenge setting, and for sure the success of the challenge would attract many new and innovative ideas", "q1r": 5, "q2": "The project contains pretty solid time-framed KPIs with the aim, which helps to evaluate progress as it progresses and have a reference whether or not success was reached. The KPIs are more focused on the operation and the milestones to development/implementation, which makes sense for a project like this and ensures that all stages are covered and auditable. Some milestones can also be retrieved from the suggested timeframe. The fact that the project will be open source merely lends another degree of credibility to it. This idea has a high auditability.", "q2r": 5, "assessor": "z_assessor_1772", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5478, "q0": "The scope of this proposal is to build an incentive system for the Cardano Community members, with small rewards in ADA, for establishing connections to impact businesses and potentially onboarding them on Cardano, as such expanding the base of companies joining the ecosystem.\nWhile there’s a big chance that this project will succeed and attract a series of companies to the ecosystem, there is also a chance of creating a SPAM engine that in the hope of receiving a small amount of ADA, will keep pushing the Cardano name on different businesses (similar to the SPAM received on discord for whitelisting spots of NFT projects - those are also people who are doing what they can in order to be eligible for a small, or sometimes large, reward, either in ETH, ADA or as NFT).\nI think the proposers need to consider all plausible options when drafting the guidelines and see how they can come up with a solution to deter any negative outcomes and keep the impact it could have on the ecosystem in a positive direction.", "q0r": 3, "q1": "The detailed plan and timeline are very comprehensive, the budget is well explained and realistic, covering all areas of the project - both the incentive amount as well as the process amount for the team working on the project. The team members have provided sufficient information regarding their previous works and links to their social profiles. As such, I find the proposal can be easily assessed for its implementation.", "q1r": 5, "q2": "Both the progress metrics and success definition are thorough, covering not only the general aspects of the proposal but also some smaller, but significant details, like having an external audit. Most notable are the fact, that they intend on keeping the entire process as transparent as possible, for the entire community to be able to check the progress and success independently, and at all times.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7554, "q0": "It is unclear how this proposal addresses the B2B Challenge of removing a middle man or automating B2B processes. Rather it introduces an intermediate layer in the form of “Impact driven businesses” rhetoric that draws on a centralised corporate example “Nestle” for inspiration. This kind of impact requirement creates an unnecessary bureaucratic layer which would inhibit B2B so the proposal does not address the Challenge.", "q0r": 2, "q1": "Sufficient information is provided for the team to assure implementation of a bureaucratic impact layer. But the team’s capabilities are not correlated with the detailed plan or budget. So, it is difficult to see who will be implementing what part. A portion of the budget is given over to incentivise lead generation which is broken down into understandable parts. But the budget section on “Process lead “contains $500 for per meeting for collaboration discussion and $1000 per monthly meetup is excessive and lacks justification. It is unclear that the proposal will be implemented effectively.", "q1r": 3, "q2": "At the core of audit section is a monthly summary explaining the work done and deliverables and KPIs achieved during the month. But this is not expanded upon. Nor is the format of the detailed monthly report explained. There is however an external audit team that gives some assurance that the information will be sufficient to audit.", "q2r": 4, "assessor": "z_assessor_597", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7908, "q0": "This is an idea about promoting the business community to apply blockchain to real business through propaganda, image promotion as well as market education. I think it's a good idea, but now you need to come up with a specific strategy for this project. Business audience is very broad and how to system information and approach them is very important. In addition, in terms of expertise, you need diplomatic experts to convince businesses to act as a bridge, otherwise it will waste resources without achieving results.", "q0r": 4, "q1": "\"This project will be through both online and offline meetings and invite potential businesses to hear about cardano to apply to their businesses. This is an encouraging endeavour. However, I find the method not very reasonable. You can cooperate with government departments, business managers so you will have accurate information about local businesses, and coordinate with them to organize offline sessions with a larger number of listeners.\nYou can come up with models that can apply blockchain to businesses so that they can see the potential of blockchain applications, especially unlimited defi payments by country.\"", "q1r": 5, "q2": "\"In this project, they will report their work through a number of google sheet tools, websites and official communication pages of the group.\nIn addition, they are committed to making work progress documents publicly available, such as videos of business meetings that are recorded and made available to the public for inspection.\nIn addition, they cooperate with an independent audit unit for their working process. Basically I found the project to be serious and pretty easy to track progress.\"", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10655, "q0": "In my opinion, this proposal falls within the goal of challenging blockchain-related issues in general and opening up the development of the Cardano ecosystem in particular. According to the summary of the proposal, the solution was given very specifically. However, for the risky part of the proposal, it is necessary to come up with more specific options for the early success of the proposal team.", "q0r": 3, "q1": "The proposed team has given a roadmap for each stage to complete the work, the plan is described in detail and listed clearly, but for phase 2, the time needs to be tighter to shorten the time. . The budget part of the proposal needs specific details, as well as a plan to estimate additional funds to properly complete the proposal. the team of the proposal has a lot of experience in the blockchain field, I believe that the proposal will be successful soon in the future", "q1r": 3, "q2": "Although the proposal clearly and easily defines the measurement of work progress and is shared with the community, it is not possible to go to the mailbox to verify the index, so this issue should be kept in mind. The success of the project is based on the KPIs that I see are not clearly described the results achieved because this is a new proposal that has not been funded I appreciate the feasibility for the future good luck with the proposal", "q2r": 3, "assessor": "z_assessor_958", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Innovative ‘Cardano Impact Community’ model that generates business collaborations for those seeking to be blockchain for impact pioneers.", "experience": "200+ team of active Cardano community members. Globally diverse, decentralized, multidisciplinary and multisectoral team of professionals: marketing, partnerships, research, and event planning expertise. Fund 5,6,7 winners."}