{"id": 397359, "author": "rabbitholepools", "title": "Product Tracing on Cardano", "url": "https://cardano.ideascale.com/a/dtd/397359-48088", "category": 26445, "amount": 34620, "description": "Consumers are finding value in product tracing. However, this is gated behind brand or industry portals and comes at a large cost [1,2].", "f6_no_assessments": 5, "f6_rating": 4.133333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 3606, "q0": "The proposal suggested a solution incorporated with Cardano's blockchain to meet the demand of traceability and supply chain management for businesses. In fact, apart from satisfying that need,  this solution brings about more additional benefits for businesses in the production field industry.  So, this solution is totally appropriate to the challenge. It is also easy to understand how the proposer presents their idea. Starting from describing its products first, a browser UI, then providing a real study case, ANN - a firm producing an organic-certified wine, to highlight the impact of this solution to the users. It showed how impactful this solution is on businesses by listing all benefits that they will get when using this technology with the assistance of the Cardano blockchain. In each benefit provided, it thoroughly explained why businesses should switch from the traditional way to  this solution with the involvement of blockchain by pointing out some drawbacks of the old ways and emphasizing how Cardano's blockchain could do a better job in supporting them. Some other case studies about the impact of blockchain traceability were also provided with reference links contributing to once again prove the impact of this solution. Though there are some similar solutions executed in the past on blockchain, this time, this project will apply some recent advancements in Cardano, and will promise to create a bigger impact not only on businesses but also on the Cardano ecosystem as well. The proposal also did an excellent job in describing some challenges and suggesting probable ways to overcome them when delivering this project.", "q0r": 5, "q1": "The plan was given in several phases. However, it could be added more technical information on how to do it in each phase so that people could better visualize the proceeding process. The budget breakdown was listed in great detail. The unit of calculating the budget distribution was also presented. Unfortunately, the team needed for this project was not included with detailed information about them. The proposal stated that this project now is in need of just two people. Therefore, the background, skills, and experience of these two people should be outstanding enough to claim the feasibility of this project. However, no evidence or reference link was provided to prove that it is still feasible to operate this project with just two people.", "q1r": 3, "q2": "The proposal said that the progress would be announced on social media but it should mention more about how many times it will be posted and what content would be included to show that this is clear enough to track, trace and audit. However, it did a great job of describing the success of this project. It also sets various metrics to measure the success and the reason why these metrics are used to evaluate the success. There is one minor point: if some figures are added in some metric, it will be more transparent to see what the success looks like. The information related to whether this project was funded before or not was not given as well.", "q2r": 3, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4213, "q0": "The proposal team proposes to address the issue of difficulties in verifying the legitimacy of items by providing a QR Code that comprises a variety of product information such as time, location, lot number, and so on. The product data will be included as metadata in a transaction that will be registered on the Cardano Blockchain. Only users with the necessary NFT included in the transaction will be able to submit data relevant to their product. I must remark that the proposal is well written and organized, and that the objective is obvious. It is credibly easy for me to find a direct correlation between the goal of the proposal and the overall goal of this challenge. Another plus point is that the proposer delivers a simple story in which a detailed, well-described review of all the solution’s benefits is presented. The core idea and concept are fantastic; however, it would greatly benefit the proposal to add some information on how this would be directly related to the Cardano Ecosystem. I would have wanted to see more specific measures of the project's progress. However, in terms of impact, I agree that this idea effectively addresses the issue.", "q0r": 4, "q1": "The proposal feasibility would be beneficial with a presentation of the core team who will be working on the project. How many years experience does the team have, what skills do they pose to be exact? More importantly after answering that question, I would suggest providing a verifiable source that can further strengthen the competency and experience of the team members. Maybe through LinkedIn-profiles, partnered universities, etc. The only information presented is that the team will consist of 2 members. There is mention of phases of the project with timeline and milestones but no explanation on how to assist the aforementioned milestones yet. Fortunately, the budget is outlined clearly and broken down into identifiable opponents and seems suitable, answers to the question: How much money will be used for development, how many working hours are estimated from start to finish, etc. However, due to the lack of necessary information, I strongly disagree that it is likely that this proposal will be implemented successfully.", "q1r": 3, "q2": "The roadmap is presented, but the milestones and tasks included in each phase seem unrealistic to me (no mention of methods to prove to me those achievements could be achieved), as is any information about the team in the proposal itself. However, a \"success definition\" with an outline and paragraph below to explain it does improve the project's auditability. KPIs, and success measures are there, in detail and with specific numbers, which I find appropriate. On the bright side, I believe the community will be able to easily keep track of the process via Twitter and Telegram, via a dedicated profile or channel. This allows for effective communication between the team and the community. In terms of clarity, from my perspective, I'll give it 4 stars because I feel that there is still area for improvements for this proposal to be audited and tracked precisely.", "q2r": 4, "assessor": "z_assessor_1712", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 5306, "q0": "Product tracing is a critical solution for businesses. Its products will not be compared to similarly low-quality, untraceable products. When combined with Cardano's Dapps and smart contracts, the product tracing app will become significantly more effective at a lower cost. As a consumer, I like this approach a lot. The proposer also explains how to incentivize customers with the benefits of NFTs, ADA on Cardano, using a simple but convincing example. Concerning the solutions proposed by the proposer for the two risks, I believe they are sufficient to mitigate the risks. And I would like to propose another solution for the problem with people who are unfamiliar with blockchain or the currency market: the proposer could set up a hotline to receive client questions and answer them as soon as possible online. That is all I have to say about it; I think the concept is fantastic and hope it comes to fruition.", "q0r": 5, "q1": "Although the proposed project phases are very detailed, I am hoping that the timeline will be updated soon. Because the timeline is essential in determining whether or not the budget can cover the project. The budget breakdown is, in my opinion, reasonable. There is one thing I would add to the process: the proposal's solution for risk number two, which is to create a marketing toolkit for people who have no prior experience with blockchain and currency markets. It is also necessary to include this and estimate the budget. The information provided on the team member scale is a little ambiguous. The proposer can describe how the team is made up, such as how many people will work on defining a metadata format, how many will create web sites, and so on. This type of detailed plan will attract more funds and persuade funders. ", "q1r": 4, "q2": "The proposer offers many ways to keep track of the project, including social media and videos. The community would be able to keep track of the project if the proposer included the frequency of posts and videos. The proposer also ensures that the data is visible and easily accessible public. However, the proposer should state how long it will take to achieve success. Otherwise, I agree that the information provided is adequate for auditing the proposal's process and success.", "q2r": 4, "assessor": "z_assessor_1934", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7049, "q0": "The concept of visualizing the supply chain of a goods for the end consumer through block chain technology is not new. There are solutions on Ethereum, Stellar, and others. At least one proof of concept has been executed on Cardano too. So far though, no solution has really had sustained operations to my knowledge, and I have been looking. If this proposal can achieve the transparency and ease of use that is required, it would benefit Cardano immensely. Especially with upcoming EU legislation regarding sustainable value chains (and provable) the timing for this proposal is just right.", "q0r": 5, "q1": "The proposers have thought through the application thouroughly with the help of the Cardano community. They are not linking to any of their sites, LinkedIn, nor Github to prove their claims, however, through their stakepools I managed to find their Github repos and at least one of them seems to be an active developer on Github, contributing to various Cardano related projects.\nThey seem to have a realistic plan time-wise but there are many hurdles which they must surpass to achieve their goal. New legislation in EU might be a good thing for adoption, but an unknown when it comes to complexity. Designing a good UI for visualizing a supply chain of varying length will be challenging, as will the logistics of making sure there are QR-code printers and adhesive, durable paper/plastic with sufficient quality for the intended uses, etc..\nI really wish the proposers all the luck and that their project is funded and successful, but I think their chances of success would be greater with a bigger team, and supply chain experience. \nOn that note they have not included any risks regarding their implementation and the fact that they need to trace physical goods, people need to scan their codes correctly, etc. only adoption risks are mentioned.", "q1r": 3, "q2": "The proposers have given a detailed account of their planned timeline, activities and the use of their budget.\nThey have not included any unknown/risk/misc. budget post, which might prove to be a mistake as they need to interact with physical goods, people and vehicles in a supply chain, which is always complex, and errors occur. So I (having worked with the IT side of supply chains) would think their actual spending might be somewhat different, but the plan presented is fully auditable.", "q2r": 4, "assessor": "z_assessor_533", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7909, "q0": "This is a proposal to develop a product traceability tool for manufacturing enterprises. They create ready-made forms that can be customized to suit their business. The form information is then QR code and NFT encoded to save the information on the blockchain and easily retrieve it. This is a great idea, helping to promote product traceability and combat counterfeiting. Moreover, this idea creates a common platform for the community to use and apply to their own businesses. This is a necessity at this time, when there is no better technology than blockchain in terms of transparency and falsification of information.", "q0r": 5, "q1": "In addition to the practical idea, there are clear and reasonable working goals and budgets. However, the team is currently only 2 people and I think more experts need to be recruited if the project is funded. In addition, you need to have a more detailed communication plan and how to approach manufacturing businesses so that they use your products to trace the origin of goods. This is a huge need in the market that requires a combination of engineering and real-world business needs investigation to deploy.", "q1r": 5, "q2": "With a commitment to detailed project progress reports on the project's official communication channels; At the same time, they are willing to publicize the code and website to introduce to the community. Using a portion of the allocated cost to promote and engage the app community I think it is entirely possible to check the progress of this project.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}], "solution": "Build a Web3 interface to bring blockchain-based traceability to small producers needing it the most, abating costs and increasing adoption.", "experience": "Stef - Single Pool Operator, eResearch Analyst (computing solutions for research), Research Scientist accustomed to public delivery\n\nMichele - Single Pool Operator, Typescript developer, smart-contract (Plutus) developer"}