{"id": 397822, "author": "symonslab", "title": "Expands to 1000cities JP[PointSyst]", "url": "https://cardano.ideascale.com/a/dtd/397822-48088", "category": 26445, "amount": 100000, "description": "There is little social infrastructure, where communities take the lead & individuals act as agents of change to revitalize the local economy", "f6_no_assessments": 5, "f6_rating": 4.199999999999999, "videos": [], "media": [], "f6_assessments": [{"id": 1977, "q0": "This proposal is well aligned with the Challenge as it involves the B2C problem and its solution.\nThis proposal is regarding a point reward system which is already active under Symons Ltd in Japan. The proposer wish to bring this system onto the Cardano blockchain and grow it into becoming a self-governed protocol. In proposer words, ”The project will unlock the inherent potential of the Cardano blockchain technology to create a truly decentralized digital infrastructure”. I think this will help both the Cardano ecosystem & Izanami project (this proposal) but it depends on the successful execution of the proposal. \nIf successful this project will bring a lot of new users to the Cardano ecosystem. \nThe proposal’s targeted area is 1000 cities of Japan and based on the progress they will expand to include a larger area subsequently the proposer wish to go overseas with the same system. Hence this project can scale if the initial execution and subsequent onboarding of mentioned users are accomplished. ", "q0r": 4, "q1": "The proposer has provided the team details which Symons Labs, Yuta (Cardano Ambassador), SIPO stakepool etc., Thus team includes a few Cardano community members too. It seems the team is pretty capable to carry out the proposal, it would have been clear if they could have provided various team members who will carry out the particular tasks. \n The provided budget brake-up details are very brief without any specific details (the whole budget is divided into 3 tasks). Out of which, the proposal for 2 tasks with a total of $100,000, (i.e., a) Overall design b) Prototype of Izanami point issuance system) is submitted under the ‘Business Solutions’ challenge. \nThe proposal for the third task (prototype of client application) for $50,000 is submitted under the ‘Grow East Asia, Grow Cardano’ challenge.\nThe budget should have been broken into identifiable tasks with the amount beside each task along with the number of hours required by each task for clarity and auditing of the project progress.\nThe timeframe has been provided which is going until Q2 2023 (this is stretched a little far in contrast to other projects) for the final working product to be introduced.\nThe challenge mentioned by the proposer about the Cardano chain scalability & fees will not be a problem after the introduction of Pipelining and Hydra sidechain. \n Thus by taking into account all the above points this proposal is likely to be executed.", "q1r": 4, "q2": "The timeframes provided by the proposer with the tasks that are going to be finished within that time is the only metric available to track the progress of this proposal. \n As I mentioned above if the proposer can brake-up the budget into identifiable tasks and time duration, it will greatly help the tracking/audit team to keep in check the progress of the proposal. \nMoreover, the only milestones and delivery dates that can be seen are the timeframes provided which are divided into three phases.", "q2r": 3, "assessor": "z_assessor_1444", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3610, "q0": "The challenge is seeking solutions that can make businesses realize the power of blockchain technologies to satisfy their needs. The proposer stated we are at a historical turning royalty in the financial future and there is a need to revitalize the local economy. And that is how this solution was produced to satisfy that demand. Japan is a potential market to develop blockchain technologies aiming at businesses as there are few projects in the Cardano ecosystem there. And this solution with a new and unique business model would have a huge impact on the crypto economy in general and the Cardano ecosystem in particular.The target object of this solution is huge, 1000 out of 1718 local governments in Japan. So it seems to have a huge influence on Japan's local community. It did a good job in listing the details of the solution including its outline and its rationale. Besides, the plan for oversea expansion was also provided showing its potential and long-term vision. The KPIs were built based on the three key metrics of the challenge. It could be said that this proposal is closely following what the challenge mentioned. Also, some risks and how to mitigate them were given.", "q0r": 4, "q1": "It was stated that the scope of work for this proposal is Phase 1.0. However, it was given in great detail. This phase aims for the fourth quarter of 2022, but a step-by-step description was not listed to see how the project will be operated. There is something inappropriate about phase 1.0, then it will turn to phase 1.5, how about phase 1.1, 1.2,... The plan also mentioned too much information in the future to even 2024, while phase 1.0 in 2022 was not well-written. So it is better to focus on clarifying what is going to happen in the near future instead of future plans. It listed three types of costs to operate this project and the budget distributed for them. But it didn't mention they would be used for how long. Regarding the human resources of this project, it listed related achievements, the experience of the leader of the company in the royalty system industry in Japan, which is a great point to show that he would be able to lead the project in the right way.\nIn this section, it also provided the features of the company's royalty business, the vision of the firm operating this project, which is good to support for the point that this project would be handled by an experienced leader and a company that aims at bringing a lot of values for the general community and the Cardano ecosystem as well. Besides, this project has the participation of experienced members of the SIPO Pool and other Cardano Blockchain-related organizations. These are good signals to ensure the smooth and efficient implementation of the Cardano blockchain. It is also hiring some more staff, so it could be improved by mentioning the number it needs to employ.", "q1r": 3, "q2": "It is mentioned that the progress of this project would be measured by the roadmap described in the plan. However, because the plan itself is not detailed and clear enough, including no KPIs or numbers, it is difficult to track, trace and audit it. The KIPs mentioned at first include the goal of building one dApp supporting business solution, 10 partnerships, and two additional funding. But the description of the success of this project didn't mention them. It should also include the information related to whether it was funded before or not.", "q2r": 2, "assessor": "z_assessor_1665", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5312, "q0": "The challenge and the problem presented in this proposal are very close. Although Cardano is not widely used in Japan, the success of this project will undoubtedly have a significant impact on the rapidly increasing Cardano ecosystem. Any public blockchain must include decentralization as a core and critical feature. I can tell the team put a lot of effort into this project and considered every possible possibility. The expected numbers are used to introduce the KPIs. There will be various processes to attract and link many large businesses, but I believe that every situation has a solution. With the right attitude, bringing Cardano to Asia will be considerably easier. To strengthen Japan's economy, the plan clearly and objectively specifies an integrated system based on the mutual exchange of royalties and Cardano crypto-assets to develop Japan's first microfinance business. However, because my perspective and expertise are limited, I am curious as to how the transfer of royalties to Cardano crypto is legitimate and outside of the Japanese government's supervision.", "q0r": 5, "q1": "The team already has a twitter page up and operating, which provides proof of previous work and greatly increases the feasibility of this project. The goal of this proposal is phase 1.0, but the plan provided has drawn a broad picture, emphasizing the need of calculating for the entire project. Phase 1.0 has a decent budget. I think that focusing the proposal solely on phase 1.0 and including a detailed plan for phase 1.0 would be fantastic. As a result, it will be evident how much money was spent on phase 1.0 and on what method. Another plus is that the team has an experienced leader who has implemented a cross-industry network system, as well as the company's business and passion, which I believe are sufficient to ensure the project's success.", "q1r": 5, "q2": "My congratulations to the team for successfully executing the plan. Because this is a large project with many processes, auditability is difficult. The roadmap and budget breakdown are both excellent. The team did not go into detail about the project's risks, which include not having enough blockchain engineers on hand to complete the project on time. It is also a developing project that focuses on royalties at the moment; the team should provide a lot more information on how it wants to include and distinguish royalties from crypto currencies.", "q2r": 5, "assessor": "z_assessor_1934", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 7915, "q0": "This proposal has the goal of revitalizing the local economy by encouraging leading communities and individuals to take action to stimulate the local economy. Through connecting more than 1700 economic communities in Japan, and at the same time awarding incentives to individual subjects who contribute to the community through royalties and blockchain applications in life and business. This is a good ambition but needs more detail on the implementation plan and long-term direction for it.", "q0r": 5, "q1": "The working group has a clear step-by-step plan to revive the local economy through \"royalties\" in Japan. The team has enough expertise and local authority, which is also the reason for the feasibility of this reform project compared to other proposals. In addition, the issuance of private tokens on the cardano platform related to royalties will allow the economy to be promoted, the financial to be circulated. From there, the target economic organizations are connected and benefit from the organization, and deserved rewards for active and pioneering individuals.", "q1r": 5, "q2": "I think your group should have an official page to communicate for the organization, and the project you are working on. On this page you need to transparently disclose all costs, the number of community members involved, the jobs processed, the local royalty holders and even allow the community to Your own information is contributed. All of this ensures the viability and credibility of the project.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 8830, "q0": "It appears this concept will expand a point-card system on the blockchain through a large portion of Japan. With the amount of users it could reach, this could indeed positively affect the adoption of Cardano as infrastructure in Japan across a wide area.", "q0r": 5, "q1": "It appears there is sufficient knowledge between the company represented by the proposer and the stake pool operators to implement this project. It looks like the Symons company is already operating a distributed point system that they wish to modify to run on Cardano.", "q1r": 5, "q2": "Although the roadmap is clear and the proposer invites questions be sent to the company Twitter account, auditing this proposal as written looks to lack some transparency in the funds department.  Specifically, the cost breakdown does not go very far into detail at all, leaving costs in large chunks ($20K, $50K, $80K).  This is concerning as it does not provide auditable expenditures or explanations as to WHY such large amounts are needed and how they will be spent.  Strongly suggest the developer try to break these funds down into smaller amounts and explain how they will be spent as it is a considerable sum of money (in fact it is the entire F8 allocation for this section when including both proposals placed by this same developer.)", "q2r": 3, "assessor": "z_assessor_708", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "We offer a sustainable social infrastructure based on a circulation- based community revitalization that uses points and cryptocurrencies.", "experience": "SYMONS is developing and operating a sustainable, circulation- based community revitalization system nationwide. This system has been adopted as a platform for one of the tourism promotion activities of the Japan Tourism Agency."}