{"id": 397919, "author": "michiel", "title": "Profila launches DeMar (Part 1)", "url": "https://cardano.ideascale.com/a/dtd/397919-48088", "category": 26445, "amount": 95000, "description": "Today, companies serve Ads based on third party profiling data/cookies which are becoming illegal and sacrifices the users privacy.", "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 625, "q0": "So, there is a lot going on in this proposal, but I am just going to cover the core thing that it is concerned with, namely the tooling and buildout that will allow Profila to go to business clients and offer them a LEGALLY COMPLIANT advertising ecosystem to replace the third-party cookies protocol that is quickly becoming unwieldy and obsolete as consumer rights are becoming enshrined in jurisdictions around the world.  In addition to the eminently desirable legal incentives, this platform also promises direct targeting and offers as proof of its effectiveness not clicks and views (long the province of ad-tech, where bots and click and review farms are rampant) but actual sustained engagement with the brand (via gameification and incentivized self-selection).  Are you a business owner and ever had a large ad-buy with a typical digital provider like Google or Facebook?  Have you ever had to listen to their stat touts?  You know that pi$$-on-me-and-tell-me-its-raining feeling?  Say goodbye to all that, and lose the headache over whether your website is up to date with the latest privacy laws, and whether your annoying pop-ups (that you have clear metrics showing that they are driving away traffic) are legally robust enough.  There is a whole consumer side to the equation, too, that I'm not covering, with data controls, legal education and DSR tools, incentivized gaming and deep SSI based privacy protection and security.  All in all when Profila says they are ready to disrupt ad-tech, all I can say is I hope Cardano is ready for Profila.\n", "q0r": 5, "q1": "It is always worth checking out the Profila website and looking at their high level road map, just to orient yourself in their growing platform architecture.  This proposal, focused on a huge design, development and integration of a 3rd-party-cookie-busting protocol for B2B clients has a 5-month workflow, and like some of this team's other proposals the early work is quite granular through the product design phase, before becoming heavily generalized going into the development sprints.  However, they include the architecture they are integrating to, and later discuss the milestones of each integration, so the emergent property seems to be just the integration itself, and since we aren't talking about Plutus or SSI or anything, but rather the UI/UX dashboard for businesses and other \"standard\" tech, I have high confidence that most of the missing details are standard agility areas in software development, rather than gaps in architecture knowledge.  Not much can be done about the risks for this project, namely what kind of performance the platform will experience on blockcahin, which is why I am glad to see that they are planning for lengthy testing and beta phases with already onboarded SMEs.  On this timeline we could see Hydra in play, ZKsnark rollups and a few other scaling solutions that could be gamechangers for these kinds of worries.", "q1r": 5, "q2": "They include here their typical thoroughness in listing out both all the ways that the community can follow along as well as the milestones leading to delivery.  Communication includes the standard progress reporting and coordinator calls, as well as their newsletter, Git and swarm sessions, which are the best ways to get in touch and get questions answered with their AMA format. The success milestone is pretty specific here, and worth reading in full, as it is a causal chain initiated by a targeted ad from the ad-server that ends up in a blockchain Tx for auditing purposes, but the interesting stuff is what happens in between.  Each of the steps in that chain could be considered a deliverable though none of them are separate modules, so the actual measuring of these KPIs will be a factor of code commits and sprint burndowns.  This is the kind of project that will report as %complete.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 14, "ne": 6, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2396, "q0": "with today's growing social trend. Therefore, marketing is also increasingly in need of attention. With the idea of ​​​​bringing Profila technology to the forefront in the field of 'Decentralized Marketing. is very reasonable, it is very suitable to replace the old ways of marketing in the market. here, the proposed group has raised the issues to be solved very clearly and very appropriately. With estimated statistics, I think this project will be very successful if applied in practice. I feel this project should be scaled up to address future challenges. The solutions are also very reasonable given by the group. Profile's DeMar platform will provide businesses worldwide with a new privacy-preserving alternative, This Proposal addresses the current B2B and B2C challenges. However, the group's solutions do not have specific evidence or research. Even if the project is good, it cannot be without risks. The group has also given the risks that the project may face in quite detail as stated in the project. however, I would like to add more. most of the community is still following the old technologies. but the old technologies today also do quite well their role. To replace the old technology, I think the team should consider making it easy for users to use at a low cost.", "q0r": 4, "q1": "in the section providing detailed plans and timelines. I see that the project has started a specific timeline. will complete the work within a period of 20 months. and has been subdivided into different sub-categories. I think with the timeline divided as above, it is reasonable to complete the set tasks. The group also has quite specific goals as mentioned above. The progress of the project is also quite easy to check and track by the community. with a budget of less than 10% of the full challenge budget and has been broken down into the amounts mentioned above. I find the splits to be very reasonable. however, the team should leave a backup budget in case additional budget is needed or should have a contingency plan in case of need. Regarding the provision of team members, I see the group has listed more than 5 members. with a team of members who are experts. Famous designers and engineers, they have a lot of experience. With a good degree and seniority, I believe this project will be successful. However, the members' identities have not been verified, and it is not easy for the community to track.", "q1r": 4, "q2": "in the description of measuring the progress and development of the project. I see that the proposal has stated very specific indicators with 6 indicators listed as in the scheme. I find the metrics to be very easy to track by the community. The success of the project is also stated that is. Interactions with ads are logged into the blockchain for Ads audits. is targeted to serve from the Server... I see the success of the project as closely related to the challenge of the campaign. it brings people into a new era. However, the new project is stopping at the idea section. Haven't run the actual test yet. Since this is a new project, it has not been funded yet. but I believe this project will get a high vote rate. I fully believe and believe in the group's future project.", "q2r": 3, "assessor": "z_assessor_1486", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 5491, "q0": "Profila is a marketing platform built on Cardano, where consumers can decide whether they want to share their private information or not, and if so, they can tweak the exact details they are willing to share and receive 50% of the ad revenue. The platform/app delivers anonymity & control, both from the ZKA servers, through encrypted messages and creation of public keys associated to the consumer’s profile, as well as from the Advertiser’s Ad Server.\nThis project has to potential to attract many newcomers to the Cardano ecosystem, both as individuals who want to register and have their privacy respected and as companies, who will be compelled to adapt to the new advertising solutions. If successful, the platform has the potential to positively impact not just the whole advertising industry, but the privacy of all users around the world.", "q0r": 5, "q1": "The detailed plan and timeline are succinct, on a weekly basis, but offer enough information to provide a complete image of the project steps. The budget, however, is not very detailed. It is divided into the 3 main categories, “Research and PRD development”, “Business analysis and UX/UI design work” and “Development and testing to delivery” with the corresponding amounts, but no hourly rate is given, no number of hours necessary are provided, as such I am unable to assess whether it is realistic and feasible.\nIn the proposal text, the team members do not have any names attached to the job position, and only have a short title of their skills described, no other information regarding their previous work and no social profiles or 3rd party links for verification are provided. The extended information is provided via an attachment, but it has no working links and as such, searching for the team members on social profile platforms becomes a bit of a hassle.", "q1r": 4, "q2": "The progress measurement is detailed and can easily be followed up by the community. Regarding the project’s success, while the final goal is to have a “viable prototyped replacement of third party cookies”, some identifiable measures of success are important in providing the community with sufficient information to self-assess if the project is done - for example: how many users and/or companies employing the platform are needed to consider the project a success.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 8092, "q0": "The proposal \"Profile launches DeMar\" addresses the Business Solutions (B2B &B2C) challenges well by offering a business marketing tool to companies ( B2B ) and business can use their marketing tool to communicate and advertise to their customers in a meaningful way. (B2C). Its new featured \"DeMar\" (Decentralized marketing platform) would let consumers connect directly with the brands (control who can see your data and get paid when viewing ads). The DeMar feature has a good potential to disrupt the AdTech Industry although they would have to ensure that they get privacy/security concern sorted for the peer to peer ad. The solution is impactful towards Cardano adoption.", "q0r": 5, "q1": "The detailed plan along with budget breakdown are provided for this proposal. The timespan of 20 weeks are reasonable from documentation to testing. Please provide LinkedIn link for each role. Despite being the previously funded proposal, it would be better to be on the transparent side. The project plan and timeline (5 months) are not too unrealistic. If they integrate this feature, it would enhance Cardano position in AdTech area.", "q1r": 5, "q2": "They provide various channels to update the community (GitHub, bi-weekly meeting, Swarm session and Periodical Profila founder AMA. It should be sufficient for the community to keep informed on new developments. The profila launches DeMar solution is well defined and is considered impactful provided with their detailed project information. Their Proof of concept (POC) Profila has a very high potential to replace the third party cookies which are major issues in advertisement. The consumer privacy is respected by Profila unlike the web2 solutions that the leaker of consumer information is more common.", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9974, "q0": "This is a very innovative proposal in the challenge of F8: Business Solutions (B2B & B2C). The brand new field of Decentralized Marketing is extremely welcomed in the B2B Ads industry. The team also put a balance between the consumers and brands via Profila's DeMar platform (which is planned to be built on Cardano) The new concept called \"Zero Knowledge Advertising\" is a total breakthrough with the Ads industry. And the team repeatedly mentioned the hug nearly 1000 billion Ad Revenue. The team also has clear segments of clients (small to large) SMEs all over the world. The team also well explained why this proposal addresses both the B2B and B2C challenges.\nRisks are also highlighted as per scalability and speed of Cardano blockchain is still on the verge of the next Vasil hardfork\n", "q0r": 5, "q1": "Good thing first, the team has defined week by week timeline in the next 20 weeks, with each detailed update. The team is proposal the breakdown cost is still very high level with the total fund request is 9.5% of the total fund setting, It should be more transparent if the fund allocation is explained more in-depth so that the community can keep track. The team members are also anonymous which makes the feasibility and high-level funds are harder to be tracked. The team members are not published yet with only mentioning the title of  CTO and COO and Ad-tech advisor in the black. ", "q1r": 4, "q2": "The measurement is a bit ambiguous with unclear success looks like in the measurable KPIs. There should be a pilot phase or at least 1 B2B 1 B2C client to use the service of Profila so that the team can also learn from both brands and the customers. The project has a huge ambition thus needs to break down the cuss and the progress into specific milestones. The proposal is also brand new from the previous Catalyst funds, therefore there is a fair request to see the team more frequent project updates than the monthly or bi-weekly updates in the call with coordinators.", "q2r": 4, "assessor": "z_assessor_782", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Profila pioneers 'Decentralized Marketing' (DeMar - part 1), via a 3rd party cookie replacement that delivers anonymity & control to people.", "experience": "Privacy/Tech lawyer + Profila team of (20+) industry experts with marketing & privacy expertise from multinationals. AdTech research partnership with Uni. of Madrid (big data institute) w. first publication on new DeMar model (see attachment). Product bèta-ready, pilot ongoing."}