{"id": 398567, "author": "stakepool247", "title": "SPO Dashboard for Delegators", "url": "https://cardano.ideascale.com/a/dtd/398567-48088", "category": 26445, "amount": 27900, "description": "Missing real Stake Pool performance Dashboard where SPO's can show live data.", "f6_no_assessments": 8, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is a very helpfull implementation that help Cardano users to identify Cardano Stake Pool when they choose to delegate and at the same time I think this implementation will be important for the Cardano community SPOs and stakeholders to grow their visibility and audience.\nThe proposal clearly articulates the contest, the problem (actual difficulty in view Cardano Stake Pool performance) and how it will add value to the Cardano ecosystem and for all of the stakeholders.\nI think there are competition in the market for this kind of implementation, so I suggest to the proposers to identify some distinctive proposition and to dedicate important time to marketing activities and social network actions (eg. on Discord).", "q0r": 5, "q1": "This proposal is well written and clearly demonstrate the experience and the team's commitment, guarantees solidity in deliverables, support transparency and accountability for all Cardano community: they work in SPOCRA communities and developed some helpful tools for the community.\nThe proposer team is well skilled about the whole context of the proposal  (SPOCRA board member, Funded proposer, Stake Pool Operator, Stakepool as a Service Provider, SPOs mentor, elected Catalyst Circle member. Fund7 funded proposer)\nThe scope of the solution is very well explained (e.g. how the funds will be spent, what features will be implemented, and so on…) and it’s convincing. There is a simple and complete cost worksheet with infrastructure and developer fees.\nThe proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon.", "q1r": 5, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, but no simple KPI metrics are shown. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…) Also the proposer has not mentioned possible difficulties, but no informations about market competitors\nThis Proposal is a direct continuation of the funded F7: SPO Performance Monitoring .", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "I have found this to be a challenge in the Cardano ecosystem too. It can be difficult for the SPO's to relay the information to the members of their stakepool. It would be important for the users to look at the details of the stakepools where their funds are. Lots of people like to know exactly what is happening with their funds, and the UI and UX could help them to visually see what is happening to their funds and what is happening in that select stake pool. I agree with the team that this is important, and I think they addressed the challenge very well in their proposal. For this reason, I give this proposal a 4 out of 5. ", "q0r": 4, "q1": "There is still enough information on the team members that it would be able to pass in the funding system, However, I would still include more information on the team members and the experience that they have. This would be including the names of some of the team members and the experience they have. This will allow the CA's to know who they are working with and will give you a more likely chance to be funded in the official voting phase. For that reason, I give this proposal a 3 out of 5 stars. ", "q1r": 3, "q2": "I like that the team was able to give details on the roadmap and to map out specifics on what will be happening in the months May through July. This is important because it allows the community to follow-up with this proposal and to hold each other accountable. The other thing that I noticed to be extremely important in measuring the progress of this proposal is the fund breakdown. I was able to identify all of the use-cases of the potential funds that would be received. I find them all to be in correlation with what this proposal strives to accomplish. This will help the proposal to start off with a higher chance of being funded in this process. For this reason, I give this section of the proposal a 4 out of 5 stars. ", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the issue with missing real SPO performance data and proposes a solution with the monitoring tools.\nValue for the Cardano ecosystem will be through enabling insight into the pool performance leading to better decision making while delegating.\nKey metrics, or estimation of it is not given. It would be beneficial to see what usage/impact is anticipated and would that justify the investment in this proposal.\nScaling is not mentioned, and given the rapid growth of the ecosystem a few lines about it would be desirable.\n\n\n", "q0r": 4, "q1": "The proposer is established community member, runs SPO from ITN. This deems sufficient to prove engagement and experience in the Cardano ecosystem.\nThe budget is clear, reasonable as well as mentioned timeframe.\nThe risk of running out of funding is not adressed.\nThe technical aspects are mentioned but lacks in-depth explanation or depository for checking this and previous work (Fund7 proposal).\nBased on the previous work and experience there is a high chance that the project will be delivered, but this proposal would benefit with more details.", "q1r": 4, "q2": "Roadmap with milestones is present and work can be monitored.\nGeneral success criteria are mentioned, but detailed metrics or KPIs are missing, and I would really like to see the estimates of number of users actively using the dashboard, and potential growth over time. For example, we estimate 10000 users in the first month with estimated growth etc. If the tool is to be used by a small number of users it might not be worth the investment.\nThe problem and the solution are clear, although there is no evaluation how many delegators actually need such dashboard.\nOverall a quality proposal, likely to be delivered but lacks a bit more details.", "q2r": 4, "assessor": "z_assessor_160", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposers have described the current problems faced by stake pool delegators (target audience) and then offer their project as a solution. By doing this, they allow the community to see why there is a need to operate this project and assess its expected impacts. This is a continuation of the previously funded proposal, so they will focus their efforts on helping delegators evaluate the stake pool on real-time data. The positive influences they exert on the delegators are expected to increase the number of delegators, eventually expand the Cardano network in general. They provide direct services to Stake Pool Operators through specific b2b use cases within the Cardano Ecosystem. Their project’s website is included in the proposal for further information. Apart from the necessary information related to their project, the community can view the degree of completion for work in progress. \nThe main challenges in the execution process are covered in the proposal. They also offer some addressing orientation to mitigate the risk of delay or failure. The community can see that they are quite positive about the project’s development so these issues will be nicely resolved.", "q0r": 5, "q1": "A detailed roadmap for the operation has been provided. The roadmap has been divided into 3 phases with specific durations. They are very clear about the main tasks and subtasks in each period, which helps the community easily track and assess the accomplishments of the team. This action plan can also act as a frame for the community to detect any possible delay, thus initiating some necessary adjustments.\nThey also offer a budget breakdown, which is in compliance with their delivery plan. The numbers are very specific and clear, allowing the community to follow and make a double-check later. The community can base on this spending to assess the effectiveness of their financial strategy and estimate the total operational costs. \nAs they mentioned, on the attached website address there would be information about the team members. The community can access the website to see the working experiences and abilities of the team, therefore have a better assessment.", "q1r": 5, "q2": "The tracking process for the progress and development of the project can be done through JIRA as stated. By using this software, the team has provided a professional method to ensure progress. However, to help the community better understand this tracking tool, the team should give a brief description including the key metrics for this project.\nThe key goals for success have been identified. These expected outcomes will help the team keep the project on track and focus efforts to effectively work towards them. The community can see these goals as a milestone to evaluate the performance of the project as well as its impacts.", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The features of the proposal on supporting delegators to make an assessment of the stake pool on real performance data are described in detail and are easy to understand. However, the analysis of the results of the project is still quite general to comment on the impact of the project. I think the author should add clear indicators and KPIs to the description of the results so that readers can assess the level of alignment with the challenge more clearly. \nBesides, the risks are mentioned but the measures are not really clear, the author can add details on how to build connections and relations or have direct access to skilled and committed community members to increase the credibility of the project.", "q0r": 3, "q1": "The budget of the proposal is quite reasonable and adequate when divided into 4 subsections (UI/UX Designer, React/WEB Development, Backend/API Development, Project Management/consultants) with detailed information on the number of hours completed and unit price per hour.\nThe roadmap of the project also is described quite briefly, easy to understand and is divided into 3 phases, each phase lasts 1 month, a total of 3 months. The work items of each stage are described in pretty detail.\nHowever, the member description is still quite short and there is not much descriptive information about the members and necessary positions in the team.\nThe author should introduce more details about the team members so that readers can easily assess the feasibility of the project. Additional information can be the names of individuals, partners, work experience, outstanding achievements and attached profiles on social networking sites as LinkedIn, twitter,...", "q1r": 4, "q2": "Overall, I found the audit information section to be quite good. However I give 3 points for the following reasons:\nThe community can track the progress of the project through the Jira tool. However, I have not seen any mention of clear KPIs so that the community can compare whether the project has done as planned or not. It'd be better if the author can add quantitative indicators describing the amount of work completed by each timeline.\nIn addition, the success of the project is described by indicators such as the number of users using the provided service, a ready-to-use dashboard for Stake Pool Operators and Delegators, ... However, a few indicators as \"the successful proposal implementation\" is still quite general, I think the author should describe these indicators more quantitatively (specific number) with a specific timeline. With that, It will be easier  for community to determine if a project has achieved its goal after the project is funded.", "q2r": 3, "assessor": "z_assessor_1674", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "I have lots of thoughts on both sides of this proposal but the most important one is that this problem is absolutely true in the recognition that this tool does not exist. I think this proposal is missing an articulation of what the post-product world looks like. They do say that it's meant to expand the functionality for delegators to see live data but I want to know why that matters. I assume this is a tool that is meant to increase Cardano user experience but there could be arguments for adoption or other ecosystem impacts that I'm not able to come up with. Is there an economic impact that leads people to make decisions that they otherwise would not have? Maybe this could help to keep delegators away from SPOs with poor performance so that those delegators could move to better performing SPOs? I love this idea for myself but I feel like I need to be convinced of the greater impact that will result. Especially because this proposal does turn a $36k proposal (first funded) into a $64k proposal (with new funding). I vote favorably because it is an improvement on the information that is currently openly available but I have doubts on what the impact would be.", "q0r": 4, "q1": "The roadmap is very efficient on time and there's no concern about the developer's capability to accomplish the proposal goals, given that it's something that is already in progress. There does appear to be action/budgeting missing from the marketing side of the project (both from this proposal and last proposal), which may be a logistical misstep that could mitigate the potential impact that this project could have. What's the point of developing the project if hardly anyone knows about it? I also have some criticisms on the budget. The labor cost is expensive. The going rate competes with the higher end of salaries from high-end tech companies, which seems rather inappropriate for Catalyst funding. This proposal gives a rate that is equivalent to $135k/year when the highest paying average in California is $137k (the national US average is $115k). A similar overvaluation is made for the REACT/WEB dev salary at a $135k evaluation for a $117k national average. The UI/UX designer rate is not as bad but still competitive at an equivalent rate of $93k/yr (the national average is $93-$97k). I'm sure there may be split opinions on how Catalyst funded developers ought to be paid but it's certainly not disagreeable that it has a different economic model than the corporate world. The corporate world pays an amount that is evaluated based on how much the company can make from their work, while Catalyst funding is much more like a grant (in which spending efficiency should be taken into account). ", "q1r": 4, "q2": "This proposal's auditibility section makes a common mistake by letting themselves off rather easy on this section. The section inappropriately assumes the successful completion of the product is a measure of success. However, a completed product alone does not harbor any impact on the greater Cardano ecosystem. Usage is a much more appropriate measure of success because it is what actually translates to impact. In that, I find it important to provide quantifiable KPIs to produce a more objective measure of what degree of impact is being aimed for (bonus points for different metrics at different milestones). I do not feel that there is nearly enough information here about the measure of success to enable me to see exactly what this project is aiming at. ", "q2r": 2, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is a continuation of a funded Fund 7 project, that aims at providing a Performance Monitoring solution for SPOs addressed to delegators, enabling them to have a live, clear understanding of the performance of each pool. As it is, at the moment, delegators do no have a clear way to assess the performance of the stake pool, but they can only guess based on the “Estimated Blocks in Whole Epoch” which is also based on a mathematical probability. \nNot only will the delegators be able to see how many blocks the pool has minted, but they will also be able to view the factors that caused the pool to fail in a mint (slot battle, server failure etc.).\nAfter reviewing all the information provided in the proposal text, I can assess that the need for such a tool is highly needed in the Cardano community, would be helpful for SPOs as well and would create more transparency to the entire ecosystem.", "q0r": 5, "q1": "The timeline, plan and budget are succinct, but cover all needed aspects to provide a clear implementation plan and needs. The timeframe for the successful launch of the project is set for July 2022, after several development and testing phases. The budget provides details on the number of hours and price per hour needed for the development and consultations, while the proposer has also offered sufficient data about himself and also provided the link to the website where the tool will be available, where one can also see more info about him as well.\nAs such, I do not see any impediments in the successful implementation of the proposal and will rate it accordingly.", "q1r": 5, "q2": "The project’s progress will be tracked using Jira and as such, it can be easily assessed by the community. However, it should have been important to add a short description on what steps will be measured, to be able to have a better picture about the advancement beforehand.\nThe success description is appropriate, yet the lack of clear milestones, that can be easily identified and later assessed by the community would have provided a better evaluation of the project’s positive outcome.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This review is focused specifically on the proposal as it is, and not the idea/concept which I believe is potentially a 5/5 and very valuable to the community. The proposal however lacks a few important details, which are discussed below: \nThis matches well with the B2B &B2C challenge as it appears to be a B2B service. (My understanding from the proposal is that the proposer will sell the dashboard solution to stake pool operators, as there is no mention of this being an open source dashboard) For this reason, I believe an open source tool/dashboard available to anyone would have a much greater impact on the overall ecosystem then a closed solution. Additionally I am concerned any paid/for profit services may provide greater benefit for the already successful pool operators who can afford them, and contribute to centralizing/concentration of wealth and stake among a smaller number of successful pool operators. ", "q0r": 4, "q1": "The proposer has the technical skills required to deliver on this proposal, and has provided their relevant background information and qualifications. However, their previously funded proposal included a March 22 deliverable of \"First MVP and beta - onboarding user to establish feedback loop for needed performance and interface improvements\" I have briefly looked for this MVP but have not been able to find this MVP product for review/auditing, but I have also not been in contact with the proposer at the time of writing this review. For this reason, I am not sure if the proposer has delivered on the previous $36,500 provided by Catalyst in fund 7. (as of March 24th) ", "q1r": 4, "q2": "The proposal states: \"The Projects evolution will be tracked via Jira, which we are using to track changes and issues (bugs). \" and this indicates all auditing will be done by the proposer, in a closed environment, and it is not clear how the wider Cardano community will be able to Audit and track the development of this proposal. Considering funding has already been provided and there is no MVP yet delivered, and their previous F7 proposal includes; \"This proposal aims to build the first infrastructure and required tools to evolve the project and it is the first proposal of a series that will continue over the next funding rounds.\" it is not clear to me if this will be the final funds requested, or if more $ will be required to deliver on this proposal. I would like to see more clarity around the entire project plan and budget, how the money will be used, and who will benefit from the end products and services. I believe the proposer is building valuable tools that will be a benefit to the community, however I would like to see more transparency and details about the costs to the users of the finished product, and/or if any of this will be open sourced.  ", "q2r": 3, "assessor": "z_assessor_215", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "There's a lack of accessible and trusted tools, resources, and data to provide insights on live SP performance for stake pool delegators", "experience": "SPOCRA board member, Funded proposer, Stake Pool Operator, Stakepool as a Service Provider, SPOs mentor, elected Catalyst Circle member. Fund7 funded proposer. "}