{"id": 398920, "author": "konmaorg", "title": "Invoice Finance DeFi Platform - CR2", "url": "https://cardano.ideascale.com/a/dtd/398920-48088", "category": 26445, "amount": 100000, "description": "Trade finance depends on real estate collateral which is highly illiquid, making it difficult for lenders to liquidate on defaulting loans.", "f6_no_assessments": 3, "f6_rating": 3.888888888888889, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=12774", "https://www.youtube.com/watch?v=1n9ftsoCLas&start=12774"], "media": [], "f6_assessments": [{"id": 3368, "q0": "The proposers clearly identify their target audience (globally small and medium business users) and the main features of their platform. The team well present how their solution will work through the legacy banking system using decentralization and blockchain. Those who finance their platform will receive favorable benefits as well discussed in their proposal. These results are expected to have a positive impact on the objectives of the raised challenge \nThe main challenges and risks the team may encounter are well predicted with the root cause, allowing them to offer a reasonable addressing plan. All information in this part is listed very clearly and adequately, helping the community to easily follow and examine the effectiveness of their strategies. The risk management proposed is believed to eliminate the potential failure of the project.", "q0r": 5, "q1": "A very detailed timeline including multiple tasks and the duration of the tasks is provided, empowering the community to assess the realisticity of the project. The proposers clearly set what the project will accomplish and therefore offer a clear direction to run the project. \nThey clearly describe which part of the project they have already done and which part they request for the fund. The main costs are listed, however, my small recommendation is that they break down a bit more the fixed costs. For example, when it comes to the Cardano Network Integration, based on the subtasks presented in the timeline, they can add the estimated expense for each subtask. By doing this, they can ensure the feasibility of the project and manage their financial position more effectively\nThe working team is adequately mentioned including the number of members and their position in the project. An external link is also provided for further consideration", "q1r": 5, "q2": "They offer specific and relevant KPIs to measure the performance of the project and these indicators are synchronized with their key objectives. For some of the KPIs, it would be better if they add specifically required numbers to evaluate the success of the project. They have a clear definition and vision of their success, helping them to stay focused on their development path. The community also finds it easy to study the progression and evaluate whether the project is on track or not", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3618, "q0": "The object of the proposed project is small to medium-sized business users, which is aligned with the challenge's requirement. The proposal did illustrate features of the product, how helpful it is for businesses in giving diverse currencies to make transactions. And by giving all benefits that users will receive when incorporating blockchain into the invoice financing process, the proposal indicated why businesses need this solution, but did not mention whether this is something that businesses are now in need of or not. Despite the fact that it showcased the impact and the benefit of blockchain in general and Cardano in particular in assisting business activities to proceed more efficiently.However, there is a good point that the proposal listed some challenges and risks and proposed a plan to manage some of them", "q0r": 3, "q1": "The proposer set up a detailed plan of what to do each two weeks and each week.A budget breakdown was mentioned with the explanation that the capital is not used for building up everything for the project as a part of it was completed.It is highly evaluated how the proposer described their team to run this project. The core team includes ̀CA, SAP Consultant and Blockchain Strategist, members with experience in International Transaction Advisory. Besides, the advisors also consist of talented members who used to work on several blockchain projects. ALL these people will play an important role in leading the project successfully", "q1r": 3, "q2": "The proposal just describes the expected result in some contexts without giving figures to help visualize the outcome clearly. KPIS also lacked specific numbers. Therefore, it is likely impossible to audit this project as everything is a bit vague", "q2r": 2, "assessor": "z_assessor_1665", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4804, "q0": "Features of the platform were described very carefully and comprehensively. Plus, the benefits of users are also listed as reasons they would shift to this new platform instead of the traditional method (web2 applications). This project is impactful in terms of its value created to users (lenders) and its applications (especially cross-border payments)\nThe challenges of developing this new platform were stated thoroughly including problems they can solve and problems they haven't found the solution to yet. In the risks section, the proposal mentions all the potential risks that could appear with this platform including security threats in the DeFi space. There is this risk of flash loans attacks and the team's direction to manage is to provide no opportunity for flash loans. This solution can be clearer as to how the business model is built to not allow these kinds of loans.\n", "q0r": 5, "q1": "The timeline provided is detailed which makes it clear for the community to follow the project's processes.\nThe budget breakdown however is not as detailed as the timeline. The additional infrastructure and the marketing budget could be broken down into smaller expenses to be more specific.\nAll information about the team members can be found on the whitepaper link with their professional LinkedIn profiles. The team is filled with capable developers, engineers, marketers, business specialists, etc which makes me believe they can handle the project well. There is a link to all of the project's social media accounts which makes information about the project transparent and easier to find.", "q1r": 4, "q2": "The vision the team has for this project after it is conducted is promising. However, the success of this project could be more measurable through numbers The team only provided key performance indicators but none of them has an estimated number. For example, how much total value locked in the liquidity pools is enough for the project to be considered successful, etc", "q2r": 3, "assessor": "z_assessor_1775", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Every business owner can get quick access to cheaper working capital, without any bias or geographical limitations by Invoice Finance DEFI.", "experience": "A Founding Partner of an Accounting Firm with 50+ WorkForce and routes across South India. Working as Virtual/Shared CFO over the past 10 years specializing in the fields of International Transaction Advisory, MIS, Accounting & Business Valuations."}