{"id": 398921, "author": "konmaorg", "title": "KONMA- A Web3 Marketplace", "url": "https://cardano.ideascale.com/a/dtd/398921-48088", "category": 26445, "amount": 38000, "description": "Lack of fully integrated web3 e-commerce stores with p2p trade and payment solutions.", "f6_no_assessments": 7, "f6_rating": 3.380952380952381, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposers are the team behind Konma, a web2 marketplace for food, art and lifestyle. They are transitioning to web3 by building a DAO and upgrading their marketplace to web3. This proposal is for the upgrade to web3. They intend to sell their existing products through Cardano.\n\nWhile the proposal doesn't match the examples given in the challenge brief, I believe it is in spirit completely in line with the challenge. This is an existing business use case being implemented on the blockchain. As far as I know, it is also one of the early examples of real world products being sold through web3 as well. Bringing real business use cases to Cardano is the aim of the challenge. This is both a B2B (vendors) and a B2C (buyers) solution that will be a great example of a business use case once implemented. \n", "q0r": 5, "q1": "The fact that Konma already has a working marketplace for users is great for feasibility. Instead of building the technology and the business in parallel, all they need is to focus on the technology. They already have the business - marketing, operations, etc. \n\nThe proposal is entirely based on software development. The project is divided into three phases with increasing complexity. The first phase takes products in the user's cart at checkout, produces an NFT and bills it to the customer. This is relatively simple. Phase 2 and 3 are for developing smart contracts for the vendor&customer and for affiliates. Phase 2 and 3 will require extensive knowledge of smart contract design.\n\nThe team's experience is then critical if they are to implement the smart contracts. Out of the four people in the team, only one is a blockchain engineer. Sangeet, the CTO has 4+ years of experience in blockchain development. It is not clear what percentage of that experience is with Haskell and Plutus. Either way, his extensive experience in blockchain is a big plus. It increases my belief in the team knowing they have someone who has implemented such solutions before. \n\nThe team has all the necessary skills other than development already at hand. The proposers do note they will hire developers but it is not clarified how many and with what skills.  As long as they find the missing skills, the proposal does seem feasible. Clarifications on skills needed and the number of developers they will onboard would be appreciated. ", "q1r": 4, "q2": "The three phases do provide deliverables as each phase is connected to a specific functionality. The phases however don't come attached with dates. The included roadmap doesn't mention them. The roadmap is divided into 2 week chunks. Each chunk highlights the focus of the two weeks. There isn't much detail to each chunk. For example week 3 and 4 is to Finalize Architecture Design. There are no deliverables but the roadmap gives a broad idea of what to expect.\n\nI feel the roadmap was thrown together rather quickly without a lot of thought. 2 weeks are given for the preliminary audit. Another 2 weeks for Final Audit and Q/A. Audits are held by 3rd parties. I don't understand why 2 weeks are given by the team to hold audits while work still needs to be done. In reality, of course the work won't stop when the audit comes. But it seems in the roadmap that it will stop. \n\nSo it's rather difficult to pin down the path of the proposal. I suggest the team to provide a clearer plan, linking the phases with the roadmap, attaching estimates for each major deliverable. ", "q2r": 3, "assessor": "z_assessor_1323", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The impact of integrating marketplace based technologies can be very high for Small and Medium Businesses. While this includes a novel approach to minting bills as NFTs on demand, there are no benefits outlined that aren’t already solved by good web2 marketplaces which brings to question how they will get user adoption. For these reasons, the impact of this seems largely unknown in practice. ", "q0r": 3, "q1": "Marketplaces are the most difficult technology to build because of the balance of acquiring sellers + buyers into the ecosystem, this proposal doesn’t account for how they will onboard new sellers which is the critical piece for success.\n\n It seems there is much more scope and hours required than is accounted for by the team to create Cardano’s smart contracts to dynamically generate the Bills as NFTs. I would encourage the proposer to scope and build a smaller version for a current seller to outline user adoption path, then focus on scaling the tech. ", "q1r": 2, "q2": "There are clear ways to track the progress of this marketplace with the NFTs that are produced by their smart contract once built. Unfortunately the audibility of development and the process of building the marketplace ecosystem has not been addressed. Without this context it would be hard to know if problems or scope blowout has occurred.", "q2r": 2, "assessor": "z_assessor_1122", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This is a proposal for the transfer of an existing web2 online store for food art and lifestyle to a decentralized p2p vendor, customer driven marketplace. The transfer will include an integrated payment solution.\nThis proposed solution meets the challenge objectives from the standpoint of creating a tool for p2p marketplace which aligns with the challenge objectives. However the stated deliverables of the proposal do not meet the metrics that the challenge wants to measure.\nTherefore I neither agree nor disagree that this proposal effectively addresses the challenge.\n", "q0r": 3, "q1": "The proposal has a roadmap with by-weekly benchmarks. Unfortunately there is not much detail in that plan, just broadly formulated tasks. \nThe proposal has a budget breakdown with some detail, number of hours per specialist and total funding per category. There we can see that the majority of the funding $30K is for software development, $3K is for infrastructure and $5K is for marketing, but there is no further detail.\nThe team is well presented and with working links to linkedin profiles. The team looks to have the needed experience to accomplish the goals of this proposal.\nThe voter should know that the same proposer has another proposal in fund 8 in the Hub challenge and plans to develop a physical hub that will double down as an inventory for the online marketplace.\nThe proposer outlines a risk for this proposal and proposes a mitigation plan for it.\nI agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 4, "q2": "In the auditability section the proposer lists a number of tasks/milestones, but does not attach dates for them (maybe we could take some of these from the roadmap) however there are no measurable that the proposer suggests. Therefore the auditor should take discretionary decisions. That means all the power for the decision if this project is progressing correctly or not for releasing the next batch of funding will be in the auditor.\n2/3 of the success measurable are immeasurable which again puts all the power in the hands of the auditor to decide if the project is successfully completed and release the last part of the funding.\nDear proposer it is in your best interest to clearly state what milestones will you cover with exact numbers and dates attached, in this way you will be objectively audited.\nI disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 2, "assessor": "z_assessor_1417", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Highly secure and aids the stakeholders are issues of concern today when the web2 marketplace can no longer guarantee the security of personal information and enhanced support for customers, vendors, and affiliates. Therefore, I see Konma has foresight when it wants to develop its marketplace according to web3. And if everything goes smoothly, the Cardano ecosystem in general and its utilities in particular (NFT, ADA coin) will be even more welcome.\nHowever, the proposer presented the context and introduced the solution quite coherently, but when describing the link between the project and the challenge's KPIs, you did too little. Challenge requires “describe” not “list,” and 3 lines are not enough to prove that link. Furthermore, in my opinion, you should correct your wording in the main challenge and risk section. Since the blockchain concept is new to many, you must “FIND A WAY TO POPULARISE AND ENCOURAGE USERS THANKS TO ITS EASE OF USAGE AND CLEAR INFORMATION” to overcome this risk. This makes it more logical and easier to understand.", "q0r": 4, "q1": "The proposer introduces the roadmap with specific completion timeframes. You have also provided a budget and a list of members. In general, there is enough information for all 3 requirements, but you still lack the detail for them. Specifically, how and by what means will you complete the activities outlined? There are items listed in the budget without the amount, so why are they here? And finally, if the introduced members are all important figures in your team, you should provide equally their personal information. Don't let one person introduce the experience, but not for the other. Investors need more than simple nouns, remember that.", "q1r": 4, "q2": "Innovating a marketplace is not an easy project and requires many goals. And in the Auditability part, you must describe the criteria to define how the team has accomplished the goals of this proposal and clearly show quantitative indicators to monitor the progress of the project. But what you present in reality is not so complete and lacks the numbers to make investors believe in the future of this project. Sorry to give you 3 points and I hope my suggestions will help you improve in the following proposal.", "q2r": 3, "assessor": "z_assessor_1666", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The idea of web3 is fascinating, and one that many people think is long overdue. It is not hard to understand this point of view. I mean come on DEVs, wrap it up already. Well this type of sitting around waiting for the cool stuff to come to your way is not helping the community and needs tp end here. Luckily, this is simply fixed with a little education and understanding the grasp of how web3 needs to be implemented. I would love to sit here and write a full explanation, but luckily for everyone, the information is more available now than it has ever been. When we are talking about web3, we might as well be talking about decentralization itself. P2P ( or Peer-to-Peer) marketplaces are very exciting. They will have a huge impact on not only effectively addressing the challenge for this specific proposal, the impact will be felt throughout the entire crypto ecosystem.\n      Many different parts of the Cardano ecosystem can and will be utilized in realizing web3 as a whole. There is a strong argument that web3 along with P2P payments and decentralized markets are not even possible without something like a Cardano ecosystem. I would suggest that this proposal take advantage of how vital Cardano is for addressing their Problem Statement, and include other projects such as Profila and Ardana as examples of maybe how converting a web2 environment over to web3 could even be possible, while at the same time highlighting the importance the exact ecosystem this proposal is wishing to compliment. \n\n  The proposed implementation that was briefly outlined for a use case of CNFTs is really interesting, and a proposal on that specifically would be great to understand in possibly a future funding round.\n    Along with the other things mentioned the CNFTs could be eventually evolved to meet other normal interactions and bring new engaging, and importantly even better cost effective CNFT solutions to an already established legacy approach.\n  This proposal is very ambitious, and while admirable, would have better impact if broken down into multiple funding rounds. This would allow the proposer more time, and also likely a larger budget to achieving the end goal of migrating to web3. More specific goals for a proposal would likely find this team able to more effectively address specific problems needing to be solved for the challenge this proposal is ultimately requesting to be given funds for. It Is not portrayed very effectively if the main focus of the project wants to migrate to web3, and wanting to use the CNFT was just an afterthought. This is the reason I gave some of the information in the beginning of this rationale. .        ", "q0r": 2, "q1": "My rating does not reflect intention of a proposal, but the practical foreseeable outcome based on the information given in the proposal. I would recommend a good look at what value A proposer can add to the PROBLEM STATEMENT at the beginning of their proposal, and consider how would they explain a solution to someone new to this space. The community guidelines for submitting a proposal do not give the voter expectation of a full technical breakdown from start to finish, but it needs to be reasonable to expect, based only on what your proposal gives a reader, there is a decent chance this project will do what they are proposing. I believe that this team does not outline enough information on specific things such as, examples of current P2P projects that are in development that can help in outlining a path to a web3 implementation. Specifics on their verry innovative CNFT use case, with examples to show the knowledge to successfully make this happen. This CNFT idea, the only specific mention to the cardano space, i believe would make a great option for a future proposal.    ", "q1r": 2, "q2": "Since i gave the last two review points  a 2 star , \"DO NOT AGREE\", along with some things mentioned in the rationale for the other 2 assessment questions, gives a good insight as to my rationale for not agreeing to this assessment. The proposal gave a 1 year Roadmap, with 12 separate project milestones. These are then broken down into monthly goals, and these goals do not go into detail beyond a 1 or 2 word description. If the other issues that i have laid out in this assessment were fixed, i do believe the team would be able to lay out what needs to be done.   ", "q2r": 3, "assessor": "z_assessor_1959", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The problem of the proposal is well-defined the lack of web3 e-commerce stores fully integrated with p2p payment and commerce solutions as a problem to be solved and it is related to this challenge. . The proposal is scalable to address future challenges. The solutions the author offers are turning his web2 store into a decentralized p2p provider, customer-oriented marketplace with integrated payment solutions. This proposal identifies the challenge to be solved it adds value to the Cardano ecosystem increasing the number of users. I think this proposal successful will go a long way to making Cardano the blockchain and defi of choice in the Web3 world.", "q0r": 5, "q1": "It is recommended to define clear and reasonable timelines. The tasks are divided into 24 weeks. Each week the author lists what the work needs to be done. Project progress is easy to check the community can easily track the progress of the project. Project budget is $38,000 which is divided into 3 main phases: development & testing - $30,000, infrastructure - $3000, marketing - $5000. Development and The author lists the details of the work that needs to be done, but here the author does not give an example of the budget for the project. I think the author should consider more about the budget reserve so that when the project is done, there is still something to spend. The group consists of 4 members, through the group's profile, I see the author clearly lists what the group's current work is doing and the number of years of experience of each member. The team also put their personal linkedin on it to help the community know who they are, increasing transparency and trust for the group more.", "q1r": 4, "q2": "The metrics are outlined through WEB3 integration of our existing web2 e-commerce marketplace, wallet integration, beta testing, real-world testing. KPIs are identified as being on the right track, but they can be more difficult to measure for those unfamiliar with Web3. Success is related to the challenge of the campaign. A fully functioning market spread across user base using ADA to transact on the platform and the total amount of CNFT billed is the success of this project. This project is a brand new project and is waiting to be funded.", "q2r": 4, "assessor": "z_assessor_649", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "\"This proposal is a step to upgrade the Konma marketplace from web2 to web3 for higher secured and ads the stakeholders of the marketplace (customers, vendors, and affiliates) The proposer describe the content of the current of their marketplace very clear and vital. There are 3 phases in this project that can help them finish shifting to web3. And the proposer provides a very detailed explanation about the feature, scenario, and the benefit to the stakeholders when finishing each phase. As the key metrics provide in the proposal, I think this proposal is aligned with the challenge settings because it can increase the total number of CNFTs minted and adopters, users to their marketplace. \nLastly, the team identifies the key challenge that I believe will meet in all kinds of business technology shifting, it's adaptability. The good thing is that they have a strategy to move on but I love to see more detail about their solution. \"", "q0r": 5, "q1": "\"The development is divided into 24 weeks, and their roadmap outlines the outcomes in every bi-week. I hope that the team can provide more information about these bi-weekly tasks because the content is so general that we don't know which step belongs to which phase of development. Moreover, the team also should provide a detailed implementation plan to help the community assess the budget. There is a marketing cost in the budget outlines but we can't locate that budget on where in the roadmap. The good thing is the key members in the team seem that have enough skill and good ability to solve the task in the roadmap. \nSo, after all, with my experience, their team can help to finish the phase of marketplace development but they don't have good content for explaining what they're doing. I will rate this for 3\"", "q1r": 3, "q2": "I think the community has to follow their website for tracking their progress because the proposer only provides some key metrics and outputs that they will make without any tracking tool to help to audit. Moreover, I think the proposer should describe more about the successful picture of this project, or some KPIs - this will help the community better understand what they really want to support. ", "q2r": 4, "assessor": "z_assessor_651", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Konma plans to transition its web2 store to a decentralized p2p vendor, customer driven marketplace with integrated payment solutions.", "experience": "Haskell experts and professorsPCI-DSC compliant officerPayment Gateway DeveloperNode.JS developer for BackendReact.JS developer for Frontend"}