{"id": 399243, "author": "dzhuliana", "title": "AI Mentor matching software", "url": "https://cardano.ideascale.com/a/dtd/399243-48088", "category": 26445, "amount": 30000, "description": "Organizations have untapped value within their networks which can be realized with an effective mentorship program.", "f6_no_assessments": 8, "f6_rating": 4.458333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 2290, "q0": "The proposal wants to support processes relating mentorship between businesses, institutions and other facilities. It wants to efficiently connect different pools and build networking effects with the help of blockchain technology and Cardano. The challenge is therefor met and the project is in line with a b2b concept. It addresses inefficiencies and contributes a value to the economy in several aspects. The project can help to raise more experts with the help of mentorship and therefor enlargen the ecosystem and community.", "q0r": 5, "q1": "The team´s knowledges and experiences are pointed out and there social media experience is linked for further justification. There seems to be a good mix of responisbilities in business and technical aspects. It seems that this team has worked together before and is able to work efficiently to reach an implementation sucessfully. The project plan and milestones are realistic and achievable with the budget given. The plan is created professional and gives confidence of their success.", "q1r": 5, "q2": "KPIs and milestones are clearly shown and the reader has a good overview of what needs to be achieved to call this project successful. There a quantitative and qualitative measures that the community can use to efficiently audit the progress of the project.", "q2r": 5, "assessor": "z_assessor_1476", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 3025, "q0": "The proposal is adressing the need for better management of mentorship programs in large companies via AI. Based on Atala Prism and SNet it is in line with the challenge and is a good business case that can provide good value to the customer and Cardano ecoystem.\nMetrics and goals are clearly presented.\nScaling is mentioned under risk and mitigation is provided.\nOverall, a very solid proposal with real usecase and planned onboarding of 2-3 pilot companies.", "q0r": 5, "q1": "The team is experienced in key areas: IT, business and AI with verifiable public profiles provided.\nThe budget and proposal is very well structured, with deliverables, milestones and resources needed.\nA growing startup with a solid proposal as well as already working MVP with users onboarded.\nIf have not found any objections or missing data.\n", "q1r": 5, "q2": "The proposal clearly states the metrics that need to be delivered/are expected which enables easy tracking of progress.\nA roadmap with milestones is presented as well as time horizon. It looks well thought out and achievable.\nThe targeted problem is clearly stated and the solution for it is provided.\nOverall, it can be concluded that if the project is funded it can be monitored and success measured.", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 3667, "q0": "The proposal highlights the effectiveness of OneUpOneDown by presenting existing challenges in university and corporate environments. Since then, the link between this method and the challenge's KPIs is more apparent. Through this mentoring tool, I believe that issues related to efficiently making matches within a network will solve and accelerate Cardano’s development in a Learning and Development environment.", "q0r": 5, "q1": "The proposal provides a complete Action plan and Milestones for the project. In addition, the expenditure items also correspond to the activities mentioned in the plan. And the member's introduction also creates attraction thanks to the show of their experience. However, the presentation of 200 mentor matches was successful with an NPS score of more than 80% is better to put in the Auditability part than in the plan.", "q1r": 5, "q2": "The proposal presents the goals for the success of the project and the KPIs that are expected to be achieved in the future. I appreciate your presentation when you can stick to KPIs with the plan set out earlier. However, the numbers you give are still not enough to impress investors. Let's add specific quantifiers for the Number of organisations signed up and the Number of users within organisations. And remember to add a way for the community to track the progress and the development of the project if funded.", "q2r": 4, "assessor": "z_assessor_1666", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 4779, "q0": "This solution successfully addresses the difficulty, in my opinion. According to the issue statement, organizations have latent potential inside their networks that may be leveraged through a successful mentoring program. Cardano's aims to accelerate the growth and evolution of the developer and app ecosystem are supported by this challenge. It stresses open standards based on the concepts of transparency, openness, and consensus. Creating an environment conducive to innovation, growth, and fair competition. This suggestion covers all of the bases and offers a solution to the problem.", "q0r": 5, "q1": "The proposers have linked in profiles and have all of the essential experience to cover all that is required for this implementation and more. Although there is a defined number of team members, there is opportunity to expand and scale as needed. A thorough explanation of the team behind this project may be found at the website address provided in the proposal description. From a professional standpoint, I am confidence in the team. The initiative gains credibility as a result of this. The budget is clearly laid out and broken down into actionable things to be carried out. There is a realistic and comprehensive timeline for bringing the project to a successful conclusion, however I don't believe it will ever be completed and will instead continue to develop. The allocation of cash is clearly stated in the plan, however not in terms of hourly rates; instead, monthly rates are offered, which are justified (6 months). Overall, this is a well-written proposal, and I believe it has a good chance of being adopted effectively.", "q1r": 5, "q2": "This approach is great in terms of the things that must be considered when evaluating auditability. They now provide new measurements of success, each of which is explicit in its purpose, taking into account that the job previously accomplished can be confirmed. By examining them, I am certain that they will eliminate any potential challenges for the community in conducting audit activities at any time. Because of the proposal's intricacy, I believe that a 6-month road map explanation is warranted.", "q2r": 5, "assessor": "z_assessor_1772", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4951, "q0": "The proposal is succinct and well written.  The proposer does a great job a addressing the primary problems/issues and articulating the solutions without using flowery language on gong to down rabbit holes.  The proposal adheres to the challenge guidelines and hit on numerous areas.  The proposer has an existing solution and she has outlined the long term strategy, vision and roadmap.  High marks on all points.  This solution would provide tremendous value to the Cardano ecosystem and is absolutely aligned with the philosophy and values.  In addition, this is the architype of proposals needing funding; smart, dedicated founders, capital poor, brilliant idea, developed an actual product which is deployed, has a current user base, needs to take this to the next level.  ", "q0r": 5, "q1": "The proposer has provided a succinct roadmap and key milestones and also provided a process development outline of each of the business’ steps to success.  The budge tis well down however I would have preferred more specificity as opposed to round numbers but considering the budgeted amount it is acceptable.  The proposer has developed a diverse and strong team which appears to be ready to make this their full-time endeavor.  The proposer is also utilizing existing system such as Altara PRISM and Singularity.  I would suggest the proposer consider both a B2B strategy (organizations for mentoring) and a B2C strategy (individuals interested in mentor or mentoring) because both seems interested, and it appears the solution could market to both markets. ", "q1r": 5, "q2": "The proposal provides adequate KPIs which address the core milestones and success of the project.  I believe the proposer could provide additional KPIs such as the NPS score, number of mentees providing feedback, length of mentorship, etc. however the current KPIs are adequate for the proposal.   ", "q2r": 4, "assessor": "z_assessor_1807", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5735, "q0": "Having been a Catalyst mentor I can appreciate the value (within the catalyst project) of having a mentor. Especially if the proposers lack experience in key areas (in particular such as business & start-up issues). However asking for or offering mentoring services, when you do not know the mentor or mentee is a barrier. To even asking. But there aren't may ways to know that the fit is correct. This AI approach, which seems to already have undergone some alfa or beta experience has the potential for high impact. I can imagine that a proposer who signs up as wanting mentoring help, would be more inclined to follow through if the system suggested a  match or several matches. Sort of the matches dating sites offer. Not necessarily perfect, but puts both parties in the right ballpark. The proposal objectives that go far beyond project catalyst are what make this proposal much more interesting. The only reason why I rate this proposal 4 star and not 5 star is the uncertainty about people's willingness to use mentors at all. Or for that matter to use the tool/system. Not a fault of the proposal, just uncertainty. But I do sincerely believe the Cardano Treasury should fund the proposal. Please refer to my ratings in the other two dimensions.", "q0r": 4, "q1": "The first point in the proposal's favor in their request for Cardano Community funding is that it is a company! A company that comes to Project Catalyst having already built AI mentor matching software. One that has demonstrated users and pilot projects undertaken with organisations. This is precisely the kind of 5-Star proposal we need.\n\nThey come with Mentor matching logic: a successful matching algorithm for a target demographic. And have a platform with over 650 users signed up as mentors, mentees or both. Having made more than 200 mentor matches to date with a high success rate is another indicator of 5-star feasibility. \nFinally the team is super. Combining significant years of experience with having already worked together is unusual in Project Catalyst. Whist proposers may have one, they rarely have both features, \nFinally the two leaders of this proposal are among the most active in our Project Catalyst community. Having watched and at other times participated in their zoon sessions, I measure them as visible, helpful, insightful. And show themselves to be empathetic, sympathetic and open to all points of view.\n\nThe budget and use of funds are clearly defined. And seems both practical (enough) and reasonable (not too much). \nTotal: $30,000\nMarketing & Comms resource (creating leads) - 3 months x $1,000 = $3,000\nSales & Partnerships (converting leads) - 3 months x $2,000 = $6,000\nProduct development & technical support - 4 months x $3000 = $12,000\nMatch validation & customer support - 3 months x $2,000 = $6,000\nProject management and administration = $3,000\n\nNote that funding to reach objectives for months 3/4 until 6 are not included. They have mentioned that they expect to have recruited 2 paying organizations by month 3 to cover ongoing expenses.", "q1r": 5, "q2": "The goals are clear, modest and achievable. Especially from their starting position. Their plan is simple.\n\nStep 1: Outreach to potential partners to secure early partnerships. We will use our existing networks and sales collateral to support this outreach. \nStep 2: Onboard organisation leads to support the role out of the programme within the organisation/network\nStep 3: Onboard mentors and mentees using OUOD dashboard\nStep 4: Propose matches\nStep 5: Matching begins\nStep 6: Monthly check-ins to assess match quality and progress \nStep 7: Match finishes\nStep 8: Report learnings\n\nThe timeframe seems doable. \nOne month: Outreach to organisations\n\nPrepare marketing materials\nLeverage existing network to facilitate introductions\nShort list 10 organisations that are warm leads\n\n\n\n\nThree month: Confirm two aligned organisations as partners and onboard key stakeholders within organisation\n\nConfirm partnership with Services Agreement\nOnboard stakeholders \n\n\nSix month: Onboard organisations and complete first round of matching\nRecruit and onboard mentors and mentees\nMake matches using matching algorithm plus validator\nCheck-in and collect feedback from users\n\nThe pathway to reaching those goals is clear. So reporting to the Project Catalyst monitors should be done well, to everyone's satisfaction. Being very visible community members, we can expect regular updates by swarm sessions and ATH breakout rooms.", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8058, "q0": "Matching the right mentor and mentee always be a tough task. This team will make a platform that helps enhance the network of mentorship in the various pool including education, business. Their platform will not just help match the right person to an individual or organization that needs mentors, but also with DAO mentors can gain their credibility for delivering extraordinary mentorship experience. The proposer has a good explanation and case study about how their platform will work that I think it is easy to assess that it is aligned with the challenge settings because it will increase the number of not just organizations, companies, mentors to join to create value in the platform, but also creating sustainable communities of them in the platform. Lastly, the proposer provides 2 challenges that they have to face and they also have the plan for it with the specific timeline. ", "q0r": 5, "q1": "\"The team has a clear step for their development and also has a ready database about mentor and mentee, they also have experience in connecting and matching mentor and mentor. In the scope of this proposal, they will focus on onboarding 2-3 organizations to run pilot projects, so I think the one-month and three-month timelines that they provided in the proposal are reasonable and enough to do. That timeline with outlines of tasks also helps assesses their budget is reasonable. \nLastly, their founder team of both business development and technical development tells that they can lead the team to be successful.\"", "q1r": 5, "q2": "The proposer shows the six-month goals for this project that I think it's suitable with their implementation plan in the 3-months development phase of the business. Because in the scope of this proposal, the platform will be not ready yet so I think the team should provide some tools for helping the community track their progress. Last but not least, their success KPIs is tied to the mission of the scope of this proposal in 3 months that I think are full enough to assess their potential idea. ", "q2r": 4, "assessor": "z_assessor_651", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8796, "q0": "The success definition for this Challenge: \"Innovative products and services that increase efficiency, transparency, and stakeholder engagement as well as expand the business to new areas.\" is not met by this proposal because the tech described is not actually described, and it is not central to the offering.\n\nThe proposal is a product extension with a single assertation paragraph dedicated to the creation of something called a \"Mentorship DAO\". That DAO is not defined, or described; it's not clear how it adds value to the project as the milestones laid out in the proposal are actually to the project designed to fund the creation of the DAO..... the product extension.\n\nWhile the matching concept is interesting, there is actually nearly zero described role for blockchain in it. It is possible to write this entire proposal without mentioning blockchain tech and it would read simpler, more cogent, clearer and tighter. \n", "q0r": 2, "q1": "This plan is a rough sales plan for the development of the \"OneUpOneDown for Organisations\" that somewhy contains a DAO.\n\nThe team as described does not have demonstrated success in building DAO.  The CEO of OneUpOneDown has another full-time job per her LinkedIn.  ", "q1r": 2, "q2": "This proposal contains within it the expectation that the team will build a fully functional \"Mentorship DAO\" within which the incentives and participant engagement will be managed. \n\nIn turn, the DAO development will be funded by a different effort to sell to and onboard 2-3 organizations for the existing OneUpOneDown algorithm. \n\nThe milestones listed to not describe the build of the Mentorship DAO at all. There is no clear specific business plan or value statement to attract and charge these 2-3 initial organizations. None of the milestones listed are relevant to a Cardano blockchain project..... they are relevant to the sales process for these initial 2-3 organizations. \n\nThe necessity of attracting and selling to these 2-3 organizations in order to fund the build of the \"Mentorship DAO\" by a team that does not have demonstrable successful experience in building DAO are significant and unmitigated risks to the successful realization of the project.", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Use AI and blockchain technology to build trusted relationships within a large network through mentorship.", "experience": "A company that has already built an AI mentor matching software, with demonstrated users and pilot projects with organizations."}