{"id": 399629, "author": "binh", "title": "Barter exchange on Cardano", "url": "https://cardano.ideascale.com/a/dtd/399629-48088", "category": 26445, "amount": 160000, "description": "Enterprises encounter with liqiuidity problem with their illiquid assets. Barter exchange on a blockchain platform may solve this problem.", "f6_no_assessments": 6, "f6_rating": 3.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 1617, "q0": "The idea of the proposal refers to a solution to provide liquidity for illiquid commodities of the company. Proposals are in line with the business solution challenges presented. I have read through all the details contained in the proposal and have a few small questions if you can answer me. Can you detail why when the goods are put on the exchange, it will improve liquidity, because the nature of this commodity is already illiquid? Assets such as real estate, goods, when exchanged, how will the legality in that country be? A detailed description of these additional issues will facilitate your application for funding.", "q0r": 3, "q1": "In terms of feasibility, the proposal provides development roadmaps as well as the amount of work to be done and the estimated budget. I completely agree with this route. However, when it comes to feasibility, there are still many questions surrounding the legal issue. I have suggestions on how to add a roadmap to improve the legal framework in Vietnam. And have you taken into account the risk that the legal framework cannot be built, does the proposal have a backup plan? In addition, you also detail the experience of each member of the development team, I appreciate this. However, if you can add links to personal pages like Github, Linkedin to check more specifically, it will increase transparency for the project.\n", "q1r": 4, "q2": "As for the KPI to evaluate the success, I completely agree with the targets and data of the proposed proposal. Provide a specific roadmap for each step to achieve results. I have a small suggestion to add a measure of the quantity of goods tokenized on the blockchain. \n", "q2r": 5, "assessor": "z_assessor_1394", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 3128, "q0": "This proposal is really necessary for the developing of the barter exchange from real assets into digital assets on blockchain and especially on Cardano. Thereby, there are more types of assets that can be exchanged that mean more people join the system. Bringing blockchain technology more realize to daily life. The legal issue is something very important for the project, the project is developed in Vietnam, but Vietnam does not have a legal framework for cryptocurrencies, so the issue of tax payment for the host country should be considered.", "q0r": 4, "q1": "The business planed quite clear. The target of the growth up 10 times from 100 to 1000 corporation members within 2 years  is reachable. The team member of this project have good background to achieve this project, but we need more information about team member, beside that team still need 2 more members: 1 legal expert and 1  Blockchain and Defi expert. 2 position is not easy to recruit in Viet Nam.", "q1r": 3, "q2": "The proposal aligns with Cardano vision. It's going to be a tool to help more interact the people who have real assets want to transfer into digital assets. The App can attract more and more real users in Vietnam market into Cardano ecosystem. This one is the new one, so it needs more time for user to approach and similar.", "q2r": 3, "assessor": "z_assessor_1615", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3239, "q0": "\"Barter exchange on Cardano\" is a great idea. This proposal raised a critical, relatively large-scale problem that met the challenge. Currently, many enterprises face issues related to the security of their illiquid assets and extensive inventories. The form of barter has existed for a long time (also known as Barter Trade). This idea will form a new way of segmenting trade that combines the classic spirit of Barter Trade with Blockchain. This will create liquidity for illiquid assets, and non-bank currency trading will become more common.\nThe proposer has carefully given documents to guide viewers with an overview of the world barter industry and blockchain barter. The solutions they offer for this proposal are very detailed, identifying most of the problems of the challenge. Cardano will be an essential bridge to bring tangible assets into the blockchain world.\nThey also mentioned three main risks: market economy, legal and regulatory, and financial. Every threat has a solution to overcome.\nWhile this is a good suggestion, the solutions are relatively complete. But I see that transportation and tariffs are also crucial in trade between countries. It affects the value of goods and assets exchanged. So how will the pricing of the goods be guaranteed? I hope the team can explain it to me.", "q0r": 4, "q1": "The team has provided a very detailed plan, a clear roadmap, with goals according to specific timelines. The budget of this proposal represents 16% of the challenge's total budget. Consists of 2 main expenses: the development team cost ($60,000) and the test network launch cost ($100,000). However, the cost of launching the test network has not been detailed yet.\nThe information about the group members given is not complete. There is no specific job assignment. However, identity is challenging to determine. Here, the proposer provides only basic information about the experience. I would like to know more about their achievements and their specific work in this project. For example, I need a facility to verify their identity such as Facebook, Linkedin, Twitter...", "q1r": 3, "q2": "I think how they measure the project's progress, and development is very detailed and precise. The proponent provided metrics, KPIs for each goal, and a defined timeline. Easy to measure, easy to test.\nThis is a new project that has never been funded before in Catalyst. Although not tested before. But through the description of the solution, the plan and the KPIs they set for each specific milestone, I find that the project's success can be clearly defined.", "q2r": 3, "assessor": "z_assessor_1631", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5518, "q0": "The proposal has the main goal of developing a barter exchange on the Cardano blockchain, as a means to bring real assets (real estate, financial assets, commodities) into the blockchain ecosystem, thus expanding both worlds.\nThe proposal, if successfully implemented could indeed prove to have a positive impact on the Cardano ecosystem, attract new businesses and individuals, provide a direct utility and benefit for those unfamiliar to crypto. ", "q0r": 5, "q1": "The plan is written up until December 2023, has KPIs and a timeframe, is well detailed and easy to follow.\nThe budget, unfortunately, has insufficient information provided. The cost for the development team is well broken down, out of the $160000, $60000 is allocated to 3 months of development for 5 team members. However, for the remaining $100000 the only explanation offered is “Launching test-net: running a pilot barter exchange with 100 members:”\nAs such, the budget cannot be properly evaluated if the majority of the funds spending is not clearly described.\nThe team offers some details about their previous work, but they have not provided any links to a social profile, or website that might feature their expertise. There is a link provided for one of the developers, but the website is not properly working for me (gives an error of privacy), as such I cannot opine on it.", "q1r": 3, "q2": "For the progress measurement and success description, the proposers mention that the KPIs offered for the detailed plan should be evaluated as answer. That can work for the success description, however, for the progress measurement there should have been a different answer. The question is not what the progress is, but how it will be measured. For instance, the first step on the roadmap is “- April – June 2022: set up development team and making MVP” - there should have been an explanation of how the community can easily verify if that certain step has been implemented, will there be a website, a GitHub, etc where the code for the MVP will be uploaded, will there be any announcement and description of the development team hired and so on, for all the KPIs provided.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7582, "q0": "Problem statement\nEnterprises encounter with liqiuidity problem with their illiquid assets. Barter exchange on a blockchain platform may solve this problem. Tokenizing real illiquid assets of companies, then putting them on the barter exchange, will create liquidity for those illiquid assets. This is a great idea, the current company I work for also has a lot of inventory problems due to unreasonable calculations or some factors that lead to backlog of capital that is difficult to turn around and reduces profits. profits of the company, there are even items that have to be liquidated for $0. This solution will help to create the necessary liquidity or exchange of goods between companies. I appreciate this idea, it fits this challenge. The proponent also gave 3 main risks (Economic and Market risk / Legal and regulatory risks / Financial risk ) To promote the use of electronic money for this, I have a small suggestion besides the exchange of goods, please promote the payment of electronic money. Pay for your company's merchandise in crypto to help people get to know each other. Legal risk is not an easy problem to solve and is a big barrier, it is necessary to participate in government economic forums to promote this.", "q0r": 5, "q1": "The proponent provides a development roadmap from April 2022 to December 2023. In which, the test network will be launched in December 2022. Basic design of MVP: consists of three main components (i) wallet application; (ii) barter goods; and (iii) decentralized lending. Information provided is complete, development time is reasonable I appreciate this. Regarding the proposed cost, it is recommended to add more clearly 5 members of the development team to be assigned work, time and unit price to clarify $ 4000 per member / month. Suggested cost $100000 doing a demo barter with 100 members, would be great if you could clarify in detail how this would be used. Currently, the team has 3 people who are provided with relevant information about experience / expertise, the proponent should add the social network links of each member so that readers can easily confirm their identity.", "q1r": 4, "q2": "The proponent gives the KPIs for the 3 stages of development are very clear. The indicators are easy to measure and incremental. The attached file also shows that the proponent has implemented this idea since 2017 but not on the blockchain. With the first goal by December 2022 to reach (Exchange network: 100 company members / Asset tokenization value: 100 billion VND (4.5 million USD)/ Trading volume: 50 billion VND ( 2.3 million USD)/ Loan sales: 23 billion VND (1 million USD)/ Cryptocurrency holding participants: 10,000 people). These are very challenging numbers. When using this tool, I suggest adding the user satisfaction index, which is measured by survey or customer care. This proposal is a new one, It is not a continuation of a previously funded project in Catalyst.", "q2r": 4, "assessor": "z_assessor_610", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8084, "q0": "This is a real goods exchange proposal blockchain application of data management, direct transaction and payment in cryptocurrency. This is an inevitable development up to the present time, when blockchain awareness and cryptocurrency payment acceptance are more popular than many years ago. However, going from idea to reality requires an in-depth capacity, solving many technical problems, when decentralized management is related to security issues, verifying the reputation of the participants in the transaction. direct translation. I found the team to be professional, and also understand the local market, they also cover the legal issues in the host country.", "q0r": 5, "q1": "Regarding the detailed plan and KPI, I find it quite unreasonable, because in about 6 months, it is difficult to have up to 500 corporate customers as well as successfully trade goods in millions of dollars. I think you should spend the first 6 months on market research, technical development of the platform, gathering enough qualified personnel, and even in-house training. Because I know your locality, there are not many blockchain experts, and there is no clear legal framework.", "q1r": 4, "q2": "I have looked at the KPI they set, with a small number of employees, the solution is not clear, but the KPI is very ambitious with trillions of traded goods, crowdfunding 5 million dollars... Really too ambitious and overpowered. Unless they do finance, with a plan like this I don't think it's very feasible, especially the local legislation they implement is still unclear.", "q2r": 4, "assessor": "z_assessor_652", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Tokenizing real illiquid assets of companies, then putting them on the barter exchange, will create liquidity for those illiquid assets.", "experience": "Mr. Nguyen Thanh Binh (team leader): Ph.D in Economics, 22 years working experience in banking and finance.\nI tried to set up a barter exchange business in Hanoi (Vietnam) in 2012 - 2013. But this barter business was not run on blockchain at that time."}