{"id": 399940, "author": "heinz.gassner", "title": "DLT360: Business RADAR Team", "url": "https://cardano.ideascale.com/a/dtd/399940-48088", "category": 26445, "amount": 25000, "description": "The DLT360 Risk and Opportunity Radar provides a global view on Economy, Business and Industry with periodical updates & quarterly reporting", "f6_no_assessments": 4, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 254, "q0": "In assessing the Impact, it’s not clear there is a problem that is concisely defined by this team. With a deeper review, this proposal takes an approach to research and discover risks and opportunities in the broader ecosystem similar to corporate consulting and reporting. I would have liked to see more insight on how their quarterly reporting can impact the adoption of Cardano for large businesses and their plan to specifically attract those companies into Cardano. Perhaps case studies could improve this?", "q0r": 4, "q1": "The team seems to balance their current domain experience and balance their lean startup well. Using the Business Model Canvas is a good sign of experience and provides good insight on the details of their approach. The budget is well defined and very reasonable for their proposal.", "q1r": 5, "q2": "Very clear KPIs and with the inclusion of NPS there is a good feedback loop for the Cardano community and voters. They have reasonable goals and targets for contributor networks and partnerships outside of Cardano, which are directly applicable to the challenge criteria. ", "q2r": 5, "assessor": "z_assessor_1122", "no_vca": 11, "ne": 1, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 957, "q0": "Risk assessments in companies where important investment, and funding related issues need to be addressed as part of the growth of business are extremely important. The team have identified a clear gap for the creation of a product that would certianly augment the besiness decisions of the more experienced founders within this ecosystem. As a founder myself I can foresee using a tool such as RADAR to augment my decision making ability.", "q0r": 5, "q1": "This proposer is known within the Catalyst community, has had successful proposals that were previously funded and delivered upon, and has provided a detailed break down of what this project entails and how the team will go about implementing it. The team seems very competent and the feasibility of t his project seems very high.", "q1r": 5, "q2": "The team seems to be well versed with a good company culture of auditability and it shows in their metrics given. The list KPIs is short however it is ample enough to adequately measure the success of the project as it progresses through its stages.", "q2r": 5, "assessor": "z_assessor_1248", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2127, "q0": "NOTE for VCAs and voters: This proposal is part of a wider project (DLT360) that has at least 13 proposals in this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider DLT360 project. My assessment takes into account aspects common across all proposals (team specific like adequacy, competency, workload, or similar reporting mechanisms / budget logic). You shall therefore find common parts across these proposals (labeled as such) and parts specific to each proposal, which should offer a good balance of looking at each tree but not missing out the overall health of the forest. \n\nSpecific part: Behind the wider DLT360 umbrella lies another sub-project focused on the Risk and Opportunity Radar, with 4 branches and 5 proposals. This proposal focuses on the 4th branch - Technology\n\nI see striking similarities with the other 3 branches of the Risk and Opportunity Radar sub-project and I highly encourage merging them in scope for future iterations.", "q0r": 3, "q1": "COMMON part: Great team. DLT360 is operated by an outstanding and growing team of regulatory experts, very active in the Cardano community. They also benefit from a scalable network of contributors from the Cardano community, academia, industry and EU institutions. In terms of team competence, skills and experience, they are well positioned.The multitude of projects funded under their umbrella showcases the great capacity to identify opportunities within the Cardano community and clearly articulate them into actionable projects. \n\nCOMMON part: Significant existing and future workload. DLT360 is a wider project initially funded in Fund6, and greatly supported by at least 5 proposals in Fund7, for a total funding so far of 85.000 USD (own calculations), many of them being still ongoing. During Fund8 the team is casting a very wide net with 13 additional proposals across several challenges, for a total funding of 295.000 USD. Onboarding so many projects so quickly can potentially lead to: too much workload, overlapping deadlines, increased risks of under-delivering, inability to distinguish added value of one project versus another, unnecessary stress and a lack of focus on and core scope and competencies. Future iterations that can bring comfort to these worries will of course be highly appreciated. \n\nCOMMON part: ALL of the 13 projects have overhead items included in the budget (project management, social media, back office, etc.) consuming an overall 30-40% of each budget (an educated guess let’s call it). I think there was a missed opportunity there in terms of gathering all overheads under one roof and simplifying the budgets for all proposals by keeping them strict for core-activities.\n\nSpecific part: 20% of the budget goes to active content sharing by domain experts, 20% to quarterly video shooting, 20% to  team meetings with Radar-content review. For budget core-work rates are 25 to 100 USD/hour. \n\nAgain, striking similarity in scope to the other 3 branches and again, suggest merging them for future iterations. ", "q1r": 3, "q2": "COMMON part: Existing track record. DLT360 projects are interlinked and since there are a number of running projects the team is definitely familiarized with the standard procedures and reporting process of the Catalyst team, so there are very low risks in terms of failing to communicate properly or inability to implement the necessary KPIs. \n\nCOMMON part: The website is a great opportunity for improvement. A concern is the fact that glancing at the DLT360 website, there is no reflection of recent live presentations that were perhaps delivered to the community in Q1 2022. I am aware that it is a work in progress tool, and a very nice-to-have feature would be for such live presentations / slides / supporting materials to be uploaded there as soon as possible and be accessible for the community as an intermediate deliverable until the projects are finalized. Also for the sake of transparency, a user-friendly list of funded (any why not unfunded) proposals would definitely be appreciated, at least by future CAs.  \n\nSpecific part: basic KPIs are presented: size of active network, new content elements, net promoter score from Cardano community. I am not sure how they will manage to obtain data on the NPS score from the Cardano community, or how that community is being defined.", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10542, "q0": "This proposal is part of a bigger project, whose intent is to conduct continuous research (quarterly reports) on risks and opportunities for the blockchain space. This proposal would fund the \"Economic\" dimension of that. I think this might be a good use of Catalyst funds, but regarding alignment with the current challenge, I find it tenous at best. Regarding impact, we'll be in a better position to judge that once the team releases its first presentation to the community, stemming from a Fund6 proposal, it was scheduled for Feb/March. It'd have been great to have it for this round of assessments, but unfortunately, it is yet to be released. \n", "q0r": 3, "q1": "As part of a much bigger project, the overall project plan is clearly defined, and the specific activities funded by this proposal are reasonably identified.  The core team should be experienced in this kind of work, but potentially thinly spread with the amount of proposals they're involved in. For this particular proposal, two domain experts are identified, but one of them is also involved as domain expert in several other proposals from the same team. This is a concern, as the same expert would tend to provide the same feedback. \nBudget breakdown is quite detailed, and the overall budget is reasonable.\n", "q1r": 4, "q2": "Proposed KPIs seem appropriate, measuring both the output (new content) and impact (partners and contributors). I find very interesting the inclusion of Net Promoter Score as a KPI. This is a metric used by brands to measure client perception, and it's refreshing to see it used in this context.", "q2r": 5, "assessor": "z_assessor_941", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Our business expert team & contributing network apply a well-defined process for keeping content valid and deliver the quarterly reporting", "experience": "The DLT360 Domain Expert Team and the contributing network with\n30+ Years of senior leadership experience in Fortune 500 companiesUniversity assistants and studentsIndustry partnersDLT360 supporting team\n\nDetailed information & links provided in 'Feasibility' section below"}