{"id": 400078, "author": "nanasafo01", "title": "Cardano Recycling DApp", "url": "https://cardano.ideascale.com/a/dtd/400078-48088", "category": 26445, "amount": 44586, "description": "Used recyclable plastics must end up in recycling hubs. However, 82% of used recyclable plastics end up in the oceans and/or on the streets.", "f6_no_assessments": 14, "f6_rating": 4.738095238095238, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal entails the creation of a recycling platform to facilitate and increase the recycling of plastic waste to avoid its dumping in oceans and landfills. The recycling operation is a B2C concern which makes this proposal well aligned with the Challenge statement.\nThis solution will have a positive impact on the environment as it is an eco-friendly solution to deal with recyclable plastic. Normally, the recyclable plastic also ends up in oceans (damaging the sea life) or in landfills with other waste.\nThe operation area of this proposal is Kumasi city in Ghana and initially, it will include institutions (government and private) to register and utilize the Cardano Recycling DApp. Hence, its initial impact will be in Ghana but if successfully executed it can scale to a larger area including other countries. \nAs the participants such as institutions, households, and recycling agencies will be using the Cardano Recycling DApp to access this platform, it will bring new users to the Cardano Ecosystem.", "q0r": 5, "q1": "The team is experienced and seems to be pretty qualified to undertake the work of this proposal. It also involves a few Cardano community members. It would have been better if they have provided the LinkedIn profile links of the team members. \nThe budget has been broken down into identifiable tasks and the tasks are clearly explained with details. It will help in subsequent auditing of the disbursed funds. The budget also seems to be reasonable. The proposer required additional funding which they will request through Catalyst after successfully implementing this proposal. \nThe plan and duration to complete have been clearly defined. It is realistic taking into account various steps of the proposal.\nThis proposal is likely to be implemented successfully as the team has the experience, clear vision and will have the support of the Cardano community.", "q1r": 4, "q2": "The proposal can be simply audited by following the weekly plan, as the tasks to be completed are laid out on weekly basis. We can follow the weekly progress and its result.\nThe success of the proposal as mentioned will be the functional Cardano Recycling DApp. If successful this DApp will be used by more than 10 institutions and as expected by the team by many households in the long run. We can also track other metrics such as how much waste is recycled, how many users are added to the Cardano network etc.,\nThe milestones are also clearly laid out as referred above. The weekly distribution of tasks will help the team members as well as the concerned people of the proposal. It will also serve as the key delivery dates.", "q2r": 4, "assessor": "z_assessor_1444", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1, "reply": "In the auditability note, the score given doesn't reflect the given rationale. \nThe assessor says that \"The proposal can be simply audited by following the weekly plan, as the tasks to be completed are laid out on weekly basis. We can follow the weekly progress and its result.\nThe success of the proposal as mentioned will be the functional Cardano Recycling DApp. If successful this DApp will be used by more than 10 institutions and as expected by the team by many households in the long run. We can also track other metrics such as how much waste is recycled, how many users are added to the Cardano network etc.,\nThe milestones are also clearly laid out as referred above. The weekly distribution of tasks will help the team members as well as the concerned people of the proposal. It will also serve as the key delivery dates.\" which's relatively a positive comment and thus requires a rating of 5 star as the assessor is unable to justify exactly why he had to deduct a star from the rating."}, {"q0": "The proposal is made to restructure a process that is used by recycling companies and communities in Ghana. Here it could be described in more pictures to optain a better understanding for voters that are not familiar with the internal company/community processes locally. A process map is therefor highly appreciated but all in all it does its job to adress a critical business solution in the recycling business that helps a lot of people and environment. Other challenges will be affected as well (Support for Africa, Nation buildg Dapps)", "q0r": 4, "q1": "A detailed project plan is shown with strong believes of a realistical time horizon. It needs to be mentioned more cleary that it is only one part of the project and there will be a second assessement with additional steps. The teams descriptions show a background and related role that gives confidence that the persons involved have the right criteria for doing the job. THe collective experience is missing here which would be a good indicator for achiving the project goal in time without major discusions or problems internally. The sucess is highly dependend on external cooperation of institutions  which makes it harder but still possible. Those risks need to be mentioned and quantified so steps can be streamlined if problems arise.", "q1r": 4, "q2": "Major KPIs and goals are mentioned and pointed out. Still, they need to be more pricise and give the community the chance to weight against. The statement: \"A good volume of transactions\" is not quantifiable. \nReally positive is the fact that the team has an own auditor on their side that can assist with questions that arise from the community and also guides the team along the way and is able to not only judge afterwards but already early in the process.\n", "q2r": 4, "assessor": "z_assessor_1476", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "We think the assessor is not being fair to this proposal as all of its negative claims were addressed in the proposal. The use of the language \":A good volume of transaction\" in our success definition is exactly the best way to put it as we can not estimate blindly the volume of transactions that is going to be recorded to the test-net by the end of the 3 months. Reason is that blind estimations, may lead to false claims and we wanted to avoid that hence the use of \"A good volume of transactions\"."}, {"q0": "This proposal adequately addresses the challenge. The problem statement provided\nby the proposers includes research data to back the assertion that “82% of used\nrecyclable plastics end up in the oceans and/or on the streets”. Waste management\nas it stands is a global challenge for most nations in the world. The creation of a\nprogressive web application; Cardano Recycling Dapp as a global innovation,\nencourages waste separation from various sources of waste generation to recycling\nagencies. In my view, it is excellent that the piloting of the project is test-driven on an\nexisting company with 5 years experience and on a regional level before scaling up\ninto the global market. The proposal’s inclusion of a roadmap on the application\nfunctionality and integration of the smart contract highlights its impact on the Cardano ecosystem. The use of the Cardano ADA as transaction currency expands the role of Cardano Blockchain in digital businesses. The project, I believe is impactful, and over time can scale up to include diverse recycling methods to solve the global waste epidemic.", "q0r": 5, "q1": "The first indication that the implementation of the project would run smoothly is its\ncollaboration with the Premier Waste Recycling Agency in Kumasi, Ghana. A digital startup working with an established institution with an established customer base\nintensifies how viable the business can stand. Also, the team’s variety in career\nexpertise and experience encourages a successful implementation of the project.\nFrom the proposal, key members in the team have the exposure and experience in\nBlockchain and modern technologies to shape the project's operations in the\nCardano ecosystem. Budget details cover the most important aspects of their business operations like; administrative costs, workshop marketing and advertising, bin\ndistribution and project management. I think this breakdown of operational costs over the specified timeframe should be extended to ensure that all challenges are\nmitigated while running. The stated challenge the group highlighted seems more of a goal to be achieved during workshops with institutions rather than an identified risk.", "q1r": 5, "q2": "The creation of a public functioning website, two weeks post-funding, progress\nreports and team auditing before submission, is an indication of the level of openness of the project and its auditability. Also, the team’s provision of outlined key metrics to check the progress of the project, that is, the level of patronage, high amounts of\nrecovered plastic waste and recorded transactions are the necessary indicators of the team’s success. With the sufficient information provided, I believe funding allotted to the team will secure the implementation of the project to match the SDG goals set for waste recycling and waste management. Cardano Recycling Dapp has a 3 months roadmap for team vision proposed within the first phase of implementation.\nMost importantly, piloting with an established waste company is a way to measure\nthe changes that the project introduces and the growth it generates in the set\ntimeframe. I look forward to experiencing the digitization of waste management and\nrecycling by the team.", "q2r": 5, "assessor": "z_assessor_1508", "no_vca": 8, "ne": 3, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Their goals through their desired platform are well presented in the beginning. They also mention the main features of their platform and their targeted personas with extensive research and impressive statistics. They also describe what they have done in their pilot program in Africa-Ghana and some positive results, showing the potential success of their project. They provide a further understanding for the community through some external links about relevant usecase and the driving force behind their project. \nThey have foreseen some main problems along with the root causes, therefore, offered some solution and expected outcomes. This section is presented in a logical order from predicted problems, main causes and finally viable solutions, allowing the community easily evaluate their solving directions.\n", "q0r": 5, "q1": "The project implementation has been divided into 3 main phases of every 3 months, helping the community get a broad overview of their activities. Their end goals are also provided showing their careful planning and preparation. Based on this timeline, they can ensure their project doesn’t go astray and generate the desired outcomes. \nA well planned budget breakdown is proposed according to their implementation plan. The community can easily understand what the required spendings are and assess the effectiveness of their financial management.\n", "q1r": 5, "q2": "Some revelant and measurable KPIs are listed in order to track the progress and the development of the project. These indicators are in tune with the objectives of the challenge, which enables the community to effectively examine the success and impact of the project on the Cardano ecosystem in general. They can add specific required number for each indicator in order to better define their success, benefiting the decision-making process.", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal fits the profile of the challenge and the proposers have a strong existing base in terms of having an existing recycling agency in the area Ghana that’s been running for five years already therefore alot of connections are already established with businesses and institutions in the community. Being an eco-conscious project makes it all the more appealing to funders and users alike.", "q0r": 5, "q1": "Having an already well established recycling agency that’s been up and running for the past five years gives the project the push it needs to be successful. Having existing contracts that are willing to participate in the project insures clients front he get go. The promis of creating a user friendly app that makes the collection of recyclables and communication between the provider and the user clear simple and on trend makes  this project highly attractive and appealing to companies and individuals alike. I see a globe wide spread for such projects is inevitable. Having the opportunity of being eco-continues and getting ADA in return all while using a simple app makes this project very appealing", "q1r": 5, "q2": "Having clear outcome reports available on the website that should be up and running two weeks after funding should insure transparency and clear communication through reports made public on that platform", "q2r": 5, "assessor": "z_assessor_1660", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "First of all, to talk about the proposed solution, I fully agree. They describe in detail the transaction process for all parties involved, emphasizing that the contract must be fulfilled within 24 hours to avoid the goods losing value. Furthermore, the integration of ADA-based waste pricing and transaction recording on the Cardano blockchain will increase the number of individuals who have access to this community. Furthermore, the collaboration with Premier Recycling Agency in Kumasi, Ghana, a recognized company, will undoubtedly boost the project's popularity and assure its success. Second, it is rare to see wastes are divided into separate classes in most waste-reduction projects. Meanwhile, this is clearly demonstrated in this project with distinct sorts of rubbish such as medical waste, food waste, and plastic waste, as well as associated remedies that I believe, are suitable. Furthermore, allowing users to communicate with one another via DApp will cut expenses while increasing mutual trust. Finally, while the solution to the challenge they raised is a little short and not particularly detailed, it can be addressed in general. Perhaps it is preferable to include more risks in order to minimize future bewilderment in the face of unanticipated problems.", "q0r": 4, "q1": "It appears that after missing out on fund 7, they have planned very meticulously for fund 8, from the budget to the team members. The items that must be spent are realistic and comprehensive; perhaps providing examples for the miscellaneous part would assist the sponsor in simply seeing how their money is being spent. Furthermore, with industry experience, particularly with senior members of companies in Ghana, can assist the project in grasping the challenge more quickly and easily. However, the plan and schedule described are not easily understood. They recommended splitting the project into two phases, however merely stating the first and disregarding the second will make the project not really neat. Therefore, adding will make it easier for both investors and proposers to track the project's progress.", "q1r": 4, "q2": "Having said that, the material in this part is more than enough to ensure a project's success. In terms of the success they want, it helps organizations become essential stakeholders in the Cardano community while also reducing waste. This not only benefits corporations, but it also has a significant positive influence on the Cardano ecosystem. Furthermore, the fact that at least ten organizations, both government and private, have contracted with the project indicates that the initiative's success rate is fairly high. However, rather than providing generalities, I advise the proposer to add particular statistics or percentages in the section monitoring project progress. This will make it easier for them and investors to see and track the project's development.", "q2r": 4, "assessor": "z_assessor_1713", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thanks for your fair comments, we appreciate the generousity in your work."}, {"q0": "The proposer has effectively mentioned how people can interact with agencies who collects plastic ,where sometimes people wont be having idea where to the dump the collected plastic\n The proposed model has clean goal in making contacts between the people/plastic collectors and agencies which recycles the plastic therefore the proposal effectively addresses the challenge", "q0r": 5, "q1": "Since the team provided has great experience in working, similar projects, It also assures the web work can completed by the end of first month where it next targets building of recycling portal and also mentions about completion signing atleast 10 colleges within the end of 3 months , the proposed model wants to have more and more interns in the future which will encouraged definitely in the future hence within great team provided the proposal can implemented successfully but within 3 months would be challenging one", "q1r": 4, "q2": "The proposer has clearly mentioned about the con that might be seen i .e it may take longer time and have a slower process.\nThe proposer has excellently mentioned about key metrics that he'll be accounting for his success ,and how creation of wallet can be utilized in more effective manner in the future, hence information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This proposal directly addresses the challenge question by creating \"a platform to connect institutions' (government and private)\" and has proposed a solution to create new b2b and b2g solutions.  The proposed solution will drive use and adoption of Cardano and add value to the Cardano Ecosystem. The proposal has clear plans to scale with a mobile app, and this could potentially impact a much larger global community. The proposal includes KPI's that are directly related to the challenge question. ", "q0r": 5, "q1": "The WADA team has a very experienced team that has a proven track record of success. They have outlined the team and their qualifications, and the team is well qualified to complete the tasks required to build and implement this proposal. As well they have provided a clear roadmap with specific measurable KPI's, and a detailed budget breakdown explaining how the funds will be used. ", "q1r": 5, "q2": "The objectives in the proposal are clear and auditable with specific KPI's and targets. However some (but not all) of the listed metrics will be difficult to audit, such as \"The number of institutions delegating their tokens to stake pools (optional to institutions).\nThe number of institutions participating in the catalyst governance process through voting (optional to institutions).\" It's not clear how the community would have access to this information, although it may be possible for the WADA team to obtain this information from institutions who volunteer to share this data. Overall, the success or failure of this proposal should be easy for the community to assess, as many of the requirements for success as they are given will be available to the community. ", "q2r": 4, "assessor": "z_assessor_215", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The key stakeholders of this business solution has been clearly described in the proposal; from the sources of the recyclable materials (consumers, businesses and govt agencies) to the end point being the business recycler. Their participation in this solution is the basis of my agreement that this does indeed belong to this Challenge Setting. That the DApp will be built on the Cardano blockchain further adds to this proposal's goals of effectively addressing the challenge and in a unique way as well. The technicalities and business processes described is not the common narrative you read in transactional blockchain processes. If successful, this model could be taken up by similar business problems awaiting that lightbulb moment on how to solve their own problems, meaning this proposal could pave the way for future ventures in other industries. That the proposal intends to test out the DApp, the processes and the participants in a localised and controlled manner is a smart decision. It could iron out unforeseen issues and perfect the B2B/B2C processes prior to the intended global deployment. A number of countries have on-the-ground solutions for their plastic recycling problems but there are still quite a few who do not, not because of the lack of trying but likely due to the lack of resources of establishing the infrastructure. This proposal has the potential to affect positive environmental changes and further increase Cardano adoption in real life situations. A win for our community and the world in general. Kudos team.", "q0r": 5, "q1": "I don't need to rely on my past experience as a tender assessor in the university sector to provide my full agreement that this proposal will be implemented successfully. I merely need to rely on my involvement with Catalyst as a CA since Fund 3 to know that the WADA team has the ability, credentials and motivation to see projects through to completion. It is still appreciated that they have listed each of the team members and their bona fides on the proposal, which reflect their professionalism and I'm sure also their intent to introduce themselves to newer members of the community who may not be as familiar with the quality of their work and their commitment to Cardano. Notwithstanding the clear presentation of their team, the way the proposer described the plan over the course of the comings weeks/months from reward distribution is reassuring and paints a clear picture that is rational and carefully considered. It demonstrates knowledge of the local players who will be involved in the business process. That they regrouped and re-planned the Catalyst approach after failing to secure funding in Fund7 demonstrates a level of practicality and doggedness in the pursuit of their goals. ", "q1r": 5, "q2": "As a former tender assessor in Higher Education, the proposal contains all the hallmarks you look for in trying to determine a project's progression and the impact it will eventually have, positively or negatively, when deployed.  The proposal clearly describes the KPIs and the measures for success. More importantly, they identified what success for the project looks like after 3 months post release. Admittedly, in imagining the lifecycle of this business solution whilst reading the proposal, I did not even think of the additional benefit of having participating institutions themselves becoming involved and embedded within the Cardano Community in much the same as we all are; as delegators. Given the project will result in its own website + a DApp, the final output is clearly auditable. However, that the team includes a specific auditor who will be tasked to report on the progress is commendable and provides assurance of its auditability. Knowing WADA, they are quite good at updating their main website of any ventures and achievements and I have confidence this proposal, should it be successful, will be  trackable from that channel as well. Good luck.", "q2r": 5, "assessor": "z_assessor_42", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "A huge percentage (82%) of waste(recyclable materials) ends up littering the environment so this proposal seeks to alleviate this menace by creating a platform to get all stakeholders(governments, private institutions and households) to come on board to properly mobilize and recycle to ensure a good sanitation for livelihoods,empower and provide more opportunities for individuals in the community and also positively affect the cardano ecosystem.", "q0r": 5, "q1": "This proposal having gone through fund 7 without getting funded, has done thorough checks and corrections to ensure that implementation takes off successfully and per the team of expertise could aid proper execution within a 3months post funding. Also the budget has been well structured as to how funds would be used appropriately during implementation.", "q1r": 5, "q2": "The proposer will create a functional and accessible website and also involve stakeholders(institutions,households etc) during every workshops/seminars held to indicate a form of transparency.\nThe number of cardano wallets  introduction to individuals, segregation of bins distribution  and every activity involving the execution stage has been clearly provided and therefore could be successfully implemented.", "q2r": 5, "assessor": "z_assessor_497", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "A platform that promotes the collection of plastic waste through propaganda, education, and locating plastic waste collection sites for recycling. Although this is not a project to directly develop the technology of the cardano platform, it is a great idea to protect our living environment, and help the community have a more positive view of a sustainable green development cardano. steady. Enthusiastic and experienced team in environmental waste treatment. Their approach and communication to the community is also somewhat close, easy to understand.", "q0r": 5, "q1": "Young, enthusiastic team. An easy-to-understand, accessible, step-by-step environmental communication plan. They plan to build a dapp to locate garbage pick-ups for recycling and to reflect the local state of the environment. About moderate budget costs. This is an encouraging project because I think it is feasible and humane. Because our environment is being destroyed and requires urgent, practical and unanimous measures of everyone at this time.", "q1r": 5, "q2": "They will report the results by the number of companies and customers that cooperate with the promotion of recycling collection, the number of participating communities and the number of successful transactions. Your group should have an official channel with propaganda videos, videos of garbage collection activities everywhere. That's what convinces us the most.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1, "reply": "We do appreciate your suggestion in the auditability note but that's essentially part of the tasks the website will be built to deliver. However, we hope you had time to enjoy the gallery of the proposal under attachments."}, {"q0": "In my opinion, the problem that the proposal wants to solve is a common situation, a global problem that needs to be solved. Currently, about 82% of used recycled plastic is discharged into the sea and/or on the streets. That wastes resources and pollutes the environment. The solution is to create a niche platform (progressive web application) where organizations (government and private) will directly connect their generated recyclable plastic waste with a recycling agency to encourage without any third party usually collects this waste for free. The proposal addresses this challenge by providing rewards and incentives to stakeholders (households, private and government organizations, and recycling agencies) in the recycling sector using DApps and smart contract. The creation of a DApp not only provides business solutions, but also eliminates middlemen and connects households, private organizations and governments directly with recycling agencies. Directly and indirectly, this proposal will create jobs and increase income for stakeholders involved in the recycling value chain. This proposal has great merit and merit and falls within the scope of this challenge. If the proposal is successfully implemented, it will bring tremendous value not only to Cardano but to the whole world.", "q0r": 5, "q1": "After missing an opportunity to receive funding from fund 7 because the budget required more funds than the challenge could finance, this proposal drew on experience in setting roadmaps and budget requirements according to each way more streamlined, and make it easier for the community to track and test. The proposal offers a three-month roadmap with weekly milestones tied to specific tasks. The $44,586 requested budget is explained in great detail, allocating straight to the target. The project team is sure of the quality as presented, the team consists of 11 members with defined roles. All members have a solid blockchain background and most of them are active members of the Catalyst community. The experience of the team is public and can be fully tracked through the information the proposal provides. The above shows that the transparency of this proposal, a clear roadmap, a reasonable budget along with a highly qualified team are solid foundations for the success of the proposal.", "q1r": 5, "q2": "I fully agree that the information provided is sufficient to gauge the progress and success of this proposal. The proposal to provide KPIs is very clear. Goals are clearly stated and can be used by the community to get a vision of short-term success. Additionally, risks are outlined, which gives the ability to note the risks involved while the community assesses the progress of the challenge. One good thing about the proposal team is that they split the budget and roadmap into two phases to ensure funding and the community can more easily track the progress of the proposal. If this proposal is successful, in fund 9 they will continue to complete phase 2 of the project. This makes it easier for the community to track the project through the results achieved from phase 1, so it will be easier to convince in the next funding application.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Taking used plastics out of the street has been difficult and that cities and peri-urban communities are chocked of plastics. The proposal seeks to create value for waste plastics collection through the incentivization using ADA as reward.\n\nDistance is also a problem by identifying where to sell the plastics and this proposal is building applications to onboard plastic collectors, make it a business and solving society's biggest threat. The proposal is aligned and would be an innovation to make people hold ADA in exchange for waste plastics ", "q0r": 5, "q1": "The team is well organized and very determined to innovate for change through business. The details and information about the team is evidence of having the capacity to deliver for real time impact. The budget is also well detailed show items and corresponding cost for the deliverables. \n\nThe timelines are of tight schedule but the team with much knowledge look poised for results and services through Dapp. ", "q1r": 5, "q2": "The KPIs are well detailed with clear metrics for evaluation. This makes auditing very easy measure outcomes in the process.\n\nThere is also sustainability plan to come back to the catalyst to continue the second phase as well charging fees through the services provided for maintenance. ", "q2r": 5, "assessor": "z_assessor_719", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposers have a certain passion that reflects in their proposal. They actually have cogent reasons backing their problem statement. From the proposal I could see that their  Cardano Recycling DApp seeks to establish a platform that would encourage waste separation from various sources of waste generation, including institutions (private and government) and recycling agencies. The proposal addresses this challenge by way of providing rewards and incentives to stakeholders (households, private and government institutions, and recycling agencies) in the recycling sector using the DApp and smart contracts.\n\nAgain, the creation of the DApp according to them does not only provide business solutions but also removes middlemen and directly connects households, private, and government institutions to recycling agencies. They further makes it known that smart contracts establishes a relationship that enables households, private and government institutions to separate waste from its source as consumers, and the DApp creates an avenue to exchange plastic waste for incentive. This challenge in effect actually can be addressed by the proposed solutions.", "q0r": 5, "q1": "From what I went through in the proposal, the experience and plans presented is highly likely to be implemented successfully. There is a clear milestone hence giving a very straight forward vision for the project execution when funds are released. \nThe roadmap set by the team, which is a 3-month call to action. However, the team, after successful implementation of the first phase, would put together another proposal to seek funding to complete the second phase of the project. \nThe proposers also provided adequate information on the team. The team I must say is rich in experiences from different backgrounds. This will ensure that they are able to get the needed expertise when given funding.\nThe budget allocation was also well thought through. I am however of the view that if they can suggest in their proposal how they intend to self- sustain the project beyond the fund 8. How are the various collaborating institutions willing to partner to ensure the project becomes a success?\n\n ", "q1r": 5, "q2": "I am impressed about the proposers for a Cardano Recycling DApp. I believe it's a good one and is worth commending. They provided 10 Key Performance Indicators and they were self explaining with ambiguity. \n\nOn how to define the success of the proposal, the proposers definition of success would be to see institutions become shareholders of the Cardano community by delegating earned tokens (incentives) to stake pools of their choice and further contributing to the catalyst governance process through voting.  With this I am sure the auditability of the progress and success of the proposal is attainable.", "q2r": 5, "assessor": "z_assessor_925", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create a platform to connect institutions' (government and private) recyclable plastic waste to recycling agencies.", "experience": "The project will be supported, mentored, and executed by Premier Waste Recycling agency (more than 10 years of experience), Wada, PWA developers, Plutus pioneers, and Haskell developers with the goal of ensuring recyclable plastic waste ends up in recycling hubs for recycling."}