{"id": 400097, "author": "kenoyenaku", "title": "Licensing Remixed Music On-Chain", "url": "https://cardano.ideascale.com/a/dtd/400097-48088", "category": 26445, "amount": 80000, "description": "Most remixes are unofficial, creating revenue leakage for the original Artist and limiting the potential of a remix / mixtape.", "f6_no_assessments": 4, "f6_rating": 3.916666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 764, "q0": "This proposal seems well aligned with the challenge criteria. Paradime audio showcases a Minimum Viable Product (MVP) or beta version of the application within the proposal; demonstrating their progress, the application for remixing, and illustrating the general ease-of-use for wide range of users - skilled or unskilled. The website was easily accessible and usable. \n\nThe problems that this proposal aims to solve could have been made a bit more explicitly or explained in more detail. They did explain some details in the main challenges section; and thanks to very good friends/family who are musicians and being sympathetic to the exploits of the music industry, I can see that this project team has a solid grasp of the issues/problems facing musicians. Yet, for those readers who may not be acutely aware of how bad it really is, it would probably benefit the readers to have a more thorough explanation of the major hurdles for musicians and remixers. For example, some data about the number of unauthorized remixes that are put on YouTube every year and the revenue lost for both artist and remix artist would help illustrate how powerful of a solution Paradime Audio is creating. \n\nParadime Audio describes a business use-case for music on the Cardano blockchain that I am not aware of on any other blockchain. This seems like a really attractive opportunity to draw new creative talent to Cardano through this innovative business. It also seems like it would synergize REALLY well with some currently developing music streaming solutions (such as NEWM) being built on Cardano. And I think the innovative ideas such as the remix competitions has potential to draw a lot of attention to their project and Cardano. This seems like a highly attractive opportunity for anyone with a musical talent, whether professional or hobby.", "q0r": 5, "q1": "Paradime Audio appears to be adequately skilled with technical know-how to build what has been completed so far. They also explain specifically what they are looking for in order to achieve milestones for this proposal. The partnership with Canucks Publishing seems strategic and aligns Paradime with some strong additional talent. They have a thoroughly articulated plan for the full scope of project and for the term of the proposal.", "q1r": 5, "q2": "Paradime Audio is presenting a solution that seems like a strong Win-Win-Win for artists, remixers, and fans. \nThe team articulates their roadmap quite clearly. And specifies how the project updates can be followed. Their social media presence does appear to be active and communicative with their following. They've identifying their barriers and the technical talent needs in order to achieve specific milestones such as implementation on Cardano. \nAn acronym was a plugin referenced by acronym (I'm assuming), VST, which didn't have a long-hand form, that would be helpful to have explained for readers. But otherwise the roadmap seems realistic and achievable. \nParadime Audio is presenting a solution that seems like a strong Win-Win-Win for artists, remixers, and fans. \nThe team articulates their roadmap quite clearly. And specifies how the project updates can be followed. Their social media presence does appear to be active and communicative with their following. They've identifying their barriers and the technical talent needs in order to achieve specific milestones such as implementation on Cardano. \nAn acronym was a plugin referenced by acronym (I'm assuming), VST, which didn't have a long-hand form, that would be helpful to have explained for readers. But otherwise the roadmap seems realistic and achievable. \nThe budget was a little general but within reasonable limits. I would have expected legal services for a project such as this one with music rights to be on the higher end of the range provided, as well as the marketing and promotion costs. So I think what is being asked is perhaps a little conservative. \nI found myself wanting to hear more about what success looks like when this system is fully operational. If this proposal should be selected for funding, I would encourage the team to convey a strong vision for what it looks like when fully implemented and thriving in the Cardano ecosystem. ", "q2r": 5, "assessor": "z_assessor_1195", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 3626, "q0": "The target audience of this project is artists. This seems inappropriate with the challenge given as the challenge is finding solutions that can solve businesses' needs. Having said that, it gave a detailed description of the solution mentioning its functions, features, and how it operates. It showed how impactful this solution is to the artists by listing and analyzing all of the benefits it would bring about. A lot of technical emphasis was mentioned to clarify this part. Explanations in terms of technical aspects of how this solution will protect artists from being taken advantage of their works were given as well. It also pointed out how this solution is different from other similar platforms. However, this seems to promote not only Cardano but other blockchain platforms namely, Polygon, Ethereum  as it permits users to choose the blockchain they want Mint tokens for. This is not what the challenge is seeking as the challenge aims at finding a Cardano-based solution. In conclusion, unfortunately, this project is not suitable to the requirements of the challenge as its solution does not aim at businesses’ needs but artists, and the solution is not solely based on Cardano but other blockchain platforms.", "q0r": 2, "q1": "The plan and the timeline given are quite detailed, but it could be improved by breaking down each phase into smaller milestones, mentioning the plan of what should be done each month, for example. More technical information should be added in describing each small step as well. It listed the cost breakdown for each activity and how long it would be used for. However, it was not so detailed. It would be better if how to calculate the cost was given too. For example, the cost for developers used for 3 months. It should clarify the salary is paid for how many developers and it is calculated by hours, weeks, or months. About human resources, this project is corporate with Canucks Publishing, a development workshop, which has acquired a reputation for launching quality products and enthusiastically engaged in Cardano Community. Besides, it is led by an experienced team. A product manager with over 15 years of experience in database, marketing, design, and development. He would plan an important role in building an excellent product for this project. All the information related to his background, his achievements, his previous projects were mentioned in great detail. A technical Architect is another outstanding person in this project. He has over 17 years of experience in software development and architecture for several companies. His rich and profound experience would also be beneficial in operating this project successfully.", "q1r": 3, "q2": "What the proposal provided is not enough to measure the progress and the development of the project. It seems to be vague to track, trace, and audit it.  Instead, it should mention measurable indicators, KPIs, or key metrics of each period of the project. This will help sponsors know at a certain milestone, what should be achieved and what should be done next, evaluate the proceeding progress of each step. About the description of success, it is quite general. In fact, more figures should be added to make it clear and specific. It could be numbers that can help evaluate the success of a product or service of this project or a part of it. Besides, it should indicate this is a completely new project or a part of any that used to be funded", "q2r": 2, "assessor": "z_assessor_1665", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4809, "q0": "An exhaustive explanation of how the project works. They really care about their users and take extra steps to protect their users’ work. This mindset in the long term will create loyal customers. They also did some thorough research of the market and their competitors. Obviously, the team is conscious of their competitive advantages as well as the risks they might face pursuing their goals. This part of the proposal was complete which makes me believe in the potential of the project.", "q0r": 5, "q1": "The roadmap has 2 phases, in each phase listing all the work to be done. This timeline wasn't detailed enough, there should be clear deadlines for each work. For example, the duration of the remix contests, when will it start and the goal of this contest (how many contestants will get involved, etc). The proposal would be more convincing if the team mentioned their plan to make users engage more with the Cardano blockchain.\nThe budget breakdown is fair enough.\nKey members of the team are people with many years of experience and all are active supporters of the Cardano community. However, the team still needs some additional developers as specified in the budget breakdown. The requirements of these additional developers should be included too. The same goes for the UI/UX engineer and marketing manager.", "q1r": 4, "q2": "The team should provide some quantitative measurement metrics that relate directly to the Cardano blockchain to show how this project will help the Cardano community grow. Other than that, their goals are achievable.", "q2r": 3, "assessor": "z_assessor_1775", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 5529, "q0": "The proposers are building a platform, Paradime, that will allow musicians to publish, mint, and sell the rights to remix and resample their music in the form of NFTs (Non Fungible Tokens) and to those who purchase the NFTs to gain access to various remixing and sale features, available only on Paradime. The platform will be available on several blockchains, in order to offer flexibility to artists and their fans, starting with Polygon, then with Cardano and several others as the project expands.\nThe impact of this project, if successful, could potentially be considerable, both for music artists as well as for the Cardano Ecosystem, as it could attract not only new people and businesses into the blockchain and Cardano space, but it could lead to a multitude of other dApps and platforms being developed.", "q0r": 5, "q1": "The plan and subsequent timeline are comprehensive and honest (the proposer admits he doesn’t have sufficient experience to build on Cardano alone). They are split in two phases, each phase focused on a single blockchain, starting with Polygon as the developer has experience with Solidity only, and then in the second phase, from June to September, the focus will be to implement the platform on the Cardano blockchain.\nThe budget is sufficiently broken down, and naturally covers the development for the Cardano blockchain only. A lot of departments have been taken into consideration, besides development - Haskell and React - there is budget for web services/servers, user experience, legal and marketing. The amounts are reasonable and realistic and can lead to achieving the desired goals.\nThe team has provided ample information regarding their skills and previous work, unfortunately they have not provided any third-party links for verification.", "q1r": 4, "q2": "The progress measurement is not very detailed and concise, but it has sufficient information to be considered viable. However, the success description is very general, has no identifiable measurements and milestones, that could help the community assess the positive outcome of the project - for example: how many artists sign up on the platform in XX amount of time, how many remixes will be sold etc. However, the proposal is comprehensive enough in all other sections, as such, the lack of an identifiable milestone of success is not very detracting from the rest of the proposal.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Allow artist to sell the rights to remix and sample their music via NFT's. Allow creators to remix commercially | monetize | pay royalties", "experience": "Full Stack Engineer with 8+ Years experience\n\n5+ Years in the music industry as a Producer and Recording Artist\n\nWorking MVP / Beta\n\nSolidity Development Experience\n\nWorking beta (Launching on Polygon end of April 22)"}