{"id": 400269, "author": "guillermo.lucero", "title": "@energiasocial powered by cardano", "url": "https://cardano.ideascale.com/a/dtd/400269-48088", "category": 26445, "amount": 25000, "description": "There's a negative outcome from the interaction between energy generation and users in today's modern social structure", "f6_no_assessments": 4, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 255, "q0": "Energy creation and distribution is critical to improving communities and nations, especially in LATAM where this proposal is focused. The proposer brings a  full cycle focus, which is important to form a well rounded approach to the full market, creation, distribution and consumption. This proposal outlines general challenges & risks, and seems to be a broad vision which can bring a HIGH impact, but the lack of project specificity brings the overall impact down. ", "q0r": 4, "q1": "The organization seems to be an established company with technical execution abilities for the hardware involved. There is very little detail on the plan or the specific project focus they are starting with from their 3 main stages of the electricity cycle. In regards to budget, details are lacking here; I would like to see how their budget is deployed across the needs of a specific project, thus requiring a deeper project scope. I would encourage the proposer to focus to a first step of this vision with a clear project scope, it is a worthy cause! ", "q1r": 2, "q2": "There are no KPIs associated with the Challenge mentioned and they define success strictly as their own company’s success. It’s clear that more work should be done defining the value for the Cardano community along with metrics for voters to track long term.", "q2r": 1, "assessor": "z_assessor_1122", "no_vca": 12, "ne": 2, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 574, "q0": "Great problem to tackle and awesome solution for it, completely addresses the challenge objectives. The proposal clearly explains the 3 main uses of the technology. As a plus, for future reference I would add a little more on how it would add to the Cardano ecosystem, bringing more users, allowing businesses to invest in blockchain technology, etc.", "q0r": 5, "q1": "I´m impressed with the team provided, the team seems very capable of pulling this proposal of. The business shows experience of work done and looks like a well established business in LatinAmerica and is aware of the team missing to complete the project.\n\nI think the timeline could use a little bit more explaining: \"Six month gol, By the end of september 2022 have a @energiasocial #GEN_USR beta platform online\" What will be done in the middle, do you have a plan for that yet? The proposal would benefit of more explaining on that 6 month period. If the plan isn´t clear you could add tasks like: Team Assemble (you did this well), Research and organization, prototype, development starts and BETA Release. This will give the voter and yourself a little bit more clarity on the timelines to complete and organize all the information.\nAlso a clearer breakdown on the budget would be appreciated, its okey to estimate on costs but an approximate should be given in salaries, hourly rates and if possible hours of work and weeks/months needed, do you have promotion costs in the budget? Do you need a 2nd Proposal for completion? After 6 months what will happen with the beta? Will it already be self sufficient? ", "q1r": 4, "q2": "KPIs are a key part of Catalyst proposals, but its important to mention when do you expect to hit certain goals and give measurable numbers. \"Generating renewable energy, KWH quantifiable unit in CO2 emissions avoided.\" This is a good Indicator of progress, but how much are you expecting? for when? \nThe proposal would benefit from measurable objectives in time goals for them.\nWhat will you post on Catalyst Discord? If you write which metrics you will be following in the reports it will be easier for the community to measure progress", "q2r": 3, "assessor": "z_assessor_1190", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6388, "q0": "The proposal deals with an issue that deserves atention and sugests a innovative way to contribute to solve it. A challenge the proposer pointed is the risk of not finding people to develop the platform, implement and use the block chain technology. This is a big concern and I think the proposer could present some ways to mitigate this problem since it can harm the project success as well as the proposal impact. If well implemented, the proposal can scale to adress future challenges. ", "q0r": 4, "q1": "The proposal explains the kind of professionals and their formal education and experiences the proposers need to complete the team. The current team seems to understand a lot about business and sustainability and that increases the chances of success of the project. The proposers pointed a milestone of creating the beta platform online in 6 months but we don't know how much time the team would get to be completed (with all the necessary members to work in the tasks), how would the current members deal with the possibility of not finding the right people? I think that's a risk that should be studied as well as it can be reasonable to create a plan to manage and mitigate this kind of risk. Another question is: why the members have divided the budget in 6 equal parts? What if they divide it by tasks? That's only a idea that I think would helps us to understand better how the requested funds can be used. ", "q1r": 3, "q2": "The proposal describes clearly a global problem to be solved and a reasonable solution, in my opinion. I think the proposers could think about what could be measured in the project through numbers or percentual and from there create some KPI's to help both team and the community to be able to check the project progress. Some example of indicator can be the number of days a project phase is late, the number of people joining the idea in a month, etc. With some coherent KPI's it's possible to measure the project progress and success. To conclude, there is only one milestone to achieve (the beta platform online creation). I want to ask the proposers if there aren't other milestones to reach in these 6 months. ", "q2r": 4, "assessor": "z_assessor_409", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8164, "q0": "According to the proponent, there is a negative outcome from the interaction between energy generators and users in today's modern social structure. The solution to this problem is @energiasocial a Renewable Energy Social Company. Add impact to energy by scaling in LATAM, a renewable energy social company in DAO format / Decentralized Autonomous Organization / in CARDANO Blockchain where every KWh is generated by the community @ #GEN_USR social energy or solar park / eolic representing USD will be converted to ADA. There is clarity in the description of the problem and the solution presented and proposed is appropriate to the challenge. The proposal would address the challenge by creating a decentralized, transparent, autonomous renewable energy social company controlled by institutional members to reinvest profits in research and development of urban sustainable development strategy. In my opinion, this proposal is a great idea. The proponent has stated a lot of risk factors that can be encountered during implementation, it would be better if they have solutions for the possible risks. That helps the community have more confidence in the capacity and problem-solving direction of the project team.", "q0r": 4, "q1": "No blueprint or milestones, just a general estimate for 5 months with milestone start and end dates without detailed teaming and detailed efforts. The required budget for the project is $25,000, which is also explained in a very general way. As shown, the budget will be divided into 6 equal parts of 4,166.66 U$D, which will be invested in manpower/hour to develop the #GEN_USR platform + #GEN_USR Communication Strategy. It would be better if the budget describes each cost associated with a specific purpose, for example, how many people are involved in the implementation of the project, the role of each member, the salary paid for each position. how much. What channels will your communication strategy be through? The more detailed the explanation, the easier it is for the community to track the progress of the project. The project group is also not described, the proposal provided a Linkedin link to the @energiasocial group I went to that link and was told this group has 11 members, but unfortunately for some reason I am not on I have the page of each member so I don't know who they are, have the right experience and qualifications to take on this project. Sorry for that.", "q1r": 3, "q2": "While there was a section describing success indicators, it missed a concrete road map with key milestones and a tentative timeline for delivering a solution. Unfortunately, the proposal doesn't provide enough information to gauge progress and success, roadmaps, milestones, team descriptions, deliverable specifications, all of which are lacking. To me this is a good idea poorly presented, if the fund goes unfunded, hopefully you'll keep coming back to the fund later with a better presented proposal.", "q2r": 3, "assessor": "z_assessor_654", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Energy with purpose\n@energiasocial a Renewable Energy Social Company \nA DAO in the CARDANO Blockchain where each KWh generated = USD = ADA ", "experience": "From the union of @EnergiaSocialAr & Ventus Energía, a renewable energy social company is born with more than 3000 MW installed and presence in 4 countries in the region. A social emterprise where the profits are used for the generation of resources and added value with puspose."}