{"id": 400456, "author": "nititoken", "title": "NITI: a new design for exchanges", "url": "https://cardano.ideascale.com/a/dtd/400456-48088", "category": 26445, "amount": 65000, "description": "The current exchange design is clearly built for traders - every newcomer right now has to think and act like one, which is inefficient.", "f6_no_assessments": 5, "f6_rating": 3.1333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 4219, "q0": "The proposal aims to dedicate a mobile APP that allows users to buy tokens from traders, which is called NITI. However, the team should share additional information, and in this case, I believe it should be about how they intend to connect NITI to the Cardano blockchain. According to the team, NITI is a mobile-first exchange that allows good traders to monetize their abilities and allows normies to pick traders based on actual performance, which is a very exciting and ambitious idea. Personally, I see that as a green light. The team had anticipated some challenges along the way and had well-thought-out strategies to deal with them and make the best of them. Despite the fact that I generally agree with the proposal's alignment with the challenge aim, no impact metrics are provided, keeping me from making an appropriate assessment. There is also no discussion of the anticipated impact of the implementation. Overall, the proposal has a lot of potential, and it would be more credible if more specific facts were provided so that all readers could understand it.", "q0r": 4, "q1": "The project timeline is written in a simple paragraph that includes what will be completed by the time and when it will be finished. I would propose that the creator of this include more details on how to achieve the stated goal of each phase. I still believe it is reasonable, well-defined, and capable of meeting the stated objectives. According to the proposal, there is already one individual dedicated to this project, who is also the proposer. I am confident that the individual behind this concept is serious about what he is doing, and I admire his confidence as well as his enthusiasm for blockchain. However, I believe it would be beneficial to include some references, such as examples of previous work, LinkedIn pages, and other types of information, to inform the reader about the background. Furthermore, there is no mention of building a team, so I'm left wondering if he intends to do everything on his own. Due to the small number of team members and the proposer's lack of experience (as nothing to present his successful initial work in terms of blockchain), this makes the project somewhat risky in terms of feasibility. And if he just forgets to provide his idea on how to establish a team, I would recommend including how many individuals are required, the standards required for each specific position, what are the tasks to contribute to the implementation, and some other background information (to ensure readers about their competency or acknowledge, maybe verifiable sources would greatly do wonders). About the proposal's budget, which seems to be quite short of what is being proposed here, budget allocation seems vague to me. I would have liked to see a more in-depth explanation on how and when the project plans to market the app as stated in the proposal \"Out of the 65k, about 10k will be used for marketing efforts\". Also how about the other opponents of the budget breakdown? With detailed answers to those questions, it would increase the transparency and credibility of the proposal.", "q1r": 3, "q2": "According to the author, weekly videos will be posted to share what is going on with the project. In order to promote transparency, I would appreciate an explanation of which platform the community can use to track the project's development and progress (Twitter, Instagram, Youtube, dedicated community page, etc). A brief definition of success with no mention of success measures, which provides nothing to assist auditors in keeping track of the process, will jeopardize the project's auditability. It would be highly beneficial if the proposal also included a detailed plan for marketing in this. Overall, because a lot of information is missing, I disagree that this proposal provides me with enough information to assess progress toward its stated goals.", "q2r": 3, "assessor": "z_assessor_1712", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1623, "q0": "A completely new idea in the crypto trading space, an exchange where newcomers don't have to worry about trading knowledge or methods and can still achieve efficiency through copying trades from successful traders. I appreciate this creativity, but it's not easy to implement. You have to compete with cryptocurrency exchanges that now have built-in facilities for investors to copy portfolios from other traders. Do I suggest you write more specific solutions to this challenge, and how does your platform help your clients reduce risk?", "q0r": 3, "q1": "I agree that building a new exchange that can tokenize a trader's portfolio is very difficult and requires a lot of work. However, I suggest that you list out each item of work to be done in more detail, your work schedule is still very general. This helps you visualize the work to be done, the work that arises so that you have a backup plan. And investors look at this blueprint of yours to have a basis for funding your project. Regarding detailed budgets, I also recommend that you list out a specific budget for each work item with a specific cost. For example, the marketing cost is 10k USD, in which the cost of organizing the conference is xxx USD, the cost of communication on social networks is xxx USD, the cost of printing leaflets is xxx USD. This will help you have a better basis for successful fundraising.", "q1r": 3, "q2": "I feel your enthusiasm and energy for this project. However, specifying the metrics here will be necessary to measure progress to gauge your success. I would suggest you to add figures on the expected revenue when the exchange goes mainnet, the number of partnerships you have reached, how many app downloads on the store when the mainnet is successful.", "q2r": 3, "assessor": "z_assessor_1394", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3628, "q0": "The proposal did a great job in listing the main features of the proposed products and showed their targeted objects which are professional traders and unprofessional buyers. Its product is just like a mobile app allowing normal people (unprofessional buyers) to buy the professional trader's portfolio. It also showed how this solution will affect the targeted objects. Thanks to this app, the buyers don't need to spend much time learning all the needed skills and follow the market 24/7 will own crypto easily by buying traders' portfolios and traders will be able to monetize their ability from selling their portfolios. However, it didn't include information related to how it will affect the Cardano ecosystem. It was a bit confusing when it came to the challenge of this project as it mentioned how difficult it is to find a cheap developer and it suggested hiring expensive experts and training young developers to save cost. But after that, it mentioned the labor cost in Brazil is very cheap. Therefore, if it mentioned the cost of hiring people except developers is cheap, then it would be more understandable.", "q0r": 4, "q1": "The given plan was not detailed. A more detailed plan with a clear timeline including each small step in the process should be mentioned. Now, everything mentioned seems to be unsure and unclear enough to persuade sponsors that this project is totally feasible. The proposal just mentioned the budget spent for marketing purposes and other costs were not mentioned. Then,  it listed what will be proceeding, which is supposed to be mentioned in the detailed plan. Therefore, it would be easier to follow if the proposal was structured separately between how they allocate the budget and the plan. And how the total budget allocated for different activities should be stated clearly as well. A highlight here is the CEO of this project. He was rated as the number one engineer in Latin America. However, evidence for that was not provided, a reference link or any kind of sources such as some successful projects that he handled were highly evaluated by experts in the field should be added to prove that. The CEO of this project seems to lack hands-on experience despite the fact that he had a passion for blockchain and desired to exploit the potential of this field. Besides, the proposal didn't suggest how many staff, their role, experience it needed to operate the project successfully. All in all, with lack of a lot of information needed, it decreased the level of feasibility of this project.", "q1r": 2, "q2": "The proposal suggested they would post a video on social media sharing what has been done in a week. However, the plan didn't show any information about what would be done in a week, and there are no KPIs for that as well. Therefore, it would be hard to audit, track and trace the progress of this project.The result for this project was stated, but the criteria to measure its success were not given. Also, I didn't mention this is a new proposal or it was funded before.", "q2r": 2, "assessor": "z_assessor_1665", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4784, "q0": "The proposal includes a clear statement on how to achieve this impact by addressing a specific problem, which is to drive a conscious community and promote Cardano's capabilities to assist in solving critical aspects of empowering newcomers to buy traders tokens, providing great data, and a simple UI. The concept is excellent and well connected with the problem. The well-stated problem appears to exist, as the volume of fresh knowledge is expanding rapidly. Having a platform allows good traders to monetize their skills and allows normies to select traders who join the community and project teams based on real performance. Furthermore, it would be useful to know how the platform aims to become self-sufficient in the future. If members would have to pay a membership fee if it included advertisements and so forth. Of course, this is most likely the result of a market analysis conducted during the project phase, but it would be interesting to learn what proposers are thinking today in order to gain some insight into the current considered business strategy. Finally, a communication strategy from this platform to the Cardano community would be really welcomed. How does the platform intend to engage, connect, and keep newcomers and funded proposers? What channels will it employ? Overall, a really valid and well-written proposal.", "q0r": 5, "q1": "The proposer states to have extensive expertise in both engineering and explaining blockchain technology, as well as familiarity with AI, Cardano, and Catalyst. However, it would have been really good to see this experience validated on an external site (such as LinkedIn) or some type of reference of how the team was participating in Catalyst throughout this moment. Because there is only one person devoted to this project, it is a little hazardous in terms of technical feasibility (thinking about the quality and low experience from the proposer). I believe the proposer should seek out more partners who are similarly interested in this topic. There is a strong strategy in place to develop the technology, but I would like to see more specifics in the business/expansion plan, especially if we are talking about investing in a firm. Some actions may appear to take a bit longer than they should. The budget breakdown is reasonable and fair.", "q1r": 4, "q2": "I cannot agree or disagree that the information supplied here is adequate to assess the development and effectiveness of this project. For the most part, the primary measures are not quantitative, but the success criteria are appropriate. To enhance the problem, clearly define how the success criteria address the difficulty and how metrics might track progress toward the success criterion. It would be preferable if the difficulties section also included a thorough risk assessment", "q2r": 4, "assessor": "z_assessor_1772", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5534, "q0": "The proposal’s objective is to build a tokenisation of traders portfolios, meaning that newcomers, instead of coming into the crypto space buying different crypto assets from exchanges, would now be buying the token of a “professional” trader, that would presumably go up in value based on his/her trading performance.\nThe proposer starts from the presumption that almost everyone new coming into the space is incapable of taking good decisions “Normies are nowadays desperate” or “They are not traders, and we shouldn't pretend they are” and based on this assumption, he has developed this tokenisation proposal, as to make it as simple as possible for everyone to make money, without having to do any kind of research. This goes against the thinking of web 3, crypto and most importantly Cardano, where the community places a great importance on research and collaboration.\nAs such, I cannot assess the impact of this proposal as being positive among the Cardano community members and ecosystem.", "q0r": 1, "q1": "There are some contradictory statements throughout the proposal, for example: the proposer admits “We'll need to hire somewhat expensive experts and train young developers. That's not easy to do and it requires a bit of money” implying that the project will take some time (finding and teaching developers Haskell/Plutus is not a rapid task) but later on goes to say “ It is hard to give predictions for a project like this … we're pretty sure that we can get the Beta out in September with the funding”. If the team is not yet assembled, how can the proposer guarantee such fast-tracking of the project? Otherwise, the timeline conveys the major phases of the project, if the contradictions are not taken into account.\nThe budget goes into a deeper dive of the ICO(s) and the tokenomics structure of their token, but the budget is not explained at all, there is only one single sentence regarding it “Out of the 65k, about 10k will be used for marketing purposes”, but there is no further explanation of what the rest of 55k will be used for.\nThe proposer has written a short paragraph describing his previous work, but has not offered any third-party links for verification. The rest of the team has not been portrayed, what exact skills and how many people would be necessary to complete the project.", "q1r": 2, "q2": "The proposer has committed to posting videos on a weekly basis for reporting, to maintain the Github with commits, and has promised to allocate 45min of his time every week to talk to the token holders (of his token, not of the traders). As progress metric, these actions can be considered valid and provide sufficient detail into the advancement of the project. The success description is succinct, but realistic, considering the aim of the proposal.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We propose NITI: Tokenization of traders portfolios, which empowers new-comers to buy traders tokens, providing great data and a simple UI.", "experience": "I'm a programmer at heart, and a business graduate from FEA-USP (best rated latin american college). I used to work for Nestlé, at the Blockchain and AI department (since 2019). They used blockchain mainly for marketing reasons. I decided to quit and do my own project. Here I am."}