{"id": 400466, "author": "proofspace.nick", "title": "R&D for mental health credentials", "url": "https://cardano.ideascale.com/a/dtd/400466-48088", "category": 26445, "amount": 19936, "description": "Coordination of mental health care in the USA is constrained by lack of portable and mutually sync’d record between a patient’s providers", "funded": 1, "upvotes": 31926544, "downvotes": 10326623, "votes_result": 21599921, "votes_cast": 107, "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1875, "q0": "This is a feasibility study, for a real world problem of mental health patience communicating with their psychiatrists, psychologist and physicians and the creation of a true and verifiable communication between the specialists and the patient. The proposer wants to solve this trough a “minimum patient file” with the use of verifiable credentials with Atala PRISM.\nThe proposal is narrowed to the research of the need in student population patients because at the moment there is a program between the university, university mental healthcare professionals and the students. According to the proposer, this kind of opportunity is very rear. \nThe proposer has an invitation from the university to participate in the study and integrate their own research in to the existing program.\nThe proposal goal is to gain deeper understanding of the needs of the parties, design and improve a solution prototype.\nThe proposal will result in a summary of the research findings and a validated solution prototype.\nThis proposal is the beginning of a larger project, but this is the scientific foundation on which the whole Cardano blockchain is built. \nThe project aligns perfectly with the challenge objectives and with further development will hit the challenge measurable.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposer presents a clear, detailed and actionable plan with a roadmap and timeline attached.\nThe proposal outlines several problems and presents mitigation strategies for them.\nThe budget presented is reasonable for achieving the goals of the proposal. The budget is not very detailed but sufficient for the project to outline the categories of spending.\nThe proposer presents the team well, but fail to provide links to relevant CVs or linkedin profiles. However this project is important, so I have spent the time to find and provide these links to the voters for history check if they see the need. \nhttps://as.nyu.edu/faculty/andre-fenton.html\nhttps://www.linkedin.com/in/nick-mason-762316b/?originalSubdomain=uk\nUnfortunately I have found only two definite matches, but this should bring enough credibility.\nI strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer will make monthly Catalyst reports and end of project report. The proposer clearly outlines what will be shown in each of the reports and the months for which these reports will be made and presented.\nThe proposer includes a F9 proposal draft for the implementation of the prototype solution designed in this funding round!\nThe success criteria are very well defined and measurable as well. \nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n\nDear proposer, congratulation for the great idea and the perfect presentation. The assessment was a pleasure! Please consider the development of the other area of need you have discovered, the psychedelics assisted therapy. Lately the research in this area is accumulating and there is a reasonable hope for the legalization of these therapies. I hope you will find the time in the near future to develop this idea further.\n", "q2r": 5, "assessor": "z_assessor_1417", "no_vca": 8, "ne": 4, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 4244, "q0": "I appreciate how straightforward the initiative is in identifying its objectives, target audience, outcomes, and the influence it has had on the Cardano community and users alike. College students are generally more vulnerable to psychological instability than other age groups, particularly those studying away from home because they must take care of a lot of things on their own, from living expenditures to occupation and learning at school. Perhaps this is why I believe the functionalities listed in this project are absolutely appropriate for the audience they are aimed at. Even the proposer, who has spent more than a year researching names, connections, and relationships among university mental health specialists, demonstrates that they have properly prepared for the proposal before posing it on the Cardano ecosystem. Furthermore, the usage of Atala PRISM's login information will undoubtedly improve Cardano's reputation in the United States. I also enjoy how they come up with solutions to future challenges. Exceptionally detailed and pertinent!", "q0r": 5, "q1": "A good project, by definition, has a good plan, and this project will as well. The proposal is planned for three months and included precise numbers such as 100 parents, pupils, and caretakers. Furthermore, the project is not only preparing for fund 8, but it is also ready for future deployments in fund 9. Indeed, being able to go to such intricacies is undoubtedly owed in part to the project's team. The project has a high-quality staff, especially Prof. André Fenton, Ph.D., who is a senior member of the US National Institute of Mental Health Leadership. The route to project achievement will undoubtedly be far more favorable with the complete cooperation of the personnel. Even the expenses are listed very carefully. Proposer also calculates the number of interviews and internal travel hours required to arrive at a certain budget amount. With such determination, I wish the project will achieve what they expect.", "q1r": 5, "q2": "Overall, I’d want to applaud the entire team for meticulously planning the project down to the last detail. The evaluation process is broken down into months, which substantially aids investors and the entire team in precisely tracking and analyzing development progress. The successful forecasts are also totally realistic given the project's functionality. I'm sure they have worked really hard for such extensive preparation and will develop even more in the future as a result of that hard effort.", "q2r": 5, "assessor": "z_assessor_1713", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 4957, "q0": "The proposal addresses an important community need in identifying barriers to mental health coordination and proposes a unique solution involving Cardano.  The proposal is clearly a feasibility study and the proposer has provided background information and outlined the challenges/risks of the project.  While the proposer plans to perform the feasibility study then move to an MVP in F9 it is not entirely clear how an MVP on Atala PRISM is providing a solution.  As a CEO of a healthcare company working in care coordination there a significant number of coordination and integration issues from identifying the actual provider of mental health services (primary care, psychologist, clinic, etc.) and the numerous documentation systems utilized.  I would suggest the propose provide more detail on these issues as barriers and how the feasibility study seeks to understand and eventually mitigate these barriers.  The feasibility study is good start however I’m not convinced it is addressing all the areas which could limit the adoption of a solution.", "q0r": 4, "q1": "The proposer provides a roadmap with key milestones and indicates updates will be posted on monthly Catalyst reports.  The team has strong credentials for a VC funded project which begs the question why the proposer need to request the funds.  In addition, after reviewing numerous proposal I strongly suggest the proposer provide links to LinkedIn profiles, some degree of documentation in google platform and a simple website.  The budget seems reasonable for an activity-based budget however I would like more detail on who/how the prototype would be built, who is conducting the interviews and the internal travel cost. The back ground information is lacking.  ", "q1r": 3, "q2": "The proposal provides high level KPIs however there seems there could a lot more which could be measured.  For example # of focus group participants, type and number of care providers, ranking key feedback, etc.  Overall the feasibility study is auditable but the proposer could provide more details  ", "q2r": 3, "assessor": "z_assessor_1807", "no_vca": 3, "ne": 1, "ng": 2, "nfo": 0, "vca_o": 1, "reply": "Good comments, thank you. Not flagging this but responding to some of the comments. We have chosen to start our work in mental healthcare coordination in a very narrow segment – parents of university students with a mental health diagnosis – and are accompanied by the point person for a major university whose role is liaison with those parents and their children.   We are going to be advised and introduced by her to the relevant caregivers so that identifying the actual providers will not be an issue for this first batch of users,  and should be broadly similar to future users as well.  \r\n\r\nIn regards to whether we need funding from Catalyst: The team may have strong credentials for a VC funded project but VC’s will not get involved (we’ve talked to many about this project) without evidence of product market fit, which is exactly what this focus group intends to address. Catalyst is an innovation fund, so I think this is exactly the right sort of project to be funded because the capital is more tolerant of risk than traditional private investors."}, {"id": 7943, "q0": "Create a profile for managing psychiatric patients in the US Prism app. This is an idea that will promote the management of information data in all other fields with identity technologies using blockchain, ensuring security, transparency, healthcare as well as other areas of the company. life. The team has extensive experience in the care and management of psychiatric patients in the US with over 100 patient interviews. The healthcare solutions are rich and the research data parameters are quite detailed.", "q0r": 5, "q1": "The group has a team of experts who are professors and doctors in psychiatry, along with highly qualified engineers to create reputable corporations. This is one of the factors that ensure the project's performance. Also they have a plan for the latest 6 months if funded, although it is not very detailed. Hopefully the group will develop a model and publicize the information so that the community can use the code applicable to other localities or countries in the management of mental patients as well as areas that need to be managed through information. other news.", "q1r": 4, "q2": "They commit to have full progress reports in Catalyst reports. They have not officially announced the communication channels or code details for the community to refer to, hopefully they will add them soon. It is hoped that in addition to developing the project, they will create a common industry template for information management on blockchain using IOHK's research. This saves development resources later on for the cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10125, "q0": "This proposal is about creating a file to record the history of mental health as a verifiable credential in PRISM. Patients share MPF with providers, who update & issue it back, with the focus on university mental health market. This is an interesting and feasible idea because mental health is always a potential market, high profit, and beneficial to the community. Because of the disadvantage of the current situation that the coordinating between psychiatrist, psychologist, primary care physician etc usually falls to the patient and can be time-consuming and error-prone, this product will be well received and widely used by the industry experts\n if it is successfully built. The project is also in line with SDGs, so it is meaningful and helpful to the society.", "q0r": 5, "q1": "The proposers have relevant experience, but it would be better if they attach something to proof their experience to the proposal. Probably thanks to these experience, they seems understand clearly about what they said: they explain well the background and context of the project. They also create a compelling and effective vision about each phase of the project and the general strategy of it. They analyze major risks and have strategies to deal with them. Therefore, it is highly likely this proposal will be implemented successfully. I will plus a star because the risks are still really big and yes they have the analysis of these, but it's not enough to ensure their success.\n\n\n", "q1r": 4, "q2": "The proposal include clear roadmap with stages and specific actions for each stage. It also includes the key metrics to make the progress easy to be tracked. The output of the project will be in a form that auditable: surveys, documents, reports etc.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Create a “min. patient file” (MPF) as a verifiable credential (VC) in PRISM. Patients share MPF with providers, who update & issue it back.", "experience": "We are an NYU spin-off. Collectively our team has >50 years experience: Developing and commercializing patented medical devices, Managing WW healthcare at Microsoft, Conducting NIH-funded clinical trials, Winning FDA 510 (k) device approval, sales to healthcare systems globally."}