{"id": 400414, "author": "booktoken", "title": "Book NFTs - Transforming Publishing", "url": "https://cardano.ideascale.com/a/dtd/400414-48088", "category": 26445, "amount": 25000, "description": "By 2026, the eBook sales are estimated to topple $38B. Right now, publishers and authors have no way of getting their work on-chain.", "f6_no_assessments": 6, "f6_rating": 3.7777777777777772, "videos": [], "media": [], "f6_assessments": [{"id": 3627, "q0": "This proposal suggested building a platform to put books on the blockchain with NFTs to protect the ownership, license of publishers, authors, and simultaneously benefit them from royalties. This solution is aligned with some objectives of the given challenge as it comes up with a Cardano-based solution to meet the needs of publishers. Having said that, the description of the solution was not clearly mentioned. Instead, it should provide more detail about what the solution is all about, its features, functions, and how it works to help publishers and authors to get revenues from selling book NFTs. It mentioned NFT books would provide digital ownership to books that last permanently, create verifiable scarcity, and release royalties. However, it seems unclear in this part, more explanations including an emphasis on technical prospects of how it could do that should be provided. From that, it could better point out how this solution impacts its target audience. The proposal listed what publishers need, but did not explain in great detail on how this solution will meet all those needs. If more detail were provided in this part, then it would be more persuasive to see how impactful this solution is to publishers along with some benefits it offers. It did mention how this solution impacts the adoption of Cardano, but again more detailed information should be provided to clarify. Not having enough time for delivering a prototype in 60 days would be a challenge when delivering this project. It should add the plan to prepare and get over this challenge.", "q0r": 3, "q1": "The plan given was quite detailed. The description of each step was mentioned. However, it lacked a specific timeline to complete this plan over the next 120 days. The budget breakdown was general. It should separate the cost into smaller parts. The way to calculate the cost should be stated as well. For example, the budget for development and dev resources, it should mention how it paid for how many devs, the salary paid for them is calculated by hours, weeks, or months. Regarding human resources, it did a great job in providing the profile of staff. Furthermore, this proposal mentioned at the beginning that the leading team of this project built an eBook company with 6 millions readers and over 2 millions eBook titles and they also worked with several publishers and imprints including all Big 5 publishers, delivering ebooks in bulk deals to Google, Apple, IBM, T-Mobile, Wall Street Journal, and General Mills. These points show that the team is so talented and experienced. In fact, it mentioned The CEO & Co-founder, Joshua Stone, has experience in publishing tech since 2009,  Regenold with over 20 years of software engineering. One point that was mentioned on the auditability section is that currently this project has 8 publishers and thousands of titles that are ready to go live to sell NFT Books. This is a good signal to prove its high feasibility.", "q1r": 3, "q2": "With the given information, it seems difficult to measure the progress and the development of the project. Instead, it should mention indicators, criteria in accordance with the timeline in the plan. This will let sponsors track what phase the project is in, what should be achieved next, how the project is going on. It described the success of this project is to build up a marketplace for creating, selling, and reading book NFTs for publishers. However, it should add KPIs with specific figures to make it clearer. For example, the number of publishers or readers joining this platform,  the number of book NFTs created, read, and sold. Besides, it should indicate whether this project was funded before or a completely new one.", "q2r": 2, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4811, "q0": "The fascinating concept, a solution for authors and publishers to track the sale of their books without third parties (sellers on ecommerce platforms). This indeed gives authors the freedom to have more control over their work and enable readers to sell their ebooks like physical books. The team has found insight from top publishers of how they want to adopt new technology to come up with this solution. Overall, the writer did give us a brief but comprehensive understanding of this project.", "q0r": 5, "q1": "The timeline showed us a general idea of what the team will do in the future and how they will develop this project but it didn’t have the intended time for each work. \n\nThe budget breakdown is too general, the team should break it down to the expenses on each work and the expected duration. For example how long will they hire outsource dev services and on what labor. The same goes to the expense of business development with publishers, they should state how they will cooperate with publishers, how many publishers are in the scope of their proposal, etc. These details will strengthen the feasibility of the project.\n\nThe team members are all professional in their own field, I believe that they have a profound knowledge and insight of the publishing market to run this project successfully. There is one minor point in this part, it is that they didn’t include the member’s contact information or anything as a demonstration of their previous achievements/experiences", "q1r": 4, "q2": "To measure the development of the project, there should be metrics to show how we determine whether this project is successful or not. The team could mention their target readers, book titles published, etc to be more specific. Other than that, the team delivered their vision for this project effectively.", "q2r": 3, "assessor": "z_assessor_1775", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5299, "q0": "Book Token does address the challenges of collecting, reading, and reselling the missing link between the physical book resales vs. the book NFTs that will bring value to the NFT world.\n\nThe challenges of agreeing to the cost of royalty fees and resale value was not mentioned in depth on the percentages, but I do see that would be part of the strategy when they are able to have publishers on board in the NFT space. ", "q0r": 4, "q1": "I do see Book Token coming to fruition. They are filling a need, but the time crunch of 60 days to develop a prototype is a quick turnaround that seems possible within their timeline expressed. ", "q1r": 4, "q2": "There is enough evidence that Book Token is able to provide enough rapport and progress of their deliverables. \n\nThe fact that they have 8 publishers to start off from the getgo is a great way to get the ball rolling to start a massive wave for book NFTs to start taking over the space. ", "q2r": 4, "assessor": "z_assessor_1931", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 8064, "q0": "As the proposer mentioned in the proposal, book publishing is a big market with billions of dollars and millions of users. Their solution to shift the book publishing model into on-chain is one of the best ways to support authors and readers.  As the content that the proposer provides in the proposal, the advantage of the on-chain will help not just unlock more revenue to the author in various ways, but also make the reader more engaged with the platform, they also increase the efficiency, traceability, and transparency of sales reports - that is very important in this industry... Even the proposer attached their whitepaper in the feasibility session but I hope that the proposer can brief some content of key features and functions, it will help the community easier understand how it works, and also help assess the feasibility of their implementation plan and roadmap easier. The proposer provides only one risk of lacking human resources to finish the project on time. I do not have experience in this industry, but I think there are maybe some challenges about technical, marketing, publishing... should be provided. ", "q0r": 5, "q1": "They have two detailed roadmaps, one in their attached whitepaper and one in the proposal. The outlines are easy to understand but there is no timeline in their roadmaps, this will be hard for the community assesses their progress later. Moreover, it is also hard for us to assess the required budget. The budget is not mentioned to serve which part of the project, and it's not broken down in detail, it's hard for us to assess that it's reasonable. Lastly, the founding team experiences and profiles are fit with this project. They have experience in book publishing and have relationships with publishers that can help to succeed in this project. ", "q1r": 3, "q2": "The proposer provides some tools to track their progress very well, including Trello, telegram, and GitHub. I think those tools can help the community even help them more than just monitoring. Moreover, they have a good vision for the success of their project that I believe will make a big impact in the future of book publishing. My only advice to them in this part is that they should provide some key metrics or KPIs to help the community better follow their performance and support further. ", "q2r": 4, "assessor": "z_assessor_651", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 10638, "q0": "The problem is also an opportunity to pioneering a market segment with high value, for so it is completely aligned with the Challenge. By building the first ever NFT books platform on the Cardano ecosystem, this proposal has the potential to bring a great amount of new users, while increasing utility and value of Cardano.", "q0r": 5, "q1": "Although no evidence was provided, the team members' experience shows a high probability for a successful implementation. They have already built an eBook company that had 6 million readers, so they have knowledge of the publishing market and of platform development.\nThe budget outline is vague. It could better explain how will the development costs be spent, for instance how many people, for how many time and which outsourced resources will be needed. With shown evidence of the team members and a better explanation on the costs, the 25k budget would prove to be reasonable for such potential impact as mentioned.\nThe roadmap contain 9 alpha versions with specific features to be achieved within 120 days. Based on the stated experience, it is likely that they will meet the deadline.", "q1r": 4, "q2": "The 120 days time horizon for development could be broken down into smaller milestones for each aplha version. Although there is no directly stated KPI, there are mentions of number of publishers, number of titles and number of readers. You could stipulate a goal for those metrics in some specific period.\nA good point is their willingness to open their Trello boards to Catalyst auditors and to publish progress on Twitter, Telegram and Github.", "q2r": 3, "assessor": "z_assessor_951", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 10673, "q0": "The proposal views that an ebook is distributed via a centralized system and that readers do not own the contents but only license. \n\nThe proposal looks to converting ebooks into marketable NFT, allowing readers, after reading and deciding to put up for sale in the second hand book market, and also allowing the writers and publishers receiving fees perpetually.  The proposers will build tools on Cardano system giving access to writers, publishers and readers. \n\nI view this is a business opportunity engaging businesses, members / stakeholders in the Cardano system. For this I strongly agree that this perosak effectively addresses the challenge. \n", "q0r": 5, "q1": "The proposal has a time frame to develop and launch the book token prototype within the next 120 days. For the longer term, there are 9 steps to complete the whole system for the book token, mobile apps, smart contract etc. For this longer term work, the proposal refers to their web site that will help viewers to check on their progress.\n\nFor budget they request for 25k mainly on the development and outsource. \n\nThe team comprises 3 members who have experience and expertise in \nPublishing technology \nBlockchain and NFT technology \nSoftware engineering \n\nWhich are needed for the development of this project. \n\nI consider the above information allows me to agree that it is highly likely that this lepak will be implemented successfully. \n", "q1r": 4, "q2": "The  proposers did not provide information on the progress KPI in order to measure their success, other than following their Telegram report monthly. \n\nFor this reason I can only be neutral that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. \n", "q2r": 3, "assessor": "z_assessor_968", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "NFT books is the next step in publishing evolution. Ownership creates a secondary market, rewarding authors and publishers with royalties.", "experience": "C-Level team previously built an eBook company that had 6M readers and 2M+ eBook titles. We worked with thousands of publishers and imprints including all Big 5 publishers. We delivered ebooks in bulk deals to Google, Apple, IBM, T-Mobile, Wall Street Journal, and General Mills."}