{"id": 400594, "author": "champscouting", "title": "Rondevoo", "url": "https://cardano.ideascale.com/a/dtd/400594-48088", "category": 26445, "amount": 30000, "description": "Creators have limited access to capital and consumers lack options to invest in them.", "f6_no_assessments": 6, "f6_rating": 2.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 1625, "q0": "Proposal to put the idea of ​​​​building a stock market - a place that will connect creators and investors. Creators are people who invest in the stock market and issue tokens that simulate their portfolio and sell to investors. The question is why the stock market? Investor capital will flow into securities instead of the Cardano ecosystem. The proposal is completely inappropriate for the \"Business Solution (B2B B2C)\" challenge, and I have not really felt how the proposal will bring value, impact the Cardano ecosystem.\nAlso, the proposal says \"Just passionate fans-turned-investors of content creators who want to see them grow their business\", it's clear that creators benefit, and Catalyst funds are used to fund this group of people.\nI would recommend to the proposer that it is advisable to focus on what Cardano is building so that directing the capital inflow here will have more impact.", "q0r": 2, "q1": "There are many points that make me disagree about the feasibility of the proposal:\n\n1. Crowdfunding flows into the stock market through tokens from the creators, rather than into the Cardano ecosystem. One thing will make the voter not accept the proposal and no vote for you\n2. When the creators receive dividends through securities, how does the proposal distribute back to investors through smart contracts?\n3. How is the creator's input checked? What I mean is that the creators themselves must have professional qualifications, good portfolio management capabilities, and certifications in portfolio management in order to gain the trust and credibility of investors. The proposal does not yet have a solution to test the ability of the creator.\n4. Legality is not available, currently the proposal is only mentioned in the section on risks and challenges, there is no specific measure to implement this issue. In addition, the proposal's member has no legal experience.\n5. What is the spending budget for each work item. The proposal requests a budget of $30,000 and there are no reports mentioning the use of this funding. It is difficult for the community and voters to evaluate the feasibility of implementing the proposal.\n\nConclusion, I have a little suggestion for the proposer, you should add more resources to meet the strict requirements, and have a more detailed plan.", "q1r": 1, "q2": "I look forward to suggestions that can update more core team information. The proposal does not provide evidence of the team's work experience (links to Twitter, Github, Linkedin pages would be more reasonable)\nI also expect you to add more KPIs in addition to the number of creators and investors as stated to measure success.", "q2r": 1, "assessor": "z_assessor_1394", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 3027, "q0": "The proposal is about the crowd fundraising platform for content creators. As such it is in line with the challenge, that is services built on Cardano.\nThe proposal addresses the problem which is lack of seed funding, and solves with the fan financing via its platform.\nMetrics are proposed and are in line with the challenge with expected values.\nScaling is not particularly addressed, which might be an issue if there is higher than anticipated interest.", "q0r": 4, "q1": "The team has provided names and titles but no verifiable links or data to check experience, prior work or finished/delivered similar projects.\nBudget is a lump sum only with no breakdown of costs. \nThe roadmap is provided in very general and broad terms with no details related to the implementation.\nIf the funding is shown to be not sufficient for delivery, there is no backup plan.\nThe timeframe is present but the milestones are very general in nature and lack implemetnation details. \nThe risks are mentioned, but not the ways or plans how to mitigate them.\nOverall, a solid idea which needs more detailed execution plan.", "q1r": 2, "q2": "The roadmap with milestones is present and can be monitored.\nSuccess metrics, number of users and funds are presented and project can be measured by it.\nThe project has clear problem and a solution. However, the proposal is lacking execution details in regards to budget, verifiable team experience, technical aspects for implementation and risk mitigation - in particular legals.\nOverall, if funded the project can be audited with the data provided.", "q2r": 4, "assessor": "z_assessor_160", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7562, "q0": "It is clearly explained how a stock market for creators & investors would address the challenge. But the proposal lacks the substance to back up the intention. The solution description is too general and mostly lists desirable features such as stock market, Issue tokens, Buy/exchange tokens etc. And no explanation is given of how Rondevoo will be built.", "q0r": 3, "q1": "Some detail is given of team members and their experience is referred to as CS Majors etc. But there is no way to verify this experience through either LinkedIn or previous work examples. No detailed plan or budget plan is provided. Instead, the same summary roadmap is repeated in both sections. Consequently, there is little assurance that this proposal will be implemented successfully.", "q1r": 2, "q2": "A high-level summary is given on how the metrics will be measured. But these are not broken down or related to any detailed plan of deliverables or success criteria. So there is insufficient information provided to audit.", "q2r": 2, "assessor": "z_assessor_597", "no_vca": 2, "ne": 0, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 7947, "q0": "A proposal to securitize tokens on a blockchain platform is an open mind. However, it requires a lot of problems to be solved at the same time. The first is legal, and local crypto adoption. The second is how to ensure that the projects that issue tokens are of quality and do not deceive investors. Finalization of the legislation needs to work with local authorities. And the quality control of projects, avoiding risks for investors also needs legal intervention. Blockchain has been around for 13 years, recognized by the majority of the world's citizens, but almost no government has actually adopted it.", "q0r": 5, "q1": "I see that you have outlined the basic quarterly plan, but it is sketchy and not convincing enough at the moment. First of all, you should have time to research to understand the current market, legal issues, show that technical development related to securities on blockchain will have advantages and disadvantages to overcome. . We need a bigger picture in order to understand the problem to be solved, understand its impact, and develop this technology.", "q1r": 4, "q2": "I see that you have outlined the basic quarterly plan, but it is sketchy and not convincing enough at the moment. First of all, you should have time to research to understand the current market, legal issues, show that technical development related to securities on blockchain will have advantages and disadvantages to overcome. . We need a bigger picture in order to understand the problem to be solved, understand its impact, and develop this technology.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 8606, "q0": "The Rondevoo proposal aims to create a launchpad platform for content creator tokens. However, the proposers chose to brand it as “a stock market for creators & investors”\n\nUnsure of the location of the proposers, as it's not mentioned in the proposal, but willingly calling token launches “stocks” is bound to get them into regulatory and legal trouble, given the current landscape around unlicensed securities.\n\nWhile in theory, the idea could add value to the Cardano ecosystem, the proposal doesn't give any details about what would make this solution unique and desirable when compared to others. It also doesn't mention how the proposal is intended to attract users to their platform.\n\nThe risk of being compliant and obtaining licenses is mentioned in the proposal however it's not addressed at all and from the way the proposal is budgeted I get the impression that it's severely underestimated. Costs for obtaining a stock market license can range upwards of hundreds of thousands of dollars for one jurisdiction alone.", "q0r": 2, "q1": "The provided roadmap is very generic and doesn't feature actual details about the development of the platform.\n\nThere is no budget in the proposal, the proposers have simply copy/pasted the roadmap in the budget section. \n\nThe names of the team members are provided in the proposal but very little info is given about their qualifications or credentials, also there are no links to public professional profiles.", "q1r": 1, "q2": "Metrics provided seem to be oriented at measuring the success of the project once it's completed. However, they do not cover the actual progress on building and implementation of the Rondevoo platform which is the scope of this proposal. If the proposal is to be resubmitted I would suggest that the authors consider including a comprehensive list of KPIs and metrics that will make it easy for the Project Catalyst accountability team to verify actual progress being made on the deliverables of the proposal.", "q2r": 2, "assessor": "z_assessor_681", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9777, "q0": "As far as I understand this proposal, proponents want to build a decentralized platform (Rondevoo) on top of cardano so that creative people can easily access capital, end users can easily access capital. transparently invest in innovative products. By exchanging tokens, Rondevoo can help creators get their capital and investors get the value they expect. Rondevoo will receive a commission on each transaction.\nApplying the cardano blockchain platform and issuing native tokens on this platform to raise capital is a very creative way of the blockchain era startup community. In this way, the mobilization of unlimited capital from society to solve problems brings value to society and to the communities involved in project activities.\n Having more people make transactions on the platform will greatly benefit the cardano platform. In addition to the increase in the number of transactions, the success of this project is also the driving force for many similar projects to be implemented around the world.\nThis proposition is valid and suitable for the challenge.\n", "q0r": 4, "q1": "This proposal is in the development stage, by Q2 they will probably test the beta table and it is expected that by 3Q2020 they will complete and start launching. This shows that this team is determined to complete the project. However, if the proposal provides more details of the tasks and results,\nThe information about the project team is quite detailed, describing the experience of the participants and their skills, I would like to have more contact information via telegram or link for more clarity.\nRegarding the budget, I need more detailed information on the list of tasks and the cost for each of them. this will help me understand these payouts more accurately.\n", "q1r": 4, "q2": "This proposal has a full roadmap, but more detailed KPIs on the results of each project milestone are needed in order to assess progress in achieving the stated goals. Contact information should also be added. of project participants to increase transparency\nThis proposal is workable, it has value for the community and cardano\n", "q2r": 4, "assessor": "z_assessor_759", "no_vca": 3, "ne": 1, "ng": 1, "nfo": 1, "vca_o": 1}], "solution": "Rondevoo: A stock market for creators (who raise capital via tokens) & investors (who earn dividends and redeem tokens for perks).", "experience": "We are currently a team of five - 2 Econ Majors, 2 CS majors, and 1 business major. Have a fair amount of experience in working with content creators and this idea arose after feedback from users of our previous platform."}