{"id": 400663, "author": "gondlr", "title": "Traceable Reward currency (FLORAS)", "url": "https://cardano.ideascale.com/a/dtd/400663-48088", "category": 26445, "amount": 70000, "description": "More and more companies will need to offset carbon credits and generate customer loyalty at the same time but don't have a tool to do it.", "f6_no_assessments": 3, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 1342, "q0": "The proposal tries to build a reward platform under a shared wallet & currency (FLORAS) where companies reward members, trace funds spent, and get carbon credits. The proposal is well-written, how the system works are explained clearly. I found the idea is impactful and can bring a lot of value to the Cardano ecosystem. The team has a solid plan and is already ongoing with the project, I think if the proposal gets funded the team can execute the proposal successfully. The team also provides a potential risk that is the integration of the wallet to the Cardano system, but the team has already consulted the problem and is not a problem.", "q0r": 5, "q1": "The proposal has a roadmap and clear milestones for each month from the first month to the 5th month, where there's a weekly sprint totaling around 20 sprints. The team provides a detailed and reasonable breakdown of how they will use the proposed budget (App development and customizations, Blockchain integration and tokenization, Marketing and design of the brand, website, and app, etc). The team also elaborates background and relevant experience on each people on the team and provide a LinkedIn profile for all member. The LinkedIn profile is great to have since the community can easily verify the claimed experience and since made the team more legitimate.", "q1r": 5, "q2": "The indicators of success are concise and clearly defined by the launching of the three key elements of the currency system. The team also provides a documents for reflection of sprints, that is a Dashboard, Sprints Plan, Backlog, and Grooming, and thus made the project easily tracked and evaluated.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 10, "ne": 0, "ng": 9, "nfo": 1, "vca_o": 1}, {"id": 1878, "q0": "This proposal is for the creation of an alternative currency (FLORAS) native to the Cardano blockchain and the development of a fully functioning MVP of the wallet for that currency. This currency will be used for the customers to be rewarded if they buy something from a coalition of companies, the customer then has the right to purchase goods/services from other companies that have implemented carbon sequestration practices. For the customer it appears free, but the company that issued the FLORAS to the customer in the first place in reality is paying the company that sequesters carbon credits. In this way the customer is allocating the funds from the first company to the second company. All of that  is on the blockchain to be transparent and traceable. \nThis is a B2B and a B2C solution in one and will definitely align with the challenge objectives and measurable.\nI strongly agree that this proposal effectively addresses the challenge.\n", "q0r": 5, "q1": "The proposers claim that they have a ready wallet that will serve as the hub for all the functionality that the FLORAS will provide. However this wallet is not build for Cardano specifically. The proposer states that they have reached out to developers from the Cardano community and they have assured them that the conversion is doable.\nThe proposer envisions a fully functioning MVP in 5 months.\nThe proposer provides somewhat detailed roadmap with monthly milestones for 5 months. Here we understand that the scope of this proposal is to get to a fully functioning MVP of the system. However there is plenty of explanation in the impact section on how they plan to expand and develop this project further to a fully functioning alternative reward currency similar to the airmiles.\nThe proposal has a detailed budget outlined where we can see that this is a purely software development proposal, no marketing and advertisement. \nThe team is very well presented and the positions of the members are clearly stated. There is a linked in profile provided for every team member where we can see that the team has a lot of experience in the airmiles industry and has the skills needed for this project to be successful.\n  I strongly agree that it is highly likely that this proposal will be implemented successfully.\n", "q1r": 5, "q2": "The proposer’s plan is to build this project with 5 distinct sprints. All of them will be documented with the progress that they achieve. There will be product snapshots divided in the different categories for the product. The dates for these sprints and the tasks that will be worked on are outlined in the roadmap. \nThe proposer says that minimum requirements for each sprint will be provided in the documentation of the sprints. However I find that it was better to clear these out in advance and provide them in the road map presentation of the proposal.\nSuccess metrics are well outlined and regard the launch of the fully functioning MV product and it’s use. \nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_1417", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 7950, "q0": "\"This team wants to build an electronic wallet where many different coins can be stored, and create an environment for buying and selling goods paid for by the money issued by the team itself.\nPromoting the crypto-accepting merchant business is essential right now. But I wonder why you guys only allow payment with money issued by yourself? Why can't I pay with ADA? Currently, the ADA platform matures very quickly, the applications are ready to expand, and the wallet facilities are convenient. We need more than ADA digital currency payment.\"", "q0r": 5, "q1": "You have work goals and also have a team. However, I do not see any member's personal information records, showing that the group information has not been made public, the reputation is not high. In addition, analyzing my team's skills and experience also did not find any evidence to verify the information. This is difficult to convince the community, especially when the means of payment wallets on cardano are now very rich and directly connected on-chain. Hope you guys should be more serious with your own ideas.", "q1r": 4, "q2": "\"About the ability to test the project, that is, what factors do you need to provide so that we can track the progress of the work, the success of the work is based on which evaluation criteria.\nAnd especially, you need to have weekly and monthly KPIs and should have a clear deadline. Please read and refer to the successful proposals funded in Catalyst for more perspectives and experiences.\"", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Build a reward platform under a shared wallet & currency (FLORAS) where companies reward members, trace funds spent, and get carbon credits.", "experience": "We developed a white-label mobile wallet complemented by a marketplace web for products, all connected under unique currency. We are experienced in building reward programs and currencies. Part of University California Berkeley accelerator. Team: Ph.D., economist & 3 engineers."}