{"id": 400767, "author": "carnivilla", "title": "Communal Marketing Spaces", "url": "https://cardano.ideascale.com/a/dtd/400767-48088", "category": 26445, "amount": 25000, "description": "Cardano lacks engaging communal marketing spaces that represent projects, developers, and academia in order to onboard general populace.\n", "f6_no_assessments": 6, "f6_rating": 3.2222222222222228, "videos": [], "media": [], "f6_assessments": [{"id": 8066, "q0": "\"It's better if the proposer show some case study to help people visualize easier how their hub will work on each platform, that will inspire the community to support the idea more than just summarize it. There is no more information about the long-term development, but in the scope of this proposal the team will make a virtual fair for brands to show across multiple platforms, and the income from fair portion purchasing from brands will be used for mass marketing the fair. So, my advice is that the team should provide some detailed benefits to the brand when using their solution but not just only the traffic from mass marketing. Moreover, some detail about the fair, the portion like the design, space, place, number of project... that they will show the brands should be provided here. \nThe idea can be aligned with the challenge because they can attract a number of projects to buy a portion in that fair and join the hub long term, moreover they can go further with the connection between the project and scale it up if they want - that's my idea for the scaling solution. \nLastly, I think this is a big and complex project but the proposer just mentioned the challenge of full-time human resources that they're lacking. I believe that there is a lot of challenge to this idea and the team should be aware of them. \"", "q0r": 3, "q1": "The roadmap is really short and simple, I'm curious about the detailed plan on initiating the Hub launching because it takes about a quarter for that. In addition, because of lacking solution information, I also cannot understand some milestones in their roadmap. So, for easy understanding and assessing the feasibility of this project the proposer should have more detailed content about their implementation plan. Moreover, I think the budget they required is a bit insufficient for this kind of project from my experience. They require the budget for 3 months of development but we can't define which quarter in their roadmap will use it, I think it's the first quarter. If it's, it's not clear because there is no info to show that they need their position.", "q1r": 2, "q2": "The proposer visualizes a great vision of their success, that will make a big impact on the Cardano ecosystem and projects that engage with them in the Hub. The key metrics that they use to measure the performance of the project are suitable and the best fit for this kind of project. I think the team really aware and determine clearly about what they do and want to do, but they should provide more detail to help the community assess their plan better. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Reviewer mentions several details and aspects that there is no more information on that are shown on the example website.\n\nReviewer does not appear to understand the time frames involved with catalyst and roadmap is simplified to key points on development pre-funding.\n\nOpinions on complexity and funding cloud the reviewer from observing the clearly defined examples in the proposal."}, {"id": 9778, "q0": "This proposal builds a solution for B2B in the virtual space (metaverse) to help the community of product developers on the Cardano platform, directly reach the end users. The solution displays Cardano projects and collects access information.\nThis proposal uses metaverse technology as a tool to approach and interact with and measure end-user behaviors, helping application developers gather more information about customers’ desires can tailor the application to better fit.\nThis proposition has a huge impact on developers on Cardano. It makes it easy for product developers to reach end users without spending too much time on marketing.\nExperiencing the virtual rooms that the proposal is building on carnivilla.com is very exciting.\n", "q0r": 4, "q1": "The proposal presents a very detailed 9-month product development roadmap (from Q1.2022 to Q3.2022), from launching to marketing, space leasing automation, reasonable timelines, each development stage is about 3 months.\nThe proposal provides a detailed budget breakdown which is reasonable.\nTeam member has a lot of experience in media projects, games,.. however I’d to know more working profile on LinkedIn /Telegram /other social media. Also, I suggest the proposer to look for additional participant with knowledge on programming languages, especially Haskell and Plutus for smart contracts on the Cardano platform. \nThe proposer already has their current build progress at: https://carnivilla.com/. It shows high feasibility of the project.\n", "q1r": 4, "q2": "The proposal sets clear KPIs on specific work such as web traffic, new visitors, .. display analytics.\nIt also has a full roadmap taking place over 9 months with specific works and achievement.\nThe budget for this proposal is reasonable, specific jobs are paid for each completion time in detail.\n", "q2r": 4, "assessor": "z_assessor_759", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10814, "q0": "As a Business Developer on my own, I agree that a metaverse just like this is an appropriate platform to showcase Cardano projects, as the proposer aims to produce. This aligns with the Challenge objective to bring innovative product and services to expand to new areas. The platform link provided is in working condition and seems to has the functionality being explained in the proposal. ", "q0r": 4, "q1": "The team is composed of two professionals a primary developer and a community manager,  which seems ok for the stated goals, even though the individuals included in the team are presented and part of their experiences are in line to their roles in the project, no links or other proof were provided in order to be able to assess their proficiency to this proposal objective. The project milestones and tasks are provided as well as a budget breakdown, divided in general terms of activities for a 3 months period, the activities seem to be in line with the goal. The marketing budget of 7K requested is not detailed, so it cannot be assessed, neither the marketing activities that are just stated as \"mass marketing\". Therefore I think the proposal lacks some key details that are really needed for a proposal to apply to funding and be able to demonstrate its feasibility. I suggest to the proposers to work on those indicated details and if not voted during this fund, resubmit on the next one as the proposal is a great idea and could be a good fit for Catalyst and Cardano.", "q1r": 3, "q2": "The KPIs submitted:\nSite Traffic\nNew/Returning Visitors\nAverage Session\nTraffic Sources\nDisplay Ad Analytics\n\nAre not enough for the community to be able to successfully audit and track the project progress, as the Challenge aims to drive more businesses into Cardano, the metrics shall reflect how the project is progressing towards that specific goal, and not general aggregated metrics that can not really show them (e.g Site Traffic, can be showing traffic to non cardanian projects, as this is a Metaverse not specific for Cardano). There are no project progress KPIs being provided, so project tracking could be hard, also combined with the a project timeline that is that general. My advise is to add metrics that can show specific impact and progress of the project in/for the Cardano ecosystem, so the Return on Intention can be really seen and audited.", "q2r": 2, "assessor": "z_assessor_288", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10829, "q0": "The proposal is for a virtual expo area for cardano projects, which in my opinion is a great idea. Reddit is teeming with posts about people asking about upcoming/existing/trendy projects, and it would be great to be able to have a virtual location to either interact with people during events or simply browse the various booths people put in place.=", "q0r": 5, "q1": "The project is ambitious and the team have a lot of the skills needed, but seems to lack in the programming, payment processing and backend area of expertise. As a hobbyist dev, Chris did manage to get a good first version up, but the timeline is ambitious for building something that has this many moving pieces. The current proof of concept needs to be optimised (which is a hard process especially when dealing with a web-based platform), in addition to all the other features implemented. The cost breakdown is a bit coarse, especially regarding the marketing budget (what will this 7k be used for, exactly?)", "q1r": 3, "q2": "The proposed KPIs make sense, my main concern is that none of the kpis are public. Still, the space itself is public, therefore anybody can log in, interact with the world, and see for themselves how much adoption the tool actually has.", "q2r": 4, "assessor": "z_assessor_318", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10902, "q0": "Whilst this proposal can quite easily fit into multiple Challenges like ScaleUp Cardano's Community Hubs or Misc Challenge, it is very much fitting it be submitted under this challenge. Not only does this project foster B2B but also B2C interactions but I would go so far as to say that what is being proposed is infrastructural to Cardano. Whilst I mentioned it may even fit the ScaleUp Hubs challenge, the fact its a supporting structure for the number of niche communities already in existence is the kind of inter-Cardano endeavours we need to promote and support as these can lead to greater adoption, lowers barriers of entries and create synergies which strengthens the ecosystem. As a former assessor of tenders for a university, you need to be able to look beyond the platform they are intending to build and also appreciate the downstream benefits it will bring to the community. I whole-heartedly agree this fits the challenge perfectly. However, whilst I provided 5-stars, I would suggest to the proposer to ensure ease-of-use of any resources added on to a  proposal. The carnivilla.com site was a little difficult to navigate and this can cast an unfavourable view to a voter. Please ensure such resources are working as optimally as possible as to leave no doubt to the expertise behind a project. ", "q0r": 5, "q1": "Unfortunately, what has been presented on the proposal weakens the project in this category which has led me to disagree that this proposal can be implemented successfully. Firstly, whilst two team members have been presented , only first names were given with no links to a site where their bona fides can be further examined. In terms of the experiences described, while having some relevance to their objectives, are more operational in nature rather than technical, which Carnivilla will require. Jesse has experiences in events though not at a high production level and Chris has graphic design and cinematography experiene, which while valuable to support such a project, is not at the level required for their vision. He has also mentioned exp in the game design but as a hobbyist. It would have been a good supporting argument for their case if examples of released previous work were added to the proposal. You can often overlook a proposer's lack of qualifications if there are mentions of the intention to secure the expertise lacking, however, this is not present in the proposal. As a result, this casts doubt on the budget presented particularly for the Primary Developer. TRhe three quarters of 2022 were presented as milstones with high level targets. It would've been beneficial if the development phase was presented in parallel to these timelines. As it is, the additional screenshots of Carnivilla's future state creates an expectation from the reader and these images and the plan presented lead to doubtfulness of their proposal's ability to be implemented. Creating such a hub is not simple and Cardano voters are now becoming more sophisticated and more aware of what it takes to build anything. The proposers should keep this in mind when representing this proposal as often, when the vision and the plan do not look in sync, this creates disbelief. I highly recommend the proposer carefully describes how and with what resources are they intending to build Carnivilla, provide plans on how to secure expertise not currently available, and also present yourselves professionally, in full and with links to your career profiles and previous experience so as to gain confidence in your abilities. Goo luck.", "q1r": 2, "q2": "The KPIs presented while invaluable in measuring the success of Carnivilla post release, it does not provide the kinds of measurable points for the Community to assess how the project is progressing from an audit standpoint. I recommend that a resubmission of this proposal includes measures which can run in parallel to the build milestones presented under Feasibility, as this will allow Catalyst and the community to check on how you are progressing. This is where the inclusion of social channels in the proposal adds value; twitter, facebook, reddit, TG or Discord channels could be added and would be the likely points from where the proposer can announce the release of the HUB, for example. In addition, there is a significant tech development associated with this proposal and this is where a github/gitbook account could also provide an audit point from where progress can be tracked. The overall idea of the project is great and has potential value and I hope the proposer revisits it for a future submission with all the suggestions taken into consideration to further strengthen community support.", "q2r": 2, "assessor": "z_assessor_42", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}, {"id": 10985, "q0": "The proposal identifies a problem that in theory could be related to the challenge, but the problem could have been better explained. Currently there are several projects developing metaverses, in Cardano itself we have Pavia. It was unclear what the proposer means by more \"engaging\".\n\nI see a virtual hub as a potential direction within the scope of the challenge, but the proposal does not clearly articulate how this virtual metaverse will impact the challenge/Cardano ecosystem, there is vague mention that it will serve as a space for promoting projects through galleries, but there is not enough information in the plan to judge the potential impact of this proposal.\n\nThere are no established metrics/KPIs (the KPIs referred to in the proposal do not have targets, so they would not serve the KPIs). The absence of clear targets and targets brings a lot of uncertainty about the potential impact of the proposal.\n\nAn almost identical version of this proposal was submitted to the Scale-UP Cardano's Community Hubs challenge: https://cardano.ideascale.com/c/idea/400750\n\nBoth proposals have the same purpose.", "q0r": 2, "q1": "The Carnivilla project is already under development, by checking the website it is possible to see a working application and get an idea of ​​what the virtual hub would be like. The proposers have relevant experience for the development of Carnivilla, they are already developing the project, but there are no sources to check their qualifications. There is no mention of who will be responsible for marketing and this part is essential for the project to succeed, so I would recommend to the team to define who will be responsible for marketing and add links so that it is possible to check the qualifications of the team members (Linkedin , Github)\n\nThe budget presented has been divided into three parts but they are not detailed enough for a proper assessment to be made. It would be important to estimate the hourly workload in order to understand whether the requested budget is relevant. In addition, it is unclear how the marketing budget will be used.\n\nThe milestones presented in the roadmap use vague definitions. There is no clarity on the stages of development, there is a lack of details of what (and how) will be carried out at each stage.\n\nAn almost identical version of this proposal was submitted to the Scale-UP Cardano's Community Hubs challenge: https://cardano.ideascale.com/c/idea/400750\n\nBoth proposals have the same purpose.", "q1r": 2, "q2": "The proposal needs to better articulate the problem, what is the importance and potential of the metaverse? What can Carnivilla bring in relation to the projects that already exist? The presented solution needs more clarity. How will the team approach projects and members of the Cardano community for them to participate? How will marketing be for the virtual hub to be successful?\n\nThere is a roadmap for Q1, Q2 and Q3, but the development stages contain few details and the milestones are subjective and poorly explained, which would make it difficult to audit the development.\n\nRelevant metrics were defined to monitor performance, but there are no goals with clear targets/KPIs, which makes the performance evaluation subjective. I would recommend adding metrics on the number of projects developed on Cardano participating in the virtual hub, KPIs with targets and a more detailed roadmap with more objective milestones.\n\nAn almost identical version of this proposal was submitted to the Scale-UP Cardano's Community Hubs challenge: https://cardano.ideascale.com/c/idea/400750\n\nBoth proposals have the same purpose.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 0, "ne": 0, "ng": 0, "nfo": 0, "vca_o": 1}], "solution": "Launch and maintain a network of communal hubs across multiple platforms to market the Cardano ecosystem while onboarding participants.", "experience": "Team has a working background in Event Production and Communal Marketing structures that is being translated into virtual environments."}