{"id": 400858, "author": "jepzapata", "title": "Unified Transport Payment Gateway", "url": "https://cardano.ideascale.com/a/dtd/400858-48088", "category": 26445, "amount": 40000, "description": "Need for blockchain global standard for Unified Public Transport Payment Gateway allowing secured & fair transactions using smart contracts.", "f6_no_assessments": 4, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 1207, "q0": "The proposal identifies a problem within the challenge and proposes to develop a decentralized Payment Gateway for public transportation. Regrouping multiple transport companies into this platform could be very useful for people and could bring a lot of new users into the Cardano world. IT would be interesting to consider why people would choose this platform since public transportations already have websites where to purchase their tickets. Also, it means that using this platform, prices will be higher considering that to be financially sustainable, the platform will have to charge fees.\n\nAlso, the proposer wants the platform to be decentralized over centralized, what advantage will it bring? Why this choice?\nWhy using crypto will make it easier for people who want to travel, especially from remote area?", "q0r": 3, "q1": "The general idea is interesting and the team has a good backgroung in transportation services and project management I think. Nevertheless, the technical part of development of the platform and the coding part is absent in this proposal. Also, The team does not contain anyone able to code and build the platform. \nDoes the proposer want to integrate a wallet within the user accounts to be able to pay for ticket transportation? If so, this is a lot of work and time to make a secure feature.\nAlso, the plan of 1 million users within 2 months would include probably hundred thousands of dollars of marketing. How do they plan to bring this amount of people in such short time, especially with the pandemic?\nThe proposer list several interesting  future challenges but does not propose any solution to them. It would be interesting to think about a solution in advance and write it in the proposal.", "q1r": 2, "q2": "The answer to the description on how the progress of the project will be measured is:\nUsers/travelers - whether you are resident or a visitor that uses a mode of transportation, it will be easier for you to commute because of the readily available payment mean\nPayment solution providers - since there is a reduce barriers of transportation options, an increase in the number of ridership means an increase in revenue\nGovernment/Transportation policies - Unifying payment creates fair benefits by allowing access to lower fares and better payment method\n\nUnfortunately that will not help the Cardano community to follow the progress of the development of the project. It would be interesting to have a Github link for example or any other solution. Sharing progress or struggles in the development of project may help proposers to receive feedback from the community and so to be more efficient.", "q2r": 1, "assessor": "z_assessor_1311", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3028, "q0": "The proposal is based on building a unified payment solution for the public transport in Philippines. The value added to the Cardano ecosystem is through the new users and added tx volume.\nMetrics and KPIs are presented including the estimates.\nScaling is not particularly mentioned besides acknowledging that it is a large undertaking.\nOverall, the proposal is aligned with the challenge goals in providing B2B and B2C solutions.", "q0r": 5, "q1": "The proposing team is presented as experienced IT industry veterans, but there are no links to verify the credentials such as Linkedin profiles or similar.\nThe budget and milestones are clear, although I did find it a bit ambitious - 1 mil users in 2 months. Given the size of population it might be feasible, but is the app scalable to such numbers? Some details in that regard would be beneficial.\nTimetable for complete delivery sounds reasonable from the development point of view.\nThe risks are mentioned and mitigation actions provided.", "q1r": 4, "q2": "Roadmap and milestones are clearly presented and easy to monitor.\nKPIs are quantifiable and measurable, such as number of users.\nTimetable is given and can be monitored.\nThe problem and the solution is clear and definitely inside the challenge guidelines.\nOverall, a solid proposal with real-world value to the end user-->convenience.", "q2r": 5, "assessor": "z_assessor_160", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 6869, "q0": "This proposal describes in detail a solution for a unified payment system for the transportation industry. From this point of view, this proposal fits into this challenge. However, it is not clear from the description how this approach differs from similar projects and initiatives. If this is better described, I could give a better rating. ", "q0r": 4, "q1": "The team seems to be capable of delivering the bwritten solution. However, from my point of view as a marketing expert, the go-to-market strategy is not coherent enough. As the proposers themselves recognize, it is often easier to create a solution than to establish it in the market. I see the budget as fair. ", "q1r": 4, "q2": "The result and the roadmap are clearly defined. It would still be helpful if a documentation source like Github would be deposited. This would make it easier for the community to track the progress of the propsoal.", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 9780, "q0": "This proposal suggests a decentralized payment platform based on the Cardano blockchain. Making payments in the transportation industry more transparency and fair. The system can integrate all existing modern payment forms such as EMC, NFC, QR Code, Digital Wallet, etc..\nThe solution will change the way to recognize blockchain applications. It helps more people access the blockchain platform. It is highly practical and impacts many people through the convenience usage of means of transport. \nThis proposal is valid and addresses to the challenge’s criteria.\n", "q0r": 4, "q1": "This proposal will be implemented in 6 months with 3 specific periods. Tasks and results are completed weekly, so the deadline controlling is very easy. The proposal’s roadmap is reasonably designed, step by step.\nThe main portion of budget is to pay for the team, who build dApps, integrate with blockchain and interbank payment system. The budget is well allocated in single phase with costs and a list of specific work done. \nThe committed team members have a lot of experience in the fields of banking, computers science and business administration. In addition, I’d like to suggest the proposer to add people with experience in building platforms on the Cardano blockchain, namely Haskell, Plutus languages for building smart contracts to perform automatic fee collection and payment transactions. Also, I’d like to see more working background profiles of the team on LinkedIn /Telegram to increase transparency.\n", "q1r": 4, "q2": "This proposal is well prepared in professional way with the roadmap and work results completed according to each clear KPI. The timeline is clear with achievement by specific numbers. Its very easy to be audited.\nThe proposal’s budget is reasonable for the work to be completed of the project.\n", "q2r": 4, "assessor": "z_assessor_759", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "To develop a decentralized Payment Gateway using DLT and DApps on Cardano employing smart contracts for payment transactions across parties.", "experience": "-Major player in the Public Utility Vehicle Modernization Program in the Philippines focusing on Transportation Payment Technology\n\n-Experts in the fields of technology, business, fintech, and public transport\n\n-We have identified the gaps to achieve payment interoperability"}