{"id": 400989, "author": "dvd", "title": "Spring water solutions for Africa", "url": "https://cardano.ideascale.com/a/dtd/400989-48088", "category": 26445, "amount": 100000, "description": "Retail bottle water has a very low or non existent mineral content, not hydrating the body of kids and workers in Africa, leading to fatigue", "f6_no_assessments": 5, "f6_rating": 1.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 845, "q0": "While it's difficult to provide a 1 star rating for such a thoughtful and meaningful business initiative, I can't see any direct way that the cardano ecosystem provides utility or value to your SAY YES proposal other than purely the funding element.  There may be ways to integrate this opportunity into the cardano ecosystem, and there are a lot of helpful and collaborative members of the community online.  Perhaps you could connect with some of them to develop this more, and come back for a later fund.", "q0r": 1, "q1": "There is very little information in the proposal, attachments, or social media account provided which would indicate that the team has any experience or capability to execute this model.  There is no timeline or budget breakdown present, and the overall business model appears to be very conceptual at this stage.", "q1r": 1, "q2": "The proposer mentions that product movement is likely the only way to audit progress based on this proposal, otherwise they would need to establish alternative metrics in the future.  I'm just not sure this proposal is appropriately placed in the cardano ecosystem or would have any way to monitor or evaluate success. ", "q2r": 1, "assessor": "z_assessor_1224", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 1180, "q0": "It is argued that the fatigue present in children and workers in Africa is caused by the low mineral content of water bottles available at retail. Here I must respectfully disagree because, yes, the mineral content of water is an important variable, it is only one variable that contributes to fatigue levels in people, so from this point of view I recommend the team to really think about what problem they want to solve and why the consumer would choose you versus your competitors. However, assuming there is something I am not catching in your problem definition, the solution you are proposing is to offer a water alternative with high mineral content, which seems reasonable to me. My biggest problem is that after reading this proposal more than once I don't see a clear relationship as the team proposes to leverage the goodness of Cardano to help solve the problem. A market and business has a lot of potential if it can synergize with what Cardano has to offer, so I invite the team to get in touch with teams like WADA who I am sure can come up with a much more attractive proposal in upcoming funds, for now I must rate this proposal with 1. ", "q0r": 1, "q1": "Regarding the team, there are 5 people with different backgrounds that complement each other well for a proposal of this type. However, the necessary links were provided to verify their skills and experience. If the link was provided to the Facebook page of the company \"SayYes\" in after a quick review it appeared to be a legitimate business, although unfortunately I tried to access the link to their website that was on the facebook page and it did not appear to be working. When evaluating the budget, unfortunately the necessary information is not presented to make a proper evaluation of this as there is no discrimination between the different items that compose it, therefore it is impossible to know the team's logic to reach the requested amount. Regarding the implementation plan, the only information provided is the intended approach, which would be the scaling of the project. Based on the above my recommendation to the voters is not to approve this proposal, for the proposers to take this feedback and incorporate it into their proposal for future Catalyst cycles, my score is 2. ", "q1r": 2, "q2": "Finally on auditability issues I only had the opportunity to analyze two metrics presented. Which are associated with the traceability of the weekly volume and monitoring the level of growth after the implementation of the scaling strategy, these seem to me appropriate for the type of business they maintain. When analyzing what are the expectations of success the team describes \"When local communities order and we see the product at sports days, refrigerators etc\" this is very vague and difficult to measure, it is necessary to find metrics that allow the community to audit during implementation. I hope this justification will help the voters to decide not to approve this proposal for this fund, and for the proponents to take this feedback and come back in future funds. Congratulations for the noble initiative. ", "q2r": 3, "assessor": "z_assessor_130", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 3029, "q0": "The proposal is for a distribution of bottled mineral water and it seems has no connection to Cardano.\nThere is no metrics or alignment in relation to the Cardano Catalyst Challenge goals.\nThis proposal is a business proposal, not a Cardano related one.", "q0r": 1, "q1": "The proposers are a team of non-professionals entering into water distribution business.\nFunding, budget and needed resources are missing.\nThere is no connection to Cardano mentioned.\nTimetable is lacking as well as reasonable milestones.\n\nThe proposers should re-evaluate their connection to Cardano and how Cardano ecosystem would benefit from this substantial funding.", "q1r": 1, "q2": "The proposal lacks serious roadmap, milestones, measureable KPIs/metrics and estimation thereof.\nThe problem statement as well as a solution are not beneficial to the Cardano ecosystem.\nIn its current form, there is no auditability possibility as there is no use-case for Cardano.", "q2r": 1, "assessor": "z_assessor_160", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8361, "q0": "I don't see how this proposal checks any box related to Cardano. There is no point related to any cryptocurrency let alone ADA. I have to say that this proposal is not addressing the challenge at all. The idea itself is ok, but not in it's current state without any real plan. ", "q0r": 1, "q1": "At this point there is no plan therefore there in no chance of this project being successful. There is a request for 100.000$ without any proper explanation how will it be used, at what time plan, who will participate and how will it help in general the community. There is lack of information on all levels of this proposal. ", "q1r": 1, "q2": "The information is not sufficient. As mentioned there is no cost breakdown, there is no timetable, no clear plan. In general, there is zero chance to keep progress of this project. Have to say it is a hard no from my side to give green light for this project in this current state. ", "q2r": 1, "assessor": "z_assessor_672", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10089, "q0": "I love the idea of building a clean water solutions for Africa. Although the proposer already have products and have been implementing this solution for a while, this proposal has not yet clarified more detail the target customers as well as the specific plan in each stage to reach their target customers. As proposer said, It is difficult when people choose for the cheapest possible sources of water and don't consider of drinking pure water and solution is SayYes have to be more niche and select airports and lounges as clients in this market is more aware and willing to pay for quality. I wonder that Are you only focusing on this segment? or how long will you focus on this group and what are your next plans. How to address the challenge of providing high nutrient water to Africa.", "q0r": 2, "q1": "I would be nice if the proposer can show roadmap, detail action for each given time period. It will help people clearly understand how the proposer implements these ideas so that the feasibility of the project can be assessed. In addition, the proposer only mentions the team members and their role in the project but does not provide information about their related experience and achievements so it is difficult to evaluate the capacity of this team members.", "q1r": 2, "q2": "This proposal does not set out information about KPIs, key metrics or any clear deliverables, even the proposer requested a fund of 100000 USD but did not specify what and how this money was used. So it was impossible to audit progress or success of this proposal.", "q2r": 1, "assessor": "z_assessor_792", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "The solution is 'SAY YES' spring water with a high mineral content that hydrates & replenishes a child & workers", "experience": "Drinking water with high nutrients keeps me hydrated and focused on the tasks at hand. I use my cognitive ability to generate and income and see what happens to me and my kids when we are not giving the body the correct minerals. it leads to fatigue and lower  overall energy."}