{"id": 401150, "author": "rhysstoic", "title": "NFTPass: NFT Ticketing Solution", "url": "https://cardano.ideascale.com/a/dtd/401150-48088", "category": 26445, "amount": 50000, "description": "Fake Ticket sales for sports, music & travel cost the public millions of pounds every year in the UK", "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 3385, "q0": "The proposal has clearly presented their solution to authenticate NFTs, offering better user experience for individuals and enterprises. They has fully described how their NFTPass works, the scope of the project, their targeted industries and the marketing strategy to develop NFTPass. The positive impacts of the solution on crypto industry and the Cardano Blockchain are well portrayed as well. These expected prospects are closely aligned with the key metrics of the challenge, showing their extensive research and careful preparation. These can be the solid base for the community to assess their ability and the potential of this solution.\nThe main challenge of the project is mentioned, however this can be less concerning because they has ensured a few connections to help them mitigate this problem. A small suggestion from me is that they can come up with future strategies to expand their networking so that they have opportunities to pitch more businesses to trial their project. By doing this, they also can show their proactivity and good risk management to the community for better evaluation. \n", "q0r": 5, "q1": "Their delivery plan has been divided into 3 main phases with specific estimated periods of time. These milestones can be useful measurement tool for the community to follow and see if they can ensure the project is progressing at the planned speed. In each phase, the required tasks are well presented. This realistic plan gives the community good visibility to their whole project. \nA detailed budget breakdown covering the main costs has been provided. This breakdown is proven to be in tune with their operation plan. The community can base on this financial plan to examine the rationality of their spending as well as their allocation of resources. \nThe information of the team members are provided, their position and LinkedIn account are also included. However, they can add a brief description of each member covering their working experiences, skills and ability. Therefore, instead of clicking each link for more information, the community find it more convenient to assess the team’s capacity and strength to successfully deliver the work\n", "q1r": 5, "q2": "The desired outcomes are provided to measure the project performance. By achieving these outcomes, they wiil able to prove their sucess. For some important indicators such as lead generation, meetings and discovery sessions conducted, they can add specific desired numbers so that it will be more clear and easier to for the commuinity to track. The ultimate goal of increasing Cardano Blockchain adoption is clearly identified, helping them keep the motivation and stay on track.", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4814, "q0": "The introduction of the project sounds good and promissing, they have many possible applications. Basically, everything that needs access management can be an application of this project. \nThe team knew what their biggest challenge was but their supposed solution was not very clear. They mentioned \"a few connections in the industry\" but don't really show what the connections are and whether it is reliable or not.\nThe writer also stated that they have the wireframe of the app done, they should show the wireframe as a proof of their work.", "q0r": 5, "q1": "The budget could be shown in more detail. The plan requires 5000$ for marketing materials to approach big businesses but they need to list what those marketing materials specifically are. The same goes to some other categories in the budget such as 10000$ for servers and infrastructure, etc \n\nThe proposal should provide the team members with social media accounts or something to better know their prior experiences. This way the community knows whether the team is capable of their ambition or not.\n", "q1r": 3, "q2": "To make the success of this project more measurable, the team should address clearly how they know that the project is a success (with metrics or something the community can easily keep track of)", "q2r": 2, "assessor": "z_assessor_1775", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5551, "q0": "The scope of the proposal is to build 2 apps, one for the user and one for enterprises, that will help ensure the authenticity of ticket NFTs and validate them without any transaction costs or need for block minting.\nThe project will offer additional features to Cardano NFTs. If done right and if it will be easy to adopt by both target groups, then it has the potential to attract a larger number of businesses to the Cardano Blockchain.", "q0r": 5, "q1": "The project plan and timeline are detailed, sectioned in 3 Phases, each divided into a timeframe with specific tasks to be accomplished. The budget is broken down into the main categories of development, however, some additional info regarding number of hours, would have helped even more in the assessment of the budget feasibility.\nThe team have described their skills, and offered links to their social profiles, leaving no doubt about their capabilities in implementing the proposal.", "q1r": 4, "q2": "The progress measurement is well defined, and easily accessible to the Cardano community: public GitHub repo, public Kanban board, monthly update videos on YouTube.\nThe success definition is very broad, and only on a long-term basis. There is no immediate success for the project, for example: having an X number of businesses use the app in X months after release would considered a positive outcome of the project in short-term/long term.\nHowever, based on the rest of the information from the proposal text, I do not see the lack of a success description as having too much of a negative impact on the outcome of the entire project.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5593, "q0": "This proposal fits the challenge perfectly given it is thought to be a business solution that will promote the wide scale adoption of the Cardano Blockchain through NFT tickets being used in countries all over the world and avoid fake tickets being issued and used at events, for traveling, etc. This solution seems to me like a total game changer in the ticketing industry, since as of today there does not exist a solution to fake ticketing, and it is clear that NFTs are here to solve this problem if they are approached in the right way. This gives NFTs a real use case that is not just art or the luxury of having a unique GIF or image, but makes them something you can use in the day to day and avoid the common issue of fraud.", "q0r": 5, "q1": "This is a proposal that was already being worked on and presented in Fund7 but did not get funded - so the team had the opportunity to dedicate a lot of time into figuring out how to make this solution a reality, and so far being involved in the space it has been an idea well received by people and has gained credibility in the past months given the following factors: 1. The experienced and diverse team behind it, with Web and software developers, UX Uis, SPOs, app developers, Marketing experts, NFT experts... a big project like this requires a whole bunch of experts and this one has it, which gives additional credibility to the proposal. 2. How the solution has been presented in the proposal. Very clear solution to a problem worldwide that will bring a credible solution and seems executable with the right people doing it. 3. Timeline is specific and seems more than realistic for such a big project (initially 18 months seems fair). Dividing it in phases is the right way to go and there has been a deep dive in each phase with specific time frames and details of what needs to get done in each of those milestones. 4. Budget that is realistic and in my opinion could be even a bit low for all the work that needs to get done and the amount of time people will need to be working on it to make it a reality, but I understand the team are trying to be conservative and have a change to be financed which I think is the right way to go. 5. The team have taken the step to require a patent for this solution which gives you an idea of how innovative this is but also that there has been already quite a bit of work behind this to be able to apply for a patent for a certain process and product. This also gives additional credibility to the proposal. Since I saw this proposal for the first time I am convinced if this gets executed it will be a complete revolution for the events, travel and leisure industries and it will cure a lot of headaches not only for enterprises but also for people that get scammed when wanting to just go to a football match, a show, etc.", "q1r": 5, "q2": "As mentioned before, this proposal is well written, contains enough details about what solution it provides and how the team plans tro make it become a reality. Sufficient details on this as well as timelines, tea member credentials and budget gives this proposal an outstanding level of auditability and a high level of success too. This team want to make a big change in the NFT world and they seem to want to do it the right way. Diligent proposal overall with a realistic objective of being able to be used worldwide as long as the marketing work is done right and it seems like the team knows what they are doing. \n", "q2r": 5, "assessor": "z_assessor_2020", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "A simple NFT solution that can authenticate tickets without transaction costs or waiting for blocks", "experience": "Blockchain & DAO Devs, Plutus & Atala Prism Pioneers, Software Engineers and B2B marketing specialists"}