{"id": 401505, "author": "icq2006", "title": "Medical Research based ADA", "url": "https://cardano.ideascale.com/a/dtd/401505-48088", "category": 26445, "amount": 25000, "description": "Medical research nowadays are very centralized\nHealth system wont solve chronic ill diseases because it make them unprofitable", "f6_no_assessments": 8, "f6_rating": 1.375, "videos": [], "media": [], "f6_assessments": [{"id": 1697, "q0": "I give the proposal 3 out of 5 stars. This I give to the proposal as a combination of \n\n1) the very good impression I get from the short problem and solution statement and well-designed website for a CNFT provided and \n2) the omission of any follow-on detailed description is the section reserved for this. \n\nIt seems as if the placeholder proposal has been submitted and abandoned without going into reserve or being withdrawn? \nWithout this information, impact cannot be judged adequately.", "q0r": 3, "q1": "There is a link to a cool CNFT website for Spoonie, and its cool. Sadly, I cannot find any information about the proposer, the experience or background or portfolio of previously successful projects, accolades etc. Placeholders in the section dedicated for the Feasibility information have not been removed and the head section with tweet-length background and one-sentence description for problem and solution and unfortunately simply not enough to make any inference about the likely success of the proposal.", "q1r": 1, "q2": "Although the problem and solution statement sound very promising, placeholders in the main body of the proposal have not been removed and there are no key performance indicators, no qualitative targets, no check-ins with auditors or the community. In a nutshell, nothing to judge if the project is a success or not. This is disappointing and I hope the proposer will come back for the next fund.", "q2r": 1, "assessor": "z_assessor_1405", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1845, "q0": "The above idea is completely focused on Decentralized governance that will lead to medical research based ADA. It can be easily observed that we can't point out any clearly problem in this proposal. Unfortunately, the therapy they offer is not fully precise, leaving us puzzled. As far as I understand, you are aiming to apply DAO to public-private health services and medical research into Cardano's blockchain system, such an idea is also very urgent and legitimate. However, it seems that your proposal still seems to just stop at the idea side, so it is possible to better see the author's interpretations to better clarify the impact of the proposal on Cardano. As a result, I disaree that this proposal effectively addresses the challenge, and give it 2 points.", "q0r": 2, "q1": "It's evident that we can't find any information about the team, which makes assessing its viability tough. In truth, we are unable to share any information regarding the demo/pilot/prototype that was provided. Furthermore, I don't see any goal/target, KPIs/metrics, roadmap, or budget breakdown, which puts me in a difficult position to assess feasibility from this perspective. I'm perplexed because this strategy looks to be devoid of any risk. As a result, I disagree that this suggestion will be implemented successfully in the near future.", "q1r": 2, "q2": "It's evident that we can't find any information about the team, which makes assessing its viability tough. Second, there is no indication in this proposal that a roadmap exists. It's strange that no Key Performance Indicators (KPIs) or Metrics have been set up (Metrics). We simply learn about the overall budget; we don't learn how it's broken down. The underlying concept is good; hopefully, the proposer will elaborate on it in the next Fund. As a result, I strongly disagree that this proposal provides me with enough information to assess progress toward its stated objectives.", "q2r": 1, "assessor": "z_assessor_1413", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 3030, "q0": "The proposal is adressing the centralisation of medical data. The solution is to enable decentralzied governance.\nThe proposal is lacking: goals, metrics, budget, team and all other inputs and should have been withdrawn and idea elaborated more in the next fund.", "q0r": 3, "q1": "The proposal is lacking: goals, metrics, budget, team and all other inputs.\nThere is no plan, risks, timetable, deliverables etc.\nbeen withdrawn and idea elaborated more in the next fund.", "q1r": 1, "q2": "The proposal lacks roadmap, milestones and time horizont. There are no metrics or KPIs presented. \nThe idea and solution hold promise but needs a more dedicated approach and providing the necessary structure.\nAuditing is impossible. Way forward would be to gather a team with the skills necessary to define the solution more in depth and properly prepare for Fund9.", "q2r": 1, "assessor": "z_assessor_160", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6327, "q0": "Embryonic idea to create a way to do medical research using ADA targeted at unprofitable disease. Unfortunately there is nothing to be assessed so far as this proposal is only made of 74 words and a strange link to an animated spoon picture.", "q0r": 1, "q1": "This is just a draft proposal with nothing yet to be assessed. It should have been withdrawn.", "q1r": 1, "q2": "There is nothing unfortunately to be said for this very early draft proposal which is actually only expressing a wish.", "q2r": 1, "assessor": "z_assessor_40", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}, {"id": 6420, "q0": "The issue being Medical research are very centralized and won't try to find cure for chronic ill diseases because it would make them unprofitable the proposer is trying to resolve it by making a Decentralized governance that will be helpful for medical research. The proposer hasn't provided any details on how they will be doing it and also the proposal's solution itself doesn't make sense. The proposal doesn't explain the problem that needs to be resolved. The proposal doesn't consist anything so, it is not possible to say if this proposal add any value to the cardano community. The proposer hasn't provided any goals or any key performance metrics so, it is hard to say if the proposal's goal do align with the challenge or no. There is no explanation of solution for the problem or plan on how the proposal will be implemented or any details about on how the problem in hand will be resolved. So, based on this the proposer haven't completed the proposal it maybe due to time ran out or the proposer didn't wanted to complete anyway this proposal doesn't address the problem ", "q0r": 1, "q1": "The proposer hasn't given any details about them or their team. No information has been given about the skill or previous experience they have. Without this it would be hard to tell if the proposal can be implemented at all. \nThe proposer has provided a budget of $25000 but not sure why they needed it or how they will use it to resolve the issue. The proposal doesn't consists of budget breakup or any info about the budget. With all this missing it is not possible to know why the budget was requested. The proposal doesn't consists of any plan or any explanation to the solution of the problem. The proposal is incomplete may be the proposer missed the deadline or due to other reason but at present state this proposal won't be implemented successfully", "q1r": 1, "q2": "The proposal doesn't consist of roadmap with goals to reach within a time period and it also doesn't have any information about the solution they are planning to work on. The proposal is missing all the details needed to understand the solution for the problem. They have provided their NFT website link which doesn't have any info which can be helpful for to resolve the challenge. They have also not provided any details on budget breakdown or about how does the success for this proposal would look like. Haven't given any details on how to track the progress and development of the proposal. With the information available  the given info won't be enough to audit the development and the success of the proposal", "q2r": 1, "assessor": "z_assessor_419", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6530, "q0": "Draft proposal. The problem presented is relevant but I would recommend that the proposer give more information about the context of the problem with data, so that it is possible to make the relationship with the challenge, due to the lack of clarity in the objective of this proposal there is no way to evaluate the impact on the challenge . There are no targets/metrics, so there is no relevant indication of impact. I recommend that the proposer use the following documentation to prepare a proposal on Catalyst in the next Fund:\n\nhttps://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true#", "q0r": 1, "q1": "The proposer mentioned some areas of experience, but in a vague way and without references so that it is possible to validate them. Because the proposal is a draft and does not contain a plan, there is no way to play if the proposer is able to develop it. There is no more information that allows us to assess feasibility, I recommend that the proposer add items to make the proposal viable, as indicated in this documentation:\n\nhttps://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true#", "q1r": 1, "q2": "There is no information to assess auditability. I suggest the inclusion of metrics/KPIs, a plan with milestones and, in general, more clarity in the solution to the problem presented. The following documentation can serve as a good reference:\n\nhttps://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true#", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7737, "q0": "This proposal want to make a decentralized governance that will lead to medical research based ADA, but not explaining more about that solution. This is a noble idea, but maybe proposer need to explaining more about what they will partnered with, how the project will work, etc.", "q0r": 1, "q1": "It is literally a draft proposal. Proposer did not wrote anything about budgets, team member and roadmap. I suggest proposer can brainstorming first with Catalyst School or any communities who help their member to make a proposals.", "q1r": 1, "q2": "This proposal is can not be audit. Proposer only wrote their link about their CNFT projects, while their roadmaps (in website) not mentioning anything about this proposal.", "q2r": 1, "assessor": "z_assessor_639", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1}, {"id": 10130, "q0": "This is an interesting idea and if this idea becomes reality, it will bring huge impact to millions of people who suffer from chronic ill diseases. However it seems like it is only in the form of an idea, to implement it needs more details on this idea to be able to turn it into an actionable plan. For example, how the research will be conducted?", "q0r": 3, "q1": "He already had the website to receive donate, it's a good sign that he is enthusiam about the project and he will action on it more on the future. Plus, his wife is chronically ill for the last 13 years. yet have been diagnosed. From this fact, likely that he has the motivation to make his idea come true. However, the proposal just includes some sentences to demonstrate his idea briefly. The proposal should include more details about the research and plan for each activity.", "q1r": 2, "q2": "The proposal just includes some sentences to demonstrate his idea briefly. It should include should include clear Roadmap with Stages and timeline for each activity. The key metrics also should be mentioned to make the proposal more auditable.", "q2r": 1, "assessor": "z_assessor_809", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Decentralized governance that will lead to medical research based ADA.", "experience": "entrepreneur, running both technical and creative businesses. Filmmaker, Cinematographer, Producer.Owned  Software company and an active consulting.\nOwning Stake pool on the Cardano blockchain.\nMy wife is chronically ill for the last 13 years. yet have been diagnosed."}