{"id": 401616, "author": "bridgebuilders", "title": "Bridge Builders Operations", "url": "https://cardano.ideascale.com/a/dtd/401616-48088", "category": 26445, "amount": 100800, "description": "Projects can be accelerated and improved with timely mentoring. Gaining access to mentors with strong Catalyst experience is difficult.", "f6_no_assessments": 6, "f6_rating": 4.722222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal has been described in a detailed way. First, they provide the background of their solution (the Bridge Builders), showing the necessity and the driving force behind their project. They clearly point out the problem that their targeted audiences (the funded project, startups, entrepreneurs through Catalyst community) are encountering and therefore, offer a reasonable solution. Some of the main functions and main features of the Bridge Builders are well presented in the proposal. They effectively illustrate their desired results, how they gonna operate their mentoring, and its positive impacts on their targeted audiences and the Catalyst Community. All information is written adequately in a logical order, enabling the community to easily follow and understand.\nThere is a slight concern mentioned related to the commitment of the team, but they ensure that they can keep everything under control since the team member’s engagement has been proven through their past work. \n", "q0r": 5, "q1": "They have provided a road map from may 2022 to july 2022 including 4 main activities (project mentoring, group experience facilitation, public meetings/events, and content creation) and the subtask for each activity. The community can use this roadmap to monitor the progress and detect any delay that may happen in the execution process.\nTheir spending plan is also included in the proposal. This detailed budgeting plan is linked to their action plan and broken down into 3 main sections with specific numbers. This allows the community to oversee and understand whether their spending is effective or not. \nThey make a strong team with highly experienced members. Their positions, past work, and LinkedIn accounts are provided in the proposal. As they mentioned, they are committed members proven through their past work, they have a huge capacity to ensure smooth workflows and high productivity.\n", "q1r": 5, "q2": "They assure that their services, actions, operations, and constant updates will be published via Bridge Builders website. Their achievements and failures are also reported monthly. This can help the community get the clarity of the project and easily track down the process. The specific KPI and metrics are also provided to measure the progress and the development of Bridge Builders, maybe they can add the required numbers for each metric to be defined as successful. The success of the project is also clearly visualized through specific deliverables presented. This will allow them to stay focused and have a clear direction to achieve their ultimate goals", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The frist thing that I quite like about this project is the way they present the project so clearly, they provide the reader with the background of the proposed team, which is composed of committed and engaged Catalyst Community members. bundle together and provide value to their environment, they will identify gaps in the ecosystem to co-design and deliver the necessary solutions. They have also specifically indicated the challenges they will face when supported and what they will do to address the challenges, in my opinion, the activities they will undertake will address the challenge.Some of the activities they will undertake are forming and developing a team with experts in specific fields to provide tailored services to sponsored proponents. Build bridges working with diverse community groups to mentor them in a variety of business and leadership areas. Improve the architecture of the community network by suggesting new ways to benefit Project Catalyst and the wider community network... All activities have positive influences on the community, especially giving participants access to mentors with solid Catalyst experience.", "q0r": 5, "q1": "The roadmap section they show quite briefly provides the main activities that they will perform, however, in my opinion, some activities are not very specific such as what tasks will be included in the group experience support, or how will the public meeting/event be held, when and on what scale, and how marketing & PR tasks will be carried out....the budget is divided into 3 parts main, core services, Activities, and additional positions, these all correspond to the roadmap. The existing staff all have many years of experience, especially in the industry of experience and business, the market, if they can recruit more excellent PR & Marketing and Website development staffs, I believe this will is a strong group.\n", "q1r": 5, "q2": "The proposer will update information on services, activities, actions, through the website and media center, and highlight the achievements and failures in the monthly report of City Hall, so I think it will be easier for us to track the progress of the project. The metrics are also very specific so we can measure the development of the project through us. The success of the project also corresponds to their activities in the roadmap.\n", "q2r": 5, "assessor": "z_assessor_1701", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The objective of this proposal is to assist funded Catalyst proposals convert from a collaborative project into a professional, self-funding one. The team will be offering online workshops at After Town Halls, as well as 1:1 customised workshop to selected projects for a timeframe of 6 months.\nIt could indeed be highly important, for those who do not have the necessary knowledge, to receive guidance in how to move their project further, into becoming more than a funded Catalyst proposal, as they could be the future generation of web3 businesses. However, there is no proof of need of this type of action, there is no mention of an analysis of funded proposals facing this type of issue. If there is no information about such a need arising in the Catalyst community, why not wait until it is visible and then start such a project. If there is such information, then why hasn’t it been presented as argument for the necessity of the proposal? \nAs such, I cannot judge the impact the proposal might have on the Catalyst/Cardano ecosystem at the moment.", "q0r": 3, "q1": "The detailed plan and timeline are adequately described, considering the purpose of the proposal. The budget is sectioned in the main services the team will provide, however there is no further break-down that explains what each category represents, for example: what does the budget section for “Community Architects” exactly cover and why does it require $20000? How many of the team members are community architects, how many hours for that function are being allocated to it etc.\n The team description is comprehensive, the proposers have offered detailed descriptions together with links to their social profiles (LinkedIn).\nI am confident the team can successfully implement the proposal and deliver good results, however, some of the gaps in the budget description raise questions that compel me to draw at least 1 point from the feasibility section.", "q1r": 4, "q2": "The team has a reliable plan to demonstrate the progress of the project, they will be offering constant updates on their website, After Town Halls etc.\nThe success definition, however, is not complete, there are no numbers or intervals/allocated timeframes that could paint a complete picture as identifiable measures of success. As it stands now, I see it more as being a progress measurement than a success definition - for instance, how many sessions and how many onboarded team members in a certain timeframe does the team consider to be a success, etc?", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "\nThe proposal identifies a significant flaw in the Catalyst funding system  “Once projects grow and take shape, pass successfully through the Catalyst Process, get voted, and receive funds, the funded projects face huge challenges.\n\n* How to transform collaborative structures into professional projects\n* How to build stable and sustainable projects in the Cardano Ecosystem\n* How to transform projects into \"legal bodies\"\n* How to find what you need when you need\n* How to find collaborative projects which perfectly fits your project, idea, and vision”\n\nMany Proposers are focused on the essence of their proposal. Whether blockchain development or platfroms or crowdfunding initiatives. In a first things first, totally ignore the questions like “After you get funded and successfully build your product, how will you find customers? How will you fund buildout of a commercially viable product or service?\n\nProfessional education and Mentorship is often needed to move their projects to the next level. But the Catalyst Community currently does not promote, and lacks experts and skilled structures to provide fast and effective support to those projects. --> That's where the Bridge Builders plans to step in. Helping with Team structures and agile concepts, Leadership education, Tailor-made business plans and strategies.\n\nBridge builders team, though experienced and highly motivated recognise further research is needed, to build  ready-to-use templates, guides and playbooks\" as tools for community members and proposers. of growth.\n\nGuidance, and Mentorship. In the first 3 months, from April 2022 to June 2022, we will concentrate on a maximum of 10 Projects which will have our accompany over an estimated timeframe of six months. During this time, we will stay in close and permanent contact with the accompanied projects, provide direct communication streams via the Bridge Builders Slack account and weekly Team meetings. In the 1:1 Accompaniments, we build close relations with the teams and their projects. This close relation is needed to fully understand the needs and desires of the project and to co-design tailor-made succession plans.\n\nAs well, they aim to support the eastern hemisphere. Offering a very important but neglected part of the community. A 1-hour Workshop each month in the Eastern Town Hall to inviting people from the Indonesian, Vietnamese, Japanese, and East African communities to join Workshops. In order to offer asynchronous participation the Workshops will be recorded and uploaded on the Bridge Builders Youtube Account. \n\nThis proposal has the potential to be highly impactful on our community, in a forward thinking manner\nWithout question deserving of a 5 star rating", "q0r": 5, "q1": "Everything proposed here is backed up by evidence of success in the team’s activities, every week for months.\n\nAlready the after town hall meetings have proven to be the main value of weekly town hall meetings (which are mainly just informative0. The real community building activities occur at the Bridge Builders' sessions. \n\nThe team members  are experts in Business, Project & Community Management and communication. As well they are veteran full-time community members, serially funded proposers, Community Advisors, Catalyst Circle, and Admin Team members. Together they have deep knowledge and experience with Project Catalyst and are passionate mentors. Truly a 5-star team\n", "q1r": 5, "q2": "The budget for operations and additional services is normal and appropriate for the objectives and easily audited by the community. \n\nThe budget for “operations” for 3 months, whilst not unreasonable, does not include enough detail to determine if it matches to the effort needed to accomplish the objectives. However breaking the budget down according to general metrics\n we can see a 3 month effort that costs $75,000 covering the expenses of 4 team members working part time results in an approximate hourly rate of $50 - $75 per hour. Well within the reasonable range for persons of this caliber. And the community already has already seen the level and quality of their effort.\n\nPerformance of their promises will be self-evident to the community.\n\nThis is the only factor in which I am unable to rate this proposal as 5 star. And instead offer voters a 4-star rating as guidance.\n", "q2r": 4, "assessor": "z_assessor_251", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "From the challenge brief, \"A business-oriented training or consultancy service.\"  I believe this proposal qualifies. I am excited about the assistance this group could give to the projects that need them. Community mentoring and networking is a huge value to all us builders.", "q0r": 5, "q1": "This group of four are well known contributors to the Cardano community. I appreciated learning more about them here. The plan is very well articulated and I am excited to hear about some of the programs being proposed. I hope this one becomes RL.", "q1r": 5, "q2": "Very well written proposal with clear timelines and budget breakdowns. It would be very easy to track the progress by looking at the number of projects they are helping. Success in this proposal is measured by the success of others.", "q2r": 5, "assessor": "z_assessor_407", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "The Bridge Builder team has identified a clear flaw in Catalyst: Mentorship and Business SKills. The team is diverse and has experience in a wide range of areas. Only the topic of marketing could be better represented. Overall, I rate the impact of this proposal with 5 stars, because it fits into the CHallenge and also helps some projects in Catalyst to become more professional.", "q0r": 5, "q1": "As already mentioned, the team is experienced and has already proven its ability in various projects in Catalyst. Therefore, I am 100% confident that this project will also be successfully implemented. The budget is high but definitely fair for the value that will be created. ", "q1r": 5, "q2": "The goals are clearly defined. The roadmap is also described clearly and in detail. The team has worked very transparently so far (Townhall and Swarm Gitbook) so I see the auditability as given and it will be easy for the community to track the progress of this proposal.", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Bridge Builders has been mentoring and helping the community since Fund 6. We provide events, 1 on 1 engagement, and project mentoring.", "experience": "We are experts in Business, Project & Community Management. We are veteran full-time community members, serially funded proposers, Community Advisors, Catalyst Circle, and Admin Team members. We have deep knowledge and experience with Project Catalyst and are passionate mentors."}