{"id": 402016, "author": "jonlief79", "title": "Web3 Commerce and Finance dApp", "url": "https://cardano.ideascale.com/a/dtd/402016-48088", "category": 26445, "amount": 45000, "description": "No way exists for decentralized trading of physical goods, and businesses rely entirely on central financial services for global commerce.", "f6_no_assessments": 5, "f6_rating": 4.133333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 1411, "q0": "The proposal has addressed the Business Solutions challenge effectively by providing the web3 marketplace for physical goods trading. It also explains the core functionality, the possible risk or challenges down the road and its potential to scale the project. The proposal could however tries to focus on one area of application which is urban farming and make a solid user case for that area instead of explaining in the proposal as finance and payment solutions which makes the feasibility of products questionable. ", "q0r": 4, "q1": "The budget is clearly outlined and have detail breakdown along with both timelines in development and deployment phase. However, there is no evidence of proposers and team profile (any reference sites would be useful) to ensure that the project can be carried out and implemented successfully. The team mentioned that they have already received the positive feedback of the core functionality of their smart contract yet there is no link of evidences in the proposal except their main website.", "q1r": 4, "q2": "The proposal has provided the clear KPIs for development phase and deployment phase in the form of new users acquired that would be acquired by the platform along with respective timeline. However, it doesn't state how the progress will be communicated to the community. Also A note for proposal improvement: the proposal hasn't mentioned 2 things which are 1) if this proposal is a new proposal or a continuation of past funded proposal 2) SDG rating ", "q2r": 4, "assessor": "z_assessor_1358", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3644, "q0": "The proposal clearly listed its target audience for this project which are businesses and normal users-non businesses. It did a great job in defining some of the technical terms to help readers easily understand even for people without knowledge in the field of blockchain technology. It is highly evaluated that the proposal provided a very detailed and full of information about the problem. It pointed out the problem of each target audience mentioned earlier, and based on that it suggested the solution for each before coming to a common solution that will solve all issues of both businesses and private users. Its solution for both businesses and private users is to build an alternative web3 platform that helps provide a model with a low selling fee, no payment processing fee, several free tools to build smart contracts, a high yield compound interest, and many benefits that blockchain tech offer (security, transparency,..). So it could be said that this proposal is aligned with the given challenge as it gives a solution that focuses on solving businesses’ problems. The core functions of this solution's products were also clearly stated. This part helps clarify more on how businesses and private users benefit from these functions and show the impact on them. It did mention the contribution of this solution to the whole development of the Cardano ecosystem but in the feasibility section. Instead, it should be mentioned in this Impact section. It presented statistics to highlight the prospective growth of digital currencies in the near future.  And it is the perfect time to develop web3 and a decentralized trading and finance platform for global commerce, which ultimately helps the Cardano network thrive. Some challenges related to each target audience were also given in great detail. It also gave an explanation that these challenges will be incrementally overcome.", "q0r": 5, "q1": "It did a great job in narrowing down the scope of this project to just two user profiles, not the entire global market, focusing on the agricultural product market and a web 3 market. This better secures the possibility of success of this project as it just puts their resources in scope and markets that they have experience and evidence to manage well. Besides, it proved the potential and feasibility of this project by emphasizing the impact of this solution on the Cardano ecosystem with the growing trend of employing digital currencies.  \nA roadmap that could be seen as a plan with a timeline was given in combination with a cost distribution explanation. This is also a great way to make it easier to follow how the project will take place and the cost for each phase simultaneously. All costs were given in so great detail and with some notes to explain more about them. Everything is so transparent and clear.\nAbout human resources, the founder of this project has a background in organic farming and this is totally suitable and beneficial for this project as it targeted agricultural products. Besides developers have experience in web3 and blockchain tech, which is another trustful factor for the feasibility of this project. Another positive signal showing the high feasibility of this project is that Web3 tech has already operated major functions needed for the project's platform and the team has also coded some smart contracts, tested core functions, and built up demos to receive feedback from the developers' community", "q1r": 5, "q2": "About the way to measure the progress and the development of the project, it provided the KPIs in accordance with the two phases mentioned in the plan, which is a great point to show the synchronization of the proposal. From that, it is totally auditable and evaluates the proceeding process.Another highlight here is that it clearly describes what success looks like. The success of this project is defined as reaching two milestones and meeting all KPIs with specific figures. It is extremely clear to see the criteria of each milestone that is expected to achieve and the easy-to-follow KPIs for a lot of factors with specific figures. In conclusion, this part of the proposal was well-written to help measure the proceeding process and evaluate the completion level of the project and how to conclude whether the project is launched successfully or not.", "q2r": 5, "assessor": "z_assessor_1665", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 4815, "q0": "The team attempts to help readers understand their concept by providing a well-crafted description of the project. They acknowledge the problems of their target users and emphasize their mission to solve these problems. They are also fully aware of the challenges they might have to face yet the solutions to those challenges are not very convincing. To be more convincing, they can support their solutions with market research results or statistics from open sources. ", "q0r": 4, "q1": "The proposal didn’t provide any detailed plan to acquire their mission. It only gives us information about the scope of the project, their focused market, and the project’s impact on the Cardano ecosystem which has already been mentioned in the Impact part. From what I can see in the budget breakdown part, the project will have 2 phases: development and deployment/operation. The team can at least specify what they will do in these 2 phases plus how they will do it. Take an example of the business development step, they could clarify how they intend to attract businesses and users. \nThe budget breakdown, contradictory to the timeline, is very detailed with the expenditure for each phase of the project. \nThe introduction of the team could be better, the only member mentioned was the principal founder with a background in organic farming. My suggestion for improving this is to add more information about the members like their roles, their expertise level, their prior achievements and experiences that make them suitable for this role. Because the purpose of this question is to decide if the team is capable of accomplishing their plan or not so in-depth understanding of each member is important. ", "q1r": 2, "q2": "If this is funded, the community will need to keep track of the project to see if it is developed like how it is described in the timeline. This is the reason why the team should have a platform to update the progress of their project. Other than that, this part was delivered quite well with a clear vision of how this project will turn out.  ", "q2r": 4, "assessor": "z_assessor_1775", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 5558, "q0": "Important notice to the voters:\nThis proposal is very similar to “Decentralized Trading and Finance” by the same proposer who is asking for the same amount for the same project, but written with somewhat different words.\nSince the proposals are almost identical, my reviews will naturally also be, since only the wording is different, but the message is the same.\nThe team is planning a web3, decentralised marketplace where individuals and businesses can buy, sell and trade physical goods with the help of blockchain technology, DeFi, NFTs, smart contracts etc, featuring greater transparency (verifiable ledger), smaller fees (0.5% - influenced by the low cost of transaction fees on Cardano), opportunity (openness of web3 and decentralisation) and reliability (transparency and security of open ledger and smart contracts implementation for each transaction).\nThe project has the potential to impact the world of commerce, blockchain and Cardano in a favourable way if successfully implemented and adopted by the targeted audience.", "q0r": 4, "q1": "There should have been a timeline and detailed plan provided in this section that could offer a clear direction and the steps necessary to complete the project. The team has instead provided another generalised description of their main goal and a statement on the proposal’s impact on the Cardano ecosystem, citing some numbers and information, that are not backed up by a source link.\nThe budget is very well broken-down, with a lot of information provided for clarity, as such, there is no additional requirement from my part.\nAs for the team members, the provided information is not sufficient to assess their potential in the successful implementation of the project. The proposer should have included a short description, containing skills and previous work for each team member, adding also a (professional) social profile link for verification. Without this information about the team and the detailed plan, I cannot correctly assess the team’s capabilities in implementing the proposal successfully.", "q1r": 2, "q2": "The team has provided KPIs for the 2 phases of the progress development, they are concise, but offer sufficient information. However, it should also have been clearly indicated how these KPIs will be able to be independently verified for implementation by the community. \nThe success metrics are well written, are linked to a timeline and are sufficiently detailed, offering a good visualisation of what the team wants to achieve with the project.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7963, "q0": "Create a decentralized trading platform for physical goods - something that doesn't have a strong, solid foundation on cardano. The team has technical experience in web3 and is an entrepreneur in the agricultural, food & beverage industries, and project manager. Ho has a noble mission when he wants to support small businesses, small farmers to participate in the market and balance decentralization through commodity trading on defi. While the idea hasn't been detailed in a research paper or whitepaper, it's an exciting idea that promotes real-world commodity trading on a decentralized platform.", "q0r": 5, "q1": "The team has a rather optimistic view of the crypto market, they choose cardano because of its sustainable development, low fees, smart contract functions, wallet... have been integrated. This shows that cardano is gradually attracting application development teams closer to reality. Their platform is aimed at trading commodities and agricultural products with a number of customers in the US and Colombia. Detailed planning and good vision are their strengths.", "q1r": 5, "q2": "They have detailed KPIs for different quarters, months, and stages and have numbers to achieve to show the success of the project. It's full of proof of progress and project management experience. I would like to see more communication sites such as twitter, youtube of the group - where you publicize information as well as receive comments from the community for this platform. Currently, there are not many projects on commodity trading on cardano and you should publicize the code so that other localities have the opportunity to refer to this model.", "q2r": 5, "assessor": "z_assessor_648", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "A web3 marketplace and exchange to buy, sell, and trade physical goods, with built-in tools and Defi protocols designed for business needs.", "experience": "Lief Olson- entrepreneur in the agricultural, food & beverage industries, and project manager.\nDavid Kulk- web3 and smart contract developer.\nAdam Sabotka- web3 and full stack developer."}