{"id": 404304, "author": "tormesh", "title": "Green Energy Decentralisation", "url": "https://cardano.ideascale.com/a/dtd/404304-48088", "category": 26445, "amount": 100000, "description": "Consumer have no way to pay directly the generator of clean energey, so the middle men take almost all the profit, bringing the prizes up.\n\n", "f6_no_assessments": 6, "f6_rating": 2.944444444444444, "videos": [], "media": [], "f6_assessments": [{"id": 4256, "q0": "Recognizing the issue of power transmission to customers, there are several flaws in the form of intermediaries, particularly in terms of cost and payment. This project's development of renewable green energy, as well as direct transmission of electricity to customers, would undoubtedly address that problem. Allowing consumers to pay entirely with a token not only allows them to deal directly with the supplier, but it also assures that customer information is protected, assuring user safety. However, while this is a great initiative, I have a few suggestions for the proposer. To begin with, I don't see it having any good influence on the Cardano ecosystem. This has a significant impact on the project's appraisal and authorization to proceed. The proposer should accept payments on the Cardano community using the ADA virtual currency token, therefore assisting the ecosystem in increasing the number of individuals of all ages and professions that utilize this community. Second, rather than focusing on the general user, the proposer should seek out a specific pilot location for this project. Should select those with high electricity costs or are encouraging the usage of green electricity to improve the project's appeal and ensure long-term success. Finally, it is a little ambiguous and confusing about the issues raised by the proposer. When presented with an issue without a solution, the absence of remedies makes the project tough to embrace and simple to abandon.", "q0r": 3, "q1": "The project is planned quite specifically and in detail each week. This is impressive since the proposer has meticulously planned and analyzed the most appropriate timelines for each project activity. A budget breakdown typically contains clear bullet points describing the purpose and amount required for each activity. Team leaders also have several years of expertise and have received both major and small accolades across the world. This is excellent news since it ensures the project's success in the near future. On the other side, there are a few omissions that I believe the proposer should fill. It is really good to highlight the two leaders' experiences, but it would be preferable if the proposer stated their names or linked a profile of the name. This allows investors to readily rectify inaccurate information about the participants and ensures that their identities will be remembered if the initiative is successful. Furthermore, the proposer should explain who is included in each team in order to boost the project's persuasiveness while also guaranteeing the interests of the participants. Finally, the proposer mentions costs for legal, accounting, and tax guidance, but I can't see the names of experts or lawyers in the group members section. This is significant since it not only confirms the project's authenticity but also assists investors in determining if those individuals are suited for the project or not. As a result, it is essential to include the above as soon as possible.", "q1r": 3, "q2": "To begin with, this section is rather brief and does not cover all of the bases. Instead of just mentioning the project's progress, the proposer should specify a time frame for implementation. This clearly has a number of advantages for both the project and the sponsors. Furthermore, the proposer should offer detailed measurements on the key performance indicators (KPIs) indicated in the proposal. To aid team members in doing exactly what is necessary and to assist sponsors in keeping a closer check on them, use specific figures or percentages. Similarly, more concrete data should be provided regarding the project's success. There can be 100 users for the first payment, or the number will rise for the following payment.", "q2r": 3, "assessor": "z_assessor_1713", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 1698, "q0": "This proposal does not address the challenge setting. It is not a business solution, as it is financial in nature only. The token that the project is creating cannot be exchanged for electricity from vendors, but by cutting out the middleman they need to find their own power plant and this will be a very \"un-impactful\", local green energy project that does not support decentralization.  Neither will it make use of Cardano blockchain or tech. Cardano comes into the equation by creating a token that is more speculation than utility - the proposers believe it to have \"double digit growth during the following years\". In my opinion, it would be better to propose a token that can be used by many successful green energy producers to reach customers, but not by creating both token and power supply from scratch and going it all alone.", "q0r": 2, "q1": "The team has very good resumes and highly educated, \"geeky\" people with passion in the project. Without a suitable IPP partner and a wider network of distribution or market research into possible use cases for this token, the business plan is not sufficient to make the quality of the people shine through. I think it would have been better to create a little bit \"traction\" in the real world and then find a blockchain solution that can scale. Electricity grids are not ideal for decentralization on a global scale, but I think that the idea of their token is a good one. The idea has however not been finalized and stress tested, and checked for partnership strategy, growth, scalability and so on.  Maybe asking for $10k to $20k instead of $100k and do more \"proof of concept\" and finding partners will be a way of making this into a success eventually. For fund-8 this does not look like a feasible business plan given the amount of funding requested at this stage in the product development.", "q1r": 3, "q2": "The proposal has 2 KPI, namely \"quantity of energy produced and tried to sell in the exchange\", and \"quantity of energy bought and consumed with our system\". No mentioning of targets for the KPI. The auditing section is very short and time goals are not there. The success will be judged by the ideal outcome that one day people can buy green electricity without middleman, which is a repetition of the solution and pitch but not useful to audit this proposal. There is no reference to a business plan or figures how to gradually build this ambitious project over time with something the auditor or assessor can use. If they need funds again in the future, we will not be able to say how well they have done in this proposal. I strong disagree that the auditing section is useful to guide along this proposal for Catalyst if it get funding.", "q2r": 1, "assessor": "z_assessor_1405", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3826, "q0": "The proposer's aim is to release a token which helps the exchange between electricity producers and their customers, cutting off the middle man - re-sellers. The proposal is very ambitious. I'd argue some critical points. Firstly, the biggest challenge with electricity is how to distribute it. So the middle men are actually the most important part of the process. And secondly, fiats work just fine as \"a way to pay directly between the generator and the consumer\". It's how the electricity distribution system works that does not allow them to buy and sell directly. Understanding the statements of the proposers could be true because the process may vary from country to country, I suggest that the proposer provide a clear example and back it up with statistics to make it convincible", "q0r": 2, "q1": "The proposed plan is spanned over 41 weeks with brief descriptions. In terms of budget, most of the budget is to set up a new Power plant rather than focus on the solution. For example, cost for Engineering Licenses for Power Plant, Structures of the Power Plant, Power Plant Equipment ...\nI suggest that the team should run a prototype with established electric producer to see how the idea works before committing bigger investment.\nThe team members remain anonymous. While there are stories describing background and experience of the team, a verifiable profile is still needed.", "q1r": 1, "q2": "Concerning auditability, some metrics are mentioned. But I'd argue that they are suitable for evaluation of Power plant business rather than the effectiveness of proposed solution, metrics such as: the quantity of energy produced, he quantity of energy bought and consumed. I suggest the team to run a prototype and gather feedbacks from all parties. Then metrics like: how fast is the transaction compared to current payment system and how much cost is reduced.", "q2r": 1, "assessor": "z_assessor_1685", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4598, "q0": "As green energy has gained more interest around the world since it has massive importance in the future, the presented model has great future ahead of itself.\nThe model wants to be a middlemen between producer and consumer , and even wants to set up tokens , where with only these tokens exchange of energy can be done, as the token availability increases in the future , the value of tokens will also get increased by this producers can gain a huge profits not paying any middlemen as fees.\nThe idea of setting up grid and making availability of green energy will also help buyers where they do not have to pay more money to it hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The only challenging task would be stabilizing the value of token , if there is instability in the prices of token , both producers and consumers will doubt investing towards token.\nExcluding that ,DAO Coders Inc who has  experienced team of Blockchain developers, Plutus pioneers, Veteran Community Advisors and Solutions Analysts ,the presented proposal can be implemented successfully, the team is also partnering with Dex and AMM companies which has great experience in such tasks hence with given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal clearly explained about the importance of green energy in the future, which will definitely increase the value of these tokens by 2030.\nThe proposal has even introduced the team with whom they'll be working with, and has mentioned about other partners of future and other funding partners needed to complete the project.\nThe presented plan has provided clear picture of time line and budget breaking of the project hence, The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1747", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 8072, "q0": "\"The team wants to make a decentralization platform that can help the consumer and green energy generator can directly exchange without middlemen and will spread globally this idea. I think their way to develop this idea is to align with the challenge but all of their inputted info in the solution session is only about the problem and context, I recommend that the proposer should provide some more content about the features, functions, or some activities, important component that their business idea will make to help us a better understanding about the solution. This will also help us assess the feasibility better. The good things are they have a good awareness about the challenge that they will face in the next years in this industry. But I think they should think about some move or strategy to face them. \nSo, most of the content is not so much detail about the solution but has a very clear about the market and focus on that. That's the reason why I rate for 3. \"", "q0r": 3, "q1": "From my experience, I can understand their outlines in the roadmap. They're not just info about the platform development but also about some consumer development strategy. But it's better if the proposer can describe more detailed content from them. Because this is a big project with complex activities with many types of stakeholders, including governments. So I believe that the community needs to know what the team will do in detail to assess the feasibility of the project. The detailed content of the implementation plan can also help us to assess how reasonable is of the required budget. With those lack of info, it's hard to assess whether the budget is sufficient or not. The team broke down the budget into positions that need for their plan which from my experience, I think is rather good for their outcomes development in the roadmap. Lastly, there are just 2 key persons of the team were shown in the proposal, their experiences are fit with this idea. But I hope that the proposer can provide some more info about people they need and plan to get them if they don't have a team now.", "q1r": 3, "q2": "Measuring the progress by energy exchange is one of the best ways to know the performance of this project. But for auditing their development of this project, the proposer should give us more tool and metrics to track their development progress including platform developments, activity developments... hope that the proposer can give us more info in the next proposal because I think this idea should be developed to help protect our mother Earth with green energy and benefit to generator - who invest to make this Earth more green. ", "q2r": 2, "assessor": "z_assessor_651", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10091, "q0": "I am very impressed with the idea of building a decentralized grid TorEnergy where electricity exchange directly between consumers and provider, cheaper without the middleman. This solution is in line with the trend of using green energy, which is sustainable and has potential in the future, and helps to scale up Cardano decentralization (the application of payments with tokens on the Cardano platform). On the other hand, I see the proposer has mentioned about the risks that may be encountered when implementing this project, it would be better if you guys had given some solutions to solve that risks if they occurred.", "q0r": 4, "q1": "It seems like this proposal only details on how to set up and operate the electrical grid in the beginning stage, does not mention the long-term plan such as how to this solutions approach provider and consumers, how to convince they change and apply this electrical grid to their operation. Since this proposal don't have plan for after official launching, I don't know how this project will develop after that.", "q1r": 3, "q2": "The proposer has outlined important KPIs from both the provider side and the consumer side, but how many quantity of energy produced and quantity of energy bought are enough to achieve the KPIs at specific period?", "q2r": 4, "assessor": "z_assessor_792", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Grid decentralisation with TorEnergy, energy exchange between consumers and generators, cheap green energy with no middle men.\n", "experience": "Our team is soul and Heart 100% geek. One of us set up his first computer at 8, setting his garage in fire while hacking a toast maker, electrical engineers set their first mini power plant at 16 and the other was key in several city's entrepreneurial ecosystems. \n"}