{"id": 404757, "author": "checkpoint", "title": "Checkpoint Metaverse", "url": "https://cardano.ideascale.com/a/dtd/404757-48088", "category": 26445, "amount": 80000, "description": "A lack of real content in multiverses and blockchain projects - a huge barrier to entry. No one knows how to distribute content. We do…", "f6_no_assessments": 5, "f6_rating": 3.5333333333333328, "videos": [], "media": [], "f6_assessments": [{"id": 1415, "q0": "Checkpoint proposal addresses Business Solution challenge by Metaverse solution. They attached their youtube link which shows how their metaverse is like. It is already available on oculus headset for free. The metaverse will expose the audiences to various brands and connect to web3 wallet for NFT integrations. Since they already exist in metaverse, it's unclear what is his proposition (whether it is for web3 wallet features only). At no point did they mention about Cardano, they could explain more the problem and the solution and why they are seeking funding. The proposal will improve much more if they try to be specific and point out what would be the impact if their metaverse were in Cardano blockchain. However, as I read through their feasibility section they provided a detailed plan and made it clearer what they are trying to do. Hence, my score on the impact of their metaverse solution will take this into account.", "q0r": 4, "q1": "Although the roadmap explain on what they are planning for 2022. They do not specify timeline so it is difficult to see the implementation of project in phases/months. The budget breakdown also offers no hourly rate for their work. Most of the budget will be spent on licensing fee. They do not specify if the licensing fee is a one time fee or recurring fee. Also there is no linkedin profile for team members despite being an experienced team in the field. The team lacks backup reference to convince the community that the project will be carried out smoothly. Despite how well qualified your team is, when you put up the proposal. You should ensure that none knows you before hand and have a link for reference is convenient and effective way to ensure the project will be carried out successfully.", "q1r": 3, "q2": "They have not elaborated how the number of people interacting with product IP can be used or raise any related examples. They should offer additional key metrics that the community can track any progress or development. They should offer how traffic across brands can be shared back to Catalyst community. How do they plan to reward for community engagement. The detail of which should be shared to facilitate the project auditing.", "q2r": 4, "assessor": "z_assessor_1358", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1699, "q0": "The integration of metaverse excitement and functionality into Cardano is a great use case for a business solution B2C by reaching out to Gen-Z and Gen-Y users who want to use avatars and crypto currencies. Reaching this audience and brining it into the Cardano ecosystem without directly charging or requiring complex wallet onboarding is fitting the challenge setting very well and integration of advertising and editorial services into the portfolio of Cardano use cases will be desirable for the entire community. I applaud the proposers for their vision of sharing their existing product for free and boosting the community size - I am thinking of a open source, decentralized Facebook / Google kind of business model, where instead of one giant corporation many users can share the revenue. So I think this is the right category as it is business, but it also brings other desirable features of what Cardano stands for, like bottom-up, free-to-use, open source, NFTs, excitement and self sovereign users into the equation. Excellent fit for Catalyst and this category.", "q0r": 5, "q1": "The look and feel of the product can be improved to catch up with the brand name metaverse competitors on Ethereum wallets. However, the team is sufficiently diverse and experienced. I see a good talent pool and passion to make this project available as described. The timeline could be more precise with dates given as weeks or months from launch or a calendar of 2022. I understand that the multiverse licensing makes the planning slightly more difficult but I think it is an oversight nonetheless and should be attempted as good as possible. The budget can benefit from a little more detail of the breakdown. It is reassuring to see working videos and weblinks already there and a product that can be used to expand on.", "q1r": 4, "q2": "The audit section is (as I have to say so often across many proposals) a bit short and lacks what I like to see from anyone who wants funding for a business plan: show that you understand what you are doing by giving some quantitative target figures, like x in a months, y in b months, z in c months. Otherwise I have to assume that they need help with accounting and budgeting and auditing and it will be awkward if they receive the first batch of Catalyst money and cannot continue because they do not have a \"numbers guy\" on the team and all the money is gone already without hitting the goal. Which goal by the way? Do you see where I am coming from? I like your proposal but this should be better structured, no need to attach Excel spreadsheet just look at those successful previous proposers who come back for funding and see what they have submitted - timeline, KPIs, all matching into a believable structure to guide both the team and the catalyst audit. Using a sentence like \"measured by the fact that we're able to secure marketing spend from game publishers\" is what you tell your friend over coffee but not \"Auditability section of business plan\". Sorry.", "q2r": 3, "assessor": "z_assessor_1405", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3390, "q0": "The proposers have described the main features and core functionalities of their solution. They aim to make the multiverse accessible across all devices, which is expected to exert positive impacts. These outcomes are well listed in the proposal, allowing the community to understand the mission of the project. Their mission is to expand the impact of videogames on society’s evolution and facilitate the adoption of Web 3.0.\nThe main challenge in the operation process is also the main problem to which they come up with the proposed solution. Making their content accessible to everyone is the ultimate goal they have set in the beginning. To see how they achieve this goal, the community can base on their action plan for better assessment.", "q0r": 5, "q1": "All the main activities in the execution process during 2022 are provided. However, there will be a need for a more detailed breakdown of this plan. They should add some more milestones when these tasks must be done so that the community can track and follow the progress of the project. By providing the specific dates, they also can detect any possible delay and come up with alternative plans to ensure smooth workflow.\nA budget breakdown is built based on their action plan and development orientation of the project. With these allocations, the community can assess their ability to manage costs and their financial strategy. The team can also compare these estimated spending with real-time costs to discover any cost overrun and propose some adjustments if needed.\nThe team is well built with highly qualified members. They have experiences in content and metaverse/blockchain, which are directly relevant to the project. These experiences will benefit them in proving their abilities and potential to run the project efficiently. A small suggestion is that they can attach the LinkedIn account address of each member to the proposal for further consideration.", "q1r": 5, "q2": "The progress and development of the project will be specifically measured by the number of people engaging with the product IPs. The community can see the rise of these numbers overtime to assess the performance as well as the development of the project. Besides, the website traffic and the ability to sell advertising are considered clear indication of the success. \nTheir ultimate goal of people consuming their content is a base to identify their success. By focusing on this goal, they will be able to set a clear direction and keep motivated to successfully achieve.\n", "q2r": 5, "assessor": "z_assessor_1651", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4819, "q0": "This is an interesting idea of creating a metaverse of content accessible via Oculus. They have already built the infrastructure and generated content on this platform but their aim is to create content on every platform device users can access. Checkpoint is planning to launch their NFT assets using Cardano blockchain, their initial release of tokens show some impressive numbers and money raised. This is a promising project. However, the proposal wasn’t delivered with enough information to understand who they are, the scope of their project, its impact on the Cardano community, and the purpose of this fund-raising proposal. I have to look through their website and connect all the dots to make the conclusion above. Hence, I won’t give this part of the proposal a higher point. One note is that the proposal should focus more on their impact on the Cardano platform", "q0r": 3, "q1": "The timeline wasn’t detailed enough to show the feasibility of this project. They just simply list their goals for 2022 but don't give us any plan to make these goals a reality. An example is with the goal to release their first sets of NFT cards, they should specify when they want it to happen and the content of their NFT cards.\n\nThe budget breakdown could be more specific. Let’s say their expense for equipment, what the equipment is and how many of them? Or the contingency expense, what is it possibly? Or the marketing expense, who they intend to hire, which services they intend to use? if they already have a marketing team, their information is worth mentioning. By adding these details, they could increase the transparency of the project. \n\nThe information of the team members is well-documented. Their team seems to be a competent one but they should provide contact information or social accounts to reach out if needed. ", "q1r": 3, "q2": "This part would be much more persuasive if the team provide the current traffic of their site and some estimated number of their growth in the future. On their orange paper there is an illustration to indicate the project future growth but it should be address more in this proposal.", "q2r": 2, "assessor": "z_assessor_1775", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8075, "q0": "I really like the idea of this project, the blockchain world, especially metaverse should have some media channel for distributing news and some other important content to users. This project is not only contributing news but also content that influences society, culture, education. The team also has their own product that is shown in the attached video clip and it's very clear and easy to understand. The proposer also summarizes their product features that can show how it will affect and scale more in the future. However, I think they should give us some info to show how their way of developing the idea will impact the Cardano ecosystem. Maybe some key metric will help us to assess how much this idea will impact. The proposer also shows their only challenge and tells that they will come over it in their plan, but not provide more detail about that. ", "q0r": 3, "q1": "Their roadmap is so general, just summarizes some activities that will be done in 2022 without a timeline and milestones. I hope that with this complex project they should give more content to show their detailed implementation plan for each of their outline activities. Because of that roadmap, that can't help us assess how reasonable it is of their budget. Furthermore, some of their outlined budgets are hard to understand that I believe for convincing the community for voting, they should explain what it is, including the Multiverse license fee. After all, I think their team members are well fit to develop this idea. ", "q1r": 1, "q2": "They state how they measure the number of people engaging with the product IPs. For this project, this is one of the key metrics that we should consider. And the proposer also tells us about the success of this project that stacks with the above solution statement. But relate to the roadmap and milestones that they provided, it's hard for the community to track their progress because of lacking tracking info. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Checkpoint:free digitally-interactive media brand on videogames' influence on society, culture, education; pioneering content on blockchain.", "experience": "I've been a journalist for over 20 years and have come from a BBC and Guardian background - broadcast journalist (award winning) . My team are veterans in their relevant fields.\n\nI have been in the games industry for over 15 years and have an already established audience."}