{"id": 404991, "author": "harry.hellyer", "title": "Soil Carbon Sequestration Audit", "url": "https://cardano.ideascale.com/a/dtd/404991-48088", "category": 26445, "amount": 30100, "description": "Agribusinesses want to proveAuditability of carbon-negative farming methods as a differentiator but don’t have reliable solutions", "f6_no_assessments": 6, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 490, "q0": "The results of this proposal should give agricultural based companies and enterprises tangible answers to concrete blockchain business use cases in the area of soil carbon sequestration. It would concretely benefit the cardano ecosystem in two large ways, firstly by identifying any gaps in the state of the blockchain at presents and the actual needs of the agrobusiness sector; and secondly, once built out could open doors to those in the sector looking to benefit from such tech, to do so in an ecosystem that has proven it can benefit them. What they're attempting with the sequestration auditing could benefit other projects working with carbon offsetting that have imprecise mechanisms of verifying impact, and if not directly, then potentially by providing a model of measurement and certification that would be key for integration with carbon credit markets. ", "q0r": 4, "q1": "The proposals doesn't seek to accomplish more than whats feasible with the requested funding amount, they have a fairly clear scope of action in the Miro board Project Roadmap attached. The team appears to have experience necessary, including a specialist in technology–business process integration and a person specializing in transforming strategic ideas into business assets. With respect to industry domain knowledge needs they've added a person with such insight on their advisory team. IMO it would be nice if they had at least one other person to not rely so heavily on one industry perspective. They've clearly identified the need for Plutus devs and have costed their time in their budget. ", "q1r": 4, "q2": "Roadmap and milestones are clear. What success looks like is also clear.", "q2r": 5, "assessor": "z_assessor_1171", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 1417, "q0": "The Soil Carbon Sequestration Audit proposal will solve agribusiness problem of needing prove auditability of their carbon-negative farming methods. The team will use the real business cases to do feasibility study as proof of soil carbon capture. The team indicates that this is a client backed use case by 2 major european farming group. However, the additional information (link/references) about these 2 clients are not provided. Also they did not provide any youtube link or official website link to show that the team has the project going on which raise a question on how they could obtain the 2 clients they mentioned. The end result of this project is Whitepaper that will describe the technical development needed to provide blockchain capability to the agricultural sector of economy. There is a potential risk for the project that the team has not mentioned is that feasibility study result is not always usable. In some cases, the feasibility study fails due to the high capital costs and one feasibillity study of 2 companies use case the team mention might not be applicable to other agribusinesses. If it couldn't apply to other businesses, the solution they propose will not have impact to Cardano ecosystem. ", "q0r": 3, "q1": "The detailed plan for 7 weeks are provided as their roadmap. The team has not elaborated on their past projects and their blockchain related skill or experiences. Nor do they provide the reference links for their profiles. Majority of budget will go towards writing a white paper. Each cost item also goes towards Edify team who is the current company of proposer. There could be multiple parties' conflict of interest.  As far as the feasibility study goes, the client companies will be the parties who sponsor the feasibility study. The Catalyst funding might not be suitable in this case. ", "q1r": 3, "q2": "They do not describe how their project progress and development can be measured. They also has not shared key metrics for performance measuring. The definition of \"done\" for this project is publishing white paper.  The proposal Soil Carbon Sequestration Audit has no metrics and KPIs that are chosen to evaluate success. The auditing of this project would be quite difficult and the person who do auditing will need to have specialized domain expertise to check if the feasibility study is well worth conducted.", "q2r": 3, "assessor": "z_assessor_1358", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1, "reply": "Impact / Alignment Flagged: the CA has not read / or maybe understood the proposal does not appreciate how projects like these are positioned, and also does not respect our position and authenticity. In these situations large mid tier organisations in particular will usually not want to broadcast their intentions, publicly – at least until they have a successful outcome both for positioning and competitive reasons. We have stated in the proposal We have two current clients who operate in this area of regenerative agriculture and who have a set of needs that need addressing. One of our Advisory team is the MD of one of the businesses mentioned and has been a client since 2012. He has been involved in blockchain studies for agriculture since 2017 and is a recognised regen agriculture specialist. Members of our team have been coaching with these businesses – and others like them for over ten years.\nFlagged: the CA is making market assumptions not assessments. The clients we are seeking to engage with Cardano have a turnover of £500m each in the farming sector in Europe, so they are by no means typical, they are highly innovative, highly respected enterprises, both based outside Cambridge and supporting research in the university and nationally. – however they have real needs in this area that they are formulating and that they will get met. Presently through our relationship with them, they are interested in  talking to Cardano and engage with Catalyst Devs – who we have also quoted in our advisory panel\n\nFeasibility  Flagged the CA has not fully read the proposal or understood our framing of the relationship. The Client for the proposal is Catalyst as they provide the funds. The users are the clients and the Cardano and Catalyst Dev teams – of all flavours. The whole point of the whitepaper is the chance to scope out a potential product solution to our existing clients needs. This is achieved by matching and engaging our Cardano Advisory development team, and our Client Advisory team, led by Julius Joel MD of a major agri business, et al, to collaboratively form a business case if possible. Also in our detailed project roadmap we have highlighted that around 30-40% of the budget will be allocated to blockchain focussed Tech Dev support from Catalyst.\n\nAuditability  Flagged: not reading the proposal – this has been mitigated in the proposal by including in our Advisory group: the client MD who is a recognised regeneration expert in the industry.  Recognised Cardano blockchain experts to give the full perspective of any potential viable solution. At present we are talking to Gimbal labs for tec development  and C4C for internal sustainability expertise."}, {"id": 1642, "q0": "The proposal is an idea for a feasibility study to apply Cardano blockchain technology to a traceable process of carbon farming to pull carbon from the air and return it to the ground in agriculture. This idea, if successful, will open up the approach of technology to life.\n\nHowever, I have a suggestion for the proposal that you need to add more reports on the amount of Carbon in the air or additional reports on the benefits that come from bringing Carbon from the air back to the ground. Because those who do not have knowledge of agriculture, production farming, they will not be able to understand why it is necessary to do this, how it will be useful for the growth of crops?, which resources can be saved? (Of course, the awareness of reducing Carbon in the air contributes to protecting the environment, making the air cleaner, everyone understands). \n\nHaving such reports will help blockchain developers understand and come up with specific technical solutions, and also help voters understand the value of research.", "q0r": 3, "q1": "I agree with each task set out to do a feasibility study, very specific and detailed.\nAll members have professional knowledge in the field of agriculture. In addition, the project has been successfully funded in previous Funds, showing that the project has experience in implementation.\nRegarding the budget breakdown, I have a small suggestion that you guys add details on how many developers will work in 16 hours. I think this will help the voter to estimate the progress of the work.", "q1r": 4, "q2": "I would agree with the proposer if the proposal could add details on how to measure project success. I understand that this is a feasibility study in applying technology to the farming process, the final product that measures success is a detailed report. However, for auditing each job completed in the roadmap, it is necessary to export reports and post them on Github or your website for easy tracking by voters.\n\nIn addition, I understand that all of your members have extensive work experience in the industry, but a personal profile page like Twitter, Linkedin, Telegram will increase your credibility and transparency.", "q2r": 3, "assessor": "z_assessor_1394", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1, "reply": "Impact / Alignment  Flagged: Although well intentioned this shows that the CA has not fully understood the nature or beneficiaries of the proposal. We clearly explain that this proposal is based upon a real world needs case from two of our clients – who are businesses with turnovers of over £500m each. The overall impact of this proposal at a Cardano level is to match and engage with Real Clients, with Real Needs – so as to build relationships between them and Cardano, via catalyst. And the approach to do this is via an exploratory whitepaper that will scope out what these needs and potential solutions look like in practice.\n\nFlagged: the CA has not fully read or understood the proposal – as over 30% of the budget will go to funding Catalyst devs undertaking the whitepaper research, and our Advisory team includes a team of senior Catalyst developers.\n\nAuditability  Flagged: Although generally supportive the CA has not fully understood the proposal. As a whitepaper project, then auditability criteria will be agreed as part of the project scoping. From here auditability will be ongoing – due to the input of the devs – both Tech and other, and the agile management of the project once in train."}, {"id": 2294, "q0": "This proposal is a feasibility study for an excisting use case of blockchain technology in agriculture business across the world. B2B and also B2C needs can be met in implementation of such a solution. Also it is a client driven project which supports the fact of the needs of businesses for such a solution. The feasibility study effectively wants to connect businesses with the developers to create a productive environment. As carbon emmissions and set offs are a big issue in business life nowadays the establishment of such processes can help businesses in becoming more environmental friendly and efficient. This also gives a chance to scale solutions and connect it to other business uses cases in Cardano.", "q0r": 5, "q1": "Since there is a client standing behind this project there is additional drive in finishing the white paper and delivering solutions. There is a clear road map pointed out with detailed mile stones which give the confidence of achiving steps to achieve goals. The team that is pointed out has a lot of experience in the sections needed to perform a successfull implementation of the proposal. The team is all a member of the same community and brings in experience as a team as well.", "q1r": 5, "q2": "The auditability is not clear and open source as \"only\" a programm manager will oversee the project plan. The community needs to receive a quantitative perspective on the progress of the project to have the chance to meazure its success even though a feasability study won´t have too much measurable mile stones. ", "q2r": 3, "assessor": "z_assessor_1476", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6968, "q0": "Bringing carbon sequestration in agriculture onto the blockchain seems like a great new usecase of the Cardano blockchain and matches its sustainable mission. It matches both the challenge and several SDGs. The proposal is only a beginning of something larger, that however has large scalability potential.", "q0r": 5, "q1": "A detailed, implementable roadmap is supplemented by a credible, fine-grained budget that is backed by a team that obviously knows how to plan projects. Every aspect, including risks and solutions to them are discussed in detail. From my perspective as a project engineer this project has good perspectives of being feasible.", "q1r": 5, "q2": "The problem description is clear and a comprehensible solution is presented. However the proposal is a bit short on additional milestones and KPIs. Yet, due to the detailed diversification of tasks an overall good auditability can be seen.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 7260, "q0": "The purpose of this proposal is to research and release a final whitepaper with a feasibility study of the use of Cardano blockchain around the business of farmers and soil carbon sequestration and carbon credits. Since “feasibility studies” are clearly listed as possible lines of work and the proposal work is directly related to Cardano blockchain, I’m 100% confident that it is aligned with the challenge. Additionally, the proposed study will describe business cases within farmers, soil carbon sequestration, and blockchain, with guidelines for developers to implement them. That is a good reason to believe that a whitepaper of this characteristic provides value with a future expectative that some real project and business can be developed in the future.", "q0r": 5, "q1": "The proposal is backed by a team of 6 with strong experience in coaching, technology-business integrations, and project management. Even though the proposal describes their experience, they did not provide links to their companies and profiles. It was hard for me to search and find them on the web. I strongly recommend the proposer, for its own benefit and the voters, that future proposals include references as linkedin profiles and company web sites to facilitate validation. Note that I did find the team and references and hence I’m not giving a less score for that reason.\nThe project is really well detailed with tasks, durations and reasonable budget breakdown. The only weakness I see is that one of the main parts of the research required a good understanding of Carfano Blockchain. Since there are no experts in the team, the proposers inform that they will be partnering with recognised experts in the Cardano community. However they give no reference on that partnership or who the recognized experts are. I’ve a strong technical background, working in blockchain projects,  and see a risk in finding cardano developers since it is a scarce resource. The team only allocated 11% of the budget ($3.240)  for that resource that looks to me not enough. For that reason I can not give the full score on this section.\n", "q1r": 4, "q2": "The proposal states that there will be a Project Manager to oversee the project plan, and provides a link to a Miro file with a roadmap. However no indication was given how the intermediate phases can be tracked or audited. I understand that there’s a definitive and final deliverable that is the whitepaper as an indiscutible proof of completion and success, however it is recommended to describe intermediate stages of tracking and auditability of progress. For that reason I can not give the full score on this section.", "q2r": 4, "assessor": "z_assessor_554", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We will use a real business use case as a feasibility study to inform how the Cardano blockchain can facilitate proof of soil carbon capture", "experience": "The core team of 6 have an average 30 years’ experience each across Agriculture, Technology and Business Innovation. and 2x F7 Funded proposals."}