{"id": 404973, "author": "accelerate2030", "title": "Cardano Solutions for Impact", "url": "https://cardano.ideascale.com/a/dtd/404973-48088", "category": 26445, "amount": 35000, "description": "Lack of in-depth knowledge & awareness of how impact entrepreneurs in developing and emerging markets can benefit from the use of blockchain", "f6_no_assessments": 4, "f6_rating": 4.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is a feasibility study of businesses and business-oriented training for companies who are looking to solve their business problems by utilizing blockchain specifically Cardano. Hence this proposal is aligned with Challenge as it involves B2B solutions.  \nThe way it will be carried out is first they will do a survey of 450 companies from 33 countries from around the world. Then those who are interested in Cardano-based solutions will be provided with training via workshops. I think this is a better way to bring the businesses into the Cardano ecosystem and Project Catalyst. This proposal will have a noticeable impact as it is going to onboard companies from around the world.", "q0r": 5, "q1": "The team is capable to carry out the proposal as they are already active in the world and working with the United Nations Development Program for sustainable development goals. The team-related details are provided and can be seen on the website.\nThe timeframes given to complete the proposal is realistic to complete the survey, conduct the workshops, and then provide the selected companies with assistance to integrate Cardano into their Businesses.\nThe budget asked to undergo this proposal is realistic and it is broken into identifiable tasks. The team is experienced and thus they know of the resources required, they are doing this kind of work where they conduct surveys, conduct workshops & provide assistance to companies and hence they are well equipped for performing the mentioned job to help grow the Cardano ecosystem.\nAs mentioned by the proposer, they are encouraging the participation of the businesses in the initiatives of Cardano by bringing them together by conducting the workshops. This is one of the best ways to handle the challenge of lack of participation.\nThus by taking into account all the above facts, this proposal is highly likely to be executed.  ", "q1r": 5, "q2": "The proposal can be audited by tracking each step of the proposal such as the progress of the survey and its result, workshop participation and result, and finally the provision of assistance to the selection firms.\nThe budget is also tied to each stage of the proposal which is clearly defined. So, it makes it easier for the auditor to verify the execution and the disbursement of funds.  \nThe milestones are set out clearly in the proposal with the duration required to achieve them.\nAs stated in the proposal will be completed between May to September. This is a reasonable timeframe.\nThe success of the proposal can be measured with the number of companies using Cardano-based solutions, proposing in Catalyst, utilizing Cardano-based launchpads such as Cardashift, etc., and as a result, attaining projected cost savings & revenue increase. ", "q2r": 4, "assessor": "z_assessor_1444", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for the review. \nThe review under Audtiability is positive, we wonder what is the reason for a rating of 4?"}, {"q0": "This proposal impact can be huge due to the kind of action the proposers want to put in practice. The entrepreneurship is a initiative that develops the world and it's irreplaceable. The proposal adresses well the challenge because it focus in the development of entrepreneurship inside the Cardano universe, and uniting these two points is  a useful way to attract people to Cardano ecosystem. In addition, he proposer exposed metrics that make sense to measure the success of the project. ", "q0r": 5, "q1": "The proposer explained well the deadlines and the budget to accomplish the proposal and they are reasonable. A question is: the proposer considered the risk of the entrepreneurs not understanding the proposal or not trusting it?\nThe experiences of the members seem to be enough to deal with the proposal needs.  ", "q1r": 4, "q2": "The proposer exposed coherent KPI's to measure the project success. I missed a especific goal that show a number of responses in the initial survey and a number os entrepreneurs that the proposer would like to havein each deadline. This kind of specific and measurable goal facilitate the audit. The SDG Goals and SDG subgoals were well explained and helped to expose what impact the proposal want to cause.", "q2r": 4, "assessor": "z_assessor_409", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1, "reply": "Thank you for the review. "}, {"q0": "The proposer showed some numbers and steps of this project that will strongly impact the Cardano ecosystem. By 3 steps, this idea can help everyone have a clear insight about the vital needs of this world and connect to real solutions that fit with the Cardano ecosystem to on-chain. The proposer also emphasizes that this research will help the Cardano community to know and develop tools that will fit the needs of entrepreneurs around the globe, which I believe can help increase the on-chained sustainable business idea on the Cardano platform. Moreover, the proposer also provides some key metrics that really alight with the challenge KPIs and are suitable with what they describe in the solution content. They also state out the challenge about a common problem that will appear on all survey activity, but they had a plan for that which I believe will work well. ", "q0r": 5, "q1": "For the idea of this project, the implementation will have just some steps but the team gives very detailed information about their activities. They describe clearly what they will do in 4 phases, and the main outputs that they will get after that. That info makes their budget breakdown more reasonable because the budget clearly supports each group of activities mentioned above. Moreover, the info of the team is very clear with position, role, and duty in the scope of this project. I believe that with this team and the plan, the community will receive great research and being support from them to develop the more vital project in the Cardano ecosystem that needs for humanity. ", "q1r": 5, "q2": "The proposer will set up an M&E plan to help track the progress based on the project plan and KPIs outlined in the proposal. Plus the key metrics in the impact session, their KPI in this session, and the successful image that they describe are also very clear to help everyone understand what this project will get and bring to the community. With this project, I believe that that info is fully for auditing. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for the review. "}, {"q0": "This proposal presents business-oriented training - one of the suggestions that this challenge offers. I agree that there is a demand for the Intro to Cardano workshops for businesses who are fresh to Cardano solutions, especially ones in developing and emerging markets. The successful implementation of this proposal will lift the barriers for many businesses to adopt ADA as a new method of development.", "q0r": 5, "q1": "The team has experience in the development of new and emerging markets. They have experience working with programs that are in the progress of massive advancement. Nonetheless, I wish there would be some experience in the technology or Cardano currency specifically. These workshops are highly applicable, and the Cardano community does have lots of resources to support this idea. There is a high demand for these kinds of workshops, especially in the developing countries - which also target groups of customers of this project. I think this is a good model.", "q1r": 3, "q2": "This proposal is very informative and well-thought-out. The presenter has demonstrated each step and timeline for these steps for the project implementation. These small goals are achievable and relevant to the project's progress. The budget breakdown is in detail and reasonable. The description of the project is coherent and cohesive. The metrics to measure the success of the project are on point and valid. I also like the long-term vision of this proposal, very ambitious. The team has pinpointed the most radical challenge they may face and provided optimal solutions for it. I am impressed.", "q2r": 5, "assessor": "z_assessor_780", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1, "reply": "Thank you for the review. "}], "solution": "Needs assessment of 450+ impact entrepreneurs across developing countries ->Intro to Blockchain, Cardano and Project Catalyst workshops.", "experience": "Accelerate2030 is a global program supporting entrepreneurs from developing and emerging markets to scale their solutions for the Sustainable Development Goals. Geneva based, in 2016, by Impact Hub and UNDP. Implemented across 33 countries, supporting nearly 500 entrepreneurs"}