{"id": 405089, "author": "sensemaking", "title": "Increase Project's Investor Appeal", "url": "https://cardano.ideascale.com/a/dtd/405089-48088", "category": 26445, "amount": 48000, "description": "Good investors won’t fund orgs lacking fundamentals; proposers need help with product/market fit, team coherence, & good biz dev strategy…", "f6_no_assessments": 5, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 415, "q0": "Given the growing number of proposals present in the funds, we realize that there is a large potential audience for this project. In addition, we see that one of the main objectives of this one is to align the achievement of results with the maintenance of values, which is fully in line with Catlyst. In this way, we have that the proposal fits perfectly with the goals of the challenge in question. We noticed that the budget being requested of $48,000 is quite considerable, but consistent with the ideas and plans that were exposed, in addition to the professionals who are involved. We realized that with the success of this project, we would have a positive impact both for the companies served and for Cardano's own ecosystem.", "q0r": 5, "q1": "One of the positive points regarding the feasibility of the project is the experience on the part of the team in acting precisely in the segment of combining action plans with the exposure of the company's characteristics that enhance its values. We can see this from the detailed description of the professionals present in the proposal, in addition their contacts (Linkedin) can be found on the website: web3:4Life - (web34life.com). Another positive factor is that the proposal in question does not aim to create a new procedure that needs to be validated, the actions planned to help in the structuring of the projects appear to be the work that the professionals of the proposal are already used to performing. There is a clear organization of the actions to be taken and they are well structured in time. We also see that the planned steps follow a good logical chain, that is, they start with simpler actions such as recognition of initial needs (in the first 30 days) and evolve until there is a completed business development plan. We also noticed how the analysis that will be carried out with the chosen ideas includes very plural factors, such as market research and dissemination, proving to be a very complete service. This also helps justify the total amount; we noticed that each week of work will cost $4,000, but given the experience of the professionals involved and the entire plan discussed here, this seems to be a very reasonable amount, especially when we realize that the eventual great success of one of the companies served by the project will bring a lot of visibility to the ecosystem from Cardano. In addition, we can also say that the type of service provided is very much in line with the exposure of the SDGs now present in the proposals, helping to highlight them even more.", "q1r": 5, "q2": "The indicated ways to keep a follow-up of the project are also very well explained. Clear numerical parameters have been indicated that will indicate the realization of exactly the premises determined in the feasibility plan. In addition, the availability of continuous reports was also stated, showing a concern of the team to maintain a periodic follow-up on what is being achieved. The perception of success that is being defined is also very consistent with the ideals transmitted by the team throughout the proposal. A factor notably perceived here is the concern to establish a good follow-up of all the steps that are carried out.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 1676, "q0": "The proposal aims to create organizational artifacts(e.g. a revenue development plan and templates for project pitches) in order to aid Catalyst projects in becoming pich ready for stakeholders and potential investors. I rate the impact of this proposal five stars as it aligns with several of the challenge goals. The proposed service could boost the efficiency of Cardo projects and increase the number of projects gaining funding from other sources such as external investors. If funded, the service could bring long term benefits to the Carando ecosystem and grow stakeholder engagement.\n", "q0r": 5, "q1": "The proposers consist of four members from the web3:Life Guild organization with experience in business development, building organizational culture as well as software development and tech. All relevant to develop the proposed service. Furthermore the proposers acknowledge the perhaps biggest obstacle to success, low community engagement, and discuss ways to mitigate the issue. Lastly, the budget proposal details how the funding will be spent and which activities will take place. Therefore I judge the feasibility as both realistic and credible and give it a five star rating. The only thing to note is that information about the fourth team member is lacking, and I would recommend you add this information.\n", "q1r": 5, "q2": "The proposers clearly state how they will ensure transparency throughout the project´s lifetime and specify how they will measure the progress and development of the project. Such reporting will make it easy for community members to scrutinize and understand how the project evolves. To achieve a five star rating I would recommend the proposers to explicitly state the specific KPI numbers they wish to achieve. For example, instead of writing “number of co-discovery calls held” I would recommend to specify the metric “15 co-discovery calls should be held”. Furthermore it would be interesting to explore how many of the Cardano projects the service aims to aid that receive external funding and if the project actually helps to increase this number. ", "q2r": 4, "assessor": "z_assessor_1403", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2062, "q0": "This proposal will be very effective with growing the investor appeal. I like the way that the team addresses how LifeGuild will help catalyst projects to be pitch ready. There is such a need for greater education in the community. I have learned almost everything that I know from my own research. It would be extremely beneficial to fund a project that will help educate the community and to further increase the demand for investors to look into Cardano and it's ecosystem.", "q0r": 4, "q1": "There is a good amount of experience in those members that are with Life Guild. The roadmap is constructed very well and I enjoyed reading about how the first 30 days are going to go and how those transition periods will work for the next 30 day and 90 day time frame. The funding request is a considerate amount and will likely bring even more money into Cardano which will allow a greater amount in the funding protocol by IOHK/Project Catalyst.", "q1r": 4, "q2": "The proposal itself is put together very nicely. There is a lot of material provided that helps it to be audited. Given the amount of time that this proposal will be worked on included in the proposal is 150 days. This program will utilize the funds to help others to learn more about the community and how they can get involved in the Cardano ecosystem. I think that this could be really huge for educating Cardano holders and participants.", "q2r": 4, "assessor": "z_assessor_1448", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 2296, "q0": "The proposal wants to give advice and support for other projects to increase investor and community appeal. I kind of see that it somehow affects businesses and wants to help to make their proposals a better quality. But as this challenge is about business solutions and b2b and b2c processes I cannot see direct benefits for this particular challenge. There is no business use case where the cardano ecosystem can help to improve proccesses and solve inefficiencies or inequalities. The proposal should be moved to other challenges where it can have more impact and is understood in the right way. For example „New member onboarding“ or „Community Advisor Improvements“.", "q0r": 2, "q1": "The plan presented is clear and has written milestones that can be achieved and would support the succesfull implementation. The proposal seems to be written really high level and I can´t see detailed actions that would take place to achieve a goal. Also there is a high number of \"catch phrases\" that can lead to a more professional appearance but also, if used inflationary, seem only to fill in gaps and create an illusion of expertise. Nevertheless the team´s experience highlights professional careers that can be used to fulfil the goals. All in all it is a mixed picture where I can´t say exactly if the implementation or better to say the sucess of the proposal is given.", "q1r": 3, "q2": "The information provided gives a good quantitative and qualitative overview over the progress that can be made through the time of the project. KPIs mentioned fit to the goals and milestones that want to be achieved.", "q2r": 4, "assessor": "z_assessor_1476", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3685, "q0": "This project was created to help other projects grow and bring shared prosperity to Cardano. I appreciate the idea of this project and the thorough preparation from this team. Setting the goal of “orienting towards the greater potential of the project, and developing effective means of communicating the insights” was a solid start to this community project. The proposal's coherent introduction and complete information make me believe that this project will catch the good contributors’ and investors’ eyes. Proposer identifies the main challenge and tries to solve it but does not forget to accept the reality to prevent the worst-case scenario. I give you 5 points for your care.", "q0r": 5, "q1": "With such a well-presented Impact part above, there's no reason why this proposal doesn't include a good Feasibility part. You can provide a complete roadmap with specific timelines and detailed activity lists. So, I think the detailed budget set with 3 months salary of 4 talented team members is highly worth it. And honouring the organisations that have helped the team during the operation is also a commendable point of this proposal. I appreciate your seriousness and energy.", "q1r": 5, "q2": "This proposal has a good beginning, a convincing body, and a beautiful ending. The goals and desired outcomes are clearly and thoroughly presented. Your team has a well-prepared foundation, and I hope the project’s future will be just as good. However, if possible, add a few numbers to make your goals more realistic. Even if they are only quantitative indicators for the future, they will also help increase the attractiveness of the proposal.", "q2r": 5, "assessor": "z_assessor_1666", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "The Guild helps Catalyst projects level up their value prop, secret sauce, mission, values, GoToMarket plan, & other fundamentals", "experience": "25+ years software development, Catalyst Community members, active collaboration in multiple cardano-centric communities. Key contributors in startup to multibillion dollar valuation, 12+ years business development experience."}