{"id": 405101, "author": "vilvi", "title": "NFT Vinyls paying musicians forever", "url": "https://cardano.ideascale.com/a/dtd/405101-48088", "category": 26445, "amount": 50000, "description": "Musicians have had a hard time in the streaming economy, giving away work for free.\nHow then to integrate web3 with the music industry?", "f6_no_assessments": 6, "f6_rating": 3.9444444444444446, "videos": [], "media": [], "f6_assessments": [{"q0": "Fair artist compensation is pretty much the Holy Grail of NFT use cases and it would seem, at least on paper, that music distribution, in particular, could benefit from a well-realized NFT framework. Needless to say, the proposers are going to have a lot of competition in this niche and will need to bring something special to the mix if they want to climb to the top of the heap. To their credit, the proposer's team brings together an impressive mix of relevant music industry and development experience.\n\nThe focus on vinyl comes across as a bit gimmicky, but perhaps will provide a good test case by focusing on a long-established collectors' market. ", "q0r": 4, "q1": "I appreciate the link to a very thorough spreadsheet breakdown of the proposal's roadmap and expenditures plan. This is clearly a project that is already underway, with funds being requested to help market the project. As this is the case--and I rarely say this--the spreadsheets may be overkill when it comes to laying out the feasibility case for the typical Catalyst voter. \n\nI'd recommend keeping the link, but in the proposal itself, zoom in on what the money will be used for in the marketing budget in a simple, easily parseable paragraph or two. Remember that voters will likely be looking at dozens of proposals, so make it easy on them. ", "q1r": 4, "q2": "With the code migration to Github and the project's website, progress on the project shouldn't be too hard to track. The proposal mentions an existing Telegram group for early small-scale investors who receive updates on the project. Perhaps this could be expanded to interested Catalyst voters? \n\nThe goal of artists being able to live off their traded records is a noble long-term goal. It might be worthwhile to partner with some artists who are willing to provide updates about what kinds of effects this project has had on their revenue streams, should it be within the scope of this phase.", "q2r": 5, "assessor": "z_assessor_1251", "no_vca": 10, "ne": 0, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "I completely understand how this could be very valuable to the Cardano ecosystem. With the current technology of Cardano's blockchain, we could see music become a completely new thing with this idea of NFT Vinyls that will help pay artists. There has been a challenge in the music industry with going from vinyls, to cds, to streaming platforms. This could engage a greater community by mixing the excitement between new technology such as blockchain and the use of NFTs with something that people love. Music! ", "q0r": 4, "q1": "The team seems to have great experience in the music industry. I think it would be good for the team to hire more people that are very comfortable with the Cardano space. This will help this proposal become more valuable to people and will be able to implement these desires in a productive way.", "q1r": 3, "q2": "I like this proposal and I think that they would be able to follow through with what they desire. However, I wasn't able to see any information regarding the funds they will receive from fund 8. I think that if the team was able to submit a greater explanation on exactly where the funds are going, they will have a much higher chance to be funded. Other than that, it is an exciting idea that could bring volumes to the community. Just needs some minor upgrades in the proposal. ", "q2r": 3, "assessor": "z_assessor_1448", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposal solves inefficencies and inequality in the music industry and will help b2b and even more b2c processes to become mor productive. Producers of music will gain a fair share of secondary market sells through an NFT blockchain project. The team explains clearly in their white paper which benefits and risk are there for the use case and how they want to achieve their goals. The proposal mentiones other business cases like beeple and compares them tot he music industry. Also network effects can be achieved and the solution can be scaled up to other business types. Especially the music industry can give cardano a great support in getting more popular as well even though the main goal that is addressed in this chalenge will be the business solution on gaining new business cases for musicians. I can´t find a reason why this topic should not effectively adress the challenge.", "q0r": 5, "q1": "There are detailed roadmaps and mile stones mentioned in the white paper that were linked in the proposal. For a better overview it would be nice to have a short plain excerpt in the proposal written down so the voter or any one else can quickly overseee the project plan. All information provided seem to be created professionally and thoughfully giving confidence to the reader. \nAlso the team has a wide range of experience in all sectors that need to be worked on. An overview of the team is given in the White Paper with description of their previous projects and experiences in a diverse number of companies. Their website has a proffessional apperience and shows the dedication in the project. I am certain that the team is able to implement the proposal properly and on time even though the proposal could be mislead or confuse the reader too much to be able to see the clear picture right away. \n", "q1r": 4, "q2": "Links to financial forecasting and budgeting is provided via a link in the propsal. With some time the reader can dive deep into the numbers provided by the team and is able to challenge the developers by asking detailed questions. Also KPIs for the challenge can be collected easily through the set up of the project plan and the KPIs used for overseeing the project itself.", "q2r": 5, "assessor": "z_assessor_1476", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is an NFT solution to monetize the streaming music on Cardano. A music industry is definitely one that is eager to cut out the middleman and this proposal has a clear use case and is in line with the Challenge.\nThe metrics and KPIs are presented in detail for the whole project, but not for the actual proposal and its limited impact. More distinction is needed between the overall presented 3 year plan and this actual proposal.\nHow is adds value to the Cardano is not explicitly stated, but can be concluded based on the NFT and native token usage.", "q0r": 4, "q1": "The proposing team has experience in the music industry with sufficient information provided, some with verifiable links.\nThe scope of the proposal, purpose, budget allocation and goals are not clear. The overall project 3 year budget sheet estimates income of 6,781,583 £ and this proposals 50,000 are not part of it. \nMore detailed budgeting related to the proposal is required, as opposed to general statement: \"marketing and setting up stake pool\".\nGiven the overall project scope which is ongoing, it can be expected that the project team can deliver but due to lack of sufficient details the scoring is degraded.", "q1r": 4, "q2": "Clear roadmap and milestones are missing for this proposal (for the entire project are present), as it is unclear how the impact will be measured. \nClear time horizon for marketing and how it is used and therefore measured is missing.\nThe problem statement is clear as well as the solution that addresses it.\n\n", "q2r": 3, "assessor": "z_assessor_160", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "First of all, I would like to commend your project for its influence on talented artists and its artistic significance. Art is timeless, and there is always a way for it to fit into an increasingly technological world. With a good idea and a sample product to be released (by the time I read it, it should be \"already\"?), I think your project will have the potential to be interested in art-loving investors. However, if possible, please elaborate on the direct impact this project could have on the development of Cardano, as I see you haven't talked much about it.", "q0r": 5, "q1": "You've got an impressive Impact, but it's a pity that the following Feasibility is so sketchy. I went to the link you provided to check it out, but I can't see anything more detailed other than the titles and the amount. A good proposal must show a reasonable plan about what you will accomplish and how it needs to be. Moreover, it doesn't take long for you to restate the detailed budget in this proposal. Only such a link is not a good practice for a serious proposal. And the last piece of advice, add more information to your team members so that readers can see their capabilities and experience.", "q1r": 3, "q2": "As I said initially, I respect the artistic and human meaning that this project brings. Through careful monitoring of the project’s development progress now and in the future, I believe your team will meet its expectations. Your Auditability part is well presented but still lacks specific quantitative indicators for the community to have a base on which to track the progress and the development of the project. Add some numbers, such as the number of participating artists you want to acquire, the number of potential customers, and the number of early-stage NFT picture disks that can be produced.", "q2r": 4, "assessor": "z_assessor_1666", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "\"Unlike the gaming industry, mainstream gamers are hard to be convinced to play an NFT game. Bring music into the blockchain world is better adopted from users including fans and creators. With that dramatic adoption increasing in this art industry, I think that this idea will help fast increase the adoption in the Cardano ecosystem. The proposer provides some basic features and benefits that their users will receive when joining and engaging their platform very clearly. However, my advice to the team is that they should have more detailed content about the features to help us better understand how they work. The content should be clear in independent parts that are related to each of their target audience and the connection between them, this will convincing the impact of the platform easier for the community. \nMoreover, I can understand that this platform will increase the adoption of artists, fans, and investors but the proposer should make more content to show how their idea further impacts the Cardano ecosystem and align with the challenge. \nLastly, the proposer provides 2 challenges that they're facing, but I think they're not the big deal. One is about the market adoption that I believe it's an opportunity for them more than a challenge. And one is about the budget that I also think can be solved with the Catalyst fund. For developing this kind of project, there are a lot of challenges they have to face in technology, mechanic, marketing, and communication to increase users in the platform. Hope that the team can be aware better of their challenges and mitigate them. \"", "q0r": 3, "q1": "\"The proposer attached a combination file of the roadmap, budget, user acquisition, and sales stream that I believe it's reasonable. But it's hard to understand what they will do and the output in each scope of roadmap and timeline. My advice to the team is that they should have a more detailed explanation about the task they will do in their roadmap, it's not just only helping the community understand to assess their plan and progress, but also help them better identify the key activities in each scope of work. \nLastly, it seems that their team with headlines is enough to maintain this project but the community needs more information about the members to better understand their knowledge, experience, and ability to work on this project. It will help the community assesses how this team will make an impact on the feasibility of the project. \"", "q1r": 3, "q2": "The community can follow their bi-weekly Agile meeting to audit their progress. In addition, the code will be migrated to Github for public transparency. The proposer also emphasizes their main goal of using the budget is for supporting launching their stake pools and fully building out the marketplace. \nThe team has a determined image of their platform that is inspired and sustainable benefit artists for their whole life with this model. I personally really love this idea and well support them to develop it. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "NFT QR code linked records of existing and new music made so that each time a release is resold, the original artist gets a percent", "experience": "Felix, Head of Music & Publishing: prev clients Kanye West, Jay Z, Gorillaz & Many More\nMatt, CTO, Ex clients inc KPMG, Facebook etc (but has seen the light of web3)\nRas Kwame, Ex BBC Radio 1 Presenter\nGeorge, trained economist and entrepreneur\nFull Team visit: shorturl.at/dDGN4"}