{"id": 405281, "author": "danielmanzi", "title": "Rental Marketplace on Cardano", "url": "https://cardano.ideascale.com/a/dtd/405281-48088", "category": 26445, "amount": 172750, "description": "The current renting system is archaic, costly, & driving housing costs up through speculation and lack of transparency.", "f6_no_assessments": 6, "f6_rating": 3.9999999999999996, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=26703"], "media": [], "f6_assessments": [{"id": 1644, "q0": "With the right reasons as well as the problems clarified, the proposal shows the suitability for the business solution challenge. How to build a project model that adds value to the Cardano ecosystem through payments in ADA and stable coins. The proposal also outlines possible challenges or risks that are legal as well as expansion to other markets. I have a small suggestion to increase the successful impact of the project is how to solve the problem of popularizing blockchain knowledge for newcomers to increase the number of users as well as in many national markets that has a negative view towards blockchain space.", "q0r": 4, "q1": "The list of members necessary to successfully implement this project, the information about each person's work experience is published in detail and there is a link to the linkedin page for comparison.. I have a small suggestion for your team that is to add a person with legal expertise to improve the legality of the project. As for the budget, I recommend you to be more detailed about each expenditure for each job. For example, $20,000 for branding and marketing, specifically, communication on social networking sites costs xxx USD, organizing seminars costs xxx USD, publishing videos on youtube costs xxx USD. Also, I have also read each file carefully but still can't find a technical solution in how do you tokenize rental contracts into tokens that are stored on the blockchain, the authenticity of the tokens. Does this compare to the actual outsourcing contract?", "q1r": 3, "q2": "I suggest you specify the level of success through specific numbers to measure each step. For example, after the product runs on mainnet, how many customers will come to your platform to rent, how many interactions will be, the transaction value on your platform will reach 1 million dollars, for example.", "q2r": 2, "assessor": "z_assessor_1394", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 2206, "q0": "The creation of a marketplace for the housing rental based on Cardano seems like a crucial point to reach global adoption, for this reason, i would say it clearly aligns with the challenge. \nOne of our goals as a community and an ecosystem is to provide an alternative way to interact with traditional markets, and it will be more and more needed as WE (Catalyst members, among others) are now practicing these governance activities for a living.\nThe more people using Cardano, the more we will need these kinds of systems. \nThis is one good way to show the world one more utility of blockchain, along with the possibility for full transparency in transactions.\nProposers look well aware about the ecosystem and the challenge.\n", "q0r": 5, "q1": "Looking at the experience of the team members, I’m pretty confident about the potential implementation of this project.\nWe have access to all the data we need to assess the quality of their experiences, as we can read it in their respective linkdn profiles.\nThe only thing missing in my opinion would be for us to know if one of the team members is a Haskell developer, but, as it is mentioned in the budget breakdown, they will delegate the code writing to MLabs.\nSpeaking of the budget, it could be a little bit more detailed, although it is pretty clear already.\n\n", "q1r": 4, "q2": "The team claims to be ahead of schedule on the roadmap, but we don’t really have a way to verify it.\nThe progress should be perceivable when landlords get good profit and clients have access to great competitive prices, however, how could we check the progress from all the steps of the development taking place before the marketplace is running? \nThis part could be improved for better “auditability”.", "q2r": 3, "assessor": "z_assessor_146", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 3654, "q0": "Because of the old, exorbitant, and unclear property rental systems leading to overpriced housing costs through speculation, there is a need for property owners and tenants to have a transparent, secure, and cost-efficient rental marketplace. And this proposal suggested building a rental marketplace using Cardano to satisfy that demand. Therefore, it could be said that this proposed solution is aligned with the given challenge which is finding a solution based on Cardano to solve businesses' needs. The description of the proposed solution was given in great detail. It is a rental marketplace for properties called, The Loqul marketplace. The way it operates and how all stakeholders in this marketplace interact with each other were explained thoroughly. It emphasized the benefits this solution will bring about for landlords and tenants who are Gen Z. This shows its impact on the target audience. Besides, it also analyzed its impact on the Cardano ecosystem as well. Because when users engage in this rental marketplace, they will experience new and helpful tools and mechanisms on the web 3. From that, it will attract more new people to the Cardano ecosystem. Another thing that is  worth mentioning is that the proposal also provided some criteria to measure the performance of this project. Some challenges and the plan to overcome them were given and explained quite clearly.", "q0r": 5, "q1": "The plan for each quarter was given, but it is better to provide a detailed plan in each month or a shorter period of time so that people can better see how this project would be operated step by step. The budget breakdown was not so detailed. It should mention that capital would be allocated for how long or if possible it should mention how these costs are calculated. About the team operating the project,  despite the fact that as mentioned at first, it is run by an experienced team in the field of  Real Estate, Finance, Consulting, and Computational Mathematics. It should add more information related to the background or related experience of each staff that would be beneficial to run this project well. Though it included the link to their profile, it would be more persuasive to highlight outstanding details which help increase the level of feasibility of this project.", "q1r": 3, "q2": "There is a good signal that the proposal mentioned that this project is proceeding well, ahead of the roadmap mentioned in the plan. The proposal mentioned three factors to measure the progress of this project including outcomes, the number of tenants bidding per property, retention rate, and the number of properties listed. How to calculate these indicators were clearly mentioned, which is good to help sponsors visualize how to track, trace, and audit this project. However,  it could take advantage of some key performance indicators mentioned in the impact section as it has more performance indicators than what is mentioned in this part. Therefore, if more indicators were added, then it would be much better. About the description of the success of this project, because it lacks figures, so it was not provided so clearly. As a lot of key indicators to measure its performance were mentioned at first, it should make the best use of it to mention more numbers in accordance with those indicators so that everything would be synchronized and easy to follow.  Besides, it lacked mentioning this is a new project or a part of another one which was funded before because it said that one rental system was launched successfully in USA and it is expanding into other markets", "q2r": 4, "assessor": "z_assessor_1665", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4310, "q0": "The problem mentioned here is that the current rental system is gradually becoming old-fashioned, expensive and causing housing costs to skyrocket due to speculation and lack of transparency. The solution given by the proposer is creating a safe rental marketplace with new monetization mechanisms, DeFi tools, secure crypto payments, & NFT receipts by using Cardano. From my point of view, proposal described the solution very clearly. In addition, they identify accurately target audiences (Landlords that have 1-4 Units that they manage on their own (B2B), and Gen-Z/Young Professionals/College Students). Not only that, what these objects can benefit from implementing this type of model is also specified. They strongly believe that \"By building a great set of smart contracts and applications we are helping both individuals and businesses enter the ecosystem, benefit from it, and grow in a trusted and frictionless manner\". They also provide performance indicators to help us track. Difficulties and challenges along with resolution plans are also described in great detail. My rating is 5.", "q0r": 5, "q1": "\"To evaluate the feasibility of this proposal, I would like to make a few comments as follows:\n- In terms of time, the project implementation schedule is about one year, divided into four quarters (in 2022). With each stage, there are specific jobs and workplaces. In my opinion, it can be broken down by month or week for the community to better monitor the project.\n- In terms of operating budget, 172750 USD is the number for the budget they requested. But I do think the article would be good and clear if this part of the budget could be allocated smaller. For example, the distribution of salaries to employees, how much will each person with different tasks be paid and for how long?\n- Lastly, about team members, the proposal lacks information about the total number of the team and who will need to be added. However, the members mentioned all have clear titles as well as LikeIn links to their profiles. This helps the community to verify the ability and experience of these peopleHowever, what jobs will these people do and how will they be assigned tasks? This section should have been analyze better.\n\"", "q1r": 3, "q2": "There is sufficient information provided to audit the progress and success of the proposal. However, I believe that the proposers should mention a roadmap of their progress again, which will allow the community to keep track of its development. Besides that, they should have some ways to update the information about the the project. There are also good key performance indicators that have concrete values that can provide insight into the success of the project. From the information in the proposal, it does seem that the proposers will be transparent about the progress of the project, so I believe that they will provide frequent updates to the community. (score given: 5)", "q2r": 5, "assessor": "z_assessor_1717", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 5572, "q0": "The proposers are setting up to develop a rental/sales marketplace, where rentals, payments, auctions and sales will go through the Cardano blockchain and have proof of rent payment/sale through Cardano NFTs, that will act as receipts. The plan describes a full functioning marketplace, similar to eBay, meaning users can see the listing’s highest bid, time left on auction, or if available a “rent now” button.\nThe proposed idea opens the door to a lot of new adoption, but also to showcase the benefits and multiple use-case solutions that blockchain, and especially Cardano, with the fast transaction speeds and low-cost fees can offer. Through the multiple partenerships they have already in place and the large audience it can attract, the potential of this project is considerable.", "q0r": 5, "q1": "The detailed plan is divided in the four quarters of the 2022 timeline. It is well described, achievable, practical and clear. \nThe budget is split in the main divisions, but there is no additional information beyond that. While some numbers I understand are fixed fees, for others there could have been some additional details provided, to make the budget easier to follow up, for example, what is marketing/branding and how did the proposers come up with that cost?\nRegarding the team description, they have offered all the info and links to be able to properly assess their skills and potential.", "q1r": 4, "q2": "The progress measurement is well thought, making obvious that the team has been working on this solution and considered a lot of aspects before submitting the proposal. The success of the project is efficiently envisioned, especially for the long-term, for the short-term however, some numbers would have better guided the assessment, like: in X months and X number of users renting or listing on the marketplace is considered a success.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10093, "q0": "This proposal is about creating a rental marketplace on Cardano platform, the proposer detailed his solution as well as clearly presented the target audiences on both 2 sides B2B and B2C and they also give a reasonable explanation for coming up with this target audience. This is a fascinating project that main objectives meet the challege. If the project implemented, it will bring new fresh users to the Cardano ecosystem and contribute to the development of Cardano community.", "q0r": 5, "q1": "The proposer clearly stated the roadmap, KPIs, budget allocation. The team members are great on their qualifications, I'm impressed with their information including relevant experience and skills needed for the project. I agree this team has enough skills and experience to implement this proposal.", "q1r": 4, "q2": "The information for auditability is relatively specific. I think this is a potential project but it would be great if the proposal could explain more clearly how they update the progress or the development of the project to the community.", "q2r": 4, "assessor": "z_assessor_792", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Using Cardano, we can create a safe rental marketplace with new monetization mechanisms, DeFi tools, secure crypto payments, & NFT receipts.", "experience": "The Team's experience consists of Real Estate, Finance, Consulting, and Computational Mathematics.\n\nWe've worked/studied at:\n\nJP Morgan Private Banking\n\nGoldman Sachs\n\nBank of America\n\nKPMG\n\nSotheby's Int'l\n\nwiSource\n\nBerkeley Research Group\n\nFIU + UCF + UMiami+ Harvard Business"}