{"id": 405439, "author": "yeabu369", "title": "Adulis Digital Asset Exchange", "url": "https://cardano.ideascale.com/a/dtd/405439-48088", "category": 26445, "amount": 200000, "description": "People in most developing countries don't have access to ADA exchanges in their local currency. Exchange of digital assets is non-existent.", "f6_no_assessments": 8, "f6_rating": 2.5, "videos": [], "media": [], "f6_assessments": [{"id": 856, "q0": "As this proposal does mention businesses, but since solving business problems is not the core function, the proposal might be more appropriately located in a different challenge.", "q0r": 2, "q1": "Considering that a bulk of the resources requested in the proposal are aimed at providing liquidity on an unregulated P2P exchange after it's built by the team, the author claims to have already built a P2P exchange in Ethiopia.  That history indicates that the development skill may be validated (assuming the exchange is functional), but leaves me wondering why another exchange is needed rather than integrating cardano into that existing exchange, then using Catalyst funds for arketing to raise more sustainable community-sourced liquidity.\n\nMy overall impression is that not enough information is provided in this proposal to generate implementation assurance, but it could be my overestimation of complexity.", "q1r": 3, "q2": "The proposal's metric for auditability mainly centers around active users and ADA trading volumes on the proposed future exchange.  However, I believe there are more important development metrics that should be considered for a proposal like this, such as MVP, beta testing, open source collaboration.  There is also no mention of a business model in the proposal, so it's difficult to understand what kind of volume wold need to be achieved and on what timeline in order to create a feasible business that can sustain itself after depletion of funds.", "q2r": 2, "assessor": "z_assessor_1224", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 1201, "q0": "Adulis Digital Asset Exchange address the challenge positively and their current offering of BUSD and UDST / ETB shows ADAX have started already. UI is clean and professional. It misses the 5 star mark for a couple of reasons, I would have liked to see what early impact these two pairs (BUSD + USDT) are having to show some traction for the exchange. Secondly, we are missing rationale/business case to why being able to trade local currency ETB with ADA as a direct pair adds value to the end user. As the current live offering are both stablecoins, I make the presumption this has a more obvious end-user benefit than ADA. However, that is not intended to takeaway the benefit for ETB holders to have an ADA swap option especially as Ethiopia (as a nation) is an early adopter to Cardano. Nevertheless, it would have been interesting to read more about how ADAX view this. The proposal does show promise for future scalability and easily matches KPIs to the challenge.", "q0r": 4, "q1": "Overall the proposal gives a good indication that success will be likely, with early proof of concepts already live giving faith in the current team. Whilst faith in delivery is good, transparency and evidence of strategy is not clear for long-term success. The budget breakdown is relatively light with two clear uses for the funds - 80% for liquidity + 20% for team costs. I would have liked to see more granular detail on staff costs and other admin liabilities to show transparency and value. Additionally, I would have liked to see more economic rationale to the use of $160,000 for liquidity which is a considerable sum and large proportion of total requested funds. Following this, more detail to how liquidity will be deployed over time or in one go. ", "q1r": 3, "q2": "Given the nature of an exchange, it will be relatively easy to audit progress, firstly by simply having the ETB/ADA pair live, and then as identified, by volume of traded ADA. Whilst that is very positive it doesn't quite reach 5 stars due to not having clear objectives. I.e. X amount of ADA traded or X amount of active users. As mentioned previously, greater definition of the problem/demand/use case to creating an ETB/ADA pair is missing and it would be great to see this. That said, I'm in general agreement this proposal can be audited and can be a success.", "q2r": 4, "assessor": "z_assessor_1304", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1645, "q0": "The idea is to build a centralized exchange that will allow people in the developing country to trade different cryptocurrencies in local currency. But why raise capital in Cardano to build a centralized exchange while Cardano's model is 100% decentralized? This is an act contrary to all the humans here operating in this Cardano ecosystem.\nI think the project will have a much more negative impact on the Cardano ecosystem than it can bring beyond the exchange in local currency.", "q0r": 1, "q1": "The proposal did not specify how to build an exchange, what work needs to be done. What is the security mechanism for the system when attacked?\nIn addition, legality is extremely important. The question is whether the proposer has knowledge of the laws in Ethiopia since all members have no legal knowledge\nAnd another key point is the budget. Required amount $200,000 which is 20% of total Challenge budget just to provide liquidity for the exchange? (not all but accounting for 80% of the budget for liquidity) Nobody gives you money just for liquidity. I advise you to find another solution for more efficient use of fund", "q1r": 1, "q2": "Who can verify this project without a registered legal entity, no official website, member with public information is just only 1 person.\nI think verification is not possible.\nYou should add the necessary information", "q2r": 1, "assessor": "z_assessor_1394", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 5254, "q0": "I had too overcome some skepticism of whether or not I think this could be successful. This seems incredibly important and perfectly aligned with some of the greater missions of Cardano but I do still have some concerns. Keep in mind, also, that this is an extremely high price tag that increases the risk (for which I might like to see some contingencies). I think the P2P startup strategy is very clever and could, in theory, see success in sidestepping potential regulatory issues but I would like to see better assurance that this would be the case. Are there legal protections in Ethiopia for P2P markets? My other concerns include marketability and local interest. Accessibility is one issue but user interest is a whole different factor. I would like to see some market research on the interest of utilizing these types of services in Ethiopia. $200k is a big price tag to pay for a functional product that nobody wants to use. Furthermore, what does crypto-based education look like in Ethiopia? Crypto is still a pretty dangerous game nowadays and it can get a lot of people burned if they don't know what they're doing. Lastly, how central is Cardano going to be to this operation? Is ADA going to be the main asset of the exchange, or are other assets expected to have higher dominance? I realize this review sounds far more critical than positive but I do agree. Just tentatively. I think accessibility through this type of project is very important, I just want to see more details and research. ", "q0r": 4, "q1": "Given the existing exchange, education, and experience of the team, I have little doubt that they are capable of creating a functional exchange. However, it is still a skeptical agreement - if you can call it an agreement. First of all, there is some concern about the use of the exchange name ADAX. There is already one of those in Cardano. Second, I may not be a software engineer but I do know other developing projects spend a lot more time than 3 months to develop a quality/secure product. It's not so much functionality that I'm concerned about as it is cyber security. Would this proposal be putting these funds into a \"plastic vault\" of sorts? Third, I need a better breakdown of how the funds will be spent. $160k for liquidity does make sense to me but I also want to know what that liquidity looks like in the long term. Is it committed to the liquidity pool for 10+ years? Is there any oversight or accountability regarding how the liquidity is to be managed in the long run? As far as the $40k, I definitely need to be seeing more specificity on the breakdown of how that money is being spent. Different categories are identified but the costs of each of those individual categories is not given. I need to know there is a specific and calculated plan, with a big price tag like this. Lastly, the team looks sufficient but I'd like to see LinkedIn profiles to increase credibility and verifiability. In that category, I might also like to see more partnership from reputable organizations within the Cardano ecosystem. This would add greater assurance of support, oversight, and trust. Overall, I am reluctant to give an agreeing score. I think I need more information and assurance. ", "q1r": 3, "q2": "I would like to see a more organized and thorough auditability section. This is a big section for me. I think there are some good starting categories to measure success by. I still want to see more quantifiable metrics and milestone-based KPIs based on timeframe. How many users do you want? How much volume do you want? At what timeframe do you expect to see these numbers, and what milestones are you aiming for before you get to that point? Especially for such a high price tag, I feel like I need to see very thorough and rigorous KPIs with public accountability available. ", "q2r": 2, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5691, "q0": "The Challenge question is \"How can Cardano-based solutions help meet real business needs and what would be their impact?\" and this proposal aims to create a peer to peer exchange. \"the product will be marketed directly in P2P trader communities.\" This does not directly address the challenge question, and appears to be a way for the team to avoid the legal requirements of running a centralized exchange. There are no clear KPI's provided, and it is not clear how the cardano community could audit the success of this project, or know how the funds provided are used. ", "q0r": 3, "q1": "The proposer lists the teams qualifications, and while they are technically competent it is not clear if they have the necessary experience to build and operate a centralized crypto exchange. They ask for a high budget, however most of the budget would go to providing liquidity to their exchange. \"Most of the Cardano received from this funding is allocated for liquidity and market making provision on the exchange. Around 160000 USD worth of ADA will go on to provide liquidity on ADA/ETB pair. \" It is also not clear they have established product market fit, with various DEX's and CEX's already online, why Ethiopians would choose this ADAX exchange over binance, or other decentralized and centralized exchanges. ", "q1r": 2, "q2": "The Audibility section of the proposal suggests that the community monitor the number of users and ada volume traded on the centralized exchange. However, being a centralized exchange, there would be limited transparency for the cardano community to Audit this exchange. No clear target KPIs are provided to evaluate success or failure of this proposal. The timeline and budget are also vague with 3 month and 4 month targets suggested, but not specific details about what will be completed at those times. ", "q2r": 2, "assessor": "z_assessor_215", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5956, "q0": "The proposer has identified a problem and a solution to the problem but the solution seems that doesn't fit into the Challenge brief.  Dapps and Integrations could a more appropriate category. Most currencies around the world are paired with the US Dollar ($), creating an exchange for crypto/local currency swap will add even more volatility to the exchange rate. Most DEXes on Cardano use ADA as main asset to exchange for other tokens. There are a lot of other aspects to be taken into consideration when creating a DEX (algorithms, orders books if any, AMM model etc.). The proposal, as it is, makes it unclear what is the value added to the Cardano ecosystem.", "q0r": 2, "q1": "From the traits the proposer has provided seems that he doesn't have the necessary experience for creating a DEX (SWAP). There are no evidences about his experience creating products on Solana network (which could be helpful for this kind of project)\n\nThe budget is not broken down into identifiable items, and a large portion of the requested fund is for assuring liquidity in the pool. Who would give such an amount to someone's discretionary?\nThe proposal doesn't offer a realistic timetable to complete the work. This kind of app requires a period of time for testing on a testnet before mainnet release.\nThe plan doesn't describe the resources necessary to implement the proposal. (humans, HW, SW etc.)", "q1r": 2, "q2": "The proposal, as it is presented, looks more like a concept than as a working product. It lacks in providing relevant info for an objective assessment.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6036, "q0": "The proposal is well planned and clearly addresses the problem at hand. The issue and the solution proposed are very much in alignment with the campaign goals. Making a centralized exchange that will let people trade different cryptocurrencies which will help to increase access to cryptocurrency in most developing countries. This would certainly provide more contributions to the community and boost its adoption globally and help onboard many new people into the Cardano community. This does further improves the Cardano ecosystem. Hence effectively addresses the problem", "q0r": 5, "q1": "The proposer has given a detailed explanation of how the intended exchange would be built. \nApart from that, there are a few other sections that are missing. The proposer hasn't provided the milestones and stepwise implementation timeline which is important. The budget makes no justice without a detailed breakup is provided along with it. The proposer and their team seem to have relevant experience and skills but without the complete timeline and budget breakup, it is hard to say if the proposal will be implemented successfully. Therefore, I am not happy with the amount of information given to estimate the success rate of the proposal.", "q1r": 3, "q2": "The proposal doesn't consist of the complete roadmap with the milestone. The key performance indicator given doesn't make sense and there are no proper metrics that might help to define its success. The proposal doesn't consist detailed budget breakdown as well. With all this information missing it would be hard for auditors to track the development of the proposal and to measure the success of the proposal.", "q2r": 2, "assessor": "z_assessor_317", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6972, "q0": "While exchanges more accessible to people in local, unbanked areas are desirable, a decentralized exchange would be more appropriate to Cardanos mission. The claimed impact on the many SDGs mentioned seems a bit far-fetched for a simple centralized exchange and is not explained further. Scalability is not adressed.", "q0r": 2, "q1": "I am afraid this proposal does not yet have a sufficient implementation plan. Neither are the steps of implementing it defined in sufficient detail, nor is the budget diversified, which makes it difficult to assess whether it is appropriate. Also using 160k of catalyst funds for liquidity on community funds seems a bit over the top, especially as many DEXes have shown how liquidity can be provided by the community by pools without use large amount of project funds. While the proposers seem to have some experience in the area, they fail to indicate their experience related to Cardano in general and e.G. Plutus. Also, while it is positive that a contingency plan has been made, I find the solution to the mentioned problem of regulatory issues \"let's just program it and hope it works out afterwards\" a bit troublesome. Overall, a detailed, structured roadmap and more concrete, financially quantified implementation steps would do this proposal some good.", "q1r": 3, "q2": "While the deliverables are clear and auditable, the path towards them is not explained very clearly, making this  proposal that can be audited once it is finalized, but not that well along the way. The problem and solution statement are clear however. You could have put a bit more effort into making some of your success factors more quantifiable/detailed.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Building a centralized exchange that allows people to trade different cryptocurrencies, including Cardano, with their local currency.", "experience": "I have experience in building trading engines. I am also active in the crypto community here in Ethiopia since I was a freshman in college. I have developed apps on Solana but now looking to expand on Cardano. I recently developed a P2P crypto exchange group locally on telegram."}