{"id": 405478, "author": "shareslake", "title": "Open by default stock market", "url": "https://cardano.ideascale.com/a/dtd/405478-48088", "category": 26445, "amount": 100000, "description": "When trading stocks into the current markets, there is no actual money flow to companies, but instead to intermediate entities. ", "f6_no_assessments": 7, "f6_rating": 3.1904761904761907, "videos": [], "media": [], "f6_assessments": [{"id": 1004, "q0": "As written, this project comes off as ambitious but somewhat vague and possibly overscoped. Voters may be confused as to whether the proposal is suggesting it provides synthetic stock trading at a quick glance, when it appears, I think, to be specifically selling shares in its own network. In other words, the lead is buried under the details of having built a Cardano-compatible sidechain. Put the premise upfront, then lead into how you plan to realize it.\n\nThe premise comes across as an evolved form of equity-based crowdfunding. Though promising, it's a model that's struggled to find investor adoption in the fiat world. It's quite possible that the concept is a better fit for crypto, but it's difficult to assess from what's been laid out here. The proposal links out to the project's site for details rather than listing them here, which is unfortunate because at the time of assessment the proposer's site was throwing a 522 error. ", "q0r": 3, "q1": "The proposer provides a link to the project's website in response to the feasibility queries. Unfortunately, at the time of assessment, the website was throwing a 522 error and was therefore unreachable. With no way of verifying or investigating the proposer's credentials or roadmap, it's impossible to evaluate the feasibility of the project.\n\nTo avoid this problem in the future, I would suggest that the proposer provide at least an outline of the project's roadmap and a basic overview of the team in case the site is down in the future.", "q1r": 1, "q2": "Here, as with Feasibility, the proposal relies on the CA/voter being both curious enough to access the linked project website and to be able to access it. It's quite possible that the project is as far along as the proposal suggests, but I was unable to access the linked website due to a 522 error. \n\nI, other CAs, and voters can only assess the information provided, and what's available this side of the hyperlink doesn't give much detail about the team, the lead, or what the money requested will be used for, or a timeline for development. In its current state, the legitimacy of this project cannot be evaluated.", "q2r": 1, "assessor": "z_assessor_1251", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 1203, "q0": "Shareslake address the challenge very well. It's a very novel concept that has allows both general ADA holders and more traditional businesses to combine using the power of blockchain to shift the way stocks and shares are provided/invested. A an ADA holder converts x amount into Shareslake redeemable token and in-turn is used to invest in traditional stocks and shares of listed companies. They are have presented a detailed and long-term roadmap, and are already well underway with their development. It certainly has the potential for large adoption, not just one or two partnerships but hundreds of businesses that want to harness some of the power of blockchain (and its user base) to raise new capital and general awareness. ", "q0r": 5, "q1": "I have a limited view on what the funds requested will be used for (and from my understanding it's either supporting internal dev and team or to be invested as part of ICO). It would help to have a breakdown of how $100,000 will be used. Additionally, whilst I believe Shareslake address the challenge excellently, I have reservations to the success of the project in the longer-term. As they openly callout, there are regulation concerns, and whilst that is not necessarily impending, it's certainly not far off and puts the project in unchartered water. Now, that could be overly harsh as many DeFi and blockchain commercial solutions are at risk of new regulation and operating in rapidly changing landscapes, however I do have some concerns that by partnering with traditional listed companies under the issuance of stocks and shares potentially has the additional exposure to risk from SEC/FCA regulators (naming only two national regulators). I have also not seen enough clarity on what the relationship of ownership will be between token holders, Shareslake and the potential listed company will be in relation to the shares themselves. ", "q1r": 3, "q2": "Shareslake roadmap is very clear and detailed. It looks into the mid-term on rollout and I have limited concerns to how the community can audit progress given the public facing nature of their roadmap. It's measurable over the next 9 months and can be relatively easy to review based on their upfront commitments. Whilst I agree with that the information provided is sufficient to audit the progress and success of the proposal, I held back on \"strongly agreeing\" due to lack of clarity to how the funds requested will be used and over how long (if required for 2022 roadmap or for a select purpose) which can make auditing a challenge.", "q2r": 4, "assessor": "z_assessor_1304", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5261, "q0": "Good idea with agreeable analysis on adoption, but there are a lot of risks for a BIG task. I am more overwhelmed by the scale and ambition of the project than I am impressed with the proposal. Plus, it's a very big price tag. The first impression I get from the proposal and the website is that there's a decent concept and good impact, in theory. However, there doesn't seem to be enough reliable evidence for success and an asking price like this needs to be extraordinarily thorough and airtight. For a project like this to work, it will need more than 2 team members, a list of multiple reputable/strategic partnerships (not just to add legitimacy), and a MUCH more trustworthy evaluation of their token. I was able to track down the token policy ID (https://pool.pm/addr1vxwddqm8lvaeujwt79t5zq20wnymt7fckwueuuj8wflmq5sl5w3nz), which would have been nice to find publicly displayed on their website. There are a lot of things that don't quite add up, but the most concerning is the evaluation of the token at 2.34 ADA per 1 RED token. At this evaluation, with an initial supply of 2.6m RED tokens, that would put them at a 6.08m ADA market cap. However, based on the wallet addresses that I could find, they only control about 8000 ADA to back their treasury. It's entirely possible that I'm missing information that they haven't publicly released, but then that would be another issue of lack of transparency. Overall, I appreciate the ambition and idea but I just need more information, evidence, and tangible development to believe this project has a legitimate shot at making this impact. I think this project needs to go through some risk-reducing development. ", "q0r": 2, "q1": "This feasibility section is not $100k presentation material. I shouldn't have to do the work of digging for information about how this project intends to spend this money or what the team's credentials are, but I will. In short, they don't actually say how they will spend catalyst funding money. They provide a link to their token distribution plan (which I think is a little oversimplistic), but they don't mention anything about how they intend to use the catalyst funding. I'm left to assume it will go entirely into their treasury (which would still leave their token vastly overvalued). They also leave a link to their roadmap, but again not specific to the catalyst funding. Lastly, it does not appear to me that they have the necessary experience or education to make this project work. They have some experience in software engineering (but there's only 2 of them) and they have nobody with experience in marketing or stock exchange investing (which is the entire center focus of their platform). Overall, I think this project needs some serious development in the expansion of their core team members to start. The proposal needs some work in directly laying out how catalyst funds are spent (it should not be Catalyst funding that is responsible for building a project's treasury) and what steps will be taken to achieve the goal of the Catalyst funding. ", "q1r": 1, "q2": "I look for quantifiable metrics in the auditability section, and I do not see any votable KPIs that I can give my approval of. Of course, this section is often very directly connected to the roadmap/implementation section, which is lacking in this case. This proposal seems to assume that the purpose of Catalyst funding is to develop projects on Cardano, which isn't exactly correct. We are not in the business of funding people's businesses. According to the first page of the Catalyst website \"Project Catalyst is a series of experiments which seeks to generate the highest levels of community innovation.\" While tokenizing stocks is something that has yet to be done, it's not necessarily a new idea. This sort service is already being developed by the likes of Maladex, Polymath, Valour, and a variety of reputable projects. My point is, in these proposals, I want to know what is it about requested Catalyst funding that directly contributes to that innovation AND how does that proportionally impact the greater Cardano ecosystem. ", "q2r": 1, "assessor": "z_assessor_1896", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "This assessment is basically complaining about missing information that can easily be found into the website"}, {"id": 5616, "q0": "The team proposes to build a new stock exchange on Cardano. Their main differentiation is to build into the tokens a form of royalty that gives the company a percentage of the funds traded, somewhat similar to royalties when NFTs are traded.\nThis could have huge implications if implemented well and would be an innovation as far as exchanges are concerned. Many companies could be attracted to this solution as it gives them a continuous stream of income without having to issue new shares.\nBut it isn’t very clear how sustainable the model is as the team also mentioned that it would be free for investors to trade. They will likely have to pay for this royalty to the company that issues the shares.", "q0r": 5, "q1": "The team seems experienced enough on the technical side having worked on their own start-ups before, the main issue lies with regulations. Not a lot of clarity was given about where they would launch first and how they would get regulatory approval. Perhaps a pivot to attracting crypto native companies in a permissionless way might be considered.\n\nThe funds requested are on the higher side, taking up 10% of the total for this category but likely will not be enough if the team has to deal with regulations. Voters might want to consider the opportunity costs of not having other proposals funded as well. To their merit, they have also launched an initial sale of their tokens for additional funding of a few million dollars.", "q1r": 3, "q2": "They will measure their success in terms of number of users and companies attracted. Fair enough and it will be a side chain to Cardano so activity can be measured independently as well if it is public.", "q2r": 4, "assessor": "z_assessor_2026", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 7051, "q0": "This is a very ambitious project. The idea is to challenge existing stock markets, by creating a stock market which will benefit the companies issueing the stocks with each transaction. There are also incentives against high frequency trading and incentives for long term investing in the white paper (although they mention supporting it in the future roadmap...).\nThe idea is very visionary, but the vision is not crystal clear, which is fine as this is really a moonshot. The proposer might have included information about first markets (seems to be based in Spain) and perhaps also tried to find a specific category of companies which would benefit extra from listing on Sharelake (like small startup tech companies, or some other target group).\n", "q0r": 5, "q1": "While I really enjoy the bold project, the goals of the Catalyst Fund 8 are not mentioned. The roadmap on the homepage lists features and milestone until the end of 2022, but it is unclear what the proposers would like to do if funded by Fund 8. \nThe team has apparently managed to create and deploy a smart contract on the Cardano mainnet, as they have initiated a pre sale of their RED-token. But that is still quite far from implementing a fully fledged stock exchange. The proposers do not provide any technical details on the implementation in the white paper, and the team seems to only consist of 2 people (quite talented though they appear), which seems to be too few to pull off a project which would need legal, business and engineering expertise and experience from the current stock market.\nThus, while the idea is great, I cannot find any plan to aquire the needed expertise, and without expertise in IPOs the chance of a successful launch are slim (although I do not have IPO experience, only experience from complex projects spanning business, legal and engineering).", "q1r": 2, "q2": "If the plan is to execute the roadmap on the homepage (which lasts until end of 2022) with the funds from Fund 8, then there are milestones to measure. But since the team are also doing 3 pre sales of their RED-token, it is quite unclear what the Fund 8 ADA would actually fund.\nThe funds in Fund 8 are not enough in my humble opinion (having no experience of executing IPOs) to hire a team of experts to design and implement a compliant stock exchange.\nThus, if the pre-sales are not successful, the Fund 8 ADA would not be able to execute the roadmap. \nThe proposers would have needed to provide a clearer plan B or broken out functionality which they could have created and benefited the network with, regardless of the success of the pre-sales.", "q2r": 2, "assessor": "z_assessor_533", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9968, "q0": "The proposal has nominated a project that effectively addresses the challenge of intermediaries in stock trading that many B2C business models have. I believe this is a real-life challenge, and it is fundamental for the development of stock trading to lift the barriers of losing money to unnecessary intermediaries.", "q0r": 5, "q1": "The presenters of this proposal have some unrivaled experience in stock trading and cloud computing. They are perfect groups for developing such a Cardano-based network. Their plan for this project is tailored beautifully. The presenters have proved that they have planned the project carefully, and this proposal is well-thought-out. It hardly any aspects that have not been mentioned in the proposal or the website. However, I wish that I could see a clearer picture of how these entrepreneurs are planning to market this product. I want to have more details of the revenue model of this company: how exactly do they make money through their services. ", "q1r": 4, "q2": "This is an excellent proposal. First, it includes everything I need to assess the potential of this project - from technical aspects to money allocation. The website of the project is developed and designed perfectly. I find the interface gorgeous, extremely easy to use, and informative.", "q2r": 5, "assessor": "z_assessor_780", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 9969, "q0": "While there are many tools and sites for companies to make transactions to their investions, almost all of them require a considerable amount of fee. Shareslake helps people trade openly without charged commission, leading to the development and convenience of trade, transaction. The direct monetary benefit against the current markets, the open application, and wide connection thanks to the server would play an important role in avoiding the problem of fee transactions that most company resist, encouraging them to sell their products by using cryptocurrencies and involve in this market more (better management and convenience than the cash fluctuations). This proposal effectively addresses the Business Proposal challenge, however the regulations between different countries may be a constraint that the team need to check frequently, carefully. The Budget Allocation, Fund, Detailed Timeline, Auditability should be more detailed and tracked more carefully, added anaysis is needed to further ensure the level of efficiency in the long run.", "q0r": 4, "q1": "The proposal is well developed with clear sections and addresses the necessary factors reasonably. The sections are described and elaborated well, with impressive website and professional preparation. Further work on the Impact, Auditability measure, Spread the Awareness of the project is still needed. Later, when more and more start joining, accurate, updated and smooth tracking tools of fund division, stake shares must be checked and improved very carefully to ensure the credibility and security level.", "q1r": 4, "q2": "The information provided addresses enough information, sections, areas to have an overall orientation of the the project in the future. The timeline, especially, are depicted in a detailed and reasonable schedule. With all the preparation and data pool at the moment, the project would be able to start favourably. However, every process and step needs to be further researched and analyzed so that the companies and customers can understand very clearly about the function. Sustainable method of attracting and dividing fund, evaluating the companies to divide funds, managing large amount of participants should be set as concerns to research further.", "q2r": 3, "assessor": "z_assessor_781", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We provide funds to companies every time the shares are transacted without charging commissions to investors, removing intermediaries.\n", "experience": "I am an investor in public and private companies since some years ago and also engineer and software developer in top cloud computing companies for several years."}