{"id": 382475, "author": "huths0lo", "title": "AdaFundMe.io", "url": "https://cardano.ideascale.com/a/dtd/382475-48088", "category": 26236, "amount": 2500, "description": "目前还没有任何使用Cardano Ada筹集资金的公开网站。", "funded": 0, "upvotes": 17815154, "downvotes": 15566090, "votes_result": 2249064, "votes_cast": 238, "f6_no_assessments": 10, "f6_rating": 2.433333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "该团队提议使用ADA建立一个筹款平台，他们声称这个平台仍然不存在。尽管情况可能是这样，因为一些平台正在开发，但似乎还没有完全完成，这个目标与挑战的目标不完全一致。这项挑战的目标是为 \"催化剂 \"本身创建替代的和更快的机制，以加快资金分配的方式。与此相关的最接近的建议是'GoFundMe'活动的例子，在这个活动中，资金可以立即提供给活动创建者，但即使这样也不会使用催化剂的资金。尽管如此，这样的项目将在Cardano生态系统中产生良好的影响，而且这个解决方案，如果开发得当，可以轻松地扩大规模。提案人应该包括一些关于挑战的影响的关键绩效指标，以便能够对其进行评估。如果该提案在这一轮没有得到资助，我建议寻找另一个与提案目标有更好匹配的挑战，并在提案中增加一节解释这种匹配，不仅让评审员，也让团队本身更清楚提案的匹配程度。另外，生态系统中的一些其他项目也在试图建立一个类似的平台，在基金7中，许多提案都有类似的想法，所以也许可以找到一些合作。", "q0r": 2, "q1": "该团队的背景只是在 \"相关经验 \"部分简单地提到。我曾与其中一位提案人合作过，我知道他的能力，但关于团队本身的更多信息却没有。一些参考资料，如过去的工作实例、LinkedIn网页和其他种类的信息，以使人们更容易了解他们的背景。另外，它说预算要用来雇用额外的人管理这个项目，但它应该解释他们在寻找什么样的人，并解释总共有多少人要为这个项目工作。这也与提案的预算有关，与这里的建议相比，预算似乎很短。它提到进一步的资金将通过从小费和资金百分比中收集的小额馈赠来筹集，但依靠这个来建立平台听起来有点冒险。该提案应包括正在开发的详细路线图。它目前只说该项目将在融资后30天内完成，但如果不解释范围和需要做什么--考虑到他们提到平台已经部分建成--就很难相信这将在提到的时间框架内交付。它还提到它将雇用一些人从事这项工作，而要在30天内做到这一点并开发所有的东西，听起来并不十分可行。对于这样一个平台，一个网站或应用程序将是必要的，但这在提案中没有讨论，也没有包括在预算或发展计划中。为了提高它在未来基金中的可行性，如果这一轮没有得到资助，提案人应该增加这里提到的项目，和/或寻找撰写提案的建议，因为这个想法是好的，它只是需要更好的写作来提高它被资助的机会。", "q1r": 2, "q2": "不幸的是，该提案缺乏关于其可审计性的信息。唯一能够跟踪进展的信息是，它说在30天内将完成该项目，但它没有进一步解释将做什么，以及哪些是步骤。建议团队应该增加一个路线图，即使它很短，只包括少量的步骤。此外，还应该包括一些关于提案的发展以及提案发展和运行后的影响的关键绩效指标，这样社区就可以跟踪提案的进展和发展后的成功。", "q2r": 1, "assessor": "z_assessor_31", "no_vca": 21, "ne": 14, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is to build a website to do funding, however no details on the economics of how the funding will actually work have been provided. Currently it is an idea to replicate both Kickstarter and go fund me with ada, but there are no concrete details on how this will be governed, audited etc. ", "q0r": 2, "q1": "Apart from \"build a website\" there are no details of the mechanics of funding, auditing, governance, marketing etc. This is a complex project and without a detailed plan it is unlikely to success in its current form for the budget requested. Please provide a business plan on how the project will target its  both sides, and how you will audit delivery, manage funds transfer. Are you going to use smart contracts? Please also produce a delivery timeline for the technical components required to achieve all this and a detailed budget breakdown. ", "q1r": 1, "q2": "Whilst delivery of the website can be assessed, what is success? How many projects funded over what time frames?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 29, "ne": 2, "ng": 21, "nfo": 6, "vca_o": 1}, {"q0": "While a kickstarter-type model is interesting for distributing payments, I do not see how it would address the challenge of distributing the funds from the cardano treasury in a safe, secure, and expedient manner. The proposer did not address how their system would be more effective than the current catalyst payment system. I do not believe that the purpose of this challenge is to provide cryptocurrency crowdfunding, but it is nonetheless an interesting concept. If the proposer could address how this proposal would work to improve the current catalyst payment system, it would greatly strengthen the proposal. (score given: 1)", "q0r": 1, "q1": "While the proposer has noted their experience, I do not know the extent of their knowledge because no specific amounts of time were listed under relevant experience. I also do not see any plans for how the proposer will go about creating/implementing this project. What concrete steps will the proposer make to build the interface? What features will be in the interface? If the proposer could address these questions and provide more concrete information about the project besides background knowledge, it would greatly strengthen the proposal. (score given: 2)", "q1r": 2, "q2": "The proposer has not provided any key performance indicators or metrics of success for auditability. I assume that one metric of success would be the completion of the interface and having users actively getting funded, but these were not listed in the proposal. While there is a 1 month timeline for the development of the interface, I do not know how the proposer plans to bring in new users after that. If the proposer could elaborate on the auditability of the proposal, it would help voters better understand the goals and metrics of success. (score given: 1)", "q2r": 1, "assessor": "z_assessor_310", "no_vca": 20, "ne": 5, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "The proposal describes a funding alternative consistent with other collaboration-based practices. As simple as it may sound, it is perhaps an option whose scope should be explored.  \r\n\r\nHowever, the details offered by the proposal are quite general.  The proposer claims to have part of the proposal already developed: please provide more descriptive information (snapshots, technical description, etc) that will allow the voter to get a clear idea of the current status of the proposal.\r\n\r\nFor example, more information is needed to be able to connect with the idea of \"With the site framework largely in place, we beleive this project could be completed within 30 days of funding.  Money will be spent as follows.\"\r\n\r\n\r\n\r\n", "q0r": 3, "q1": "Please provide more information about:\r\n\r\n- the proponents of the proposal.\r\n- budget\r\n- structure of the website\r\n- how the community and the general public will interact with the site.\r\n-Other information of interest.", "q1r": 3, "q2": "There are no KPI's with which to track the proposal.", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 20, "ne": 0, "ng": 14, "nfo": 6, "vca_o": 1}, {"q0": "The proposal could serve as a sort of rapid funding mechanism but it doesn't make an effort to address the questions posed in the challenge brief.  what would proposals be vetted on? is there any mechanism to track progress of funded proposals? How would this system scale?", "q0r": 2, "q1": "I think it is unlikely that this proposal will have the intended impact. there is a lot of design and logistical questions that would go into the creation of a legitimate crowd funding platform. There is no budget for marketing or strategy to attract the participants that would make the platform successful. ", "q1r": 2, "q2": "The budget involves some site development and the hiring of employees to vet the proposals. No metrics for success are given. ", "q2r": 2, "assessor": "z_assessor_67", "no_vca": 20, "ne": 0, "ng": 15, "nfo": 5, "vca_o": 1}, {"q0": "The funding solution presented by this proposal has great potential. If the solution would be properly implemented, it could prove to be a popular use case for Cardano and have a considerable positive impact on the ecosystem as a whole. Having said that, the proposal does not address the challenge brief of finding a way to rapidly distribute treasury funds. Funds could be distributed from the treasury by this route, but that is not necessarily the scope of this proposal, at least it's not a clearly presented option. Perhaps a variation of this implementation could be submitted as a proposal in the future with a focus on distributing treasury funds. For example, community members could vote on campaigns seeking funding and funds would be allocated from the treasury (in addition to having the option to contribute directly).", "q0r": 3, "q1": "As it happens, this CA knows one of the proposers from his previous projects and efforts within the Cardano community, however one should not rely on that and more information and credentials should be added in the future, especially since the \"Included identifying information about all proposers\" requirement was marked as successfully completed in the self-assessment checklist.\r\n\r\nConsidering the previous efforts of one of the proposers and that the requested budget is low and the potential impact of the project could be high on the Cardano ecosystem, even though not perfectly aligned with the challenge brief, the project could generate a very good ROI.", "q1r": 4, "q2": "Given that we're talking about a public website and service its operation and success can be easily verified by the community. But on the other hand, no clear KPIs or a roadmap was included in the proposal. The proposer does mention 30 days to completion, but it's not clear what he's referring to, an MVP or a fully functional service with vetted campaigns already running.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "Put simply, the premise of this project is to address funding rapidity through developing an ADA based crowdfunding platform that would integrate the best of go fund me and kickstarter.\r\n\r\n\r\nThe project is aligned with the challenge in that there are options for how funds are to be disseminated however, it doesn't address how people will move from volunteerism to paid contributions specifically, there is an inherrent assumption that crowdfunded projects would lead to paid work. \r\n\r\n\r\nThe scalability of this project lies in the usability of it - how many people need this or will make use of it for projects and indeed if this is a more familiar platform for raising funds than Catalyst. However, in that, crowd funded projects tend to - as is pointed out in the proposal - rely first on peers and family of the project team. Does that increase the pressure for proposers to convert their family and friends to using Cardano to contribute to their projects - or does that exclude the first donors. ", "q0r": 3, "q1": "The team members driving this have experience as a cardano creator and developer and network engineer and has created several Cardano related services - however none of those services has been listed so it's hard to substantiate the skill level aside from the provided prototype. \r\n\r\n\r\nThe budget is fair and the team suggest the project will reach completion in 30 days. Risks are taken into consideration and it does provide for the project team to derive ongoing employment through the site and indicates there would need to be some manual involvement to ensure funding submissions are indeed above board.", "q1r": 4, "q2": "Given the timeframe of delivery being 30 days the proof really would be in the delivery of the prototype in full. \r\n\r\n\r\nKPI's are not included in the proposal, so it is difficult to guage the success measures of the project aside from the site existing.There is scope for this process to be more collaborative and engage the community in the design and look into how problems that aren't being solved by current crowdfunding platforms could be solved by this one. There is an active prototype included in the proposal.  It's an initiative that if successful could really see a big opening of opportunity for new people to access the Cardano community.  ", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 16, "ne": 8, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "This proposal has managed to find a niche when it comes to funding on Ada that being GoFund me like donation campaigns but with Ada instead of fiat currency. However, Im believe the traditional kickstart business campaigns would be best suited to other sites like catalyst due to their increased transparency and community features already build out on such platforms. ", "q0r": 4, "q1": "While the plan itself is highly likely to be executed successfully I am concerned about the budgeting. There seems to be no funds for marketing or branding and while checking out the website of the current project they are defiantly lacking in the brand identity area this is a concern to be as the technology required for such a platform is not particularly complex so competitors with additional marketing/ branding facilities may overshadow this project. ", "q1r": 3, "q2": "There is no metrics of success defined for 3, 6 and 12 months and there is no date set out for a public launch. These are two big oversights. Furthermore, information on the proposers cannot be found links to LinkedIn or personal websites would go a long way.Furhter more the proposers claim to have already built services on the Cardano ecosystem why not link us to these projects? It would help build a great deal of trust. ", "q2r": 1, "assessor": "z_assessor_760", "no_vca": 16, "ne": 0, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "Great idea and love that it is already in progress; however, the proposal does not provide all of the information necessary to say if it effectively addresses the challenge.", "q0r": 3, "q1": "The founder's experience as a developer and network engineer is great. However, there are no KPIs and project roadmap.", "q1r": 3, "q2": "The budget breakdown is a good first step for an audit; however, the lack of KPIs and project roadmap detract from the auditability. ", "q2r": 3, "assessor": "z_assessor_888", "no_vca": 20, "ne": 2, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "AdaFundMe as a GoFundMe/Kickstarter is a unique alternative rapid funding mechanism to catalyst. this proposal is correctly addressing the challenge by creating this alternative funding option.", "q0r": 5, "q1": "More detail on the team behind this proposal would be helpful in determining its overall efficacy. The proposal description is on point in explaining the solution in comparison to web2 equivalents but without a roadmap, KPI, proposer relevant experience and (if this is to be built into a fully functional app) some form of a specification which delves into particulars of backend functions it's hard to have confidence in a high success chance currently. ", "q1r": 2, "q2": "The information provided is not sufficient to audit progress or future success: more detail on proposing team's relevant experience is needed alongside a roadmap, KPI section and docs explaining the apps functionality.", "q2r": 2, "assessor": "z_assessor_913", "no_vca": 20, "ne": 0, "ng": 17, "nfo": 3, "vca_o": 1}], "solution": "构建出一个公共网站，为这种筹款活动创造一个平台。", "experience": "Cardano创造者，开发者，网络工程师。  已经开发了几个与Cardano相关的服务。"}