{"id": 384039, "author": "sofi.heessen", "title": "AKI: Agile Katalyst Intrapreneurs", "url": "https://cardano.ideascale.com/a/dtd/384039-48088", "category": 26236, "amount": 11520, "description": "目前的资助体系要求工作提前规划。没有它的快速供资需要其他形式的投入和问责", "funded": 1, "upvotes": 30855849, "downvotes": 17649169, "votes_result": 13206680, "votes_cast": 219, "f6_no_assessments": 5, "f6_rating": 3.4666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a proposal to fund 3 months of 2 week projects on things related to the dandelion ecosystem. The focus of each 2 week round will be decided by a board. This will be a proof of concept of funding agile development. \r\nThis seems like it could be a good idea, however there needs to be more focus on developing the governance and reporting so it can be be replicated after this initial project. Otherwise its just a project funding work on dandelion and doesn't really meet the challenge.", "q0r": 4, "q1": "The proposer has relevant experience and an interesting idea. The plan as it currently stands seems more focused on the project of doing work on Dandelion. It would be good to see more planning on the governance aspect and production of a system that would allow this idea to be replicated elsewhere if succesful.", "q1r": 4, "q2": "Progress of the plan as presented should be easy to audit. Success of the goal of this project however is that this works as a proof of concept that can be scaled up. This requires production of reports on how well the governance worked and how accountable and transparent the process was.", "q2r": 3, "assessor": "z_assessor_11", "no_vca": 26, "ne": 2, "ng": 21, "nfo": 3, "vca_o": 1}, {"q0": "As mentioned by the proposer, this proposal does not directly, in its current form, address the rapid funding aspect of the challenge. The main goal of this proposal is to improve accountability and transparency in a scalable and adaptable manner. I believe that the proposer's goal of increasing the community's involvement in proposal iteration is a great idea. However, if the proposer could include information about how they could use their project for fund distribution in the future, it would help voters better understand it in relation to the challenge category it fits under.  Another question I have is with regards to scalability. How will this concept be scaled to magnitudes of 10x or even 100x? The proposer could include information to address that question. (score given: 3)", "q0r": 3, "q1": "The proposer has enough experience and motivation to successfully implement the proposal. They have background in computer science and professional experience software development. Additionally, the proposers provided motivation for this project also leads me to believe that they will work to ensure the proposal is successful. \r\n\r\nBased on the plan provided for the implementation of the proposal, I believe that it can be successfully implemented. However, the proposer could provide some more details about the proposal overall that would strengthen it. For example, how will interested parties be selected to be on the Dandelion project? Wouldn't that be a centralized process if the proposer is the person selecting the members of the team? (score given: 4)", "q1r": 4, "q2": "The proposer did not provide many measures of success in the proposal. I am unsure if the cardano community would be able to audit the progress of the proposal because there aren't many concrete ways to track success. The 3-6 month roadmap isn't incredibly complete with regards to what will be achieved at the end of the development period. The proposer mentioned that they will provide a public record of the meetings, which is good for auditability. If the proposer could include some measures of success, such as ideas processed through this program, it would make the proposal stronger. (score given: 2)", "q2r": 2, "assessor": "z_assessor_310", "no_vca": 18, "ne": 5, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "I think the Agile methodology is one of the most beautiful ways to approach a problem: iterations, solve gradually a problem step by step, moving towards a solution on a human colaboration basis.   Rinse and repeat, chasing the next problem.  In many other scenarios has shown being an spectacular tool and in the Rapid Fund area could not be different. In fact, the Agile methodology is one of the tools that the Dapps certification process will use.\r\n\r\nThe general picture describe for the proposal has logic:  The proponent wants to develop a framework  and then test the framework in an ecosystem that he knows well.  The agile team would be made up of collaborators from diverse backgrounds in the Cardano ecosystem (this openness gives the proposal a valuable dose of transparency).  \r\n\r\nHowever, it is not clear what substance is being studied.  That is, the proposal describes techniques or moves to win the game but does not provide details about the opponent, field conditions, weather, etc. I know the ultimate goal is to develop a framework to contribute to the community's needed rapid funding efforts, but after reading the proposal 4 times, my mind has to make a lot of assumptions connecting the dots (I hoped that the miro board help me with a more nuclear information, but again, it describes only the moves) \r\n\r\nQuestions such as the following arise:  \r\n\r\n- What makes Dandelion project so special?  I'm sure that the reader wants to feel some of the proponent inspiration about that project.\r\n\r\n- What would be the procedure for recruiting Agile team members?\r\n\r\n- How does prescribing Dandelion as a testing ground not compromise the search for a future framework that is applicable to a general problem, in this case, finding a Rapid Funding Mechanism? Is the goal to contribute to the development of Dandelion or to the development of an effective Rapid Funding Mechanism?\r\n\r\n\r\n\r\n\r\n", "q0r": 3, "q1": "As it stands, I believe it is difficult to defend the potential success of the proposal's implementation. Undoubtedly, It has the spirit in terms of technique and transparency. \r\n\r\nIn addition to the issues mentioned above, for the sake of the proposal, please try to make a better description of the budget: clearly distributed by iterations, less succinctly more informative. \r\n\r\nIn general, do your best to take cognitive work off the voter's shoulders.", "q1r": 3, "q2": "No defined KPIs.  No solid ways to measure the progress of the proposal.", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 21, "ne": 2, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "The proposal meets the challenge brief by envisioning an alternative, iterative funding process to be applied in a pilot to a previously Catalyst-funded project. If successful it could be applied to other high-priority projects in need of consistent community funding.  ", "q0r": 5, "q1": "The proposer is involved in the Catalyst community and has extensive agile experience. The interested parties (i.e. dandelion team, etc.) provide additional technical resources. ", "q1r": 5, "q2": "After three months the success of the project will be judged based on interest and involvement from interested parties and the success of the agile development. ", "q2r": 5, "assessor": "z_assessor_67", "no_vca": 20, "ne": 2, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge as it provides a strong (theoretical) alternative to Catalyst as it has identified a age-old fear of entrepreneurs that is how to build something that people actually want ! By allowing agile teams to quickly get feedback during the development process it can help teams to quickly adjust products and build products that end clients actually want to use. Transparency of fund allocation can also be improved as it will be more apparent what features a team manages to add during a agile sprint and how much of the funds that cost. ", "q0r": 5, "q1": "There is no breakdown given of how the ~$11,500 will be spent - I know that a overview of what money would be spent on has been given but I would have liked to see a breakdown of the ~$11,500. However the proposer has a strong background in computer science and agile teams which is promising. ", "q1r": 3, "q2": "Insufficient metrics of success has been defined the proposer has not outlined what success would entail from 3 months or 6 months. The proposer has not defined a public launch date or has outlined how they suggest ramping up from an initial small test group to a full public launch. The proposer has not outlined how such a project will become self-sufficient. What happens when the funds run out ? Lastly, the proposer has not outlined how such a project would be auditable and transparent. ", "q2r": 2, "assessor": "z_assessor_760", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "设计一个框架，将一个开发团队和一组有代表性的利益相关者结合起来，以指导和评估工作的迭代。", "experience": "7年的敏捷开发工作经验，各种角色。Scrum master, dev, product owner\n自2021年2月起成为活跃的催化剂成员"}