{"id": 381662, "author": "cryptotexty", "title": "Cardano Events in Ukraine 20 cities", "url": "https://cardano.ideascale.com/a/dtd/381662-48088", "category": 26234, "amount": 13000, "description": "Necesitamos aumentar la participación significativa entre la comunidad. ¿Aún no conoces Cardano? Vamos a ir a ti - a tu ciudad o pueblo", "funded": 1, "upvotes": 24034544, "downvotes": 16152037, "votes_result": 7882507, "votes_cast": 241, "f6_no_assessments": 18, "f6_rating": 2.962962962962963, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta propuesta incluso dialoga con el objetivo del reto de atraer nuevos participantes a la comunidad y promover un evento, pero me pareció algo abstracto y superficial. Desgraciadamente, no me sentí muy seguro de que el lugar elegido para promover estos encuentros -Ucrania- sea realmente un punto estratégico en el que invertir en ese momento. El autor afirma haber escuchado a algunas personas hablar sobre el mundo de la criptografía en un bar, pero eso no es suficiente para argumentar que es un escenario clave para invertir una alta cuota de financiación y tener un ambicioso plan para visitar 20 ciudades diferentes. Creo que fue demasiado, sería interesante que el autor nos proporcionara más datos e investigaciones sobre Ucrania, si la gente allí tiene algún tipo de apertura para la inversión en el mundo criptográfico, si es un lugar de tradición por parte de la tecnología, cómo es la cultura local, ese tipo de cosas. En otras propuestas con objetivos similares, es decir, invertir específicamente en un país, había este tipo de argumentos, que son muy importantes para que la gente de fuera del país en cuestión entienda y confíe en el valor real de trabajar allí. Otra cuestión que me pareció es que el autor no tiene muy bien definido cómo serían estas reuniones, es decir, si él sería el único que presentaría, cuál sería el contenido exacto de cada reunión, a qué público se llegaría... Nos da una estimación de entre 20 y 50 personas, pero no hay ninguna garantía de que esto sea así, y ¿realmente vale la pena la inversión de 650 dólares para un grupo de 20 personas que ni siquiera sabemos si están dispuestas y preinteresadas en entrar en nuestra comunidad? En resumen, creo que sí, que hay posibilidades de que esta propuesta tenga un impacto positivo, pero faltó más certeza de por qué es bueno invertir en Ucrania y una noción más sólida de cómo serían estos encuentros.", "q0r": 2, "q1": "El autor de la propuesta nos proporciona poca información sobre sí mismo. Cada uno de ellos podría haber sido mejor explorado. Por ejemplo, 5 años en la cadena de bloques, pero ¿haciendo qué exactamente? Si tuviera una propuesta financiada en el fondo 6, ¿cuál? ¿Qué empresa está desarrollando en nuestra blockchain? Aunque sabemos algunas cosas, es muy poco, falta detalle para construir una mayor confianza en él y su trabajo. También es problemático que no tenga a nadie fijo para trabajar en este viaje, quiere hacer varios viajes y presentar estos encuentros en 20 ciudades, pero creo que es difícil que una sola persona se encargue de todo: preparación + presentación de contenidos, la parte más burocrática de la producción como, por ejemplo, el alquiler de un entorno, la publicidad de los eventos (una parte muy importante, ¿cómo se enteraría y se interesaría por estos encuentros la gente de Ucrania que no está acostumbrada a tratar temas criptográficos?) Hay que pensar en varias cosas, creo que no es un trabajo para una sola persona. No hay un guión que determine cómo se celebrarían estas reuniones, la parte de planificación de cada una, las posibles fechas, el posible público objetivo y repito, cómo enfocarlo, sería necesario realizar una fuerte campaña de publicidad para asegurar el mayor número de participantes posible. También sería necesario que el autor desglosara con detalle los temas tratados en los encuentros, creo que sería mejor que fuera un contenido introductorio. ¿Y cómo expondría dicho contenido? ¿Serían conferencias, puramente? Dice estar interesado en convocar a personas involucradas en la localidad para que den sus declaraciones y se sumen en las reuniones, pero sería importante que nos presentara algunos nombres que pretende invitar, para que podamos empezar a visualizar cómo se desarrollarían las cosas. En cuanto al reparto financiero, necesitaría profundizar en qué se utilizaría cada cuota de 650 dólares. Cita algunas posibilidades, pero lo ideal es proporcionarnos un plan definitivo, no sólo intenciones. Cuánto se destinaría a la cosa dentro de estos plazos. Y además, me parece un poco exagerado ya querer ir a 20 ciudades de golpe, sería más plausible que promoviera estos eventos en un número menor de ciudades, las principales, digamos, podrían ser unas 5, y dependiendo del feedback seguiría con su viaje. Desgraciadamente, hay que replantearse muchas cosas aquí.", "q1r": 2, "q2": "Esta propuesta no presenta en ningún momento ningún tipo de métrica de éxito, KPIs, resultados a conseguir en un determinado periodo de tiempo X, etc. Es decir, no tenemos contenido para controlar si la idea se estaba poniendo en práctica correctamente. Sería importante que el autor nos diera información directa sobre cómo fueron las reuniones: cuántas personas estuvieron allí, quiénes eran esas personas, cómo salieron del evento, si tienen intención de participar en la comunidad, cómo presentar un seguimiento después del evento. Si tiene intención de repartir recompensas y demás, es muy importante que nosotros también tengamos un retorno, esta inversión tiene que estar justificada, y como Ucrania es un lugar algo inaccesible para la mayoría de nosotros, que no somos rusoparlantes o ucranianos, es necesario que toda la información llegue de forma organizada, debidamente traducida y con una periodicidad fija. Me apena señalar tantos defectos, pero no puedo decir que me sentí ningún tipo de posibilidad de seguir el progreso de este proyecto, le pido al autor para volver a pensar en lo que es necesario para la comunidad para tener la seguridad y recibir información sobre la inversión, con el fin de garantizar que era tal acción es válida.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal from Andrii will create 20 community events/meetup, which from it, will onboard and integrate new people into Project Catalyst/Cardano. In addition, from this events, it can be used to build new teams of proposer from Ukraine Cardano Community. In my opinion this project will engage more local people into the Cardano ecosystem.", "q0r": 5, "q1": "It would be great if Andrii could add his LinkedIn profile or show some link that he got funded in Fund 6, to prove the credibility. And it's a good point also to break down the estimation cost of each event into more smaller detail.\r\n\r\nThe roadmap & milestones in each month are missing. It will be a great addition too, if the community know what this project will achieve each month.\r\n\r\nThis project I think could be successfully implemented if funded. But the proposal could be improved to give more information for the community.", "q1r": 3, "q2": "Key metrics and KPI are explained quite well in the proposal. But the community could not see any link or website where we could track the project progress if funded. So how the community can do audit on it? It would be nice if the proposer add a link which community can check later on if the proposal is funded.", "q2r": 3, "assessor": "z_assessor_282", "no_vca": 15, "ne": 3, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The proposal proposes a solution to widen the reach of Cardano across cities in Ukraine - an upcoming and active country in blockchain and cryptocurrencies. By organizing events catering to local crypto and IT communities, the proposer may be able to attract a high percentage of the event audience to the Cardano ecosystem. The next question I'd suggest for the proposer to consider is how to could ensure meaningful participation and retention of the audience in the Cardano ecosystem after the first event. What should be done to push forward to goals of this challenge (e.g. increase active participation in Cardano across roles and functions)? Some thoughts on the next steps after the first introductory event would be great to strengthen the impact of this project.", "q0r": 3, "q1": "It's evident that the proposer is highly involved in the Cardano ecosystem, having various roles in Project Catalyst since Fund1 and won in F6 with Cardano Hub idea. Having said that, I would hope to see some links, presentations, or any materials that the proposer has built for his previous community events that would help me and other voters have a better sense of the proposer's experience. The budget is $650 for each event of 20-50 participants, equivalent to $13 to $32.5 to acquire a new partcipant in the ecosystem (assuming that 100% of the audience will join the Cardano ecosystem). This is a relatively high user acquisition cost, given that the plan to retain and engage those people is not clear (to put it in perspective, , the average cost to acquire an app user who registered with an app or created an account was 3.52 U.S. dollars in 2019 per Statista).", "q1r": 3, "q2": "If the KPI is the number of events organized within 6 months, the project is easy and straightforward to audit. If the KPIs are revised to include some metrics that measure the effectiveness of those events (e.g. meaningful participant of the audience in Cardano ecosystem), I would suggest the proposer to find more metrics to define success (e.g. number of proposers, CAs, vCAs who join Cardano and Project Catalyst next year from those cities in Ukraine). It will be more difficult to audit those metrics of quality, but it matters to support the ultimate goals of the challenge. ", "q2r": 4, "assessor": "z_assessor_684", "no_vca": 13, "ne": 6, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The essence of each cardano project is to ultimately expand the cardano ecosystem. This project provides the platform to address such a challenge. The project takes into account the long term growth of the cardano presence in Ukraine. Therefore the proposal is ideal for the cardano community but also across the country Ukraine", "q0r": 5, "q1": "The proposal provides a clear picture of its target audience, which is the selected towns in Ukraine. Aside that, the team has and experienced team lead who is prepared to push the project to achieve its goals. Also, the project provides a clear work breakdown structure outlined to execute the proposal from the start to the finish. Additionally, the project provides a clear timeline for each event, with a set target for both the short and long term. Finally a detailed breakdown of budgetary allocation is provided for the proposal. Therefore, I am convinced the project will be successfully executed when provided with the needed fund.", "q1r": 5, "q2": "The details required in respect of metrics to gauge and track the progress and success of this proposal when funded is not sufficient", "q2r": 2, "assessor": "z_assessor_732", "no_vca": 14, "ne": 3, "ng": 6, "nfo": 5, "vca_o": 1}, {"q0": "Wonderful idea and plan. You did mention the metrics of success. Apart from sensitizing the people, how many do expect to join the Cardano community, becoming  CAs, vCAs, etc. I know you will eventually get there but mentioning things makes your proposal more focused", "q0r": 4, "q1": "the plan of the proposal is woven into your message: the of people per city, the cities, etc but a clear timetable spelling out the town/city you intend to be with the associated cost could have strengthened your message. ", "q1r": 4, "q2": "The budget is moderate but again I expected a schedule that will go with the budget. Traveling to different cities and holding events may not cost the same.", "q2r": 3, "assessor": "z_assessor_728", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "Ambitious and focused on 20 cities in Ukraine. Great idea to expand catalyst to more cities. The proposal would be more helpful to include a road map of activities for the events.", "q0r": 4, "q1": "The idea is great but feasibility to importance as well. The project could focus on fewer cities or one city and a detailed road map for expansion across the remaining cities. ", "q1r": 2, "q2": "Auditing this would be difficult since the proposal does not state clearly how it would document activities. Also, there is no plan for the huge tour of events across 20 cities which would make auditing quite difficult. ", "q2r": 2, "assessor": "z_assessor_727", "no_vca": 16, "ne": 0, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is a wonderful idea. There is good congruence between the key metrics & goals and the challenge settings and the proposal is geared towards tackling the problem. This proposal would make great impact because from the detailed plan section, the proposer talked about some two guys who in 2020 were talking about Cardano, just that they were not exposed much to the community. When the proposal is achieved, it would expose more people to Cardano and that would extend the territory of Cardano. The proposal also has a long term positive impact potential.", "q0r": 5, "q1": "The proposer has skills and experience considering the fact that he has been partaking since fund 1 just that there is no team for the proposal. The budget is well presented. The proposal has a detailed plan and that for me would help in its implementation. However, risks/challenges involved in the achievement of the proposal are not outlined.", "q1r": 4, "q2": "The time horizon is given for the execution of the proposal. I find it difficult to see milestones and KPIs for this proposal. I appreciate the fact that the proposer has described the targeted problem and the solution for it.", "q2r": 3, "assessor": "z_assessor_717", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "The proposal aims to organize community events to widen Cardano ecosystem as well as Catalyst community in 20 cities in Ukraine. The proposal's problem is within the challenge. The proposer clearly articulates how it will add value to the Cardano system.\r\nHowever, the key metrics of the proposal are missing. I recommend the proposal should provide the success metrics which align with the outlined challenge setting 'Community Events'. For example:\r\n- Number of participants\r\n- Number of feedback from participants\r\n- Number of participants that become active community advisors\r\n- Number of particpants that become proposers\r\nDue to the missing success metrics, I rate impact with a score of 3.", "q0r": 3, "q1": "The proposer seems to be egaged in Project Catalyst and Cardano ecosystem, but no evidence provided. I commend he should add references about his experience and relevant skills to implement the proposal. (The name, link of your funded proposal,etc).\r\nThe budget is not broken down into identifiable items (Although the author mentioned the budget includes transport costs, the venue rent, accommodation,etc, it is still not clear in the plan, just in a consideration).\r\nThe proposal does not have a sensible and conductible plan without timetable or resources necessary to implement the proposal. I recommend the author should make the proposal more feasible by adding missing information like content of events in details (attach documents,...), description how success look like, marketing strategy to attract people attend events, activities in events,etc. The author should also descibe resources neccessary to organize events as well as challenge and risks which are relevant to the success of events (For example: the challenge factor is another lockdown as a result of Covid which will require less gathering and contact. In that case the author has to consider setting up for the virtual meeting). Since the idea is good, I believe the author can make it to become a fully feasible proposal in next Fund. Now I rate feasibility with a score of 2.", "q1r": 2, "q2": "I assess the proposal is not auditable because roadmap, milestone, time horizon and Metrics/KPIs that define the success of the proposal are missing.\r\nI recommend the author should add information fulfilling for the missing above: such as how many cities for events in the first month, second month, last month; how many participants attend events at least; how many participants become active CA after events at least,etc. The author should consider how the events' success look like in details clearly for auditing by the community and the challenge team.", "q2r": 1, "assessor": "z_assessor_714", "no_vca": 11, "ne": 3, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The project proposal - Cardano Events in Ukraine 20 Cities is designed to educate people in the Ukraine about Cardano. The project will add value to the Cardano Ecosystem through spreading information and sharing knoweldge about Cardano and aligns with this challenge as it will be delivered in Ukranian language. This will encourage a more diverse spread of participants and community members. The project aims to conduct workshps across 20 cities in the Ukraine so the impact is local there, perhaps with some filming the information can be shared in Ukrainian online for those language speakers that are unable to attend the in person workshops. This is an idea for how it could also scale, which is not necessarily addressed in the application itself, aside from perhaps increased demand for the workshops outside of these initial cities. ", "q0r": 5, "q1": "The proposer has been involved in Cardano and Catalyst for a little while and clearly has a great deal of passion for the project. The success of this will very much rest on their aptitude and interest in seeing the project to fruition. This is also a risk for the project as it depends solely on one person to project manage and deliver. Perhaps there is scope for a larger team for this in the future.  \r\n\r\nThe timeframe for this whole project is 6 months. The budget is quite simple - it might be a good idea to include specifics around transport, accommodation, food, wages, venue hire, marketing costs for future applications - and then breakdown how this averages to $650 per event. ", "q1r": 3, "q2": "There is currently no suggestion as to how the community can audit or indeed contribute to this project, it would be good to see some inclusion of perhaps a youtube video or some form of documentation. \r\n\r\nThere is no evaluation strategy included and there's no real tangible outcomes included aside from of course the successful delivery of the workshops to a certain number of people. \r\n\r\nThere's no dates included in the project timeline so it's unclear how much time would be needed to prepare and project manage the project out of the 6 month time period, how or when marketing would roll out etc. ", "q2r": 2, "assessor": "z_assessor_699", "no_vca": 13, "ne": 4, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement did not likely describe the problem (it is describing a need, instead of a problem).\r\nThe solution is defined (a series of event in 20 cities), and fit the challenge, however, not clear impact on the Cardano ecosystem provided. \r\nTherefore, I am neutral with this proposal's impact (based on the given information) and rate with a score of 3", "q0r": 3, "q1": "Team profile is provided and described enough for understanding with suitable skill, experiences for implementation. There is no evidence provided that shows similar events organized by the proposer. The budget for each event is not provided (only the total budget of each event, without items structure and explanation of calculation base). Risk is not provided.  \r\nTherefore, based on the given information, I am neutral with this proposal's feasibility, and\r\nrate with a score of 3.", "q1r": 3, "q2": "The description of the proposer's information shows that he has a long-term attachment to Catalyst, however, there is no reference/proof (documents/links,...) for verifying verification. Therefore, the author needs to add verification information to ensure clarity and transparency. The budget for each event is not provided (only the total budget of each event, without items structure and explanation of calculation base). The roadmap is provided but abstract (only the name of 20 cities), without KPIs/ Metrics. So, my advice is: The proposer needs to add roadmap + Budget + KPIs + Goal expected at each event to facilitate community monitoring. \r\n\r\nTherefore, based on the given information, I disagree with this proposal's auditability and rate with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 13, "ne": 2, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "\r\nThe problem needing to be solved been identified and articulated namely that Ukrainians are not familiar with Cardano\r\n \r\nIt is not clear that this proposal falls within the scope of the challenge brief  \r\n \r\nThis proposal shows how it may marginally add value to the Cardano system asnBy creating 20 community events all around Ukraine, proposer will engage more people into the Cardano community. Whether or not these meetups will materialise in benefit for Cardano community depends on building this proposal further.\r\n \r\n  Key metrics are not mentioned by proposer. THese include  Number of schools, how many students in clubs, how many tech institutions, how many clubs,  \r\n  \r\n \r\nThe key metrics and goals of the proposal fall within the scope of the challenge.\r\n \r\nProposal can scale to address future challenges by increasing the numbers of cities and meetups. \r\n\r\n\r\nThis project may marginally have a positive impact on Cardano system by increasing the awareness  of Cardano in these cities\r\n\r\nI have given this proposal a 1 star rating because it has very little bearing on creating awareness of Cardano. It may or may not happen and all the funds are being spent primarily on travel and maybe talking to people. \r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.\r\n", "q0r": 1, "q1": "\r\n \r\nThe proposer has  not provided evidence  of himself  which shows that he has experience of Cardano related work.\r\n   \r\nLinks provided are not sufficient.\r\n\r\nHave you the CA visited these links and contacted the relevant people?\r\nTheres nothing to visit.\r\n \r\nI cannot assess if proposer is competent to organize and run this event because he has shown no evidence of having organized similar events or any Cardano related work he has done.  \r\n  \r\n\r\nNo information is given\r\n\r\nHas he rationally and logically laid out his team structure and breakdown?\r\n \r\nHe has provided the team structure of partners  \r\n\r\n \r\n The budget has  been outlined broadly essentially allocated as 650$ for each city.\r\n \r\nThe budget is not  reasonable to achieve the set goals. AS said before , the goals are not strong. Its more of a road tour which may materialize into more awareness of Cardano but no prior experience on events or Cardano related work has been shown\r\n\r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required. \r\n\r\nHave you verified this plan?\r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n\r\n  \r\nThe timetable is realstic to organize the event.\r\n\r\n\r\n \r\nThe proposal  does not  provide  a sensible and conductible plan for implementation. IT only has a broad outline of categories of costs.\r\n\r\n \r\nResources  necessary to implement the proposal are not well described beyond broad cost centres\r\n\r\n  \r\nThe proposal has no technical aspects which have need to be addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\n \r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\nGiven experience and plan presented it is possible this proposal will be implemented successfully hence I have given a 2 star rating. ", "q1r": 2, "q2": "\r\nThere is a no roadmap with milestones beyond listing of twenty cities. There are only broad and ambiguous goals.  how these are to be acheived is not laid out. \r\n \r\n \r\n\r\nThere is a clear understandable description of the targeted problem  \r\n\r\n \r\n  \r\nThe proposer has not identified possible hurdles, challenges and difficulties.\r\n   \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\nThe information provided is not sufficient to audit the progress and the success of the proposal hence i have given a 2 star rating. ", "q2r": 2, "assessor": "z_assessor_460", "no_vca": 18, "ne": 4, "ng": 7, "nfo": 7, "vca_o": 1}, {"q0": " If this is not yet happened before, this proposal will be fully in line with the Community Events campaign. If I may believe the proposer, he also has the experience but no proof has been provided. I see he is a well-known person within the Cardano community.", "q0r": 5, "q1": "I strongly believe that it is possible to organize a large number of events, yet 20 events in 6 months are very hard. Why not fewer events, or give yourself more time than these 6 months?\r\nDid you pick these cities at random or very deliberately? The budget per event is rather low, although the prices in Ukraine may be different from what I'm used to. A detailed budget is also missing, so I don't know how much research you've already done about the costs for that event?", "q1r": 4, "q2": " The roadmap is missing, the budget has been calculated globally, and is missing some details, you can certainly work on this further soon.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "It is a great idea to have a man who will go from town to town and represent Cardano simply wow! The proposal suggests the possibility of a lack of information among the people about Caradano and also offers a great solution. Such a project certainly has a positive effect and gives a certain value to the Cardano ecosystem. Because there are no KPIs, it's hard to compare KPIs with challenge setting. This proposal is not able to scale the future challenges", "q0r": 4, "q1": "It would be good to include in the proposal information on who is behind this idea. Whether a team is needed or this idea can be realized by an individual. The whole idea would give security to the community if they had proof of existence information, some skills via LinkedIn. The budget is reasonable to achieve the set goals and it's outlined clearly but not broken down into identifiable items. It is clear that each event in the city will cost $ 650, but it is not clear what exactly the money will be spent on. No additional funding is required for this proposal and no detailed plan for the implementation of the idea has been presented. Details of actionable tasks are also missing. The proposal specifies a time frame of 6 months in which to hold 20 presentations which is a great idea. However, the question arises of the organization itself, how and in what way the presentations will be held and whether this number of 20 presentations in 6 months is too much. The plan does not describe the resources necessary to implement the proposal and lacks an explanation for the technical aspects and potential risks.", "q1r": 1, "q2": "It will be superb to provide a roadmap with milestones and a time frames for achievement. Also some metrics with which we could define the success of this idea. If every event was filmed with a camera, maybe even the journey from town to town the community could follow this great idea.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 15, "ne": 3, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "\"Organizing 20 events in 20 cities of Ukraine and using Ukrainian and Russian to reach the people who live in those cities is amazing. Because I know the number of people in Ukraine who speak English is not much. Therefore, this proposal can help a large number of non-English speakers in Ukraine to easily access Cardano. Besides, I love offline events in cities like this. It is very easy to connect and interact with the participants to create positive results.\r\nI really like this idea, but the problem is that the proposal still doesn't have specific targets on how many people will participate in Cardano activities such as: number of new proposals, Number of registered wallets, Amount of registered ADA, Number of votes,.... to show how much impact the proposal has had on Cardano and its participants.\"", "q0r": 3, "q1": "\"The proposer has 5 years experience in the blockchain. In Project Catalyst since Fund 1. Currently building Cardano development company. Fund6 winner. But I don't see any information that proves what the proposer put forward is true. I am still doubting the veracity of these related experiences.\r\nProposer has not yet given a specific plan for organizing events in each city. Because an event needs a lot of work to be done, not just a standing speaker can be done.\r\nHow to attract 20-50 participants in that city?\r\nThe preparation and support for an event needs a team to support. It is impossible for the proposer to do all these things alone\r\nWith a budget of $13,000 for 20 events for 20-50 people in 20 cities and a cost per event of $650. The budget per event includes transport costs, the venue rent, accommodation, maybe coffee or drinks for participants, and even ADA and Cardano-tokens giveaways. In my opinion $650 for all of this is not feasible, not to mention these events need marketing to find event attendees.\"", "q1r": 2, "q2": "\"Proposal came up with a budget breakdown With a budget of $13,000 for 20 events for 20-50 people in 20 cities and a cost per event of $650. The budget per event includes transport costs, the venue rent, accommodation, maybe coffee or drinks for participants, and even ADA and Cardano-tokens giveaways.\r\nBut the proposal still doesn't say what the goals of those events are.\r\nHow many people can reach Cardano: number of new proposals, Number of registered wallets, Amount of registered ADA, Number of votes\"", "q2r": 2, "assessor": "z_assessor_645", "no_vca": 18, "ne": 6, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "A problem has been identified by the proposer, and although it aligns with the Challenge settings, that is where the connection is limited to. Other aspects of this proposal is either not explained in detail or is not available at all therefore gauging the effectiveness difficult. There is no clear metric on how this planned community event increases proposal participation, voter education, CA/vCA introduction and how it will increase participation in the community event itself. It seems to hinge on the proposers capability of presentation with no clear syllabus, whether that be the presentation material, method of presenting, method on creating the event, method on marketing the event and if even offline events such as this can be conducted under covid situations. If there were to be proper metrics provided and goals intended to achieve, this Cardano Roadshow on its headline alone has potential and is scalable. Unfortunately in it's current condition it is not effective in increasing metrics intended of this Challenge.", "q0r": 2, "q1": "Unfortunately there is no detailed information on who this proposer is and how is the available relevant experience going to assist the proposer in achieving the goals of touring 20 cities and conducting community events to increase engagement in Cardano. Perhaps having a background of being a motivational speaker, or prominent blockchain guru would help to justify the roadshow proposed. There is also no clear broken down use of the budget, only a general overview of $650 for each city which will be used for transport cost, accommodation, venue rent and so forth. Having no clarity in the use of budget can raise questions such as; Poltava and Kharkiv are only 2 hours apart, 'Would it not be more effective to cover those 2 cities in one day?' Having a detailed budget would clarify all this. Because of those factors alone, it will be very hard to gauge the success of this proposal. Please do look into or collaborate with the Catalyst School.", "q1r": 2, "q2": "With no clear roadmap, milestone or KPI's this proposal and it's intent is very difficult to audit responsibly. Since the timeline of this proposal is 6 months, having a standard defined 0-3 months, 3-6 months progress would have been helpful. The correlation between problem statement and solution can also be improved by describing briefly how this community event will increase participation. I believe by participating or viewing the works of Catalyst School in YouTube will do wonders to increase this proposal's quality.", "q2r": 1, "assessor": "z_assessor_635", "no_vca": 19, "ne": 9, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I have organized various events and know about the importance of setting them up properly content-wise for them to be successful, so I am confident I can determine whether their concepts are set up in a meaningful manner. Since I am also Participating in catalyst since several funds I am competent to determine what kind of community events could be beneficial. The proposal identifies the importance to integrate ukranian communities into the Cardano community, which clearly has the potential to add value to the Cardano ecosystem.\r\nThe key metrics and goals of the proposal unfortunately are only very loosely defined and could give more insight into things like the makeup of the events, the plans to follow-up and to engage/bind people also after the events. Ideally, the proposal will create community hubs, a case in which it will not just be able to scale, but also benefit the Cardano ecosystem and Project Catalyst greatly.", "q0r": 4, "q1": "Since the claims of the proposer are legit, I trust he has the neccessary skills to deliver meaningful community events. The proposer wants to involve other Cardano enthusiasts, which is a good thing. The budget is not perfectly broken down but only to the total costs per trip, the size of the figure however seems reasonable.No plan is provided for the case that additional funding is requested.\r\nThe timeframe of 1 year is realistic for the proposal.\r\nThe implementation plan of the proposal could be more detailed. Feedback: e.G.you could go deeper into what the actual content of the presentations and events will be and how you plan to follow-up and retain interested people.Further requirements or risks have not been defined or discussed. Overall the proposal sounds good and feasible, however the degree to which it will be executed is not very defined, which is why i substract 1 star.", "q1r": 4, "q2": " A roadmap only exists implicitly, as the concept of the proposal isn't tied to the typical 3/6/12-month milestones but to a series of events, which seems okay in this case, as the concept of the proposal does not neccessarily require this to make it auditable. The metrics/KPIs are a bit lacking however in my opinion. Just holding a presentation is not enough to make an auditable metric, but follow-up and bonding strategies also need to be defined in order to effectively adress the challenge. The problem description and solution statement are straightforward and comprehensible.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 17, "ne": 7, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is aligned with the challenge as it creates an opportunity for community members to earn more about the Cardano ecosystem, to get involved with it, and try the use of the ADA token for for those who haven't had an opportunity of doing so.\r\nHost meetups will regroup people around the main topic, which is the Cardano.", "q0r": 5, "q1": "I agree with the excitement of the proposer to have this initiative be roiled out in various cities in Ukraine. This will expose various groups of people to the Cardano ecosystem, and get an  opportunity for some to get involved.\r\nThe six months period of the project may not be enough to have 20 events organized in different cities around the country. Why not reduce the number of cities, focus on those, around 5, spread in various regions of the country. Invite representatives' from nearby cities to participate, and give them the role of Ambassadors (Cardano Ambassadors) in their cities or town.\r\nThe budget of the project is detailed, however the cost of living may differ from city to city, and this can impact of the cost of hosting the event in one city compare to the other.  It would be reasonable to set the cost based on that.\r\nThe proposer has a lot of experience in the blockchain and has been involved in the Cardano catalyst since the fund-1. he speaks the main languages spoken in Ukraine which is an asset when facilitating those events and connecting with new people.\r\n", "q1r": 4, "q2": "I can't assume what the proposer is planning doing to allow the community audit the progress or success of this project. The KPI is not clearly defined, and no any mention about the risks or challenges.\r\nI would prefer to learn more about difficulties that such initiatives may encounter in a country like Ukraine, or in some of its regions or cities/towns.", "q2r": 3, "assessor": "z_assessor_478", "no_vca": 15, "ne": 3, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The idea is a good one in that it has the potential to achieve the goals of the challenge but a lot of details were not captured. there is no plan on how these 20 cities will be covered, what should be expected as success is not clear. Conferencing through 20 cities can bring a great impact. the proposer can repackage it  with all the necessary ingredients.", "q0r": 2, "q1": "the absence of a clear execution plan, the absence of evidence of conferencing activities makes it difficult to believe in the ability to implement successfully", "q1r": 3, "q2": "the absence of a schedule that spells out how the visit/conferences are to be done and what to expect as success will make auditing a bit difficult.", "q2r": 3, "assessor": "z_assessor_733", "no_vca": 13, "ne": 0, "ng": 10, "nfo": 3, "vca_o": 1}], "solution": "Al crear 20 eventos comunitarios en toda Ucrania, cubriré la mayor parte del país y atraeré a más personas a la comunidad de Cardano", "experience": "5 años en el blockchain. En Project Catalyst desde el Fondo1. Actualmente construyendo la empresa de desarrollo de Cardano. Ganador del Fondo6. Viajero"}