{"id": 382265, "author": "matirdaeg", "title": "Cardano Creatives Swarm community", "url": "https://cardano.ideascale.com/a/dtd/382265-48088", "category": 26234, "amount": 6500, "description": "Faltan incentivos y entornos que permitan a los casos de uso de blockchain una interacción directa con las iniciativas culturales y artísticas.", "funded": 1, "upvotes": 34592582, "downvotes": 12441686, "votes_result": 22150896, "votes_cast": 255, "f6_no_assessments": 6, "f6_rating": 4.166666666666667, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=10880"], "media": [], "f6_assessments": [{"q0": "Esta es una propuesta de nicho para ampliar la constelación del Enjambre Catalyst para incluir artistas de todo tipo en la conversación con la parte técnica de Cardano y Catalyst.  La integración de la cultura, la filosofía y las artes ha sido un proceso osmótico dentro de Catalyst hasta la fecha -en un segundo plano, sin cultivar- y esta propuesta busca traer el papel de estas áreas al primer plano con un espacio dedicado y miembros responsables de la comunidad para impulsar la discusión.  Dado que la filosofía y las artes son herramientas para descubrir e impregnar el significado, tiene sentido fomentar que estas herramientas se desarrollen junto con las NFT y los intercambios, guiándose mutuamente de forma cuidadosamente pensada.  Queda por ver hasta qué punto la comunidad está dispuesta a reclamar parte del limitado ancho de banda de la atención necesaria para navegar por los ya vastos espacios de Catalyst (los primeros esfuerzos de los equipos de propuestas indicaban que participaban 30 personas), pero eso podría ser sólo el principio.  Aparte de fomentar el diálogo sobre el papel de los creativos en el ecosistema de Cardano, esta propuesta no es muy específica sobre cuál podría ser el resultado de esta campaña.  Sugiere quizás talleres de arte o exposiciones, pero no aclara realmente cómo eso hace crecer a Catalyst o a Cardano.", "q0r": 5, "q1": "Este equipo de propuestas parece haber estado ya implementando una versión base de esta idea, una sesión de enjambre bajo el formato de Catalyst Swarm, de la que extrajeron las ideas para esta propuesta, junto con canales de comunicación en discord y telegram, por lo que es de esperar que puedan repetir la hazaña según sea necesario para seguir entregando el producto.  Aunque no se indica explícitamente, la hoja de ruta (sesiones de enjambre creativo, ideación dirigida a establecer preguntas y objetivos creativos fundamentales para Cardano, y preparación de los nuevos miembros para los procesos de Catalyst y de propuestas) parece conducir a la creación de un equipo de desafío de Fund8 basado en los creativos.  Para ello, la hoja de ruta enumera objetivos concretos como el establecimiento de sesiones de enjambre fiables durante 3 meses, al tiempo que mantiene y presenta sus canales de medios dentro de Catalyst.  Aunque el calendario de la hoja de ruta es algo vago, los hitos son específicos y realizables.  La capacidad de apoyarse en los equipos y protocolos existentes de Swarm da a esta propuesta una alta probabilidad de éxito.  El presupuesto es razonable y, para los 3-5 meses de cobertura previstos, debería permitir disponer de los recursos adecuados.", "q1r": 5, "q2": "La creación de reuniones públicas permite una gran auditabilidad, y los canales de comunicación propuestos deberían permitir a la comunidad mantenerse en contacto con el proyecto a medida que se desarrolla.  El sitio web/blog propuesto no estará disponible de inmediato, pero una vez que esté en línea proporcionará otra vía para ver si el proyecto sigue en marcha.  Por último, esperan contribuir al menos mensualmente en los Ayuntamientos.  La medición de los objetivos, sin embargo, parece limitarse al seguimiento del número de participantes en el grupo y quizás al número de \"subgrupos\" dedicados que la colaboración pueda generar.  Otra métrica que deberían considerar, especialmente si creen que podrían patrocinar un equipo de desafío en el Fondo8, sería un número de configuraciones de desafío muy específicas que se curarían durante los primeros meses y reuniones.  Un ejemplo podría ser un concepto como el de \"valor\", que tiene profundas raíces en la filosofía y el arte, y dedicar las sesiones del enjambre a rumiar cómo crear un entorno de desafío detallado y concreto en torno a él.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 16, "ne": 12, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "This will be a beautiful inclusion to the Cardano ecosystem. For I see this as an embryo towards the creation of Cardano art community, which is very important, the reason being will come later. General public might dismiss art due to the over-saturation of NFT projects which by it's nature to some extent is being exploited by individuals or entities, whether that be giving value to NFT through hype or market manipulation. Both practices has occurred in major NFT marketplaces and NFT issued by brands or influencers. Art's value is slowly being redefined by this practice and by the misconception of associating the current NFT with art. When there is a strong community of artists, curators, collectors, historians and educators talking to each other from around the world discussing blockchain and it's interaction with art in one forum, only then can NFT have value that is rooted in history, in art education, in techniques, in differentiation and not in hype. NFT is here to stay but NFT will evolve. Although this proposal articulates well it's intent, it's effectiveness in growing Cardano through the metrics of the Challenge setting, is a visionary sell. Meaning, only those who have the knowledge, understands the value of this proposal.", "q0r": 5, "q1": "The team involved and whom are in the proposal, on the basis of what is stated, correlates well the intent, knowledge and the implementation plan inside this proposal. There is also a mentioning of a co-proposer, though details regarding their background is limited. I can only wish there were links to the proposers but to a certain extent I can understand the nature of individuals from the art field. This though is counter-balanced by their timetable which is very detailed and also the intent to collaborate with Catalyst Swarm, a reputable community within Cardano. Proposer has also considered the challenge and risk they will face, which although is an obligation, not many take effort into explaining them such as what the proposer has done. This must be valued as upholding the standards of a good proposal. The small budget provided is also sufficient in comparison to the timeline determined and goals to be achieved.", "q1r": 4, "q2": "Again there is a detailed roadmap, although not attached with numerical targets, situations correlating with art is valued not by numbers but by the quality of engagement. Which in the beginning can be limited interactions in the grand scheme of things. Provided also are OKR's and KPI's that fits well with how developing a creative environment can be. Problem statement also correlates well with the solution provided.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 17, "ne": 8, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "This proposal focuses on exploring and establishing an environment of social and cultural inclusion to support, facilitate and generate culture and art movements. This is a great and attractive idea. The problem is clearly explained in detail. The solution is clearly defined, shows the clear potential impact on the ecosystem in long term. Therefore, based on the given information, I strongly agree that this proposal effectively addresses the challenge, I can rate it with a score of 5", "q0r": 5, "q1": "Team profile is provided and described enough for understanding, skill, experience is suitable for implementation, but without reference/proof (documents/links,...) for verifying. The roadmap is clear but without KPIs/metrics are not measurable. Budget explanations of calculation base are not provided. Risk is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lot of information provided, but for better understanding, my advice is: (1) Budget explanation for each item should be provided; (2) KPIs should be specific and quantitative; (3) Risk should be analyzed. Based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is a good idea. However, it's difficult to understand the problem statement, it appears to have a grammatical challenge though the idea of the problem statement with proper scrutiny can be ascertained just that time will have to be spent to better understand it. However, the goal of the proposal fits into the challenge settings and hence if implemented will be of benefit to Cardano.", "q0r": 4, "q1": "I believe that the proposer has skills for the implementation just that it would have been more appropriate to add links and references. The proposal is a one man team.\r\nThe budget is well presented.\r\nThe proposer has also outlined the possible challenges involved in the implementation of the proposal.", "q1r": 4, "q2": "The proposer has provided a comprehensible step-by-step plan, milestones and time horizon for implementation of the proposal. The proposer has also stated the metrics/KPIs for the success of the proposal.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The proposal addressees the challenge brief and requirements. The proposal speaks in clear terms how they intend to provide a desired solution to their current problem by organizing events which is able to add more value to the ecosystem by onboarding  individuals into Catalyst etc. Good job by the proposer", "q0r": 4, "q1": "The proposer from my assessment of the proposal has the required knowledge set to carry out the project. But the proposer failed to add links and details of his team members who will help him execute the project should the be funded. the budget is reasonable to carry out the project but not so elaborative enough that is being broken down into smaller activities.", "q1r": 3, "q2": "The proposer has included a roadmap to guide in the project execution. The proposer has also stated the metric/KPI's which is  key to tracking success and progress of the project when funded.", "q2r": 4, "assessor": "z_assessor_799", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "This is a great project and should be supported overwhelmingly. \r\nIt aims to create a platform where active participation and collaborations in the project catalyst can be given a broader perspective of onboarding potential new members from other spheres of human endeavors.\r\n Creating awareness and sense of belongings to other members that may not be technical in their affiliations and providing solutions to their needs and aspirations in the community, could be of immense benefits to the goals and set objectives of the campaign.", "q0r": 5, "q1": "The team seems to well qualified  and the plans to collaborate with the catalyst swarm and leverage on their format and experience is very helpful. The project has also provided a detailed budget plans and roadmaps couple with its risk factors consideration, am of the opinion will be successfully implemented.", "q1r": 5, "q2": "I think that the metrics provided at this stage of the proposal is effective enough. Considering the detailed roadmaps and/or milestones provided and with the plans to make their activities easily accessible by the community, the project can be fairly assess for its progress and success of the project.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "Explorar y establecer un entorno de inclusión social y cultural para apoyar, facilitar y generar movimientos culturales y artísticos.", "experience": "Estudios de arquitectura, construcción ecológica, artesanía, historia del arte y sociología. Consultor y asesor psicológico y pedagógico."}