{"id": 382330, "author": "swhitenstall", "title": "Catalyst Swarm 2022 GitBook", "url": "https://cardano.ideascale.com/a/dtd/382330-48088", "category": 26234, "amount": 4350, "description": "La documentación del Proyecto Catalizador requiere apoyo para ser sostenible.", "funded": 2, "upvotes": 124217289, "downvotes": 2056258, "votes_result": 122161031, "votes_cast": 592, "f6_no_assessments": 7, "f6_rating": 4.761904761904762, "videos": [], "media": [], "f6_assessments": [{"q0": "Como miembro activo de la comunidad Catalyst, con participación regular en eventos y también como organizador de eventos y constructor de la comunidad, creo que esta propuesta aborda efectivamente el objetivo del Reto, especialmente ayudando a aumentar la participación y la incorporación de nuevos miembros, promoviendo el propósito y documentando los eventos y reuniones que la comunidad Catalyst Swarm está teniendo. Además, las comunicaciones claras y bien documentadas ayudan a la gente a entender lo que está pasando y a definir cómo y dónde quieren participar.\r\nUn área de mejora, sin embargo, podría ser la creación de un gitbook de la comunidad de Catalyst ENTRADA, que puede hacer referencia a las diferentes comunidades y grupos, lo que permite a los nuevos grupos a presentar su voluntad de ser añadido, co-creando una especie de índice de Comunidades y sus eventos y noticias (pero que podría ser una propuesta separada como un paraguas para esto y otros que requieren de la misma)", "q0r": 5, "q1": "He visto el trabajo previo que QA-DAO está haciendo y puedo certificar que Stephen es un miembro bien conocido y activo de la comunidad de Catalyst involucrado en muchos proyectos, Vanessa parece también muy activa con la creación de varios proyectos similares, como la supervisión del Círculo Catalyst. Así que creo que son bastante capaces de impulsar este proyecto y cumplir sus promesas.\r\nEl calendario del proyecto es adecuado y creo que cubre la capacidad necesaria para los objetivos declarados, también han identificado objetivos a corto, medio y largo plazo.\r\nEl equipo y el esfuerzo están bien identificados y se ajustan al presupuesto solicitado. También se han identificado los riesgos y sus mitigaciones.\r\nPara el valor que aportará este proyecto, creo que la cantidad de financiación solicitada está en consonancia con el apoyo de la comunidad.", "q1r": 5, "q2": "El calendario proporcionado está bien detallado y tiene resultados generales especificados para cada hito, los KPIs proporcionados están alineados con los de los Objetivos del Reto. Sin embargo, para que los resultados y los KPIs puedan ser auditados correctamente, se deberían haber proporcionado algunos objetivos de medición específicos cuantificados (por ejemplo, 6 sesiones de Swarm documentadas en el gitbook - 2 por mes). Como las actividades de Swarm se comunican públicamente y son atendidas por muchas personas de la comunidad, creo que el proyecto puede ser seguido y rastreado para entender que ofrece el valor comprometido, pero habría sido mejor tener esos números (esa es la razón del 4)\r\n", "q2r": 4, "assessor": "z_assessor_288", "no_vca": 21, "ne": 14, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "El conocimiento del estado del Proyecto Catalyst (es decir, qué pasó, cuándo pasó, qué está pasando ahora y dónde) puede ser uno de los problemas más frustrantes que tiene un recién llegado (¡e incluso un veterano establecido!) cuando se sumerge en este ecosistema.  Registros como el Catalyst Circle de QA-DAO y el gitbook de Genesis representan un nivel básico de conocimiento del estado que es fácil de referenciar y distribuir, y el apoyo a este tipo de esfuerzos garantiza que estarán disponibles a medida que la comunidad experimenta un crecimiento exponencial, y la confusión que puede venir con él.  La financiación por parte de la comunidad de QA-DAO Swarm 2022 es un paso clave para la sostenibilidad de esta base de conocimientos y podría ser un excelente ejemplo de aprovechamiento de la financiación de Catalyst si adquiere el estatus de autofinanciación, en un futuro próximo.", "q0r": 5, "q1": "Este equipo ya ha sido financiado en el Fondo5 y en el Fondo6, incluso para propuestas similares, y el Gitbook que está detrás de la propuesta actual (Swarm) ya tiene un modelo precursor que ampliar.  El presupuesto establece tanto una asignación de recursos como una carga de trabajo y unos plazos razonables para el mantenimiento del centro de información.  El factor más importante de los proyectos de esta naturaleza es si el desarrollo de un recurso comunitario de este tipo llega alguna vez a su público objetivo.  Este equipo ha trazado una hoja de ruta con los correspondientes indicadores clave de rendimiento (KPI) que les da una buena oportunidad de difundir con éxito este producto entre la comunidad.  La exposición interna de la Comunidad Catalyst (discord, telegram, townhalls, etc.) está pensada, dirigida a la adopción de nivel medio, como los anfitriones de la sala de reuniones, y la exposición más amplia en Twitter, reddit, etc., aunque ciertamente podría hablar a la Comunidad Catalyst, probablemente servirá un doble propósito de insinuar el alto nivel de auditabilidad y responsabilidad de la Gobernanza del Proyecto Catalyst a los usuarios o potenciales adoptantes de Cardano.  Si hay algún problema aquí, puede ser simplemente que habrá tanta demanda de esta información, y tantas cosas que ocurren que necesitan ser registradas, que esta pequeña propuesta podría verse abrumada y tener que reducir su área de destino.", "q1r": 5, "q2": "Los proyectos anteriores de este equipo han mantenido un alto nivel de responsabilidad ante la comunidad y, de hecho, han representado ellos mismos ese alto nivel.  Se trata de un pensamiento de meta-auditoría, en el que están proporcionando las herramientas para auditar con éxito a la comunidad en general.  Para ello, los Gitbooks son públicos, y han declarado claramente sus intenciones en cuanto a lo que tratarán de rastrear.  Debería ser fácil para los usuarios interesados seguir la pista e incluso sugerir cambios in situ.  Los KPI enumerados proporcionan puntos de control naturales (umbrales de adición, umbrales de visualización de páginas) y medidas incrementales que deberían mantener el proyecto en marcha.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": " \r\nThe problem needing to be solved has been identified and articulated namely Documentation of Project Catalyst requires support to be sustainable as otherwise documentation wont get done.\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief by providing resources to do the documentation & tracking of Project Catalyst and thereafter ommunicate the content of the Catalyst 2022 GitBook to the community.\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating such a document. \r\n  Key metrics  would be  number of downloads,  number of page views, number of users of the book   \r\nThe key metrics and goals of the proposal fall within the scope of the challenge \r\nProposal can be scaled up to address future challenges by adding more content to the document. Maybe variations for different use cases and regions. Maybe localizing into local languages\r\n\r\nThis project will have a positive impact on Cardano system by increasing the collaboration between community members to build this book, and localize it into different languages.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.\r\n I am also a writer and publisher of English and Local language books\r\n", "q0r": 5, "q1": " \r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  hosting Town Hall and After Town Hall events as well as managing the documentation process for these events.\r\n\r\n The links are sufficient. \r\n \r\nI have visited these links and contacted the relevant people\r\n  \r\n \r\nThe proposers are well experienced and competent to do the event.\r\n \r\n The type and number of team members required to implement the proposal is stated. \r\nThe team structure is listed and experienced.\r\n The budget has   been given in detail. \r\nThe budget is  reasonable to achieve the set goals.\r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\nTheres a realistic timetable  to complete the work\r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are described.   \r\n \r\nThe proposal has technical aspects which have been addressed \r\n\r\nThe proposer has  identified risks in this namely that he would not be able to continue in this capacity , the solution is its migrating to QA DAO.\r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   ", "q1r": 5, "q2": " \r\nThere is a clearly laid out roadmap with milestones  \r\n \r\n There are  Metrics such of number of participants a and number of presentations and discussion rooms. \r\n   \r\nThe problem has been clearly understood and solution has been given in much detail. \r\n    The proposer has not identified possible hurdles, challenges and difficulties other than what would happen if he werent able to do this in future. He has a solution for that which is creditable \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 17, "ne": 5, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "I agree that it is important to keep track and archive information flow, yet it is not in a perfect accordance with the challenge goal - to increase community participation, rather than keep the community alive :)\r\n\r\nOverall a good proposal, rating given 4.", "q0r": 4, "q1": "The relevant experience is stated, with a detailed roadmap and team members are a well-known community members.\r\n\r\nI am very convinced that they can implement the proposal to the successful end. \r\n\r\nRating given 5.", "q1r": 5, "q2": "A detailed KPIs are provided which I find to be sufficient to audit the progress and the final product. \r\n\r\nI also like a risk mitigation approach, which increases the overall feeling of the proposal.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "This proposal to the untrained eye might seem out of place in regards to this Challenge which is called Community Events. Please take note though, the core development of any business, any organization and event organization is data. When you do not have a database, you can not leverage that database for support in terms of finance, in terms of onboarding quality collaborators, in terms of sending signals of the events credibility to the larger community etc.. Simple example; if an event that has been ongoing for 3 months can not provide data of their participants growth, the chance of that event's capability to find further funding would be very challenging. This documentation system that is currently being developed will help community event organizers throughout the Cardano community to have  a universal database input system that can be easily tracked and is 100% transparent. The output of this proposal is what addresses this Challenge effectively. How things are made clearly structured can be viewed through the various links provided by the proposer, shows factually how beneficial this database system is. It is easily scalable and can be applied to any form of meetings, Zoom meetings, discussions etc.", "q0r": 5, "q1": "Through the experience stated and various links provided, it is clear the proposers are high performing individuals. Most specifically one of these proposers are also stellar examples of an individual who contributed their skill continuously for the development of both, the Project Catalyst ecosystem and Project Catalyst itself by supporting the meticulous documentation of Catalyst Circle. Budget wise, it is clearly stated with an adjoining action plan, though  the numbers requested are very low. In comparison to the services provided the amount is unreasonable. A continuing trend in Project Catalyst that is borderline unhealthy. Timetable correlates well with the type and amount of work. Above all, this proposal has taken account the risk and challenge they might face and have even formulate mitigation steps. Kudos to the proposer for a great job in writing up this proposal!", "q1r": 5, "q2": "Roadmaps are clear, with a detailed adjoining action plan and milestones with clear dates. Although there are also numerous KPI's, unfortunately they will be challenging to audit for there are no numerical targets. Problem statement and solution have been well thought of and are interconnected with one another. A byproduct of this interconnection is this amazing proposal. Again, great job!", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 20, "ne": 9, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "As the aim of this challenge is to fund maintenance of the Catalyst-Swarm-2022 GitBook, this proposal fits into the challenge settings and undoubtedly Cardano will benefit.", "q0r": 4, "q1": "I believe the team possess the skills and experience to achieve the proposal. I can see links provided and that for me is good.\r\nTo add, the is well presented and reasonable for the achievement of the proposal.\r\nThe proposer has provided a detailed and comprehensive plan for execution and that for me is very key for the successful implementation of any proposal. It's good that the proposer has outlined the possible risks involved in the implementation of the proposal.\r\nThe proposer has also given clear understanding to some technical terms used in the proposal like sustainability, maintenance etc", "q1r": 4, "q2": "The proposer has provided a roadmap and detailed time horizon for the achievement of the proposal. The metrics/KPIs that define the success of the proposal are captured. The targeted problem and it' is clear and well understood.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "Documentation, tracking and publicizing of Catalyst activities and events are vital and value adding initiatives that needs to be supported. This will provide new proposers access to existing proposal and events that will beneficial to them.", "q0r": 5, "q1": "The team behind this project are individuals with long standing experience in the cardano community, undertaking this project on a smaller scale prior to asking for funding shows their readiness to execute this project. Also, there are well outlined events scheduled within specific timeline for the project and a work breakdown structure is also incorporated within the proposal. The events scheduled for the proposal will definitely not only serve as a source of history for cardano activities, but it will also serve as a source of knowledge base on how to organize events and how to develop proposals. Additional, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake. Therefore, based on the proper budgetary allocation provided, it will be very easy implementing the project successfully when funds are provided.\r\n", "q1r": 5, "q2": "To project provides a metric to monitor and track the progress and success of the project; for instance, the project has a system for knowing page views (measured by Google Analytics); growth of page views during project, accessing comments, views and interactions on social media and a system to let new catalyst members become aware of the Gitbook (measured e.g. by occasional Zoom polls at Swarm breakout rooms to ask if new attendees are aware of it)\r\n\r\n", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 16, "ne": 5, "ng": 9, "nfo": 2, "vca_o": 1}], "solution": "Recurrir a la documentación y el seguimiento del Proyecto Catalyst.  Comunicar a la comunidad el contenido del GitBook de Catalyst 2022.", "experience": "QA-DAO cuenta con una experiencia combinada de 50 años en el apoyo, la documentación, la auditoría y la participación de comunidades independientes como Catalyst."}