{"id": 382677, "author": "favourse.com", "title": "Co-Creating Events Together", "url": "https://cardano.ideascale.com/a/dtd/382677-48088", "category": 26234, "amount": 12000, "description": "No hay una manera fácil para que la comunidad de Cardano/Catalyst y la gente nueva se conecten entre sí, sugieran y voten por los eventos a ser co-creados", "funded": 1, "upvotes": 48048679, "downvotes": 10864805, "votes_result": 37183874, "votes_cast": 290, "f6_no_assessments": 9, "f6_rating": 4.481481481481482, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=17154"], "media": [], "f6_assessments": [{"q0": "La idea encaja bien con los objetivos del reto, porque busca crear una plataforma online en la que los diferentes miembros de la comunidad Cardano (dicen que se centran en los interesados) y también la gente nueva en la comunidad puedan sugerir, dialogar y montar eventos de forma sencilla. Creo que esto es interesante porque, de hecho, no hay ningún lugar donde se puedan hacer estas organizaciones. Pero tengo algunas observaciones que hacer; en primer lugar, ya existen muchas herramientas, como Miro y Jamboard, en las que diferentes personas pueden trabajar en línea y mostrar la información de forma visual e intuitiva. Sería interesante que los autores argumentaran por qué la plataforma que tienen es diferente y mejor. Se sabe que el sitio ya existe, y es muy bonito por cierto; los autores dicen que algunos eventos fuera de la comunidad (¿cuáles?) ya se han desarrollado a través de la plataforma. Sería beneficioso que se ejemplificaran algunos de estos eventos, que se aclarara más porque Favorse es más práctico, fácil y superior que otras herramientas preexistentes, que se pudieran hacer videollamadas en este sitio, adjuntar libros blancos, montajes visuales, etc. La otra cuestión que he pensado es que en el transcurso de la propuesta pretenden llegar a un nivel de desarrollo en el que los propios usuarios del sitio podrían votar los proyectos, invertir en ellos, etc.; esto me preocupa un poco porque podría confundirse ligeramente con las actividades propias de Catalyst. No sé si sería necesariamente un punto negativo, pero estamos trabajando para mejorar Catalyst, no creo que externalizar actividades a otra plataforma sea la mejor manera de unir a la comunidad y producir proyectos con impacto. Pero es sólo mi opinión, en general, la idea sí dialoga con lo que se pide en este reto.", "q0r": 3, "q1": "Los autores tienen mucha información sobre ellos mismos a través de un desglose individualizado de cada uno, seguido también de enlaces a sus perfiles en las redes sociales. Además, se puede ver esto si vamos a la página web proporcionada, hay una parte que presenta al equipo, con foto, nombre, función y perfiles de linkedin. Por lo tanto, no estamos indefensos en este aspecto. Creo que están bien preparados, de acuerdo con la información proporcionada en el sitio e incluso porque el sitio en sí está bien hecho, tiene una interfaz fácil de navegar y estéticamente hermosa. Sobre el guión, incluyen una explicación para los primeros seis meses para que sepamos exactamente qué actividades se llevarán a cabo cada mes, quién hará qué y qué se espera que resulte en ese tiempo. En esta parte creo que se nos proporciona suficiente información para tener una visión sólida de lo que ocurriría en la práctica del proyecto. Y sobre la división financiera, también nos dan un desglose satisfactorio, donde sabemos quién se llevaría cuánto y por qué, aunque creo que se podría explicar más cada tema de trabajo. Por ejemplo, ¿cómo sería la creación del diseño? ¿Trabajaría investigando directamente con el público, montaría la interfaz según proyectos anteriores que tuvieron éxito? Algo que noté fue la ausencia de una parte monetaria para el marketing, me gustaría entender cómo promocionarían este proyecto, porque si el objetivo es crear un espacio colaborativo para que trabajen miembros de la comunidad y personas ajenas a ella, ¿cómo sabrían estas personas de la existencia de la plataforma? Esto es tan importante como el desarrollo del producto en sí, en mi opinión.", "q1r": 4, "q2": "Los autores proporcionan varios temas que podrían ser analizados para ejercer una buena auditabilidad, como el número y la diversidad de participantes en la plataforma. Sería importante tener estos datos organizados y demostrados al resto de la comunidad de Cardano, para verificar si el proyecto fue realmente exitoso. Otro punto podría ser que algunas personas participasen en estas reuniones colectivas, con el objetivo de analizar su funcionamiento, y también para que se compruebe si los eventos allí planificados se pusieron realmente en práctica. Creo que es un proyecto muy posible de controlar, tanto por el seguimiento del propio sitio como de los eventos creados (¿se organizan, tienen un alcance legal, etc.?). Para mí este tema está bien hecho en la propuesta, aunque los autores nos dan una información menos extensa y detallada sobre las posibles formas de seguimiento del proyecto.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "El equipo del proyecto detrás de Favourouse propone crear una herramienta web para fomentar la co-creación de eventos que proporcionará a los creadores información útil sobre los clientes o potenciales clientes en las etapas iniciales de la formación de la idea. Una aplicación como Favourouse añadirá valor al ecosistema de Cardano abriendo oportunidades a la retroalimentación de una audiencia más amplia y proporcionando la participación de personas fuera de la comunidad de Cardano en las etapas iniciales de la formación de una idea, así como el potencial para que la gente financie o busque financiación de las partes interesadas.\r\n\r\nUna aplicación como esta tiene el potencial de superar rápidamente a las plataformas de crowdfunding más antiguas, como Pozible, simplemente a través del marco de tener la formación de ideas y la prueba de ideas y la co-creación como base para que la plataforma exista. Han proporcionado un prototipo dentro de la solicitud de financiación y han incluido una gran cantidad de información sobre cómo ven los usos de la plataforma.\r\n\r\nEste tipo de plataforma podría fomentar la colaboración global y proporcionar indicadores para que las nuevas ideas, eventos o emprendimientos encuentren audiencias más allá de su alcance actual. El diseño del indicador de opiniones es tal que es posible ver la ubicación de las personas que proporcionan opiniones, por lo que los usuarios pueden ver dónde podrían estar sus mercados potenciales o incluso descubrir colaboradores y personas con las que trabajar.", "q0r": 5, "q1": "El equipo que está detrás de este proyecto ha demostrado claramente sus habilidades y ha proporcionado una gran transparencia en torno a sus habilidades y experiencia. Algunos son jóvenes, pero aún así están bastante consolidados y tienen experiencia. Dado que el equipo incluye gestores de proyectos, desarrolladores, diseñadores y profesionales del marketing, el conjunto de habilidades necesarias para la ejecución de este proyecto es adecuado.\r\n\r\n\r\nEl presupuesto solicitado es modesto y está claramente desglosado. El calendario y la hoja de ruta son claros, con hitos mes a mes claramente articulados.", "q1r": 5, "q2": "La comunidad puede tener dificultades para ver el progreso del proyecto, ya que gran parte de los seis meses se dedica a desarrollar la plataforma Favourouse. Esto se ve mitigado únicamente por el hecho de que este sitio será, por supuesto, accesible para la comunidad, que podrá estar atenta a las actualizaciones.\r\n\r\n\r\nEl conjunto de KPI se basa en el éxito de la entrega de la versión completa, que requeriría un presupuesto para el marketing además de los fondos que se buscan para el desarrollo. Me parece que estos KPI están más vinculados a la fase secundaria de este proyecto y no a esta fase de desarrollo y prueba. Sería ventajoso ver un enfoque similar para la co-creación de esta plataforma como el que está siendo propuesto por su plataforma, donde múltiples grupos de usuarios podrían ser identificados y como resultado abordados para una mayor contribución en el desarrollo de la plataforma.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 16, "ne": 10, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "An element of this challenge is about meaningful and active participation in events. This proposal perfectly meets this objective through developing events from idea to implementation by the community.\r\nThe proposal is extremely well presented and simple to understand. Voters should take a look at the short video and the demo (for a deeper dive read the white paper). Having many year of experience of setting up events (mainly through eventbrite) without actually knowing if the demand or participation will be there it is refreshing to see this proposal. The one piece for the proposer to address is around how to ensure the platform and the funding is used to focus on Cardano/Catalyst events. They should address this in the comments and in any further presentations they make (eg at ideafest) ", "q0r": 5, "q1": "Based on the funding requested and scope of work for the 1st 6 months it is highly likely that this proposal will be successful. A prototype is already in place, a team is engaged and active and covers both technical and non technical skillsets. The deliverables are not overly ambitious or complicated. \r\nThe proposal also builds in a feedback loop to help develop their roadmap, so i suspect we will see this team return for further funding in a later fund.", "q1r": 5, "q2": "The KPI and milestone are simple and clear. However i would like to have seen the key metrics defined as Catalyst/Cardano specific, at the moment they are quite generic.  ", "q2r": 4, "assessor": "z_assessor_45", "no_vca": 16, "ne": 5, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely there is no easy way for the Cardano/Catalyst-community & new people to connect to each other, suggest & vote for events to be co-created\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief by creating a platform that allows anyone to easily create ideas for events, vote for, get feedback and co-create events together\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating a platform.\r\n\r\n \r\n  Key metrics  would be  number of events, number of participants, number of new proposers  , number of voters, no of students. \r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n   \r\nProposal can be scaled up to address future challenges by adding more ideas for events which can be voted on.  \r\n\r\n \r\nThis project will have a positive impact on Cardano system by increasing the collaboration between community members to build this platform and develop ideas for events. \r\n\r\n\r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 4 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.", "q0r": 4, "q1": " \r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  various blockchain related projects. \r\n  \r\n The links are sufficient.  \r\nI have visited these links and contacted the relevant people\r\n   \r\nThe proposers are well experienced and competent to do the event.\r\n \r\n The type and number of team members required to implement the proposal is stated.\r\n \r\n \r\nThe team structure is listed and experienced.\r\n  \r\n The budget has   been given in detail. \r\n \r\nThe budget is  reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\n \r\nTheres a realistic timetable  to complete the work \r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\n\r\nResources  necessary to implement the proposal are described.    \r\n\r\nThe proposal has technical aspects which have been addressed \r\n\r\nThe proposer has  not identified risks in this proposal\r\n \r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\n\r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 4 star rating.   ", "q1r": 4, "q2": " \r\nThere is a clearly laid out roadmap with milestones  \r\n \r\n There are  Metrics such of number of participants a and number of presentations and discussion rooms, number of courses, no of schools, no of universities, no of graduates, no of proposals.\r\n \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n\r\n The proposer has not identified possible hurdles, challenges and difficulties other than what would happen if he werent able to do this in future. He has a solution for that which is creditable\r\n  \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 15, "ne": 4, "ng": 5, "nfo": 6, "vca_o": 1}, {"q0": "A very interesting proposal that somewhat resembles a gig economy where demand and supply of a certain expertise is created organically. This creates a healthy situation where the demander pays an agreed amount to the supplier of an expertise and the interest can truly be measured for it is pre-determined. Which can also act as an indicator to sponsors/voters (brands, CSR programs, Project Catalyst etc.) that this event is worth funding, for the engagement metrics are more measurable. And because of this feature, it fits well into almost all the metrics of the Challenge setting. Taking another example besides voter-proposer participation, such as keeping the community  together. Because individuals can request an event to happen, where they also offer compensation to be agreed upon, sustainability and relation building between parties involved is therefore achieved. A healthy dynamic between demand and supply is created. Though the problem statement this proposer puts up, does not do justice to what the proposer has created. There is more to this proposal than stated which unfortunately will not be conveyed well in the voter app. If not funded, please do come back and take more into consideration the voter app structure.", "q0r": 4, "q1": "This proposal develops on what the proposer has already created and is already operational. What differs or added on to is their effort to also onboard and educate on Cardano while at the same time integrating their workflow with Project Catalyst funding in collaboration with the Cardano community. The budget provided although detailed it took time to correlate that this budget is for 6 months. If it were clearly stated it was for 6 months, in comparison to the total funding requested, this proposal could be categorized as low risk and high impact. The implementation plan is also clear. Unfortunately, what has not been calculated is the potential risk and challenge this proposal might face, which most likely be marketing to and educating of the community. This though is in-directly answered by the allocation of individuals and budget for marketing and educating. By taking all above consideration, this proposal is very likely to be successful.", "q1r": 5, "q2": "The roadmap is clear, an added information of who are the individuals that will take action during certain phases of the roadmap also helps with auditability. KPI's are easily measurable, something that is very rare. Though there are no milestones provided. Together with a problem statement that could be improved upon, although it interconnects well with solution,  these shortcomings are the reason this proposal in this section receives a 4-star rating.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 19, "ne": 7, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is great, I can see the idea. The problem is clear and suitable to the given challenge.\r\nThe solution is clearly defined, fits the challenge, with clear detail of: roadmap (with KPIs), team's ability,...; this gives a clear impact on the Cardano ecosystem in short term and long term. \r\nTherefore, I strongly agree with this proposal's impact, and can rate it with a score of 5.", "q0r": 5, "q1": "Description of team's profile, current works of the team shows suitable skill, experiences for successfully implementing this proposal. The budget is provided with structure and explanations of the calculation base. However, potential risks/ challenges are not defined. Therefore, based on the given information I,  agree with this proposal's feasibility, and  I would rate it with a score of 4. If the risks (and mitigation) are defined, I would strongly agree and give 5 points.", "q1r": 4, "q2": "There is a lot of information provided. Team profile is clearly described with resources/proof (documents/links,...) for verification. Total is presented in detail (with clear structure and explanation of calculation base). Besides, the roadmap is clearly described with KPI/ metrics (100 % of that is measurable)\r\nTherefore, I strongly agree with this proposal's auditability, and I can rate it with a score of 5.", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The idea is great and would be helpful for event organizers. However, with the creation of the platform, I think the proposal should have been in a different challenge other than Community Events.", "q0r": 4, "q1": "The team has individuals with great developer experiences. The proposal details plans and having created the prototype already, I believe the project would be a success considering the KPI are specific and measurable. ", "q1r": 5, "q2": "The proposal has factored in transparency and documented process, this proposal can be tracked for easy auditing.", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Creating a platform to assemble community members to connect with each other, develop ideas for events, solve problems together and initiate collaboration is a great way of adding value to the cardano ecosystem. Ideally this will also increase the community engagement.", "q0r": 5, "q1": "The proposal has experienced personnel and also has a work breakdown structure designed from the start to the end of the proposal. Also, the target audience is well indicated and there is a well-developed timeline for the proposal. Aside that, there are well outlined events scheduled within specific timeline for the project. Finally, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake.", "q1r": 4, "q2": "The project provides a metric to monitor and track the progress and success of the project. For instance, the project has an outlined number of people it expects to participate in community organized events, targeted number of participants/users on online platform and the number of idea-events created.", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 16, "ne": 4, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The Proposal is about creating a platform where community members can put forward an idea for something, and then have others support, vote for or get feedback on the idea. It could be a great platform, and does support the Challenge brief. The Key metrics directly addresses that of the challenge, like increasing participants in community events, and the number of community events. ", "q0r": 5, "q1": "The Team presented has impressive experience and skill sets, links are provided to their LinkedIn accounts. The proposal sets out what each team members' part will be in the project. The budget is set out and stretches over a 6 month period in which they want to have the platform ready, and being tested. Each Team member has his part to play in this proposal and it is set out also in the budget. Risks are not specifically addressed in this proposal. ", "q1r": 4, "q2": "Key Metrics are listed and includes participation in community events, number of people that participated in community organized events, number of participants/users on platform etc, and they all have target numbers next to them. This could be used to track the success of the project. As soon as the platform is working it will be easy for the community to track the progress and success. I am not sure how will the community be able to track the progress until then, as this is not mentioned.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 14, "ne": 2, "ng": 12, "nfo": 0, "vca_o": 1}], "solution": "Una plataforma que permite a cualquier persona crear fácilmente ideas para eventos, votar, recibir comentarios y co-crear eventos juntos", "experience": "El equipo tiene una gran experiencia en la organización y facilitación de eventos comunitarios, gestión de proyectos, creación de contenidos y marketing"}