{"id": 384076, "author": "cardano4climate", "title": "Cardano4Climate Community Events", "url": "https://cardano.ideascale.com/a/dtd/384076-48088", "category": 26234, "amount": 4181, "description": "El impacto de Cardano en el cambio climático debe ser medible. Los eventos y las reuniones son cruciales para conectar los retos locales y las soluciones impulsadas por la misión", "funded": 2, "upvotes": 109109384, "downvotes": 9475141, "votes_result": 99634243, "votes_cast": 873, "f6_no_assessments": 9, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Como miembro activo de la comunidad de Catalyst, organizador de eventos/comunidades y ciudadano de la Tierra muy preocupado por los problemas climáticos a los que nos enfrentamos, estoy totalmente de acuerdo en que esta iniciativa tendrá un gran impacto, no sólo en la comunidad a través de los eventos que organizan, sino también en la comunidad más amplia del planeta, con el objetivo de ayudar a resolver dos problemas clave, el del desafío y el de la Tierra/Humana.\r\n\r\nLa propuesta tiene una declaración clara de cómo crear este impacto, resolviendo un problema específico, que es impulsar una comunidad consciente y promover las capacidades de Cardano para ayudar a resolver aspectos críticos del problema del Clima.\r\n\r\nLos objetivos del reto buscan habilitar eventos comunitarios para promover la participación, incorporar nuevos miembros, formar nuevos equipos, etc. y esta propuesta se alinea muy bien con todos esos objetivos, proporcionando KPIs relevantes para demostrarlo.", "q0r": 5, "q1": "El calendario y los hitos de la propuesta están claramente definidos, el marco temporal propuesto es adecuado y el número de eventos, como combinación de semanales (12) y mensuales (3), puede alcanzarse, basándose en las pruebas, la trayectoria y el equipo asignado.\r\n\r\nEl equipo está compuesto por varios miembros relevantes de la comunidad de Catalyst, que no sólo son muy activos dentro de la comunidad, sino que también ya están participando en otras iniciativas y proyectos. Su combinación de habilidades y conocimientos permite formar un equipo diverso y bien preparado, a la altura del reto.\r\n\r\nEl presupuesto solicitado, aunque es detallado y muy específico, es un poco conservador, preveo que algunos costos van a ser más altos de lo que se indica en la propuesta, sigo confiando en que el proyecto se llevará a cabo de todos modos, de acuerdo con el apoyo de la AMA y SWARM, pero habría sido mejor solicitar una cantidad adecuada que no cree dudas en ese frente.\r\nAdemás, si se tiene previsto contar con otras fuentes de financiación, como por ejemplo con los 150 miembros de la comunidad, fondos personales o mediante la colaboración con otros grupos, recomiendo que se mencione en la propuesta, para mostrar una mayor transparencia y viabilidad.\r\n\r\nAl igual que con muchas propuestas en este espacio, que tiene como objetivo una producción continua de eventos, podría haber algunos riesgos en el camino, que pueden ser mitigados si se identifican y entienden adecuadamente, que debe ser parte de la propuesta de los próximos fondos, para mostrar cómo se planea abordar la continuación y la sostenibilidad de la iniciativa.\r\n", "q1r": 4, "q2": "El calendario, los hitos y los indicadores clave de rendimiento proporcionados son específicos y están bien pensados, con conceptos SMART en ellos.\r\nLa comunidad podrá seguir y auditar este proyecto sin problemas, y también los proponentes podrán aportar claramente pruebas y evidencias de su realización.\r\nEl github proporcionado y el compromiso de documentar y publicar todas las actividades producidas será un gran recurso para producir también evidencia pública de los esfuerzos realizados y el impacto .\r\n", "q2r": 5, "assessor": "z_assessor_288", "no_vca": 20, "ne": 12, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "El tema de esta propuesta es apremiante, ya que aborda una parte del \"riesgo existencial\" al que se enfrenta actualmente nuestra sociedad: el cambio climático. La forma en que esta propuesta aborda este problema en el marco del Desafío es mediante la creación de un marcador de posición para que personas con ideas afines discutan este tema y, finalmente, presenten una propuesta al respecto que utilice la cadena de bloques Cardano. De esta propuesta surgirá una nueva comunidad, que abrirá una variedad de nuevas soluciones que quizás el Proyecto Catalyst nunca haya visto. Todo esto aborda varios escenarios del Desafío; desde la incorporación e integración de nuevos miembros a Catalyst, el uso de eventos para crear nuevos equipos y talleres/salas de trabajo para aumentar la colaboración. Sin embargo, lamentablemente, la oferta de conocimientos técnicos y las regulaciones que apoyan la unión del cambio climático con el blockchain hacen que esto sea un poco menos prioritario. En resumen, Cardano necesita más desarrolladores. El caso de la \"Agricultura Regenerativa\", aunque lógica, ecológica y numéricamente tiene sentido a largo plazo, es demasiado disruptivo y consume demasiado tiempo como para que sea fácil de aplicar en el mercado actual. Especialmente en el caso de los covid, los agricultores y demás necesitan una respuesta rápida para obtener beneficios.", "q0r": 4, "q1": "Aunque no hay enlaces para verificar su experiencia, el equipo es miembro activo de la comunidad. Como mínimo, 5 de los 8 son muy activos y aportan continuamente valor a Project Catalyst a través de la contribución directa y al ecosistema de Cardano, a través de propuestas financiadas. No hay duda de que esta propuesta tendrá éxito. Su presupuesto, aunque muy claro y acompañado de planes de acción correlativos, vuelve a plantear dudas sobre el sistema o la estructura de Project Catalyst. ¿Cómo es posible que 8 miembros activos y probados que están creando un equipo completamente nuevo se rebajen a sí mismos? ¿Un presupuesto de sólo 4.000 dólares para 8 personas durante 3 meses? Al principio pensé que se trataba de un problema de los proponentes, pero este es el séptimo caso de infravaloración. En cuanto al plazo de ejecución, también está claro que se trata de un seguimiento de su proyecto piloto. La única diferencia es que están pidiendo financiación para desarrollar esta iniciativa de manera que pueda tener un impacto y llegar a más personas. Desgraciadamente, no han tenido en cuenta los posibles riesgos y desafíos a los que podrían enfrentarse en la implementación posterior de su movimiento.", "q1r": 4, "q2": "La hoja de ruta proporcionada es muy detallada y hay suficientes hitos que hacen que el seguimiento de este evento sea auditable. También se tienen en cuenta sus KPI, aunque no todos van acompañados de números, los KPI principales sí son medibles. Aunque tanto el planteamiento del problema como la solución están conectados, el mensaje que se pretende transmitir es un poco vago. En el planteamiento del problema, se afirma que \"el impacto de Cardano en el cambio climático debe ser medible\", y la pregunta es \"¿por qué? Si la respuesta es para que la gente pueda encontrar grabaciones, discusiones y datos al respecto para crear conciencia y conocimiento, entonces esto se superpone con el trabajo de QA-DAO. En el caso de QA-DAO, están haciendo y proponiendo un trabajo estelar. El contenido de la propuesta es muy bueno y tiene un objetivo claro, pero no sé cómo será la aparición de esta propuesta en la aplicación de los votantes.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "C4C ha hecho crecer una pequeña propuesta hasta convertirse en una comunidad que ahora es difícil de pasar por alto para cualquier persona relacionada con Cardano y Catalyst.  Aportan una voz positiva y orientada a las soluciones al diálogo sobre el cambio climático, centrada en la sostenibilidad de Cardano y la capacidad del Proyecto Catalyst para ayudar a encontrar soluciones y alcanzar el éxito.  Su propuesta actual busca aumentar la exposición de este mensaje dentro de la Comunidad Catalyst, y con esa exposición encontrar y desarrollar propuestas que aborden el cambio climático y la adopción de Cardano.  Esas propuestas, a su vez, deberían ampliar todo el esfuerzo para impulsar la adopción de Cardano como blockchain sostenible para el futuro.  ", "q0r": 5, "q1": "Este equipo de la propuesta ya ha puesto en marcha muchos de los resultados de esta propuesta, incluyendo salas de reuniones y reuniones periódicas y eventos organizados como sus \"Objetivos Catalizadores de Sostenibilidad\" con 7 horas de contenido y colaboración, resultado que podría triplicarse o mejorarse si se genera financiación.  Han proporcionado directrices claras para la disposición del presupuesto, y plazos de entrega de las primeras reuniones (básicamente al instante).  Su equipo es entusiasta y extenso, una verdadera ganga en este presupuesto, y testimonio de su compromiso.  Han proporcionado una serie de KPI específicos que pueden perseguir dentro de la comunidad, como los miembros de discordia incorporados con el tiempo, pero también insinúan la capacidad de aumentar el alcance de Twitter y Youtube, que tiene el potencial de atraer a más participantes de fuera de la comunidad de Catalyst, por lo que esas métricas son igualmente valiosas.", "q1r": 5, "q2": "Debido a que el producto de esta propuesta será una gran cantidad de videos y eventos disponibles públicamente, debería ser fácil para la comunidad seguir a lo largo, y desde que fueron financiados originalmente en el Fondo6, han sido bastante activos comprometiéndose con otros y manteniendo a todos al día.  Además, en esta ronda de financiación indican su deseo de aumentar su transparencia aún más, registrando un repositorio público en github (¿quizás consideren ser añadidos al gitbook de QA-DAO?) que será útil para cualquiera que quiera seguir el proyecto desde su inicio.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Strengthening climate action in the Cardano ecosystem is fundamental to strengthening our competitive advantage as one of the lowest carbon footprint blockchains on the planet.  \r\n\r\nIt would be a mistake to ignore the power of engagement and commitment that ecological concerns possess. Today, they are an issue that breathe for itself. Their rationale is clearly understandable. Their ability to inspire the best in human beings, that fire that is believed to be lost in the darkness of the everyday world, is incredible. So, as a matter of both strategy and human decency, Cardano4Climate and its related initiatives should be as high on the Cardano agenda as they are on the global agenda of the 21st century.\r\n\r\nTherefore, when talking about community events, this proposal must have all the support it can possibly offer.  Also, look at their budget figure: $4181.  I bet all my chips that no proposal presents its budget figure in dollars and cents (181).  A sign of honesty and commitment. Every drop of budget used for exactly what is required.", "q0r": 5, "q1": "Please provide more detailed information about the budget.  The information presented is too general.", "q1r": 4, "q2": "Its KPIs are adjusted to the reality of events implementation and are presented as instruments that are easy to measure and relate to the progress of the proposal. ", "q2r": 5, "assessor": "z_assessor_541", "no_vca": 17, "ne": 2, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "This is a meaningful project that will help a lot to human life now and then, developing more to spread this meaning is the mission of humans, not just this team. As the team said in the proposal, this project will have a strong impact globally and will inspire everyone about Cardano community. \r\nThe KPIs shows clearly the team is really concerned about what challenge givens and they're trying their best for making a better impact on not just Cardano ecosystem but human life. ", "q0r": 5, "q1": "The team had held 1st event in 11/23/2011 and also hosted a lot of Catalyst event. Hence, no doubt that they can do it further. They have a well-explanation about what will happen in this project that helps the roadmap make sense. About the budget, is reasonable with their 1-week event plan. \r\nMoreover, they have shown clearly how feasibility this proposal is in detail with the past experiences and future co-create with other partners. \r\nThe budget required in the scope of this project is reasonable", "q1r": 5, "q2": "They have a detailed roadmap, inspired KPIs and milestone that includes monthly goals and overall metrics guideline. Those infos is fulfilling to help to audit easily this project. \r\nThe team also states the content of the problem in very detail, and that helps their solution make sense and perfectly to solve that problem ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 21, "ne": 1, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "Awesome idea. Not creating a 'one size fits all' climate solution but driven to host community focus events to discuss climate ideas and provide a participatory solution-based with community members involvement.", "q0r": 5, "q1": "Given the experience and strategic collaboration with other community members, I trust the team to deliver. The proposal has a detailed round of activities and specific and achievable outcomes.  ", "q1r": 5, "q2": "There is more than one process of documenting activities within the proposal. It tells much about the teams' transparency and openness. I think the metric for tracking success is open and easy to follow as well. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The heighten urgency to address climate related problems within the climate community provides the opportunity for the cardano community to show how eco-friendly the cardano community is. Indeed a mission-driven solution to solving climate change will help market the cardano brand. Therefore funding this proposal is laudable.", "q0r": 5, "q1": "The experience of the team in the Cardano community cannot be overestimated hence their track record makes them the ideal team for the climate change project. More importantly, there are well outlined events scheduled within the project and a work breakdown structure is also incorporated within the proposal as well as a well-developed timeline for the proposal. The events scheduled for the proposal will definitely increase the awareness of climate related problems and also enhance the cardano brand. Additionally, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake. Therefore, with the inclusion of a well-developed timelines for each event and a proper budgetary allocation, it will be very easy implementing the project successfully when given the fund.", "q1r": 5, "q2": "By way of determining the progress and success of the project, the team intends to meet set targets. For instance, the team has an expectation of increasing its; \r\n  1. Monthly growth rate of their telegram channel & discord server by 33% per month\r\n   2. Average number of participants in Cardano4Climate meetings & events by 50% per month\r\n   3. Number of Followers on Twitter\r\n   4. Number of Video-Clicks, Likes & Followers on YouTube\r\n", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 17, "ne": 6, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "I totally agree that this proposal is creating a robust and collaborative environment, promoting engagements, discussions and iterations about  a particular niche that  is of  tremendous importance  to the global environment and using cardano ecosystem to chart the way to a sustainable global climate through collaborations in free, transparent and friendly manner. ", "q0r": 5, "q1": "The proposal has given more than enough information on the capacity and competence of the team to implement the project successfully. In addition, the well articulated plans and budgetary breakdowns goes to indicate that the proposal is highly feasible", "q1r": 4, "q2": "Am convinced that the proposal has provided adequate and effective measures to assess its progress and performamce if funded.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "With all of the talk surrounding the negative environmental impact of Bitcoin, it would be a huge selling point to position Cardano as not only better for the environment (due to our proof of stake approach) but also as a true visionary in the space. Having the opportunity to convene and plan a coordinated approach is a great idea.", "q0r": 5, "q1": "It is outlined in the proposal the experience that the core team brings to the table. The feasibility and project plan are all explained in a very detailed manner. If the in-depth nature of this project shows anything, it's that this team notices the details.", "q1r": 5, "q2": "The team has outlined their success metrics, budget, and project plan. With this in mind, we have all the necessary information to determine their success if funding is approved.", "q2r": 5, "assessor": "z_assessor_964", "no_vca": 24, "ne": 4, "ng": 13, "nfo": 7, "vca_o": 1}], "solution": "Organizar, facilitar, ampliar, promover y registrar los eventos mensuales y las reuniones semanales", "experience": "Acogida de las salas de debate posteriores al ayuntamiento durante el Fondo 6\nDesde mediados de octubre se celebran reuniones semanales previas a los ayuntamientos\nSe celebró el primer evento el 23-11-2021"}