{"id": 384951, "author": "nftdao", "title": "Social Media For Blockchains", "url": "https://cardano.ideascale.com/a/dtd/384951-48088", "category": 26234, "amount": 1000, "description": "A medida que el mundo de las criptomonedas siga expandiéndose y haciéndose más interoperable, se necesitarán personas con conocimientos de blockchain.", "funded": 0, "upvotes": 17338266, "downvotes": 20594646, "votes_result": 3256380, "votes_cast": 227, "f6_no_assessments": 11, "f6_rating": 2.424242424242424, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is much validated but the proposal lacks of content. \r\nFirst, it would be nice to have an idea on the potential market size (how many people) it could reach, to assess its true potential.\r\nI'd start highlighting the problems he sees with the existing platforms (linkedin) with more decription; Saying its too crowded is not enough and doesnt convince anyone. The needed funcionalities that dont exist and the disadvantages need to be clear in the problem statement.\r\n\r\nIn addition, it could be outlined here what services the platform will provide and how it could benefits both employers and employees (look automatically for matches, profile data analysis, suggestions to improve resume, communication of courses). Some brainstorm/ideation sessions could be made with stakeholders (key potential users, proposers, companies, etc) to ellaborate more on that. Its good to have clear how it would differ from linkedin and what are the specifics advantages to the crypto/blockchain world.\r\n\r\nIt's also nice to bring what business model it would be adopted. The standards for this kind of platforms is the \"freemium\" but others could be tried.\r\n\r\nLast, as it is already stated in proposal the main objective here is not get funded but to learn how to ellaborate the proposal (for future actual funds) I dont see it is already ready to become a catalyst project. However, its in the right path, as the idea is good! This project looks very adequate to apply an agile metholody and develop the tool with the stakeholders, creating the new funcionalities in each sprint and validating with them. ", "q0r": 2, "q1": "Very vague experience and only one person apparently committed. It would be nice to se how the proposer is active in cardano community to validate its knowledge in this world and what is his graduation background to see where he needs to complement the team (if its a dev background he'll probably need a person with business experience and vice-versa). Linkedin links or any other reference to verify team information are always appreciated!\r\n\r\nIn regard to the plan, it exists and is time-framed but its too poor in details. Its necessary to see all the steps in development of the tool/platform, its validation/test in a pilot and its roll out plan, linked to the communication and business plan.\r\n\r\nThe budget breakdown is simple but as it seems to pay only for working hours of 3 weeks its fine.", "q1r": 2, "q2": "There are some milestones that could be taken from the plan its too little. No kpis stated. As metrics, I'd mention the numbers os users in the MVP, the number % of growth once platform is implemented, the number of funcionalities developed.", "q2r": 1, "assessor": "z_assessor_298", "no_vca": 20, "ne": 8, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "A decentralized Linkedin would have definetly some advantages.  The execution part of it seems to be a bit lacking but since the plan ist to conduct 3 weeks research I understand that this is an early stage proposal.", "q0r": 3, "q1": "The likelyhood that the proposer will conduct 3 weeks research is quite hard to assess. What maybe would have helped is to already formulate a draft on wich points and goals the research will be conducted (like a short research-roadmap). I think also it can be underestimated how much work to build a decentralized social media would need.", "q1r": 3, "q2": "The proposal is kept quite short and it is hard to assess how much time the proposer will spend on it e.g. if he underestimated the time of research needed. Also since it is a broad subject it would have helped to provide some points to audit how the research went.", "q2r": 3, "assessor": "z_assessor_41", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "I agree because \r\n1. the problem needed to be solved has been identified in the proposal and fall within the scope of the challenge..\r\n 2.. with this kind of solution to the problem will also add value to the cardano ecosystem by helping educate people through web app on crypto and blockchain..\r\n3. The key metrics and goals of the proposal also falls in scope of the challenge and scaled to adress future challengies because education and training is a constant practice..\r\n", "q0r": 4, "q1": "Agreed because;\r\n1. the proposal has an email that can help send and recieve info's about the project if funded and fall within the scope of the challenge.\r\n2. The proposal has also listed how team memebers are going to operate and budget breakdown into identifiable item that is 3,6 and 12 months and are reasonable to achieve set goals.\r\n", "q1r": 4, "q2": "Agreed beacuse;\r\n1. Doe the are not laid down roadmaps but an email to have much info's to track the project if funded.\r\n2. there are clearly defined metrics that defines the success of the proposal abd has a clearly understandable describtion of the tageted problem (challenge) and nice solutions that adress the problem\r\n", "q2r": 4, "assessor": "z_assessor_447", "no_vca": 22, "ne": 1, "ng": 11, "nfo": 10, "vca_o": 1}, {"q0": "\r\nThe problem needing to be solved has not been identified and articulated clearly namely THeres no job or professional app compared to Linkedin which focuses on blockchain\r\n\r\nIt is clear this proposal does not fall within the scope of the challenge brief  \r\n \r\nThis proposal doesnt show  how it may add value to the Cardano system. \r\n \r\n  Key metrics have not been presented at all.  \r\n \r\nThe key metrics and goals dont fall within the scope of the challenge\r\n   \r\nThe proposal is to build an app. This is not related to these Challenge goals. This proposal should be in Dapps category.\r\n \r\n\r\nI can say that this proposal doesnt adequately address the challenge needs, as its Community building  hence i have given it a 1 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country. Also I am an educator , teaching English both online and in real life and am an ICF Coach in training.As such I am familiar with Neuroscience and its benefits. I am also involved in AI and ML projects. \r\n ", "q0r": 1, "q1": "\r\nThe proposers  hasnt  provided evidence  of themselves with their skills and experience  \r\n  \r\n The links arent sufficient. \r\n \r\nThe proposers cannot be said to be experienced and competent to do the project  as yet\r\n \r\n The type and number of team members required to implement the proposal is not stated.\r\n  \r\nThe team structure isnt  listed and experienced.\r\n  \r\n The budget has not been given in detail. It appears quite high and has no designated cost centres.\r\n  \r\nThe budget is not reasonable to achieve the set goals. \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\n \r\nTheres a realistic timetable  to complete the work. \r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\n \r\nThe proposal doesnt give  a sensible and conductible plan for implementation.  .\r\n\r\nDoes the plan describe the resources necessary to implement the proposal?\r\n\r\nResources  necessary to implement the proposal are described.   \r\n \r\nDoes the proposal clearly explain  technical aspects like architecture, language and technologies if they are crucial for implementation?\r\n\r\nThe proposal has technical aspects which have been addressed \r\n\r\n\r\nHas the proposer considered challenges and risks relevant to a successful implementation?\r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is not reasonable hence I have given it a 1 star rating.   \r\n", "q1r": 1, "q2": " \r\n \r\nThere is no roadmap with milestones  \r\n \r\n There are  no Metrics given by proposer.  \r\n  \r\nThe problem has been understood and solution has been given broadly. My professional opinion is that it doesnt fit into the challenge goals.\r\n  \r\n    The proposer hasnt  identified possible hurdles, challenges and difficulties. \r\n \r\nAre there contingency plans in place for various outcomes? \r\n\r\n\r\n\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  not sufficient to audit the progress  hence I have given it a  1 star rating.\r\n ", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 20, "ne": 5, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "The proposer does not make a direct link between their proposal and the challenge brief. This app could potentially be used to onboard new members, but this link should be made and fleshed out by the proposer rather than the assessor.", "q0r": 3, "q1": "The proposer hasn't provided their skillset or relevant experience. The roadmap indicates that the proposer would like to be funded for a brainstorm intended to develop this idea further, rather than app development. There is no prior work to help us estimate if this proposer is up to running such an ambitious tool. This project has a big goal and the proposal doesn't address any of the technical, marketing, or team building dimensions of building a job resume website.", "q1r": 2, "q2": "The proposal does not have the concrete relevant information or measurable success indicators to make this auditable. If the only measure of success is a proposal in a later cycle, that doe not give us much to go on.", "q2r": 2, "assessor": "z_assessor_501", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "The proposal does not articulate how it will add value to the Cardano ecosystem other than as a general resource for the crypto community.  It proposes dapp for a LinkedIn style website, but does not specify how it will utilize any Cardano features.  ", "q0r": 2, "q1": "The proposal does not specifically state the proposers qualifications other than being a \"graduating student.\"  The school and major are not listed.  The proposal is to create a proposal, not an end in itself.   It is not a good use of funds to pay for the proposal process, as other proposers do not have this benefit.", "q1r": 1, "q2": "The timeline and success definition is not covered by the funding requested, the funding requested is only intended for creating a subsequent proposal.  ", "q2r": 2, "assessor": "z_assessor_607", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "\"Creating a website or an information app for crypto/blockchain specific recruitment and skill sharing on blockchain platform in a decentralized way is a great idea. A decentralized environment like blockchain always needs solutions like this to connect competent people with those who need skilled people to work on to carry out their projects. But apart from this proposal wanting to create a website and app similar to linkedin, I have not seen the proposer offer a better solution than linkedin. And the lack of a specific plan is also a limitation of this proposal.\r\nTherefore, if the proposer is really passionate about solving this problem, I think the proposer should spend more time thinking about improved solutions than linkedin, which will create more impact on the community. .\r\nIn addition, the proposal doesn't seem to be a good fit for this challenge\"", "q0r": 1, "q1": "\"Proposer is a graduate student in search of my ideal blockchain related career move after college. With this experience, the proposer is not qualified to ensure the feasibility of this proposal.\r\nBesides, all are just at the idea stage, and the proposer is asking for funds to research a solution, so it is almost impossible to have a specific product after funding this proposal.\"", "q1r": 1, "q2": "\"All are just at the idea stage, and the proposer is asking for funds to research a solution\r\nPlease provide a plan with timelines, milestones and goals against which progress and success can be measured.\r\nI hope you can come back in fund 8 with a specific solution and plan for this idea\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 20, "ne": 3, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This is a good proposal. However, the statement of what problem is to be solved remains vague. Cardano will have a narrow benefit from this proposal because the proposal is directed to blockchain (a whole entity comprising of sub-entities) rather than Cardano which is just one of the blockchains in the world. The goals of the proposal are not expressly stated so it makes it difficult to ascertain whether it fits into the challenge settings or not.", "q0r": 3, "q1": "I can't really see the skills and experience of the proposer needed to implement the proposal because links or references are provided. There is no team for the proposal. The proposer attempted to breakdown the budget into identifiable items but ended not being successfully broken down.\r\nIt's good that the proposal has a detailed plan for implementation.\r\nWhat is missing are the risks/challenges involved in the implementation of the proposal.", "q1r": 3, "q2": "There are no milestones for this proposal. I appreciate the fact that the roadmap is outlined. Time horizon for implementation is included. I also see that the proposal has defined success and that for me is good. The targeted problem is clearly identified.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 14, "ne": 2, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This is a great idea. Creating the app with blockchain knowledge is one step and usability is another. I think the proposal should have included market research.", "q0r": 3, "q1": "The proposal should have included relevant research and developer experience. Also, there is no info regarding the kind of research to be conducted and the methodology this research would employ. ", "q1r": 2, "q2": "The budget might not be adequate for holistic industrial-based research. Also, the budget did not include a breakdown of activities for the three weeks as specified to enable easy tracking of success and auditing.", "q2r": 2, "assessor": "z_assessor_727", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "The proposal aims to create MVP of an idea which is basically a social media app to cater for the new generation z by provide Blockchain technology knowledge based and opportunities as a replacement to other social media such as LinkedIn. I think that though but it is an interesting idea, this category may not be best to entertain such idea. Probably Dapps and Integrations may be right category for this proposal. ", "q0r": 1, "q1": "This is still a research based initiative with no information given about skill and experience, and particularly on how to go about the implementation. However a longtime overview of the proposal was provided but the project is still at its nascent stage and is not definite at the moment.", "q1r": 3, "q2": "The proposal did not  provide any KPIs on how to assess this stage of the project.", "q2r": 2, "assessor": "z_assessor_9", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "- An Linkedin-like web app can quickly identifies \"who can do what and how\"to accelerate Project Catalyst.\r\n- A web-based would be easy for all stakeholders to participate.\r\n- A blockchain based social media is desparately needed in an era of constant abused by centralized social media giants.  \r\n- Further down the road. It could scale to other community activities: proposals to voters, SPOs communities, local meetups, etc.\r\n- The experience from a blockchain social media can be shared and transferred to others.\r\n- A blockchain based social media is technically challenging.\r\n- The fund requested to research is USD$1,000.  I would even argue it is under shooting for a social media that involves identity on blockchain.", "q0r": 5, "q1": "- The technical background needed for a blockchain based social media to succeed is difficult.\r\n- I agree a blockchain based Linkedin-like social media needs further research. \r\n- The team has had previous experience on building NTFDAO.\r\n- I would give a five star if proposal provides the area and/or direction which the fund will be spending on.", "q1r": 4, "q2": "- Proposal has stated in 3-months time to produce the detailed of Linkedin-like social media.\r\n- Would be great if proposal can break down further details during the 3-months research period.\r\n- In 6-months time for a fresh new proposal for Project Catalyst to assess and vote on.\r\n", "q2r": 4, "assessor": "z_assessor_985", "no_vca": 26, "ne": 5, "ng": 17, "nfo": 4, "vca_o": 1}], "solution": "La solución tendrá la forma de una aplicación web y será similar a LinkedIn, pero para la contratación y el intercambio de habilidades específicas de la criptografía y el blockchain.", "experience": "Un estudiante graduado en busca de mi carrera ideal relacionada con blockchain después de la universidad."}