{"id": 385040, "author": "cobblecat", "title": "Catalyst Infosessions in Ethiopia", "url": "https://cardano.ideascale.com/a/dtd/385040-48088", "category": 26234, "amount": 4500, "description": "Las personas ajenas a la comunidad no reciben información sobre Catalyst en Etiopía", "funded": 1, "upvotes": 22850319, "downvotes": 14976649, "votes_result": 7873670, "votes_cast": 226, "f6_no_assessments": 19, "f6_rating": 2.543859649122807, "videos": [], "media": [], "f6_assessments": [{"q0": "Yes, this proposal clearly articulates how it will add value to the Cardano ecosystem by doing publication in local magazines & participate in tech events to spread Cardano. Would be great if they also put some key metrics on how many proposer/voter/CA/vCA are going to be increased by doing this project proposal.\r\n\r\nAnd whether this proposal is able to scale to address future challenges. ", "q0r": 4, "q1": "The team already break down the budget into several parts. And the budget is reasonable to achieve the set goals. It would be nice if we could know who is the team member behind this project proposal. Adding a LinkedIn, GitHub or a website that we could check, would add more credibility to the project.\r\n\r\nMoreover adding a realistic timetable to complete the work or roadmap would increase the likelihood that this project could be completed if funded.", "q1r": 2, "q2": "This proposal has clear understandable solution that addresses the problem and also understandable description of the targeted problem.  It would be great if the proposer could include also a roadmap with milestones. Adding a link where the Cardano Community could track the project progress will also add some additional value  so that the community could audit the progress and the success of this proposal. At the moment, we could not see any place where we can audit this project.", "q2r": 3, "assessor": "z_assessor_282", "no_vca": 16, "ne": 0, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "The proposal aims to publish local magazines, take part in tech events by reserving booths and organizing hackathons in Ethiopia. The proposal seems to be within the challenge.\r\nHowever, the proposal does not articulate clearly how it will add value to the Cardano ecosystem.\r\nTherefore, I neither disagree nor agree the proposal is impactful.\r\nI recommend the proposers should add the success metrics as well as describe how the success looks like, making it impactful. For example: \r\n\t  - increase awareness of Ethiopian about Cardano and Project Catalyst\r\n\t  - increase the number of participants in events\r\n\t  - increase active participation in events \r\n            - onboard and integrate new people into Project Catalyst\r\n            - increase meaningful participation in Project Catalyst among all stakeholders\r\n            - use events to build new teams    ", "q0r": 3, "q1": "The proposer describes goals and budget broken down into idetifiable items. However, a lot of important information is missing. What is the contents in local magazines and in events (in details)? Which steps need to be done and how to do? How the success looks like? Where is timetable of the proposal? How many participants at least as expected in each event? How many participants at least who would join Cardano commnity after each event?...\r\nBesides, the team members' experience and skills need to be provided with evidences.\r\nBecause of the missing information above, I strongly disagree the proposal is feasible.", "q1r": 1, "q2": "The proposal should add important information for auditing, such as: roadmap with milestone and time horizon, metrics/KPIs and describe solution understandable clearly. \r\nBecause of the missing information to audit, I rate auditability with a score of 1.\r\nSince the idea is great, I believe the author can make it to become a great proposal in next Fund.", "q2r": 1, "assessor": "z_assessor_714", "no_vca": 12, "ne": 4, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The Challenge is about onboarding and integrating new people into Project Catalyst, increasing active participation in events. This proposal meets the challenge.  The proposal looking to reach out to non Catalyst people in Ethiopia i", "q0r": 4, "q1": "The proposal is at a very early stage. Information provided is not sufficient to help voters make an informed decision.  \r\nA description of the teams qualification and experience relating to the objectives of Catalyst and their future role in the proposed project will be useful. ie. more information on  pervious info-sessions, project-planning etc.  Having organise multiple events around the world, the proportional breakdown of the budget looks sensible, however, the details of each item should be alined to resource and activities.  eg. how will the $3k on info-session Organization actually be spent.  providing this information will really help the vote understand the proposal better.", "q1r": 2, "q2": "Although some goals are listed, no metrics have been given that relate to the ones outlined in the challenge brief.  If this proposal were to come back in a future fund, taking account of the comments above, the metrics should be defined in terms of numbers of new people integrated into Cardano (new voters, proposers and CAs).  \r\nNo risks or challenges have been called out in the proposal, the most obvious one being the risk of disruption due to Covid.  The proposer should think about mitigations for this and other risks. ", "q2r": 1, "assessor": "z_assessor_774", "no_vca": 17, "ne": 5, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "A very good idea but seems to lack some vital ingredients. the metrics of success were not captured. Where is the event to be held , who will be the audience and how many of them do we expect. if these things are clarified it will beautify the the proposal.", "q0r": 3, "q1": "A time table showing how the proposer intends to achieve these goals would have contributed much. ", "q1r": 3, "q2": "the schedule is not very clear and the budget is also not itemized. this will make it quite cumbersome for the auditing process", "q2r": 2, "assessor": "z_assessor_733", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "Though the problem statement is not clearly defined, the strategy adopted for addressing the challenge is great. I also suggest the team include social media in addressing the challenge.\r\n\r\nHowever, the project fails to capture its specific audience\r\n", "q0r": 4, "q1": "The experience in info-sessions and the experience as a marketer are great attributes for public engagement on the issue the team seek to address. Despite the clear plan for executing this project, however there are no timelines for each event.\r\nI am of the opinion that if the timeline for each event is adjusted, the project will executed successfully.", "q1r": 4, "q2": "The information provided for tracking the progress and success of the project is not adequate to determine the project's success", "q2r": 2, "assessor": "z_assessor_732", "no_vca": 14, "ne": 2, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "A good problem statement that will bring many into the community but the proposed solution of the proposal does not match your planned activities. you made mention of newspaper publications but it did not show in your plan", "q0r": 4, "q1": "the idea is good but the team's experience is was only stated with convincing proof. it will serve well to have evidence of the info sessions organized earlier. Also, your goal is well stated but no plan for execution. these corrections and others would make it a great proposal to implement", "q1r": 2, "q2": "the Budget is moderate but I expected some detail to improve audibility. What specific activities will go into the info sessions and the respective amount associated with them", "q2r": 2, "assessor": "z_assessor_728", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The project is lacking purpose. I would be glad if the project focus on one things that would help impact individuals outside the catalyst community. ", "q0r": 1, "q1": "There is no detailed plan for implementation or what success would look like for the project. ", "q1r": 2, "q2": "It is unclear how the project would be documented for easy tracking. Also, the marketing strategies may not reach the right target, especially magazine advertisements. It would be helpful to record info-session for easy tracking.", "q2r": 1, "assessor": "z_assessor_727", "no_vca": 17, "ne": 0, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The problem statement did not explain the reasons why there's that lack or inadequate information for the people of Ethiopia. This will help understand the problem at hand so it can addressed with the objectives", "q0r": 3, "q1": "The goals are somehow apt but the project has no measurable outputs and outcomes. How many people would benefit from the event and what could be the impact of the events both online and in-person. These were not explained in the proposal", "q1r": 2, "q2": "The budget is good for such events. However, it looks impossible to quantify the impacts or benefits after the events. ", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Good proposal here. The problem is clearly stated. There is a good correlation between the problem and the challenge. The proposal will also bring a positive impact to Cardano if successfully implemented. The proposal has not clearly stated its goals so it's a little bit challenging to determine whether they fit or agree with the challenge settings or not.", "q0r": 4, "q1": "This team looks very vibrant and proactive considering that they have been able to organize several info sessions previously, but there is no evidence to that. I think the team looks abstract as in the people making up the team are not actually known. It would be good to know the number of team members involved. I like the breakdown of the budget. The risks/challenges involved in the implementation of the proposal are not included.", "q1r": 3, "q2": "The nature of the proposal looks abstract, I don't really know how the execution of the proposal will be tracked. There is also no stipulated time horizon for the execution of the proposal. Milestones are not clearly stated. There are no metrics/KPIs. It would be difficult to audit this proposal.", "q2r": 3, "assessor": "z_assessor_717", "no_vca": 12, "ne": 2, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "What a great and meaningful idea. I always want to expand Catalyst to other continent countries, especially countries in Africa like Ethiopia. We have entered a technological era as well as a new age. But not everywhere can integrate like that. I take the first step let's build a community and carry out promoting it to Ethiopia. Not everyone has the facilities to use and learn. Thanks to the community we can create events remotely or volunteers will go there. In the next one to two years we could have Catalyst communities in Ethiopia", "q0r": 4, "q1": "To make it feasible we also need a solid team of professionals with good leadership. I hope you can introduce more details about your team profile, what are the roles you take on in the project. We can't run an international project with only a few experiences from 2 3 events right? Regarding your plan, I have only seen the aspects of promotion and communication. I hope we will have a specific roadmap to call and build meaningful community.", "q1r": 2, "q2": "To run events and raise the community I evaluate with a capital of only $4500 is not enough. You will spend a lot of money in terms of organization. In addition, it is also necessary to spend money to train professional staff. And a capital to determine a solid route, not like volunteering. I hope to be able to see your detailed plans and the funds you use for what they are intended and show everyone how you use them.", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 13, "ne": 2, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The identified problem and the solution to the problem are described in a vague manner and it's unclear who is the target audience (\"people outside of community\" have various needs, it is recommended to identify those who can benefit from taking part in the Cardano ecosystem and thus adding value to the Cardano ecosystem).\r\n\r\nThere are no KPIs/metrics defined to measure the success of this proposal. What is to be done is drawn briefly but there are no details about how is to be done to successfully implement the proposal in a predefined period of time.", "q0r": 2, "q1": "There is no description about the experience of the team members and about their roles in the team. The shown experience should be emphasized with evidence from public sources (social media, links to previously successfully completed projects etc.).\r\n\r\nThe budget is outlined and broken down into identifiable items but no details are provided about the resources necessary for the proposal to be implemented. (human resources - how many people are necessary to do the work and for how many hours/days?; - what are the resources needed to set up and to deliver the online and in-person meetings?)\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (lack of education could mean lack of entuziasm and interest for the target audience - why they could be attracted to be a part of the Cardano community? what are the topics to be discussed in the meetings? Are these topics good enough to meet the audience expectations?)\r\n\r\nThe output of the work done should be measured (how many people could and will attend the meetings? How to measure the user satisfaction and how to measure the relevant impact of those onboarding?)", "q1r": 2, "q2": "There is no roadmap defined with milestones and a time period of achievement.\r\n\r\nThe proposal itself reads very poorly. It reads like a concept more than an executable proposal. It needs more editing so that it can be assessed properly given its direction. Perhaps reworking it and submitting it in the next Funds will work.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 21, "ne": 4, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "This proposal offers a solution to help people in Ethiopia get information about Catalyst by Publishing in local magazines, participating in tech events by booking booths and organizing hackathons. this helps many people in Ethiopia get to know Catalys and cardano. This can increase the number of people participating in the catalys. This proposal can make it suitable for challenge.", "q0r": 4, "q1": "The experience team has organized a number of informational, project planning and marketing sessions at various events. however there is no proof or any link to prove it. There is no information on the implementation team, no roadmap, no implementation time, no specific plan given in this proposal, so the level of completion cannot be assessed. the provided budget is generic so I can't say if it's suitable or not. if the above descriptions are improved then this proposal has a better chance of getting funding success. Based on the given message I did not expect the deployment to be successful.", "q1r": 1, "q2": "The proposal does not have a clear roadmap, timelines for completing items and KPIs to check progress. The solutions offered are not specific.", "q2r": 1, "assessor": "z_assessor_706", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The solution is in line with the problem statement. Informing Ethiopian people will make the community bigger and contributes to the ecosystem. It can be a good choice to do this online, if this country is developed enough in this. The creators will need to find out what sources are best for them to find their potential new members for the community. Do you have access via someone who has these connections and information? I see that one of the creators is very committed to the subject and probably consult his connections and network.", "q0r": 5, "q1": "It is very realistic to organize this online information session, to promote through social media, to realize publications in local magazines. In this way they will reach the right target group. I am missing a solution to the language barrier in this proposal.", "q1r": 4, "q2": "I am missing a timeline for this project. I assume it takes time to create awareness, knowing the right people to help spread this in the country itself will be highly recommended here. The funds seem on the low side to me. Magazine articles and marketing material costs seem insufficient. The amount for participation in technical events is also underestimated, an employee who is present at a trade fair for 1 or 2 days is more expensive than 300 USD.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is still at the level of an idea. Proposal needs to include more information such as: What is the content of these events? Where will it be done? How to attract participants? What is the purpose of this hackathon?\r\nActually, I still don't understand the contents of these events and the purpose of the events and the public local magazines.", "q0r": 1, "q1": "The team has organized several info-sessions, project-planning, and marketing at various events. But I have not seen a single piece of evidence presented in this proposal to prove the team's experience is correct.\r\nIn addition, the team only gave general goals to carry out the events but did not specify the plan to implement those events. How to attract participants? What is the content of the event? After completing the events, what results will the proposal achieve?\r\nThese information omissions render this proposal unviable", "q1r": 1, "q2": "Proposal has given a budget breakdown of the amount to be funded. But it did not specify what the plan to implement the events is. In addition, the proposal has not yet set out the goals that the proposal will achieve after implementing those events. Therefore, the proposal is almost impossible to audit", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 19, "ne": 1, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "This proposal attempts to onboard and integrate new members onto Cardano through a variety of actions such as; reserving booths in tech events, organizing hackathons, 1-on-1 sessions, online sessions etc. Although it is not clearly articulated, the main goal of this proposal is to increase Cardano's brand in Ethiopia through various marketing and community engagement efforts. This proposal does also align with the Challenge setting but the alignment is limited. Nonetheless, it is very much scalable and addresses the Challenge but only to a certain degree.", "q0r": 3, "q1": "What this proposal lack is the further communication of the proposers experience. What is provided is vague, reckon to further flesh out their background and provide the names of these events they were involved in organizing. Continuing the theme of names, would be good practice to also mention the team involved.  If possible to also add a link to their LinkedIn or any form of documentation that could function as a verifier. Budget is broken down and generally outlined, but some items would do no harm if it were explained further, such as; 'What tech event will the funded booth be in?' also 'What publication will this event be published on?'. Unfortunately there is no time table, no plan of implementation and no considering the risk and challenges the proposers might face. With that said, this proposal is more likely to be unsuccessful.", "q1r": 2, "q2": "There is no roadmap, no milestone, no action plan but there is some KPI's. The problem statement is clear, the solution is also clear and there is a connection between them, but other than that, this proposal needs to be worked on. Please do not get discourage by the rating, for assessor does this so proposers can come back with a stronger proposal and more know-how. Highly recommend to participate in various Catalyst School workshops. Please do also take time to view all their written and video content. Highly confident the proposers can gain more knowledge and pointers to create a future awesome proposal.", "q2r": 1, "assessor": "z_assessor_635", "no_vca": 19, "ne": 5, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposer is suggesting to take part at events and make publications in local magazines to boost the presence of Cardano and Catalyst in Ethiopia. This is a good idea to bring awareness about Catalyst. If done correctly this could bring in a new wave of participants and stakeholders.", "q0r": 4, "q1": "Looking at the detailed plan I feel like the proposer still hasn't thought about everything. We don't get a lot of details about the plan. Where will this info session be held? how does the proposer plan on promoting this event? What we are also missing is evidence about the relevant experience. It would've been better to provide a LinkedIn or references to previously organized events.", "q1r": 2, "q2": "For auditability, we don't get a roadmap on the proposal, this makes it hard to assess the progress and when what is planned. By providing a roadmap the community gets a guideline as a reference to the proposal.  As stated above we need information about the team behind the proposal, who can we contact, who is in charge, who has knowledge about marketing? The idea is great but the execution needs more work.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 20, "ne": 1, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": " \r\nThe problem needing to be solved has not been identified and articulated clearly namely people outside the community are not getting information about Catalyst in Ethiopia \r\n\r\nIt is clear this proposal does fall within the scope of the challenge brief   by Publications in local magazines, taking part in tech events by reserving booths and organizing hackathons \r\nThis proposal does show  how it may add value to the Cardano system by Publications in local magazines, taking part in tech events by reserving booths and organizing hackathons\r\n \r\n  Key metrics have not  been presented at all.  T \r\n \r\nThe key metrics and goals havent been given\r\n   \r\nThe proposal can scale to address future challenges by carrying out more  Publications in local magazines, taking part in tech events,  by reserving booths and organizing hackathons.\r\n \r\n\r\nI can say that this proposal  adequately addresss the challenge needs, hence i have given it a 3 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country. Also I am an educator , teaching English both online and in real life and am an ICF Coach in training.As such I am familiar with Neuroscience and its benefits. I am also involved in AI and ML projects. ", "q0r": 3, "q1": " \r\n \r\nThe proposers  hasnt  provided evidence  of themselves with their skills and experience  \r\n  \r\n The links arent sufficient. \r\n  \r\nThe proposers cannot be said to be experienced and competent to do the project  as yet as i have no proof to determine their competence.\r\n \r\n The type and number of team members required to implement the proposal is not stated.\r\n \r\n \r\nThe team structure isnt  listed and experienced.\r\n \r\n \r\n The budget has not been given in detail. It is broad and has no details of cost breakdowns but has some designated cost centres.\r\n \r\n \r\nThe budget is  reasonable to achieve the set goals. \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n\r\nDoes proposal offer a realistic timetable to complete the work?\r\n \r\n\r\n \r\nTheres no realistic timetable  to complete the work. \r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\n \r\nThe proposal doesnt give  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are not described.   \r\n  \r\n\r\nThe proposal has no technical aspects which have been addressed \r\n\r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is  possible this proposal will be implemented successfully\r\n This proposal is detailed and budget is  reasonable but no details have been given of experience or competence hence I have given it a 3 star rating.   \r\n", "q1r": 3, "q2": "\r\nIs there clearly laid out a roadmap with milestones and a time horizon for achievement.\r\n \r\nThere is no roadmap with milestones  \r\n \r\n\r\n There are  some Metrics given by proposer.  How many relationships with colleges, how many student entrepreneurs, web traffic metrics.\r\n  \r\n \r\nThe problem has been understood and solution has been given broadly.  \r\n   \r\n    The proposer hasnt  identified possible hurdles, challenges and difficulties. \r\n  \r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal but the auditability of the budget remains in question, hence I have given it a  3 star rating.\r\n ", "q2r": 3, "assessor": "z_assessor_460", "no_vca": 17, "ne": 4, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "I strongly agree to the above proposal because it's in scope with the challenge, looking at the publications in local magazines, taking part in tech events etc. will also help people in the communities of ethiopia have informations and edeas about catalyst and through this will have a possitive impact and add value to the cadano ecosystem.\r\n\r\n Also the key metrics of the proposal falls in scope with the challenge and stated clearly. e.g.  in-person info-session and brainstorming events, online info session events social media promotion, all this adresses the challenge above.\r\n\r\nwith this kind of proposal can also help address future challengies because it's going to be something done contineuosly.. it's a very nice proposal.", "q0r": 5, "q1": "i strongly agree because looking at the proposer provided evidence, references, links etc. of relevant skills and experience it's highly likely the proposal will be implemented successfully.\r\n Also have good and correct links that can send and recieve imformation about the project if funded.\r\nThe proposer also stated the team structure looking at how to shear the info. and with a good IS  budget reasonerble for  the proposal being a success if funded.\r\nThe plan drawn also describe the resource necessary for the implementation of the proposal..\r\n", "q1r": 5, "q2": "i agree because the proposal has an email that can help you track their website for more detailes on how to follow every step of the team if their proposal is being funded.\r\n  I agree but not strongly agree due to lack of road maps, the proposer should make sure he provides roadmaps if proposal is being funded.\r\n The are also clear defined metrics/KPI's that define's the success of the problem and solutions are also understanderble for solving the problem.\r\n  The proposal also plan to deal with the difficulty because many people needs to no more about catalyst in ethiopia.", "q2r": 4, "assessor": "z_assessor_447", "no_vca": 21, "ne": 6, "ng": 6, "nfo": 9, "vca_o": 1}, {"q0": "This proposal addresses how to onboard new people into Project Catalyst, and involving people in Ethiopia is a good idea as it is giving opportunity to someone to expand their world. It does however lack more detailed information on how exactly this is to be done, and how the objectives of the challenge will be met. It only shows a general idea of how you are planning to create info sessions.\r\nMaybe next time include what information you will be communicating and marketing to the public. Do you want to attract new proposers, or voters etc.", "q0r": 3, "q1": "The proposers mention that they have experience in info-sessions, project-planning, and marketing at various events. They do not however provide references or links to their relevant experience or skills. In your next proposal give more detail on how many team members you will be, what each one's role will be in the project as well as references to their experience and skills. Provide more detail on how the funds will be used, like in marketing materials you have requested 500 USD. What kind of materials, Flyers? And what information are you trying to get out there specifically around Cardano. ", "q1r": 2, "q2": "There is no time horizon, or roadmap with milestones. What events will be targeted, and when. This proposal does not provide sufficient information to make it auditable. In you next proposal provide information on what you will be trying to achieve other than bringing more people to Cardano. Who will you specifically be trying to attract, and how many is your goal? Like if you would like to attract more proposers, and how many over what period.", "q2r": 2, "assessor": "z_assessor_795", "no_vca": 14, "ne": 4, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "Publicaciones en revistas locales, participación en eventos tecnológicos reservando stands y organizando hackathones", "experience": "Hemos organizado varias sesiones informativas, de planificación de proyectos y de marketing en diversos eventos."}