{"id": 382991, "author": "cole.vt", "title": "Sustainable SPO's Impact & Stories", "url": "https://cardano.ideascale.com/a/dtd/382991-48088", "category": 26246, "amount": 15000, "description": "There isn't enough widespread community participation + story sharing about SPOs in the Cardano ecosystem globally, found in one place.", "funded": 1, "upvotes": 27484447, "downvotes": 14258478, "votes_result": 13225969, "votes_cast": 108, "f6_no_assessments": 4, "f6_rating": 3.916666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "A hub that provides a collective picture of successful SPOs creates an opportunity to bring inspiration to life in the minds of viewers. As blockchain is a foreign concept for most of the planet, this proposal's goal of bridging the understanding gap through telling stories is a solid one with the capacity to introduce potential SPOs to ways of engaging not previously considered. Stories move us, and teach us, far more than instructions or blue prints. Taking on the task of telling these stories has the potential to plant the seed of action within future SPOs, and help them to see the path more clearly through the experience of those who have already gone the distance. This also has the potential to introduce SPOs to new and meaningful relationships with stakeholders of all kinds. To most directly meet the impact of this challenge, the proposing team would need to carefully vet the involved SPOs to make sure that they are highlighting groups that meet the key challenge criteria. Are all categories represented and highlighted as a fundamental consideration? Are they well dispersed around the globe? Appropriately staked? Using green energy primarily? Really nailing this focus will take this idea from good to great. \r\n", "q0r": 4, "q1": "The enthusiasm from the proposing team is clear from their design. Their combined experience and credentials are well suited for this task. The budget seems unrealistic, as the production of short videos typically runs in the $1000s of dollars, and this group intends to produce 100 stories with the different SPOs ... will there be travel costs, equipment, etc? Communication seems like a second significant challenge - how will the team make contact with the teams and be sure to have a diverse spectrum of involved storytelling SPOs? That said, this project is ultimately a work of elbow grease, effort and resilience, which make it likely that two people so committed to a mission will persevere and solve these problems along the way. ", "q1r": 3, "q2": "This team has done a nice job in painting the picture of what's possible through storytelling, and the idea is sound. It is great to see a continuation of the Fund6 project forging ahead. It is somewhat unclear from the proposal whether the hub will feature primarily articles or videos or both, and how that will be determined. This will also influence how social media and marketing are designed. It would also serve a long-term vision to understand how SustainableADA will connect with readers/viewers as the content is accomplished. Certainly this project is a significant undertaking and will be most impactful in its alignment with the challenge if it gets wide viewership and lands in front of potential SPOs who are then encouraged to get involved and further the mission. Beyond hitting the 100 stories target, the group could measure engagement in their posts/stories, site data, new involvement from previously uninvolved viewers, new relationships developed, etc. It would be strong to have these criteria determined from the get-go so that the full picture of impact could be shown. This can bridge the gap between having powerful stories  and powerful stories that are actively moving a community. ", "q2r": 3, "assessor": "z_assessor_856", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "The problem presented is reasonable and within the scope of the challenge. Promoting Mission Driven SPOs is an important aspect of Cardano's decentralization and this proposal is taking on that role.\n\nThe goal of producing content for 100 SPOs indicates a good potential impact on the challenge, but I would like to see more information about the type of material to be produced. The proposal mentioned the objective of producing articles/videos for 100 Missions Driven SPOs, but I believe it is important to establish in more detail the format of these articles, stories/videos.\n\nThree relevant metrics were defined, but the absence of KPIs/targets in these indicators makes the impact assessment more subjective. I would recommend including KPIs with targets that indicate more clearly and objectively what we can expect as an outcome.", "q0r": 4, "q1": "The team described suitable experience and qualifications to successfully conduct the proposal. The team has partnerships with WADA and AIM, which have good reputations in the community for their work in the Cardano ecosystem. There are sources to check the information.\n\nThere is a budget breakdown, but there is a point that raises doubts about the feasibility of the proposal. A budget of $100 has been set for the production of promotional content for each SPO, but it is not specified what type of article/vide/story to expect. Is there an estimate of characters/words per article? Is there an estimate of how many minutes each SPO will have on video? Without this information, it is more difficult to assess the feasibility of the budget intended for this production of content.\n\nMy impression is that the proposal focused a lot on the SDGs rationale and covered little about how the promotion of SPOs will be, which is the objective of the challenge, so I would recommend focusing more on the content creation plan.\n\nSeveral steps described in the roadmap are developments that have already been completed and although it is important to see that the team is already carrying out work, little has been said of what will be delivered as a result of this proposal in the roadmap presented, so my recommendation would be to focus more on the development that will be the outcome of this proposal. The target of 250 SPO stories is not included in the budget and it was not clear if it will be a future development that will need more funding.", "q1r": 3, "q2": "There is a clear relationship between the problem, the solution and the challenge, there is a good alignment and the proposal addresses the challenge objective well.\n\nThe goal of 100 stories seems like a good way to check auditability, as do the three metrics described, but I would recommend including KPIs with targets, which can more objectively check the performance of the stories.\n\nThere is no clarity on the type of material that will be produced for SPOs, I would recommend that it be more clearly established. There is a defined deadline for the delivery of the stories, however, the roadmap does not contain enough information related to the deliverables/milestones related to this proposal (Most of the items presented in the roadmap are prior to this proposal)", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 20, "ne": 11, "ng": 9, "nfo": 0, "vca_o": 2}, {"q0": "The proposer has done a great job by putting up this detailed and interesting proposal. It addressess the challenge and has the potential of adding value to the ecosystem since the comminity will become much aware of the SPO roles, their sustainability and  how relevant they are in adding value to the cardano network.", "q0r": 4, "q1": "The proposer has a great team with the required experience to execute the project. The proposer has provided enough links that point to team members and their experiences which i think is applaudable. The budget is on point and reasonable to guarantee success.", "q1r": 4, "q2": "The proposer has stated the KPI's, a roadmap and has also described how success will look like when the project is executed. This i think is commendable.", "q2r": 4, "assessor": "z_assessor_799", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The Proposer wants to increase community participation through story sharing from successful SPOs. Their success stories when told within the community will encourage more participation and drive SPOs an stakeholders globally. Very laudable project recommended. The challenge is well addressed. ", "q0r": 5, "q1": "The team is made up of Educators, Economists, NGOs, sustainability experts, video editing experts, writing, Figma, Canva and AdobeCC experts who are capable of delivering. Their plan is detailed and comprehensible, such as, being specific in producing a story / video for \n100sustainable SPOs about their connection with Cardano blockchain and sustainability. They plan to have an article / interview with the major alliances and their members and work their way through the SPO list once funded. With their credentials and plan, the project can successfully be implemented. ", "q1r": 5, "q2": "They mentioned that they will share updates on the project through social media channels like twitter, linkedin, etc for easy auditing. The KPIs are clearly outlined as masuring the amount of community funds in ADA staked to projects, the number of verified unique hosting, etc. Measuring success based on a strongly motivated team willing to reach out to a minimum of 100 SPOs ; the budget breakdown is comprehensive and the timeline of 12 months broken down is also clear for easy auditing. Good proposal recommended.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}], "solution": "Facilitating the increase of meaningful participation with and from Mission Driven SPOs and stakeholders globally.", "experience": "Educators, Economics, Sustainability, Humanities, Social Sciences, NGO's, Social Entrepreneurs, Writers, Video Editing, Figma, Canva,AdobeCC"}