{"id": 383191, "author": "nvhieu", "title": "Simplify SPO operations in Vietnam", "url": "https://cardano.ideascale.com/a/dtd/383191-48088", "category": 26246, "amount": 19670, "description": "Most of the stake pools are running on common hosting providers (AWS, GCP, Azure). we need a self-reliant network rather than it is now.", "funded": 1, "upvotes": 42251770, "downvotes": 13787296, "votes_result": 28464474, "votes_cast": 150, "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal does a very good job of addressing the challenge brief, which is to help the decentralization of Cardano's operator pool. Initially, on my first read-through of the proposal, I though that the proposer's decision to go for a twin solution (a. simplify setup and provide stake pool guides & b. provide a pre-setup solar power stake pool product kit to market) might be overkill. However, in fact, on second thought, there is a lot of value in a combined approach and it also opens the door to synergies that are natural. I would also say that the proposal is well fleshed out in terms of an implementation plan with my general impression that it will provide value for money if implemented well. I have been involved with Project Catalyst since the very start and have been a CA and vCA. Also, I have assembled a Raspberry Pi and used it (as a non-techie), plus have worked to set up a stakepool during the ITN days on a (non-Raspberry Pi) Ubuntu machine at home (didn't finalize it, unfortunately). I would probably be an example of a person who could benefit (if I were Vietnamese) from a proposal of this kind. So, what I might see as a slight problem is that the problem statement in this proposal correctly identifies that \"Running stake pools on major cloud platforms offers convenience ... so most of the stake pools are running on 3 major cloud providers (GCP, AWS, Azure)\". However, part of the offered solution is to deploy 1 pool system on the cloud as an example, and then record steps as videos. It would seem to be more logical to deploy the pool system on Raspberry Pi as an example (which is already part of the proposal) or at least on a Linux physical server - in order to better address the real problems a non-tech person would face. The proposal itself states that it aims to simplify setup for non-tech people, so - my suggestion would be to focus on the non-cloud deployment as an example, and record videos of this process that a non-techie with a Raspberry Pi or home computer will be able to learn more. Effectively, it might be a good idea to change the order, so instead of starting implementation with \"create simple instructions, videos, and setup, operating scripts in Vietnamese\", that could follow after the Bare-metal solar energy stake pool kit is created and operational. Only THEN make a comprehensive set of instructions, video that would also address the specific issues for that solar SPO kit and similar ones, as well as addressing general stakepool setup issues. This would generate a greater impact, as the kit and the instructions would be perfectly aligned and compatible. ", "q0r": 4, "q1": "The proposer has done a good job in breaking down the budget to smaller components and for a proposal with a very well visible horizon, it helps to visualize the project as well. When I added up the budget components the total costs did not add up the same way as the proposer [(1)+(2)+(3)+(4)+(5)+(6)=750+650+600+350+15820+1500=$19,670] added them up. My calculation gave a different total, based on the budget breakdown that the proposer provided. However, the sum that I came to was $19,570, which is a immaterial typo-level mistake on the part of the proposer. There might not be a need for a double setting up of a stakepool (on Cloud and on bare metal) if the idea is to promote non-cloud SPO setups - however the proposer may have a valid reason and I am not detracting points for that. I would be interesting in finding out whether a $150 batttery and $100 stablizer would be sufficient as a back up for a solar-powered stake pool (or maybe just for the block producer, not the relays as well?). If yes, that would be an amazing solution. Hence, I commend the proposer for including as part of the project a component designed to calculate energy consumption for  Raspberry Pi running a Cardano stakepool. The proposing team has provided great transparency in terms of their core competencies and have been involved with the founding of Vietnamese stakepools. One of them is - according to his Linkedin profile - skilled in designing and manufacturing equipment (Python, C#, codevision, Solar LED lights, LED fishing lights) and from 2018 was involved in research on blockchain and Haskell, with a masters degree in electronics and eletrical engineering. Feasibility seems to be a no-brainer. What I would recommend is for the team to try to put themselves in a position of a non-tech person as they are doing this entire proposal for such \"consumers\". In fact, it would be really good - if this proposal does not pass this fund - to resubmit it with an addition to the team. Who? A non-tech person with low familiarity with Cardanoi. This non-tech person would be an integral part of the team, pointing out what is not understandable and what needs to be explained better. The budget could be increased accordingly, to cover the engagement of the (hopefully enthusiastic) non-technical person (but with a lower hourly rate) - as a \"guinea pig\" helping to ensure the delivered guides are really understandable to a non-tech person. The team has identified some risks, such as difficulties for deploying a bare-metal stake pool on Raspberry PI - I think that possible solutions should have been analyzed in much more detail in the proposal (and fleshed out in more than just a few words) - as this is crucial to the success of a key pillar of this proposal. \n", "q1r": 4, "q2": "The team has given a very nice general roadmap for their planned activities. The metrics/KPIs seem to be a little bit unfinished. It would have been good to measure the time that a non-tech person requires to set up the final stake pool with 2 relays and 1 BP on Raspberry PI with solar energy - WITHOUT any help from the proposer. This would also help identify pain spots before the planned follow-up proposal for the next fund - that would lead to identifying at least 5 Vietnamese SPOs to take part in the deployment. Some steps seem a bit to difficult to audit, as we do not have a proposed delivery format. For example, \"Physical Packaging of the stake pool kit\" is one definition of success after 6 months. However, we have no information on what would be a \"successful physical packaging\" and what is an \"unsuccessful physical packaging\". Or \"re-sizing hardware configuration. Provide optimized build of materials and specifications\" - it seems like a target, but how will this be provided? A booklet/manual in the \"physical packaging\"? Or something else? How will someone audit these steps? Another example of a definition of success after 4 months is: \"Run a stake pool with 2 relays and 1 BP on Raspberry PI using solar energy.\" My question is - does this mean powering it up and running it for 5 epochs or will it mean running the stakepool with 2 relays and 1 BP on solar energy for 6 months (as the proposal asks for 3 IPs*6month ~ 250 USD)? It would be good to give a precise timeframe, so the success can be clearly audited. How likely is it that another target for success will be met (\"The first block is minted on the solar Energy stake pool kit.\") after four months? If we know that block minting depends a lot on stake delegation and the Cardano Foundation might decide not to delegate part of its stake to the new pool? Using a $1500 incentive for attracting delegators might seem to be an inefficient use of resources - and am not sure it would really work to substitute a Cardano Foundation stake (so maybe you could provide a breakdown of how would the $1500 be used specifically). Other products of the proposal \"Return on investment Calculation\" (16 hours of work) - seem unclear in terms of delivery. Who will it be delivered to, how will it be presented, what format should we expect to see it in? Also \"Sharing how to create a solar energized stake pool\" - this seems a bit to vague... again it would help the proposal's auditability and clarity to specify what type of material will be shared, where, when and will this component be a video guide, an electronic document, a brief ten-step one-pager? If the proposal is not approved this fund, it would be good to be very specific when resubmitting it - in order to provide clearer and more auditable steps. I have a feeling that all this information is already available in the proposing team's minds, so best to put the entire blueprint involving deliverables - on paper. The fact that the team recognizes that there might be difficulties for deploying a bare-metal stake pool on Raspberry PI - would probably mean that the budget should reflect possible costs involved in finding alternatives (there is a reserve for risks in deployment, but how was that sum of $1,500 obtained?) - or explain how does this impact the proposed solution. \n", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 21, "ne": 11, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "Great Idea and necessary for Vietnam.", "q0r": 5, "q1": "This proposal is so clear and detailed. Member in this team also have experience. I believe that this idea can successful. In other side, I wonder that are you sure that need so more money like above? $1 USD = 23,010 VND, $19670 is so much for one project in Vietnam. Moreover, $70/ hour is too much and did not appropriate.", "q1r": 4, "q2": "The information provided clear and detailed. Have left a lot of personal information to prove the authenticity of the project. The people who carry out the project are experienced, well qualified. I am also a student of Vietnam National University, Ho Chi Minh, although not in the same city, but in the same training place. I know better than anyone to be a lecturer in this environment is very difficult, must be really nice. ", "q2r": 4, "assessor": "z_assessor_756", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "I strongly agree this challenge is critical to achieve Cardano's decentralize mission. \r\n\r\nThe proposal addressed the key concern of of Vietnamese communitive. The more stake pool operates, the more decentralize the network will be. Bringing the renewable energy sources to operate the stake pool also great idea for sustainable development.\r\n\r\nIt would be great if proposer provide more information about how many percent of stake pool in Vietnam as compared with cardano's total stake pool then voters can image how can this proposal can impact to Vietnamese community.", "q0r": 5, "q1": "This proposal is very likely to be successful based on the definition of success set out in the plan. The proposers are currently Stake Pool Operator then they have all the experience in running it. \r\n\r\nThe budget is clear and reasonable for each items. The milestones are realistic and feasible. \r\n\r\nThe only point I would add is a deeper analysis about the solar solutions: ie: the average of energy consumption for each stake pool per month. If it is a big amount then the solar energy can help, bare in mind that the solar panel and battery are also not environment friendly.", "q1r": 5, "q2": "\"The proposal includes a roadmap with targets and a plan extending to June 2022 and the mass adoption will be consider in next fund which show a carefull approach of proposers. \r\n\r\nThe proposal shows detailed steps, milestone and deliverables that will be simple to check if the project is running on schedule. \r\n\r\nOn the material to run SPO in Vietnamese (including the documents as well as the video), i would suggest proposer provide KPIs for the audience reach (ie: subscriber on youtube channel, website visitor increase...)\"", "q2r": 5, "assessor": "z_assessor_819", "no_vca": 17, "ne": 4, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "In my opinion this proposal could improve the stakeholder participations in the Cardano community Stake Pool Operators and the developer work on cardano blockchain.\nThe proposal have the correct mix from building and deploying a new kind of stake pool (bare metal vs cloud), ecological solar power, passion for creating educational contents…\nHowever the objective of the proposal is interesting and it’s good for growth the Vietnamese community, but I think it's important to enrich the proposal with other kind of support for SPOs, because only building a new stake pool doesn’t enough to improve economics for Vietnamese communities.", "q0r": 4, "q1": "The proposer team has very good experience, because they are very well experienced Stake pool operators member. \nThe metrics for the assessment are given, so it’s possible to assess what the proposer wants to do and the success of his actions. Roadmap and milestones are described (date, actions, kpi).", "q1r": 4, "q2": "Roadmap and milestones are basically described. The budget’s information provided is described. There aren’t a lot of KPI to identify the proposal goal, but only deliverables. There are some details how the budget is going to be spent, also I'm trying to discover attachment to deep dive the solution. Futhermore there are basic information to asses.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}], "solution": "Simplify setup and operate stake pool guides so that non-tech people can do. Provide pre-setup solar power stake pools appliances to market.", "experience": "We are SPOs, Eastern Townhall moderators, blockchain tech-savvies, electronics, and automation experts."}