{"id": 383433, "author": "felixweber", "title": "Mission& Vision driven SPO Networks", "url": "https://cardano.ideascale.com/a/dtd/383433-48088", "category": 26246, "amount": 10500, "description": "Pools set up to support the building of the Catalyst community & infrastructure are underrepresented in the ecosystem.", "funded": 1, "upvotes": 32072743, "downvotes": 12978015, "votes_result": 19094728, "votes_cast": 157, "f6_no_assessments": 6, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"q0": "This is an exciting proposal in that it both creates a solution to the challenge rich for experimenting, and promises a subsequent blueprint whose application will allow for growth, expansion and learning in future cases. It addresses the challenge goals in that it engages smaller entities as SPOs and unites them in a network of operation so that each individual entity can capitalize on the experience of the collective, and contribute to it. Further, these smaller entities can be vetted for their adherence to the qualifications (mission, use of green energy, experience) at the outset and their adherence to the best practices for growing within a networked SPO environment. It seems that this collaborative approach could eradicate some of the barriers to entry for future entities, particularly those who are green in this field and those with fewer bodies and resources to jump onboard without community infrastructure. The creation of a network-specific treasury also shows long-term thinking in terms of governance and sustainability. ", "q0r": 5, "q1": "The very experienced proposing team already has much in the works, and is under way developing the first group of SPOs with a developed and governed treasury. There is a ground-up mindset and commitment to the development of a community of support and unity. As many of these entities are already versed in chronicling experiential learning and making it globally available, it is very likely that this team will be able to both navigate the process of designing and uniting the Mission & Vision driven SPO solution and assembling a comprehensive living blueprint, which would be a gift to future organizations and a key accomplishment for bringing more organizations to serve as SPOs. The timeline is thorough, and the budged highly detailed for the allocation of funds requested. ", "q1r": 5, "q2": "The experimental nature of this project naturally allows for some flexibility as to metrics. The 90-day roadmap has high-level deliverables anticipated for January - March. The team's confidence in their work and vision for this solution comes through brightly in this proposal. Because this idea has so much potential to serve as a powerful model for growth, it would contribute some robustness to this proposal to have potential pitfalls anticipated and solutions/tactics considered within the feasibility or roadmap section. For example, recruiting future community groups to engage in the second, third and fourth networks may prove a significant challenge. How would this be addressed? How does the team envision marketing the opportunity to those who are new to or intimidated by the prospect? Once the initial network is successful and process documented, how does the team envision most powerfully leveraging it for the building of the Catalyst community & infrastructure? These are long-term considerations and perhaps beyond the scope of this proposal, however reflecting on these potential challenges could help to form a stronger initial run. ", "q2r": 4, "assessor": "z_assessor_856", "no_vca": 16, "ne": 9, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal addresses directly the challenge by crating synergies between SPO's and community.", "q0r": 5, "q1": "All information provided, including fully deployed prototype pool network, are easily accessible from the proposals page. The proposal is well edited and well thought through, with easy to follow line of development. The budget for this 3 month operation, is listed in detail and acceptable.\r\n", "q1r": 5, "q2": "The proposer states that, all records of projects, stake pools, delegation, rewards, and treasury disbursements will be tracked and audited. Planned pool network meetings, will be recorded and publicly available.\r\nI strongly agree and rate auditability with the highest score of 5. \r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 20, "ne": 2, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The idea of SPO community treasuries is a powerful one.  Its easier to see the the connection to rapid funding than to the sustainable operation of stake pools. However in the future this may become more obvious. I think it is important to explore these governance mechanisms. ", "q0r": 4, "q1": "This is basically a proposal for research and documentation on a governance model. The proposers are deeply involved in Catalyst so should have a clear grasp of the task at hand. ", "q1r": 4, "q2": "Some KPIs refer to the Ryuuki project, so there is definitely some overlap here. It may be difficult to separate the two proposals when auditing. The other KPIs refer to the production of documentation and are not very specific as to form, quantity, or dissemination/marketing. ", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to create a network that will document the journey of SPOs from scratch to prominence. They stated that the impact is to help fund community project aside catalyst funding; run an experiment in mutual support and management of a community treasury. The challenge has been addressed effectively as I read the proposal.", "q0r": 4, "q1": "The team is made up of experts engaged in catalyst community project, SPOs, catalyst circle members, funded proposers, community advisors and mentors who will be able to successfully implement the proposal. The detailed plan outlined in the proposal, among others, will launch a prototype network of community stake pools; support the creation and oversight of grassroots treasury; explore and document the concept ; great SPO network that will form and further decentralize the Cardano network. All these facts can lead to a successful implementation of the proposal .", "q1r": 4, "q2": "The road map of the work to be done is clearly stated as from January to March 2022 with details outlined in the proposal. The budget is well broken down and will make auditing very effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal supports the greatest challenge that the Cardano community is facing in the next five years, namely the ability to self-govern and successfully manage the wealth that they together create and share. ", "q0r": 5, "q1": "The proposal is driven by highly experienced and respected community leaders who have dedicated their lives to this mission. While the challenge is enormous, and nobody managed to accomplish it before, these trailblazers are dedicated and willing to experiment and work hard with the engagement of the community to forge a path to a new \"societal operating system\" that supportive of human flourishing.", "q1r": 5, "q2": "Everything will be open sourced and accessible by the community, including in form of an accessible playbook.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Creating a network for SPOs is an innovational idea. It \r\n helps to overcome the disadvantage of large organizations'  pools which is lower level of intention/care for one particular ADA pool (as they have many pools for different coins). Though, it is unclear to me about whether 100% of the SPOs joining the network have to be committed to the Community Network Treasury, or there is a choice for them to not join in the Treasury (meaning that they can autonomically use their rewards while being part of the network). Overall, this idea can be scaled-up to address other challenges in the future.", "q0r": 4, "q1": "Given that a prototype pool network is already up and running, it can be implied that there is a high possibility that this project can be put into action. The proposers have done a great job as the budget plan is clearly stated in the proposal, however, there is a lack of information about the team members. Additionally, given that this project would help fund community projects outside of Catalyst funding rounds, so would this mean that the team have to do a whole assessing stage just like Catalyst do? That point should be put into consideration in order to utilize the effort.", "q1r": 4, "q2": "By using existing tools like Github, it can be easy for outsiders to audit both the project and the network itself. So the proposers have done a good job on assuring clarity.", "q2r": 5, "assessor": "z_assessor_936", "no_vca": 18, "ne": 3, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "Create an innovative network of Catalyst-focused SPOs, work with prominent Catalyst builders & document their SPO journey.", "experience": "Assembly of established & engaged Catalyst Community Projects, SPOs, Catalyst Circle Members, Funded Proposers, Community Advisors & Mentors"}