{"id": 383858, "author": "gargiulo.gianni", "title": "Stakeboard: Social Staking Platform", "url": "https://cardano.ideascale.com/a/dtd/383858-48088", "category": 26246, "amount": 45500, "description": "To support a growing number of prosperous SPOs, delegating needs to be easier, more informative, more trust-inspiring, and more lucrative.", "funded": 2, "upvotes": 87815131, "downvotes": 9640560, "votes_result": 78174571, "votes_cast": 451, "f6_no_assessments": 5, "f6_rating": 4.733333333333333, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=13847"], "media": [], "f6_assessments": [{"q0": "The problem described in this proposal is closely aligned with the challenge. Decentralization is a central and very important pillar for any public blockchain. Even though Cardano has an excellent distribution of block producers compared to other PoS blockchains, it is important to note that in the crypto space there are many cases where the competition is leveled down, specifically in this case it is the problem of PoS blockchains that have few validators (less than 30) and in many cases different validators are controlled by the same entity. Decentralization is what ensures security and censorship resistance in a public blockchain, as it makes the costs of attacks (like 51% attack) higher, discouraging block creators from colluding to attack the blockchain. The proposal clearly and objectively describes the pain points that centralize the production of blocks in Cardano, which are large exchanges and owners of multi-pools.\r\n\r\nThe proposed solution intends to facilitate the UI/UX of those who delegate, through a marketplace. As a moderator in the Cardano community I receive complaints almost daily from users who have difficulties in seeking information about how and where to choose a pool. Today this type of information is manually curated in the vast majority of cases and having a platform that can offer curation has good chances of leveling the playing field between SPOs.\r\n\r\nThe metrics/indicators/KPIs indicate a great potential impact on the SPO ecosystem.", "q0r": 5, "q1": "First of all, Stakeboard is already a project in full development and with several deliverables completed before receiving funding from Catalyst, which indicates a reliable and productive team.\r\n\r\nThe information about the team described in the proposal is detailed, the experiences described and the work already performed indicate that the team is fully capable of developing this work.\r\n\r\nThe budget brekdown describes 3 items, however there are few details on how the money will be spent. The definition of $5,000 for \"UX\" seems vague to me, which compromises the feasibility assessment of the requested budget. I would like to see more details indicating the amount of work for each step/time required x corresponding remuneration.\r\n\r\nDespite the vague requested budget, I believe the requested amount is reasonable given the compensation of 2 engineers and the proposed deliverables.\r\n\r\nThe roadmap is very well prepared, there is clarity in the timeline, deliverables/milestones over time.\r\n\r\nThe plan itself does not present great technical complexity or barriers, as the concept is more focused on curating information/data on a website. The only point that I see as a risk and that raises questions about the feasibility of the marketplace is how Stakeboard will deal with the language barrier, considering that the goal is an easier UI/UX, how non-English speaking users will be served ?", "q1r": 4, "q2": "There is clarity in the description of the problem, the solution and how the proposal is aligned with them. The roadmap is very well designed, there are deliverables/milestones that make auditing the proposal easier.\r\n\r\nThe metrics and KPIs were well chosen and I believe they are good indicators for evaluating success, as the chosen outputs would clearly indicate the number of users and participating SPOs and the progression over time.", "q2r": 5, "assessor": "z_assessor_43", "no_vca": 18, "ne": 15, "ng": 3, "nfo": 0, "vca_o": 2, "reply": "The CA's thoughtful assessment is commendable, and greatly appreciated. Their recommendations are insightful and entirely valid, and we'll take them into account in our development efforts, as well as in any future proposal - especially how to make the platform conducive to non-English speakers. One of our plans is to be able to search for SPOs based on language preference, but we'll give this issue more consideration. "}, {"q0": " \r\nThe problem needing to be solved has been identified and articulated namely To support a growing number of prosperous SPOs, delegating needs to be easier, more informative, more trust-inspiring, and more lucrative.\r\n\r\n\r\n\r\n\r\nIt is clear that this proposal falls within the scope of the challenge brief whereby Stakeboard is a social staking marketplace designed to promote decentralization by improving key aspects of Cardano's staking landscape.\r\n \r\nThis proposal shows how it adds value to the Cardano system by creating such a solution\r\n \r\n  Key metrics  would be  number of users, no of wallets, no of fiat transactions, no of ADA transactions.\r\n \r\n\r\nThe key metrics and goals of the proposal fall within the scope of the challenge\r\n   \r\nProposal can be scaled up to address future challenges by adding more businesses who use the same solution\r\n\r\nThis project will have a positive impact on Cardano system by enabling small businesses to get on board.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country including payment gateway containing sites. \r\n \r\n", "q0r": 5, "q1": "\r\nThe proposers  have provided ample evidence  of themselves with their skills and experience in  required skills. \r\n  \r\n The links are sufficient. \r\n \r\nI have visited these links  \r\n  \r\n \r\nThe proposers are well experienced and competent to do the project\r\n \r\n The type and number of team members required to implement the proposal is stated.\r\n \r\n \r\nThe team structure is listed and experienced.\r\n \r\n \r\n The budget has been given in detail. \r\n \r\nThe budget is  reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\n \r\nTheres a realistic timetable  to complete the work\r\n \r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are described.   \r\n  \r\nThe proposal has technical aspects which have been addressed \r\n \r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is  highly likely this proposal will be implemented successfully\r\n This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   \r\n", "q1r": 5, "q2": " \r\nThere is a roadmap with milestones  \r\n\r\n \r\n There are  Metrics such of number of users, no of wallets, no of transactions, time taken, amount of fees saved, amount of time saved on each transaction.\r\n   \r\nThe problem has been clearly understood and solution has been given in much detail.\r\n  \r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties.  \r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n ", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 21, "ne": 6, "ng": 6, "nfo": 9, "vca_o": 1, "reply": "The CA's thoughtful assessment is commendable, and greatly appreciated. Their recommendations are insightful and entirely valid, and we'll take them into account in our development efforts, as well as in any future proposal."}, {"q0": "This proposal was prepared by a professional team that clearly points out current problems and offers excellent solutions. This kind of project definitely has a positive impact on the Cardano and Catalyst ecosystem. It is clearly presented in detail how it will add value to the Cardano ecosystem. The KPIs in this proposal are phenomenally elaborated and presented and fully meet the ones indicated in the challenge. Without any problems the proposal is able to scale and address future challenges. Excellent preparation of the proposal!", "q0r": 5, "q1": "The team is transparent, professional and through the links provided in the proposal we can clearly see who will work on the project. The work done so far and all the necessary skills, knowledge and experience needed to implement this project are listed. The budget is clearly presented and broken down into identifiable items but it would be good to present the work schedule required and job fees. In Global Sustainable Indep. SPO's challenge we have 28 ideas looking for money. It might be a good idea to ask for a little less than this amount for this proposal. Because if we ask for almost half the amount of the whole challenge, we either don't care about others or we need to increase the budget of the challenge. The team does not state the need for additional funds. The team clearly presents a detailed implementable plan and details of actionable tasks and order of execution. The time frame within which the work will be done was presented and elaborated, and the resources needed were explained, but it would be good if the technical aspects were presented in more detail. Such a project certainly has possible risks, which unfortunately have not been mentioned.\r\n\r\n", "q1r": 3, "q2": "The team perfectly developed and presented a roadmap with milestones and a time horizon for achievement. The KPIs that define the success of the proposal are also perfectly developed and presented and they can be used to quantify the success of the project and they fully make sense. The community can be satisfied because it can track the progress of the project without any problems.\r\n\r\n", "q2r": 5, "assessor": "z_assessor_656", "no_vca": 20, "ne": 8, "ng": 8, "nfo": 4, "vca_o": 1, "reply": "The CA's thoughtful assessment is greatly appreciated. While I think we've put together an excellent proposal overall, most of the constructive criticism here is entirely valid. While we believe we deserve a bit higher score in the feasibility of the project, we do respect the time and attention the CA gave in assessing it, and on that account are not challenging this specific aspect of their assessment. "}, {"q0": "The proposal is a great idea for the ecosystem and definitely aligns with the challenge. Such solid platform that enable \"all in one\" place for delegators and SPO(s) are very important and innovates the current ways of how ADA holders delegate and operate staking pools. Moreover, this proposal help ADA holders to make the right decisions when choosing a stakepool, with its solutions and Alice (bot) that alerts of malicious and bad actors in the ecosystem. I'm giving this a 5, as the proposer have already made initiatives on what they are aiming to do and have much confidence that this proposal will be a game-changer in the Cardano ecosystem. ", "q0r": 5, "q1": "The proposer claims to be a team of various field that would make the project successful, with addition of a solid and detailed roadmap, KPI(s) and key metrics that align with the challenge. They have already completed many objectives and have a very wide vision for the ecosystem to reach healthier and much secured platform for users both delegators and SPO(s). Though I would love to add a feature whereby, the platform has a \"favourite\" feature that allows users to have a list of liked staking pools. Besides that, the approach on the UI/UX of the dashboard presented on their website is really on-point of how the proposers use user-centric approach. This proposal gives great example of how voters can have confidence during the voting phase. I would also like to add that this proposal adds so much value of convenience to existing holders with a simplified, all-in-one, well informed platform.", "q1r": 5, "q2": "The budget is outlined clearly and broken down into identifiable items and are reasonable to achieve the goals. Offering such realistic timetable to complete the work and clearly explains technical aspects of the project are sufficient to have great auditability of their progress. Potentially an intriguing concept but the proposer can further list out the risks that the will be addressing along with how they will be managing those risks. ", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 19, "ne": 9, "ng": 9, "nfo": 1, "vca_o": 1, "reply": "The CA's thoughtful assessment is greatly appreciated. While I think we've put together an excellent proposal overall, the constructive criticism presented here is entirely valid. "}, {"q0": "This is a bridge between the SPO and Delegator worlds. Some pieces are already under development. The Alice detective from stale-board is nicely finding changes in pool's parameters and if a delegator was subscribed to this then they would easily make decisions on changing stake pool or staying with same pool. This has great utility for delegators and SPO", "q0r": 5, "q1": "Some pieces are already working. So I have no doubt that this will be implemented successfully by the team", "q1r": 5, "q2": "the proposal has details that can be easily audited like how many pool operators joined program, how is their pool getting benefit from this etc.", "q2r": 5, "assessor": "z_assessor_849", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1, "reply": "Succinct but helpful and (I believe) accurate assessment of our proposal. The CA's appreciation for our thoroughness and confidence in our team is greatly appreciated."}], "solution": "Stakeboard is a social staking marketplace designed to promote decentralization by improving key aspects of Cardano's staking landscape.", "experience": "2 Tech leads: CTOs, founded multiple start-ups; SPOs; Plutus Pioneers, Emurgo Academy\nSenior Designer\nBusiness Development Lead"}