{"id": 384152, "author": "akyar.ozgur", "title": "Eco SPOs to support Climate Action", "url": "https://cardano.ideascale.com/a/dtd/384152-48088", "category": 26246, "amount": 10000, "description": "Energy consumption of blockchains is on of the main question to the communities who aren't aware of Cardano.", "funded": 0, "upvotes": 18855354, "downvotes": 17562928, "votes_result": 1292426, "votes_cast": 128, "f6_no_assessments": 6, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The aim of the proposal is Nobel and needs encouragement. But the methodology does not sound convincing. Outreach by Phone calls emails and social media engagement with 3000 plus SPOs may not yield the desired outcome. Moreover the aim as stated in the proposal to \"Increasing community understanding about Eco-friendly staking and helping independent SPOs to promote and prove legitimacy\" does not feel sharp enough. ", "q0r": 2, "q1": "The proposer claims to be \"Computer Engineer, Educator, Researcher\" any reference to his past would have helped to identity and evaluate his capability to infuse a large ecosystem in a better manner. ", "q1r": 3, "q2": "There budget of USD 50 per hour for outreach effort looks very high when Haskell developers are paid less than this amount. It may not be a good comparison but a valid one. The outcome is also not measurable since i feel the end state is very subjective. ", "q2r": 2, "assessor": "z_assessor_46", "no_vca": 18, "ne": 0, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I have been able to collect a lot of experience on sustainability topics. And can hence competently evaluate sutainability criteria in proposals in this category. The proposal matches the challenge well, and has a good direction, however it could outline some more concrete actions. With that being said, the proposal still has the potential to add quite some value to the Cardano ecosystem.\r\n Key metrics are formulated that match the challenge. Scalability can potentially be expected from such a proposal.", "q0r": 4, "q1": "The proposers don't present any verifiable credentials. The proposers do not explicitly define the type and number of team members other than themselves they plan on using to implement the proposal.\r\nThe budget is explained. However the exact work done with it could be explained better.\r\nThe proposal does not offer a timetable or roadmap and no implementation plan apart from that. The only thing presented are some metrics and some rogh plan of connecting different actors. No risk assessment has been done regarding general challenges. Feedback: Make a detailed implementation plan, link some verifiable personal information, and generally, explain more what exactly you want to do.", "q1r": 2, "q2": "Comprehensible metrics are presented. The problem statement is clear, however a concrete explanation of the solution is still missing. Also a roadmap is missing for a complete proposal.", "q2r": 3, "assessor": "z_assessor_52", "no_vca": 17, "ne": 2, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Strengthening climate action in the ecosystem is fundamental to strengthening our competitive advantage as one of the bockchains with the largest eco-friendly footprint on the planet.  \r\n\r\nCardano's low energy consumption compared to other blockchains is one of our most outstanding competitive advantages today.  Strategies to make use of this advantage should be encouraged.  \r\n\r\nAt the same time, it is necessary to recognize and incentivize the work of SPO's whose work contributes to the fight against climate change.  This proposal attempts to do just that.\r\n\r\nOn the other hand, proposals that seek to show the outside world the work we do in the ecosystem should be taken seriously.  By highlighting the importance of working with NGOs that promote the fight against climate change, this proposal also attempts to do that.\r\n\r\nIn conclusion, I think that this proposal points to the objectives of the campaign. ", "q0r": 4, "q1": "- Please provide more external information about the team members.  Their academic background and experience. \r\n- Please provide more information on the activities outlined in the Budget section.  Your explanation is very general.\r\n- Please provide a roadmap of activities to be implemented after the possible funding.\r\n- Please describe what kind of possible obstacles you see in the implementation of the proposal and what back-up plan you have to solve them.\r\n", "q1r": 3, "q2": "Please explain a little more about the scope of the KPIs described.", "q2r": 3, "assessor": "z_assessor_541", "no_vca": 19, "ne": 2, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This proposal is a great idea. The execution part of it seems to be a bit lacking. However, for the challenge brief - it is fitting in. I think the proposer is missing on further explaining how to solve the problem; \"Increasing community understanding about Eco-friendly staking and helping independent SPOs to promote and prove legitimacy\". Aside from that, the proposer should mention on goals and milestones of the development of the website & advertisement to clearly define the proposal. The proposal touches upon the fact that energy consumption is essential for what Cardano stands for - an energy efficient blockchain. Thus, reducing eco-friendly staking pools does add benefit to the ecosystem.", "q0r": 3, "q1": " I believe they have the skills to inform and educate new members about the idea of the proposal, but The presented plan is comprehensible but I think it is important to have more clarity in the description of what the membership model is and its relevance in the proposal. At stated, enhancing NGOs working on the climate change issue and SPOs is the main interest of this proposal. I think it is important to describe how this will be done in more detail to better understand the approach. Also, providing links of their LinkedIn to support their statements. Furthermore, a proper and detailed roadmap and risks of apprehending the proposal would be great and needed. To create the proposed solution is one thing, but operating it successfully is another. Based on the given information, I'll give a rate of 2.", "q1r": 2, "q2": "The budget required is hard to define as the proposer should clearly define further on its milestones and goals. Although the key metrics have some alignment with this challenge, I feel that it can be improved by stating the success of the proposer's actions - (for example, how do the proposer intend to create support for NGO(s) and what are the marketing objectives that needed to propel the project further?).", "q2r": 3, "assessor": "z_assessor_669", "no_vca": 17, "ne": 3, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "The project could potentially give SPOs another avenue to gain delegation through interesting NGO partnerships. ", "q0r": 4, "q1": "Im not sure how easy it will be to interest NGOs to partner with stake pools even though the proposer has experience volunteering with NGOs. The proposal lacks detail on how NGOs and SPOs will be vetted and matched, and how the success of these partnerships will be monitored. ", "q1r": 3, "q2": "The funds are basically allocated to outreach, but management and monitoring tools will need to be developed in order for the project to be a success. The proposal also doesn't give any numbers for \"success\" when discussing the KPIs, so auditing may be difficult. ", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 19, "ne": 1, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "The proposal aims to support the challenge by bringing together NGOs and SPOs to synergistically address the climate problem of blockchain and accelerate Cardano as a leader in climate-friendly ledgers.", "q0r": 5, "q1": "It is not detailed, nor clarified by an example how such synergies can be achieved and what the benefit of bringing together NGOs and SPOs can have. ", "q1r": 4, "q2": "In assessing the success of this work one needs to consider in addition to the number of proposals also the effects of this matchmaking - aka KPIs assessing the synergetic collaborations achieved from this matchmaking need to be added.", "q2r": 4, "assessor": "z_assessor_721", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}], "solution": "Increasing community understanding about Eco-friendly staking and helping independent SPOs to promote and prove legitimacy.", "experience": "Computer Engineer, Educator, Researcher. Enjoying civic engagement throughout volunteering in NGOs. So I can bridge the gap:)"}