{"id": 384859, "author": "esgpool", "title": "Bare Metal Green Infrastructure", "url": "https://cardano.ideascale.com/a/dtd/384859-48088", "category": 26246, "amount": 20000, "description": "Most SPOs avail of large server houses to host their stake pool. Energy use isn't considered and ownership is remote. Bring it local to SPO.", "funded": 1, "upvotes": 38119878, "downvotes": 16357880, "votes_result": 21761998, "votes_cast": 122, "f6_no_assessments": 6, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "The bare metal green infrastructure proposal addresses the challenge of global sustainable independent SPOs by creating sustainable bare metal infrastructure. The proposal looks promising if they can show prototype to the community at the end of project timeline.", "q0r": 5, "q1": "The background of proposer is an entrepreneur and a stake pool operator. He understands the business of running stake pool while striving for a better way to run tge stakepool with green or renewable energy. Very commendable and would give the full rank if he would provide more KPIs and proposer detail ", "q1r": 4, "q2": "The timeline (6 months) and budget (20k) look plausible in term of implementation. Should he provide the measurable KPIs, the full rank in term of auditability will be given as the demand for green infrastructure for running SPOs is much needed.", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 16, "ne": 3, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "I think the proposal goals of moving the majority of stake pools to self-hosted bare-metal is unrealistic and not necessarily desirable. I do like the idea of offering a hardware \"package\" that made bare metal hosting more accessible, though. ", "q0r": 3, "q1": "I worry that the proposal is vague and doesn't involve a lot of detail or discussion. More information on the technical options/costs for hosting and monitoring, or a strategy for community engagement would make the proposal more convincing. ", "q1r": 2, "q2": "a budget and schedule of work are provided, but I think the goals of the proposal are not specific enough to audit effectively. More measurable metrics for success are required, in my opinion. ", "q2r": 2, "assessor": "z_assessor_67", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The initiative to \"Create a standardised bare metal infrastructure  that can be installed and managed by SPOs.\" with the purpose to \"green\" the SPOs operations, is very welcome. ", "q0r": 5, "q1": "The proposal aims to rely on the collective intelligence of the SPO community. However little information is given regarding a plan of engagement, previous efforts in this regard, level of interest of the SPO community, etc - which are critical ingredients as prerequisites of determining the potential success of this initiative.", "q1r": 3, "q2": "The proposed work is matched to budget but it is not clear that the effort will be worth and no contingency plan suggested in case the SPO community does not agree with the solution \"discovered\" in the process...", "q2r": 3, "assessor": "z_assessor_721", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The problem is almost self-assumed from Large Server House vs. Local Infrastructure. The solution is not really identified how \"localized\" the Bare Metal should be created. Thus, it stated a noble ideally state of sustainable blockchain is out of reach", "q0r": 1, "q1": "\"The project sounds like an interesting idea however it would be helpful if more detail should be added to the plan. Also the Team and structure are very anonymous with only SPO and Engineer as a description. It would be appreicated if we can see the related link/website to more explain about the feasibility. Such an example of criteria to pick local SPO would be more helpful for Voter and community to trust on the feasibility of this project.", "q1r": 2, "q2": "This is the most detail of the proposal mentioning the month by month proposal, however the proposed budget is really up in the air with no concrete explanation of the sum of the expenses to implement the project after getting funded. Also, the most importnat part is how the budget gonna be diveded into team members is missed from this proposal", "q2r": 2, "assessor": "z_assessor_782", "no_vca": 13, "ne": 0, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "This is a noble idea to help SPOs become more independent and self-host their own hardware and infrastructure. Currently, it is common to host infra via third party/cloud-based solutions. While the latter is not a poor option, there are a lot of benefits to self-manage infra. Lower costs, improved energy consumption, and better security (providing the Operator holds the knowledge to correctly configure for best security practices.)\r\nMore details on the pros and cons would help drive better adoption.", "q0r": 4, "q1": "The proposer appears to be running a Stake Pool (ESG). However, there is not much more detail on this, and no directly listed experience within the proposal.\r\nThe plan makes sense from a high level, but it appears to be mostly generalized around meetings and communication. While that is a lot of the work in something of this nature, it would be much more helpful to see other plans around how to adopt/attract SPOs or specific plans centric to the actual bare metal component.", "q1r": 3, "q2": "While there are no metrics in the proposal itself, one can presume them in this case. First and foremost, how many SPOs have onboarded over a period of time. Specific cost goals, or the level of quality on the bare metal. A suggestion would be to list defined KPIs.", "q2r": 3, "assessor": "z_assessor_816", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "Not an expert on engineering, but I can see this is an interesting and potential proposal which can be scaled-up and add value to both SPOs and ADA holders in the Cardano ecosystem. Looking forward to seeing more details and progress of this idea.", "q0r": 4, "q1": "The proposal should include more about the human resources the that the project requires, as well as team members detail info and technical skills/experience, so that it would be easier for readers to see if the team's competence to carry out such project. Overall, this great idea needs more details to express itself.", "q1r": 4, "q2": "The proposal's solution is understandable. However, metrics and KPIs should be added to audit the process.", "q2r": 3, "assessor": "z_assessor_936", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "Create a standardised bare metal infrastructure  that can be installed and managed by SPOs. This way those with green power can own hardware", "experience": "SPO and engineer"}