{"id": 384099, "author": "ben.mesnik", "title": "Mobilize NFT groups via DAO tooling", "url": "https://cardano.ideascale.com/a/dtd/384099-48088", "category": 26237, "amount": 38300, "description": "As NFTs oferecem uma nova maneira excitante de estruturar a governança e o acesso, mas são restringidas por uma funcionalidade limitada.", "funded": 1, "upvotes": 44815534, "downvotes": 9283566, "votes_result": 35531968, "votes_cast": 228, "f6_no_assessments": 3, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "A declaração do problema é clara, assim como a solução proposta. O impacto do projeto, no entanto, é difícil de ser determinado com as informações fornecidas. A premissa é que, de alguma forma, um fundo NFT-FT permitirá uma melhor governança, mas o modelo para isso não é claro. Além disso, o exemplo utilizado (Krause House) não parece ter nenhum plano óbvio de fazer algo além de um DAO que usa fichas de utilidade social. Para avaliar isto mais alto, eu precisaria ter uma explicação melhor de como o uso de NFTs para limitar o número de pessoas envolvidas na governança de um projeto funcionaria. Por que você precisaria ou quereria um NFT para realizar isto? Como isso melhora os modelos atuais? O caso econômico para os fundos NFT-FT descrito na proposta parece óbvio, mas o caso de governança não é e precisa de mais explicações. Por estas razões, não concordo nem discordo que esta proposta aborde efetivamente o desafio.\r\n", "q0r": 3, "q1": "A equipe listou que eles têm experiência, porém não foram fornecidos links ou referências para verificar estas informações. O projeto é dividido em intervalos viáveis. Os próprios objetivos declarados nesses intervalos são curtos em detalhes. Um \"whitepaper\" seria muito útil, mesmo que fosse curto para explicar como o aspecto técnico será realizado. Há uma página do Gitbook criada e também uma discordância, o que é muito positivo, porém não há atualmente informações técnicas adicionais disponíveis sobre nenhum deles que esclareçam melhor a viabilidade deste projeto além do que já está na proposta. O pedido de financiamento divide o custo em horas de tempo de programação. Uma etapa adicional de decomposição do tempo e custo de programação necessários para cada etapa do roteiro ajudaria a mostrar que o custo foi cuidadosamente pensado. Em geral, parece que esta proposta tomou algumas medidas para explicar como chegará aos objetivos declarados, mas faltam alguns componentes importantes. Eu não concordo nem discordo\r\nque é altamente provável que esta proposta seja implementada com sucesso.\r\n", "q1r": 3, "q2": "Um roteiro foi incluído e os prazos parecem realistas. Não há um método formalmente declarado para verificar o progresso, entretanto, devido à natureza da proposta, uma simples página de github deve ser suficiente para realizar isto e está bem dentro do conjunto de habilidades declaradas dos proponentes. Um objetivo declarado de ter o código auditado também cria um meio muito eficaz de avaliar o progresso. A identidade do auditor e o custo esperado seriam informações úteis para acrescentar aqui. Uma métrica simples mas relevante de sucesso é listada e esta métrica deve ser relativamente fácil de verificar. Dados estes fatores, concordo que esta proposta me fornece informações suficientes para avaliar o progresso na realização de seus objetivos declarados.\r\n", "q2r": 4, "assessor": "z_assessor_935", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is a great implementation that mesh the Fungify's NFT liquidity pools with the structure governance and access, because I think this implementation will be core for the Cardano community developers that have experience on Pluts programming and will help great adoptions and allow to growth in the future.\r\nThis proposal is well written and clearly demonstrate  the experience and the team's commitment, guarantees solidity in deliverables, support transparency and accountability for all Cardano community.  This is an important proposal to integrate new conceptual smart-contracts devloping and connect them with the real world business industries.\r\nThe proposal clearly articulates the contest, the problem (new developer ecosystem to write and test smart contracts) and how it will add value to the Cardano ecosystem and for all of the stakeholders.", "q0r": 5, "q1": "The proposer team  is well skilled about the whole context of the proposal as fungify web site demonstrate ( https://sicks0sicks.gitbook.io/fungify/ ).\r\nThe scope of the solution is very well explained (e.g. how the funds will be spent, what features will be implemented, and so on…) and it's convincing.\r\nThe proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon, also in technical realization. The solutions is well documented and there is a running pilot platform for testing. The only thing I miss in this area is that the proposer has not mentioned possible difficulties in adoption processes.", "q1r": 5, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, but no  KPI metrics are shown. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…) The proposal offers a realistic timetable to complete the work and coherent budget with this challenge. Also the proposer has not mentioned possible difficulties, but no informations about market competitors.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 31, "ne": 9, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": " The proposal is to develop \"Fungify\", which supports NFT-FT pools, which enable NFTs to be held in a pool, and participants to convert back and forth between (partial) ownership of an NFT in the pool and a fungible token that can be traded on secondary markets.  The idea is to greatly enhance the available functionality for NFT holders, allowing improved liquidity, using NFTs as collateral for loans, etc.  While it is not explicitly stated, I assume that the the project will be made available in open source, allowing others to use it to launch their own NFT-FT pools.  If this is the case, I think it clearly fits the challenge goal of developing tools for managing DAOs, as well as creating points of distinction from the \"same old, same old\" in other NFT ecosystems.  Another possible interpretation is that the proposers intend to run a *service* using their development, enabling others to launch their own NFT-FT pools on this service.  This would arguably also meet the challenge's goals (one could consider this service to be a \"tool\" others could use).  I'd give this top rating if it were more clearly stated that the plan is to open source the tools and allow others to use it.  I find the linked Fungify gitbook a little confusing on this.  In particular, the paragraph talking about fees (no fee for adding an NFT, 5% when retrieving, where this fee goes, etc.) seems more consistent with a service under the proposers' control than if the tools are open source, which would allow users to experiment with different policies, fee structures, etc., which seems more consistent with the \"experimentation\" vibe of the proposal.", "q0r": 4, "q1": " The team appears to be strong technically, with Haskell/Plutus/CS backgrounds, with funds set aside in the Budget also for a front-end developer.  Beyond mentioning this, there is no specific detail in the proposal in support of these claims.  I could find linkedIn pages for both proposers, which would have been nice to include.  I am happy to take the linkedIn profiles at face value, and they do indicate educational and work experience backgrounds roughly consistent with the claimed skills.  Also, my understanding is that the Plutus Pioneer Program's official participants received class NFTs.  If a Catalyst proposal isn't the place to flaunt those, what is?! :-) The proposal indicates that the project is well under way, currently doing \"intensive internal testing and final touches\".  I do not see links to github repos or anything like that, but if we again take the claims at face value, they indicate good progress that increases confidence regarding feasibility.  My main concern is that there are many non-technical aspects required for success.  In particular, recruiting and onboarding projects to experiments with the platform is literally the only requirement to achieve \"success after 6 months\" as defined in the proposal.  As a fellow geek (PhD, Computer Science), I certainly understand the focus on the technical aspects, but I also know that it's easy to underprioritize other important aspects of a project by being overly focused on the technical core.  I would suggest slightly growing and diversifying the team, even if it means taking some of the funding originally budgeted for the core developers.", "q1r": 4, "q2": "The proposers describe success after 6 months as \"5+ projects experimenting with novel governance models enabled by the Fungify V1 protocol\".  I think that's a reasonable measure.  For shorter-term accountability, the proposers note that progress can be tracked towards that.  I think that's a less compelling mechanism for accountability in the shorter term.  First, there is no mention of how this information would be discovered and disseminated.  I can only think that it would be via status updates and periodic progress reports from the team, but this is not specified or offered/promised in the proposal.  Furthermore, even if the project is wildly successful, it will likely take time before progress towards success is reflected in term of the proposed measure (projects experimenting with Fungify).  I would prefer to see more specific mechanisms for reflecting progress in earlier stages.", "q2r": 3, "assessor": "z_assessor_499", "no_vca": 14, "ne": 7, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Os pools de liquidez e contratos de governança da NFT da Fungify permitirão a exploração de novos modelos de governança e dar poder aos grupos da NFT sobre Cardano.", "experience": "Somos dois primeiros colaboradores da Plutus Pioneers e da Haskell com formação em Ciência da Computação."}