{"id": 384907, "author": "wolstaeb", "title": "DAO Treasury Building Blocks", "url": "https://cardano.ideascale.com/a/dtd/384907-48088", "category": 26237, "amount": 75000, "description": "A obtenção e gestão de fundos DAO de uma maneira responsável é melhor feita com contratos inteligentes, mas isso requer a experiência de engenharia Plutus.", "funded": 2, "upvotes": 87176814, "downvotes": 4146999, "votes_result": 83029815, "votes_cast": 413, "f6_no_assessments": 7, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "An objective observation and assessment of this proposal is probably strongly agreed that this proposal addresses the challenge briefly and purpose very effective. By focusing on generating DAO Building blocks, the proposer aims to provide value for the DAO environment at general and therefore provides a strong and valid impact to the ecosystem as the Building Blocks might facilitate and support the DAO work of many ", "q0r": 5, "q1": "The provided roadmap and the related KPIs/OKRs are well defined and mapped out. The objectives are realistic and the Expertise and Experience of the execution Team makes a successful implementation of the proposal very likely. Additional to that. The proposer got funded in the past already and has proven an accountable activity and execution of previous funded projects. ", "q1r": 5, "q2": "As the proposer is familiar with the current auditing and reporting process of funded proposals, the proposer maintains an active github repository on which we can follow the progress of the proposals execution. The proposer commits in the proposals licensing part to an open source solution which helps the community to audit the proposals success  ", "q2r": 5, "assessor": "z_assessor_362", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This proposal perfectly fits into this challenge. The proposer aims to create a SDK and financing mechanism to provide developers with funding and a DAO treasury management. Providing developers with tools to ease the creation of Dapps for DAOs is a beneficial way forward for everyone. If DAO creation is better on Cardano more devs will use Cardano and the tools the community provides. Overall, this is a very mature proposal and ready to be implemented and will positively impact the Cardano Ecosystem. ", "q0r": 5, "q1": "This team has already successfully delivered numerous proposals since the beginning of project Catalyst. The team has the relevant experience to execute this proposal. The team provides a very detailed plan on how the solution will look like and how it will be implemented. Budget seems sensible and has been broken down in identifiable items. The timeline provided to complete the project seems fair.", "q1r": 5, "q2": "They've gone into great detail explaining how and what they will build on a timeline. Also provided key performance indicators, some that will be measured using github. They provide a tool that will benefit Dapp creation for DOAs. Turning this project into a DOA and making it open source makes it resilient to future challenges and tasks. There is a Github sources mentioned. So the community will be able to track the progress of this proposal. ", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 18, "ne": 3, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "I find this proposal highly in accordance with the challenge aim. \r\n\r\nIt is true that currently we are behind in a DAO race and having such a kit could shift the tide to Cardano side from ETH.\r\n\r\nI think that this is inevitable anyway, due to the fact that ETH is the blockchain of the rich, so who comes first with the alternative solution will be the one who benefits the most.\r\n\r\nRating given 5.", "q0r": 5, "q1": "The plan and the experience provided are reasonable.\r\n\r\nThe team consists of crucial members, which should ensure the successful implementation of a proposal. Also, these are well-known Cardano community members, high creditability. \r\n\r\nRating given 5.", "q1r": 5, "q2": "The proposal contains the detailed roadmap, budget, and key metrics, which are sufficient for audit. \r\n\r\nKPIs are divided into categories, and I am convinced that these are covering most of the measured part.\r\n\r\nAlso, Open Source code is increasing the audit both of progress and the final output.\r\n\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about building a reusable module and SDK for bonding curves enable DApp developers to implement DAO treasury management and fair disbursements. This is a great and interesting idea. The problem is clear, suitable to the given challenge. The solution is clear (with a logical detailed plan). The impact argument is quite convincing. Therefore, based on the given information, I agree with this proposal's impact, I can rate it with a score of 4", "q0r": 4, "q1": "Team profile is provided and described enough for understanding, with suitable skill, experiences but without reference/proof (documents/links,...) for varifying. The budget distribution and explanation should be provided [Technical Writing, Community Engagement, Project Management]. Risk is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This problem and solution's idea is quite convincing to me. However, the plan did not provide me enough information, especially the following: (1) Profile with reference/proof (documents/links,...) for verifying; (2) Budget explanation for some items. Therefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 17, "ne": 2, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "Proposal offers a reusable one-module solution of federation curves and SDKs to help developers implement ongoing project funding and investment into DApps/DAOs. I agree with this suggestion, any Dapp or DAO needs modules to build. However, it should be clarified that these modules for the development of a DAO will fit the criteria of this challenge. One point I have not seen clearly states what basic or advanced functions DAO projects will need and what are the benefits of DAOs using these modules?", "q0r": 4, "q1": "You need to add team identity and professional skills on twitter, githup. Key Performance Indicators, Success Patterns, Licensing, Budget Analysis are the documents you link to on the internet without seeing the highlights of the project. The proposed amount is large, but no information has been found describing how the funds should be used. This makes it very difficult for the reader to evaluate the successful implementation of the project. The team video document that submitted the demo using voting should be provided with more information to see how it works", "q1r": 2, "q2": "When will the project be started and the product will be released, how will the roadmap steps be performed, and metrics such as how many SDKs to serve for which Defi. These should be included in the proposal, except for some of the code I've seen posted on github. smart contract on cardano is not yet developed so how do people who need to know how to use this SDK?", "q2r": 2, "assessor": "z_assessor_697", "no_vca": 14, "ne": 2, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This project is about building an open source module (SDK) for DAO Dapp developers that will facilitate DAO funds management, though a smartcontract implementing Bonding Curves. By adding trust to the DAO fund and community incentives management, Dapp developpers would gain a better engagement of the community. By using this existing module facilitating interaction with the blockchain, DAO Dapp development will be accelerated. This proposal meets the challenge criteria, clearly explains how it will add value to Cardano's DAO ecosystem, and based on above I anticipate a high level impact.", "q0r": 5, "q1": "The 3 core team members are identified, and they gather relevant skills and experiences in the field of finance, software engineering, and blockchain. One is a developer who has been part of Plutus and Atala prism pioneers' program. This team already has been funded in previous funds 2 and 5. \r\nThe architecture of the module and smartcontract is described with a high level of details and good quality reference documents are provided about Bonding Curves.\r\nBased on the level of details on the solution and on team experience, I consider that is is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 5, "q2": "The roadmap is well defined, with 3 main milestones up to 6 months including very precise progress criteria. A 12 month target is also defined, but not in the frame of F7 funding as the requested budget covers only first 6 months of development (further funding needed after 6 months).\r\nBudget breakdown is detailed enough to be monitored when project will be launched. \r\nThe source code will be published under a free and opens source licence.\r\nThis project is crystal clear about what will be done and when, and it will be easy for the community to monitor its progress.\r\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 18, "ne": 4, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "I admit I had to do a lot of reading to hang in on this proposal, Bonding Curves were an entirely new concept for me.  That said, the proposal appears to address the challenge well.  The only thing holding me back from rating this a five rather than four, is that I have some difficulty making the conceptual leap that a DAO *requires* bonding curves (and thus the API) as a first fundamental need.  This might very well just be my own ignorance, and if so, then the proposal could probably address that with a few sentences that focus on what required a logical leap for me.\r\n\r\nOne highlight for me, is that the first key metric listed for this campaign is the amount of ADA coming from DAO transactions.  While I am curious how the bidding language implementation can be deferred until future versions (and successfully abstracted later), what is described in this proposal seems like it would be a net-positive investment if successful.  ", "q0r": 4, "q1": "The team and plan look to be well directed.  I rated a five rather than four because this proposal will require another round of funding either from catalyst or outside to deliver the end product.  I think that's a rational approach, but I'd consider five-star to be essentially zero (unmanaged) risk of not delivering.  I ask myself: \"What do we have if this does not receive further funding?\"  Since most of the funding will go directly into engineering and specification to deliver working code and documentation, it seems like a reasonable risk.", "q1r": 4, "q2": "Metrics are clear and understandable, as well as being largely quantitative boolean assessments rather than qualitative. ", "q2r": 5, "assessor": "z_assessor_975", "no_vca": 27, "ne": 7, "ng": 17, "nfo": 3, "vca_o": 1}], "solution": "Um módulo reutilizável e o SDK para curvas de colagem permitem aos desenvolvedores DApp implementar a gestão de tesouraria DAO e desembolsos justos.", "experience": "Engenharia de software de mercados financeiros, pagamentos em moeda criptográfica, start-ups, dados & Govtech, investimento de impacto. Organizar a comunidade jurídico-tecnológica."}