{"id": 366714, "author": "", "title": "Weekly Swarm Sessions", "url": "https://cardano.ideascale.com/a/dtd/366714-48088", "category": 26106, "amount": 9000, "description": "Catalystコミュニティは、現在の課題やプロジェクトについて議論したり、ブレインストーミングを行うための組織的なスペースを必要としています。", "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "Weekly Swarm Sessions are said to be motivating. Furthermore, they inform and direct participants towards providing a contribution that improves Catalyst's ROI. Thus, the proposal effectively addresses the challenge. Swarm sessions are continuing to positively impact the Cardano ecosystem.", "q0r": 5, "q1": "The proposer team has a proven track record of hosting swarm sessions. It is extremely likely that this will continue - especially with new funding.", "q1r": 5, "q2": "As Swarm Sessions are open and recorded, the auditability of the proposal is to be rated highly.", "q2r": 5, "assessor": "z_assessor_22", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "- I really enjoy the idea of organizing meetings aiming the trade, communication and inspiration. However, there are some aspects which made me think: \r\na) I would like to know how the attendance during these four months (since April) looks like, meaning, how are these meetings growing through time. Can we correlate the number of participants in these meetings with the people who are already participating in other sides of the community (voting, proposing, assessing, etc); how is this project likely to bring people from the community which is not engaged.\r\nb) Let's assume that the people attending these meetings are the people who already participate in some way in the Cardano Community. In this case, is there a way to make sure, or at least be aware of, that the subjects of the meetings are permissible for people willing to engage? I imagine that if people who already has some sort of knowledge are attending every week, the level of the meetings tent to become higher through time and, therefore, the meetings itself becoming more frightening for newcomers.\r\nc) If we scale up a little bit, lets say 10K+ participants, how are we going to menage this – maybe start thinking about transform these meetings, that need a team now to organize everything, to become independent. Furthermore, maybe creating a team (just to introduce the idea) in the east hemisphere to be more time zone friendly.", "q0r": 4, "q1": "- The proposal is well written and, since it's already running, it's clear that is feasible. My only concern is in the scalability and plurality of the engagement. \r\nIt's seems to need some team members to make it happen today. I imagine that maybe it would make this proposal cooler if there was a plan to make this autonomous. E.g.: I'm thinking about the meetings happen by themselves (some sort of environment that the community could release some themes and vote to create a meeting; some rooms to newcomers with some sort of content and some 'mentor' that is chosen randomly (whoever wants to participate in some content put their names and he/she would be selected to organize and help newcomers e.g.)).", "q1r": 4, "q2": "- I think that the proposal would gain if there was a way to confront the number of people who are already engaged with the community with those who are participating in the weekly meetings. This way we would know if we are engaging the inert members from the community. \r\nE.g.: Fund5 = 1k members participating in total; Between F5 and 6 – 1.2K in meetings (not necessarily every week, but in total); F6 = 1.2K+ participants.\r\n- Besides, having these numbers may help the advertising: We will know if we are always achieving the same people or getting into new (old) members.", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 16, "ne": 4, "ng": 8, "nfo": 4, "vca_o": 1, "reply": "Part of impact and feasiblity note is about hypothetical things in the far future and in regards to the entry barrier of newcomers or scalability, we always have an onboarding room or topics of different levels."}, {"q0": "The proposal outlines a very decent blueprint for increasing community engagement and involvement with Project Catalyst. The milestones and key deliverables are all geared toward addressing the challenge of bringing more people into our community.", "q0r": 5, "q1": "The regular Swarm meeting, planned and hosted breakout rooms, and moderation and engagement in the Discord server are all great mechanisms for helping people to on-board into Catalyst and develop the connections and knowledge to contribute meaningfully. \r\n\r\nThe Swarm community has a proven track record, so the feasibility of this proposal can already be verified. As a long time participant with Swarm meetings, I can attest to the the openness and effectiveness of the core team and members. Their method of engagement and community building works.", "q1r": 5, "q2": "The milestones and key deliverables are all really good input metrics that can be tracked and audited, and can be correlated to the KPI or output metrics which are good at measuring the success of Swarm, but I would love to see more metrics to see how their milestones and goals are impacting Catalyst metrics such as number of proposals, successful proposers, etc. that will showcase the quality and engagement magnification that Swarm is really trying to accomplish.", "q2r": 4, "assessor": "z_assessor_285", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "a good idea, yet I find an overlap with \r\n\r\nhttps://cardano.ideascale.com/a/dtd/After-Town-Hall-by-Swarm/366709-48088\r\n\r\ntownhall is weekly if I am not mistaken. So it would mean that you have 1x/week after townhall and 1x/week swarm session \r\n\r\nI think having both will be counterproductive.\r\n\r\nI would suggest maybe to create one proposal regarding your sessions, e.g. \r\n\r\n1. after town hall session + sessions on the weekend if the interest will be sufficient \r\n\r\n2. having weekly sessions + sessions after a town hall if a sufficient number of people will be interested\r\n\r\nI think it would decrease the budget  + increase the effectiveness of sessions, because I see a potential risk in the amount of sessions, that it can happen that it will be too many sessions, and the number of people will slowly decrease. ", "q0r": 4, "q1": "legit team. A group of active members with working proposals and projects. ", "q1r": 5, "q2": "specific information regarding suitability and measuring the success was provided. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "コミュニティに関連したトピックについて、さまざまな分科会を設けた週1回のズームセッションを企画・進行する", "experience": "4月以降、すでに22回以上のSwarmセッションを成功させています。"}