{"id": 368486, "author": "", "title": "Animated Explainer Videos-AIM", "url": "https://cardano.ideascale.com/a/dtd/368486-48088", "category": 26106, "amount": 8000, "description": "Catalystのコンセプトは、理解するのも説明するのも難しいものが多いです。", "f6_no_assessments": 5, "f6_rating": 3.9333333333333327, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=28069"], "media": [], "f6_assessments": [{"q0": "Nice idea that would bring value to the community as more people would be aware on how catalyst and cardano works, which is in line with the campaing. the video draft post in the proposal is clear, easy to consume and didactic, which could certainly help a lot of people.\r\n\r\nIt would be nice to have videos like this directly linked to \r\nCardano official channels (the idea scale portal, telegram communities, communication websites etc). This would need engagement from the proposal with the people who run these channel. I'd also open for suggestions from users/viewers about future videos to see what community needs the most. \r\nFurthermore, There are some similar proposals in F6 (educational videos) and its imporant they can complement each other - if more than one proposed related to video creation get funded, it would be nice to see proposers working together to avoid overlap on the content or on the way things are communicated.\r\n\r\nFinally, I'm not giving a score 5 here becuuse only 2 videos in a time fram of 3 monthts seem not to be enough in order to solve the stated problem (Many Catalyst concepts are is difficult to understand and hard to explain). Also, no communication strategy is explained. How these videos will be spread and communicated within the community and the new comers? ", "q0r": 4, "q1": "Proposer seems to have enough knowledge and experience to make good contents like he's proposing. However, a motion design would still have to be hired and his time availability is not certain.\r\n\r\nregarding plan and budget, it seems 8,000 USD seems a bit overpriced for only 2 videos in 3 months. It would be nice to see how many hours the team intends to work on each of the budget lines. \r\n\r\nA final consideration, it is not clear on the lenght of the videos so I'm assuming something like 2-3 min duration, as it is in the posted draft. If it is much more than that, then maybe the budget and plan make sense.", "q1r": 3, "q2": "There are proposed milestones (1 video each 2-3 months) and some metrics but they dont have targets. It would be nice to see how many views, likes and comments the proposer expects to get. I'd also include shares and if possible, track video quality, possible by doing surveys among viewers.\r\n\r\nIt would be nice to have some risk analysis on quality of the videos, delivery time of the videos and public engagement.", "q2r": 3, "assessor": "z_assessor_298", "no_vca": 7, "ne": 4, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "The proposal highlighted a problem and provided a solution .\r\nI agree.", "q0r": 4, "q1": "The proposal did not provide verifiable links to given experience but the skillset can be seen from the shared demo video. The Implementation plan was provided and was detailed.\r\nI agree", "q1r": 4, "q2": "The proposal provided sufficient information to help audit the success of the proposal but lack details that will help to audit the progress.\r\nI can neither agree nor disagree.", "q2r": 3, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The problem and the solution are reasonable and are related to the challenge.\r\n\r\nThe three themes mentioned cause recurring questions in the community. But I will keep my assessment related to the two that were proposed for funding.\r\n\r\nThe voting system used in Catalyst leads to regular inquiries from new members of the community, the concept of voting power and its application for and against causes confusion for many people.\r\nThe Challenge setting causes confusion and questions on the part of the CAs at each new assessment phase, and in several cases CA assessments were submitted without a full understanding of the differences of a proposal and a challenge setting.\r\n\r\nVisual material can enrich and facilitate the onboarding experience for voters and CAs.\r\n\r\nThe metrics indicated are good impact indicators, but indicators associated with targets were not established, which brings subjectivity to the impact assessment. I would recommend setting targets.", "q0r": 4, "q1": "The proposer is an active member of the community, participated in the development of the Catalyst Landing Page and AIM tools. I would recommend including links and sources to allow checking of the proposer's experience/qualifications.\r\n\r\nI believe that the most important qualification to this proposal is the understanding of Catalyst and the two themes mentioned. Phil is a member with an excellent understanding of the process and the video is a good example of his mastery of the voting system. A motion designer will be hired to create the animations.\r\n\r\nA clear plan compatible with the complexity of the proposal was presented. A realistic timeline was established. There are details on budget allocation and the amounts described are compatible with the required activities.", "q1r": 5, "q2": "There is clarity on the problem, solution and alignment with the challenge.\r\n\r\nA realistic timeline and within the deadline established in the challenge was presented. The metrics described are good indicators for auditing, but the absence of targeted KPIs makes the success assessment subjective.", "q2r": 3, "assessor": "z_assessor_43", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The idea in this proposal is very good. Explaining in an animated video complex concepts is great. If done correctly, this can be beneficial for catalyst users who want to be voters, proposers or CA. It can also attract new users since the videos will be on youtube. ", "q0r": 4, "q1": "The proposer has played several roles in the catalyst program. I think it is not enough, but it's a good start for having enough knowledge on the subject he will treat. The only issue I can see is the lack of a clear roadmap.", "q1r": 4, "q2": "The absence of a clear roadmap and expectations of the number of users they plan to attract is a real issue to me as we don't have enough details to measure the success of this project. For that I give it a 3.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is a much needed one as part of on-boarding new users into our ecosystem. Sometimes you just need to see it to understand it - no amount of reading can replace showing someone visually how something works, even if objects in a video are used to represent abstract ideas.\r\n\r\nThis proposal would be a tremendous tool to help to show to friends, family and others to explain to them the concepts that many of us who have years in the space already understand.", "q0r": 5, "q1": "The budget seems more than reasonable given my experience in content creation, and the proposer seems both credible and competent enough in their ability to deliver a successful result, should this proposal get the funding it is asking for.", "q1r": 5, "q2": "The roadmap is rather simple and straightforward with the KPIs being that a video is complete every 4-6 weeks. This proposal should be very easy to measure for catalyst voters.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "コンセプトを核となる部分に単純化し、アニメーションによる説明ビデオを制作します。", "experience": "この草稿はこちらでご覧いただけます： https://youtu.be/sWDX72p_HPc\n\nグラフィック＆モーションデザインチーム。CAやコミュニティメンバーとしても活躍中。"}