{"id": 368865, "author": "", "title": "Marketing, Marketing, Marketing!", "url": "https://cardano.ideascale.com/a/dtd/368865-48088", "category": 26106, "amount": 20000, "description": "投票権を持つADAホルダーの大半は、投票したことがないか、キャタリストのことを聞いたことがない。", "f6_no_assessments": 8, "f6_rating": 1.5, "videos": [], "media": [], "f6_assessments": [{"q0": "The problem statement aligns with the current challenge and also looks very critical for the challenge, but providing some statistics to show how my holders vs voters in the last funding rounds would have provided more insights in the proposal.", "q0r": 3, "q1": "Marketing is a very broad domain, would have been great to see a detailed plan of how it would be done and how the funds will be utilized in the process. Also, it will be great if some links or docs were attached to see the relevant experience to the proposal", "q1r": 1, "q2": "The timeline of how the proposal will be executed is missing, in future proposals would love to see a detailed breakdown of the timeline and in what way we can expect the proposal will help in adding value to the program", "q2r": 1, "assessor": "z_assessor_208", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "Yes, more ADA holders should know of and participate in Project Catalyst. However, this proposal does not effectively address what the marketing entails. Only \"good marketing\" would have a positive effect on the Cardano ecosystem. It is unclear what type of marketing the proposer envisions.", "q0r": 3, "q1": "I've owned several small businesses myself so it is unclear to me how this translates to promoting Cardano effectively. No identifying information is present. As there is no detailed plan, yet an ask of $20k, it is unlikely that this proposal will be implemented successfully.", "q1r": 1, "q2": "Proposer claims to be able to track ROI yet fails to address what the KPI of the proposals are. The proposal in its current form suggests that it is not auditable.", "q2r": 1, "assessor": "z_assessor_22", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "It's easy to say \"Marketing\", even 3 times, but this is probably the smallest proposal here. You either forgot to put details (then please return in Fund7) or you think that Catalyst is giving free money to everyone. ", "q0r": 1, "q1": "There is neither detailed plan nor sufficient information about proposer. \r\n", "q1r": 1, "q2": "There is neither detailed plan nor sufficient information about proposer. Therefore not possible to make the audit\r\n", "q2r": 1, "assessor": "z_assessor_328", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The problem statement makes sense and is an important problem to solve.\r\n\r\nThere is no plan, the proposal is just a draft, and there is not enough information to assess impact. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document Proposal writing guide in the FAQ section on IdeaScale Catalyst homepage.", "q0r": 1, "q1": "There is no plan, the proposal is just a draft, and there is not enough information to assess feasibility. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document Proposal writing guide in the FAQ section on IdeaScale Catalyst homepage.", "q1r": 1, "q2": "There is no plan, the proposal is just a draft, and there is not enough information to assess auditability. I would recommend using the Catalyst documentation as a reference for a new proposal, more precisely the document Proposal writing guide in the FAQ section on IdeaScale Catalyst homepage.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 3, "ng": 3, "nfo": 3, "vca_o": 1}, {"q0": "While Marketing is necessary, this proposal says nothing about Marketing other than the word marketing. Stating needs without identifying the existing conditions for those needs shows lack of planning.", "q0r": 1, "q1": "This Proposer presents no validation to the claims of experience and entirely lacks a plan to execute any solution", "q1r": 1, "q2": "The proposal lacks any KPI's plans or timeline to execute deliverables, lacking such does not allow for auditing.", "q2r": 1, "assessor": "z_assessor_435", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Although marketing can be useful for this challenge, the  proposer failed to specify any strategy. I give it a 3.", "q0r": 3, "q1": "There is no plan  or strategy to evaluate.", "q1r": 3, "q2": "I suggest that the proposer learn more about how to write a proposal. The weekly town hall is a great place to start.", "q2r": 3, "assessor": "z_assessor_439", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "There is no indication that this proposal can create an impact that will benefit the Cardano system", "q0r": 1, "q1": "No name or Linkedin profile of proposer is given, no team is given, no budget is given. Absolutely no details are given beyond a total amount..", "q1r": 1, "q2": "There are no details given to assess the auditability or accuracy of this proposal", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "It is one of the known challenges that Cardano faces, and the solution is a standard response to problem alike. \r\n\r\nThe proposal did not give enough detail on how the challenge can be tackled and no background on how this problem came to light.", "q0r": 3, "q1": "The proposer has the experience but did not have a sound plan to implement the idea.", "q1r": 1, "q2": "No information was given on this.", "q2r": 1, "assessor": "z_assessor_469", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1}], "solution": "これまで触媒に参加する機会が少なかった地域に向けて、ターゲットを絞った広告を行う必要があります。", "experience": "中小企業のオーナーとして約20年間、複数のマーケティングプラットフォームを利用してきた。フィードバック・アウトリーチでROIを追跡する能力がある。"}