{"id": 369160, "author": "", "title": "Community Site: Development - AIM", "url": "https://cardano.ideascale.com/a/dtd/369160-48088", "category": 26106, "amount": 10000, "description": "このサイトは1000人以上のユーザーをサポートしています。新機能の要望やアイデアがあり、アップグレードが必要です。懸賞金システムはさらに開発が必要です。", "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The tools already developed by this team have become indispensable to the catalyst community, the team has proven passion and expertise in implementing solutions that deliver value to the community.\r\n\r\nWhile it is currently possible to propose improvements to the project through GitHub, the implementation of this system will allow a larger percentage of the community to participate, essentially making it more user-friendly. I consider that establishing a bounty system is the next organic step of the project and is fully aligned with the spirit of decentralization and will allow the project to stay ahead of the game by being proactive and predictive. \r\n\r\nHowever, I do not quite understand how the proposal could be sustainable over time, as it mentions that part of the requested budget will be allocated to the bounties publicly available to the community and it is not clear to me if it will be necessary to request more budget in future cycles, it would be interesting for the project to consider the sustainability factor. \r\n\r\nI appreciate that they have specified the different objectives that the project has with respect to efficiency, relevance, transparency, commitment, user satisfaction, etc. ", "q0r": 5, "q1": "While the team has shown sufficient evidence to demonstrate the skills and experience needed to implement the proposal, it would be interesting to know the profile of the people involved. It is also important to have more detail regarding the number of people involved, estimate hours  and allocated budget to the different work packages for project implementation. \r\n\r\nSince the proposal does not detail how the project can be sustainable over time, it would appear that budget allocation would be necessary in the future, however, there is no mention regarding this in the description. ", "q1r": 3, "q2": "The proposal provides several ways to increase the auditability of the project, which is very positive. However, it would be beneficial to have a more detailed roadmap that allows the community to know the level of progress of the project in the townhalls. \r\n\r\nThe proposal mentions that they want to reach their goals in a period of 3 to 6 months, it would be helpful to have more details regarding the main milestones of the project. Especially when the bounty system would be available to the community in the new interface. ", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 5, "ne": 5, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "This community page is amazing and maintaining and upgrading it will benefit Catalyst immensely. The bounty system together with the feedback from the community will make this site an essential part of Catalyst. The tools on this site have already proven to be super useful. So this project does in fact have a huge impact on Catalyst.", "q0r": 5, "q1": "These active community members have already proven their commitment and they have the necessary experience and passion to get the job done. The budget allocation and plan seems sensible.", "q1r": 5, "q2": "It is clear what needs to be done and how they want to do it. They have set goals with reasonable timelines and indicated certain metrics that they want to achieve and uphold. Also including features on the site itself to enable tracking the progress and success of this project quite easy.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The proposal shows in details how it will onboard new users and will help in growing Project Catalyst. There can be several community sites and incentives. This incentive is already existing and outlined detailed plan for the further development. \r\n", "q0r": 4, "q1": "The team is experienced and already work on the site, so there is big chance everything will go as planned\r\n", "q1r": 4, "q2": "The proposal has a big section on audibility. The only thing which I might suggest is to put more details about who in the team will be responsible for which tasks. ", "q2r": 4, "assessor": "z_assessor_328", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The problem and the solution are within the scope of the challenge.\r\n\r\nOne of the challenges in the Catalyst project is maintaining cohesion and organization amid rapidly growing community and complexity. The large and growing amount of information requires projects dedicated to leading people in the ecosystem and this project is among those initiatives, therefore essential to the Catalyst project and to provide value onboarding for new members in the community and for old members who need to find information.\r\n\r\nThe goals, metrics and indicators presented signal a positive impact on the challenge and on the items described in the challenge brief.", "q0r": 5, "q1": "The team has been developing the Landing Page for a few months and had a proposal approved and funded in Fund 4. The metrics presented show relevant growth and success. Links to repositories have been included, where you can see the team's contributions. I would just recommend including more details about team members and sources for verification.\r\n\r\nThere is a well-structured plan. The Budget breakdown is reasonable and in line with the established goals. A period of 3 to 6 months was established for achieving the goals.", "q1r": 5, "q2": "There is clarity in the problem, solution and alignment of both with this challenge.\r\n\r\nThere is no roadmap, but as development depends on bounties and community participation, it is understandable that it does not exist. Although there is no clear timeline, the goals are linked to the fulfillment time, therefore, they allow to audit the proposal's success.\r\n\r\nGood metrics, PIs and goals have been established, which help the audit. The developed material will be available for access on Github, which facilitates auditing.", "q2r": 5, "assessor": "z_assessor_43", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal has clearly stated a problem that is easily fitted into the challenge. The value added by this project, in the cardano ecosystem is evident. The project ihas already been started and has users, which is great. The website is well done and very useful in my opinion, as a catalyst member. This website can attract new users and/or educated existing proposer, voters, CA, and VCA. The key metrics and goals of this proposal are clearly aligned with the challenge. Since they can always add new contents or functionalities, I think that the project will have no issue scaling in future funds.", "q0r": 5, "q1": "Since the project is already live and atrracting users, this is a solide proof of the capacity of the team. The asked funds are needed to implement new functionalities. The budget is broken down and seems pretty reasonable based on my intuition. Since this is a working product, there is  high probability of a successful implementation of this project.", "q1r": 5, "q2": "This proposal contains a roadmap with milestones and  KPIs . The proposal is written in a precise way,  where, we can clearly understand what is being built and how. This project has enough informations to be audited.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "a page is well designed. If this would be general knowledge, it can definitely increase the value of onboarding. \r\n\r\nIt is very organized, UX friendly, precise, and focused on key information. ", "q0r": 5, "q1": "already running, no objections. Also, the AIM team is legit. Verified by other working projects. ", "q1r": 5, "q2": "I like the stats from the previous periods. Can be used for auditing and measuring success. ", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "改善することで、より多くの情報をコミュニティに提供し、より良い体験を提供し、サイトを価値あるオンボーディング・プラットフォームとして維持することができます。", "experience": "コミュニティのランディングページ、アクティブなCA、コミュニティツール、デザイナー、開発者、そしてコミュニティメンバー。"}