{"id": 369577, "author": "", "title": "Catalyst Buddies System", "url": "https://cardano.ideascale.com/a/dtd/369577-48088", "category": 26106, "amount": 10000, "description": "Catalystにいつ、どのように貢献すればいいのかを理解するのに時間がかかりすぎるし、リソースも多すぎる。", "f6_no_assessments": 4, "f6_rating": 1.8333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal and the solution provided to solve the problem are vague and not presented in a clear and understandable manner. It's very unclear how the Buddies System will benefit from Cardano ecosystem and vice versa.\r\n\r\nThe proposal doesn't fit in the Challenge settings.\r\n\r\nThis system should be meaningful (How do new people learn about Catalyst) and its output should be emphasized. It's unclear what is the subject of the 'personal connection' between the newcomers and the experienced members (what are the domains on which they are experts?)", "q0r": 2, "q1": "There is a time frame with milestones to achieve. There are no evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal. I wasn't able to find anything relevant about 'Alice Sitar on FB.' A direct link to the FB profile will make it easier to find facts about the proposer.\r\nThe proposer doesn't know, in an identifiable manner, the type and number of team members required to implement the proposal (each member should have assigned a role for accountability and organization).\r\nThe budget is not broken down into identifiable items. (detailed cost for salaries and any other resources needed to implement the proposal)\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (What if one stage of the proposal failed to be implemented? Any constrains that can put in jeopardy the success of the proposal?)", "q1r": 1, "q2": "Unclear info about the problem and the solution are provided, and is hard to assess this proposal based on the roadmap and the metrics defined. (realistic targets should be set. There are enough resources available to onboard 500 newcomers?)", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The sentiment of this proposal is good but there is a distinct lack of clarity of how this solution will be implemented and maintained. A lot more information is needed to turn this into a proposal worth voting on.\r\nThe proposer should reach out to a proposer mentor or seek help from an experienced Catalyst member to help with development of this proposal. The proposer looks like they want to help and do the right thing so another (maybe better) option for this  find a similar, more mature,  proposal/project to join.  They state they have implemented nothing similar elsewhere, more details of how this worked could  be useful to the community.", "q0r": 2, "q1": "Much more detail is required on how the various parties are engaged. It looks like 2 google forms is all that is required to get this going. If that's correct a POC should already have been developed and tested . This would provide the feedback that is proposal need to develop a sensible plan.\r\nThe budge request is a random number without any justification.\r\n\r\nHaving spent many years writing/reviewing business cases, running project review board and assessing project briefs i am use to dissecting complicated requests for money.", "q1r": 1, "q2": "we have the start of some success metrics but they need to be realistic and smarter.\r\nA POC would help estimate realistic number. To make this smart we need to know what is meant by a 'new member'  (a voter, proposer, CA, someone who attend 1 townhall), the metric is too loose at the moment.", "q2r": 1, "assessor": "z_assessor_45", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "It's a clear and simple proposal which does address an important issue within the  challenge, by aiming to move new people towards *meaningful* participation more quickly, and help them \"find their tribe\" within Catalyst. The problem statement is accurate (as someone relatively new to Catalyst, I agree it can be impenetrable at first; and while direct personal connections definitely help, there is a problem that Catalyst expects new people to build those personal connections without support, which probably unfairly privileges new people who are neurotypical, extroverted, and comfortable with e.g. Discord and Telegram). So a proposal like this could potentially have a really significant impact  in diversifying who takes part meaningfully.\r\nBut there is an issue with scalability. One aspect of the project is naturally scalable – people who are successfully \"buddied\" can go on to buddy someone else. But the other aspect (i.e the work of matching people to a buddy) would definitely need some automation in order to scale, and the proposal doesn't address that. \r\nPerhaps it'd be better if the proposal framed itself as a pilot, with connections made manually for, say, 100 people, and the results assessed, to see whether the outcomes are better than the current more generic supporting of new people that isn't targeted to their particular interests?\r\n", "q0r": 4, "q1": "Although the basic idea is sound,  the proposal would need to be a bit more developed for me to feel sure it is feasible. \r\nThe budget is quite vague, and needs more breaking down, particularly around the tasks that the programme  manager will do and how they'd be costed. The time-plan doesn't address how the project will scale successfully to 500 buddies, without any automating of the process of matching people up. \r\nAnother big omission is an awareness of risk – and there are a couple of significant risks involved. For instance, what safeguards would be put in place if someone was harassed, or faced creepy behaviour from their \"buddy\"?; and data proyection (in order to be matched well, people would need to at least have the option to give quite personal info if they wanted to, so how would this be stored securely?); and how would the limits of the \"buddy\" relationship be defined (if it's not clearly delineated, there's a risk that people won't want to become a buddy, fearing that they might end up feeling responsible for someone else's participation long-term).  All these risks could be mitigated, but for the proposal to be feasible it would need to describe how it would do so. \r\nAnd although the proposer mentions that they have implemented a similar system in a start-up, they give little detail – so a bit more info about it would make it clearer that that they have the skills to implement it here.", "q1r": 2, "q2": "The metrics suggested are clear and simple in terms of numbers of \"buddies\" created\", but the idea of a \"20% difference between new members who have been attached a buddy to those who did not\" is not clearly articulated – a difference in what way? measured how? I can see various ways we **could** possibly measure this 20% difference in terms of things which indicate meaningful participation, and which perhaps represent an earlier stage of engagement than actually becoming a CA or a proposer – things such as the new person getting  some level of engagement on Discord and Telegram rather than just being ignored when they \"speak\";  feeling able to speak in breakout rooms after Town Hall rather than only passively listening; making comments and engaging on Ideascale; going on to buddy someone else; etc. But as none of these metrics are  going to be measured, at the moment there's not enough info to audit the project's success.\r\nI would add that I think this is a promising idea that addresses issues that I don't think Catalyst always addresses very well; so if it doesn't get funded this time, I hope the proposer isn't put off, but gives it a bit more development and tries again.\r\n", "q2r": 2, "assessor": "z_assessor_540", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This proposal does provide support to newcomers and gives them a buddy to lean on which could lead to more meaningful participation if members are doing things together and have a resource they can rely on.", "q0r": 3, "q1": "They give no experience besides that they have created a similar system for a startup before. No details on that startup or data from the implementation of that project. No real plan for follow through, needs more details.", "q1r": 2, "q2": "Besides gauging increased match \"buddy\" community members, it does not measure if we have more meaningful participation in catalyst or how we would go about measuring that.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "個人的なつながりを持つことで、オンボーディングの時間を大幅に短縮することができます。", "experience": "私はスタートアップでこのようなシステムを作り、とてもうまくいっています。\n\nアリス・シタールのFB"}