{"id": 382503, "author": "pia.c.andrews", "title": "Citizen's Ledger", "url": "https://cardano.ideascale.com/a/dtd/382503-48088", "category": 26249, "amount": 100000, "description": "Gov decisions/actions are taken about people all the time. How could we create a personal record that's immutable, holistic & appealable?", "funded": 0, "upvotes": 27919372, "downvotes": 28020233, "votes_result": 100861, "votes_cast": 133, "f6_no_assessments": 5, "f6_rating": 3.4666666666666672, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal itself is a wonderful idea to assist common people in one place which has always seemed to be concealed from them. The government rulings and the rationale behind their actions usually go unquestioned. The proposal tends to address this issue to a fair extent. Furthermore, the secondary stage of the project being the implementation of security to the records using private key add more credibility and gain of the user base. Therefore an application such as this will surely progress the country towards sustained prosperity. With plans of releasing the MVP in the presence of government authority and media will help the application gain the trust of the people and increase the approval rating in turn increasing the Cardano ecosystem traffic and overall worth. This could also lead to multiple other contributions from Oceania which still seems to be well behind Europe and North America in acceptance of the blockchain. The impact the proposal could have on successful implementation is immense.", "q0r": 5, "q1": "Despite being a great proposal, the proposer seems to miss out on some key details. The proposer definitely makes an elaborate introduction of the team and the members are no doubt competent to do something of this sort. However, the proposer does not provide clear action plans of how the team will be going about the implementation. Also having requested a budget of about 100k there is no transparent breakdown of what it will be used for. The proposer indeed mentions that technical aspects are still under discussion, but little insights into the action plan and what the success would look like will help the community review and undertake this proposal in a positive way. Also to add, there is no clear evidence about the research done into identifying the risks and challenges that the team might face. Hence I feel a score of 3 would do justice to the amount of information available at hand to draw assumptions of whether or not the proposal shall have fruitful implementation.", "q1r": 3, "q2": "I have to disagree with the entirety of information provided regarding the metrics and KPI the auditors could use to monitor the proposal. There exist no plausible metrics to track the usage of the application, transaction volume, outreach of the Dapp which remains to be essential as mentioned in the campaign brief. With no financial blueprint and the expected game plan, the proposal looks weak implementation-wise.  I strongly feel a great idea such as this would be done justice if a moderate amount of effort is put into drawing a well-outlined action plan with gradual success definitions and a crystal clear monetary breakup. Given the above rationale, I would give a score of 2 out of 5 for the clarity the proposal provides to the community and the auditors.", "q2r": 2, "assessor": "z_assessor_751", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of tracking government decisions or actions about an individual by creating both a centralized and a decentralized ledger system which partially aligns with the challenge goals but is not a foundational registry solution listed in the challenge.   \r\nThe proposal could be improved by articulating the value to Cardano ecosystem, articulating how the solution scales to address future challenges, providing key metrics and goals that closely align with the challenge, either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.\r\n", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of team composition, realistic timetable and plan, and detailed technical explanation of the solution.\r\n\r\nThe proposal's feasibility could be improved by evidence of experience (twitter accounts and proposal blurbs are insufficient), budget that is broken down with enough details to determine if reasonable and a challenges and risks section.", "q1r": 3, "q2": "The proposal includes a roadmap, milestones, time horizon (very rough) and a clear understandable description of the targeted problem\r\nTo improve the proposal include metrics/KPIs to measure proposal success and a detailed description of the solution that addresses the problem.\r\n", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 21, "ne": 2, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "This project seeks to encode \"key\" governmental decisions as well as analysis into the blockchain. This, in theory, would go to increasing transparency in government thereby improving citizenry. However, this project does not meet the legal structure of property and property law preferred intent of the  Brief. ", "q0r": 4, "q1": "This plan does not lay out discrete milestones or operational determinants, the success measure is amorphous:\r\n \"Success will be defined by takeup of the approach in local identity solutions, and willingness from at least one government department or company to write their interactions to a Citizen's ledger.\" For instance, left unstated are answers to questions like: how large a deptartment? how many local identity solutions uptaken? how will the team get around the fact that there is no global standard for decisions traceable back to law, what will make this different? how will this be done?: \"we will prototype a centralised ledger approach which could be a government or community held approach, that uses public keys to write a record \"", "q1r": 2, "q2": "the information provided is not sufficient because this is not defined by specific, auditable, measurables available to the community. \"Success will be defined by takeup of the approach in local identity solutions, and willingness from at least one government department or company to write their interactions to a Citizen's ledger.\"", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 16, "ne": 2, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Great idea. This would contribute to informing the citizenry on government decision that is impacting their lives negatively or positively. I am glad the idea seeks to trace decisions back to the law, my concern is what would be done if government decision falls out of the authority of the law? I think an integration of community activism would be helpful to engage decisions with no locus. ", "q0r": 4, "q1": "No two ways about the team's experience. However, the proposal has left out essential apects. How would you define success? What are the outcomes or project deliverables?", "q1r": 3, "q2": "The team should indicate how they intend to document their activities for easy auditing. I think a breakdown of the budget would be useful too.", "q2r": 3, "assessor": "z_assessor_727", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The proposal outlines the problem and how it needs to be solved concisely. A Citizen's Ledger or Gov ledger would add tremendous value to both Cardano's ecosystem and the blockchain space as a whole. Making governments accountable and more accessible to audit brings us one step closer to reducing the information asymmetries and empowering its citizens. Though a complex and challenging task to achieve and integrate correctly, The proposal key metrics align with the proposal challenge setting and can scale if implemented successfully with the intent that community members will also be able to utilise in the future.", "q0r": 5, "q1": "The team has an understanding and in-depth experience of the problem and current systems we have in place, particularly that of NZ law and Regulations; with that in mind, I have high confidence that we will see this implemented successfully.", "q1r": 5, "q2": "There is a clear description of the problem and solution here, with a general overview of its identifiable measures of success based on the milestones. However, its milestones are less detailed than its sister proposal Regulation/legislation as code repo. ", "q2r": 5, "assessor": "z_assessor_903", "no_vca": 23, "ne": 2, "ng": 15, "nfo": 6, "vca_o": 1}], "solution": "We propose to build a standards-based consistent way to record key gov decisions/actions (+explanation) onto a personal ledger.", "experience": "Core team of 3-4 dev/design hosted by VentureCentre, with access to self-sovereign identity team and records management/standards expertise."}