{"id": 382595, "author": "d2haze", "title": "Municipalism via Cardano", "url": "https://cardano.ideascale.com/a/dtd/382595-48088", "category": 26249, "amount": 92160, "description": "The 1st step to self-governance is local collective ownership. No scaleable system exists that enables this form of community collaboration", "funded": 0, "upvotes": 23916442, "downvotes": 21420674, "votes_result": 2495768, "votes_cast": 93, "f6_no_assessments": 4, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal seeks to solve the problem of self-governance by creating a platform for collective ownership of property which partially aligns with the challenge goals but is not a foundational registry solution listed in the challenge. \r\nThe proposal could be improved by articulating the value to Cardano ecosystem, articulating how the solution scales to address future challenges, providing key metrics and goals that more closely align with the challenge, either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of budget is broken down and reasonable (very high level estimate provided), realistic timetable and plan (needs more detail), detailed technical explanation of the solution and a challenges and risks section (government bureaucracy listed as challenge). \r\nThe proposal's feasibility could be improved by including evidence of experience (linkedin profile), team composition and resources required.", "q1r": 3, "q2": "The proposal includes a roadmap, milestones, time horizon, a clear understandable description of the targeted problem and a detailed description of the solution that addresses the problem.\r\nTo improve the proposal include metrics/KPIs to measure proposal success. The proposal calls for the proposer's company, Plasia, to purchase the real estate on behalf of the would be collaborators then Plasia creates the legal entity to which the company will sell the property. Plasia then may optionally manage the property for the collaborators. There is a lot of potential conflict of interest in this process and no auditing of Plasia is included in the proposal.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 20, "ne": 5, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "Relation to personal qualifications: Due to both my past political engagement and having lived in different countries with different approaches to administration on a governmental level, I have experienced, discussed and thought about this topic a lot. In addition to this, I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal identifies an important problem and defines an approach that might utilize blockchain technology to participating in solving this problem. If successfully implemented, it might be of great benefit to the Cardano ecosystem. Unfortunately the proposal does not formulate explicit key metrics. Scalability should be doable with this kind of proposal if it is implemented correctly.", "q0r": 4, "q1": "The proposer is relatively new to Catalyst and does not provide verifiable credentials on himself. However some of his partners can be found. His company plasia however is not linked and I could not find it, thus it is difficult to assess whether he is up to the challenge. He mentions a couple of people in his attachment, but makes clear he is going to try acquiring more people for the project. \r\nThe budget is only derived from the developing time of a banking app, and calculated with a pretty high hourly rate. This indicates that the proposer has not considered the development efforts of his specific proposal yet but just makes an estimation. What however is appreciated is the fact that this proposal actually has a risk buffer planned into the budget.The proposal offers a detailed timetable/roadmap to complete the work. Technical details or resources used are only described very briefly. Feedback: Try detailing your implementation plan, also the technical requirements. This will make your budget and your generalproposal a lot better and more credible. Having such a good idea, you should not waste the funding opportunity by deficiencies in your proposal.", "q1r": 3, "q2": "The problem and solution descriptions are comprehensible and the solution is very detailed. The roadmap is step by step detailed and auditable. Only negative thing is hat no explicit metrics/KPIs are mentioned.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "This proposal addresses the proposal but not yet in a strongly effective way, for instance, why is it first necessary for Plasia to purchase the asset to sell it to the yet-to-be-defined blockchain organization? Furthermore, if this work can be done without a blockchain solution, why is a blockchain solution used (please see Picaso's business model, https://www.pacaso.com/) ", "q0r": 3, "q1": "This is a large and intricate project, it is unclear the professional background and skill portfolio of the proposer and unmentioned team. There are significant unmentioned hurtles, like what happens if somebody wants to sell their stake? Who/what is directly liable for the property?  ", "q1r": 2, "q2": "The information provided does not include a description of success, therefore the community is not able to audit success or and progress to it. ", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 16, "ne": 0, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The proposal suggests developing a platform where there is collective ownership of buildings. More specifically it appears the location of focus will be in the United States. The wealth gap has become an increasing issue of the recent decades with gaps appearing to be widening. One of the knock on effects of this is on the difficulty of lower income households being able to purchase property. A platform that makes property more accessible to people who need this support could be of massive impact if executed well.\r\n\r\nThe proposal doesn't explicitly come under the challenge brief by being directly linked with government services and relates more closely to a DApp & integration type of proposal.\r\n\r\nUnfortunately due to this not being clearly a solution for the nation building challenge and there not being clear examples being provided of where assets have been tokenized in the United States it is hard to state that this proposal will have a high impact. With more evidence around this and better position in a different challenge brief a high rating could be provided.", "q0r": 3, "q1": "The proposer does not provide information on the team involved in the proposal nor any evidence towards their background such as a LinkedIn profile. The budget is not broken down into where the funding would be allocated and any justifications.\r\n\r\nThe proposer mentions they want to sell/tokenize the asset. For this to happen a thorough understanding of the regulation is needed along with details on where compliance is needed if this activity is permitted. Resources have not been provided on the legalities of this proposal which makes it difficult to know whether it is feasible. The proposer has been honest and mentioned some of the existing platforms who only deal with accredited investors and the difficulties from a legal standpoint. \r\n\r\nThe proposer has shown no evidence of having the technical capabilities to execute this proposal for the DApp being suggested. \r\n\r\nDue to this it appears very unlikely that this proposal is currently feasible and requires a lot more information and evidence to help improve the confidence that it can be executed.", "q1r": 1, "q2": "A roadmap is shared of how the proposer intends to purchase the assets and make them available however doesn't provide much detail as to how the DApp would be implemented. No KPIs or success objectives were provided. Although there is clarity in what the proposer is trying to achieve there is very small evidence that the community will easily be able to track the deliverables of this proposal as it currently stands.", "q2r": 1, "assessor": "z_assessor_758", "no_vca": 16, "ne": 2, "ng": 14, "nfo": 0, "vca_o": 1}], "solution": "Leverage Cardano blockchain to empower local communities with a scaleable platform designed for collective ownership across the globe.", "experience": "Community organizer, President and founder of two investment clubs, tech focused entrepreneur, expert on Race, Power, & globalization."}