{"id": 383284, "author": "glaxas", "title": "Catalyst Circle Treasury Management", "url": "https://cardano.ideascale.com/a/dtd/383284-48088", "category": 26248, "amount": 11400, "description": "Catalyst Circle需要支付运营成本和Circle成员所履行的职责。交易需要被记录和管理。", "funded": 2, "upvotes": 70138850, "downvotes": 3679374, "votes_result": 66459476, "votes_cast": 142, "f6_no_assessments": 5, "f6_rating": 4.266666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "由于Fund7没有针对催化剂的挑战，我同意这个提案是在解决挑战。根据我对该提案的理解，它不是为了扩大我们的社区，而是为了提高 \"催化剂计划 \"的寿命和效率。具体重点是处理 \"催化剂圈 \"的经济方面。该建议确实解决了一个非常重要的方面/问题，并提供了一个潜在的长期解决方案，即创建一个系统，使Cardano圈的 \"财政 \"处理更容易管理和透明。无论是对于催化剂圈的当前一代，还是未来的一代。该建议提出的解决方案是一个长期的解决方案，它涉及到对催化剂 \"机器 \"的整体理解，并希望为每个参与者优化效率。", "q0r": 4, "q1": "该提案介绍了核心团队，该团队似乎在Cardano社区内有经验，尽管目前的团队背后没有资助提案。他们似乎正在积极完成Fund6的资助提案，但在这里，如果有一些链接或进一步的 \"证明\"，表明实际的团队将参与其中，将会很有帮助。目前，提供了LinkedIn的简介，但其中一个不工作，其余的也不能说明在会计和商业运作方面的经验。如果提案包括这些，团队将以更可信和清晰的方式呈现。我绝不是一个会计师，但从我管理组织和社区的经验来看，我确实知道有专家在经济方面工作的重要性。关于如何管理Cardano Circle财政的建议是以一种非常清晰的方式，一步一步地提出的。由于该建议专注于一个较短的时间框架（3个月），预算分配似乎是合理的，只要求大约5%的总挑战预算。预算分配还包括估计工作时间和资源分配，这进一步提高了提案的可信度。我同意该提案极有可能成功实施。", "q1r": 4, "q2": "路线图非常清晰，跨度为3个月，基本上到下一个基金（8）。为了使其更加清晰，我希望看到所有里程碑的估计时间框架，因为唯一提供的时间框架是第一个（12月12日-2021年）。该团队承诺将创建的系统作为开放源码，这是一个增加项目透明度的绝佳方式。除了通过GitHub之外，社区将如何能够跟踪发展？要找到更 \"开放 \"的成功衡量标准有些复杂，因为它是为社区中很小的一部分人创建的，但通过社交媒体渠道或TownHall等分享系统的测试进展或开发更新如何？另外值得一提的是，如果我对提案的理解正确的话，这个提案的团队可能会随着下一个基金而改变。这意味着，如果开发团队在不同阶段都会发生变化，那么透明度是最重要的。我可能误解了该提案，但也许该提案可以以更清晰的方式介绍长期计划？也许包括一个不那么详细的未来基金（8-9）的愿景计划，以邀请社区参与到长期计划中。最后，我希望看到一个简短的部分，团队描述在发展阶段可能出现的一些挑战或风险，以及他们计划如何处理这些问题。观点在任何情况下都是很重要的，而作为社区成员，这将使我对该提案更有信心。我既不同意也不反对该提案为我提供了足够的信息来评估实现其既定目标的进展。", "q2r": 3, "assessor": "z_assessor_349", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This is a proposal related to supporting accounting, spending, compensation, salary... tools on the cardano platform. An essential support tool for any company or workgroup that wants financial transparency, financial organization in a more methodical, professional and automatic way.", "q0r": 4, "q1": "The proposal is practical and highly feasible, but it is necessary to specify more clearly how to deploy it to the market to serve the majority of the community, as well as the relevant experience of the working team.", "q1r": 4, "q2": "In the proposal, it was mentioned that the code is completely public on github, so the community can check the project progress as well as the implementation progress of this project.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "The \"Catalyst Circle Treasury Management\" proposal addresses the objective of challenge which is to pay operating costs and circles for their performed duties. The Catalyst circle is important for the Cardano Ecosystem and that the team has contributed time and effort to make this possible. ", "q0r": 5, "q1": "The team is comprised of strong 3 team members from Catalyst Challenges. The budget is reasonable and broken down in detail. They also updated what the community can expect after Fund 7 and the handover for fund 8 treasurers. The proposal is reasonable and pave the way for future development.", "q1r": 5, "q2": "The roadmap with milestones/KPI are available so the community can keep track of their progress. The system that they plan to build along with the documentation in GitHub will be open source and  available for public usage.  ", "q2r": 5, "assessor": "z_assessor_653", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is about building a system that makes CC operations frictionless and auditable when it comes to resource allocation. This is a great and meaningful idea. As we know, the Catalyst Circle plays an important role the Cardano's Governance as a whole. The problem convinces me, and is clearly described, and explained in detail. The solution is clearly defined showing a potential impact on the Cardano ecosystem in long term. Therefore, I strongly agree that this proposal effectively addresses the challenge, and can rate it with a score of 5", "q0r": 5, "q1": "Proof of feasibility from the team profile can be seen, with the external links for verification. The budget is provided with a clear items structure, and explanations of the calculation base. Risk is not defined. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of information with proof for verification. It would be better if risk/challenge (with mitigation) is added.\r\nBased on the given information, I agree with this proposal's auditability, I can rate it with a score of 4", "q2r": 4, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The proposal addresses the issue of  managing the Treasury fund's financial operations and obligations in a simple and clear manner. . They state that by developing and implementing a treasury management system they can help ensure that money provided by Catalyst is spent in a manner that is auditable and transparent. This seems to be something that will definitely support the Cardano/Catalyst ecosystem. This is very important, and therefore I rate this proposal 5 for impact.", "q0r": 5, "q1": "The team members are experienced in business and accounting and links are provided for their LinkedIn accounts. The budget is broken down and understandable. They have requested $400 to build the accounting system from scratch. I don't know if this will be enough, but they do mention that they might need additional funds in future. They have set out a plan with actionable tasks and a timeline and it seems realistic to me. The are already busy testing the solution and mentions that it is going well.", "q1r": 5, "q2": "The Proposer mentions that the \"system that is being built will be open source and available for the community to use elsewhere.  The onboarding documentation for future treasurers will be public as well as part of the CC github Playbook\". This ensures that the progress of the project can be followed and makes the project auditable. The KPI's given makes sense and will also provide the community a way to track how the project is going. Maybe provide a space where the community can already now start tracking progress.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "建立一个系统，在资源分配方面，使CC的运作无摩擦，可审计。", "experience": "我们的团队由具有会计和商业运作经验的社区顾问和挑战队成员组成。"}