{"id": 384361, "author": "heinz.gassner", "title": "Industry Presentation Kit", "url": "https://cardano.ideascale.com/a/dtd/384361-48088", "category": 26248, "amount": 7500, "description": "行业中只有少数人了解区块链对其业务未来的影响。YouTube频道没有起到作用", "funded": 2, "upvotes": 82267782, "downvotes": 3611305, "votes_result": 78656477, "votes_cast": 202, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": "The proposal aims to prepare a \"generic presentation kit that can be used as Consulting Artifact\" for conducting training and awareness sessions focusing on industrial experts. There is a massive misconception about Crypto and its utility. However, intelligent industrialists and entertainers are likely to decode the use-cases without elaborate campaigns. However, ready-made and well-made presentations to pitch Blockchain technology will help in many instances. ", "q0r": 4, "q1": "The proposing team is very strong and has vast experience in this domain. They will be able to complete the proposal in a nice manner. ", "q1r": 5, "q2": "The fund requested is reasonable and the KPI is detailed which also includes showing how many people were consulted to create the presentation. I feel the proposal is highly auditable and success can be measured. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "The proposer is suggesting making a manual for Distributed Ledger Technology (DLT) and blockchain. It's true that in the industry today there are usually only a few people in a company that are familiar with Blockchain technology. By assembling a kit that amplifies the use-cases for blockchain technology and presenting it to the Industry of today it could create a huge influx in the economy. ", "q0r": 5, "q1": "This is one impeccable proposal. Reading through it you see the professionalism in the team. The background provided about the team members makes them more than qualified for this project. Especially since this is a start-up from F6. We get a well-detailed roadmap and funding breakdown. The only thing I'm a bit worried about is the funding, this is a very lean funding amount as stated by the proposers as well but is it enough for this proposal?", "q1r": 4, "q2": "We get a well-documented proposal that fills all the holes for auditability. The roadmap provides transparency on the project and together with the KPIs, we get a clear view of what the team wants to accomplish. In the roadmap, we see successes defined by the proposers that are in line with the proposal. What we don't see is some risk management, what if it takes longer to develop presentation models than expected? Or if it takes longer to search for the information needed for the presentations? These are some questions to think about because of the lean budget as stated in the above rationale.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 18, "ne": 5, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal addresses the real world challenge very effectively and delivers a thorough plan to establishing a modular DLT/Blockchain presentation & training framework for industry. The initial focus of the project is in manufacturing industry but the approach can be scaled to other industries. The adoption of blockchain technology in traditional industries is still very minimal and in my experience as expert in manufacturing, most people don't know how the blockchain technology works hence preventing the adoption. This project provides a solution to the problem and I am very confident that it can pioneer blockchain technology adoption by the traditional companies.\r\n", "q0r": 5, "q1": "The team members consist of mix industry experts and academic student and given the combined experience presented by its team member, it is highly likely that the project can be a huge success. Deliverables, timeframe, and goals of this project are very achievable. Furthermore, the team provides milestones and detailed roadmap for three, six, and twelve months and requested a reasonable budget. Problem statement and solution delivered match and both address the challenge effectively. ", "q1r": 5, "q2": "The proposal includes detailed roadmap, milestones and deliverables. Detailed budget breakdown is provided by the team. KPI and Success criteria are relevant and feasible, making it not only auditable but also realistic. My only suggestion is for the team to share the downloadable presentation and video clips for free to the Cardano community so that it can have greater impact for Cardano adoption.\r\n", "q2r": 5, "assessor": "z_assessor_643", "no_vca": 17, "ne": 6, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "This proposal focuses on establishing a modular DLT/Blockchain presentation & training framework for the industry. This is a great and interesting idea. I can agree with the provided problem statement, however, for better understanding, it should be explained more in detail for increasing objectivity [why it is necessary ? Giving argument and example of why \"YouTube channels don't do the job\" ?]. The proposed solution is clearly defined, fits the challenge, as a result, the potential impact on the Cardano ecosystem as a whole in  long term can be seen. Therefore, based on the given information, I agree with this proposal's impact, I would rate it with a score of 4", "q0r": 4, "q1": "This team [DLT360] profile shows suitable skills and experiences for implementing this proposal. This is proof of feasibility from the team profile. The budget is clear and explained in detail. However, the risk is not defined [or there is no risk forseen?]. Therefore, based on the given information, I agree with this proposal's feasibility, I would rate it with a score of 4", "q1r": 4, "q2": "There is a lot of information provided, with links for verification. Therefore, based on the given information, I strongly agree with this proposal's auditability, I would rate it with a score of 5.", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1}], "solution": "我们利用我们团队的知识，为行业建立一个模块化的DLT/区块链介绍和培训框架。", "experience": "超过30年的行业领导经验与直接接触特定领域专家相结合"}