{"id": 381555, "author": "tpena", "title": "Infrastructure & Blockchain", "url": "https://cardano.ideascale.com/a/dtd/381555-48088", "category": 26249, "amount": 25000, "description": "腐败阻碍了发展。在发展中使用区块链作为一个傻瓜式的过程。\n其目的是利用区块链进行去中心化。", "funded": 0, "upvotes": 15680037, "downvotes": 21384282, "votes_result": 5704245, "votes_cast": 93, "f6_no_assessments": 6, "f6_rating": 2.722222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "I liked the overall idea, the project proposal, and the overall defined activities and milestones sounded like a rational idea to me, not only for the requested investment value but also for the overall project proposal. It would be perfect to have a benefit-opportunity mapping that gives granular details about the potential of the idea and how it could generate value.", "q0r": 4, "q1": "This proposal will be implemented successfully based on the experience and plans of the proposing team, though I suggest more information be included within the proposal regarding the relevant experience of the proposer in managing initiatives of this nature, as well as a more detailed plan and budget for the tasks described.", "q1r": 4, "q2": "This proposal has value, and its implementation would have great benefits. If technology improves over time, more thought might need to be given to verifying ROI. I understand we need to work with these changes but also identify the life cycle of each technology implementation and the returns. ", "q2r": 4, "assessor": "z_assessor_243", "no_vca": 18, "ne": 3, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "This proposal seeks to solve the problem of corruption in government funded projects by creating a decentralized government project management solution that includes a land registry which aligns with the challenge goal of a foundational property registration dApp. The proposal does a good job of articulating how the solution scales to address future challenges. The proposal could be improved by articulating the value to Cardano ecosystem and providing key metrics and goals that more closely align with the challenge. ", "q0r": 4, "q1": "The proposal articulates the feasibility aspects of technical explanation of the solution (needs more details). The proposal's feasibility could be improved by evidence of experience (linkedin profile or website), team composition, a reasonable budget breakdown, realistic timetable and plan, resources required, and a challenges and risks section. The proposal selects a community where \"there is limited information about this community\" which seems to be a poor choice based upon info given. A better choice would be a community that the proposer has information about, ties with and which has a local authority willing to work with the proposer.", "q1r": 2, "q2": "The proposal includes a clear understandable description of the targeted problem and a detailed description of the solution that addresses the problem although these two could be much better aligned. Consider a proposal for just the land registry phase (with future phases funded in subsequent rounds) and making the problem description about the need for land registry information; to better align solution, problem and challenge. To improve the proposal include a roadmap, milestones, time horizon and metrics/KPIs to measure proposal success.", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 19, "ne": 4, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "The idea to use the blockchain technology to fight corruption is a good one, specially in african countries where corruption causes a lot of harm to the local populations. A transparent allocation and distribution of funds are needed and critical to save those countries. The concept is good but I would suggest to the proposer to be more specific on what the they are trying to build precisely. The proposal can also be structured better to include clear goals and metrics. ", "q0r": 4, "q1": "This proposal is not clear on what is being built. The concept of using blockchain to fight corruption is really good but the proposer should articulate  the solution clearly in a form a product such a dapp or anything it might be. Furthermore, I suggest to proposer to add evidence of skills and experiences as well as a budget breakdown . To finish my advice to the proposer is to study previous funded proposals that can be use as reference to improve the proposal.", "q1r": 3, "q2": "The proposal will not be easily audited as  it misses some critical information. I think that the proposer should add a roadmap and reasonable milestones. Metrics and KPIs can also help the auditability of this project. Altogether, the concept of this proposal is really good, but its structure is really wak and should be improved. Applied the advices above can help this proposal increase its chances of being funded in next rounds.", "q2r": 2, "assessor": "z_assessor_439", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "This proposal, although it could be at the base of a great project, does not address the challenge as it is reduced to one limited case study and it could not be applicable to a broader variety of cases.", "q0r": 1, "q1": "The proposer seems experienced from the technical and financial management point of view, although the proposal brief lacks of relevant details on how the GIS data would be structured and used effectively by the local orgnizations and why the blockchain would work better than a database exploited at a regional level. If the register would be available globally, certain countries could exploit it for military purposes and that could mine people security.", "q1r": 1, "q2": "There is no clear timeline outlined and the budget allocation does not come with a breakdown of costs for different items.\r\nIt could be helpful to provide a vision on the time needed to collect data to build the property register/database mentioned in the brief, what is the cost of resources associated with it, and if the property would be identified as a series of metadata or if it would be linked to an NFT (as well as roads/streets for example). ", "q2r": 1, "assessor": "z_assessor_530", "no_vca": 19, "ne": 0, "ng": 14, "nfo": 5, "vca_o": 1}, {"q0": "A project to help control public capital flowing into projects more efficiently and transparently for government agencies in Nigeria. Reduce the management and control of capital, fight against abuse of state public capital in investment.", "q0r": 4, "q1": "To put it into practice, the author needs a lot of resources in technology, experience in public capital management as well as the law in the host country. Moreover, it requires the government to accept the use of digital currency instead of paper money and deploy it from the central to the local level.", "q1r": 3, "q2": "If the project publishes information on government agencies about financial spending and public investment on the blockchain platform, it can be verifiable. The project will need background technologies related to oracle, other financial tools to connect accounting in reality to easily show that the project is serious.", "q2r": 3, "assessor": "z_assessor_648", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Great problem identification however the proposal does not should how it plans to solve it. Using phrases like 'using blockchain' is generic. I would be glad if you can build a partnership with the Landano team. ", "q0r": 3, "q1": "It is quite difficult assessing feasibility since how to solution would work is left out of the proposal. ", "q1r": 2, "q2": "The team should consider a budget breakdown so it is easy to tell which part of the solution is being funded and at what phase. Include progress report to help track implementation. ", "q2r": 2, "assessor": "z_assessor_727", "no_vca": 16, "ne": 0, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "使用区块链创建一个协议，可用于在地方一级规划、开发和关闭项目--智能合约。", "experience": "18年的工程经验。工程，2年多的资本规划和资产，8年的项目管理。"}