{"id": 384773, "author": "dcspark", "title": "Nation-ready scalability research", "url": "https://cardano.ideascale.com/a/dtd/384773-48088", "category": 26249, "amount": 75000, "description": "国家要想采用区块链，我们需要在国家范围内实现可扩展性", "funded": 2, "upvotes": 179605121, "downvotes": 15430995, "votes_result": 164174126, "votes_cast": 360, "f6_no_assessments": 6, "f6_rating": 3.1666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "我赞成及时解决大问题。催化剂有很多小的、零散的项目和解决方案--但我们也需要一些重型的长期解决方案来解决隐约出现的大问题。可扩展性问题是区块链的关键挑战之一，dcSpark团队一直在持续和明确地传播关于Cardano区块链在区块链可处理的转码数量方面即将面临的挑战的信息。我们正在接近目前的极限（当然，参数调整可以暂时改善这种情况）--然而，全国范围的采用意味着没有可能将整个国家 \"搁置 \"起来，直到我们找到解决更多交易数量的解决方案。我认为这个建议与国家建设Dapp的挑战完全一致，因为Dapp解决方案如果没有一个可以支持它们的网络，就无法发挥作用。一个能够扩展到更多交易数量的网络将自动允许多个Dapp的顺利和无障碍发展，这将导致Dapp用户数量、注册账户和交易量的增加。有人可能会看一下《挑战》，质疑这个提议是否合适。我不这么认为--因为我们必须要看到森林的本质。在这个世界上，我们可以为各国开发100个新的Dapp，但底层区块链却无法处理少量的交易。正如提议者所说。为了让国家采用区块链，我们需要在国家范围内实现可扩展性。这就是本提案想要通过拟议的可扩展性解决方案来实现的，该解决方案被称为 \"天真的滚动 \"或有时被称为 \"懒惰的滚动\"。Hydra还需要一段时间，不能单枪匹马地处理整个可扩展性问题。此外，一个新的可扩展性解决方案将有助于Cardano生态系统所需的基础研究的去中心化。我认为这个建议是一个三赢的系统。\r\n", "q0r": 5, "q1": "我认为dcSpark团队可以从更严格地遵循在Ideascale提交提案的精确说明中受益。这可能是一个痛苦的过程，但对细节的关注是好工作的标志。挑战要求对3个月、6个月和12个月后的成功进行定义，而我在这份提案中没有看到这一点。也许团队可以把每月更新（博客文章、视频更新等）作为交付品，说明研究的进展情况。这个想法很好，我喜欢已经确定的可交付成果（1.写出对天真的滚动的更严格的分析；2.对滚动的可行性。在基于UTXO的链（Cardano）和会计风格的链（如Cardano的侧链，称为Milkomeda）上进行滚动的可行性）。然而，在我看来，可以投入更多的努力，做出承诺，让社区了解最新的研究和发现 - 随着研究的进展。我认为，整个社区都对可扩展性的突破感到兴奋，dcSpark--如果有必要的话--甚至可以增加预算，以包括一个营销人员，计划定期播放关于研究结果的视频......随着研究的进展。就目前的情况来看，预算并没有明确列出，也没有细分为可识别的项目（这些是催化剂对CA的规定）。无论如何，在Ideascale提案中加入Youtube视频是令人惊奇的，dcSpark团队的资历是非常好的，他们对Cardano的贡献--在他们的Emurgo时代和后Emurgo时代都是清晰而重要的。我认为，由于该团队的资历，该研究的可行性是毋庸置疑的。该团队表示，\"我们相信rollups也可以成为Cardano扩展策略的一部分\"。我更喜欢使用 \"相信 \"一词的声明--通过对 \"为什么？\"的更多分析来更好地证实。我的问题是--如果研究结果显示它们不能被使用--我们会有一个替代策略吗？无论如何，在权衡一切之后，特别是团队的能力，我评估该提案确实极有可能成功实施。", "q1r": 4, "q2": "由于这是一个基于研究的提案，它的交付物显然是一个完全不同于建设网站的产品。在工作开始之前，精确的交付物总是不太明显，团队已经仔细说明，它认为这两个交付物将是一个.写出了对天真的滚动的更严格的分析，以及在基于UTXO的链（Cardano）和会计风格的链（如Cardano的侧链称为Milkomeda）上滚动的可行性。这些都是伟大的贡献，没有多少团队参与这种对Cardano有实际影响的深入研究。这个团队--在所附的视频中--以及其他可以在Youtube上看到的dcSpark团队的视频--表明他们对这些问题的理解确实很深入。因此，我认为dcSpark更容易考虑在其工作中包括一些类似Cardano路线图的更新--为其所有的建议[https://roadmap.cardano.org/en/status-updates/]如果dcSpark已经在进行重要的贡献，那么有助于可审计性的里程碑可以采取定期（每月更新）的形式，介绍每个分支工作的进展情况。如果没有这一点，提案的可审计性就会受到影响，外人无法获得任何有意义的见解，直到有一天（六个月后？）dcSpark突然重新出现，告诉我们发生了什么。提议者说，\"我们相信我们可以在2022年上半年提供这一可交付的成果\"。对于Catalyst来说，这是最低限度的--所以尽量加入更多强制性的沿途更新/报告，这将有助于你所有提案的得分（当然，如果他们值得的话）。我见过其他领先团队的提案，他们也是生态系统的一流贡献者，但他们确实包括详细的步骤、每月的时间表、预算要求的细目，包括诸如以下内容。\"最小估计人日数\"\"最大估计人日数\"，以及影响预算和工作量分配的日率和变量--因此也包括审计工作的能力。审计目前的进展将是相对困难的--尽管这是一个不同类型的项目。  不过，即使在这种类型的情况下，人们仍然可以通过定期更新来发挥创造力。请在今后的工作中加入更多关于里程碑的信息，以使其更容易监测。", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 17, "ne": 10, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "A great proposal worth investing for Cardano ecosystem as a whole! One key property that differentiates rollup from Hydra is that rollup does not require trust on the parties that runs it, while Hydra does. This is due to the fact that rollup will write data sufficient to verify computations happened in rollup back to L1, while Hydra does not. This trustless property of rollup brings more possibilities for large scale use cases. For the case of nation-wide applications, any third party can run L2 rollup without acquiring any trust from the nations. The trustlessness and scalability of rollup is going to be a strong reason for nations to adopt blockchain technology.", "q0r": 5, "q1": "DcSpark has demonstrated its experience and ability to deliver high quality product. Besides being the former employers of Emurgo and IOG, they recently launched Milkomeda testnet and Flint wallet which seamlessly connects the EVM side-chain with Cardano. I have no doubt in the team's ability to deliver fruitful research results for this proposal.", "q1r": 5, "q2": "As stated in the proposal, the deliverable is a writeup of analysis on rollup for Cardano in terms of feasibility. This should be fairly straightforward to audit, although I would argue that some quantitative measurements will make it more auditable. For example, providing what exactly will be presented in the analysis (e.g. list pros and cons of rollup, works need to be done). Regardless, research is ambiguous in its nature. Therefore, I don't think lack of quantitative measurements is a big issue overall.", "q2r": 4, "assessor": "z_assessor_315", "no_vca": 20, "ne": 6, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is for a scalability solution that does not fall within the scope of the challenge which explicitly calls for \"Dapp proposals should cover foundational Registry solutions, namely:\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"\r\n\r\nThe proposal adds value to the Cardano ecosystem, in the form of increased scalability.\r\n\r\nThe goals of the project are defined but do not align with the challenge. There are no key metrics defining success.\r\n\r\nHow scalability will be achieved is addressed in the proposal.\r\n\r\nTo improve the proposal: choose an appropriate Challenge (Miscellaneous), ensure goals align with the challenge, provide key metrics for success.", "q0r": 2, "q1": "The proposer relies on reputation to provide evidence of relevant skills and experience needed to implement the proposal, which is not ideal given new CAs and voters may not be aware of them.\r\nThe proposer does not identify the type and number of team members required to implement the proposal.\r\nThe budget is not clearly broken down into identifiable items. \r\nThe budget seems reasonable to achieve the set goals.\r\nThe proposal has no timetable to complete the work other than a nebulous \"first half of 2022\".\r\nThe proposal does explain technical aspects of the implementation.\r\nThe proposal does not include challenges and risks relevant to a successful implementation.\r\nTo improve the proposal: provide specific evidence of experience instead of presumed name recognition, identify the team and skill sets required to implement the proposal, breakdown the budget into specific items, provide a timetable, include a challenges and risks section", "q1r": 3, "q2": "The proposal does not include a roadmap with milestones and a time horizon for achievement. \r\nThe proposal does not provide metrics/KPIs that define the success of the proposal. \r\nThe proposal provides a clear understandable description of the targeted problem.\r\nThe proposal provides a clear understandable solution that addresses the problem.\r\nTo improve the proposal: include a roadmap with milestones and a time horizon for achievement, provide metrics/KPIs that measure progress", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 18, "ne": 6, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "While it is not a direct and immediate attempt at building a dApp on a national level, the impact of research on scaling is undoubtable and dcSpark team is positioned very well to execute on that research.", "q0r": 4, "q1": "The team is highly experienced and well known in the community. However, no clear timeline and milestones are set in the proposal and budget is set as an arbitrary number not really explaining how it will be used. I am pretty sure that the team is capable of providing these basic information and I would love to give them 5 stars if these information was here. For example: by the end of Q1 we will publish X scientific papers, we will put X people full time on the job for that, pay them X amount of money. ", "q1r": 3, "q2": "Unfortunately, no budget breakdown or real metrics were proposed that can be used for auditing the proposal. Team is extremely professional and they have a wonderful track record in and around Cardano and I can not understand why this information was not provided.", "q2r": 2, "assessor": "z_assessor_65", "no_vca": 16, "ne": 0, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "I found the solution to be too general and not specifically focused on any particular problem. We all understand that in order to scale up blockchain, we have to make it applicable so that countries can see the benefits it brings. Your ideas are very good but nothing is expressed clearly. In addition, we should take specific actions to make Cardano's ecosystem highly influential", "q0r": 2, "q1": "I need to see your team's profile. Besides working at Emurgo, IOHK, what is your position? What have you experienced or done? I have not seen how long your rollups plan will last and what specific time period. What are detailed project KPIs? And how long will it take you to achieve the KPI?", "q1r": 1, "q2": "For the $75000 request, how would you guys allocate this money to the project? If it is only for research, it can be highly effective in a short period of time. Or you will use this money to build a large community. From there this community will be able to rollups. And how can the community know that you are using $75k effectively?", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The problem state of achieving scalability at a nation scale I believe is very relevant considering we are only weeks/months away from a massive spike in L1 usage on Cardano due to dapps being released. It fits the challenge of building \"nation dapps\" very well. By researching rollups in this case \"lazy rollups\" we are providing an alternate route besides \"hydra\"- the main scaling solution being built on Cardano today. Although Hydra is promising, it will not be relevant for all dapps and by diversifying research into multiple scaling solutions we are not putting all our eggs into one basket as to speak. I feel this research has the potential to bring great benefit to multiple aspects of the Cardano ecosystem.", "q0r": 5, "q1": "The team at dcSpark is well known in the community and is made up of ex Emurgo and IOHK employees. Taking this into account I believe that there is a high likelihood of a positive outcome when considering the impact this research on rollups could have on Cardano. Although there is no information currently on how this area of research will be conducted eg)- how many people will be researching and a breakdown of how the funds will be distributed. There is also a rough idea of when the research is expected to bear results, but a more detailed roadmap would be ideal in giving the community a more concrete idea of when to expect results.\r\nThe budget of 75k seems extremely reasonable considering \"Polygon\" a Ethereum sidechain solution just acquired a start-up company specializing in rollups for $400m.  ", "q1r": 3, "q2": "Currently there is no real detailed roadmap or KPI's to speak of, I feel that if this proposal had these it would be an excellent all-round proposal. With the above mentioned it is also very hard for the community to track/audit the progress other than the dcSpark social accounts. ", "q2r": 2, "assessor": "z_assessor_858", "no_vca": 14, "ne": 5, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "我们将对一种称为 \"天真滚动 \"或有时称为 \"懒惰滚动 \"的可扩展性解决方案进行新的研究。", "experience": "我们的团队由知名的前Emurgo和前IOHK员工组成，他们在过去几年里一直在建立Cardano生态系统。"}