{"id": 383562, "author": "seedstars", "title": "Hackaton for Entrepreneurs", "url": "https://cardano.ideascale.com/a/dtd/383562-48088", "category": 26244, "amount": 40000, "description": "全球85%的人口生活在新兴和前沿市场，他们缺乏关于区块链、Cardano和Catalyst的信息。", "funded": 0, "upvotes": 14509351, "downvotes": 24253936, "votes_result": 9744585, "votes_cast": 114, "f6_no_assessments": 5, "f6_rating": 1.4666666666666668, "videos": [], "media": [], "f6_assessments": [{"q0": "A problem and a solution to the problem have been identified but what is relevancy, related to entrepreneurship, of the fact that 86% of the global population lack in info about blockchain? Entrepreneurs have access to any information they want to know related to the business area they live in.\r\n\r\nBased on the details of the proposal it is clear that it doesn't fit into the challenge objectives.", "q0r": 1, "q1": "The proposal lacks in providing relevant info about the project implementation, the only clear fact being amount the requested amount, but without a budget with identifiable items.\r\n\r\nIt is unclear who the members of the team are, what is their expertise and their roles in the team.\r\n\r\nThere is no details about the work to be done and about a  realistic timetable to complete the work. \r\n\r\nThe proposer isn't aware of the resources needed to successfully implement the project (human resources, stationary etc.).\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation.", "q1r": 1, "q2": "No KPIs/metrics are defined to measure the success of the project and there is no roadmap with milestones to achieve.\r\n\r\nThe proposal can't ne assessed properly because it has no relevant info presented.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 19, "ne": 2, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "Although the initial idea of this proposal looks relevant to the challenge, the problem statement is too generic without focusing on what kind of information emerging markets miss about blockchains and Cardano. The solution to the problem is even more unconnected to the stated problem, that is, how will a hackathon series for DApps feed the missing information to the markets?\r\nThe proposal provides neither an overview nor a detailed description of the solution so that it is impossible to determine the added value and impact to the Cardano ecosystem. The provided video is completely irrelevant to the challenge, it is just a showcase for Seedstars.\r\nDue to lack of information I strongly disagree that this proposal addresses the challenge. Therefore I rate it with a score of 1.", "q0r": 1, "q1": "The proposal does not provide any information about the team to be involved for creating the hackathons or any proof that Seedstars has the right competencies and skills to do so. The stated experience is too generic and meaningless as it fails to provide any evidence for it.\r\nThe proposal misses details about the requested funds, a list of goals, an implementation or time plan, a task list to be executed, a risk assessment and any kind of information about the implementation.\r\nI strongly disagree that this proposal will be implemented successfully so I rate it with a score of 1.", "q1r": 1, "q2": "The proposal has totally failed to provide any kind of roadmap, milestones, KPIs or time horizon about the implementation. It is impossible to track any progress or audit the project during execution.\r\nDue to complete lack of information for clarity and auditability I rate the proposal with a score of 1.", "q2r": 1, "assessor": "z_assessor_614", "no_vca": 17, "ne": 2, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "\"I love the idea of creating Hackathons to promote and encourage the development of Dapps on the Cardano platform. Because Hackathons are competitions used to find breakthrough projects and the talent that emerges from it a lot.\r\nBut this proposal is only at the idea level and does not have a specific plan to implement these hackathons. Therefore, its true impact has not been clearly shown\r\nI hope to see the Hackathons of this proposal being planned and implemented because it is a very good and potential program.\"", "q0r": 2, "q1": "\"I visited the website of this proposal team. This is a strong team when it comes to implementing a wide range of business matching programs with organizations.\r\nBut for this proposal, because everything has not been clearly shown about the roadmap, plan, and specific program. Therefore, for this proposal, it is very difficult to have high feasibility\"", "q1r": 2, "q2": "As the proposal does not actually set out any clear deliverables, it is not possible to audit the progress or success. Please propose an actual timeline with deliverables and provide some metrics on the produced audits which would define the success of this project.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 0, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "It's not unusual to hold idea contests, and it's a place where serious projects are promoted through sponsorship. However, when I looked at the proposal, I did not see the seriousness and experience of this project. They have not yet given detailed strategies, plans, and KPIs for the implementation.", "q0r": 2, "q1": "This proposition has potential with a dynamic team that has previous experience organizing events. But I still wonder about the feasibility because the writer of this proposal is too sketchy and lacks information.", "q1r": 2, "q2": "The proposal did not show enough information about the detailed work plan and KPI, so it was quite difficult to make a good assessment for this project as well as to verify the results of the proposal.", "q2r": 2, "assessor": "z_assessor_652", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The team from Seedstars (unverified) proposes to run a global hackathon for the creation of DApps with Entrepreneurs in 4 physical hubs in Emerging Markets (Latin America, Africa, the Middle East, Central-Eastern Europe, and Asia) with the winners applying for funding in Catalyst fund 8. Seedstars definitely has the ability and track record to run and expand this program to other community hubs around the world if it was a success. A global hackathon program such as this would bring allot of value to the communities through the use of established community hubs. The idea is great but the proposal suffers from a severe lack of detail as to how this would be done.  ", "q0r": 2, "q1": "Seedstars is a established company with a proven track record of success. The team supports entrepreneurs in over 90 countries with a variety of programs. Unfortunately there is no detailed plan for this project, the budget and use of funds is not explained or elaborated. It appears that this proposal may be a placeholder and has not been finalised. Given Seedstars expereince I believe they can achieve this goal but i have had to give 2 stars for the lack of detail.", "q1r": 2, "q2": "There are no details about the hackathon in the proposal. For a succcessful proposal much more information would be required.", "q2r": 1, "assessor": "z_assessor_699", "no_vca": 14, "ne": 0, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "在新兴市场的4个实体中心为DApps与企业家创建一个黑客马拉松系列，最好的想法将在F8中得到资助。", "experience": "我们支持90多个国家的企业家成长和扩大他们的公司，以创造有意义和持久的变化。+信息 seedstars.com"}