{"id": 381595, "author": "matthiasksieber", "title": "Win-Win Web Dev Internship Program", "url": "https://cardano.ideascale.com/a/dtd/381595-48088", "category": 26248, "amount": 9000, "description": "大学生がWeb開発に携わりながらCardanoに関われるインターンシッププログラムはほとんどありません。", "funded": 1, "upvotes": 42589891, "downvotes": 19685824, "votes_result": 22904067, "votes_cast": 127, "f6_no_assessments": 3, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "There is a limitation in the number of qualified developers in the Haskell community, and a need exists to encourage students to take an interest in Cardano. The internship program has immense potential in attracting college students towards Cardano.", "q0r": 5, "q1": "The proposal is by a strong team that has contributed and is contributing to Cardano Community. Matthias is a regular contributor in Stack Exchange, Victor and Eli has been contributing to Cardano in various roles. With these credentials, I believe that the proposal will be carried out in right earnest. ", "q1r": 5, "q2": "The budjet of $3000 per intren looks resonble. One student (SpaceBuds) has contributed so much to Cardano which many big firms envy. Therefore three students if selected properly may do wonders to the ecosystem. This $9000 will produce exponential value to Cardano. There is a need to have verifiable selection Criteria to ensure its sucesss. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 22, "ne": 1, "ng": 13, "nfo": 8, "vca_o": 1, "reply": "The impact rating seems to have been based on technicality and not the spirit of the challenge. Besides that, the Challenge is open to 'implemention' of DID solutions, not only 'development' of DIDs, as it can be seen in the Challenges guiding question: 'What solutions can we develop and implement with Atala PRISM and Cardano today to have the most positive impact and open up opportunities for rapid growth of the Cardano network?'"}, {"q0": "As part of the miscellaneous challenge this proposal fits well. Its a very simple proven approach to growing a consultancy business & one i have deployed over he past few year (get some work and bring on grads to help deliver). It will allow new developers to get exposure to Cardano which can only be a good thing for the ecosystem.", "q0r": 5, "q1": "The timelines and budget and sensible and generous to interns. I have previously taken on interns at no cost. What is missing from this proposal however is any evidence that someone in Loxe inc. has the technical capability and time to actually take on the mentoring duties. Named resources with their profiles would have really helped to drive this proposal home. I assume they will select interns with prior knowledge of web development, so they effectively become a 'useful' resource from day 1. ", "q1r": 4, "q2": "The only measurable item here is that interns have been onboarded and lasted 3 months.\nBetter metrics would have been to define what outcomes the interns can expect and then define measurable metrics around these outcomes. eg outcomes on training, development, catalyst activities , etc.", "q2r": 1, "assessor": "z_assessor_45", "no_vca": 21, "ne": 2, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": "An internship program offers many benefits to both parties [win-win(?) 😊]. (1) For the students, the opportunity to become familiar with cutting edge technology at the beginning of their careers; (2) for Loxe Inc., the opportunity to find the talent they will possibly hire in the future and increase current productivity, but also will get a fresh perspective that will possibly break the status quo as well as specialized skills and strengths. Lastly, for Cardano I see a likely increased of visibility on college campuses. However, there is a lot of competition in different industries (especially in Technology) to attract talent through internship programs. Consider asking yourself: Why would a student choose you rather than the big-name companies? I recommend making a more elaborate \"value proposition\" than just relying on the hypothesis that students want to learn more about blockchain. The only requirement for assessing alignment in the Miscellaneous Challenge is if there is alignment with Cardano, and that’s pretty clear to me. However, I believe the team could have done a better job of aligning this proposal with the ecosystem's purpose and values, beyond just selecting two interns. In the Auditability section, I give examples of KPIs that exemplify ways in which impact can be improved.", "q0r": 4, "q1": "The team is composed of people well known within the community, with winning proposals in previous funds and relevant experience in the value proposition of the startup. For this proposal the key role is the person who will mentor and coach the selected students. Therefore, it would have been interesting to know who would take on this role. Even though the implementation plan itself is not complex, I believe it was necessary to include more information about it. I say this because: (1) there is a lack of description of the student profile being targeted. What will be the Minimum and Preferred Skills? Due to the short time frame of only 3 months, the right profile will be crucial to an excellent contribution. (2) there are no details of the methodology to be used for the student selection process. How do you ensure that the same opportunities are given to students globally? (3) there is no description of the characteristics of this internship program. Here, I recommend taking as a reference the best practices of internship program methodologies applicable to different industries. The budget was broken down into 4 items and the amounts requested are appropriate, however, I have doubts regarding the item \"Selection process\" I am not clear exactly what it refers to. Is an HR recruiter hired and that is the cost of the search? Are there hours that will be allocated to the person who will be dedicated to search? I should also add that the sum of the budget items does not add up to the total amount requested. According to my calculations the total of the items is $7500. Where will the remaining $1500 be allocated?", "q1r": 3, "q2": "The roadmap is equally simple due to the simplicity of the plan. Taking two months for the marketing and selection process and three months for internships for selected students seems reasonable to me. However, I think the team could have done a better job defining the KPIs since they are a bit confusing. What exactly does \"Selection process: $500 per vacancy\" mean? what indications of success does it provide? Here are some recommendations: (a) Number of students reached in marketing campaign; (b) Diversity of candidates considered for hire (c) Number of candidates in development zones considered for hire (d) Number of candidates exposed to the Cardano ecosystem [Maybe \"Catalyst School\" or \"Gimbalabs\" should be included as partners in the selection process].", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 23, "ne": 11, "ng": 12, "nfo": 0, "vca_o": 1}], "solution": "新しいウェブ開発者に実世界での開発経験とメンターシップを与え、同時にカルダノを紹介する。", "experience": "Loxe Inc.チーム、経験豊富でハッカソンで優勝したPlutusの開発者グループ、Gimbalabs PPBLの参加者、経験豊富なWeb開発者たち"}