{"id": 383207, "author": "chrisr", "title": "WILD NFT", "url": "https://cardano.ideascale.com/a/dtd/383207-48088", "category": 26248, "amount": 58000, "description": "自然環境をサポートするNFTは未発達。自然環境や動物の保護を支援するNFTには大きなチャンスがあります。", "funded": 0, "upvotes": 16355369, "downvotes": 19596400, "votes_result": 3241031, "votes_cast": 85, "f6_no_assessments": 4, "f6_rating": 3.583333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "今回のファンドでは、NFTに大きく焦点を当てたチャレンジがないため、問題文は合理的かつ明確な方法で提示されており、チャレンジの概要とも一致しています。現在、NFTの市場は数多くありますが、アート以外のユースケースを重視しているものは多くありません。さらに、動物や環境のサポートや福祉に焦点を当てようと決めた人は少なく、（私の考えでは）提案の方向性は魅力的であり、カルダノのエコシステムへのユニークな貢献となります。  私の理解では、この提案はローカルとグローバルの両方のレベルで機能する可能性と意図があり、組織、コミュニティメンバー、個人投資家の両方にプロジェクトへの参加を呼びかけています。提案書にあるように、このプロジェクトは、世界中の組織から個人まで、さまざまなレベルで変化する可能性があります。特に、持続可能性という、関連性が高く、幅広いスペクトルを持つテーマに焦点を当てた場合はなおさらです。同じプラットフォームを使って、絶滅危惧種を支援したり（組織と連携して）、自分の住んでいる町の動物保護施設を支援したりすることができます。この提案の規模が大きいことが、多額の資金を獲得した理由だと思われます。私は、この提案が課題を効果的に解決するものであると確信しています。", "q0r": 5, "q1": "7人のコアチームメンバーは、提案に関連する分野で、補完的な専門知識と経験を持つ素晴らしい分野をカバーしています。カルダノのエコシステムに積極的に参加し、貢献しているという観点からも、環境開発や動物の権利の分野で何十年も活動してきた経験からも。各チームメンバーの十分な情報は、それぞれのLinkedInプロフィールで提供されています。DignifIDという機能的なプラットフォームを作るというプロセスをすでに経ていることが、チームの信頼性と信用性を高めています。\r\n前述の通り、予算はチャレンジの総予算の20％強とかなり多めですが、提案者が3ヶ月という期間内に多言語（素晴らしい追加機能）のNFT鋳造ウェブポータルと多言語の市場ウェブポータルを立ち上げたいと考えていることを考えると、納得がいきます（詳細は後述します）。また、予算の配分が明確に示されており、以前に作成したプラットフォーム（DignifID）がローンチのコストをカバーするのに役立っていることから、チームは予算配分の急な変更を計画していると思われます。\r\n\r\n1年間のプロジェクト計画は、わかりやすく構成されていますが、計画の各段階について、より詳細な情報が欲しいと思いました。プラットフォームやツールを作成するプロセスが現在どの段階にあるのかという情報を加えることで、提案の実現性を評価しやすくなるでしょう。提案書に記載されている情報から、私は開発が進行中であると推測していますが、提案書にはさらに明確な情報が含まれているといいと思います。提案に大きなメリットをもたらすのは、予算配分の内訳をより詳細に示すことです。例えば、以下のようなものです。例えば、外部のマーケティングや広報活動に何人が従事し、週に何時間働くのか。何人のアクティブなチームメンバーが、どのくらいの期間、プロジェクトに参加するのか？予算配分はかなり明確ですが、労働時間の範囲の見積もりがあれば、さらに明確になるはずだとコミュニティアドバイザーの私は考えています。\r\n\r\nまた、アウトリーチはどのように行われるのでしょうか？提案書には、以前のプラットフォーム（DignifID）を通じて関連アクターと継続的な契約を結んでいることが示唆されていますが、以前からのコネクションを利用することを目的としているのか、それとも全く新しいコネクションの基盤を必要としているのかは不明です。提供された情報によると、最初は組織を介して人々と接触することが主なアウトリーチになるのではないかと思われます。(それ自体は非常にスマートなアイデアだと思います。）総合的に見て、この提案がうまく移植されることに同意します。", "q1r": 4, "q2": "提案書には、マイルストーンを含むロードマップが、明確で分かりやすい方法で提示されています（3ヶ月、6ヶ月、12ヶ月というタイムフレーム）。可聴性を高めるために、提案者は、マイルストーンが達成されているかどうかを組織外の人々がよりよく理解できるように、いくつかのKPIや測定基準を追加することができたはずです。例えば、このプロジェクトでは、6ヵ月後に何人のユーザーをホストすることを想定しているのか。NFTの収益のうち、どれだけを動物や環境の保護に充てているのか、また、3ヶ月、6ヶ月、12ヶ月後の稼働後の予想トラフィックは？すぐに世界的な広がりに集中するのか、それともいくつかの地域・組織から拡張・発展させる計画があるのか？  これらの質問に答えることで、コミュニティが成長過程をより明確に監査できるようになると考えています。\r\nまた、チームや提案の信頼性をさらに高めるために、潜在的なリスクや課題のリストを見たいと思いました。私の知る限り、NFTの世界には、動物をテーマにしたNFTを作る団体やアーティストがたくさんいます。提案者は、\"Bored apes \"や \"Stoner animals \"と自分たちを差別化するために、自分たちの基本的なユニークなセールスポイント（持続可能性、環境、動物の福祉）を、どのようにしてできる限り強調するつもりなのでしょうか？このプロジェクトの背後にあるアイデアと価値観には多くの可能性があり、このプロジェクトが製品の背後にある強いコアバリューをどのように強調するかの例を見たかったです。全体的には、この提案書は、掲げられた目標の達成状況を評価するのに十分な情報を提供していると思います。", "q2r": 4, "assessor": "z_assessor_349", "no_vca": 18, "ne": 13, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "For an outsider is difficult to understand the meaning of the following statement \"delivering verifiable wellbeing & sustainability\" and this should be the output of a market place when NFTs are sold/bought (previously minted). The NFT ecosystem has evolved at a fast pace during this year on Cardano blockchain. Why would WILD NFT make a (big) difference comparing with the other mature platforms? Also another question that could arise is: there is a demand for this kind of NFT? \r\nAiming to be globally recognized the project faces an outstanding challenge, and the information provided make it somehow unstable on its path to success.\r\n\r\nThis proposal doesn't fit in the challenge objectives as it looks to fit well in F7 DApps & Integrations Campaign", "q0r": 2, "q1": "The proposer presented the team members and their roles in the team and each one seems to have a vast experience in at least one of the following fields: business, marketing, science and not the least there is already a NFT minting platform.\r\n\r\nChecking the website (nft-maker.io) there is statement about the quantity of minted NFTs and the revenue they produced but with just a few trails in support of this, thus making difficult to evaluate the declared success.\r\n\r\nThe budget is outlined and broken down into identifiable items but some of them are difficult to be evaluated (\"Minting Platform and Market Exchange design with multi-language interface - is not clear what are the components of this stage and if the design stage starts from scratch, and also if the the multi-language feature will be automated (translate service) or the translations are made by humans).\r\n\r\nThe proposal provides a conductible plan for implementation that shows only what is being done but lacks to describe how is done. (see above)\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation (risk awareness is an important aspect of any business)", "q1r": 3, "q2": "KPIs/metrics are not defined to define the path of success. There are some statements (\"Users will visit the web portal\" - why? how many? how many will come back/stay after first visit? etc.) that looks more like a desire than something that can be measured.\r\n\r\nReading the proposal the impression is that there is too much hype and overconfidence and less realistic and viable facts to sustain the implementation of the project.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 21, "ne": 4, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This proposal could possibly fit under: Daaps and Integrations, as it would be something that bring value to end users and attract new people to cardano.", "q0r": 3, "q1": "They have a highly experienced team with well rounded experience. They also state they have an NFT tech partner. They also have experience in digital IDs for animals which translates directly into what they're seeking to do.", "q1r": 5, "q2": "They did provide a proper breakdown of their KPIs and their roadmap, but this proposal would benefit from more details on how the funds will be spent we can audit efficiently.", "q2r": 4, "assessor": "z_assessor_612", "no_vca": 18, "ne": 2, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "The proposal is an interesting use of NFT's to help conservation and animal shelter care. However, the proposal doesn't really explain how it will help conservation. They seem to focus mostly on animal shelter and their well being and less on endangered species.  ", "q0r": 4, "q1": "The team has valuable expertise in NFT and marketing. However, the budget allocated to communication seems very low to educate potential NGO's, animal shelter or conservation organization to adopt the project and create new NFT's. the proposal needs to explain more about who are those  credible auditors to verify and attest wild NFT. The road map presented here lack of clear KPI's. ", "q1r": 4, "q2": "The proposal is interesting with a strong team however more information is needed to audit adequately the proposal.", "q2r": 3, "assessor": "z_assessor_761", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "WILD NFTは、自然環境と動物のために、検証可能なウェルビーイングと持続可能性を提供する、ワールドクラスのNFTマイニング/マーケットプラットフォームです。", "experience": "私たちは、動物と環境のウェルビーイングをサポートするためのデジタルIDを提供する非営利団体、dignifid.orgを設立しました。NFT Maker Proは私たちの技術パートナーです。"}