{"id": 383244, "author": "jenniferrlewis614", "title": "ADA Token to Combat Homelessness", "url": "https://cardano.ideascale.com/a/dtd/383244-48088", "category": 26248, "amount": 40000, "description": "アメリカ人は賃貸支援を受けるべきです。しかし、政府資金の11％しか分配されず、75万世帯が立ち退きを迫られています。", "funded": 0, "upvotes": 16815229, "downvotes": 22314785, "votes_result": 5499556, "votes_cast": 94, "f6_no_assessments": 5, "f6_rating": 3.4666666666666672, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is noble and workable. The issue is to get money as charity and Cardano tokens look like a superficial addition. It also is US specific and the state of other countries in homelessness is complicated to handle in a centralized manner.", "q0r": 3, "q1": "The proposer had been a counselor and I share the concern with the community. But the problem is more complicated and is not likely to be solved by issuing a contribution token. It needs low-cost housing, sponsored land in a prime area where the homeless can find work and the prime reason create more Jobs. Homelessness is a secondary problem caused by Job loss, therefore I feel a sustainable cure is in creating more jobs. ", "q1r": 3, "q2": "The project has earmarked 25000USD for outreach and incentive for influencers. These are some un auditable expenditures. The ROI is also abstract and unmeasurable. There is a need to have a verifiable output for the money spent; therefore, the project is not fully auditable. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "\"I am very impressed with the idea of ​​using tokens on the Cardano blockchain platform to raise money for rent assistance for the homeless because it is a good way to make it convenient for people to buy tokens to support. support this fund\r\n\r\nThis Proposal has had a huge impact on the homeless, I have absolutely no doubt about it. But I still haven't really seen much of it for landlords and investors beyond their backing of money for the proposal.\r\n\r\nTherefore, in my opinion, the proposer should expand the participants to buy tokens to individuals and organizations such as: charities, individuals who want to help the homeless or even the government to have can make a bigger impact\"", "q0r": 4, "q1": "\"The proposer has spent five years serving as a homeless shelter counselor was a great experience to implement this proposal. Because the proposer probably knows the best way to help the homeless.\r\n\r\nBut when I read the proposal, I only see that the team has only Ms. Jennifer R. Lewis carried out the project alone, without others with the right expertise in the work of the proposal to support the project in the long term. The proposal hires the creator of the token or the website can only produce initial results, but the proposal deploys in 1 year, it needs the people who do this work in the team to update and fix problem of the website and the token.\r\n\r\nAlso, I can see how the proposal can generate money for the homeless through the issuance of tokens. But I haven't sees proposer outlines how that money should be used. Is that money being used properly to make an impact? We need a concrete plan for this\r\n\r\nBeside, I can't find any reason for landlords to accept rent payments in tokens so this doesn't seem feasible.\"", "q1r": 3, "q2": "\"Checking the financial results of a token on a blockchain platform is not a difficult job and is completely auditability.\r\n\r\nBut since this proposal does not specify how the token will be used, I still do not know how the money raised by the proposal will be used to help the homeless. This is an important thing because if the proposer does not have a plan for this so investors and landlords can't invest to this token because they don't know how this proposal use their money. Therefore, it is very difficult to check the success of the proposal on the homeless because they don't show the plan.\"", "q2r": 2, "assessor": "z_assessor_645", "no_vca": 16, "ne": 4, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This proposal focuses on creating a native ADA token that is specifically used for providing rental assistance grants to those in need. This is a socially meaningful idea.\r\nThe problem statement convinces me very much [especially your own story]. I think this is a great and interesting idea, after all. The solution is clearly showing what you intend to do for solving the problem. Therefore, based on the given information, I agree with this proposal's impact, I can rate it with a score of 4", "q0r": 4, "q1": "Your profile and background [as a homeless shelter counselor] is a great benefit for implementing this proposal, but without any proof/links for verification. The roadmap is clear, however, the budget explanation and risk are not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "As mentioned, this problem and solution's idea is quite convincing to me. However, the plan did not provide me enough information, especially the following: (1) Profile with reference/proof (documents/links,...) for verifying; (2) Budget explanation for each item (cause this requested budget >20% of the challenge total fund); (3) KPIs/ Metrics. Therefore, based on the given information, I disagree with this proposal's auditability, I can rate it with a score of 2", "q2r": 2, "assessor": "z_assessor_679", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "Since the proposal is submitted under the category Miscellaneous challenge, it has attempted to solve a unique set of problems from other challenges. However, it can be well organized and submitted to other challenges as well that can host this set of solutions proposed on the proposal.", "q0r": 3, "q1": "This case can be observed in two different ways one is that having all the experience stated in the proposal can do great advantages to the success of the project the other part is that the solution on the proposal fails to state all the factors that can backup the experience specifically relate to the solution raised.", "q1r": 3, "q2": "The proposal lists all the necessary major milestones on the progress of the execution which helps the proposal to be auditable.", "q2r": 4, "assessor": "z_assessor_762", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "Using the funds from the miscellaneous challenge to help support folks in need of rental assistance is a great idea. Even better is the idea to tie in financial education.", "q0r": 5, "q1": "The founder's education and experience working as a counselor in a homeless shelter makes her the perfect person to lead this project. With her years of experience, this project will have a head start since she already knows the ins and outs of the emergency housing system.", "q1r": 5, "q2": "Yes, the KPIs serve also as a project roadmap. It is clear what success would look like and the timeframe that this project should accomplish these goals. The budget breakdown also allows the community to see how the funds are appropriated", "q2r": 5, "assessor": "z_assessor_808", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "必要としている人に賃貸支援金を提供するために特別に使用されるネイティブADAトークンを作成します。", "experience": "ジェニファー・R・ルイスは、ホームレスシェルターのカウンセラーとして5年間勤務し、現在は心理学の修士号取得を目指しています。"}