{"id": 381050, "author": "blair01", "title": "Speech to sign language AI avatar", "url": "https://cardano.ideascale.com/a/dtd/381050-48088", "category": 26247, "amount": 1000, "description": "Certaines personnes sourdes ont besoin de la langue des signes pour interpréter la parole.", "funded": 0, "upvotes": 15238996, "downvotes": 14827115, "votes_result": 411881, "votes_cast": 117, "f6_no_assessments": 8, "f6_rating": 1.5000000000000002, "videos": [], "media": [], "f6_assessments": [{"q0": "Nice Idea, but unfortunately this is not a proposal. There is not plan to implement it.", "q0r": 1, "q1": "There is no plan and the proposer admits they neither have one nor the ability to implement it.", "q1r": 1, "q2": "There are no deliverables, timelines or success metrics. This is just an idea, but not a proposal.", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 39, "ne": 1, "ng": 29, "nfo": 9, "vca_o": 1}, {"q0": "The notion of the idea is interesting, as it would create an AI-interpreter avatar. As is explained in the comments section, these services already exist stand-alone, so I suppose this is intended to bring into utility in a metaverse. I can't help wondering why this would be such a tremendous upgrade from simple text. So I'm inclined to view it just as a cool possible feature. ", "q0r": 3, "q1": "The proposer does not express much commitment in developing this as it is stated that there is no relevant experience whatsoever that applies. The requested funds is 1000 USD to come up with the initial idea, but not much more… ", "q1r": 1, "q2": "The proposal contains an idea, not a plan. Nor is there an indication of any course of action taking in creating a plan or finding people to help the proposer to perform this. To make this proposal viable in terms of auditability it needs a plan, planning (roadmap), a prospected calculaiton of budget to develop the technology, an identified team that can perform it, a prospection of how many users this can service, where it would be deployed, how it would be marketed as a service, etc… \r\nThe idea is good, but it just needs a lot more work to bring it into reality. ", "q2r": 1, "assessor": "z_assessor_113", "no_vca": 30, "ne": 4, "ng": 25, "nfo": 1, "vca_o": 1}, {"q0": "A system that will provide speech interpretation service for some Cardano-based tokens will implement this system. There is a need to create such services powered by Cardano. ", "q0r": 4, "q1": "The proposer has disclosed that they \"don't think I can do much more.\". The idea is noble and a service powered by Cardano is what the proposer is aiming for.", "q1r": 1, "q2": "The proposer has just submitted an idea and claims that he has no further plan to implement. most probably this is to attract community attention to the problem at hand.", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 25, "ne": 1, "ng": 16, "nfo": 8, "vca_o": 1}, {"q0": "The idea behind this proposal could impact a huge world. Although the field where this could be used is small there are countless possibilities for this. The problem is googling this already brings up tons of results, either way, converting sign language to speech and vice versa. I would advise the proposer to think about this and how it could bring something extra to the community.", "q0r": 3, "q1": "The proposer states that he has no relevant experience in this field and \"likes to come up with ideas\". This doesn't really show any commitment on the proposer sight. It really is a good idea but we need more refinement on it. How does the proposer plan on bringing his idea to life? For this, we need a structural roadmap and a budget breakdown of the requested funds. ", "q1r": 1, "q2": "We have almost nothing to work with for assessing this proposal. The feel I get from this proposal is that it is still in an early stage of becoming a full-fletched proposal. It's an idea that needs to be kneaded into something more. We don't have a roadmap or a funding breakdown, which leads me to say that this proposal does not give us enough information to assess its progress.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 23, "ne": 4, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "The idea of a sign language avatar using voice recognition is a clever one, and could be a nice application for both Cardano and SingularityNet. However, because of the complete lack of detail on the proposal I neither agree nor disagree that it effectively addresses the challenge brief.", "q0r": 3, "q1": "The proposer admits that he has no AI experience, and does not suggest an alternative way to obtain the experience.", "q1r": 1, "q2": "No criteria for audit are provided.", "q2r": 1, "assessor": "z_assessor_495", "no_vca": 23, "ne": 0, "ng": 15, "nfo": 8, "vca_o": 1}, {"q0": "This proposal focuses on creating an AI avatar to perform sign language gestures from speech, voice recognition can be used to generate multiple agents simultaneously. Since this proposal is not completed [without any roadmap, KPIs/metrics, and budget breakdown,...], the solution is still very abstract, not a clear impact on the Cardano ecosystem as a whole. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "The proposer has told that he likes to think of ideas for uses of AI but has no experience implementing them. Besides, a detailed plan is not provided, therefore, there is no proof of feasibility. Therefore, based on the given information, I strongly disagree with this proposal's feasibility, and would give it a score of 1.", "q1r": 1, "q2": "Because, this is an incomplete proposal [since there is no roadmap, KPIs/metrics, and budget breakdown,...] where auditability/transparency can't be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 22, "ne": 3, "ng": 13, "nfo": 6, "vca_o": 1}, {"q0": "The proposer identified a problem for people who can't hear and suggested an idea to solve such problem. It is unclear, though, as to how this solution could support this Chalenge's goals specifically and Cardano ecosystem in general. I'd recommend the proposer to further frame the problem and solution, sticking to the Cardano missions and Challenge's metrics, as well as have some high level quantitative numbers to gauge the impact of this idea.", "q0r": 2, "q1": "It's understandable that the proposer may not have any relevant background or skillset to implement his/her idea. However, a thoughtfull process, if well applied, could lead to opening more doors for the proposer to carry on the project. Gven this infacy of the idea, the proposer could start off by thinking about which questions (s)he needs to answer to figure out the missing puzzles. A few questions that I would consider if I were the proposer: (1) has there already been any product like this on the market? if yes, can we apply such product to the Cardano ecosystem; (2) which capacity required to build a MVP for this product (e.g. developer, product manager); if you don't know which capacity is needed, you may probably ask to find a consultant / advisor in product development and deployment. In short, by breaking down a big question into smaller, biteable ones, you could push forward your idea and hopefully find people, experience, fundings needed for each phase.", "q1r": 1, "q2": "The proposal is not auditable since there was no roadmap, milestone or success defined. If you were to follow my recommendation in the Feasibility section, I'd recommend to first study the real demand (or if the problem identified is real, and how sizable is it) as your first proposal. And you can set your milestone / KPI for it to be the market size in terms of number of people and potential revenue for the idea. That would make it highly auditable.", "q2r": 1, "assessor": "z_assessor_684", "no_vca": 20, "ne": 7, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The project hits an array that has never been approached before and states a solution to a problem that is not yet clear:\r\n1/ How will it add value to Singularity now and how does it work with cardano (Converter ERC-20,...)\r\n2/ How this will scale to this will aid in cardano's real outreach", "q0r": 2, "q1": "The project's ability to execute is not really good, just on the idea, the proponent has no experience in the problem to deploy in terms of resources, timeline and technical factors.\r\n", "q1r": 1, "q2": "Not enough information has been provided to assess the transparency of the proposal\r\nRecommend to provide more about\r\n- Roadmap, timelines\r\n- KPIs\r\n- More clear description of the problem\r\n- More solution details\r\n", "q2r": 1, "assessor": "z_assessor_757", "no_vca": 23, "ne": 2, "ng": 15, "nfo": 6, "vca_o": 1}], "solution": "Créez un avatar d'IA pour effectuer des gestes en langue des signes à partir de la parole. La reconnaissance vocale peut être utilisée pour générer plusieurs agents simultanément.", "experience": "J'aime penser à des idées d'utilisation de l'IA, mais je n'ai aucune expérience de leur mise en œuvre."}