{"id": 382694, "author": "encinitas", "title": "SingularityNet Asset Tracker", "url": "https://cardano.ideascale.com/a/dtd/382694-48088", "category": 26247, "amount": 66000, "description": "Cardano ne dispose pas d'une application alimentée par l'intelligence artificielle pour suivre les jetons et prédire les mouvements de prix futurs.", "funded": 1, "upvotes": 44557075, "downvotes": 9460650, "votes_result": 35096425, "votes_cast": 152, "f6_no_assessments": 3, "f6_rating": 3.5555555555555554, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal has a very tight connection with SingularityNet (through the Opencog AI framework), uses AI in a suitable way, and proposes an application that could have broad interest to cryptocurrency traders and others if successfully implemented (although publicly-available price predictions can be a self-fulfilling prophecy). Of the proposals that I have reviewed so far in this challenge, it does by far the best job of meeting the challenge brief.", "q0r": 5, "q1": "The team seems to have good development experience, and the development plan is sensible. However, there is fairly little information about team capabilities (with little information on team members other than Jack Belleau) and those capabilities seem to be more about blockchain than AI. Therefore, I agree but do not strongly agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal includes a clear and reasonable set of milestones for 3, 6, 9 and 12 months, and these can be used to audit the proposal. However, there are no specific metrics on how to define success of the AI price-tracker application (e.g. RMS error on out-of-sample data over a given time interval), which will be important both to test the algorithm and to audit the project. Accordingly, I agree but do not strongly agree that the information provided is sufficient to audit the proposal.", "q2r": 4, "assessor": "z_assessor_495", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "This proposal is about developing a service on SingularityNet that utilizes artificial intelligence to track tokens and other assets that trade on Cardano. The problem is clearly defined, suitable to the given challenge, and the proposed solution is clearly described [with a specific roadmap, budget distribution, and KPIs,...]. As a result, it addresses this challenge and shows the potential impact on the Cardano ecosystem as a whole. Therefore, based on the given information, I agree with this proposal's impact, I can rate it with a score of 4.", "q0r": 4, "q1": "Team profile is briefly provided and enough for understanding, shows suitable skill, and experiences for implementation, but only one member can be verified by external link (Founder and CEO). The plan was well-prepared, with a clear and specific roadmap and a clean structure of budget distribution. However, KPIs/metrics and risk are not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "This proposal provided a lot of information that can be verified. However, for better understanding, members' profiles, KPIs/metrics, and risk should be added. Based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 19, "ne": 2, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "The proposal addresses Cardano's lack of an artificial intelligence-powered application to monitor token prices and predict future price movements and offers a solution to develop a service on SingularityNet using artificial intelligence to track tokens and other assets traded on Cardano. However, the AI ​​solution has not been clearly described in the proposal and I understand that this proposal is only in the early stages of developing research papers until September, the demo will be available. There are already many products that track tokens and predict prices according to models on other platforms, the proponent needs to distinguish his solution from the competition and target the needs of those who", "q0r": 3, "q1": "The proponent should add plans, methods or demos to better describe the proposed solution. Proponent should state other costs - $5,000 not specified for what, 30$ per hour with 1,000 developer hours estimate is reasonable but details to do for 1000 hours should be clearly stated (Example: number of participants and number of developer hours worked in each of the 6, 9 and 12 month periods). Another point is that the proponent has a description of the marketing costs, but this is not included in the plan. The identity, expertise and experience of the proponent were not found on public social networking sites.", "q1r": 3, "q2": "The proponent stated in the answer to the question comment this is a free product for users, which is great. I don't see a clear roadmap for each product function, but only the goals to be achieved according to the timeline. SingularityDAO is developing a similar DynaSets project, proponents can state the advantages, disadvantages, challenges and risks for their products for better development solutions", "q2r": 3, "assessor": "z_assessor_697", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "Développer un service sur SingularityNet qui utilise l'intelligence artificielle pour suivre les jetons et autres actifs qui s'échangent sur Cardano.", "experience": "Encinitas Labs est une startup basée en Californie du Sud qui se concentre sur la construction de projets blockchain innovants."}