{"id": 384112, "author": "mattikle", "title": "An AI Domain Specific Language", "url": "https://cardano.ideascale.com/a/dtd/384112-48088", "category": 26247, "amount": 79950, "description": "La création de services d'IA personnalisés pour résoudre des problèmes complexes du monde réel est généralement fastidieuse, longue et difficile.", "funded": 2, "upvotes": 86878767, "downvotes": 7217173, "votes_result": 79661594, "votes_cast": 461, "f6_no_assessments": 4, "f6_rating": 4.5, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a proposal by a group of SingularityNet researchers to create a system where by users can define the AI capability required of a smart contract and then automatically find AI services on SingularityNet which provide it. \r\n\r\nObviously a condition precedent for this to work is a large number of  AI services on SingularityNet both overlapping and broad in coverage within which to search. \r\n\r\nObviously delivering this product effectively meets the challenge breif.\r\n\r\nWhether it is tractable is another question.", "q0r": 5, "q1": "The proposers are well experienced both in the research area and the specific SingularityNet  domain. \r\n\r\nThey have a strong idea and a detaield work plan to get there. \r\n\r\nThis seems like a very ambitious project. I have experience in this space having a PhD and research work in ML and I am not convinced it necessarily a tractable problem. Hence I have only given it a 4 as I think its not a fait acompli it will be successful.\r\n\r\nHowever the point of this challenge is to support SingularityNet work, and if we are not going to support their researchers on a project like this then the challenge doesn't make much sense. ", "q1r": 4, "q2": "The proposal has clear delivery points on which progress can be audited. Success has been defined in terms of technical delivery which can be measured. I would like to see success more measured usage of the product as well so we can see the impact it has. If its built but not used can we say it succeeded?", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 29, "ne": 4, "ng": 24, "nfo": 1, "vca_o": 1}, {"q0": "This project could help consumers in finding the right AI-service for their needs through a Domain Specific Language (AI-DSL). So basically it would function much like a marketplace search-engine, utilising smart-contracts to identify needs and connect those needs to services that might apply as a solution. It could help bridge producers with consumers, accelerating the ecosystem's economy. This will be needed in the near future. ", "q0r": 5, "q1": "The proposers are 3 doctoral AI-researchers and 1 Idris-developer. The plan is very structured with clearly set development phase deadlines, accompanied with respective budget breakdowns. All this provides a professional impression on the mode of operandus this team operates under. The requested budget is realistic for this project's development, as is made clear in the budget breakdown. What is unclear is who would write the smart contracts needed for this project. Consider using the seek-tags in order acquire a Plutus-engineer to assist with this. ", "q1r": 4, "q2": "The plan layed out in phases, clarified with timespan per phase in a roadmap and budget brakdown per phase makes this proposal highly auditable. There is still room for improvement, though. Some more information on the team's identity besides some github-profiles would be nice to confirm that the proposers are indeed doctoral AI-researchers. I've noticed that one of the github-contributors is Kabir Veitas, the NuNet CEO. Some elaboration on these ties would be nice. Is he part of this proposing team? To further improve the project's proposal, there could also be a KPI added. (How many searches are you aiming to accommodate after a given amount of time?) ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 25, "ne": 11, "ng": 14, "nfo": 0, "vca_o": 1}, {"q0": "The proposer plans on building an easy-to-use marketplace where users can write down their problems on a smart contract that connects them to the right AI service. This would solve the complexity of AI to an understandable level for all users and boost the ecosystem by utilizing the smart-contracts.", "q0r": 5, "q1": "Regarding roadmap and budget breakdown you can't get better than this proposal. They define each task that needs to be done in different categories and assign them a letter/number. After this, the roadmap/budget is provided with this assigned letter/numbers. This gives full clarity on what needs to be done and where the budget is going. Speaking on feasibility, the roadmap and budget are within realistic terms.", "q1r": 4, "q2": "The roadmap provided is broken down into months which makes it easy to follow the progress of the project. They provided a full technical report of phase 1 in GitHub which gives us reason to believe they will continue to do so with the development of the project. One thing that this proposal could use is some metrics the proposers see as success. how many smart contracts do you which to apply within a set of months?", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 19, "ne": 1, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "The proposal outlines an AI domain specific language that aims to make it easier to use the SingularityNET marketplace by allowing people to write specifications as to what they need and allowing AI to use the relevant services available to give the user the desired end result. Making SingularityNET easier to use in these more complex scenarios would be an effective way to improve the user experience and save the end user time. The potential for this proposal to have high impact in the SingularityNET ecosystem is high due to this.\r\n\r\nIf executed well this proposal has the potential to be highly scalable and widely used in the ecosystem. The team also works within SingularityNET so have extensive experience in this focus area. There is a high chance this proposal can produce a large positive impact to the ecosystem.", "q0r": 5, "q1": "The team are made up of people already working in SingularityNET making them very suitable to the skills required for the complexity of the task that has been detailed. As well as this the proposal team have already been working on this problem and this proposal will help them take it to the next step. A technical report was provided detailing some of the early accomplishments which shows evidence towards the feasibility of this ongoing work. Tasks are clearly defined with budgets that correspond to them making the budget clear, the total value requested is also very reasonable given the track record of the team.", "q1r": 5, "q2": "The team break down the tasks and the timeline for when to expect the deliverables with the exact tasks that should be completed within each bracket. The tasks and milestones are very clearly laid out and the clarity of the proposal and their intentions is also easy to follow. The only improvement here would be it would be good to understand more what success could look like in terms of adoption. What are the types of consumers that may use it early one? How will that be tracked? A statement about usage metrics being made public or being analysed by the team as a report could also be another area that helps present the success of the proposal to the community.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 16, "ne": 5, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "Créer un AI-DSL pour découvrir et connecter automatiquement les services d'IA disponibles sur le marché afin de résoudre des problèmes réels donnés.", "experience": "Trois chercheurs doctorants en IA et un développeur ayant une grande expérience d'Idris."}