{"id": 384882, "author": "bodhi", "title": "The untapped potential of eco-data", "url": "https://cardano.ideascale.com/a/dtd/384882-48088", "category": 26247, "amount": 59265, "description": "Ai manque de grandes quantités de données écologiques granulaires et de moyens permettant aux gens de mettre en œuvre des solutions climatiques.", "funded": 1, "upvotes": 42227849, "downvotes": 8812475, "votes_result": 33415374, "votes_cast": 145, "f6_no_assessments": 6, "f6_rating": 3.722222222222222, "videos": [], "media": [], "f6_assessments": [{"q0": "Very nice proposal in a nicely readable format. This is a good example of how to create an idea that is beneficial for all parties involved. The proposal proposes a symbiosis by providing granular data for SingularityNet, transactions on the Cardano-blockchain and the creation of NFTs. It would also help support the ecological reputation of Cardano and fortify positive carbon emissions. Maybe there is a collaborative opportunity with Veritree, who are currently raising funds to plant a forest of 1 million trees as presented on the Cardano Summit. There could be a lot of data to be generated from planting such an amount of specimens. ", "q0r": 5, "q1": "The proposer has unconfirmed relevant experience in the forestry industry. There are claims of unknown industry connections. There is a clearly set temporary roadmap. All good indicators, but to  reach a great score in terms of feasibility it needs a little more detail that can be confirmed. It also needs clarification as to who will code the smartcontracts? ", "q1r": 3, "q2": "In terms of auditability the proposal is sound. There is a periodic definition of success, a detailed budget breakdown and the challenge has been met. What could improve it is some identification on the proposers. Well written proposal, though. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 24, "ne": 4, "ng": 17, "nfo": 3, "vca_o": 1}, {"q0": "Ideas like this are what we need not only for creating a good connection between our two systems but also for the environment. By providing a tool for ecological data gathering and incentivizing members to provide the data. A perfect example of what new technologies are capable of. What I would suggest is looking for collaboration possibilities. I saw in the comments that already one is interested in opening talks.", "q0r": 5, "q1": "What we are missing is reference links on the relevant experience of the team. They state to have 20+ years in forestry but don't provide any evidence of this. It would've been great to include this. The team gives a clear indication that they know what they're talking about and looking at the roadmap this project seems reasonable. We also need information if the team still needs to hire anyone or not?", "q1r": 3, "q2": "Regarding auditability, the proposal has what it needs.  It provides us with a clear roadmap and looking at the spreadsheet provided in the attachments a well-explained funding breakdown. As stated above we need more information on the team to give a full-go for audit.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 20, "ne": 1, "ng": 16, "nfo": 3, "vca_o": 1}, {"q0": "This is an excellent project. Planting trees is important to the environment and combating climate change, the concept is clear and appears novel, and the would provide something of which both Cardano and SingularityNet could be proud.\r\n\r\nHowever, the connection to AI is not well-developed in the proposal, and seems mostly about \"AI needs data\" (which is true). But what kinds of AI-related uses would be made with these data? One good example provided for use of the data involves map accuracy, but that is not about AI. \r\n\r\nFor these reasons, I agree but do not strongly agree that the proposal effectively addresses the challenge.", "q0r": 4, "q1": "Bodhi and Michael apparently have many years of experience with tree-planting, which is encouraging. Furthermore, they are clearly committed to the concept of ForestMe, which is well-articulated.\r\n\r\nHowever, they do not describe what type of experience they have in forestry, and whether it provides the expertise needed for this kind of data-driven venture. There is no mention of experience with AI.\r\n\r\nFor these reasons, I agree but do not strongly agree that the plan presented indicates that it is highly likely that the proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal provides a set of key metrics and milestones that can be used to audit the proposal. However, given the nature of the proposal, I would have expected there to be metrics regarding trees (e.g. how many planted) and data/AI (e.g. how many data points generated, use in data science applications).\r\n\r\nTherefore, I agree but do not strongly agree that the information presented is sufficient to audit the progress and (especially) success of the proposal.", "q2r": 4, "assessor": "z_assessor_495", "no_vca": 18, "ne": 6, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is about creating a system incentivizing people to collect data from work that benefits the environment. This is a great and interesting idea. The problem is quite abstract, however, the solution is clear, fits the challenge, clear potential impact. Based on the given information, I agree with this proposal's impact, I can rate it with a score of 4", "q0r": 4, "q1": "Team profile is described enough for understanding, with suitable skill, experiences is suitable for implementation, with reference/proof (documents/links,...) for verifying. Budget explanations of calculation base should be provided. Risk is not provided. Therefore, based on the given information, I am neutral with this proposal's feasibility, I can rate it with a score of 3", "q1r": 3, "q2": "There is a lack of budget explanations of calculation base and KPIs/Metrics.\r\nTherefore, based on the given information, I am neutral with this proposal's auditability, I can rate it with a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The collection of ecological data that reflect impact on climate is a stringent need which this proposal addresses. ", "q0r": 5, "q1": "The proposers are forestry enthusiasts with significant work and relevant results at their expertise. However given the lack of technical expertise and reliance on the Cardano and SingularityNET developers induces a risk which has to be factored in.", "q1r": 4, "q2": "The budget is very well detailed and makes sense for the equipment and work amount needed. The solution proposed is excellent and if accomplished will constitute a significant innovation in the \"Eco-Tech\" field which most certainly will be adopted at scale.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "Increasing the amount of data available about the environment around us is a valuable cause that could help lead to solving problems with plant diversity, density and population size for these different ecosystems. \r\n\r\nThe proposal mentions the process on their website of what is recorded when performing the planting process. What is lacking here is how it is incentivised and also audited so that the data is correct. Any data modelling exercise to train AI systems is only as valuable as the data collected. It would be good to understand how they ensure there are no malicious actors when an incentive system is introduced. \r\n\r\nAnother area that isn't explored in detail is any ongoing data and if or how that is collected. Saplings survival rate is not 100%, as such this should be mentioned on whether this is just accepted as an issue for now or whether it is an area of focus so that the data doesn't become more meaningless over time due to not understanding the current survival of the planted ecosystem.\r\n\r\nFinally the job itself of planting more tree's and collecting the initial data is definitely one of impact. However in the context of this challenge it is not perfectly clear exactly how this data will be used and what applications will benefit from it in the short and longer term concerning the data model and AI specifically. It would be great to more fully understand the application of the suggested data to AI more than what has been detailed. Currently the proposal reads more like a project trying to find a home where they can get funding rather than one truly focussed on creating impactful AI solutions. With more information and clarity here a better impact score could definitely be given in the future.", "q0r": 3, "q1": "The proposal details two team members as part of the project that have a combined experience of 20 years in forestry. It is clear they have the experience to understand the environmental side of this project however it is very unclear on what technical skill level the team members have and also who they have or are trying to onboard to work on the project. Working with SingularityNET and Cardano requires a certain technical skill and without a thorough plan or evidence as to how the team will be implement it would be difficult to say the chance of feasibility is high.", "q1r": 2, "q2": "The proposal details an overview and roadmap but currently has no KPIs or success factors listed. There is some clarity on what they are trying to achieve however no information provided on the key things that would be explored to gage the success of the proposal. This especially is important as to gaging whether the data collected is actually of any value and the applications of where that data is used. \r\n\r\nIf the proposers could add better details about the data collected and how that could impact various applications with the metrics that are key then this would help to justify a better auditability rating.", "q2r": 2, "assessor": "z_assessor_758", "no_vca": 16, "ne": 6, "ng": 9, "nfo": 1, "vca_o": 1}], "solution": "Un système incitant les gens à collecter des données sur leur travail au profit de l'environnement ; une communauté construite sur ce système peut changer le monde.", "experience": "20 ans d'expérience en sylviculture, supervision de la plantation de plus de 27 millions d'arbres.\nEsprit d'entreprise, gestion de projet, relations avec l'industrie, grand voyageur."}