{"id": 381786, "author": "gn4n4", "title": "Multilingual quality content", "url": "https://cardano.ideascale.com/a/dtd/381786-48088", "category": 26252, "amount": 53000, "description": "O conteúdo de qualidade sobre cardano precisa estar disponível em vários idiomas. Para evitar desordem. O mesmo conteúdo deve ter múltiplos fluxos de áudio.", "funded": 0, "upvotes": 15913451, "downvotes": 26964453, "votes_result": 11051002, "votes_cast": 98, "f6_no_assessments": 7, "f6_rating": 3.2380952380952377, "videos": [], "media": [], "f6_assessments": [{"q0": "A idéia em si corresponde aos objetivos do desafio, pois pretende criar uma plataforma de vídeo, com apenas conteúdo de qualidade (selecionado pela comunidade) demonstrando como o Cardano pode ser aplicado na vida real, e estes vídeos seriam traduzidos em diferentes idiomas. Os autores argumentam que a absorção do conhecimento é melhor quando se trata de sua língua materna, o que faz muito sentido, pois a pessoa não estaria lutando duas vezes mais para entender o que está sendo ensinado do que para entender uma língua diferente. Embora a idéia seja em teoria uma boa idéia, houve um detalhe que achei muito prejudicial para o sucesso: o fato de que apenas uma amostra destes vídeos seria disponibilizada gratuitamente, se a pessoa quisesse vê-la em sua totalidade, ela teria que pagar uma taxa todos os dias. O que iria para o criador. Bem, eu acredito que existem muitas plataformas na internet com conteúdo em cadeia de bloqueio, e através de nosso esforço aqui no Catalyst, mais e mais conteúdo sobre Cardano será criado e divulgado. Sendo estes conteúdos livres e facilmente acessíveis, em diferentes idiomas (como procuramos financiar este desafio, por exemplo, e também em desafios que se concentram em diferentes territórios, como África, Japão e América Latina). Por que uma pessoa iria querer pagar por tais aprendizados se existem tantas alternativas gratuitas? Não creio que o melhor método de incentivar novas pessoas a entrar no ecossistema Cardano seja fazê-las pagar uma quantia por ele, por menor que seja. Em minha opinião, é mais apropriado fornecer educação e treinamento gratuitos para que eles adotem nossa cadeia de bloqueio e nossa moeda, adquiram NFT, contratos inteligentes e as várias tecnologias em Cardano. Mais tarde, com pessoas que já são usuários de nossa rede, uma série de ações pagas pode ser promovida, mas não acredito que o momento para isso seja nesta porta de entrada para Cardano. Outro ponto sobre o qual eu estava me perguntando era a questão das traduções. A comunidade faria estes áudios traduzidos, como eles seriam sincronizados com a imagem, quem editaria isso? Estas traduções seriam pagas? Porque não me parece muito lógico cobrar alguém para assistir ao vídeo para que o dinheiro fosse repassado ao criador do conteúdo e também não há nenhuma parte para os tradutores. Infelizmente, achei que a idéia tinha várias desvantagens e não acho que teria um impacto imediato e considerável sobre o ecossistema Cardano.", "q0r": 2, "q1": "A equipe é bastante completa e parece altamente qualificada; os nomes, funções e vínculos de cada um dos membros são fornecidos. No entanto, senti falta de pessoas de marketing e design para trabalhar no projeto, que são áreas extremamente importantes para o sucesso, pois esta plataforma precisa ser altamente divulgada e ter uma interface ergonômica e amigável para incentivar seu uso. Nas fases de implementação é mencionado o projeto UI/UX, mas quem seria responsável por isso? A equipe propõe um roteiro, mas extremamente curto, falando sobre o que aconteceria ao longo do tempo. Por exemplo, nos primeiros 3 meses, a plataforma seria criada com ferramentas básicas (quais?). As fases de implementação poderiam ter sido intercaladas em meses, por exemplo, no mês 1 esta e aquela atividade seria feita e assim por diante, a fim de formar um sentido mais sólido do processo como um todo. Acho que faltavam muitos detalhes, não consigo entender como esta plataforma seria criada, as fases de implementação em si são escritas de forma muito técnica, de modo que as pessoas fora da área não entendem tão bem quanto os desenvolvedores o que seria feito. E finalmente, a divisão financeira também está faltando detalhes, acredito que sejam os números ao lado das coisas mencionadas nas fases de implementação, mas gostaria que os autores tivessem separado um tópico apenas para falar sobre dinheiro e explicar por que esta quantia seria usada para o quê e dar mais detalhes sobre cada pequena parte. Por exemplo, como eu entendo, 2000 dólares iriam para o projeto da UI/UX, mas como seria isso? Qual seria o preço por hora da pessoa (designer?) que seria responsável, por quanto tempo você desenvolveria este projeto? Em geral, a única parte deste tópico que eu me senti completamente seguro foi a apresentação da equipe, caso contrário, eu gostaria de mais detalhes.", "q1r": 3, "q2": "Os autores nos fornecem alguns KPIs que poderiam servir como guias para monitorar o projeto, que são basicamente o alcance do público desta plataforma e se isto está trazendo como conseqüência a entrada de novos participantes (falantes de diferentes idiomas) para a comunidade Cardano . Eles também prometem publicar relatórios com os resultados destes KPIs, o que é bastante positivo, basicamente todos os concorrentes fornecem KPIs (quando o fazem!), mas deixam ao critério da comunidade monitorá-los ou não. O que eu não entendi foi onde esses relatórios seriam publicados e também acho que houve uma gralha aqui, porque eles dizem que até os primeiros seis meses eles vão publicar os resultados mensalmente e depois desse período, mensalmente...? De qualquer forma, gostaria que eles esclarecessem onde nos mostrariam esses dados e esclarecessem a questão de quantas vezes isso seria feito. Mas, caso contrário, é ótimo que eles tenham a iniciativa de atualizar a comunidade e não gerar a necessidade de que um de nós se encarregue disso.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 15, "ne": 11, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "The proposal identifies the problem of the need for Cardano's contents to be available in several languages. As a solution, it presents the construction of a platform where other users can dub the audio stream in their native language. This is a great idea to facilitate non-English speakers' access to information about Cardano and is in line with the challenge of attracting more non-English speakers to the Cardano ecosystem. The proposer does not present a plan to remain financially sustainable after funding from Catalyst. ", "q0r": 4, "q1": "The proposer identifies and provides evidence of the experience of the team members. The budget is detailed and seems a little overpriced. A realistic timeframe for completing the proposed work is established. The proposal presents a roadmap that is good for evaluating the progress of the work, but I think it could be better detailed. The proposer did not consider any relevant risk for implementing the proposal. ", "q1r": 4, "q2": "The target problem and its solution were clearly presented. The proposal contains a roadmap with milestones that is important to assess the progress of the work. But I leave a note that I think the roadmap could be more detailed. The KPIs that are important for evaluating the success of the proposal were also provided.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 15, "ne": 2, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "This seems to be the platform every non english speaker developer would love to visit. Instead of wasting time translating the tutorial, the subtitles or the dub will guide the developer right into the technical issues he/she is trying to solve. I like the fact an incentive in ADA is given to the creators.", "q0r": 5, "q1": "The team is well referenced and experienced, and the plan takes in account review steps and a proof of concept stage", "q1r": 5, "q2": "The time line is effectively outlined, as well as the budget breakdown. Although the total requirement is about 50% of the total budget allocation for this challenge, this platform alone could solve effectively the challenge. ", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This proposal is well structured and has lots of good facts in it but they should state how they are going to get people onto this platform, because there is no mention of marketing. Their budget is also quite pricey for the type of task that they are doing.", "q0r": 3, "q1": "The proposer/s have good experience in this area, they also have a roadmap but its very short and simple with not much detail given. It doesn't say in the proposal how they will get people watch and listen to their audios and videos.", "q1r": 3, "q2": "It will be quick to audit because there is a roadmap and timeline. It's also a simple plan so it will be easy to check on success. Something that this proposal is missing is a more detailed roadmap.", "q2r": 4, "assessor": "z_assessor_585", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "It seems that your project will help to reach the goal wanted by the challenge. In addition, in order to promote it, you should work on how you will market your project (advertisement, on which plateform, the budget allocated etc…). In order to be sure that your platform will touch a maximum of cardano user in every language, you should also prepare your plateform in many language (you should had a phase of translation in the phase of implementation)", "q0r": 4, "q1": "The project seems well prepare. In my point of view, you need to describe more what your team is composed of and also in what phases of implementation they will work.\r\n In order for your plateform to be multilanguage you should have to your team translators. \r\nIn addition I think you have to precise what form will take your project: is it an app?, available on which platform ? You need to describe more where you will use your software\r\nFinally I think you have to prepare how you will operate the plateform after the release (budget, final team etc…)\r\n", "q1r": 3, "q2": "I only think that you need to clarify more how you will manage the members and advisors of your platform in order to be sure that the comments are impartial. You should think of a KPI measuring this", "q2r": 4, "assessor": "z_assessor_602", "no_vca": 15, "ne": 3, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "As my reading, the proposal's target is a platform in which the community is the key to: decide videos content, create videos, dub the  videos, vote on videos quality,etc. In my opinion, the proposal is not impactful because it is not clear about the following points:\r\n1. What makes community to be attracted to engage in the platform? (I suppose that they come to the platform somehow).\r\n2. What makes community to create Cardano videos instead of another content?\r\n3. What makes people from many regions come to dub videos so that the videos content becomes multilingual as the proposal's title?\r\n…\r\nI assess the proposal does not address the objectives laid out in the challenge completely.\r\n", "q0r": 1, "q1": "I strongly disagree the proposal is feasible because it is not clear about the following points:\r\n-How could the proposers attract people from the community join the platform and create videos turorial 'like a contest'? (No cost for this creation in budget broken down)\r\n- How could the proposers attract people from the community join the platform and translate the soundtrack of the videos into their native languages? \r\nToo much risk for building the content of the platform, I assume.\r\n-Budget $53000 is more than 50% of total budget of the challenge, for building a platform (in which the content may not be created by the community based on the unclear plan) in 12 months. That is not reasonable.", "q1r": 1, "q2": "The solution of the plan (about creating the content of the platform) is not clear as I mentioned above. Moreover, roadmap with milestones and items in budget broken down list are for building the platform only, while KPIs are for auditing the content of the platform. Therefore, I strongly disagree the proposal is auditable.", "q2r": 1, "assessor": "z_assessor_714", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"q0": "In terms of ideas, this is a useful proposition. Currently, there are many platforms that provide educational videos, but most of them are in English, and the video quality is not perfect. This recommendation build a platform, where cardano use case videos can be uploaded. And other users can dub the audio stream in their native language online.", "q0r": 3, "q1": "The team consists of many members, they have full knowledge and skills, have certain successes, this will be a solid basis to make the project implementation easier.\r\nHowever, the roadmap and plans provided are too sketchy. There should be more criteria to choose a video/background music, for example: specifying video length,... Visitors want full content, need to pay a fee, specifically how much ? If necessary, I think the full content should be provided for free, because the vast majority of people tend to ignore the paid content.\r\nIt is also necessary to clarify the budget allocation (determine the number of hours worked, the amount per hour,...) It is also essential to provide a way to attract people to the platform (marketing, communication, etc.) , social network,...)", "q1r": 2, "q2": "The content provided is not really complete, there is no basis to evaluate the success of the project. The exporter needs to provide more detailed information about the specific long-term roadmap/marketing/budget allocation/... (as I mentioned in the previous section). In addition, the success criteria should also be described (eg: number of hits, number of downloads, number of positive comments,...), clearly defining difficulties- challenges encountered and how to deal with them are also essential.\r\nThis is a very good proposal, the team needs to work together, edit and add to this proposal, don't give up.", "q2r": 2, "assessor": "z_assessor_862", "no_vca": 14, "ne": 3, "ng": 7, "nfo": 4, "vca_o": 1}], "solution": "Construa uma plataforma, onde os vídeos de casos de uso do cardano possam ser carregados. E outros usuários podem dublar online o fluxo de áudio em sua língua nativa.", "experience": "Mehmood deitar as mãos a Cardano.\nWaheed Fullstack Developer 10+y exp.\nFrancis Filmaker com conhecimentos em Didatic\nGnana Businessanalyst\nRaja PM"}