{"id": 382808, "author": "babaelliot", "title": "PLUTUS/CATALYST RESOURCE IN SWAHILI", "url": "https://cardano.ideascale.com/a/dtd/382808-48088", "category": 26252, "amount": 20000, "description": "150 milhões de falantes de swahili na região da África Oriental não têm acesso à educação e a recursos que os tirem da pobreza", "funded": 1, "upvotes": 33285853, "downvotes": 8055897, "votes_result": 25229956, "votes_cast": 109, "f6_no_assessments": 7, "f6_rating": 3.3809523809523805, "videos": [], "media": [], "f6_assessments": [{"q0": "A idéia é boa e está relacionada aos objetivos do desafio, pois procura trazer aos falantes de suaíli conteúdos relacionados com o ecossistema Cardano. Isto permitiria muito bem alcançar o que o desafio exige, ajudaria na disseminação de nossas tecnologias para os não falantes de inglês. Entretanto, acho que a proposta foi explicada um pouco superficialmente. Não é exatamente o que o conteúdo traduzido é. Sabemos que seria sobre Plutus e Cardano, mas isso é apenas a superfície. O que, dentro destes assuntos, seria dito? Que temas, em que ordem e por quê? Várias frentes são prometidas: tradução para swahili em sites importantes para Cardano; criação de um portal de notícias; de um podcast... Há muitos lugares, mas nenhum deles é devidamente explicado. Por exemplo: com que freqüência os conteúdos dos sites pré-existentes na escola? Que conteúdo seria coberto no podcast, e por quê? Com que freqüência o novo portal de notícias seria alimentado, seria notícias locais ou globais? Infelizmente, não é possível ter uma boa compreensão da parte prática da proposta. A questão é real e relevante, embora eu lembre que não há propostas com o objetivo de gerar traduções em suaíli, mas certamente há sempre mais a ser feito: a questão aqui seria medir como isso seria feito, muitas vezes, como atingiria o público alvo e assim por diante. Sem tais dados, é difícil definir o impacto tanto para o país quanto para o ecossistema Cardano.", "q0r": 2, "q1": "A equipe não estabelece um roteiro pré-definido para cumprir com ações pré-definidas. Sabemos muito bem o que seria feito, neste caso, as várias coisas. Mas isto é diferente da elaboração de um plano de ação. Um cronograma poderia ser estabelecido, no qual os autores esclareceriam como tais traduções/criação de conteúdo seriam feitas. Por exemplo, na mesma semana, o conteúdo pré-existente seria traduzido e 1 novo assunto seria criado no podcast e no portal de notícias? Como seria esta freqüência? Que assuntos seriam tratados, em ordem? Quem faria o que para que as coisas acontecessem? Acredito que um roteiro deveria ser estabelecido, não mesmo em fases, mas com a programação exata do que seria feito, quando e por quem. Em relação à equipe, esta parte é excelente. Sabemos quem são os envolvidos, quais são suas origens e o que fariam no projeto, e é muito positivo que tenhamos aqui pessoas que conhecem a cadeia de bloqueio Cardano. Muita confiança é transmitida para a equipe na realização deste projeto, e é especialmente válida quando eles afirmam que estas traduções seriam feitas de nativo para nativo - o que torna alto o grau de compreensão. E sobre a divisão financeira, há detalhes, mas poderia ser mais aprofundada. O valor total é dividido em tópicos, o que dá uma boa compreensão de como o dinheiro solicitado seria gasto. Mas quando eu digo que poderia ser mais detalhado, por exemplo: \"marketing - US$ 2.200\". Não sabemos como este dinheiro seria utilizado em detalhes. Não está definido em nenhum momento como seria a campanha de marketing, o que seria necessário para entender o uso deste dinheiro. E assim por diante para os outros tópicos: alguns são bastante simples e não precisam de tantos detalhes, enquanto outros precisam. Gostaria de fazer uma observação: embora o financiamento seja alto, achei que o salário dos tradutores e editores era baixo, acho que eles mereciam mais por seus esforços. Quem sabe, a quantia solicitada poderia ser distribuída novamente, a fim de fazer um pagamento mais justo?", "q1r": 3, "q2": "Creio que esta proposta é muito auditável. Acho que isto se deve ao fato de os autores listarem vários objetivos que desejam atingir - portanto, temos muito conteúdo a ser monitorado. Embora não tenham sido estabelecidas métricas de sucesso e KPIs exatos, é possível verificar se as informações passadas na sessão de planejamento detalhado foram alcançadas ou não. Penso que o acompanhamento poderia ser feito de duas maneiras: de dentro para fora ou de fora para dentro. De dentro para fora: os próprios membros da equipe poderiam preparar relatórios resumindo o progresso das atividades, como as traduções estavam sendo realizadas, como o podcast estava sendo gravado, a construção da página de notícias... Verificar dados tais como: alcance do público, menção em redes sociais, interação do público, conteúdo lançado por semana e assim por diante. E uma análise externa também poderia ser feita: como este projeto estaria impactando a comunidade swahili? Uma pesquisa poderia ser realizada diretamente com o público, a fim de entender se os objetivos foram alcançados na prática, ou seja, se eles pensam que a disponibilidade e a qualidade do conteúdo em seu idioma local foi realmente aumentada. Seria interessante se os próprios habitantes do país pudessem fazer um retorno direto à comunidade cardanófila. Mas em geral, acho que sim, este tópico é bem abordado, só não é perfeito porque ainda faltam aqui KPIs e indicadores de sucesso, de uma forma direta.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 16, "ne": 11, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Esta proposta identifica um problema que os falantes de swahili na região da África Oriental não têm recursos disponíveis para acessar e educação para proporcionar conscientização.\r\nA proposta construiria uma forte base e conexão dos Projetos com os indivíduos nativos, estabeleceria representantes locais, forneceria conteúdos de fácil compreensão e ajudaria a atrair usuários e especialistas da comunidade nativa de Cardano nesta região. Isso ajudará a agregar valor ao ecossistema Cardano.\r\nA conscientização da comunidade Cardano na Tanzânia é um bom objetivo alinhado com os desafios delineados, mas o proponente precisa deixar claro as principais métricas, tais como: o número reduzido ou proporção de pessoas enganadas ou a quantidade de usuários e especialistas atraídos na comunidade Cardano na região da África Oriental após 12 meses,...", "q0r": 3, "q1": "O proponente fornece links de referência para habilidades e experiências relevantes de cada membro da equipe, mas descobri que nenhuma pessoa tem experiência de tradução necessária para implementar a proposta, mas eles são quase criadores de conteúdo com experiência em Mercado Financeiro e Forex e Tecnologia Blockchain, não em particular na Cardano. Somente Angela tem experiência em Cardano (Coder, Plutus Pioneer, Membro da equipe da Prefeitura do Leste,...) mas não encontrei nenhum link para referência a este membro não-oficial.\r\nAcho melhor que o proponente acrescente alguns membros com habilidades de tradução e experiência para convencer muito mais a viabilidade desta proposta.\r\nO orçamento é delineado claramente, mas precisa ser dividido em itens identificáveis, tão específicos quanto: 200 dólares por mês para um tradutor de conteúdo precisa ser dividido em número de materiais/documentos com número aproximado de palavras traduzidas e calcular seu orçamento com base em cada palavra, dividindo o orçamento para marketing em número de membros, quantas horas de trabalho e em qual canal...,...\r\nOs autores não consideraram desafios e riscos relevantes para uma implementação bem sucedida e como mitigá-los, por exemplo: a qualidade do conteúdo traduzido não atende às expectativas e o conteúdo escolhido não é adequado para a comunidade nativa, portanto, como controlar e melhorar a qualidade da tradução e as formas de obter feedback da comunidade sobre o conteúdo que precisa ser alimentado.\r\nEm geral, não concordo nem discordo que seja altamente provável que esta proposta seja implementada com sucesso.", "q1r": 3, "q2": "O autor desta proposta apenas listou todos os trabalhos a serem feitos, mas não deu roteiro e marcos e um horizonte temporal para a realização. Seria melhor que o proponente desse marcos e horizontes temporais claros, como por exemplo: Colaborar com a EBU e a Prefeitura do Leste para traduzir e fornecer educação (1º mês), Criar uma página da Web com artigos cobrindo notícias atuais relacionadas ao Cardano (2º mês),...  \r\nFaltam métricas ou KPIs adequados a este desafio. É melhor que o Autor faça métricas/KPIs detalhadas, como por exemplo: Quantos documentos Cardano importantes traduzidos por mês, Número de participantes do Leste Africano que se juntam e interagem no canal de comunicação, Número de podcasts Cardano publicados no canal Swahili YouTube e quantos pontos de vista,...\r\nPor estas razões, eu não acho que esta proposta tenha boa capacidade de auditoria para acompanhamento ou acompanhamento da comunidade.", "q2r": 2, "assessor": "z_assessor_775", "no_vca": 12, "ne": 7, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "Haskell/Plutus developers are in much demand at the moment in the Cardano Community. There are a lot of talented people worldwide, who need basic access to learning resources in their native language. And this proposal sets up to do just that. Swahili is spoken by about 100 million people, as such it would be a very effective endeavour to have Plutus courses translated.", "q0r": 5, "q1": "The team have described their past experience in sufficient details and their backgrounds are abundantly diverse and have the skill to finalise this project. The plan is straightforward, easy to follow and the budget is pretty sensible as well, with enough details to give the impression of a thought-out proposal.", "q1r": 4, "q2": "While the team have put down an expected launch date and have written a roadmap for the project, there is no clear timeline and KPIs that would help the community in better evaluating the progress. I would have loved to see that written down, not just for the community, but as a step that benefits the team as well, by putting things in perspective.", "q2r": 3, "assessor": "z_assessor_20", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The problem and the solution to the problem have been identified, but it is a paradox how the solution aims to solve the problem. I understand that Africa needs a lot of resources as many people have no access to education, more precisely basic education. But people who want to learn Plutus are required to have higher education, and the questions is: why people with no basic education will want to access a high level education even it will be available in Swahili?\r\n\r\nSaying this, it is recommended that the target audience should be filtered out and find those in need for Plutus materials translated in Swahili.", "q0r": 2, "q1": "The members of the team (3) are presented and based on the provided info they seem to not possess the necessary skills to implement the project and there are no references (links) to sustain those statements about their experience (repositories, completed projects etc.) thus making Angela (who possesses the relevant to the project skills)  looking like a character and not like a human been.\r\n\r\nThe budget is outlined and broken down into identifiable items, but some of them are unclear about their meaning (what is the purpose of \"Team Leaders Fund\"?; what is the difference between \"Manager for communication channel\" and \"Podcasts Planner and speaker\"?)\r\n\r\nRoadmap and milestones (incl. time horizon) are weakly described and there are no KPIs/metrics defined to measure the success of the project. As a side note, Expected public launch should be postponed at least after the Fund7 Campaign is over.", "q1r": 2, "q2": "Based on the information provided is highly unlikely that the project will be successfully implemented as the proposal lacks in emphasizing relevant aspects.\r\n\r\nThe proposal itself reads very poorly. It reads like a concept more than an executable proposal. It needs more editing so that it can be assessed properly given its direction. Perhaps reworking it and submitting it at the later stages will work.", "q2r": 1, "assessor": "z_assessor_309", "no_vca": 20, "ne": 2, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "The project will develop the Swahili Catalyst community by realistic solution - Collaborating with EBU and Eastern Town Hall to translate and provide education on Plutus  and catalyst resources in Swahili language. ", "q0r": 5, "q1": "The team have experience on relevant fields (content creator, speaker, developer...) and include member of the Eastern Town Hall Team, indicating they have good knowledge of Cardano and the ecosystem. Plus, the plan is very detail about what is the output of the project.", "q1r": 5, "q2": "It would be more sufficient to audit the progress and the success of the project if the proposal includes the roadmap/ milestones with detail KPIs of each phase.", "q2r": 3, "assessor": "z_assessor_809", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "I agree this proposal addresses the challenge since it wants to translate Catalyst project to the Swahili language speaking community (East Africa Region - 150 million people). However, this target community is not very big compared to Japanese, Chinese or European with billions people - which need to be prioritised since Cardano has limited resources for each challenge/ fund - at this time. Therefore, I rate the impact the score of 3. ", "q0r": 3, "q1": "This proposal has a powerful team about which I think they are totally capable of running this project. I checked out their partner's Youtube channel - RFFXTZ Company, and could tell this is a rich and professional platform for supporting this team. Development planning and timeline are convincing and clear. \r\nThe only of my concern is that the budget for publishing the translation is three times much more than the fee for translation, makes this proposal cost $20,000 (one fifth of this challenge) while the community is just 150 millions people. This could be a big consideration for the feasibility for being voted and implemented. I advice the team to consider more about the budget so that this proposal will have high opportunity to be implemented successfully. ", "q1r": 4, "q2": "Unfortunately, while the proposal is well written about its impact and plan to make it feasible, there is no roadmap with milestones, key metrics for success and KPIs. I have to rate 2 for this proposal auditability because it doesn't provide me sufficient information to assess. ", "q2r": 2, "assessor": "z_assessor_836", "no_vca": 14, "ne": 0, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "This proposal would create resources in Swahili which addresses this challenge appropriately. ", "q0r": 5, "q1": "This team is already skilled in content creation, has experience educating about technology and is bi-lingual. This experience along with their full proposal (KPIs, project roadmap, and budget breakdown) suggest this project will be implemented successfully.", "q1r": 5, "q2": "Their financial information (budget breakdown) and planning information (KPIs and project roadmap) provide sufficient information to audit the proposal's progress.", "q2r": 5, "assessor": "z_assessor_866", "no_vca": 19, "ne": 1, "ng": 11, "nfo": 7, "vca_o": 1}], "solution": "Colaborar com a EBU e a Prefeitura do Leste para traduzir e fornecer educação sobre Plutus e recursos catalisadores na língua suaíli.", "experience": "- Treinador em Mercado Financeiro e Tecnologia de Blockchain na RFFXTZ Company Limited\n- Orador\n- Criador de Conteúdo e Especialista em Marketing"}