{"id": 383439, "author": "dcspark", "title": "Milkomeda documentation(JP, KR, ZH)", "url": "https://cardano.ideascale.com/a/dtd/383439-48088", "category": 26252, "amount": 4000, "description": "A documentação para Milkomeda está atualmente apenas em inglês. Queremos traduzir estes documentos para outros idiomas a fim de fazer crescer o Cardano", "funded": 2, "upvotes": 73695928, "downvotes": 17060278, "votes_result": 56635650, "votes_cast": 222, "f6_no_assessments": 7, "f6_rating": 2.9999999999999996, "videos": [], "media": [], "f6_assessments": [{"q0": "Yes, given the scope of the project and the notoriety of the proponents in the Cardano ecosystem (dcSpark), the proposal to translate the documentation of Milkomeda to make it accessible to the Spanish speaking communities clearly addresses the challenge. Understanding that Milkomeda will facilitate the move of Ethereum/solidity developers to Cardano, that Ethereum/solidity is currently the major focus of DeFi and Blockchain developers, and that many of these developers will be native Spanish speakers, It is clear that making the documentation of Milkomeda available to Spanish speakers can contribute to onboard on to Cardano, a large population of Spanish speaking developers and users.", "q0r": 5, "q1": "Yes, the experience demonstrated by the proponents through their contributions to the Cardano Ecosystem in Emurgo, IOHK and dcSpark strongly supports the possibility that this proposal is implemented successfully. The fact that the project is advanced, that the documentation to be translated is fairly advanced and available, and that developers in the team are fluent dual language speakers further supports this possibility.", "q1r": 5, "q2": "Yes, I believe that the information provided is sufficient. I understand that the nature of the project is flexible and dependent on the progress of the original English source to be translated. Nevertheless, a more structured schedule for the translations could have been provided. On a different topic, even though it is highly desirable to stretch resources as much as possible, and that I believe that the proponents can successfully execute the proposal, it is also very important that everyone's job, developers and translators, in English or Spanish speaking realms are adequately funded at least at current standard rates. My suggestion here is that in the future, the proponents may want to pursue more financial flexibility to execute the project by considering for example: professional translation rates and and economic assessment of uncertain execution.", "q2r": 5, "assessor": "z_assessor_183", "no_vca": 20, "ne": 9, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The launch of the Milkomeda protocol is in itself a helpful tool for bringing in new developers into the Cardano ecosystem. But as many of them are not native English speakers, having their documentation translated into several other languages would be most helpful and speed up their onboarding. Though I would have liked to know, based on what information, have they chosen these 3 languages as the first to have their documentation translated to.", "q0r": 5, "q1": "The team has provided enough information regarding their skills, proving that they are more than able to successfully complete their project. Their website contains all the information regarding the protocol they are building, and hiring 3 translators and one engineer to review the translated documents is a very sensible approach.", "q1r": 5, "q2": "The proposers have given a brief timeline and an expected launch date that seem to be reasonable. The budget is not very detailed, yet the task at hand is quite simple, so as not to warrant a very comprehensive financial plan. I don't see why this proposal would be hard to have evaluated for its progress.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 19, "ne": 2, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "The proposal identified the problem of the documentation of Milkomeda being only in English and presented as a solution the translation of existing documents into other languages. This proposal is in line with the multilingual challenge to motivate non-English speakers to learn and grow Cardano ecosystem. A plan was not presented to keep the project financially sustainable in the future.", "q0r": 4, "q1": "The proposer presented the website Milkomeda but did not identify the team members responsible for translating the documents. To assess whether the work will be carried out successfully, it would be important to know who are the people who will carry out the work and provide evidence of their experience/skills. The budget was not well detailed. How much does the translator cost? How much does the engineer cost? It was unclear how many documents will be translated, and it has not been said in how many languages will be translated. As well as a detailed plan showing everything that will be done at each stage was not presented. Therefore, it is not possible to assess whether the established period of 3 months will be adequate to complete the work. It would be important for a better assessment to clarify the number of documents that will be translated, establish quantitative targets for translations and say which languages the documents will be translated into.", "q1r": 2, "q2": "The target problem and its solution were clearly presented. A roadmap with milestones was not presented and no KPIs or key metrics were provided. This information is important to make it possible to assess the progress and success of the work. For example, a plan could be defined to translate x numbers of documents by the end of week 1 and so on. It could also be quantified by the number of documents translated into a given language and set targets based on that.", "q2r": 2, "assessor": "z_assessor_429", "no_vca": 15, "ne": 5, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely that Documentation for Milkomeda is currently only in English.It is clear that this proposal falls within the scope of the challenge brief by creating translations in Milkomeda languages.This proposal shows somewhat how it adds value to the Cardano system by creating translations in Milkomeda , Key metrics are not stated.  Proposal can scale to address future challenges by further adding more content.This project will have a positive impact on Cardano system by increasing the awareness and knowledge among Milkomeda speakers.  \r\n\r\nI cannot say that this project adequately addresses the challenge  hence i have given it a 2 star rating.\r\n ", "q0r": 2, "q1": "The proposers have  not provided evidence  of himself with their skills and experience in translation or these sort of projects. The Linkedin Profile has not been provided. The links are not sufficient. Have you been able to assess their level of competence?\r\nI cannot assess if the proposer is competent to do these translations. The proposal   has not indicated the core leadership. \r\nThere is no guarantee if  they would be competent in providing this service in an efficient and timely manner. He has not provided the team structure of members and their capabilities   The budget has  not been outlined clearly and broken down into identifiable items.Theres no way to know if the budget is   reasonable to achieve the set goals.  The proposer has not provided a verifiable plan if additional funding is required.   \r\nThere is no plan for additional funding  if objectives are not met.\r\nTheres no detailed timetable  so I cant comment if it is realstic.   The proposal gives no sensible and conductible plan for implementation.  .\r\n\r\nResources  necessary to implement the proposal are not described.   \r\nThe proposal has no technical aspects which have to be addressed . \r\nThe proposer has not identified risks in this proposal . Given experience and plan presented this proposal may be implemented successfully hence I have given it a 2 star rating.   \r\n \r\n\r\n\r\n \r\n\r\n\r\n ", "q1r": 2, "q2": "There is no roadmap with milestones and a time horizon for achievement. \r\nThere are no clearly defined Metrics/KPIs that define the success of the proposal.  \r\nA marketing budget has not been allocated. There is a clear understandable description of the targeted problem \r\nbut there is no detailed solution.\r\nThe proposer has not identified some possible hurdles, challenges and difficulties such as translation of technical terms.\r\nThe information provided is not sufficient to audit the progress and the success of the proposal hence I have given it a 1 star rating.\r\n\r\n", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 17, "ne": 4, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "The proposal outlines the task of translating English documentation about Milkomeda into different translations. Namely those translations are for Japan (JP), Kanuri (KR) and Chinese (ZH). Although many countries in Europe and around the west of the globe speak English there are numerous countries where English isn't spoken or used as often. By covering languages like Japanese, Kanuri and Chinese the chance for increasing adoption of Milkomeda increases on a global scale which provides a high chance for creating impact within the ecosystem.", "q0r": 5, "q1": "The team has a background working in Emurgo and closely with IOG. dcSpark was created as an organisation to help with Cardano infrastructure and has delivered on numerous previous Catalyst proposals. There is a large amount of evidence that this time will feasibly be able to execute this proposal based on their track record. The budget is low and more than reasonable enough for three translators at $1,333 each when considering the impact it could have in adoption of the Milkomeda sidechain. It would have been nice to know more about the translators they intend to use or the company that would be selected so that the advisors had full confidence that the translators are also to a high standard.", "q1r": 5, "q2": "A basic timeline is provided stating 1 to 3 months to execute after the English documentation is finished. No KPIs or success metrics have been added. No detailed KPIs or success metrics are needed for this proposal due to its simplicity of what is trying to be achieved. However it still would have been an improvement to see a plan for the proposal team to verify any finished translations with the community to report and feedback and make alterations as part of the completion stages of the proposal. This would give more confidence that there would be some formal feedback process from the community on the work that has been completed.", "q2r": 3, "assessor": "z_assessor_758", "no_vca": 12, "ne": 2, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "I think this proposal addresses the challenge, however, after having checked on Milkomeda website, I think the website doesn't have so importantly huge information about Cardano. \r\nThe target readers of this proposal are unclear, so is the languages the proposer want to translate to. \"JP, KR, ZH\" is all I could see. Therefore, although the idea of this proposal is meeting the challenge, I don't think this proposal will make impact on the Cardano/ Catalyst community. ", "q0r": 1, "q1": "I strongly disagree this proposal will be implemented successfully because I think it hasn't been written completely. \r\n Budget hasn't been broken down. The development plan remains unclear due to no timeline, team, resources, possible challenges and risks. ", "q1r": 1, "q2": "This proposal doesn't give me enough information to assess its progress and its success since there is no roadmap, milestone, key metrics to success and KPIs.", "q2r": 1, "assessor": "z_assessor_836", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "It is not a bad idea to translate the Milkomeda document into many different languages, making it easy for non-English speakers to access, thereby developing the Cardano ecosystem. However, the information, knowledge about blockchain, Cardano ecosystem is always updated and changed daily, it takes about 1-3 months to translate it into different languages. Will it take too long? The knowledge and information after being translated has become outdated, not keeping up with the times.", "q0r": 2, "q1": "Although the proponent described the experience of the team, however, there was not any information to verify (eg: profiles of related people, linked in, ...)\r\nThe proposal also does not provide information on which languages will be translated, I only see it under the heading \"Milkomeda documentation(JP, KR, ZH)\"\r\nInformation on roadmap/KPI/success metrics/difficulty-challenges/solutions/marketing is also not provided.\r\nIt is necessary to shorten the time to translate the content of the Milkomeda documentation, 1-3 months is too long, it makes the information reach the user slowly, not keeping up with the trend of the times.\r\nRegarding budget allocation, it is necessary to clearly define the number of working hours and the amount per hour.\r\nInformation on experience and plans is not presented, this proposal will be difficult to implement, it needs to be further improved. I'm sorry this is a good idea, don't give up.", "q1r": 1, "q2": "I am very sorry that the content provided by the proponent is not enough basis to evaluate the success of the project. It needs to be supplemented, edited more (profile/KPI/roadmap/difficult-challenge/workaround/... as mentioned in the previous section). Besides, attracting users to the project also needs to be done (marketing, ...)\r\nProposers should jointly supplement, change the project in a more positive direction, show everyone the value it brings, map out a long-term roadmap, increase the feasibility of the project. . Let's work together, don't give up!", "q2r": 1, "assessor": "z_assessor_862", "no_vca": 13, "ne": 1, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "Traduzir documentos onboarding para usuários e desenvolvedores para outros idiomas", "experience": "Nossa equipe é composta por ex-emergüenses e ex-funcionários conhecidos que vêm construindo o ecossistema Cardano há vários anos"}