{"id": 384371, "author": "heinz.gassner", "title": "Onboard German Industry !", "url": "https://cardano.ideascale.com/a/dtd/384371-48088", "category": 26252, "amount": 7500, "description": "O crescimento das oportunidades de negócios da Cardano dentro da indústria alemã requer compreensão regional e alta competência das equipes locais", "funded": 2, "upvotes": 110151578, "downvotes": 2568509, "votes_result": 107583069, "votes_cast": 397, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": ["https://youtu.be/TpMZGtgk9Q4?start=31020"], "media": [{"url": "https://www.dlt360consulting.com", "title": "Website"}], "f6_assessments": [{"q0": "The proposal clearly articulates how it will add value to the Cardano ecosystem. Creating good format for communicating with German industry as  part of a future onboarding solution.\r\nI strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Everything is well documented. The team is already established, with more than 30 years of industry-leadership experience combined with direct access to relevant German-speaking expertise.\r\nReading this proposal I can say that Mr. Gassner and his team will successfully draw in the German industry into Cardano ecosystem. ", "q1r": 5, "q2": "The description of the targeted approach is very extensive, and the proposer has decisively chosen the solutions with their 'Business Model Canvas', as a principal framework for documenting activities, milestones, deliverables, roadmap and costs.\r\nThe team around Mr. Gassner is present with expected future growth.\r\nThe defined launch and iteration progress is divided in two, first and second quarter 2022.\r\nI rate this projects auditability with a top score of 5.\r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 19, "ne": 4, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The problem needing to be solved has been identified and articulated namely that  regional understanding and highly competent of local teams is required to build Cardano within Germany industry.It is clear that this proposal falls within the scope of the challenge brief by providing a thorough analysis of opportunities and associated hurdles by utilizing the manufacturing-industry competence within the team.\r\nThis proposal shows clearly how it adds value to the Cardano system as it would create a framework and tools for German industrialists and workers to understand everything about Cardano and the opportunities it presents.  Key metrics are clear, reasonable and realistic. THese include the building of the  Risk & Opportunity Radar tool and thereafter deepening the integration. The key metrics and goals of the proposal fall within the scope of the challenge.Proposal can scale to address future challenges by further developing and fine tuning the tools. I feel that this project adequately addresses the challenge hence i have given it a 4 star rating.\r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading.", "q0r": 4, "q1": "The proposers have   provided evidence  of themselves with their skills and experience in Consulting and Research. The Linkedin Profiles of Core leadership has been provided. The links are sufficient. I have visited the links.The proposer is competent to build this content.The proposal  gives has given details of other team members. He has provided the team structure of members and their capabilities and other partners who he would work with such as experts, developers etc. \r\n The budget has  been outlined clearly and broken down into identifiable items. Clear costs have been given for the various hosting fees on platforms and marketing campaign costs as well as podcast apps.   The budget is  not reasonable to achieve the set goals.  The costs are higher than I feel are reasonable. For example 100 USD per hour for domain experts and 200 USD per hour for senior domain experts seems somewhat high to be reasonable. Labor cost for project management has been taken as 50 USD per hour which is high even by Western standards. A Labor cost of 30 USD is more reasonable.  The proposer has not provided a verifiable plan if additional funding is required  \r\nThe timetable is realstic to build the tools and related research.The proposal  provides  a sensible and conductible plan for implementation. It has a very practical plan with detailed breakdown in terms of the various stages of development of the tool.  \r\nResources  necessary to implement the proposal are described.  \r\nThe proposal has technical aspects which have been addressed The proposer has not identified risks in this proposal . Given experience and plan presented it is likely this proposal will be implemented successfully hence I have given it a 4 star rating..\r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities.\r\n\r\n\r\n\r\n \r\n\r\n\r\n ", "q1r": 4, "q2": "There is a clear roadmap with milestones and a time horizon for achievement  \r\nThere are  clearly defined Metrics/KPIs that define the success of the proposal. These include KPIs upto March 2022 as having content, collaborations and experts in place, quality check for content, integration, building the radar tool and reporting the integration progress, and presentation of feedback.  \r\nThis same set of KPIs is repeated from April to June 2022. \r\nThere is a clear understandable description of the targeted problem and a detailed path to solve the problem. \r\nThe proposer has not identified possible hurdles, challenges and difficulties. \r\nThe information provided is sufficient to audit the progress and the success of the proposal hence I have given it a 4 star rating.\r\nThough considering that the whole basis of this is a tool for Risk and Reporting, it is worth noting that the proposers have not identified any risks or contingencies in their own planning. Nonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.The information provided is sufficient to audit the progress and the success of the proposal hence I have given it a 4 star rating.\r\n\r\n", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 16, "ne": 5, "ng": 5, "nfo": 6, "vca_o": 1}, {"q0": "The German-speaking community is a huge community and reaching out to the manufacturing community in Germany is a good idea because everyone knows the manufacturing industry is an important part of the German economy in particular and other countries that speak German in general. Plus, the requested fund is really reasonable. I think this proposal is a good one to invest in.", "q0r": 5, "q1": "The team won Fund 6 and plans to continue to leverage available resources to expand and contribute to the Cardano community. The plan is also very detailed. They do a thorough analysis of the goal, customer Segments / Target Groups, distribution channels, customer relationship ect. The proposal also includes Roadmap, Milestones and Deliverables. To sum up, this proposal is very complete with all parts, can even be taken as a proposal template ", "q1r": 5, "q2": "As I said on the second assessment, this proposal is very complete with all parts, can even be taken as a proposal template. It also includes very well-thought KPIs and detail roadmap with target deliverables for each phase that make their success will be easy to audit the progress.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "I strongly agree that this proposal is addresses the challenge because it supplies deep research/analysis to create a radar for DLT/ blockchain regarding risks and opportunities for people working in manufacturing industry - speaking German. I appreciate that the proposal can narrow down the target community and having specific solution (radar) for it, which I hardly see in many other proposals in this challenge. ", "q0r": 5, "q1": "I can see the proposal is written very carefully as it well informs all impact, feasibility and auditability before presenting the detailed plan. The team is well-known in Cardano community and as I read reference (Linkedin), they have skills and experience enough lead the project. Development plan is easy to follow with clear Distribution Channels, Key Activities, Key Resources, Key partners and Budget Breakdown.", "q1r": 5, "q2": "I think this proposal provides me sufficient information to assess its progress and goals. Roadmap and milestone are very clear. About key metrics and KPIs, I just want to suggest the team to add more target people/ reach out when delivering presentation/ report via DLT360 websites or other platforms. Kudos and goodluck to the team!", "q2r": 5, "assessor": "z_assessor_836", "no_vca": 18, "ne": 3, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "Utilizando a competência da indústria manufatureira dentro de nossa equipe, faremos uma análise completa das oportunidades e dos obstáculos associados", "experience": "Mais de 30 anos de experiência na liderança da indústria combinados com acesso direto a conhecimentos relevantes de língua alemã"}