{"id": 381275, "author": "amedina", "title": "Legal Framework for ICOs in US", "url": "https://cardano.ideascale.com/a/dtd/381275-48088", "category": 26235, "amount": 35000, "description": "El gobierno federal no ha logrado crear un marco para que las empresas de criptomonedas hagan ofertas de tokens sin costos y riesgos legales extremos.", "funded": 1, "upvotes": 51444648, "downvotes": 28145846, "votes_result": 23298802, "votes_cast": 389, "f6_no_assessments": 7, "f6_rating": 3.761904761904762, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=8704"], "media": [], "f6_assessments": [{"q0": "El desafío exige la financiación de especialistas que puedan crear leyes más favorables para el espacio de las criptomonedas. Esta propuesta responde claramente a ese reto, ya que el proponente tiene un proyecto de ley bien elaborado y listo para entregar al legislador de California. La falta de un \"puerto seguro\" en los Estados Unidos para los proyectos DeFi es un problema grave que está paralizando la innovación en los Estados Unidos e impidiendo que los consumidores e inversores estadounidenses participen en la innovación de blockchain y se beneficien de ella. Toda la comunidad de Cardano, y de hecho, la comunidad global de criptomonedas se beneficiaría de esta legislación propuesta. Si se promulga, proporcionaría una forma legal y reglamentaria para que los proyectos DeFi trabajen con los residentes de California. Cualquier desarrollador de DeFi interesado en construir un proyecto en el ecosistema de Cardano se beneficiaría enormemente de este proyecto.  En cuanto a la escalabilidad, como menciona la propuesta, la legislación aprobada en California tendrá un importante impacto en otros estados, e incluso a nivel mundial.", "q0r": 5, "q1": "Como directora ejecutiva de la California Blockchain Advocacy Coalition, está claro que tiene la experiencia y los conocimientos necesarios para presionar a favor de la legislación propuesta, como se indica en la propuesta. Además, el hecho de que el IOG ya haya examinado la organización y se haya unido a ella como miembro proporciona un apoyo adicional a sus credenciales y habilidades. Ally grabó un \"Fireside Chat\" con el director de producto de IOG Atala PRISM, Tony Rose, en el que demostró igualmente su experiencia en este campo.  Aunque sería difícil para cualquier persona ajena a la empresa saber si el presupuesto es razonable, está claro que, como profesional experimentada en este campo, Ally tiene una buena idea de los fondos necesarios, y es significativo que la cantidad solicitada a Catalyst sea sólo el 10% del presupuesto previsto.  ", "q1r": 5, "q2": "La propuesta describe claramente las hojas de ruta y los hitos necesarios para convertir una idea en ley. Aunque existe el riesgo de que el proyecto de ley no se apruebe, la inversión parece merecida dada la educación que recibirán los legisladores a los que se dirige en relación con la criptomoneda en general y con Cardano en particular. Esa educación será enormemente útil independientemente del resultado del proyecto de ley. La idea de incluir un puesto en el comité de políticas para el Proyecto Catalyst es una forma innovadora de garantizar la auditabilidad continua y de proporcionar vínculos estrechos y continuos entre los esfuerzos de cabildeo y la actividad dentro del Proyecto Catalyst.", "q2r": 5, "assessor": "z_assessor_662", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This project plans on changing legislature in one US-state to bypass SEC-regulations and make this legal solution accessible from other states. This might actually work temporarily, but could also upset the SEC so they go looking for other ways to crackdown on DeFi products through taxable events. Therefore the idea is not good, not bad. A long term solution should entail a solution across multiple states without being dependent on the legislature in just one state. ", "q0r": 3, "q1": "The proposal claims that IOG has joined this team. The funding requested through Project Catalyst is only 10% of the entire project budget. The rest is dependent on various businesses. In the budget breakdown there is mention of 50K USD going to 'political donations'. How is this to be understood? Are they bribes? ", "q1r": 4, "q2": "There is a roadmap, KPIs and budget breakdown in place, but there isn't much information present on who is currently seating in the team and what their functions are. The proposal needs a risk analysis and alternative routes on what to do if (part of) the funding isn't realised. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 23, "ne": 1, "ng": 18, "nfo": 4, "vca_o": 1}, {"q0": "This proposal is very congruent referring to the challenge itself. With this we're really funding specialists who can help to create a friendlier environment.\r\n\r\nThe idea of making California a Safe Harbor independent from SEC is great. Since US is a continental country with a diverse people with different beliefs, it would be easier to breakdown a little bit and implement some regulatory legislation to foment the industry and market using crypto in just one state, and if this state is CA, the visibility would be enormous – which will incentivize other states and countries.", "q0r": 5, "q1": "The team seems cohesive and since IOG is already onboard I do believe that this group is capable of deliver. \r\n\r\nOne of my concerns is about the budget asked. I've understood that USS 35K represents 10% of the total amount needed, however is the whole funding, therefore if this proposal does not finish in first place it would not be funded. Maybe reducing a little the amount solicitated would help.\r\n\r\nOther financial aspect of the proposal is that it says that to get this going it is fundamental to have more partnerships and receive more funds. And since you don't know exactly if you will receive this amount, I understand that this project will not start. Another point is that we do not control whether you'll receive the total fund (350K)  in time to get this going before the political cycle (if there is such a thing – the point is that the timeline could be altered). That said, it could be helpful to add some risk mapping.", "q1r": 3, "q2": "In order to perceive the progress, the proposal says that it's going to be reported and the bills published. However, it would enrich the proposal if this bits were more detailed – where and how it would be reported, some platform? The metrics would be put altogether? ", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 21, "ne": 5, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Yes this challenge effectively addresses the challenge because lots of US companies may have difficulty crating ICO, and this proposal would allow less of a barrier to entry.", "q0r": 4, "q1": "The Blockchain Advocacy Coalition has a very good background and have done great work already on the ground in California like the Blockchain education day they created in 2018.", "q1r": 4, "q2": "I think they have a detailded plant, and detail on the way we could audit their progress with both the posts of the different drafts, and how far this makes it to legislation, and when it could or should get implemented. ", "q2r": 4, "assessor": "z_assessor_263", "no_vca": 22, "ne": 1, "ng": 13, "nfo": 8, "vca_o": 1}, {"q0": "The proposal aims to improve legislation in California (US) to make Initial Coin Offerings without the supervisory of the SEC possible. This helps local businesses to create ICOs more easily and less costly. Therefore the impact is rather local. Major legislation (like SPO relevant regulation) is not being addressed by this project. Still, changes could help thriving businesses to easier issue ICOs on Cardano (although the legislation approach is blockchain agnostic). ", "q0r": 3, "q1": "The project is pursued by the blockchain advocacy coalition and was handed in by Ally Medina, the Executive Director. They can be found on LinkedIn and seem legit. Still, there are a few things missing in this proposal. 1: the budget is not further defined. They need a total of 350k but only request 35k in Ideascale. Furthermore their interests are not entirely clear. As they are already pursuing the bill, who financed them so far? How much of the initial 350k is already financed? And for what exactly will the Catalyst funds be used? All of these questions remain unanswered. Although it seems likely they will further pursue the bill, it is not clear how Catalyst funds will contribute to that.", "q1r": 3, "q2": "The project provides clear dates for their timeline of the framework. If the bill passes the houses, the govenor will be signing the bill in Oct. 22. The initial problem and solution become clear. However, risks (such as opposing interests) are not addressed. ", "q2r": 4, "assessor": "z_assessor_380", "no_vca": 15, "ne": 4, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "Great idea and very needed bill to give entry to ICO participation. The proposal should consider company protection together with customer protection in CA.  ", "q0r": 5, "q1": "The team's approach is great and awesome to have community members leading a private bill initiate. With a clear definition of success, I think this proposal is achievable.", "q1r": 5, "q2": "The budget breakdown would have been useful to determine what activity would be funded at what stage. The overall work can be traced and however, the team should commit to documenting activities regarding the project. ", "q2r": 4, "assessor": "z_assessor_727", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "As this proposal focuses on only one state in the United States, I will say that this proposal misses a key Challenge metric, and doesn't aim to influence multiple jurisdictions.", "q0r": 2, "q1": "I can see the proposers are skilled for this proposal, however as the project budget substantially is higher than the proposal funding amount it is not clear if this funding would lead to a successful outcome at this stage.", "q1r": 2, "q2": "I feel adding items such as passing 1st and 2nd house and having a governor sign a bill into law is a very optimistic goal for a timeline. However it would be great to see such a thing take place. I would like to see more involvement in the writing of the bill and interaction with the Cardano community.", "q2r": 2, "assessor": "z_assessor_800", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}], "solution": "Aprobar una legislación que cree un puerto seguro intraestatal en California. Las empresas podrían ofrecer tokens a los residentes de California sin la supervisión de la SEC.", "experience": "Aprobó múltiples proyectos de ley de blockchain en CA y sirvió como miembro asesor del Grupo de Trabajo de Blockchain de CA."}