{"id": 381955, "author": "shifu.brian666", "title": "Focus on MiCA regulation in the EU", "url": "https://cardano.ideascale.com/a/dtd/381955-48088", "category": 26235, "amount": 35000, "description": "Conseguir una legislación favorable mientras no hay una visión clara de Cardano sobre la legislación que quiere en la UE.", "funded": 1, "upvotes": 41073008, "downvotes": 28589074, "votes_result": 12483934, "votes_cast": 339, "f6_no_assessments": 4, "f6_rating": 3.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Sí, esta propuesta aborda efectivamente el desafío. Un rápido examen de las fuentes internacionales muestra que los legisladores y los responsables políticos no comprenden plenamente la oportunidad que presenta el espacio de las criptomonedas, por lo que elogio al proponente por la idea de desarrollar un marco dentro de la UE para ayudar a abordar esta brecha. El desarrollo de un marco de este tipo en este contexto podría tener un impacto significativo en función de su amplitud y de las vías por las que llegue a la mesa legislativa. Agradezco que el proponente haya identificado una ubicación geográfica específica para fundamentar la propuesta y el marco jurídico resultante. Hacerlo así ayuda a los votantes a comprender mejor las expectativas y también las limitaciones de la propuesta. La identificación de piezas legislativas específicas (MiCA y DORA) que se compararán con el marco también ayuda a centrar la atención en lugar de ser demasiado amplia y exagerada. Si la propuesta tiene éxito, y el proponente es capaz de hacerla llegar a las mesas y representantes adecuados, este proyecto tendrá probablemente un impacto significativo.", "q0r": 5, "q1": "Teniendo en cuenta la experiencia y el plan presentado, no está claro si la propuesta se llevará a cabo con éxito. Aunque reconozco que el proponente tiene un plan bien diseñado, la viabilidad de su realización no es fácilmente identificable. El componente A (redacción) parece bastante sencillo y, dada la experiencia mencionada, probablemente factible. Sin embargo, el componente B (conseguir el apoyo de los responsables políticos y legislativos) es un paso importante, pero apenas hay detalles sobre cómo se involucraría a estas personas, a qué intervalos, a qué nivel y durante cuánto tiempo. Los gobiernos suelen ser entidades monolíticas, opacas y lentas al cambio, por lo que, para evaluar la viabilidad, identificar a los actores clave dentro de estas instituciones desde el principio daría a los votantes más confianza en que es realmente factible. Esto es aún más importante, ya que no todos los representantes del gobierno están en condiciones de sacar adelante un proyecto de este tipo, aunque estén dentro del gobierno. Además, en el componente B, el proponente señala que será necesaria una iteración constante, pero no se indica cómo se mantendrá, por quién y durante cuánto tiempo. Me hubiera gustado que el proponente proporcionara también más información sobre sus antecedentes, incluyendo enlaces a sus credenciales; tal como está, se nos deja \"confiar\" en la palabra del proponente, pero esto probablemente disuadirá a muchos votantes. El presupuesto también deja que desear y hace que los votantes no entiendan cómo el proponente llegó a la cantidad específica. Por estas razones, no estoy ni de acuerdo ni en desacuerdo con que esta propuesta sea viable, pero si no tiene éxito, abordar estas cuestiones en una futura ronda de financiación aumentaría sin duda la puntuación.", "q1r": 3, "q2": "Lamentablemente, no creo que la información sea suficiente para auditar el progreso y el éxito de la propuesta. No está claro cómo podrá la comunidad auditar el éxito de la propuesta para determinar si ha merecido la pena la inversión. No hay indicadores clave de rendimiento reales, ni un calendario, ni una hoja de ruta para la aplicación de la propuesta. Dado el turbio entorno de la redacción de la normativa y la legislación, no está claro cómo podría medirse de hecho el éxito del proyecto. Si el documento se redacta y se entrega a los legisladores/responsables políticos, ¿es un éxito? ¿Y si se acepta pero no se utiliza? ¿Cómo podría la comunidad hacer un seguimiento para saber qué impacto ha tenido en la legislación resultante? Además, no se proporciona ningún calendario, por lo que los votantes se preguntan cuánto tiempo llevaría un proyecto de este tipo. Como asesor político, sé que estos plazos a menudo abarcan años e incluyen muchas iteraciones más allá del ojo público, sin embargo, esto no se aborda aquí. Me queda la duda de si el proponente, o la comunidad, podrían incluso participar de la forma explicada. Por último, una cantidad significativa de dinero es para completar el trabajo, pero no hay un desglose de las actividades dentro de cada componente, dejando a los votantes a escribir esencialmente un cheque en blanco, pero sin una manera de seguirlo. Aunque realmente apoyo la idea detrás de la propuesta, no hay suficiente información para tener la confianza de que la comunidad pueda auditar adecuadamente la propuesta.", "q2r": 2, "assessor": "z_assessor_66", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Documenting the Cardano vision in terms of legislation would provide the ecosystem with a common goal to work towards and guidance for lobbyists deployed at governments. It will also create a legal basis to research and refine so potential options and paths will become clear. You could look at it like a form of legal planning. This is of great importance because if there is no legal framework to operate in, there cannot be large scale adoption. This proposal could be extended in the future to other economic powerhouses in the world and create a global legal framework with subsections for each powerhouse. ", "q0r": 4, "q1": "Given that a legal framework has been brought up a couple times in the recent past and has created  doubt for certain project's abilities to be executed, there is a need for this as soon as possible. The relevant experience of the proposer is excluding the legal support that is needed, but the proposer intends to assemble a team of experts which is bound to gain some traction. Collaborating with other proposing groups in this challenge could improve chances of getting this done. ", "q1r": 4, "q2": "The main plan is explained in the proposal and the author has defined the goal of this proposal, but it does not have a clear plan of action (roadmap) in place for the community to be able to check the progress in case of funding. Nor does it specify when the documents would be ready for use, although I am convinced that as legislations change all the time, there will be a need for constant updates. ", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 24, "ne": 4, "ng": 20, "nfo": 0, "vca_o": 1}, {"q0": "It is logically consistent that to lobby for favorable legislation, it is necessary to understand strategic goals and direction.", "q0r": 5, "q1": "Will the outcome of Goal A be the creation of a Global Cardano regulatory vision document, with EU-specific components? If so, the proposal does not lay out a progressive detailed plan to achieve this document, therefore confidence in achieving Goal A and B are lower than highly likely.", "q1r": 2, "q2": "Operating from the perspective that this proposal exists to deliver Goal A and Goal A is achieved by the delivery of a Cardano regulatory vision document, the specific, measurable, time-fenced, auditable plan is not in this proposal and therefore cannot be audited by the community in order to determine progress or likely success.", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "Great idea. I buy into the vision of global Cardano vision on regulation. I share in the principle of making clear what regulation on regulation we want for the Cardano ecosystem rather than waiting on politicians to impose one on us. This is brilliant and it is very focused and gives confidence at the lobbying table since it proposal clear what we want. Also, try building cooperation with Crypto 4 EU since both are aiming to work in the same region. I would like to see this proposal get support it needs. ", "q0r": 5, "q1": "The team has great lobbying experience. Having skin on the table is great to have a starting point in the regulatory space and demonstrate commitment to compliance. \r\n\r\nI think the plan is achievable with clear and practical outcomes. ", "q1r": 5, "q2": "Gaol and A and B are focused and transparent which would be easy to track and audit. The activity is precise and clear. I think the proposal should be given the support it needs. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}], "solution": "Documentar primero una clara visión global de Cardano sobre la regulación y segundo una visión reguladora de la UE, teniendo en cuenta MICA, DORA y otros", "experience": "Llevo 15 años en Risk & Compliance para instituciones financieras, incluyendo muchos años como líder de Risk & Compliance para Fintechs"}