{"id": 384223, "author": "cargofe2", "title": "Colombian Congress Cardano", "url": "https://cardano.ideascale.com/a/dtd/384223-48088", "category": 26235, "amount": 4500, "description": "Los congresistas colombianos requieren información de calidad sobre Cardano para tomar mejores decisiones legislativas sobre las criptodivisas en 2022/26", "funded": 2, "upvotes": 126426982, "downvotes": 4706993, "votes_result": 121719989, "votes_cast": 479, "f6_no_assessments": 6, "f6_rating": 4.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "El enunciado de la solución es sensato a la luz del enunciado del problema y ambos están claramente redactados. Dado que el desafío busca aumentar los esfuerzos de promoción para presionar y educar a los políticos, con el objetivo de producir mejores leyes y regulaciones favorables a Cardano en particular, el tutorial digital en español propuesto para ser distribuido a los legisladores colombianos tiene sentido. La falta de información precisa y accesible sobre Cardano escrita en español es una barrera importante para la promoción en los países de habla hispana. Por lo tanto, esta herramienta tiene una utilidad potencial en toda América Central y del Sur. Dado el modesto presupuesto propuesto (4.500 dólares) y la potencial distribución escalable de la guía, el proyecto parece ser un buen uso de los fondos del tesoro. Dicho esto, la propuesta ofrece pocos detalles que expliquen por qué es necesaria la promoción en Colombia específicamente. En general, estoy de acuerdo en que esta propuesta aborda eficazmente el reto.", "q0r": 4, "q1": "Los miembros del equipo poseen una amplia experiencia jurídica y de consultoría en relación con Colombia, así como conexiones con el gobierno colombiano. Dicho esto, el tamaño y el alcance de esta red social son imprecisos. Además, no está claro cómo se van a distribuir las guías a los miembros del Congreso o a su personal (por ejemplo, por correo electrónico). Por mi experiencia personal en la elaboración de investigaciones sobre políticas públicas patrocinadas y en la difusión de estos resultados entre los legisladores estatales y los miembros del Congreso, es difícil hacer llegar esta información a las personas adecuadas. Estos esfuerzos de cabildeo suelen requerir múltiples seguimientos con el personal y, en algunos casos, pueden dar lugar a solicitudes de conferencias telefónicas o reuniones de Zoom. La propuesta no parece contener ningún plan claro en relación con estos esfuerzos de seguimiento. Además, la propuesta no identifica qué miembro del equipo es el experto en blockchain/Cardano responsable de redactar la guía digital. ¿Se subcontratará o lo hará un miembro del equipo?", "q1r": 3, "q2": "Mientras que el desarrollo y la producción de la guía de Cardano en español es fácil de verificar, la \"Hoja de ruta y los hitos\" proporcionados por el equipo son vagos o difíciles de entender. Recomendaría que el equipo dejara bien claros estos hitos. Además, los KPIs/métricos enumerados en la propuesta son discutibles. La mayor parte de las métricas pretenden medir el número de guías enviadas a los miembros del Congreso de Colombia en lugar del impacto de dichas guías (que es ciertamente difícil de medir) o el número de comunicaciones de seguimiento entre el equipo y los miembros del Congreso interesados (que, según mi experiencia, es el mejor resultado que se puede esperar). Las guías informativas suelen utilizarse para iniciar una conversación con los legisladores y sus principales colaboradores, lo que puede conducir a un testimonio en el Congreso o a la presentación de legislación (nuestro objetivo final). Por ello, no estoy ni de acuerdo ni en desacuerdo con que esta propuesta proporcione suficiente información para que la comunidad revise los futuros avances.", "q2r": 3, "assessor": "z_assessor_914", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The plan in this proposal is to create an informational chart accompanied by infographics with the purpose of providing Colombian congressmen with correct information from our viewpoint. This with the intention of them making more favorable decisions based on correct information. It could set the basis of a more friendly environment in Colombian congress towards crypto in general, which would enable an array of possibilities. ", "q0r": 5, "q1": "The proposing team have well documented themselves in the proposal. They are also exceptionally well placed to perform this task. Having a team member who is a former official of Colombian congress enables the proposers to know how things happen on the inside and gives them an edge to plan their approach, which will look professional towards the congressmen. The budget is modest, but not unrealistic. ", "q1r": 5, "q2": "Incredibly detailed proposal with very clear KPIs included. To even improve, a clarification on how the risks in the risk analysis could be mitigated could be included. ", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 25, "ne": 2, "ng": 22, "nfo": 1, "vca_o": 1}, {"q0": "I really like the idea. Going forward to the people who are decisive - congresmen, in this case, may be a great way to educate them. Well-organized, short but informative one-pagers may bring more awareness and really influence further decisions. Such materials should be not only available to Latin America users but later translated and adjusted to other languages and cultures. It's a chance for a global face-to-face education for politicians.", "q0r": 5, "q1": "2 lawyers in the team, one with experience in politics is heart-warming in such project. It seems they are well prepared to complete what they aim at. Especially as the proposing team claims they are after first talks with targeted people. Budget is reasonable and well explained. Plan has possible dates.", "q1r": 5, "q2": "If proposers take it seriously and will monitor their effectiveness as promised - there should not be any problem with auditability. This will however require a lot of effort, to monitor later legislation processes. I keep my fingers crossed. ", "q2r": 5, "assessor": "z_assessor_324", "no_vca": 16, "ne": 2, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "i strogly agree because the problem needed to be solved has been identified in the challenge and falling within yhe scope.\r\nAnd will also add value to the cardano ecosystem.\r\n\r\nkey metrics and goals are been stated clearly and falls with the scope of the challenge and can scale to address  future challenegies to.", "q0r": 5, "q1": "the proposal has provide accurate links and references that show relevant skills and experiences needed to implement the proposal.\r\n\r\nTheir level of competent is good and the proposal have also listed in manner the number of team memebers required to implement the proposal, and team structure is also good.\r\n\r\nHas a reasonable bedget and clearly break down into identifiable items in order to achieve the set goals...\r\n\r\nthe proposal has a provide a realistic timetable to complete the work if funded.\r\n\r\nThe plan of the the proposal also describes the necessary resource to implement it.\r\n", "q1r": 5, "q2": "I strongly agree due to the providing of road maps and has likns to audit  them if project is funded.\r\nall clearly metrics/KPI's define thhe success of the proposal\r\n\r\nthere is also a clearly understanderble describtion of the targeted  problem and a clearly understanderble solutions to address the propoasal.", "q2r": 5, "assessor": "z_assessor_447", "no_vca": 23, "ne": 1, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": "Great proposal. The target of congressmen is great. I think they are the exact group the challenge is seeking to influence. ", "q0r": 5, "q1": "Great team experience. I think one of the KPIs has been given an inappropriate metric. It is not helpful to measure number of congressmen informed but rather, the number of legislative initiatives or private member bills on favorable legislation by congressmen was targeted by the organization's activities. Building collaboration is great as well. I think aspect of the proposal should be given a relook.", "q1r": 3, "q2": "Great road map and detailed budget. The proposal should consider documenting of activities to enable easy auditing. ", "q2r": 3, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The proposal addresses many metrics of the challenge, however the final version of the document cannot be sufficiently imagined when going solely from the proposal description. ", "q0r": 4, "q1": "The credentials of the team are sufficient and even impressive, due to the claim of having some access to the Congress. In the end it depends in what way CryptoCurrency and blockchain will be presented to the presiding Congress so that it will hopefully complement their current plan and goals. ", "q1r": 4, "q2": "The document itself can be easily audited for progress. The Congress votes and deliberations are also usually public. ", "q2r": 5, "assessor": "z_assessor_832", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}], "solution": "Se creará un documento digital informativo e ilustrativo de fácil y rápida comprensión para esta población objetivo", "experience": "Consultor con 15 años de experiencia, ex funcionario del Congreso con un amplio conocimiento del perfil del objetivo"}