{"id": 367060, "author": "", "title": "NOETH: Cardano for Science", "url": "https://cardano.ideascale.com/a/dtd/367060-48088", "category": 26103, "amount": 30000, "description": "ほとんどのPCユーザーは、CPUの処理能力の平均20％を費やしています。これは発展途上国の科学者にとって戦略的なリソースとなります。", "f6_no_assessments": 6, "f6_rating": 4.055555555555555, "videos": [], "media": [], "f6_assessments": [{"q0": "This DApp would create an incentive to invest idle computing power into a scientific sphere. \r\nMonetising computing power would compensate the electricity usage cost it brings with it. \r\nWith various well-known institutions present on BOINC (Berkeley Open Infrastructure for Network Computing), it could provide an influx of scientific personnel on a science-inspired blockchain. However, it is somewhat a contradiction to shift focus to one part of the world as there is a general sentiment that science should be a global endeavour to generate open-source progress. \r\n", "q0r": 4, "q1": "The proposers have all relevant experience needed to create this system. Yet there is no proof of a link with BOINC, which does not guarantee their cooperation. This creates some uncertainty about success of implementation. ", "q1r": 4, "q2": "The plan is detailed and there is a roadmap with clear milestones. But there is no funding breakdown to clarify the 30K USD that are requested. Not that it sounds like too much, but something that would justify the amount. Some additional information on the tokenomics' logarithmic function and how it retains value would've increased clarity on the function. ", "q2r": 3, "assessor": "z_assessor_113", "no_vca": 11, "ne": 2, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "- This is a tremendous idea. I live in Brazil and during my university time I suffered exactly from that. In my scientific work I had to run various simulations and, sometimes, it was painful – had to wait weeks (and if there was a mistake….gosh).\r\n- It's true that all prices are going through the roof, since the currency is becoming weaker and weaker ( 1 USD aprx 6 BRL).\r\n- Since it's free and safe for the scientific side, it's quite scalable (at least in Brazil). Considering most of the big scientific institutions and universities here are public it would be almost impossible if they had to buy to use it (the amount of bureaucracy would be huge).  \r\n", "q0r": 5, "q1": "- One thing that concern me is the value of the reward. I understand that its value depends on the use and demand of it, however, since in your explanation you've put all the usage hopes into the reward earned by the people who are giving their power away, I am wondering if it would compensate when we put the electric energy value into account. The government here in Brazil is privatizing part of the electric sector but, with it, it's guaranteeing to some businessman that the gov. will buy at least a part of their thermal energy every month (even though Brazil's hydroelectric grid is one of the biggest in the world) thus rising a lot the value of energy bill. Furthermore, we must take into account that the situation is not easy to people living in developing countries, in Brazil, e.g., the majority of the population (80%) makes less than 3 minimum wages (3K Reais), which with the today's inflation is quite hard to pay the bills, this way, I would love to see an example, in the proposal, of how much more of energy \"KWh\" we would spend in average.\r\n- Another point that could be more explained is the detail of the budget asked. I've not seen the explanation of the amount asked (x% for doing A, y% doing B, etc.).\r\n- Maybe adding some marketing in make people conscious that they're helping the community, etc.", "q1r": 4, "q2": "- I have seen that the proposal states the period in which you desire to deliver some functionalities, however it would help if there was some more steps to it, stratifying more to allow us better to follow the development.\r\n- Another point is toa dd some metrics defining success (how many programs we want to have and when, and how is going to be the progression of it, how long it will take, etc.)", "q2r": 4, "assessor": "z_assessor_25", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "With an amazing real-world use case with a well-thought out approach, this proposal is cut out to be one of the future success stories of Cardano native token utilization.\r\n\r\nThere might be some confusion due to the name, however. A Cartesi side chain is called Noether (https://cartesi.io/) and on Ethereum there is a project called Noether DLT (https://www.noetherdlt.io/). Perhaps you should reconsider what you call it to avoid any confusion going forward. You don't need to change the token name, though.", "q0r": 5, "q1": "It's commendable how well the team has sourced for community knowledge already during the insight sharing phase and then by having a dialogue via the comments section in the proposal.\r\n\r\nThey say: \" It's important to have a clear USP. Ours can be distinguished from other projects through a key feature: The focus on science and developing countries.\"\r\n\r\nThis is very true. The scoping is done well and focus selected accordingly. Piggybacking on the success of a time-tested BOINC network is very smart and incentivizing participation with a Cardano native token as well.\r\n\r\nClearly, this team (together with the to-be-recruited junior developers) is going to be very serious about getting the job done. I would have appreciate a more in-depth introduction of the team, however.", "q1r": 4, "q2": "To a large extent, yes, the proposal meets auditability criteria and outlines success metrics well. Four scientific projects in 9 months is a doable goal to strive for. I would have appreciated a more detailed partnership plan, however. It's not enough to say \"such as CONICET, Fiocruz etc\". Other than that, everything is laid out nicely and explained so that a non-academic assessor can understand.\r\n\r\nWhereas I am no mathematician or a scientist, I come from innovation management and social entrepreneurship background. I have also worked with universities in my professional career. Hence, I am well-equipped to evaluate this proposal. Very well done!", "q2r": 4, "assessor": "z_assessor_289", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Ideal computing resources from millions of personal computers, laptops, and even mobile devices are waiting for the right application to harness. However, like many other projects, the dependence on an exclusive token is resulting in low enthusiasm. I am making this statement based on my assumption many will not be interested in installing an additional application for helping science or developing countries. There is a need to generate commercial utility for the Token to encourage mass participation. However, there is a need to have such a dApp in the Cardano ecosystem and experiment with the initiative.", "q0r": 5, "q1": "The proposing team has a strong acedamic and business background with sufficient experience. The team should be capable of achieving success in the endeavor. ", "q1r": 5, "q2": "The software to be made for utilizing the excess CPU cycles will be open source and the incentive mechanism is being controlled by the community. The amount of money requested for developing the software is also reasonable. The project can be easily audited and successes measured by the number of the installation. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Making use of unused CPU power is a brilliant idea. It's so brilliant I had to look it up if it already existed or not (which it does). Nonetheless combining this with a blockchain token would increase the incentive for computer owners to start using this technology while helping science reach new discoveries. Since the proposers are scientists are from South America it is understandable that you would reach out to research facilities in SA but I would've loved it if this would become global for science all over the world.\r\n", "q0r": 4, "q1": "Looking at the relevant experience the team has it is without a doubt they have what it takes to create this proposal. Details about the proposal are all well explained and give a confirmation of the knowledge the proposers have. The timeline could've used a bit more in-depth milestones and details. How many developers are you planning to bring in the team? One concern I have and am not sure it has to be a concern but I've looked up BOINC and it looks like you would need to ask for access to the network and this is not referenced anywhere in the proposal? The requested budget does not have a breakdown or explanation of why you need it. This would've been helpful to bring more feasibility to the project.\r\n", "q1r": 3, "q2": "As stated above for auditability the budget breakdown would increase the clarity on this project. As of now, we don't know what the funding would be used for. The timeline is reasonable from my understanding. In the comments, there is also a clear confirmation on what the token will be used for.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "By capturing a valuable resource to the scientific communities in developing nations for free, and by providing a rewards system that is clearly defined this proposal could attract many new users to the platform. With a clearly defined problem statement and solution, and by adopting and then emulating the BOINC platform, the proposal demonstrates that their application has viability. While it's a novel approach for a dApp we can see clear parallels with other successful grid computing projects. This proposed solution clearly is trying to solve a problem that needs solving, using an approach that is demonstrably viable. I'm a software engineer, from reading this proposal I know exactly what NOETH is trying to achieve, who it is trying to achieve it for, and why it is being built on Cardano.", "q0r": 5, "q1": "The project proposers provide their names and area of expertise but do not provide any references or links to support this. Links to faculty bio pages on a university website or a professional site would support their expertise. Links to published research would also help establish their expertise. Even providing names for where they work would help search for them on the web. The proposal states that the team members realize how important this is, and that it will happen which is great. They could capitalize on this by providing some more information at this stage as the team bio suggests they have the skills and knowledge needed for this project.\r\n\r\nThe tockenomics of the proposal are clearly defined, it explains how users will be rewarded and how those rewards are calculated and provided in an attachment. It also defines the value of the proposal and why solving this particular problem is important i.e. scientists in developing nations need greater access to compute power. They explain the scientific nature of the cardano project lends credibility to their project with the community they are going to help: Scientists. I also like the fact that they are targeting Cardano which has very low transaction costs. Some of the other networks, like Ethereum, might be prohibitively expensive for adoption in developing countries.\r\n\r\nThey do provide a timeline which includes what roles they need to hire for so they can develop their solution, and this breakdown also identifies important scientific partnerships for their project. The timeline is broken down into milestones at 3, 9, and 12 months and has deliverables for those milestones which is good. Even better yet would be a plan to achieve those milestones. For example, at 9 months a working beta will be delivered, it would be helpful for the community to know what that beta version of the solution will include as they may not be familiar with BOINC. So a further breakdown of what their solution will look like at each of the milestones would improve things further. The following list is just to illustrate how that further breakdown might look, it's not a suggestion of what this project needs to do.\r\n\r\nAt 9 months the working beta will be delivered and will include\r\nData delivered to client PCs by BOINC server(s) over HTTPS\r\nClient CPU/GPU app provided by BOINC\r\nWebsite that explains project and allows users to sign up and provide compute power\r\nx.509  certificate(s) purchased from a Central Authority\r\n\r\nAt 12 Months the working beta will be up and running with the following\r\nTokenomics implemented and rewards being distributed\r\nWebsite will now allow token holders to vote on proposed projects \r\n\r\n\r\nHow will NOETH find users to volunteer their compute cycles to the project? It's not clear to me from this proposal, but I'm a developer and not a marketing person so I've a weakness in this area, and they do mention deploying on social media. I fully accept that this could be my weakness and not a weakness of the proposal so for my assessment I'm not going to include this in my scoring, but I think it is still a good question to ask.\r\n\r\nIncluding a budget breakdown such as how much of the money will go towards hiring of junior developers and other staff costs, how much will go towards infrastructure and project costs  would help the catalyst community decide if this project can achieve its goals. At the time of assessment the project didn't have such a breakdown.\r\n\r\nI think the technical solution itself is feasible, the BOINC project is established and successful and the adoption for the prototype can utilise this success. There's real value being created from the project by providing free compute resources to the scientific community, and the rewards system would help adoption of the cardano blockchain as those volunteering their computers will be using it, and the DAO will be implemented on it.\r\n\r\nA more detailed project timeline with deliverables, an explanation of how the budget would be spent, and some links to the team members (and maybe BOINC) is needed to make the feasibility of this proposal concrete. It doesn't have that yet so I'm giving this section a of score of 3.\r\n", "q1r": 3, "q2": "The NOETH proposal solves a well described problem with a well described solution. This gives a clear understanding of the proposal's goal, and what achieving that goal will look like. There is a clear demarcation between phase 1 of the project, and what happens beyond that. Their timeline for achievement includes some important milestones and deliverables and focuses on phase 1, further phases are out of scope. These could be improved by providing metrics on how a deliverable is flagged as delivered. Right now there is no \"definition of done\". For example; what roles will they have hired junior developers for? A simple metric would be: one junior dev in Frontend development and one postgrad student in blockchain development. As a senior R&D software engineer who's worked in technical lead and project management roles I aim to provide clear, measurable, goals so the success can be measured throughout a project. This proposal has milestones, which is good, to make that great the proposal could tie them to metrics. \r\n\r\nThere is no breakdown on how the sum of $30,000 was decided upon or how it is to be spent, so we cannot tell if that is an appropriate amount of money to fund the proposal.\r\n", "q2r": 2, "assessor": "z_assessor_534", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "私たちは、NOETHトークンという報酬と引き換えに、PCユーザーがアイドル状態の処理能力を貸し出すインセンティブを与えるプロトコルを提案します。", "experience": "B.マルコロンゴ：物理学者 - ハイパフォーマンス・コンピューティング\n\nH.ペーニャ：数学博士、プログラマー\n\nR.Sendín：マーケットアナリスト\n\nH.Baca：弁護士-サイバーロー"}