{"id": 367148, "author": "", "title": "Efficient Markets for Public Goods", "url": "https://cardano.ideascale.com/a/dtd/367148-48088", "category": 26103, "amount": 250000, "description": "公共財はもともと非効率な市場です。社会にお金にならない価値をもたらすプロジェクトに、利益を得るために投資する方法は存在しません。", "f6_no_assessments": 4, "f6_rating": 2.9166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a superb idea that could have great impact within and around the Cardano community! If successfully implemented it could heavily improve catalyst processes (especially auditing!)\r\n\r\nHowever I'm very unsure how (physical) public goods relate to this proposal; it seems more public goods refers to public DLTs here? (thats why no 5 stars)\r\n\r\nMight be a good idea to present this in a breakout room in the after town hall and build this organically! \r\nRegarding the budget, it's always a good idea to not ask more than around 18% of the Challenge setting budget. For instance if this proposal got funded, it would be the **only** one in this challenge setting. \r\nSwitzerland has a heavy price tag and more progressive forms of distributed organisations are arising, see DisCo or  in your case more applicable \"Purpose driven companies\" https://www.re-generate.org/what-is-a-purpose-driven-business\r\n", "q0r": 4, "q1": "Feasibility:\r\nProposal states \"where success is not determined by profit\" but then \"If the project completes the success criteria within the given market, the investor will extract a profit upon his investment.\" \r\n-> so how is this profit generated from an added economic value?\r\n\r\nBlue coin collateral: How will Blue coin be collaterized? Where are assets for collaterization coming from? \r\n-> How is intrinsic value of Centia Coin created? is it not centrally controlled? Can anyone access it without identification? is it deflationary? What's the emission rate?\r\n", "q1r": 3, "q2": "Audibility:\u2028\r\nWhat mechanisms in place to impede gaming the system by creating many small projects with KPIs that are irrelevant or already accomplished, thus acquiring more power tokens than actually earned? \r\n\r\nNo KPIs were given and it was not mentioned how the work of the new hires will be assessed.\r\nDefinition of Done for the milestones are only partially mentioned.", "q2r": 2, "assessor": "z_assessor_334", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The social financing model curse is the requirement of Instant Gratification. The majority of investors are known to finance projects with direct ROI. Projects with indirect benefit by betterment to society always fall between gaps. The story of \"Drake with Asthma funding clean project,\" which has been cited (slide 39 onwards)  to explain Samurai protocol, is naive and does not have support from past research. The idea is unique and noble. The protocol must be published and reviewed before attempting to implement it at the cost of 250K USD.", "q0r": 3, "q1": "The proposer linked in the profile says he has completed a High school diploma in 2019 and is enrolled for BSc in Business Analytics and Data Science. He will complete the same in 2023. He has been director of a company called Software X AI between Mar 2020 and Nov 2020 and at the same time a consultant for a company in Canada. He had worn 8 Hats from the days of his high school from 2019 till now. Even with all these credentials, it is difficult to come to the conclusion that the proposal has enough experience to implement his proposal successfully. ", "q1r": 1, "q2": "They are assessments and conclusions in the presentation without the support of statistics or reports. The protocol needs to be evaluated and tested before implementation. There is limited measurable metric therefore audition the progress will be difficult. ", "q2r": 1, "assessor": "z_assessor_46", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Let me preface this by saying that this proposal has a lot of supporting documents; 50 slide pitch deck and a white paper of 34 pages. Therefore, the proposal that took me the longest to review. Let's get into it. \r\nThe overall impact of this project can be very big for Cardano and Catalyst. When it comes to Catalyst the proposer explains that it could actually be used to fund non-commercial ventures and find a way to stimulate projects that don't necessarily bring a monetary return, but a social good.\r\nThis doesn't get a five, however, due to the complexity of the ecosystem that it plans to build with 3 different coins. This is not to say that complexity is a problem, but it is more an issue here when the proposer doesn't explain when how these coins will be issued on top of Cardano. ", "q0r": 4, "q1": "This proposer put in a lot of work in making sure the plan was specific and feasible, however, there are some missing elements. \r\nLet's start with the positives. \r\nThe project plan and milestones are very detailed and seem to be achievable. This is especially true because a large bulk of the research and work seems to have been done. I would have to say, however, that the white paper is not very easy to read when it comes to the technical parts. I had a harder time reading this than many peer-reviewed academic articles published by Cardano, so I would recommend some refinement to be done.\r\nFinally, I am missing a link to see the background of Nikita (the proposer). Given for now he is a solo founder it would have been good to understand his background and experience to understand if he has the capabilities of building this. This is especially important for a project like this that is very complex and requires a strong CTO or mathematician from the start to create models.\r\n", "q1r": 3, "q2": "The proposer provides a clear step-by-step plan with different milestones as previously mentioned as well as potential challenges or risks he might encounter. However, for this to become truly auditable I am missing some key elements especially for a project of this caliber. There are no clear KPIs in the proposal showing what the platform could or should generate in regards to user adoption or a number of projects being listed on Samurai. \r\n", "q2r": 3, "assessor": "z_assessor_473", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal is fitting for the challenge. I really like the proposal, there are some really interesting ideas forming on top of the Tera network like rewarding investors for staking.", "q0r": 5, "q1": "Unfortunately, there are no mentions of any concrete people that would do the actual technical work. There are no mentions of companies or people to be hired and a project of such magnitude needs more people to work on it, and the fact that there isn't a mention of that but rather of C-level executives who are also missing at this point is really bothering me. This brings the credibility of the whole proposal down a bit.\r\nFrom reading the white paper I see that the idea for incentivizing the investors alongside the power multiplier is based on top of the Tera network, which is good, but unlike the Tera network, there are a few unanswered questions: \r\n* there already is a problem with stablecoins that are not fully backed by cash but rather there's an algorithm that tries to peg them. Here's a detailed explanation on what the problems with algorithmic stablecoins are: https://www.youtube.com/watch?v=HUokre-szPg and why it's very hard to find the balance between Blue Coint and Centia Coin in this proposal using the AMM.\r\n* on page 5 from the provided whitepaper there is the sentence: \"As organisations successfully complete more milestones, the organisational Trust levels,\r\nincrease on a scale from 0 to 3.\" which is bothersome because if the network is dynamic the scale should be dynamic as well instead of the range 0 - 3. The platform would have a really hard time coping if the Dapps reach all their respective KPIs and their power is essentially set to a permanent 3 which would greatly disrupt the system which is exactly what happened with Iron token in the linked video above.\r\n* the word \"seigniorage\" mentioned in the whitepaper meaning \"profit made by a government by issuing currency...\" which is worrisome because that issuing would be a volatility problem if your original assumption from the whitepaper that:\r\n\"The Supply of Centia Coin has a maximum target of 30 million. The supply of Centia\r\nalternates depending on econonmic expansions and contractions oscillating around the 30\r\nmillion mark. Therefore the supply of Centia is naturally scarce.\" \r\nis not met. There is no mathematical proof that the Centia coin would be able to keep its 30 million target.\r\n* Another thing I was wandering about is the freedom the Dapps have to set their own KPIs, which is not regulated enough by the investors IMHO.\r\n\r\nI'd love it if the proposer put a more detailed breakdown of the budget as in the current form it's not very auditable. There's no mention of any breakdown for any specific expenses. The legal fees for example may vary from 5k to 500k but there's no argumentation on the more than average price choice for legal fees. This applies to the other budget points as well.\r\n\r\nI very much like that you have plans to self-fund in the future but that does not negate the fact that the funds you ask for are the whole available funds for the whole challenge, which IMO wouldn't be more valuable than the iterative benefits multiple other proposals can make on the ecosystem for the combined challenge price.\r\n\r\nOverall it's a very nice idea but I think there's more to think about implementation and budget-wise.\r\n", "q1r": 3, "q2": "As I mentioned there's no mention of any concrete person or plan for execution on the technical part of the project.\r\nThe only metric I found is the broad Q1-2 amidst a 4-year roadmap, which is not enough if the community members want to track the development of the project.\r\nAs a suggestion I'd recommend having a more concrete short term plan alongside what you already have as an idea. Find the right people to get the job done or a company to hire that will have the right credentials and link them in the next proposal you make, as I believe that will bring greater credibility to the whole proposal. \r\nAnother suggestion is to have the whitepaper looked at by expects in a true Cardano scientific manner.\r\nGood luck.", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "サムライはROIを非貨幣的価値と結びつけ、投資家が利益ではなく社会に価値をもたらす公共財に資金を提供することを可能にします。", "experience": "CEO：ニキータ・スチール - システム思考、経済学者、起業家\n\nエコノミック・アドバイザーTBA\n\nCTOTBA\n\nCMO: TBA"}