{"id": 367485, "author": "", "title": "Patient Data Marketplace DApp", "url": "https://cardano.ideascale.com/a/dtd/367485-48088", "category": 26103, "amount": 33850, "description": "ヘルスケア・アナリティクスの市場規模は2025年に407億8,100万米ドルに達すると予測なし\n\nその市場規模は、患者さんには行きません。", "f6_no_assessments": 4, "f6_rating": 2.9166666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "Giving patients control over their data and incentivizing them for sharing it is something that can be done on Cardano. Keep in mind that there are more than one way to solve this. You could also involve NFTs or even Atala Prism. A project like this could definitely attract a lot of new users and adoption for Cardano. The way this project will work should be open to experimentation as to find the best scalable and secure solution.", "q0r": 4, "q1": "More proof is needed of your experience. Adding a linkedin profile could help with that. Also this is no easy task. Having committed developers on your team would boost voter confidence immensely. Developers would play a vital role in constructing a better plan and bringing this project to life. They would also help you better identify budget allocation and the plan behind it.", "q1r": 1, "q2": "Proposal offers a sound solution but needs to get into the details and needs to experiment in finding the best scalable solution. Having a committed development team on board could help solve this problem and identify future risks and challenges. No real roadmap with milestones or KPIs were provided making it hard to track the progress and success of this project. ", "q2r": 2, "assessor": "z_assessor_140", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "- I love the idea of creating some solution in the healthcare system, which has lots of cash moving around ($40Bi+ as stated), meaning that it has plenty of space to grow. Moreover, it has a potential to reach millions of people.\r\n- I've loved how you explore other potentials besides selling the data or control it. The fact that it can be used to improve the health's quality of the people is awesome. ", "q0r": 5, "q1": "- One point of the implementation that was not clear to me is that nowadays, all the records stays with the doctor or lab, that being said, we (patients) gonna have to ask for the record and, somehow, upload the data into the app. However, we have some problems there: How are we going to upload it? Who is going to verify or sign those records affirming that they're legit? Every doc or lab need to use this Dapp in order to work.\r\n- Another point that worries me is that the budget might be undervalued, since you might have to think about a validation's solution to the data uploaded and some integration with various systems used in labs.\r\n- I've seen that there are 3 or 4 parts to the project being the PoC funded by this fund6, how are you planing to implement the others ?\r\n", "q1r": 2, "q2": "- What might be added is some metrics defining success.", "q2r": 4, "assessor": "z_assessor_25", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "An interesting idea that probably would provide value to end users, since control of health data is an area of concern for many, particularly with regard to data privacy. But this proposal isn't developed enough to really address the challenge. It does make a case for why it might theoretically lead to a \"novel and viable app\" as the challenge says; but it gives little practical detail about what it's actually going to build and how. The challenge setting also focuses a lot on profitability – so rather than just talking about the size of the potential market, some detail on projected profit would really help address the challenge. Also, the proposal seems very targeted towards the US or other countries where the patient owns their own medical data (which is not the approach taken in every country), and where healthcare is privatised and therefore the patient's financial info is relevant. This might limit its applicability and the number of new users it would attract worldwide. (If the proposal is only intended to apply to the US - which  might be the case –  this should be explicitly stated.) ", "q0r": 3, "q1": "The only information given about the team's experience and skills is about the proposer, Mike Barr – but presumably this is being developed by a team? It would be easier to assess feasibility if we knew more about who is working on it. Although a budget total is given, it's not broken down or itemised at all – to assess feasibility, we need to know how the money will be spent and whether the budget makes sense. A time-plan, with dates., or even just a rough roadmap of  the stages involved in delivering the project and what order they come in, so we can see what depends on what, is also pretty necessary to enable us to assess feasibility; ideally this would include some key points along the way where we could assess whether things are on target,. As it stands, although the proposal explains the basic idea and the vision reasonably clearly, it doesn't give enough practical  information about how that vision will be delivered, so the project does not seem feasible.", "q1r": 2, "q2": "The proposal outlines its aims in terms that are too general. To be able to audit it, we need specific, measurable targets , such as number and growth of users or outputs. The proposal does suggest a couple of qualitative targets (such as \"We want as well to promote data privacy, build trust and transparency...\") but this is abstract, and wouldn't be auditable; the proposer needs to suggest what they will measure to show that \"trust and transparency\" have been \"built\". But above all, the proposer should look at the challenge setting, and decide which of the metrics suggested there are best applicable to the proposal and how they would measure them. At the moment, it is not possible to audit the success of the proposal, because there are not many goals or metrics included in the proposal, and those that are included are too vague and unmeasurable.", "q2r": 1, "assessor": "z_assessor_540", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "This proposal indeed aligns with the category proposed in, and would be massive win to have medical data stored securely and privacy where patients have and maintain full control over their medical data, instead of inside some database where some DB admin essentially has complete and full access to all your entire medical history. \r\n\r\nBlockchain is the perfect solution to the issues of medical privacy in our highly centralized world. You don't want private companies or other 3rd parties without your explicit permission and the patient data exchange proposed using Cardano, helps to solve that.", "q0r": 5, "q1": "More information on the team would be appreciated, and a more detailed KPIs fopr the roadmap would go a long way to improve the perception that this proposal can be successful. That being said, the roadmap milestones themselves are very achievable and realistic.", "q1r": 3, "q2": "The roadmap does not include any KPIs, or objective quantitative way to measure the success of the proposal, and votes should keep this in mind. ", "q2r": 3, "assessor": "z_assessor_577", "no_vca": 9, "ne": 2, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "患者を中心としたブロックチェーンベースのデータマーケットプレイスシステムです。このシステムは、データの取引、交換、プライバシーの仕様に対応しています。", "experience": "18年以上にわたり、コマーシャルエクセレンス、メディカルアフェアーズ、マーケティングの各部門で製薬企業のリーダーを務め、ライフサイエンスのコンサルタントとしても活躍。"}