{"id": 368447, "author": "", "title": "M2-mini-atm", "url": "https://cardano.ideascale.com/a/dtd/368447-48088", "category": 26103, "amount": 12200, "description": "新しいカルダノユーザーの導入は複雑すぎる。", "f6_no_assessments": 2, "f6_rating": 2.0, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is good. We have seen crypto-ATMs in the past that were successful, especially in Asian regions. \r\nIf executed well, it could hold a future and scale to widespread adoption. \r\nJudging from the proposal at this point is is not very clear how payments on the device would occur, nor what's in it for the shop owners that could potentially place this ATM in their shops. \r\n", "q0r": 3, "q1": "For something like this to work, there needs to be an incentive for whomever hosts such devices in their shops. \r\nWithout it, the shops would likely refuse adopting such a system. This needs to be in the plan. \r\nThere is also a need to market this. Shop owners can't place it in their shops if they have no knowledge of its existence. \r\n", "q1r": 2, "q2": "There isn't enough information in the proposal about how the system the proposer intends to build works specifically. There also isn't a detailed plan about how to implement this on a scale. \r\nThe roadmap is very basic and does not justify the hourly rate to create a prototype. Since this could potentially involve large sums of money being transferred, a risk assessment is advisable. The initial idea is good, but it needs a lot more detail to confirm trust in this project. ", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The idea to make a mini ATM really is thinking outside of the box in a good way. The core of the idea is great but you don't elaborate on how you plan to implement this. How will do you convince store owners to get this ATM in their store and accept crypto as a payment? At first, you talk about installing ATM but further down the proposal you talk about staking? Does this mean that the customer pays for a product in the store and that the payment goes unto a pool for the owner? I miss the incentive in this proposal which is why I will stay neutral on this.", "q0r": 3, "q1": "In the budget plan, you clearly state you need funding for the first sample and engineering but in the definition of success for the proposal you also talk about the first production line which isn't within the scope of the budget. You also ask for an hourly rate of 70 for an engineer while the US standard salary of an engineer is 30. How do you plan on building the device? How will store owners be able to use the ATM in a correct way while crypto is not seen as an accepted currency for businesses? The proposal is lacking too much information on different aspects. The idea is great but it needs more documentation.", "q1r": 1, "q2": "While the roadmap is there we are missing milestones in the project. When do we hit a certain mark in the proposal that is worth mentioning? You could implement some KPIs. When is the proposal successful. When we hit a specific amount of store owners who bought the ATM or the number of payments per month. I am missing some guidelines on what to assess the proposal on, with a roadmap alone the audit would take a huge amount of time. The proposal lacks enough information to assess the progress.", "q2r": 1, "assessor": "z_assessor_471", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "お店に置ける小さなATMのような装置を作る。カルダノやステークプールの代表者を照明付きで横に並べて宣伝する。", "experience": "\\- 決済システムの構築に14年間携わってきたインダストリアルデザインエンジニア。  \n\n\\- おサイフケータイを使ったFUND5の提案者"}