{"id": 369219, "author": "", "title": "Private Transactions on Cardano", "url": "https://cardano.ideascale.com/a/dtd/369219-48088", "category": 26103, "amount": 30000, "description": "Cardanoは、ユーザーが実世界のIDをウォレットにリンクさせないように保護するために、独自のプライベートトランザクションプロトコルを必要とします。", "f6_no_assessments": 5, "f6_rating": 4.466666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "The protocol which breaks the proof of the link between the sender and receiver will help to remove linking their real-world identities to wallets. the challenge is effectively addressed ", "q0r": 5, "q1": "The team has relevant experience and has provided a detailed roadmap to be implemented. Thus increasing the possibility to deliver the proposal successfully", "q1r": 5, "q2": "The proposal consists of a detailed plan with a timeline and detailed funds requirement this will be helpful to follow the progress of the proposal and also to track its success ", "q2r": 5, "assessor": "z_assessor_317", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "There are use cases regarding the requirement for anonymity. Currently, Cardano transactions can be traced. Use of mixer or tumbler is common in other cryptos to hide that transaction chain with varied degree of successes and are useful for few people who desire to maintain a level of anonymity. ", "q0r": 5, "q1": "The proposers claim doctorate in math and cite papers; however there is limited information regarding their past work on their site. However, based on the workflow that has been proposed, it can be inferred that the proposers have strong know-how in the proper field and are likely to be able to complete the proposal successfully. ", "q1r": 4, "q2": "The project also involved publishing the whitepaper, which will bring out the modalities for protocol and its implementation. However, since the protocol will be in open-domain, the community can monitor the progress. The dApp that the proposal aims to build has been classified as opensource in the proposal. The amount requested is seasonable; however, no clear breakdown has been included in the proposal. It is likely to be an auditable project once the white paper is published and once all development details are included on the project website", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal does meet the Fund 6 Challenge brief of bringing new Daps and new usage models to Cardano.   The idea of adding an additional layer of privacy tools for exchange to wallet transfers is clearly thought out and well presented.  ", "q0r": 5, "q1": "The proposal sets out it's goals, backs up it's statements with evidence, and sets out a detailed plan.  My only hesitation is the legal aspect of \"mixing\", with respect to coin transfers, which this proposal seeks to implement.  The proposal does provide a caveat that it will be subject to legal requirements in all jurisdictions, however achieving this in a world of changing regulation will be a major challenge.  Despite this hurdle I consider the proposal to be well structured and worthwhile.  ", "q1r": 4, "q2": "There is a clear roadmap provided with this proposal, milestones are defined with dates, and Key Performance Indicators are provided in terms of \"definitions of success\".   The project has a functioning website with up to date announcements, roadmap, explanations, and an FAQ section, as well as contact details.  Again the only hesitation I have is I don't see any legal oversight in the roadmap or key milestones.  ", "q2r": 4, "assessor": "z_assessor_505", "no_vca": 7, "ne": 3, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "It is an interesting proposal that could help the adoption of Cardano, however, also for purposes not everyone might agree with. Saying that the project is about \"private transactions\" is somewhat misleading, as it does not propose to introduce private transactions to core Cardano. Rather, it implements a mixer as a dApp using cryptographic principles.", "q0r": 5, "q1": "The proposers do not provide evidence of past succesfull projects. However, doing a little bit research on Google Scholar, the first proposer appears to have a relevant scientific background, whereas I could not immediately find anything about the second one. Based on my own understanding of cryptographic principles, what they propose should be feasible. The timeline, however, seems a little bit rushed.", "q1r": 4, "q2": "The budget and roadmap are clear, although the deadlines in the latter seem (just slightly) unrealistic or too rushed. There is a clear deliverable: a mixer dApp.", "q2r": 4, "assessor": "z_assessor_603", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": " The problem is clearly stated and fits into the Dapps Challenge. Privacy and personal data protection are important stakes for every people coming to blockchain. The proposer brings a good demonstration that enabling private transactions will contribute to increase the use of Cardano blockchain, and ADA as a currency. ", "q0r": 5, "q1": "The proposer claims to be a team of to developers with Ph.D. in applied mathematics, which is confirmed by the LinkedIN profile of one of the two developers. The proposer might consider giving additional evidence of mathematical and computing science skills to give trust in the chances of success of the development.\r\nDetails on the principle of the Dapp are provided and compared to existing solutions on other blockchain. A basic roadmap is given, but the proposer provides additional details in an answer to a comment on ideascale which gives confidence in the project as it explains more about the challenges that must be taken.\r\nA whitepaper is promised for end of September. I recommend the proposer to publish the white paper before Fund 6 voting phase, so that voters can look for precisions about the protocol.\r\nConsidering all above, I grade the feasibility score of 4\r\n", "q1r": 4, "q2": "Goals of the project are clearly stated, and the solution is understandable. The basic roadmap -leading to Q1 2022- will have to be further detailed, but still it is there. A quite precise budget breakdown is given. I recommend the proposer to list metrics that will be communicated during the Fund6 governance phase to enable a monitoring by the community of the progress of the project. Based on the given information I grade auditability with a score of 4.", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}], "solution": "ゼロ知識の暗号証明に基づくプロトコルは、送信者と受信者の間のリンクを切断し、コンプライアンスのためのオプションを持っています。", "experience": "私たちは、応用数学の博士号を持つ2人の開発者からなるチームで、Cardano上で有用なツールを作りたいと考えています。"}