{"id": 369933, "author": "", "title": "'Donors choose - like' application", "url": "https://cardano.ideascale.com/a/dtd/369933-48088", "category": 26103, "amount": 2000, "description": "慈善団体での寄付は、透明性の問題、汚職、トレーサビリティーの問題から難しいと言われています。", "f6_no_assessments": 5, "f6_rating": 1.4, "videos": [], "media": [], "f6_assessments": [{"q0": "There are people out there that want to help.\r\nIf this is correctly implemented it could benefit a lot of people in need and cause more people to use Cardano. You would have to find a way to identify fake profiles though. This is another project that would benefit from becoming a DAO.\r\n", "q0r": 4, "q1": "More info and evidence of experience required to gain trust. The overall plan for this proposal will improve when more committed team members join and start contributing. You need all the key players for a proposal like this, so that they can identify the potential obstacles and solutions to make this project grow into fruition. Having a committed team and solid plan will increase the voters and CAs trust and your chance of getting funded.", "q1r": 1, "q2": "Needs the right team to come up with the right strategy to make this proposal's success and plan clear. Challenges and risks can only be properly identified and addressed when you have a committed team. The same goes for working out an effective roadmap with key performance indicators.\r\nDon't give up on this proposal. If it is something you really believe in I suggest you keep looking for key members to join you or look for similar proposals and ask to join their teams.\r\n", "q2r": 1, "assessor": "z_assessor_140", "no_vca": 8, "ne": 2, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Idea is good but solution is very poorly described.\r\nIt should be clearer how proposer wants to leverage blockshain features to solve finalcial donation problem stated.\r\n\r\nIt should also contain a proper development plan, divided into phases and clear deliverables. Also, how he intends to engage with charity intitutions to make his solution broadly available with a proper communication and marketing strategy.\r\n\r\n", "q0r": 1, "q1": "Only one individual with no development experience.\r\nOther resources would have to be aquired. \r\n\r\nNo plan is proposed and no costs breakdown are explicited nor how proposer got to total amount.\r\nExample of cots breakdown could be how much he wants to develop the app itself, how much he will pay for the developer, how much will be spent in marketing, how much will go to site maintance and blockchain costs, etc.", "q1r": 1, "q2": "No roadmap, milestones nor kpis are proposed. \r\nSuggestions of milestones:  intermediaite deliveravbles in app development (back-end dev, front-end dev, blockhain integration, charity institutions database, start of the communicaton sartegy, etc)\r\nsugeestions of kpis: how many institutions are registered, how many people are donatning, total amount donated, how many countries it reached.\r\n", "q2r": 1, "assessor": "z_assessor_298", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal does only states vague which kind of problem it wants to tackle. One can assume it wants more transparency but it doesn't show how exactly it will provide more transparency. Since the proposer wants to make an application the proposal aligns with the outlined challenge settings.", "q0r": 3, "q1": "The proposer doesn't provide much relevant skills or misses to describe them. There is no team mentioned. The proposal misses a budget, a time horizon and a roadmap. Given the provided informations it is quite unlikely the proposal gets implemented.", "q1r": 1, "q2": "Like mentioned above the proposal does not contain a lot of informations. It would help to assess if the proposer would add some metrics on which the delivery of the product could be measured. Since it doesn't get into details it makes it really hard to assess. ", "q2r": 1, "assessor": "z_assessor_41", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Draft proposal. The problem statement is reasonable, but there is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 2, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The idea itself is very good, in fact, I've seen several proposals saying that some of the difficulties in making a donation to NGOs / charities is the lack of transparency, bureaucracy and so on. With this problem, it would be useful to have a platform in which institutions could make a kind of document detailing what their needs would be, and donors choose or not to help. However, the problem here is that it is not said at all because that would be a dapp. Where would blockchain, ada, etc. come in? Are these donations made through ada, or a conventional currency? Do transactions result in blockchain, made through smart contracts? A relationship between the proposal and the technologies of the Cardano ecosystem remained to be drawn.", "q0r": 2, "q1": "Unfortunately, almost nothing is said about the author of the proposal. All we know is that he's already maintained a few sites, but he doesn't know much about programming. It would be important to know who he is, his name, his professional background, what his work trajectory to date, what sites he has created, where are they? It would also be essential for the author to demonstrate the intention of forming a team, because it would be necessary, in addition to programming people, a UI/UX designer, someone from advertising to make this idea known to the people, someone who understood blockchain and everything about the Cardano universe and also someone to keep in touch with the charities. If such information were provided, we could have a notion of team, because currently practically nothing is known, unfortunately.", "q1r": 1, "q2": "So, as in the previous comment, basically nothing is said about the project's auditability. I will suggest a roadmap: 1) start the development of the platform (dapp or website), as well as define which institutions would be covered here. 2) clarify where and how cardan ecosystem technologies would enter the project. 3) establish the target audience for advertising and launch advertising in a way that reaches and moves ada holders and people who could donate. 4) establish success metrics so that the community could track the development of the proposal. It would also be important, first and foremost, to set dates and explain how the USD 2000 would be used to carry out the project. If such information were made available, we would certainly have an auditability to analyze, because at the moment there is none, unfortunately.", "q2r": 1, "assessor": "z_assessor_57", "no_vca": 10, "ne": 9, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "受益者は、所定のフォームに記入して支援を要請します。リクエストはウェブサイトに表示されます。寄付者は賞を選択します。", "experience": "いくつかのウェブサイトを管理していましたが、プログラミングには精通していませんでした（例：Marloweなど）。\n\nチームを結成するために、同じ考えを持つ人を探しています。"}