{"id": 370010, "author": "", "title": "Liquidity for cross-border payments", "url": "https://cardano.ideascale.com/a/dtd/370010-48088", "category": 26103, "amount": 50000, "description": "従来の銀行は1年に180日近く休業しており、クロスボーダーの送金業者（MTO）にとっては流動性が不足しています。", "f6_no_assessments": 4, "f6_rating": 2.75, "videos": [], "media": [], "f6_assessments": [{"q0": "The powerpoint is sound but many DEFI apps already exists or are being built. It would have been great to explain what makes your project truly better or unique. Also why is ADA not in the supported asset list? I would have rated this project higher if it was better integrated in the Cardano ecosystem and its users. ", "q0r": 3, "q1": "Assuming history of what has been achieved, credentials and backing companies are valid and true, I have very little doubt about the team bringing this project to fruition.", "q1r": 5, "q2": "There is a roadmap and revenue projections but more details would have been useful. As it stands, more transparency on what is the budget for, and what will the ecosystem gain, and when would be needed for me to rate this project higher here.", "q2r": 3, "assessor": "z_assessor_314", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal looks to address a pertinent issue in the Defi space. And has existing success in the Thai market. ", "q0r": 4, "q1": "They do have a track record and business awards globally and impressive partnerships with VISA and already process a high volume of cash. However it's not clear how much of the software infrastructure is built for the Liquidity cross border payment plan. And what the awarded cash will go to during development. They are looking for quite a large amount of cash for the proposal and it is hard to see whether this will be successful or not. I do think it is a great idea though. ", "q1r": 3, "q2": "The proposal mentions the MoneySwitch token, if transactions with that token can be audited the success could be measured by volume traded and burnt. ", "q2r": 3, "assessor": "z_assessor_332", "no_vca": 7, "ne": 2, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "The proposal adresses a clear problem which states that the banks have to much downtime for MTOs. A defi lendig plattform would be a viable solution for that. Since it is a proposal for a money market it would be a dapp and therefore it is in the right category. ", "q0r": 3, "q1": "Developing a lending protocol is a huge load of work. The proposal unfortunately doesn't show how their team is planing to tackle this challenge. There is no clear plan for the budget and no exact skillset of the teammembers. It would also help if there would be some technical informations.", "q1r": 1, "q2": "Unfortunately the proposal doesn't contain a roadmap, any success metrics or a more detailed description of the solution or the problem. Without a plan which describes the progress of the idea step by step it makes it really hard to assess this proposal. ", "q2r": 1, "assessor": "z_assessor_41", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "This proposal does indeed address the challenge, but just how effectively it addresses it is left up in the air due to the lack of specifics in how they plan do implement their cross-border MTO defi lending solution.", "q0r": 3, "q1": "Given the lack of specifics about this proposal it leaves many unknows about feasability and likelyhood that they will be successful. \r\n\r\nJust what exactly does success look like for this MTO lending solution? Voters cannot know that, because the proposal doesn't get into specifics about their proposed MTO lending solution.", "q1r": 2, "q2": "The proposer has no listed roadmap, time line or auditable KPIs for the proposal, making it difficult to objectively measure the proposal and whether or not it was successful.\r\n\r\nCatalyst voters should be able to read clearly what the KPIs are and this proposal does not offer them that opportunity.", "q2r": 2, "assessor": "z_assessor_577", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "カルダノを利用したDeFiレンディング・プラットフォームにより、MTOは流動性提供者の競争力あるリターンと引き換えに、流動性にアクセスすることができます。", "experience": "私たちのチームは、タイで最大のライセンスMTOであるDeeMoneyを運営しています。私たちは実践的な経験と確かな成功実績を持っています。"}