{"id": 384602, "author": "petervg", "title": "Factpage: Cardano fact check site", "url": "https://cardano.ideascale.com/a/dtd/384602-48088", "category": 26239, "amount": 28500, "description": "Les fausses nouvelles et la désinformation concernant Cardano sont renforcées lorsque les faits ne peuvent pas être vérifiés de manière indépendante et séparés des faussetés.", "funded": 2, "upvotes": 98673207, "downvotes": 3155973, "votes_result": 95517234, "votes_cast": 464, "f6_no_assessments": 8, "f6_rating": 4.25, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=0"], "media": [], "f6_assessments": [{"q0": "This proposal meets the requirements of the fund challenge setting and also is quite scalable in terms of the way they are designing their system to handle a variety of situations to assess whether it is factual or not.  ", "q0r": 5, "q1": "The skills listed of the developers planning to develop this solution definitely appear to have enough experience to deliver on a project like this.  Their outline of the roadap and where the Fund 7 funds would get the project to are nice detail to highlight the complexity of the solution that they are proposing.", "q1r": 5, "q2": "This proposal highlights the items that would make their proposal very transparent and visible for auditing purposes.  They have deliverables timed, a breakdown of funds, and a roadmap going through to solution completion.", "q2r": 5, "assessor": "z_assessor_13", "no_vca": 27, "ne": 1, "ng": 18, "nfo": 8, "vca_o": 1}, {"q0": "This is an extraordinary proposal. Not only it has a clear understanding of the challenge and its goals, but it solves its main question splendidly. The source of the problem of the challenge is isolated and clearly identified, it is the lack of auditability of some facts that are used to distort information and create fake news and scams. The solution proposed addresses this problem in a brilliant way and with an unbelievable solidity. They explain that by building Factpage not only they are creating a repository of media using verified audit trails, but they are also classifying them in terms of different qualities effectively creating a taxonomy, which in turn will add value to the Cardano ecosystem because truth about Cardano and ongoing and past events will be much easier to be established even for beginners. The key metrics used are highly aligned with the outlined challenge settings. For instance, enhancement of transparency and the construction of a repository of scam attempts are some of them. Finally, they have discussed as well, paths to achieve scalability in the future by means of reliably automating different tools that will be used, which will turn the solution to a decentralized model.", "q0r": 5, "q1": "A lot of evidence of relevant skills and experience was given to support the naming of Peter Van Garderen and Dr. Hossain Maserrat to the project. The proposal describes their professional past as well as provide LinkedIn links to further explore their professional career. Also, they have estimated the type and number (just two) of team members required for the project. Moreover, the budget is well explained, broken down into identifiable items that are granular enough and the total amount asked for is reasonable. The timetable is realistic and takes into account that only the first 3 months will be sponsored by the fund resources. They are very clear in describing how each phase will develop what they have proposed. For example, they explain how they intend to construct a proof-of-fact explorer and how they intend to escalate in the future, making everything they can automated.", "q1r": 5, "q2": "The roadmap traced is over the top. It has enough milestones and they all are relevant. Plus, the time horizon is pretty reasonable. Besides that, the metrics defined are strongly aligned with the goals of the challenge. For example, they set making truth easier to be established even for newcomers and transperancy being enhanced two metrics to be pursued. However, more quantifiable KPIs could have been defined such as number of scam attempts in the repository or amount of information regarding Cardano treasury. Finally, the solution is understandable and addresses the problem if it succeeds. ", "q2r": 4, "assessor": "z_assessor_341", "no_vca": 24, "ne": 12, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "Fact checking website that is popular will help the ecosystem to curb or reduce Disinformation .This proposal  effectively fits into the challenge brief. The preliminary work done on the idea shows commitment on the team part to implement this project.I would suggest the team collaborate with other teams working with similar solutions to avoid work duplication.", "q0r": 4, "q1": "The Team is currently working on a Cardano Project which they will leverage their experience on the current project to this one.  The road map and plans indicate that after 6 months , we will have a Production-ready Factpage service. from the plan and experience presented , its highly likely this project will be successfully.", "q1r": 4, "q2": "The budget Item and the fund allocated is well defined and the definition of success after 3,6 and 12 though mixed with the road map is very clear.", "q2r": 4, "assessor": "z_assessor_430", "no_vca": 19, "ne": 2, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "Great proposal. Providing a safe haven for the Cardano community is still something we are missing today. We already have different channels providing trustworthy information like IOG and Charles AMA's, but delivering them all in one place will help secure the facts within the community.", "q0r": 4, "q1": "Regarding the team, for this proposal they already provide the overseeing project. This provides us with trust in them that they have the relevant experience. What I am missing in the proposal is the white paper they are referring to. They say their website Orcfax has the whitepaper but have not found it on their website. This would've provided more insight on the legitimacy of the technology they wish to use for their proof-of-fact. A solid roadmap, in the budget breakdown they ask for a fairly high hourly rate but explain why this is and this seems reasonable. Although I find the reasoning a slighty exaggerated, this is something the team proposes themselves so they should be able to mitigate this.", "q1r": 4, "q2": "We get the necessary information needed for the succession of this proposal. The roadmap gives transparency to the project and even includes a blog post on the update of the project each month, which is a surplus for the community. What would make this proposal better is including some KPI's and metrics on what the team wishes of the project, what are their goals to achieve?", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 20, "ne": 3, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "this proposal is quite helpful to confirm Fake News and misinformation about Cardano is empowered when the truth cannot be independently audited and separated from the false.this project will help the community The community can verify the information quickly and honestly. But I'm a bit confused about who will moderate the content, verify that information transparently. I think you should try to come up with a plan. public vote for fairness with news to filter them. Please consider my opinion, and I also quite like your idea of a place to verify accurate information.", "q0r": 4, "q1": "I think with the experience statement Orcfax Development Team implements a trusted, decentralized \"proof of authenticity\" using W3C, IPFS, DAG specifications and Cardano notary and associated shards of the team. is experienced enough to implement the above proposal and I have also reviewed your proposal in fund 6. The project budget is clearly divided by section, the team also explained more about the cost part. I quite like the way you explain the reason for the high budget so clearly. However, I am a bit confused as to how I can track the progress of the project when it is done, hope you will give more accompanying documents and how to track the project as it is executed.", "q1r": 3, "q2": "the solution described the problem clearly and easy to understand. but the main problem here is the transparency of the project to the community, and the team is missing some information. you have a good idea for a where cardano's correct information is located, I like this idea. I think you should clarify more on how the recommendation works, how it works to give accurate information without manipulation. you also need more KPIs to determine the success of the project to help the proposal be appreciated for transparency. Hopefully next time the team will do better.", "q2r": 3, "assessor": "z_assessor_644", "no_vca": 20, "ne": 5, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "This project aims at developing a website \"FactPage\" gathering articles and media about Cardano created by reputable original sources. The purpose of this page is not to be the source of the truth, but to enable users to easily check an information with the appropriate original source.\r\nThe main added value comes from the classification of media to assist the user in finding relevant fact checking information. \r\nThe proposal clearly articulates with the challenge goals and show how value is added to Cardano through a shield against disinformation attacks. I strongly agree that this proposal effectively addresses the challenge. \r\n", "q0r": 5, "q1": "The two team members are identified by their LinkedIN profile. They list the skills necessary to implement the project. They are currently prototyping the Orcfax oracle solution, a Fund 6 successfully funded project. \r\nThe detailed plan and the description of the solution give confidence in the project: expectations and challenges are well identified.\r\nOrcfax project has been funded in F6 and is still under development, FactPage will not mobilize other ressources than the 2 team members. I recommend the proposer to elaborate on to risk conducting the two developments simultaneously during the first 6 months of 2022.\r\nBased on my understanding of the proposal, I agree that it is likely to be successfully implemented.\r\n", "q1r": 4, "q2": "The budget breakdown mentions a server cost and developers hourly rates. Success is well defined, along with a quite precise roadmap. As a proof of concept is expected after two months, and a MVP after 3 months, the progress will be monitored by following the roadmap and publications of results.\r\nI agree that the community will be able to monitor the progress of this project.\r\n", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 20, "ne": 4, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "This proposal really addresses the challenge as it wants to archive media about Cardano using the verifiable audit trails implemented in the Orcfax oracle project (a successful proposal has been funded in Fund 6) and publish an explorer called fact.page. This is not only a brilliant idea on how gather authentic history of information about Cardano at a place, but also a powerful tool when it offers people a repository to look up for the facts being officiallly published by Cardano. And then they will decide/ verify their concerns by themselves. This makes the platform a place to get trustful references, without usual worries - to be misled and manipulated. I rate this proposal for the highest score of 5 for its impact to Cardano ecosystem.", "q0r": 5, "q1": "I have checked Orcfax and all the references they attached, I can see the team really dug into the problem and has their methodology of \"proof-of-fact\", which is powered by a set of tools W3C specs, IPFS, DAGs and Cardano notarization. \r\nThis proposal is in-charged by a powerful team. Although the rate of $75/ per hour * 360 hours makes the cost for developers take nearly one third of this challenge budget, but they do give clear explanation for this rate, so I think it's acceptable. \r\nThe development plan of this proposal is clearly divided into 3 processes and well written in each. Timeline is also well allocated. It's highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "I can see metrics and KPIs of this proposal is thoroughly considered by the team. They plan details on how and when each version of this fact.page will be updated. This proposal provides me with sufficient information to access the progress. ", "q2r": 5, "assessor": "z_assessor_836", "no_vca": 18, "ne": 1, "ng": 16, "nfo": 1, "vca_o": 1}, {"q0": "While factpage does not tackle disinformation directly, it can go a long way in helping to find reliable and verifiable information. This is one response to the fight against disinformation. Therefore, it is a good idea to proposal.\r\nAdditional info on the original media source and the link to orcfax would help.\r\nConcrete examples should be given of documents that the factpage could or could not exclude to make certain information more readable.", "q0r": 4, "q1": "The proposal is directly connected to orcfax, we must not forget to mention it and its development is linked. It may need to be integrated into the road map.\r\nData storage must be quantified and evaluated.\r\nThe costs are detailed and in line with the roadmap", "q1r": 4, "q2": "The milestones are clearly mentioned but information is lacking on the expected results and what evaluation criteria are set.\r\nPerhaps a period of community testing should be added.", "q2r": 3, "assessor": "z_assessor_884", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}], "solution": "Archiver les médias concernant Cardano en utilisant les pistes d'audit vérifiables mises en œuvre dans le projet Orcfax oracle et publier un explorateur sur fact.page.", "experience": "L'équipe de développement d'Orcfax met en œuvre des \"preuves de fait\" fiables et décentralisées en utilisant les spécifications W3C, IPFS, DAG et la notarisation Cardano."}