{"id": 382500, "author": "pia.c.andrews", "title": "Regulation/legislation as code repo", "url": "https://cardano.ideascale.com/a/dtd/382500-48088", "category": 26249, "amount": 90000, "description": "目前，对规则的公开获取并不普遍。我们认为这阻碍了民主国家的建设，政府的透明度和诉诸法律的机会。", "funded": 1, "upvotes": 55815538, "downvotes": 25435893, "votes_result": 30379645, "votes_cast": 164, "f6_no_assessments": 3, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "根据问题陈述，解决方案的陈述是合理的，两者都写得很清楚。该挑战旨在加速开发 \"涵盖基础性注册解决方案 \"的dApps，重点是在区块链上存储/检索生命记录。拟议的开源应用程序本身不是一个去中心化的应用程序，但它旨在从区块链中提取法律和监管数据（即 \"作为代码的立法\"）并确定监管合规性或用户资格。作为一名发展经济学家，我同意全球非常需要这样的系统，因为它们将加快获得关键服务的速度，并削弱腐败的影响（特别是在发展中国家）。这种系统也可以用来利用财产登记的价值，因为分区/建筑法规可以针对存储在区块链上的特定地块进行应用。我最关心的是，相对于这项挑战的总拨款（现有60万美元中的9万美元），该提案的预算规模。也就是说，将该项目分成两个不同的阶段（开发MVP和随后的测试）可能不可行。总的来说，我非常同意该提案有效地解决了挑战。", "q0r": 5, "q1": "该团队规模相当大，成员在法律、法规、开放式政府标准和软件开发领域拥有丰富的经验。该团队提供的计划非常详细和清晰，鉴于我与各种创业公司合作的经验，考虑到成功完成该项目所需的时间和其他资源，预算（虽然很大）似乎是合理的。如果该团队能提供完成该项目两个阶段所需的总时数估算（以及隐含的小时工资率）就更好了，但考虑到所涉及的工作范围，这可以理解为难以准确估算。总的来说，这个团队极有可能成功开发出拟议的项目交付物。", "q1r": 5, "q2": "拟议的可交付成果和团队提供的关键绩效指标都非常明确。该团队没有处理潜在的负面风险，但考虑到新西兰法律数据库的前期建设以及该团队在上述数据和BetterRules项目上的工作经验，无法交付工作产品的可能性不大。也就是说，在实现关键绩效指标方面存在较大的不确定性，而这一点的负面风险并没有得到解决。总体而言，我同意该提案提供了足够的信息来评估其进展。", "q2r": 4, "assessor": "z_assessor_914", "no_vca": 21, "ne": 14, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of lack of open access to government regulations and legislation by coding government rules into an open platform which partially aligns with the challenge goals but is not a foundational registry solution listed in the challenge.   \r\nThe proposal does a good job of articulating the value to Cardano ecosystem, and articulating how the solution scales to address future challenges.\r\nThe proposal could be improved by providing key metrics and goals that closely align with the challenge, and either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.\r\n", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of team composition, budget is broken down and reasonable (more detail would improve), realistic timetable and plan, and detailed technical explanation of the solution.\r\n\r\nThe proposal's feasibility could be improved by evidence of experience (twitter accounts and proposal blurbs are insufficient), and a challenges and risks section.\r\n", "q1r": 4, "q2": "The proposal includes a roadmap, milestones, time horizon (very rough), a clear understandable description of the targeted problem and a detailed description of the solution that addresses the problem.\r\nTo improve the proposal include metrics/KPIs to measure proposal success.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 22, "ne": 2, "ng": 18, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is precisely the kind of thing we need, not just on Cardano but in this whole space. The more public goods, the better. Making regulation and legislation clear to those that wish to integrate their Dapps into the world and making the rules clear and open for all is a must-have to take advantage of our existing legal systems. ", "q0r": 5, "q1": "The team has in-depth experience and understanding of the problem and current systems we have in place; with that in mind, I have high confidence that we will see this implemented successfully.", "q1r": 5, "q2": "There is a clear description of the problem and solution here with identifiable measures of success based on the milestones. Key performance indicator's and what needs to be done is laid out clearly and on understandable grounds.", "q2r": 5, "assessor": "z_assessor_903", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}], "solution": "一个社区管理的法律/法规的开源平台，任何人都可以在此基础上做出贡献，并建立一个法律资格工具来帮助人们。", "experience": "一个由8人组成的团队，拥有超过5年的代码规则、设计、开发、政府平台、法律/法规和跨文化实践经验。"}