{"id": 383855, "author": "sucy", "title": "Infrastructure/Fund tracking system", "url": "https://cardano.ideascale.com/a/dtd/383855-48088", "category": 26249, "amount": 60000, "description": "在发展中国家建设基础设施时，腐败往往是一个挑战。我们通过链上文件来缓解这一问题。", "funded": 0, "upvotes": 15307404, "downvotes": 13823928, "votes_result": 1483476, "votes_cast": 97, "f6_no_assessments": 7, "f6_rating": 2.142857142857143, "videos": [], "media": [], "f6_assessments": [{"q0": "该建议背后的基本想法相当好，利用区块链的优势之一（不可更改性），以迫使政府发布数据来跟踪和监测基础设施项目，这完全属于挑战的范围。\r\n这种类型的方法的一个关键优势是，它可以在其他地方复制，区块链本身可以满足一个所谓缺失的基础设施的需要。\r\n像这样的建议在全球范围内的影响将是有限的（2020年所罗门岛的人口是686.878），但专注于小的现实可能是在这个挑战中提出可行项目的唯一途径。\r\n对于这项建议，已经提出了一个工作用例（http://www.sirdp.org.sb/），这很好地说明了所需要的东西和将被使用。\r\n遗憾的是，该提案只对其背后的基本概念作了一般性的描述，这也是影响方面只得4星的主要原因。如果能提供更多关于将要使用的机制的细节，那就更好了。", "q0r": 4, "q1": "该提案背后的团队似乎已经与所罗门群岛政府建立了联系：提出的平台（http://www.sirdp.org.sb/）将被迁移到区块链系统，并由 \"发展规划部 \"注册，这很好地证明了提案人与所罗门群岛政府之间已经在进行合作。不幸的是，这些链接没有包含在提案本身中，最好能将其添加进来，以便于参考。\r\n因此，开发项目所需的技能体现在开发的 \"传统 \"部分，但没有介绍全面交付所需的区块链技能。\r\n列出并描述架构和所涉及的技术也将是非常好的。\r\n- 你将使用元数据来存储数据，还是使用不同的机制？\r\n- 你是否计划开发一种协议格式，以便在长期内提交的数据具有一致性？\r\n- 你将如何将目前的网站连接到区块链上？你将使用哪些语言/技术来实现这一点？\r\n- 将会有一个机制让公众用户访问链上数据（针对这个范围）？\r\n提供一个关于项目各阶段发展的更详细的明细，试图估计每个阶段所需的小时数和预算，这也是非常重要的。\r\n在路线图中指出了 \"与世界银行或非政府组织合作收集用户反馈 \"的阶段，但没有提供额外的细节，预算中也没有提到这部分项目。\r\n总的来说，在提案中提供更深入的细节，这真的很重要，可以真正提高可行性标准的评级。", "q1r": 2, "q2": "不幸的是，没有任何迹象表明社区可以使用任何关键绩效指标来跟踪项目的进展。\r\n对于开发阶段，报告Github提交的数量/问题/里程碑将是很好的，一般来说，在项目规划中设置具体的里程碑（例如，UI/UX桌面草案，MVP没有图形开发，等等）可以帮助社区验证一切都在轨道上。\r\n如果是在项目的范围内--从提案本身并不清楚--指出一些指标来跟踪反馈阶段的情况会很好。", "q2r": 2, "assessor": "z_assessor_147", "no_vca": 21, "ne": 11, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of corruption in infrastructure funding by a decentralized platform for tracking infrastructure project fund usage which partially aligns with the challenge goal but is not a foundational registry solution listed in the challenge.  \r\nThe proposal could be improved by articulating the value to Cardano ecosystem, articulating how the solution scales to address future challenges, providing key metrics and goals that more closely align with the challenge and either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.\r\n ", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of team composition, additional funding plan (Fund 8 for Beta version), realistic timetable and plan, technical explanation of the solution (should be more  detailed)\r\nThe proposal's feasibility could be improved by evidence of experience (attached photos and description are insufficient), budget is broken down and may be reasonable but more details are needed like actual numbers of people in each role all of which are plural, and a challenges and risks section.\r\n", "q1r": 3, "q2": "The proposal includes a roadmap, milestones, time horizon, a clear understandable description of the targeted problem and a description of the solution that addresses the problem (should be more detailed).\r\nTo improve the proposal include metrics/KPIs to measure proposal success.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Proposer clearly states the problem and offers a quality solution. This idea would definitely have a positive impact on the Cardano ecosystem if implemented. The proposal does not show how this idea will add value to the Cardano ecosystem, nor is Cardano mentioned at all. With such great ideas, it would be good to have missing KPIs because of that it's hard to compare KPIs with a challenge setting. Unfortunately this proposal is not able to scale and address future challenges.", "q0r": 2, "q1": "It would be good to have information about the team and their work and how many people would work on this project. Perhaps there are links that would give a clear insight into the skills, knowledge and experience of the team and a link that can give us an insight into the teams work done so far. The budget is clearly shown but not broken down into identifiable items so it is difficult to conclude whether the amount requested is realistic for the implementation of this idea. Unfortunately a detailed implementing plan and details of actionable tasks and execution orders have not been developed and presented. It would be good to have elaborated time frames within which the work will be completed and list the necessary resources and technical aspects required for implementation. With ideas like these that involve governments and working with large sums of money, it would be good to have an idea of the potential risks as well.", "q1r": 1, "q2": "Unfortunately, we do not have a detailed roadmap with milestones and KPIs in the proposal. Due to the lack of all the necessary information the community unfortunately can't track this proposal in any way. ", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Great idea. No two ways this would be useful to many countries in the developing world. However, I think it would be helpful if it starts from a specific country and expands in a strategic manner. \r\n\r\nAlso, it is stated as part of the roadmaps that, 'Co-op with World Bank, or NGO to collect the user feedback', \r\n\r\nI think the feedback from users should include a feature where locals or individual citizens can rate feedbacks or make input on it. \r\n\r\nThe proposal is clear and concise and I think it addresses the challenge and should consider DAO in order to make the initiate independent from the government. ", "q0r": 4, "q1": "It would have been helpful to have included a Linkedin link to share the team's profile. More information needs to be worked on the proposal in defining success and metrics for measuring progress and implementation.", "q1r": 3, "q2": "Great breakdown of the budget. There is a need for the team to be open and transparent for auditing. Hence I would like that the team to document activities and include periodic progress reports on activities.", "q2r": 3, "assessor": "z_assessor_727", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The proposal clearly identifies a problem within the challenge and articulates how it will add value to the cardano ecosystem. The type of corruption that you want to attack must also be better worked on. When it comes to metrics, better work is required. In this way, I believe that the proposal can be improved for future challenges.", "q0r": 2, "q1": "The experience presented is insufficient. The proponent does not provide sufficient evidence to determine her skills and experience in the proposal. The budget is not properly prepared and does not allow to identify the use that will be given to it. Nor is there a calendar that allows the development of the proposal to be identified.", "q1r": 2, "q2": "The proposal does not have a roadmap with clear milestones that allows observing a time horizon. This aspect is clearly insufficient and the process cannot be audited.", "q2r": 1, "assessor": "z_assessor_778", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This project if successful promises great impact in terms of preventing corruption, as well as demonstrating the power of Cardano in the governmental sector. \r\n\r\nHowever, corruption in developing countries is complex and multifaceted, and it's hard to understand how well the team has understood the problem in order to address this challenge efficiently, and incorporate it into the product development process. Would be much better if the team can demonstrate this further in order to convince assessors and voters. ", "q0r": 3, "q1": "As discussed, the critical element of this project is the ability of the team to understand the mechanisms of governmental operations and how corruption happens, and the ability to work and test with real government in its customer development process. It must have been better if the proposer did give real reference (with links) and explanation to its past projects working with the government of Solomon Isands or Ghana, or its ability to reach out and work with World Bank. \r\n\r\nOn the other hand, the proposer would have convinced assessors and voters better with more detailed roadmap with milestones and KPIS, as well as evidence and reference to the team's profiles. USD $60,000 is a big amount, and one expects more depth and well thought out plan from a proposal trying to work with governments.", "q1r": 1, "q2": "Without a detail working plan, and description of what does success look like, it'd be hard to audit the progress and success of the proposal in action. ", "q2r": 1, "assessor": "z_assessor_953", "no_vca": 23, "ne": 1, "ng": 18, "nfo": 4, "vca_o": 1}, {"q0": "this is a good idea. However, what the proposal is missing is the need to clearly state how to add value to the Cardalo ecosystem and the scaling issues to solve the problem in the future. The solution gives the problem in accordance with the proposal", "q0r": 1, "q1": "I believe the proposal achieves better success when the aspects need to be improved such as giving evidence of relevant factors in specific details. As for the proposed budget, the offer is very general. Books must be logically divided clearly into more specific sections", "q1r": 1, "q2": "The proposal lacks some important information such as more details about the proposed budget. If the proposal requires additional funding for implementation, the implementer needs to provide a clear and informed plan on how to use the funds. Information about the team of each person in the proposal. I recommend giving this information to the community to better evaluate, thank you", "q2r": 1, "assessor": "z_assessor_958", "no_vca": 22, "ne": 1, "ng": 15, "nfo": 6, "vca_o": 1}], "solution": "建立一个分散的平台，政府可以跟踪和监督基础设施项目和资金的使用，以避免腐败。", "experience": "我们的团队开发了一个项目，创建了一个全面的系统来跟踪和监测所罗门群岛的基础设施项目。"}