{"id": 385134, "author": "titan", "title": "Personal Identity Management", "url": "https://cardano.ideascale.com/a/dtd/385134-48088", "category": 26249, "amount": 25000, "description": "在元宇宙中，你是你想成为的人，你需要管理你的身份。", "funded": 1, "upvotes": 64127999, "downvotes": 4335667, "votes_result": 59792332, "votes_cast": 184, "f6_no_assessments": 3, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "It is a major stretch to claim that identity management for online \"nations\" is a solution that falls within the scope of the challenge.\r\n\r\nThere is no indication as to how the proposal adds value to the Cardano ecosystem in fact to quote the proposal, \"This proposal addresses authentication. Off-chain authentication. It doesn't need the Cardano blockchain to work, it will only be cryptographically compatible with it.\"\r\n\r\nThe goals of the project do not align with the challenge and no key metrics are provided. \r\n\r\nHow scalability will be achieved is not addressed in the proposal.\r\n\r\nTo improve the proposal: select a more appropriate Challenge (Dapps & Integrations mentioned seems most appropriate or Miscellaneous), articulate how the proposal adds value to the Cardano ecosystem, include goals and metrics that align with the challenge, include a scalability description.", "q0r": 2, "q1": "The proposer provides evidence of relevant skills and experience needed to implement the proposal.\r\nThe proposer intends to be the sole team member, other than a video editor, required to implement the proposal which holds some risks.\r\nThe budget is broken down into identifiable items but not very clearly. \r\nThe budget seems reasonable to achieve the set goals.\r\nThe proposal has a timetable to complete the work.\r\nThe proposal explains technical aspects of the implementation.\r\nThe proposal does not include challenges and risks relevant to a successful implementation.\r\nTo improve the proposal: make the budget breakdown easier to read, include a challenges and risks section, consider including a co-developer.", "q1r": 4, "q2": "The proposal includes a roadmap with milestones and a time horizon for achievement.\r\nThe proposal does not provide metrics/KPIs that define the success of the proposal. The KPI section is a list of deliverables instead of measurable metrics of progress.\r\nThe proposal provides a clear understandable description of the targeted problem.\r\nThe proposal provides a clear understandable solution that addresses the problem.\r\nTo improve the proposal: provide metrics/KPIs that better measure progress instead of deliverables", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "Due to my political experience I am able to evaluate proposals related to nation building. This proposal manages to adress this topic in the identification of identity management and hints at this as a possible starting point for putting bureaucracy onto the blockchain. I think it will be beneficial to the Cardano Blockchain and conceptually can be scalable buy the uses it's built onto.", "q0r": 5, "q1": "My purely academical programming experience (C, MATLAB, Python, CLI commands in various OSes) does not enable me to evaluate complete Plutus scripts, however i have a general structural understanding of coding and can see from the proposer github that he definetely knows coding. Apart from that he is also pretty transparent about himself. He explains some technical vackground alongside technical requirements, risks and their remediations. While a timeline is there, the points of each weekend block could maybe be more diversified and explained more thoroughly to give a better idea of the scope of the timeline deliverables. In general, your plan could have a better, more presentable structure, which is probably a reason for the fact that your proposal got a lot of invalid assessment as it was a bit difficult to follow the structure of the proposal. But still, well done :-)", "q1r": 4, "q2": "Your problem statement is clear. The solution statement is very descriptive in general and opens up a lot of good points, however some things could be explained better, for example yoy slightly go into a voting mechanism weighted by engagement but don't go into it any further. Your timeline and metrics are sufficient to Audit the proposal, however they could still contain more details in eventually upcoming proposals, i.e. you could be a bit more descriptive what each milestone encompasses to make the success metrics less open", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 24, "ne": 4, "ng": 20, "nfo": 0, "vca_o": 1}, {"q0": "This is a great and interesting idea by the proposer. The proposal is detailed and effectively addresses the challenge. When successfully implemented it has the potential of bringing value to the ecosystem.", "q0r": 5, "q1": "The proposer posses relevant skills to execute the project. The proposer went further to provide relevant links of his works and contributions he has made in the software development community. The proposer however has not shown who the team members are. The budget is not broken down into smaller components for easy assessment.", "q1r": 4, "q2": "The proposer has stated the required KPI's, roadmap and has described how success will look like after project execution. ", "q2r": 5, "assessor": "z_assessor_420", "no_vca": 24, "ne": 0, "ng": 15, "nfo": 9, "vca_o": 1}], "solution": "一个基于高清钱包的身份解决方案，管理你的在线存在和认证。", "experience": "从小到大的编程"}