{"id": 381288, "author": "hotspringfinder", "title": "Flutter SDK", "url": "https://cardano.ideascale.com/a/dtd/381288-48088", "category": 26251, "amount": 15000, "description": "Flutter - самое быстрорастущее сообщество разработчиков мобильных приложений, но в настоящее время в экосистеме Cardano нет поддержки библиотеки Flutter.", "funded": 2, "upvotes": 73346287, "downvotes": 5667624, "votes_result": 67678663, "votes_cast": 257, "f6_no_assessments": 4, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Как следует из названия, авторы проекта хотят создать инструментарий для создания простых интегрированных приложений Cardano для устройств android и ios. Это будет иметь большое значение, поскольку существует потребность в большем количестве Dapps, как мобильных, так и нет. Рост Cardano зависит от таких проектов, чтобы пригласить больше экономических стимулов в экосистему. Если вы нетехнический человек: SDK (комплект для разработки программного обеспечения) необходим разработчикам для написания приложений. Предложение абсолютно точно знает, какую проблему оно решает и какие трудности возникнут на пути ее решения. Этот проект принесет пользу экосистеме cardano, и в предложении четко указано, как он собирается это сделать. К сожалению, нет ключевых показателей, которые бы говорили о соответствии постановке задачи. Учитывая, как будет выглядеть команда, я не сомневаюсь, что пропсал сможет масштабироваться в будущем.  По сравнению с другими предложениями, я бы сказал, что это предложение немного не дотягивает до того, чтобы сторонники могли следить за ним.", "q0r": 5, "q1": "Автор предложения доказал свою работоспособность в предыдущих раундах финансирования и имеет работающий и реализованный проект. Это большая гарантия того, что постоянная работа, доставка и качество будут соответствовать стандартам сообщества Cardano. Одно небольшое предложение, которое у меня есть, заключается в том, чтобы действительно перечислить некоторые полномочия людей, которые будут работать над проектом, поскольку перечисление общего опыта - это здорово, но это не добавляет доверия к предложению, поскольку нет никаких доказательств этого заявления. Я лично буду следить за развитием этого проекта. Связи членов команды - это ценный актив, который привносит доверие к любому предложению. Бюджет изложен, хотя и не разбит на части, но при взгляде на почасовой график становится ясно, куда пойдут деньги. Будучи сам разработчиком, я считаю, что это реалистичный график для выполнения описанной работы. Предложение делает очень хорошую работу, описывая не только \"почему\", но и \"как\" всей реализации, что важно с технической точки зрения. Все ресурсы, необходимые для реализации проекта, хорошо описаны и понятны. Для нетехнических людей почти слишком много технических объяснений. Проблемы и риски могут быть не учтены, но, учитывая опыт автора предложения, я бы сказал, что это не проблема.   ", "q1r": 4, "q2": "Существует репозиторий с открытым исходным кодом, где любой желающий может следить за ходом реализации предложения, что очень хорошо с точки зрения проверяемости, поскольку любой член сообщества может легко проверить проделанную работу. Я бы рекомендовал более тщательный план мониторинга. От KPI предложений можно было бы требовать большего, например: количество добавлений, скачиваний SDK и т.д. Есть более или менее четкая дорожная карта, которой нужно следовать, но следовать ей негде, кроме github, который может быть достаточно хорош (время покажет). Есть четкая проблема, которую нужно решить, и средства для ее решения.  Для будущих предложений я бы рекомендовал более нетехническое описание, а для тех, кто заинтересован, вы можете оставить ссылку на whitepaper или какую-нибудь техническую документацию по дизайну.  ", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": " This software is providing a core SDK for Cardano and will benefit developers from the Google Flutter project environment. These SDKs will save substantial efforts in the future and will provide a rapid onboarding experience. This is the right project for this challenge. ", "q0r": 5, "q1": "The proposer has already developed a functional and usable Flutter SDK that can be used for creating mobile and desktop wallets. The features that are proposed in this fund are imported and with the competence of the proposer and based on his work so far it is very likely that he will be able to complete the work.", "q1r": 5, "q2": "The proposal has a clear list of deliverables and each one of them is important. The code is hosted in open and can be reviewed. The success of the proposal and its impact depends on the adaptation of the SDK. This is an unknown area and can only be measured after the development and proliferation of the Cardano Smart Contract environment. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The proposal looks to complete an open source Flutter SDK project that the community can use to interact with the Cardano blockchain in a mobile environment. To reach mass adoption the community will need to have SDKs in multiple languages and environments so that DApp builds are able to create solutions using the Cardano blockchain. Providing this proposal can be executed well it could have a large impact on opening the door to developers who prefer working with Flutter as a development environment. To give a better impact score it would have been great to see some people already using the SDK or some evidence of the demand for it so that to an advisor it is crystal clear that this proposal will start producing more impact within the ecosystem.", "q0r": 4, "q1": "The proposer adds in their background in the relevant experience section but does not attach a source such as a LinkedIn profile. A video is provided of the SDK and also a link to the open source repository. Both the repository and the video help to provide sufficient evidence that the proposer has the expertise to complete this proposal as has already been demonstrated in the code produced. The tasks and hours are broken down by feature into very reasonable time frames along with a very reasonable budget for completing those tasks. The following tasks for the proposal appear to be more complex by nature to provide all the functionality required however based on the information and evidence provided it appears likely this proposal can be executed as intended.", "q1r": 5, "q2": "The proposer adds a detailed feature roadmap with the hours required and the repository and video also give good clarity on what the proposal is intending to do. No success objectives or KPIs are provided. It would have been great to see some KPIs or evidence of types of projects that are interested in using this SDK as some extra information. The project is already open source so the existing and ongoing implementation can easily be audited.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 16, "ne": 6, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "Open source SDK's are critical to making Cardano development a fully decentralized process with low barriers to entry. This proposal is an extension to the fund 5 backed proposal to build and maintain a Flutter SDK for Cardano wallet.", "q0r": 5, "q1": "The proposer covers their progress made since fund5 in the initial section of the proposal and expands on their plan to develop a production ready Flutter SDK with full Cardano wallet functionality (contracts, staking, native assets). ", "q1r": 5, "q2": "The info provided in the fund 7 goals, SDK demo and pub dev link are sufficient to audit the progress and successful outcomes for this proposal. ", "q2r": 5, "assessor": "z_assessor_804", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}], "solution": "Завершите разработку SDK Flutter с открытым исходным кодом из Фонда 5, чтобы предоставить готовый к производству Cardano on-ramp для разработчиков мобильных, веб- и настольных систем Flutter.", "experience": "Фонд 5 Финансирование и реализация проекта\n4 года Flutter/Dart\n10 лет iOS/Android\n25 лет Java на стороне сервера\n6 лет Инструментарий/генерация кода"}