{"id": 384527, "author": "vivek", "title": "Dataset - Stake Pool Analytics", "url": "https://cardano.ideascale.com/a/dtd/384527-48088", "category": 26251, "amount": 10080, "description": "Полные исторические данные по пулу колов для анализа и машинного обучения в настоящее время недоступны ни через блокчейн-разведчиков, ни через существующие сайты", "funded": 2, "upvotes": 54808984, "downvotes": 15076497, "votes_result": 39732487, "votes_cast": 143, "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Инструмент, который будет получать данные из нескольких источников в сети и внешних источников данных, предоставляя аналитику по нескольким темам, связанным с работой бассейна. Предложение соответствует условиям задачи, предлагая обучение и рост для сообщества и SPO, чтобы быть точными. Есть четкие примеры того, как проект повысит ценность экосистемы cardano, привлекая больше людей в качестве SPO путем обучения их надежности всей операции. Отсутствие KPI и метрик для измерения успеха, что странно, учитывая, что авторы проекта делают аналитическое предложение. Как разработчик, я считаю, что этот проект мог бы хорошо масштабироваться с потенциальным ростом (с технической точки зрения).  Это часть, которой не хватало в экосистеме, и многим нынешним SPO приходилось разбираться во всем самостоятельно, что трудно, и не каждый на это решится.   ", "q0r": 5, "q1": "Указаны конкретные навыки и люди, которые будут выполнять работу. Я нашел их на сайте linked in, и они кажутся легальными, все полномочия и навыки соответствуют описанным в предложении. Показан четкий путь реализации предложения. Одним из замечаний является отсутствие ссылки на репозиторий github, упомянутый в предложении (куда будет помещен весь код). Это небольшое усилие, чтобы сделать пустой репо, но оно окупается. Бюджет можно было бы описать лучше. Есть некоторая разбивка по задачам, которые необходимо выполнить, но нет обоснования конкретных сумм. Я ожидал почасовую оплату за разработку, как в каждом другом предложении, потому что это имеет смысл. Немного странно указывать цену за разработку каким-либо другим способом, потому что трудно доказать, что одна функция может быть более или менее дорогой по сравнению с другой. Реалистичный график, безусловно, существует. Я не сомневаюсь, что авторы предложения справятся с текущим временным горизонтом. Я надеялся на какой-то технический документ о реализации, но это не большая проблема, если у них его нет. Хотя для таких гиков, как я, это было бы полезно.  Технические аспекты для меня немного туманны, и я был бы заинтересован в помощи, если бы знал, каков план. В этом прелесть открытого исходного кода. Авторы не упомянули о каких-либо ожидаемых рисках или проблемах, так что я думаю, что это либо очень просто, либо они не думали об этом.  ", "q1r": 4, "q2": "Отсутствует репозиторий на github или единое место, где можно следить за ходом проекта, но, справедливости ради, авторы упомянули, что собираются сделать репозиторий на github. Я не совсем понимаю, где они разместят свой github-репозиторий и как они сделают его доступным для сообщества после получения финансирования? Этих вопросов можно было бы избежать, просто указав в предложении ссылку на пустой github-репозиторий. Нет метрик и KPI, что несколько разочаровывает, учитывая тип предложения. Есть четкая дорожная карта и вехи для запланированного времени, так что здесь нет никаких проблем. Описание ясное и понятное для нетехнических людей, что тоже хорошо. Решение также хорошо написано.  Проект принесет большую пользу сообществу кардано, если будет выполнен с должным уровнем вовлеченности сообщества. Удачи!", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Availability of ready-made chain datasets will encourage ML researchers to develop insights and promote Publications on Cardano. This also has the potential to be out the superior technology of Cardano. The direct impact is debatable, and data updating will also be necessary. \r\nHowever, the data is currently available in PostgreSQL and is relatively comprehensive for meaningful research. The proposal will build a snapshot of the current state, and the proposers have not included details regarding will they maintain the dataset for a specified period. ", "q0r": 3, "q1": "The proposers are SPOs and have more than 15 years of software experience. The task is relatively simple and does not have significant risks. Therefore they should be able to do it. ", "q1r": 5, "q2": "The task analysis is fairly comprehensive and it requires the effort of two programmers with ML/Deep learning backgrounds for at least a month. The amount requested may be fair and comes to about USD 5000, which can be considered marginally higher. However, data science is a high-paying area and the talent required to satisfy community requests might justify the fund requested. More details on the baseline of the data source would have added clarity to the proposal. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 16, "ne": 5, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "The challenge asks for open source projects and they are going to develop a public data set for pools so, this will be very useful and is exactly open source for developers this addresses perfectly the challenge", "q0r": 5, "q1": "The plan is well detailed and divided into steps, for each one they have the budget needed so this shows that they have very well planned each part and what the development of this will suppose. About the team, they provide their names and explain their experience in the field so reading it conveys a good feeling that the project will be carried out", "q1r": 5, "q2": "They do not provide any information to audit the progress. The success is not measurable by any indicator provided so will be very difficult to audit the succes. There are not even performance indicator so I cannot give a good mark here.", "q2r": 2, "assessor": "z_assessor_547", "no_vca": 17, "ne": 0, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This project will develop an open-source code for generating an analytics dataset then showing off a full historical stake pool dataset for targets who wants to analyze it. This project will help to the development of a stake pool in Cardano more effectively, and means will help to grow the Cardano community a lot because the staking pool is one of the key development models in Cardano network. But the proposer should add some more info about key metrics to measure the project success. ", "q0r": 3, "q1": "The proposer shows a very detailed roadmap that clarifies all the work that has to do, even this project is very simple to compare to others. Hence, their budget is fit with the roadmap \r\nWith the experience of the team that the proposer show in the proposal, I think they can do it. ", "q1r": 5, "q2": "The proposer provides a detailed roadmap for auditing the development progress easily. But the proposer doesn't add some key metrics to help people know what success will be looked like when this project goes public. \r\nAbout the problem and solution, the proposer made a good detailed explanation about that. The proposer also listed some questions that help me understand why users need the solution of this project. \r\nLast but not least, I think the proposer should show some potential risks that this project can meet in the implementation plan, that will help them have some backup from problems. ", "q2r": 3, "assessor": "z_assessor_671", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "There is so much hidden valuable information stored in the Cardano blockchain and at the same time the open source developer ecosystem strongly needs contributions in the analytics domain.", "q0r": 5, "q1": "The experience and track record is present and strong. I see a small risk (what may not have to realize), when the plan includes 'collaboration with community on requirements' - is there enough resources planned for that? Currently the community only has to hope that the experienced team comes up with nice result, but the proposal does not present the actual plan in sufficient detail. ", "q1r": 4, "q2": "Would have been full score if there would have been some KPI or indication how many views or queries will be resulted. Six specific queries included in the proposal can be verified easily, but by themselves might not justify the 8 weeks.", "q2r": 4, "assessor": "z_assessor_685", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "Репозиторий кода с открытым исходным кодом для генерации аналитического набора данных из смеси цепочечных данных db-sync и внешних источников данных", "experience": "Основатели Cardano Canucks и Canuckz NFT с 30+ летним опытом работы в области инфраструктуры данных, анализа и визуализации для предприятий."}