{"id": 384606, "author": "dcspark", "title": "Cardano Omnibus - UTXO Management", "url": "https://cardano.ideascale.com/a/dtd/384606-48088", "category": 26251, "amount": 40000, "description": "Управление UTXO кошельками, dApps и биржами осуществляется неоптимально, что приводит к простоям, увеличению сборов и ухудшает пользовательский опыт.", "funded": 2, "upvotes": 177658020, "downvotes": 22593115, "votes_result": 155064905, "votes_cast": 479, "f6_no_assessments": 2, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The first sentence of this challenge states that this challenges aims too support the development of common tools needed for projects to make use of the cardano blockchain. There's been some back and forth beneath the proposal about whether writing input selection algorithms inside the Rust SDK for Cardano represents a contribution to the Open Source Developer Ecosystem challenge. However, as the proposers state they intend to contribute the input selection algorithms so that all projects implementing Cardano have access to state-of-the-art UTXO Management - it is clearly an open source contribution that developers will benefit from. Cardano's ecosystem has changed radically since the arrival of NFTs and the existence of multiple assets in wallets is becoming a new source of strain for the power user. Clearly all existing and future wallet developers and DApp developers who intend to integrate their solutions into wallets will benefit from this input selection algorithm research and development - which if developed will undeniably be another important tool in the available toolbox for developers. The fact that the team intends to contribute to the CIP discussion about input selections and properly document how it got to the final solution(s) will be another step towards decentralizing research in this critical area for wallet operations. The team has explained how they will add value to the Cardano ecosystem, however they have missed an opportunity to include a hyperlink to the dcSpark Fund 7 Catalyst video on Youtube in which they explain the details of their proposals: https://www.youtube.com/watch?v=nSB-nSWvCaw). If you are reading this guys, don't make that mistake in Fund 8. Including the hyperlink works in your favour. \r\n", "q0r": 5, "q1": "dCSpark has a really good team of developers, researchers and all-around Cardano enthusiasts that I am always surprised how they fail to include their detailed biographies (or links to their Linkedin profiles or at least to the dcSpark website [https://dcspark.io/]. If I was your \"competitor\" for Catalyst funding in the same challenge, I would certainly \"advise you\" not to include your website and a short background about the team as my chances would be diminished. Lightness aside, it seems that it is up to me as a CA to talk up the team as they haven't done it themselves in the proposal. Yes, the proposer has - as they stated - years of experience writing wallets for Cardano and also created the Rust SDK for Cardano which contains a few algorithms they wrote. The team's core competencies are stellar and although the budget is not outlined clearly and broken down into identifiable items - the nature of the work dicatates much of this. The proposal does seem reasonable to achieve the set goals, however it would have been better to have spent 20 more minutes in the proposal detailing why a $40,000 lump sum is the right sum for this - instead of $25,000 or $65,000. Yes, it may be a pain in the neck to spend time on trivial matters such as budget breakdown... but if other teams can do it and make it easy for the CA to focus on the crux of the proposal, so can dcSpark. CAs have a list of criteria that they use to grade proposals and  whenever a proposer fails to include a budget breakdown, it seems like the proposal was a bit rushed. This is a unique type of proposal with research, so the team's openess admitting that \"this is an open R&D problem - it is hard to predict how long it will take\" is admirable. What could have been added is - something along the lines - we plan to give periodic updates (monthly?) on how the work is going. Although the team did state that it \"believes it can complete this in the first half of 2022\". This sentence could have been turned into a more detailed exposition about what are expected problems and hurdles and what hapens if the H1 2022 deadline is broken. ", "q1r": 5, "q2": "As a CA, we are guided by instructions. Ideascale does instruct us to score Clarity/Auditability with a brief guideance stating: \"The information provided is sufficient to audit the progress and the success of the proposal.\" To me the clarity in this proposal is comendable, as the team knows and demonstrates that it knows what it is pursuing and what it wants to deliver. Yes, it is not a simple DApp, it is more elusive as it is a product of research, yet it is still specific enough and has been done before for Byron. The team could have done better by including a roadmap with milestones (milestones - at least some occasional updates on ongoing work - which would allow an outside Catalyst \"auditor\" able to do his auditing job) - while a time horizon for achievement has been included. Apart from that, the team plans to write input selection algorithms inside the Rust SDK for Cardano - I would like to know how will they know and measure their success? The proposal states that  many wallets implement \"their own ad-hoc solutions\" - why will this dCSpark solution be better or best? The team proposes to \"explore solutions on how to continuously reorganise UTxO into sizable chunks to provide an easier and more optimized transaction system\" - easier than the current system I presume. How many solutions can we expect (one or multiple) and how will they (the team) measure their own success in terms of the solving the Problem Statement. Effectively - when is a solution no longer \"sub-optimal\" for wallets, dApps & exchanges - do you have some quality thresholds that will determine whether your solution is the best possible?", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 18, "ne": 9, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposers want to research and develop and algorythm/s for better management of UTXO transaction in the already existing Rust SDK. There's a clear challenge identified and an unknown path to the solution. These breave pioneers want to dive into the deep so all can benifit as this is a growing problem in the dev ecosystem. It's clear that if successfull, the proposal would bring huge benefits for all dapps / exchanges and wallets of any kind. Key metrics could be better, aligning with the challenge setting, because the deliverables are not quite clear. Future challenges will be adressed by this capable team, doing things slow and steady as software goes. The proposal is missing a clear definition of success as mentioned in the comments. Despite some comments, I think the proposal fits the challenge setting, because even if the research is nott fruitfull it will bring greater understanding to the problem and it will be documented and left for someone to build on top of. Where not to go and what not to do are also real and valuable contributions. As a developer myself, I would have liked a clearer way to see what the proposers will be doing like a link to a discord channel with discussions or something of the sort. ", "q0r": 5, "q1": "Proposers and their skills are valid as I've found them on linked in and a couple of written blog posts which give me confidence. A clear team with a clear task to do is a great start of this journey. A budget is stated but there is no breakdown of it or any explanation of what exactly they plan to do with the money. This may be because the \"Detailed plan\" section of their proposal cuts off, so i have no way of knowing if that's an honest mistake or an explanation is missing. The timetable is just mentioned as the \"the first half of 2022\" and a definition of success is missing as mentioned which is a shame. An implementation plan can be extracted from the provided resources and what the expected deliverables would look like, but none was provided in the proposal itself.  The proposal clearly explains the technical questions posed to validate the work planned and it's very detailed. Authors understand there might be challenges with the algorythm implementaion and accept that there might not be a concrete deliverable, but more like a process that is supposed to bring forth a solution down the road which is the right state of mind in my oppinion as a developer, because all complicated problems need time for contemplation. Better to be slower but with verifiable work than fast and fail even faster. This is the cardano way.  I wish the best of luck to the proposers and I believe they're on the right track, but can focus their efforts on the proposal text and requirements a bit more in the future. ", "q1r": 4, "q2": "Tracability would be hard. Doing research is not exactly as clearcut as writing code but it's much more difficult as well. Having said that, there are solutions for including the community in your efforts like haveing an online group or discussion or discord channel or repository. No KPIs to speak of, but I'd suggest for the authors to add some for the next round because more metrics means more possiblities for optimization, which they're in the business of. The roadmap and milestoes as well as the time horizon for the project could have been better defined.  The problem is clear and the plan for it's solution is solid. A suggestion for the proposers: put yourselves in a voters shoes that do not understand what you're trying to do and read your proposal again with this state of mind. ", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 18, "ne": 9, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Написать алгоритмы выбора входных данных в Rust SDK для Cardano, чтобы все проекты, реализующие Cardano, имели доступ к самым современным алгоритмам.", "experience": "Мы имеем многолетний опыт написания кошельков для Cardano, а также создали Rust SDK для Cardano, который содержит несколько алгоритмов, написанных нами"}