{"id": 385056, "author": "titan", "title": "Transaction Editor & wallet", "url": "https://cardano.ideascale.com/a/dtd/385056-48088", "category": 26251, "amount": 16400, "description": "Cardano CLI слишком громоздкий для использования в больших и сложных транзакциях", "funded": 2, "upvotes": 142629562, "downvotes": 9374330, "votes_result": 133255232, "votes_cast": 664, "f6_no_assessments": 4, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Вау... просто вау! Автор предложения хочет представить редактор транзакций, более удобный для использования, чтобы заменить cardano CLI (интерфейс командной строки). Как разработчик, я могу отнестись к проблеме, описанной в предложении, и убедиться, что оно отвечает поставленной задаче. Четко сформулировано, как это принесет пользу и вызовет радость у разработчиков в экосистеме cardano, включая меня! Ключевые метрики актуальны, и очевидно, что автор предложения вложил много мыслей в само предложение, не меньше, чем в сам инструмент. Конечно, будут трудности, но я не сомневаюсь, учитывая опыт авторов и управление временем, что трудности будут решены без проблем! В этом предложении нет абсолютно ничего недостающего, что редкость. Этот проект добавит нечто недостающее в экосистеме: простой способ работы с транзакциями без необходимости мучиться. С моей стороны нет никаких опасений. Этот проект окажет большое влияние на сообщество, если его профинансируют, и я призываю людей голосовать за него, так как я буду голосовать!", "q0r": 5, "q1": "В нем перечислено столько полномочий и навыков, что мне потребовалось время, чтобы прочитать и проверить их все. Этот парень - доктор наук в области теоретической физики, разрабатывающий моделирование систем коррелированных электронов (микрофон). Есть четкий план выполнения, и он знает работу, которую нужно сделать, а также время и процесс ее выполнения. Бюджет ясен и разбит достаточно хорошо, чтобы быть разумным для достижения поставленных целей, которых много и они амбициозны. Есть реалистичный график завершения работы, но я задаюсь вопросом, не будет ли команда более полезной, но я, безусловно, уважаю человека, который хочет создать инструмент в надлежащей манере, и наличие членов команды не всегда является подходящим способом (по крайней мере, в начале). Дается подробное объяснение не только \"что\", но и \"как\", что бывает редко и должно быть оценено по достоинству. Понятны ресурсы, необходимые для развития проекта. Технические аспекты, такие как выбранный редактор и функциональные возможности, уже существующие и планируемые в будущем, описаны и осмыслены как этапы. Автор предложения рассмотрел проблемы и риски, связанные с успешной реализацией, и, кроме того, проанализировал влияние этих решений. Проект синхронизирован с тем, что уже было сделано, и это будет строительным блоком в будущем, я верю. Абсолютно звездная работа предложения! Удачи! Я надеюсь, что вы получите финансирование! Я буду голосовать за вас!", "q1r": 5, "q2": "Говоря об отслеживаемости, автор уже имеет очень конкретный график и план по привлечению бета-тестеров из сообщества для помощи в работе, а также планы по документированию и информированию сообщества о возможностях, которые становятся доступными. Я не вижу никаких проблем в том, чтобы дать людям знать о том, что делается и разрабатывается. Метрики и KPI также находятся на одном уровне с остальной частью предложения, что редко встречается во многих других предложениях. Дорожная карта с этапами и всеми \"колокольчиками и свистками\", а также временная таблица, в которой учтены трудности и предусмотрены резервы для них. Ясная и понятная проблема и соответствующие решения присутствуют и хорошо написаны, хотя иногда немного техничны. Решение на 100% является решением для борьбы обычного повседневного инженера-программиста.  Удачи!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 18, "ne": 10, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Currently the tools available for developing an app on Cardano (on low level) is still far from perfect. Using cardano-cli would still make developer struggle and have trouble, as what the proposer mentioned that there are a lot of people asking and looking for answers on Discord and Cardano forum. This proposal would build a tool to make it easier to use cardano-cli in a declarative way, means you declare what you want and the tool will handle the command for you. E.g for creating wallet, looking UTxOs addresses, balance, etc. By having this tool, it will greatly help the developer community building on Cardano, and further attract more developer to not get intimidated into getting started.", "q0r": 5, "q1": "Oscar (the proposer) have proven the experience in building these various tool, from the growing open-source Scientific Python Project until it became the open standard, to having a Ph.D. in Theoretical Physics developing simulations for correlated electrons systems. Looking at the Github repo, it has a comprehensive documentation, with already working feature such as: token mints, metadata, delegation certificates, unlocking of Plutus Smart contracts. Although, it would be better if Oscar could provide his Linkedin too for further verification. Reading through this proposal, Oscar could articulate clearly on what the problem, how he came up with the solution, and how to implement that solution with working example already provided. The 10-week action plan he provide is clearly described in details, and shows what to achieve on every week. Overall, this proposal have a high chance of success, considering the amount of experience he had. ", "q1r": 5, "q2": "The roadmap, the goals / achievements, and metrics/KPIs is very well defined in details (10-week plan). It is highly auditable considering this is an open project and we can track the progress through Github commit. The proposer have a clear understandable description of the targeted problem, and also able to articulate the solution in details, i.e using Emacs and specify why he choose it, why it would help developer community in Cardano, etc. ", "q2r": 5, "assessor": "z_assessor_640", "no_vca": 21, "ne": 10, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "The team pointed out the dead point of user experience and made a great way to fix it. This idea will save a lot of time and advance the risk when performing transactions in the node. In addition, the team also has detailed content to explain how it impacts and the target. \r\nMoreover, the KPIs are promising for people in Cardano communities. ", "q0r": 5, "q1": "The team has experienced how to perform their plan well, moreover, they did it since fund 6 and there is a video to visualize how this idea happen. The team also provides full of content to explain what they gonna do from point of view of users, and also with the technical explanation. Everything is clear and easy to understand. Moreover, there are many attached links in the proposal that can show how great this team did for the Cardano ecosystem. ", "q1r": 5, "q2": "They have a detailed roadmap in weeks and good KPIs for easily auditing their progress. \r\nThey also have a good explanation about the problem, and that's why their solution can address the problem very well.", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 21, "ne": 2, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "A high level, declarative, transaction editor that fully integrates with your wallet, cardano-node and your text editor will be a helpful tool since it solve the problem of the cardano CLI. ", "q0r": 5, "q1": "He's a skillful developer with relevant experience and he explain very well what he plan to do. All information is very transparent: the time he will spend on the project, a detail timeline and KPI etc. Moreover he also demonstrates what the expect outcome will be with examples. ", "q1r": 5, "q2": "The metrics to audit the progress is well-thought. We can easily track the progress of the project because he's very transparent and the timeline is in detail plan.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}], "solution": "Высокоуровневый, декларативный редактор транзакций, который полностью интегрируется с вашим кошельком, кардано-нодой и текстовым редактором.", "experience": "Рабочий прототип для транзакций, с чеканкой токенов и разблокировкой скриптов Plutus. Призер конкурса Plutus Pioneer Capstone."}