{"id": 381136, "author": "mark", "title": "Trust Funds by Ada", "url": "https://cardano.ideascale.com/a/dtd/381136-48088", "category": 26250, "amount": 10000, "description": "La création d'un trust est coûteuse et compliquée. Au fur et à mesure que la richesse est créée dans l'écosystème blockchain, les gens auront besoin de moyens pour la partager et la gérer.", "funded": 0, "upvotes": 15393595, "downvotes": 20882981, "votes_result": 5489386, "votes_cast": 92, "f6_no_assessments": 4, "f6_rating": 2.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "La création d'une confiance communautaire par le biais d'un contrat intelligent semble être une très bonne application des ressources pour ce défi et convient très bien, d'autant plus qu'il s'agit d'un contrat intelligent (mini proposition) construit sur la blockchain Cardano avec un budget global qui correspond au défi. Le proposant déclare qu'il veut poursuivre le développement de blocs de construction de contrats intelligents réutilisables - c'est une excellente vision pour créer de la valeur et pour la mise à l'échelle. Je voudrais féliciter le proposant pour sa vision de fournir un contrat intelligent de confiance plus global qui peut être paramétré par n'importe quel utilisateur à l'avance, de plus il a pensé à l'inclusion importante de permettre aux fonds dans la confiance d'être mis en jeu. De plus, l'idée de le rendre open-sourcé est un ajout encore plus précieux à l'écosystème Cardano. Il ne s'agit pas seulement d'une proposition de contrat intelligent, puisque notre pionnier Plutus souhaite également inclure une facette éducative en proposant des sessions de codage en direct et en le construisant en public. Je félicite l'auteur de la proposition d'avoir inclus une vision future sous la forme de travaux futurs, ce qui indique que la proposition actuelle pourrait évoluer vers une contribution beaucoup plus importante, en particulier avec le support proposé pour d'autres jetons que Ada et l'utilisation d'oracles.", "q0r": 5, "q1": "L'une des faiblesses de cette proposition en termes de faisabilité - d'une manière générale - est que la proposition, telle qu'elle se présente actuellement, semble se situer dans un no man's land entre un projet avancé de proposition de mise en œuvre et un véritable plan de mise en œuvre. En l'état actuel, la proposition ne comporte pas de délais, de ventilation budgétaire avec des postes clairs et des liens spécifiques vérifiables qui prouvent les déclarations du proposant sur son expertise en matière de logiciels. Le proposant déclare qu'il a participé (qu'en est-il de l'achèvement ?) à la première cohorte de pionniers Plutus. Je dis cela - car j'ai été accepté dans la première cohorte Plutus pioneer (mais je n'ai pas eu le temps de la terminer). Une chose qui a attiré mon attention est que cette proposition semble avoir été soumise précédemment dans des fonds antérieurs (https://cardano.ideascale.com/a/dtd/Trust-Funds-by-Ada/366848-48088) comme étant essentiellement la même proposition, mais elle avait alors un arc de développement de 6 mois et un budget de 25000 USD. La proposition précédente (dont le financement n'a probablement pas été approuvé) comportait une ventilation du budget et un calendrier. Cependant, cette proposition du Fonds 7 qui est maintenant soumise au vote n'a pas de ventilation du budget ni de calendrier du projet. Cela pourrait donc être facilement amélioré dans un futur fonds. Je ne suis pas sûr que le proposant ait suffisamment abordé les défis et les risques, d'autant plus que cette proposition ne semble pas s'être améliorée (en incluant plus de détails ou plus d'explications - ou en général en progressant vers un plan de mise en œuvre plus spécifique) depuis le fonds précédent où son financement n'a pas été approuvé. Le proposant a demandé une somme forfaitaire de 10 000 $, mais dans la rubrique budgétaire de la proposition, aucune ventilation n'a été fournie. Il est simplement indiqué : \"Budget tbd\" [à déterminer].", "q1r": 3, "q2": "Il aurait été bon d'inclure un calendrier, d'autant plus que les propositions du défi sont censées être réalisées dans un délai de trois mois. L'inclusion de quelques jalons et d'un plan de mise en œuvre aurait permis de faciliter l'auditabilité de cette proposition. La proposition précédente - presque identique (mais avec plus de contenu) d'août 2021 a eu beaucoup d'interaction et de commentaires sur Ideascale. Si cette proposition ne passe pas cette fois-ci, je conseillerais au proposant d'inclure une pièce jointe dans le prochain fonds qui comprend les questions des conseillers communautaires et ses réponses. En fait, il serait préférable d'établir un plan de travail hebdomadaire ou bihebdomadaire pour une proposition de cette envergure, afin de pouvoir vérifier les progrès réalisés. Même une présentation vidéo pourrait aider à donner vie à votre vision. Par exemple, l'idée de construire le contrat intelligent en public, avec des sessions de codage en direct et des heures de bureau pour discuter de l'orientation, sera beaucoup plus efficace si elle est étoffée. Sur quelles plateformes sera-t-elle diffusée ? À quelle fréquence ? Certains indicateurs clés de performance seraient plus qu'utiles. Nombre de fonds fiduciaires mis en place avec le contrat intelligent au cours des 3, 6 et 12 premiers mois ? Nombre de spectateurs des sessions en ligne diffusées en direct ? Ou d'autres indicateurs clés de performance que le proposant juge pertinents. Enfin, un mot d'encouragement : cette proposition semble être sur le point d'être acceptée par les électeurs, elle a juste besoin de quelques heures supplémentaires pour être affinée en un plan d'action précis avec un calendrier, des mesures et des indicateurs clés de performance. Ajoutez l'expérience vérifiable, ajoutez la ventilation du budget et soumettez à nouveau la proposition si elle n'est pas retenue par le Fonds 7.\n", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 28, "ne": 20, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "Trust funds for ADA is a great idea, however, in my opinion, the proposal does not address the challenge because the proposal does not clearly show a path to an end product useable by end users with in 90days. I would advise the team to create a detailed roadmap to show path to success in 90 days\r\n", "q0r": 1, "q1": "The leader of the team describes a good work experience but I would like to see links to LinkedIn or a github repository for validation. I would like to see the plan to success be expanded by building a detailed roadmap with milestones.", "q1r": 2, "q2": "I would like to see the team develop a simple 3month roadmap with milestones to connect the funds expenditure with the goals of the proposal. Furthermore, the I would like to see the budget broken down beyond a single line entry. I would like the team to develop KPI's to help track performance, example execute 10 test contracts by week 8", "q2r": 1, "assessor": "z_assessor_358", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "A template for a smart contract enforced Trust fund with mission is a novel idea. The idea needs review and a better execution plan. There is a substantial use case for this kind of model to enable contribution to the Trust which behaves in a codified manner. ", "q0r": 4, "q1": "The proposer claims sufficient experience as a Software developer and has taken on a full-time role in the Cardano ecosystem. References to his past work would have added value to the proposal. Moreover, there are critical details that are yet to be decided by the proposer. This casts some doubt on the implementability of the proposal. ", "q1r": 3, "q2": "The code is to be in an open domain however what to be built has not been laid down except the guidance to build a Trust powered by a smart contract. The requested fund can be assumed to be the compensation for the developer's time. Any clarity on these items would have made the proposal auditable. ", "q2r": 3, "assessor": "z_assessor_46", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "Sound like a great begining of an idea and very important area. Missing some more detailed explanations about the problem and the solution. The proposal is not detailed enough to be fully evaluated - please check the CA guide to see based on what CAs are evaluating the rporposals. https://cardanocataly.st/en/community-advisor/guide.html\n", "q0r": 2, "q1": "The Proposer seems to have the right profile and experience for the project, however more information about projects or Linkedin profile will be important. It will be great to have such a proposer be part of the community and succeed but again more info is needed in the proposal re the roadmap, deliverables KPI and budget. One suggestion is to connect with other catalyst community members and work together for next fund. ", "q1r": 3, "q2": "With missing information re deliverables and KPI and timeline it will be difficult to audit the proposal. There are good success list factors as well as having it in open source will help auditability. ", "q2r": 3, "assessor": "z_assessor_636", "no_vca": 20, "ne": 1, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "Un contrat intelligent qui met en œuvre un trust financier sur le réseau Cardano qui délègue et distribue vos jetons comme vous le décrivez.", "experience": "Participant de la cohorte 1 des pionniers de Plutus. Ingénieur logiciel depuis 8 ans."}