{"id": 381036, "author": "joshf", "title": "DeFi and Microlending for Africa", "url": "https://cardano.ideascale.com/a/dtd/381036-48088", "category": 26257, "amount": 180000, "description": "Как мы можем обеспечить создание решений в области микрокредитования, платежей и DeFi dApp, которые подходят для африканских условий?", "funded": 1, "upvotes": 52560131, "downvotes": 15848600, "votes_result": 36711531, "votes_cast": 273, "f6_no_assessments": 4, "f6_rating": 3.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "There's has already been a number of challenges dedicated to Africa in fund 5 and 6, so i don't agree that this Challenge is critical to Cardano missions. The many good proposals that have been funded in these  previous Africa dedicated rounds can now easily compete within more targeted challenges such \"Boosting Cardano's DeFi\"", "q0r": 2, "q1": "Many proposals were submitted in Fund 6 of this challenge with a number of these funded, so the community has already demonstrated that they can address this challenge ", "q1r": 5, "q2": "The proposed metrics are relevant and measurable. Given this is a second iteration of this challenge perhaps an update to these metrics is warranted e.g. Number of projects implemented and live ", "q2r": 4, "assessor": "z_assessor_125", "no_vca": 24, "ne": 1, "ng": 15, "nfo": 8, "vca_o": 1}, {"q0": "The challenge aligns with multiple of the Fund 8 strategic goals including \"Prepare a group of people willing and able to make contributions to the ecosystem\" and \"Accelerate the growth and evolution of developer & app ecosystem.\"", "q0r": 5, "q1": "There is significant interest and skills in the challenge area although there are several overlapping challenges. The budget is moderate and there were $322,949 in proposal funds requested in Fund 6 so there is clear demand for the $180,000 budget.", "q1r": 5, "q2": "The success criteria clearly addresses the challenge and the metrics are excellent for measuring progress.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 19, "ne": 4, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "I believe strongly that Africa has ample categories already for itself. It has a strong team and support and gets funding in every challenge. It already has challenge categories dedicated to Africa. It doesnt need another one. SOuth Asia needs many", "q0r": 1, "q1": "I do not think this needs a separate budget as Africa already has its own category. ", "q1r": 1, "q2": "Though Metrics have been provided I strongly disagree that a separate challenge needs to be done for Defi solutions for Africa. If this trend continues it will drill down into hundreds of categories exclusively for Africa which is counterproductive to equality and democracy which Cardano Community stands for ", "q2r": 1, "assessor": "z_assessor_460", "no_vca": 22, "ne": 0, "ng": 13, "nfo": 9, "vca_o": 1}, {"q0": "The  challenge setting is specifically targeting defi and microlending in Africa. However interesting this idea is, there is a Grow Africa, Grow Cardano Category in catalyst that is suppose to cater for this great idea. Therefore there is no need to reinvent the wheel.", "q0r": 2, "q1": "Cardano community has the required level of skill, capacity and experience to provide probable solutions to the objectives of the challenge.", "q1r": 4, "q2": "There is more than enough measures proposed to adequately assess and verify the progress of this challenge if approved.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}], "importance": "Микрозаймы и приложения DeFi dApps, ориентированные специально на африканский контекст и основанные на исторических культурных нормах, ускорят принятие пользователями.", "success": "Не менее 5 жизнеспособных проектов с планами реализации решений DeFi dApps, микроплатежей и микрокредитования в Африке."}