{"id": 381329, "author": "felixweber", "title": "Gamers On - Chained", "url": "https://cardano.ideascale.com/a/dtd/381329-48088", "category": 26257, "amount": 500000, "description": "Какие игровые приложения Blockchain следует разработать для достижения массового принятия Cardano?", "funded": 2, "upvotes": 116367465, "downvotes": 8607869, "votes_result": 107759596, "votes_cast": 446, "f6_no_assessments": 5, "f6_rating": 4.466666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Я считаю себя компетентным для оценки этого предложения, так как я активно участвую в проекте Catalyst с 4-го фонда и имею опыт анализа бизнес-требований, полученный за более чем 5 лет работы по поставке программных решений для малого бизнеса и корпораций.\r\nВопрос задачи четко сформулирован и, на мой взгляд, прост для понимания. Задача состоит в том, чтобы выяснить, как использовать игры для развития экосистемы.\r\nПочему это важно, тоже легко понять, хотя я думаю, что задача звучала бы более убедительно, если бы здесь упоминалось, о каких огромных цифрах (2,5+ миллиарда) идет речь, когда мы говорим о геймерах.\r\nОпять же, я думаю, что из того, как было сформулировано понятие \"успех\", ясно, что для этого вызова это означает, что разработчики используют средства Project Catalyst для создания инструментов и игр на Cardano, а затем геймеры приходят играть в игры и исследовать остальное пространство.\r\nЯ думаю, что Феликс добавил очень полный список ключевых показателей для измерения, я не могу придумать, что еще я могу добавить к этому.\r\nЯ действительно считаю, что из-за целевой аудитории этой задачи и того факта, что я считаю игры одной из самых важных форм не только отдыха, но и способа обучения людей в будущем, эта задача очень важна для достижения миссии Cardano.", "q0r": 5, "q1": "Я думаю, что цели этого вызова вполне выполнимы. Мы хотим увидеть инструменты, игры, турниры, предложения с, возможно, еще более революционными идеями и т.д. Все это будет довольно просто проверить с помощью профинансированных предложений, как только дело пойдет. Здесь также очень просто измерить уровень вовлеченности сообщества. В Фонде 7 Gamers On-Chained была одной из задач с наибольшим количеством предложений. Каждую среду в нашей комнате отдыха после мэрии люди обсуждали свои предложения и с энтузиазмом обсуждали, что можно сделать для развития этого пространства. Увеличение бюджета с 250 тысяч до 500 тысяч - тоже очень хорошая идея, на мой взгляд, так как разработка игр стоит очень дорого. Многим было трудно разбить свои предложения на части, чтобы они не превышали $50k. Нам нужно приличное количество средств, чтобы иметь возможность запустить снежный ком. Подводя итог, я полностью согласен с тем, что у сообщества есть потенциал для решения этой задачи.", "q1r": 5, "q2": "Как уже говорилось ранее, я думаю, что критерии успеха для этой задачи очень четкие, и поэтому их легко проверить. Как только заявки получат финансирование, можно будет легко увидеть, как проекты обретают форму через их github, youtube-каналы, twitter-аккаунты, продажи NFT, веб-сайты и т.д. На мой взгляд, это тот тип проекта, который потребует немного времени для получения результатов, но как только это произойдет, шлюзы откроются, и всем станет ясно, какой потенциал есть в играх с использованием технологии блокчейн.", "q2r": 5, "assessor": "z_assessor_546", "no_vca": 17, "ne": 11, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis proposal aims to grow the adoption of Cardano amongst gamers - a big segment of potential users, which is inline with the cardano's mission and supports Fund 8 strategic goals of growing the app ecosystem.\r\n\r\nAt the same time, the proposal does not explain why accessing these users through games is easiear than through other use cases. The porposal would be stronger if answered the following questions:\r\n1) Which distinctive advantages cardano-based games will have vs other games? What are the benefits for game developers?\r\n2) Which advantages gamers as a segment have for Cardano? Why it's a high ROI? For example, compared to the financial service the regulatory environment is much simpler.\r\n\r\nOverall, this can be a valuable challenge for the ecosystem, but without further clarification, it is not clear why it cannot be done as part of broader DApps & Integrations or Developer Ecosystem challenges, or even regional growth challenges.\r\n\r\nI have made the following deductions:\r\n- 1 point because this initiaitve supports only one of three strategic goals of Fund 8.\r\n- 1 point for the lack of a clear analysis of alternative approaches to prove that focus on this user segment can bring high ROI to the community.\r\nMy rating is 3.", "q0r": 3, "q1": "While it definitely possible to use blockchain technology in Games and create some SDKs or gaming applications, out of my experience as a product manager, it is equally important to understand if there is demand from the gaming industry and unique benefits to gamers.\r\n\r\nThe proposal would be stronger if it provided an analysis of the demand for blockchain solutions among gaming companies and gamers to prove that a noticeable progress can be made from the funds requested.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of demand analysis.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposed metrics, such as (the number of users, apps, etc.) do allow to track progress of the initiative.\r\n\r\nAt the same time, the proposal would be stronger if it considered the following aspects as well:\r\n1) the % of users brought to Cardano through projects within this initiative.\r\n2) developer and user satisfaction in comparison with alternative ecosystems.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user and developer satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.\r\n", "q2r": 4, "assessor": "z_assessor_1011", "no_vca": 27, "ne": 6, "ng": 15, "nfo": 6, "vca_o": 1}, {"q0": "The challenge accelerates the growth of the app ecosystem and brings gamers together to contribute to the Cardano ecosystem therefore it strongly aligns with the Cardano mission.", "q0r": 5, "q1": "The challenge already exists in fund 7 and had 57 assessed proposals indicating solid interest. The budget request doubled directly in relation to the doubling of the total budget. The budget request is moderate given that there is no real overlapping challenges.", "q1r": 5, "q2": "Progress towards addressing the challenge can be measured using the key metrics provided. To make the challenge excellent: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 20, "ne": 1, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "This challenge definetely has the potential to provide interesting usecase for the Cardano ecosystem. It might give it some traction and create some creative efforts to re-think blockchain. However bringing gaming onto Blockchain is not absolutely vital to Cardanos mission. The societal impact of gaming should not be too important.", "q0r": 4, "q1": "In my opinion the parts of the Cardano community has the capabilites to adress the challenge, but not all of them. While we saw some good proposals in this topic, we saw during the last round of this challenge that more people had trouble approaching the topic. The challenge has a credible challenge team and it is credible to achieve results in the set milestone times.", "q1r": 4, "q2": "The KPIs and metrics are set up well in order to provide the framework for good proposals.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This challenge is critical to achieving Cardano's mission, since Cardano's mission spans many areas of life, including the entertainment aspect. The game industry is growing day by day and there is a need for a blockchain with a good foundation so that gamers can work comfortably and record the fruits of their labor effectively in many ways.\r\nTherefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 5.", "q0r": 5, "q1": "Certainly, the Catalyst community has the capacity to address this challenge because of the following reasons: since the multi-asset function was enabled on the mainnet, NFTs are minted in an increasing number to serve a variety of purposes, including the development of games of various genres. In addition, the Gamers On -Chain challenge is now showing a warm welcome by the community. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5.", "q1r": 5, "q2": "Suggested directions and metrics are logical, specific, and measurable to measure progress in addressing this challenge. Therefore, based on the given information, I strongly agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 9, "nfo": 4, "vca_o": 1}], "importance": "Геймеры готовы к приходу в криптовалюту. Им просто нужен понятный блокчейн с приятными приложениями для игры.", "success": "Cardano становится самым популярным блокчейном для разработки игровых приложений благодаря качественному инструментарию и широкой пользовательской базе, ориентированной на геймеров."}