{"id": 382213, "author": "sofi.heessen", "title": "Open Source Development Ecosystem", "url": "https://cardano.ideascale.com/a/dtd/382213-48088", "category": 26257, "amount": 1200000, "description": "Как мы можем гарантировать, что экосистема Cardano построена на базе, которая принадлежит сообществу и одинаково доступна для всех?", "funded": 2, "upvotes": 174132281, "downvotes": 6229949, "votes_result": 167902332, "votes_cast": 863, "f6_no_assessments": 4, "f6_rating": 4.666666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis challenge directly supports all three strategic goals of Fund 8: grow the number of contributors, make cardano into an open-source project, grow the app and deve ecosystem.\r\n\r\nMoreover, because the challenge doesn't restrict the participants, it can have the maximum possible impact.\r\n\r\nBased on the above, I assigned the score of 5.\r\n\r\nSome advice: the challenge's guiding questions could be extended by looking for existing open source projects into which it makes sense to integrate cardano support. Establishing a successful open source projects takes a lot of time and effort. So, it's much easier to find people who are already experts in developing open source projects and incentivising them to learn more about cardano. Such investments, can lead to many new productive collaborations, bring new skilled professionals into the community, and be more efficient with regards to the funds use.", "q0r": 5, "q1": "Given the technological nature of Cardano, the community experienced with open-source projects, and the proposed budget size for the challenges, it's definitely possible to incentivize a number of teams to create new open-source projects and add support for Cardano into existing ones.\r\n\r\nAlso, a similar challenge has been already funded in Fund6, giving the community additional experiences to succeed.\r\n\r\nIn addition, the challenge team consists of multiple proposal, suggesting that sufficient advice and guidance can be given to participants.\r\n\r\nFor the above reasons, I give the score of 5.\r\n", "q1r": 5, "q2": "The proposed metrics can track the adoption (the number of projects, the number of contributers, etc.).\r\n\r\nHowever, the proposal also mentions the term quality without explicitly defining how the quality of projects will be measured. On one hand, it can be about the certification and verification of correctness. On the other hand, it can be about the adoption of those projects (Github stars, etc.)\r\n\r\nAlso, in my opinion, it's important to bring into Cardano ecosystem more developers experienced in developing open-source projects, so a more qualified metric can be helpful: the number of contributors who are contributors of open-source projects with more than 1000 (propose your number here) github stars.\r\n\r\nLast but not least, it is important to consider the developer satisfaction with the projects and their competitiveness with the alternatives.\r\n\r\nI have deducted points for the following reasons:\r\n- 1 point for incomplete and somewhat ambiguous definitions of metrics.\r\n- 1 points for not considering the developer satisfaction and the competitiveness of projects.\r\nSo, I set the score of 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 23, "ne": 8, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Open source encourages collaboration and innovation. Several of the technologies we take for granted today would not have developed without it or would be hidden behind patents. I believe there is a potential overlap with the \"Developer Ecosystem\" challenge, however, taking into account the strategic objectives of Fund 8, I strongly agree this challenge is critical to achieve Cardano's mission.\r\n", "q0r": 5, "q1": "On this occasion, it has been requested to increase the budget of this challenge from 200000 to 12000000, which makes sense to me considering the strategy the community and IOG is seeking. To me, it is clear that the community has delivered and is capable of continuing to deliver in accordance with what is sought in this fund.\r\n", "q1r": 5, "q2": "The success criteria and guiding questions are relevant, clear, and easy to comprehend; the metrics are related to the established success criteria, and the community could measure them with relative ease. I strongly agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 25, "ne": 3, "ng": 20, "nfo": 2, "vca_o": 1}, {"q0": "This challenge aligns with all three aspects of the Fund 8 Strategic Goals to achieve Cardano's mission!", "q0r": 5, "q1": "Excellent Complimentary Challenges explanation highlighting the differences and the budget reasoning between the three challenges. I concur with the argument that there is room for all 3 challenges which have unique approaches despite somewhat overlapping goals. The 6 times increase in funding request, despite only having 30 proposals being assessed in Fund 7, may be a capacity factor for some in the community. To make the challenge excellent: better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds). ", "q1r": 4, "q2": "The success criteria and metrics are adequate to measure progress. To make the challenge excellent: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 17, "ne": 3, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "The developer ecosystem whether open source or not is paramount to any computer based technology. It's what makes thing possible in the first place. The richer with solutions this ecosystem is the more projects and opportunities will exist in Cardano.\r\nThis challenge is therefore essential to our community. As a developer myself with more than 20 years of experience I can attest that the developer ecosystem of any language or technology is what will make the difference when choosing a framework or language over another to build something.\r\nThis challenge (with open source being encouraged instead of mandatory) has been there since the very first Catalyst fund and has been the most successful with many funded projects and also many projects being voted but not funded due to the sheer number of proposals being submitted within the challenge each fund. The more tooling we have the more likely things will get done in our Cardano ecosystem instead of somewhere else.\r\nThe open source version of the challenge is important because it fosters sharing and building as a community (just like GNU/Linux) and help to mutualise efforts instead of everyone reinventing the wheel in their closed corner...", "q0r": 5, "q1": "As demonstrated in the 6 previous funds, there is no doubt that our community has the resources to address this challenge given the hundreds or projects already funded in previous funds and all the projects that missed being funded due to exhaustion of funds...", "q1r": 5, "q2": "Verifying the number of open source project is probably the most easiest thing to do in the computer world. We have everything at hand using the open source development platforms such as GitHub where we can easily inspect each project and their impact (whether used or not, being worked on, by how many people, etc...).\r\n", "q2r": 5, "assessor": "z_assessor_40", "no_vca": 17, "ne": 5, "ng": 10, "nfo": 2, "vca_o": 1}], "importance": "Нам необходимо вырастить целую экосистему экспертов для создания и поддержания основ Cardano/Catalyst вместе с текущими командами IOG", "success": "Растущее число экспертов объединяет усилия для совместного создания инфраструктуры, инструментария, стандартов, библиотек и документации, принадлежащих сообществу."}