{"id": 384394, "author": "felixweber", "title": "Community Advisor Improvements", "url": "https://cardano.ideascale.com/a/dtd/384394-48088", "category": 26257, "amount": 100000, "description": "Общественные советники являются развивающейся ключевой ролью проекта \"Катализатор\", и им необходимо место и бюджет для представления предложений по улучшению их работы", "funded": 2, "upvotes": 80418825, "downvotes": 9867861, "votes_result": 70550964, "votes_cast": 290, "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis proposal influences all three strategic goals of Fund 8: grow the number of contributors, make Cardano an open-source project, and grow the dev and app ecosystem. The reason for that is that Project Catalyst is the key influencer of funding for all of the initiatives in the ecosystem. Without the ability to effectively organize and scale the work of community advisors, the Catalyst process can break. Moreover, with each fund Project Catalyst intends to onboard and integrate the more and more contributors. \r\nEven though that Catalyst scales rewards for the CA community proportional to the budget, the tools that CAs and VCAs use might not scale that well, creating a lot of frustration and inefficiencies.\r\n\r\nOut of my personal experience as a CA, the community needs better tools to support the process and scale it to the new highs.\r\n\r\nMy rating is 5.", "q0r": 5, "q1": "The Catalyst community has many talented developers, moreover the CA community is skilled to provide feedback and name the opportunities for improvement. Moreover, the CA community has already developed some of the tools improving the review process. All of the above makes the initiative feasible.\r\n\r\nAt the same time, the proposal would be stronger if it:\r\n1) provided an analysis of key pain points for the CA community.\r\n2) shared some recent success stories, to provide insights into the impact and the cost of development of new tools.\r\n3) explained why the requested budget of $100k is sufficient to fix all key pain points.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases requiring attention.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.\r\n\r\n", "q1r": 3, "q2": "The defined metrics (the number of tools, the number of proposals) can only track the activity related to the iniative, but they won't provide insights with regards to progress towards the underlying objective: making the Catalyst process more efficient and scalable.\r\n\r\nIt can be worth to consider some of the following metrics:\r\n1) the average time it takes to assess one proposal leveraging all available tools and best practices.\r\n2) the % of assessments rated as \"excellent\".\r\n3) capacity - the number of quality assessments that CA community can provide in one week.\r\n4) the satisfaction of the CA community with the existing tools.\r\n5) the satisfaction of the catalyst community with the CA work.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 22, "ne": 6, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "This challenge aligns with a Fund 8 challenge setting strategic goal and is critical to achieving Cardano's mission. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The (v)CA community has a backlog tools and change requests and there is already a team working on the tools so the Catalyst community can definitely address this challenge.", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 19, "ne": 2, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "This challenge is critical to achieving Cardano's mission, since human resources are required to upgrade this ecosystem to a higher level, therefore, full-time community members, especially Community Advisors in the context of the growth of proposal in each Catalyst fund, play a very important role in the phase of Governance. Therefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 5.", "q0r": 5, "q1": "Certainly, the Catalyst community has the capacity to address this challenge. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5.", "q1r": 5, "q2": "Suggested Potential Directions and metrics are logical and measurable to measure progress in addressing this challenge. Therefore, based on the given information, I strongly agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 17, "ne": 1, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "Interesting proposal, I share with you the problem. I believe that the proposal is within the objectives of the challenge, it is necessary to find a way for the CA to become an Auditor of the projects.", "q0r": 5, "q1": "It is feasible and if it materializes, it would be successful. But I believe that the Catalyst Circle must somehow become an independent organization. In this organization, CAs would work full or part time, auditing and assessing the progress of the different projects.", "q1r": 4, "q2": "The progress of the audits could be verified on the project website.\r\nGreetings", "q2r": 3, "assessor": "z_assessor_743", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "The increase in the number of Catalyst proposals makes it critical to keep a good quality and efficiency for community advisor activity, as their number may not grow accordingly. I strongly agree that this challenge is critical for Cardano's mission.", "q0r": 5, "q1": "This topics has received many good quality proposal in the past, and the Community Advisor Telegram channel is a place of creativity showing that the community does not lack ideas and talents. Challenge Direction give proposer a good point to start thinking. \r\nI strongly agree that the community has the capacity to effectively address the challenge.\r\n", "q1r": 5, "q2": "Number of ideas and new tools is a good metric for the challenge attractivity. I suggest to also include an assessment of the qualitative impact of developed tools, or usage. What about a specific vote from CA on tools, to assess quality of the proposals/projects ? ", "q2r": 4, "assessor": "z_assessor_78", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}], "importance": "Советники сообществ постоянно сталкиваются с проблемами, но не имеют возможности активно участвовать в разработке своей деятельности.", "success": "Советники Сообщества (СС) подают предложения как Команда для улучшения работы, деятельности и развития СС."}