{"id": 384548, "author": "dperlman", "title": "IO to the World: Cardano Unchained", "url": "https://cardano.ideascale.com/a/dtd/384548-48088", "category": 26257, "amount": 250000, "description": "Вся мощь Cardano будет раскрыта, когда она сможет всесторонне понимать активы и события в реальном мире и быть понятой ими.", "funded": 1, "upvotes": 54459009, "downvotes": 10380067, "votes_result": 44078942, "votes_cast": 207, "f6_no_assessments": 3, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis proposal aims to bring a set of new asset classes and information sources into Cardano, which can support the Fund8 objective of growing the app and dev ecosystem.\r\n\r\nAt the same time, the proposal does not describe why focusing on this particular area provides a higher ROI to the community than simply investing into projects in the broder challenges of DApps & Integrations or Dev Ecosystem.\r\n\r\nThe proposal would be stronger if it included and examples of recent success stories and a vision for high-value use cases in which Cardano is better positioned in the competition vs other blockchains.\r\n\r\nI have made the following deductions:\r\n- 1 point because this initiaitve supports only one of three strategic goals of Fund 8.\r\n- 1 point for the lack of a discusion about the relative size of the use cases and their importance for Cardano ecosystem.\r\n- 1 point for the lack of a clear analysis of alternative approaches to prove that focus on this segment can bring high ROI to the community.\r\nMy rating is 2.", "q0r": 2, "q1": "The Catalyst community is definitely well positioned to develop solutions for new use cases in the blockchain ecosystem.\r\n\r\nAt the same time, wihout a clearly defined  use cases, it is hard to speak about feasibility because the regulatory, technological and other potential roadblocks are not clear.\r\n\r\nMoreover, the requested budget of $250k seems low, given the seeming technological complexity of the area to achive a noticeable progress.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The defined metrics allow to track some progress (the number of oracles, the number of new assets, etc.).\r\n\r\nAt the same time, the defined metrics do not allow to track the impact of the initiative on the ecosystem. This proposal would be stronger if it considered some of the following metrics and ideas:\r\n1) the % of Cardano transaction volume related to assets or information sources created by this initiative.\r\n2) the % of global asset trade volume happening in Cardano.\r\n3) the developer and user satisfaction with the available assets/information sources vs that of competing ecosystems.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 22, "ne": 4, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "The challenge aligns with Fund 8 Strategic Goal of accelerate the growth and evolution of developer & app ecosystem. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The proposals in previous funds, that would fall under this challenge, that were approved but not funded is a strong indication that the challenge setting is needed and that the community has the capacity to address the challenge.", "q1r": 5, "q2": "The key metrics are conceptually fine however they should be worded as specifically measurable items.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This challenge would have a wide reach and impact as it connects cardano to the outside world through the developemnt of oracles and related technologies. This will allow cardono to connect to IOT devices bringing in valuable data and securing communications. Cardano is well suited to this as security and verifiablility is paramount.  This would bring in a lot of new developers and technologies that are waiting to connect there devices to the blockchain. ", "q0r": 5, "q1": "The catalyst community is well placed to address the challenge although some promotion might be needed to attract the desired developers. To encourage greater diversity of proposals the requested funding is capped at 25% or the total.  This also keeps the proposals achievable in a 6 month timeframe.", "q1r": 5, "q2": "Success can be measured by the increase in the number of quality oracles and IOT solutions available on Cardano.", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 14, "ne": 1, "ng": 8, "nfo": 5, "vca_o": 1}], "importance": "В прошлом появлялись многочисленные предложения в этой области. Многие из них получили высокие оценки, но не прошли из-за отсутствия средств.", "success": "Cardano получает больше оракулов, больше IOT и больше активов, токенизированных на цепи: недвижимость, товары, музыка, леса, углеродные кредиты, патенты..."}