{"id": 384846, "author": "reshm", "title": "Small businesses", "url": "https://cardano.ideascale.com/a/dtd/384846-48088", "category": 26257, "amount": 500000, "description": "Оказывать поддержку малым предприятиям по внедрению или развитию в Cardano с помощью средств и человеческих ресурсов.", "funded": 1, "upvotes": 56831403, "downvotes": 12092698, "votes_result": 44738705, "votes_cast": 264, "f6_no_assessments": 3, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis challenge aims to drive the adoption of Cardano among small business, which can support one of Fund 8 strategic goals - grow grow the app ecosystem.\r\n\r\nAt the same time, the proposal does not provide a clear rationale why constraining the focus just to small business can have a higher ROI for the community than when addressing those use cases within broader challenges, such as grow DApps and integrations, Developer Ecosystem, etc.\r\n\r\nI have made the following deductions:\r\n- 1 point for supporting only one out of three goals for Fund 8.\r\n- 1 point for the lack of description why constraining the use cases to small business can have a higher ROI for the community.\r\n- 1 point for the lack of specific use cases targeted by the initiative to prove the size of the impact that can be achieved.\r\nMy rating is 2.", "q0r": 2, "q1": "The proposal suggests just to allocate funding to solutions targeting small business. Which given the skills of Cardano communities and previous experience with building blockchain solutions is feasible.\r\n\r\nAt the same time, the proposal does not discuss specific use cases that can be targeted by the initiative, leaving the question of necessary skills and resources to deliver on the promises. For example, some business-related use cases could be too regulated and having too small impact for Cardano.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of clear vision for use cases.\r\n- 1 point for the lack of discussion of achievable impact given the funding.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposal suggests some metrics (the number of solutions, the number of market segments, the sentiment) than can help track some activity within the initiative.\r\n\r\nHowever, these metrics do not provide evaluation of delivered impact nor the user satisfaction and competitiveness of the created solutions. The proposal could be stronger by considering some of the following metrics:\r\n1) the % of users onboarded in Cardano through solutions developed within this initiative.\r\n2) the % of transaction volume created as a direct impact of the solutions in this initiative.\r\n3) the user satisfaction with the solutions in comparison to alternatives.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluting the impact on Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluting user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 23, "ne": 4, "ng": 9, "nfo": 10, "vca_o": 1}, {"q0": "Getting small businesses to develop solutions by using Cardano blockchain will drive massive adoption to Cardano. It should be easier for small businesses to adopt this technology as their business models aren't as complex as enterprises. It would create a healthy balance in the ecosystem and could help accelerate growth. Which in turn could be critical to achieve Cardano's mission.", "q0r": 5, "q1": "The Catalyst community is full of entrepreneurs so it is safe to say that the community has the capacity to address this challenge. If the 3 members that wrote this proposal dedicate themselves to this if it gets voted on then this challenge will be off to an excellent start.", "q1r": 5, "q2": "The success criteria are easy to measure as it is the amount of small businesses that develop solutions with Cardano. The key metrics uses the same measurements. The guidelines provided for proposals in this challenge is very impactful and also very easy to measure. All in all measuring the progress in addressing  this challenge will be easy.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 24, "ne": 3, "ng": 19, "nfo": 2, "vca_o": 1}, {"q0": "The challenge strongly correlates to getting people to make contributions to the ecosystem and accelerating the growth and evolution of applications.", "q0r": 5, "q1": "There have been a few challenges and proposals in past funds that have tried to integrate real world businesses with Cardano blockchain so there is some desire for this to happen. There are also more resources available in the community for starting new businesses and business coaching in general so the capacity to address the challenge exists. To improve challenge: better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds). ", "q1r": 4, "q2": "The success criteria and metrics are fine however there should probably be a metric concerning the number of geographical regions as well otherwise this could simply be another Grow \"Specific Region\" challenge. To improve challenge: better articulate how the metrics can measure progress towards the success criteria.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "importance": "Для процветания малого бизнеса часто требуется помощь в виде капитала, технической или деловой поддержки.", "success": "Большое количество малых предприятий, охватывающих все сектора рынка, разрабатывают решения с использованием блокчейна Cardano."}