{"id": 381276, "author": "sergio.sp", "title": "ALMAGUA CO2", "url": "https://cardano.ideascale.com/a/dtd/381276-48088", "category": 26246, "amount": 10000, "description": "В 2018 году глобальные выбросы достигли рекордных 33 143 млн тонн CO2, в Колумбии два года назад они достигли 74 954 килотонн.", "funded": 1, "upvotes": 26161553, "downvotes": 16627706, "votes_result": 9533847, "votes_cast": 104, "f6_no_assessments": 5, "f6_rating": 3.6, "videos": [], "media": [], "f6_assessments": [{"q0": "Unfortunately, the use of \"sustainable\" in the challenge title has caused confusion.  While decreasing carbon emissions for global sustainability is a worthwhile goal, that is not the focus of the \"Global Sustainable Indep. SPOs\" challenge.  This challenge is seeking to improve the economic model and operation of small SPOs so that the decentralization of Cardano transaction validation can be strengthened.  My recommendation is that the proposers target either a DAO, smart-contract, or energy conservation challenge for a future funding round. \r\n\r\nThe proposal does include establishment of a SPO which will plant a tree for each delegator; however, its not clear how establishment of one small pool will enhance the sustainability of independent SPOs more generally.", "q0r": 2, "q1": "The proposal includes a detailed description the team, project plan, and budget.  The project has a reasonable chance of being able to start a stake pool and follow through on planting of trees.  Additional details regarding the costs of planting and growing the planned trees would be helpful so that the long-term viability of the project could be assessed.", "q1r": 4, "q2": "The proposal is seeking to establish a Cardano node and utilize the fees to sponsor planting of trees.  The clarity and audibility of the proposal could be improved by including a goal for the number of delegators, the demographic of the delegators attracted to the project, the average size of the delegators, and how the expected returns compare with the costs for planting and growing trees. ", "q2r": 3, "assessor": "z_assessor_145", "no_vca": 19, "ne": 2, "ng": 17, "nfo": 0, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I have been able to collect a lot of experience on sustainability topics. And can hence competently evaluate sutainability criteria in proposals in this category. The proposal matches the challenge well and it is clear the proposer has properly read the challenge and has a good idea for participating in it's solution. Their proposal has the potential to add quite some value to the Cardano ecosystem.\r\nThe proposal articulates how it will add value to the Cardano ecosystem and the concrete challenge in an good manner.\r\nThe key metrics and goals of the proposal align with the outlined challenge settings.\r\nThe proposer makes a credible statement about scalability and it seams reasonable that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "The proposers provide sufficient verifiable information about themselves. A lot of information was added due to my request, which I really appreciate. Feedback: For future proposals, maybe consider telling us a bit more about the blockchain/cardano related work you have already done. The proposer provides a plan of implementation and defines the type and number of team members required to implement the proposal. The buget is fine-grained and seems rationable. The proposer has provided a plan for the case if they need additional funds, as some of the budget is planned in for this case, and as they seem to intend to pay for 60% of the project themselves (mismatch in outlined budget and requested funds), they seem liquid. Milestones are provided for the proposal.unfortunately, no risk analysis has been done for the project except for the accounting for uncertainities in the budget outline. \r\nIn its current form, the proposal provides sum plan that can be feasible if executed properly.", "q1r": 4, "q2": "Milestones are presented, however some og them could be more detailed and concrete, and the Metrics/KPIs are more implicit than structured explicitly. This makes the proposal mostly auditable, but some parts of it should still be improved. Feedback: Try breaking down your proposal into more detailed identifiable and auditable items that align a bit closer with the challenge kPIs, and you will be good.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 17, "ne": 5, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "This proposal seems very ambitious and has a lot of moving parts. I'm confused about some points such as if only one pool will be created or many. ", "q0r": 4, "q1": "The proposal is eloquent but somewhat confusing. It seems like too many moving parts to fit into one proposal. Team members are listed but I would appreciate more specific details of how they will contribute to the project. I think the proposal would be better broken into smaller parts over several funds. This way they could prove themselves and gain community support. ", "q1r": 2, "q2": "The project is broken into several stages which would be easier to audit if specific technical milestones and platform features were expressed in a more concrete/systematic way. I think there is a lot of room for interpretation in the given stages which may make auditing of ROI difficult. ", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 16, "ne": 0, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "The proposal aims to find a way to offset the CO2 emissions involved in the  creation of new tokens and nodes in the Cardano network by planting trees, as a first step in the development of a broader impact platform that directs SPO resources into the Almagua social projects of aquaponic, hydraulic and productive reforestation, so that it can provide benefits to society and that its impact is measurable via the implementation of a dedicated DAO with an outside party verification embedded in the overall system.", "q0r": 5, "q1": "As it is presented, the experience of the team does not appear convincing. There is no mean presented clearly for how to account for the CO2 offset by planting trees. The 12 month stages are presented very high level - more details are needed to explain what will actually be done in each of these \"The first stage will be development and the tests will be carried out during the first semester until June.\r\n\r\nThe second stage will be focused on the marketing and communication plan of the platform, with a duration of 3 campaign months from July to September\" - which lowers the level of confidence that the aimed deliverables will be achieved.", "q1r": 3, "q2": "There is no correlation between the budget requested and the \"stages\" and no clear deliverables are stated - which makes it impossible to audit this project for its success.", "q2r": 2, "assessor": "z_assessor_721", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The proposal at fist simply mentioned a broad problem, yet the solution is really interesting to creat a DAO for voting power at later stage of the Cardano roadmap. It would be tempted to see the integration at the VOLTAIRE roadmap of Cardano blockchain, this is promisingly at this stage to implement the pilot of the solution at this stage when Cardano has Smart Contract after Gougen.", "q0r": 4, "q1": "The team is very clearly coming from Colombia with a strong foundation in marketing/PR. The SPO and NFT part would be a question from the community. However, related to the NFT and the existing ALMAGUA CO2 Pool it proves the feasibility of the project. Also, the team consistently pursued the proposal from Fund6 to Fund7.", "q1r": 4, "q2": "The project is really auditable is a detail-described metrics and KPIs, A sync between project timing and budget release would be a great addition to see WHEN it will be fully implemented, regarding the fund that the team proposed.", "q2r": 5, "assessor": "z_assessor_782", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Создать DAO в сети Cardano с демократическим правом голоса для создания сертифицированных углеродно-нейтральных кредитов, таких как NFT.", "experience": "ALMAGUA была создана при поддержке Advanced Leadership Foundation.  \n2020 патент на солнечные лодки в колумбии\n2021 The Zayed"}