{"id": 383433, "author": "felixweber", "title": "Mission& Vision driven SPO Networks", "url": "https://cardano.ideascale.com/a/dtd/383433-48088", "category": 26246, "amount": 10500, "description": "Пулы, созданные для поддержки формирования сообщества и инфраструктуры Catalyst, недостаточно представлены в экосистеме.", "funded": 1, "upvotes": 32072743, "downvotes": 12978015, "votes_result": 19094728, "votes_cast": 157, "f6_no_assessments": 6, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"q0": "Это интересное предложение, поскольку оно одновременно создает решение проблемы, богатое на эксперименты, и обещает последующий план, применение которого позволит расти, расширяться и учиться в будущих случаях. Оно решает поставленные задачи, привлекая более мелкие организации в качестве SPO и объединяя их в сеть операций, чтобы каждая отдельная организация могла использовать опыт коллектива и внести свой вклад в его развитие. Кроме того, эти небольшие организации могут быть проверены на соответствие квалификационным требованиям (миссия, использование зеленой энергии, опыт) на начальном этапе, а также на соответствие лучшим практикам для развития в сетевой среде SPO. Представляется, что такой совместный подход может устранить некоторые барьеры на пути будущих организаций, особенно тех, кто только начинает работать в этой области, и тех, у кого меньше органов и ресурсов, чтобы вступить на борт без инфраструктуры сообщества. Создание казначейства для конкретной сети также свидетельствует о долгосрочном мышлении в плане управления и устойчивости.", "q0r": 5, "q1": "Очень опытная команда, занимающаяся подготовкой предложений, уже многое разработала и занимается созданием первой группы СПЦ с развитым и управляемым казначейством. В основе лежит менталитет и стремление к развитию сообщества поддержки и единства. Поскольку многие из этих организаций уже имеют опыт ведения хроники опытного обучения и обеспечения его глобальной доступности, вполне вероятно, что эта команда сможет управлять процессом разработки и объединения решения SPO, основанного на миссии и видении, и собрать всеобъемлющий живой проект, который станет подарком для будущих организаций и ключевым достижением для привлечения большего числа организаций к работе в качестве SPO. График работы тщательно проработан, а бюджеты очень подробны для распределения запрашиваемых средств.", "q1r": 5, "q2": "Экспериментальный характер этого проекта, естественно, допускает некоторую гибкость в отношении метрик. В 90-дневной дорожной карте есть высокоуровневые результаты, ожидаемые в январе - марте. Уверенность команды в своей работе и видение этого решения ярко выражены в этом предложении. Поскольку эта идея имеет такой большой потенциал, чтобы стать мощной моделью для роста, было бы полезно предусмотреть возможные подводные камни и решения/тактики в разделе \"Технико-экономическое обоснование\" или \"Дорожная карта\". Например, привлечение будущих общественных групп для участия во второй, третьей и четвертой сетях может оказаться серьезной проблемой. Как это будет решаться? Как команда представляет себе маркетинг этой возможности для тех, кто еще не знаком с перспективой или напуган ею? После того, как первоначальная сеть станет успешной и процесс будет задокументирован, как команда планирует наиболее эффективно использовать ее для создания сообщества и инфраструктуры Catalyst? Это долгосрочные соображения, которые, возможно, выходят за рамки данного предложения, однако размышление над этими потенциальными проблемами может помочь сформировать более сильный первоначальный запуск.", "q2r": 4, "assessor": "z_assessor_856", "no_vca": 16, "ne": 9, "ng": 6, "nfo": 1, "vca_o": 2}, {"q0": "This proposal addresses directly the challenge by crating synergies between SPO's and community.", "q0r": 5, "q1": "All information provided, including fully deployed prototype pool network, are easily accessible from the proposals page. The proposal is well edited and well thought through, with easy to follow line of development. The budget for this 3 month operation, is listed in detail and acceptable.\r\n", "q1r": 5, "q2": "The proposer states that, all records of projects, stake pools, delegation, rewards, and treasury disbursements will be tracked and audited. Planned pool network meetings, will be recorded and publicly available.\r\nI strongly agree and rate auditability with the highest score of 5. \r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 20, "ne": 2, "ng": 14, "nfo": 4, "vca_o": 1}, {"q0": "The idea of SPO community treasuries is a powerful one.  Its easier to see the the connection to rapid funding than to the sustainable operation of stake pools. However in the future this may become more obvious. I think it is important to explore these governance mechanisms. ", "q0r": 4, "q1": "This is basically a proposal for research and documentation on a governance model. The proposers are deeply involved in Catalyst so should have a clear grasp of the task at hand. ", "q1r": 4, "q2": "Some KPIs refer to the Ryuuki project, so there is definitely some overlap here. It may be difficult to separate the two proposals when auditing. The other KPIs refer to the production of documentation and are not very specific as to form, quantity, or dissemination/marketing. ", "q2r": 3, "assessor": "z_assessor_67", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "The proposal seeks to create a network that will document the journey of SPOs from scratch to prominence. They stated that the impact is to help fund community project aside catalyst funding; run an experiment in mutual support and management of a community treasury. The challenge has been addressed effectively as I read the proposal.", "q0r": 4, "q1": "The team is made up of experts engaged in catalyst community project, SPOs, catalyst circle members, funded proposers, community advisors and mentors who will be able to successfully implement the proposal. The detailed plan outlined in the proposal, among others, will launch a prototype network of community stake pools; support the creation and oversight of grassroots treasury; explore and document the concept ; great SPO network that will form and further decentralize the Cardano network. All these facts can lead to a successful implementation of the proposal .", "q1r": 4, "q2": "The road map of the work to be done is clearly stated as from January to March 2022 with details outlined in the proposal. The budget is well broken down and will make auditing very effective.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal supports the greatest challenge that the Cardano community is facing in the next five years, namely the ability to self-govern and successfully manage the wealth that they together create and share. ", "q0r": 5, "q1": "The proposal is driven by highly experienced and respected community leaders who have dedicated their lives to this mission. While the challenge is enormous, and nobody managed to accomplish it before, these trailblazers are dedicated and willing to experiment and work hard with the engagement of the community to forge a path to a new \"societal operating system\" that supportive of human flourishing.", "q1r": 5, "q2": "Everything will be open sourced and accessible by the community, including in form of an accessible playbook.", "q2r": 5, "assessor": "z_assessor_721", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "Creating a network for SPOs is an innovational idea. It \r\n helps to overcome the disadvantage of large organizations'  pools which is lower level of intention/care for one particular ADA pool (as they have many pools for different coins). Though, it is unclear to me about whether 100% of the SPOs joining the network have to be committed to the Community Network Treasury, or there is a choice for them to not join in the Treasury (meaning that they can autonomically use their rewards while being part of the network). Overall, this idea can be scaled-up to address other challenges in the future.", "q0r": 4, "q1": "Given that a prototype pool network is already up and running, it can be implied that there is a high possibility that this project can be put into action. The proposers have done a great job as the budget plan is clearly stated in the proposal, however, there is a lack of information about the team members. Additionally, given that this project would help fund community projects outside of Catalyst funding rounds, so would this mean that the team have to do a whole assessing stage just like Catalyst do? That point should be put into consideration in order to utilize the effort.", "q1r": 4, "q2": "By using existing tools like Github, it can be easy for outsiders to audit both the project and the network itself. So the proposers have done a good job on assuring clarity.", "q2r": 5, "assessor": "z_assessor_936", "no_vca": 18, "ne": 3, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "Создать инновационную сеть СПЦ, ориентированных на Catalyst, работать с выдающимися создателями Catalyst и документировать их путь СПЦ.", "experience": "Ассамблея созданных и вовлеченных проектов Сообщества Catalyst, СПО, членов Круга Catalyst, финансируемых заявителей, советников и наставников Сообщества"}