{"id": 383022, "author": "rin9s", "title": "Decentralized Governance Alliance", "url": "https://cardano.ideascale.com/a/dtd/383022-48088", "category": 26237, "amount": 9600, "description": "El Gobierno Descentralizado está en su infancia y presenta un problema fundamental para las DAOs.\nPodemos ofrecer recursos y experiencia de dGov para atraer a las DAO.", "funded": 0, "upvotes": 16111833, "downvotes": 14564141, "votes_result": 1547692, "votes_cast": 172, "f6_no_assessments": 4, "f6_rating": 2.8333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal aims to improve research for decentralized governance. Even though this proposal quite vague about the outcome, I see it within the challenge as the proposer is able to explain its scope and potential impact on our ecosystem. Of course the outcome is unsure, but in relation to its impact and the requested amount I rate impact for this proposal with 4 stars.", "q0r": 4, "q1": "The idea behind this proposal is great and I support it. The plan for implementation is vague. The budget itself is not really broken down. At least it is somehow linked to the activities. What I miss here more references or a proof-of-life of the proposer the be able to see how feasible this proposal really is. ", "q1r": 3, "q2": "With the given information auditability is hardly possible as the outcome is not clear. However, the proposer clearly states that this proposal is kind of experimental, so I could live with that. But in order to give a higher rating, there must at least be a source for documentation so that the community will be able to audit the progress of this proposal. Furthermore I miss in this area that the proposer has not mentioned possible difficulties and how to overcome them.", "q2r": 3, "assessor": "z_assessor_484", "no_vca": 18, "ne": 3, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal outlines the limits of launching this initiative with a proof of concept, by collecting data on dGov that is happening today, as well as finding collaborators and outside contributors. within and outside the community. I see the value of this idea in building a community that invites more people to join the cardano ecosystem with the same idea. However, the proposal is not suitable for this challenge in terms of measurement indicators. You can carefully read the content of the challenge to implement as well as suggest the right idea for the challenge", "q0r": 2, "q1": "As I stated on impact, this proposal is not yet up to the challenge. The stages of inquiry outlined in the proposal are essential to you, it will be better after you have researched, gathered information and come up with an idea of ​​DAO activity in a certain area.", "q1r": 1, "q2": "You should continue to realize this idea, but when the idea of ​​the DAO is clearer, the idea's risk challenges should be added. The proposed cost should also be clear according to the roadmap", "q2r": 1, "assessor": "z_assessor_697", "no_vca": 16, "ne": 0, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This proposal pitch is simple enough, create a repository for resources on decentralised governance. The team propose this will assist in the growth of understanding, promotion of Cardano as a leader in dGov thinking and provide the resources for new and established dGovs to self govern. ", "q0r": 5, "q1": "The gathering of documentation, resources and knowledge surrounding decentralised governance is a significant body of work that would be ongoing in nature, it's likey this like many other services to Cardano would need consistent upkeep and having someone to kickstart that who has a strong academic backgrond is quite useful in the long run. However, a larger team or greater ground support might lead to stronger outcomes. \r\n\r\nThe project management in the proposal is light, there's little to no information on the timeline or key points of workflow, so the budget sitting at a whole figure is hard to understand also. Is that all wages? Is there resources being created? Is this a resource finding mission? \r\n\r\n\r\nTo their credit the proposer does address the limit in the scope and does indicate that DGA would need time to develop gradually. It really is up to the community to decide if this is the best approach for a project of this nature or, if there is another way to build a repository such as this? ", "q1r": 3, "q2": "This is essentially a project whereby the initiator will work alongside the community and gather information. It doesn't apprear to have any visible checkpoints for the community to audit the progress, however one would imagine the activities of the proposer being that they would engage with the community - would lend some indication as to the progress of their research. \r\n\r\nThere are KPI's and a roadmap, again the proposer has indicated this is low on detail for good reason. However... the question remains is this how the community wants essentially their collective work in decentralised governance recorded or is there a way that has greater accountability in measurable milestones, KPI's and a more defined roadmap. Is it possible to have more clarity at this point in a research project of this nature?", "q2r": 3, "assessor": "z_assessor_699", "no_vca": 15, "ne": 5, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The solution statement is sensible in light of the problem statement and both are clearly written. Given that the challenge seeks to accelerate the development of tools and infrastructure for Cardano-based dApps, the proposed Decentralized Governance (dGov) research and collaboration forum makes sense. If this project is able to create a sizable and engaged community, it could promote the build-out of DAO infrastructure on Cardano. \r\nTherefore, such a forum potentially has real utility despite the modest budget proposed ($9,600) and has the potential to scale if it attracts participants outside the Cardano community. Overall, I agree that this proposal effectively addresses the challenge.", "q0r": 4, "q1": "The team's membership and credentials are unclear. Although the proposer is very active on IdeaScale, no links to a LinkedIn profile page or personal website were provided to verify the proposer's relevant experience with dGov. Moreover, it is not clear how the requested funds are to be spent (i.e., a detailed budget was not provided). Few details are given regarding how the team plans to recruit participants to the forum. The team possesses a clear vision of what they want the forum to be and the kinds of research questions they want to address, but the detailed plan does not layout a strategy on how to make this a reality.", "q1r": 2, "q2": "The short-term goals (\"3-month goals\") are clear: 1) outreach, 2) formation of social channels and continued networking, and 3) develop a long-term roadmap and Fund8 proposal. However, the current proposal does not contain outcome-based KPIs, like how many people join the forum or the number of active participants. The proposal acknowledges downside risks, but does not propose any strategies to mitigate these risks. As such, I neither agree nor disagree that this proposal provides sufficient information for the community to review future progress.", "q2r": 3, "assessor": "z_assessor_914", "no_vca": 15, "ne": 6, "ng": 9, "nfo": 0, "vca_o": 1}], "solution": "Establecer las bases de un organismo de investigación y normalización de dGov. Hacer crecer nuestra reputación prestando un servicio para todo el espacio.", "experience": "Más de 3 años en la comunidad Cardano y en el espacio dGov. Formación académica, consultor técnico y gestor de programas."}