{"id": 383418, "author": "didnkallaehawe", "title": "Bees Delivery DAO", "url": "https://cardano.ideascale.com/a/dtd/383418-48088", "category": 26237, "amount": 21000, "description": "La mayoría de los sistemas de prestación de servicios actuales en los países en desarrollo, como la CMR, están centralizados y no aprovechan las ventajas que ofrece el contexto local.", "funded": 1, "upvotes": 48536154, "downvotes": 12747286, "votes_result": 35788868, "votes_cast": 254, "f6_no_assessments": 5, "f6_rating": 4.133333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "El planteamiento del problema es claro y la solución propuesta también. En cuanto a si esta propuesta aborda o no el desafío, no está muy claro simplemente por el gran alcance de la propuesta. El desafío tiene como objetivo proporcionar herramientas que proporcionen la funcionalidad de las DAOs o que atraigan a las DAOs a Cardano. Esta propuesta no es para construir herramientas, sino para la construcción completa de una DAO que es parte de un proyecto más grande de crear esencialmente un sistema de entrega de paquetes descentralizado. Sin embargo, hay varios aspectos de este proyecto que muy probablemente serían muy útiles para otros DAOs en el ecosistema. La incorporación de un DID, la creación de un token nativo vinculado a la moneda local, y la creación de un sistema de incentivos de CO2 tokenizado requerirían herramientas que serían útiles para cualquier número de nuevas DAOs. Dado que este proyecto está asociado con la red de la AMA, creo que los conocimientos adquiridos a través de este proyecto se compartirían con otros proyectos en el ecosistema y, por lo tanto, cumple con el espíritu del desafío. Teniendo en cuenta este razonamiento, las lecciones aprendidas en el mundo real y las herramientas utilizadas en esta aplicación DAO seguramente tendrían un impacto significativo. Estoy totalmente de acuerdo en que esta propuesta aborda eficazmente el reto.\r\n", "q0r": 5, "q1": "El equipo parece tener las habilidades necesarias y son miembros activos y visibles de la comunidad de Cardano. La cantidad de fondos solicitada para los desarrolladores, combinada con la ambiciosa naturaleza del proyecto, parece ser baja. El plan está muy bien descrito y el presupuesto claramente asignado con plazos realistas. La propuesta es escasa en detalles técnicos. Habría sido útil un libro blanco de forma rudimentaria para ver cómo se superarían algunas dificultades técnicas clave. Dicho esto, es probable que el valor de este proyecto para el ecosistema provenga de la innovación que supone la resolución de las dificultades técnicas. El equipo de la propuesta ya cuenta con una asociación local y ha pensado en algunos de los riesgos del modelo de negocio e incorporado soluciones en su modelo. Estoy de acuerdo en que es muy probable que esta propuesta se lleve a cabo con éxito.\r\n", "q1r": 4, "q2": "La hoja de ruta parece estar bien pensada y aborda los puntos clave que hay que tratar. La sección de auditabilidad muestra los hitos que el equipo espera alcanzar, incluyendo una hoja de ruta más completa, lo cual es bueno de ver. Los hitos son realistas. Se incluye una lista de métricas clave, pero no muestra objetivos de KPI específicos que sería bueno tener para formar una medida más cuantitativa de la implementación exitosa. No se menciona ningún mecanismo específico al que la comunidad pueda acudir para medir el progreso, aunque el equipo es activo en la comunidad y tendría muchas formas de hacer visible el progreso. Estoy de acuerdo en que esta propuesta me proporciona suficiente información para evaluar el progreso en la consecución de sus objetivos declarados.", "q2r": 4, "assessor": "z_assessor_935", "no_vca": 18, "ne": 10, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "This team aims to build a decentralized system for deliveries. From this standpoint this proposal isn't fully aligned with the challenge setting, which is asking to make Cardano the go-to-market blockchain for DAOs. However, the team fairly describes how a successful implementation of this DAO can be used as a role model for other initiatives. Therefore I see this proposal within the challenge. The same is for the impact. The team is able to show a potential positive impact of this proposal on our ecosystem in general.", "q0r": 4, "q1": "Behind this proposal is an experienced team, that has proven their skills in several projects. \r\nWADA has participated in various community events and has shown not only his expertise but also his attitude and willingness to improve the ecosystem around Cardano.\r\nThe presented plan is very detailed and covers topics like market research, technical aspects, and clear deliverables. Also there is a strategy about how to enter the market with this idea (many proposals are missing this aspect). The budget is broken down in detail and from my experience and perspective fair priced. The detailed plan and the experienced team convinced me, that there is a high likelihood for a successful implementation. \r\n", "q1r": 5, "q2": "The team provides metrics and has defined how success look like, so we can audit this proposal. To improve auditability of this proposal, I recommend adding a documentation source, where the community is able to track/observe the progress of this proposal.\r\nThe team has reflected about potential challenges and how to overcome them. Overall, this proposal is not just an idea, this is a ready-to-go project.\r\n", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 23, "ne": 7, "ng": 9, "nfo": 7, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities and governance processes are for democratic and economic empowerment. DAOs are a powerful tool in this respect. I want to bring in my personal knowledge and experience on various governance models into action by assessing proposals in this challenge. Creating a DAO for something that is currently basically only done by big businesses will not only be beneficial for the Cardano ecosystem, but also will help the delivering people to get their fair share of that essential part of infrastructure. It will connect people and give them a huge perspective, such it can be said to have a big impact. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 19, "ne": 3, "ng": 8, "nfo": 8, "vca_o": 1}, {"q0": "The proposal holds value as a DAO itself and has the potential to bring great value to the ecosystem if implemented successfully. However the challenge's aim is to develop tooling to make The Cardano ecosystem a desirable place for DAOs to migrate to.", "q0r": 3, "q1": "The Team appears to have the requisite skills to execute the proposal although without external links it is impossible to verify. The funds are well broken down although $ 12000 for 5 developers for 12 months seems low. The timeframe to execution is reasonable. It is great to see risk management mentioned.", "q1r": 4, "q2": "Roadmap and KPIs are provided but are rather vague and could do with some refining with regards to specific metrics that are easily measured.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "This proposal addresses the context of the challenge. However, it needs to be a little more clear on what kind of infrastructure to the Cardano ecosystem. The proposers describe what could be a product of a DAO, yet it isn't clear what a DAO is and what kind of a DAO it is trying to make. Will the tools they make be general-purpose enough to apply to different areas? Or is it meant to be specific to failing areas lacking delivery services infrastructure? How will other DAOs on Cardano use this, and what governing infrastructures do they plan to put in place? Despite this, the proposal would be great to have on Cardano.", "q0r": 3, "q1": "The team seems experienced enough to coordinate and design software, yet there's nothing to seem to indicate whether there's any experience that fits into the challenge. There's only one part of the picture here, while the other is incomplete.", "q1r": 3, "q2": "The proposal has an understanding of the problem and a possible solution to that problem, though again, the team will have to put more thought into how this will work collectively and for those who participate in this DAO. mile-stones are partially laid out with some being detailed and others vague", "q2r": 3, "assessor": "z_assessor_903", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "Construir un sistema de reparto descentralizado que aproveche los mototaxis y los autobuses interurbanos para crear un sistema más eficiente para todas las partes interesadas.", "experience": "Centro de Wada Camerún: 3 arquitectos y desarrolladores de software senior"}