{"id": 383801, "author": "vinaydeva", "title": "KONMA DAO", "url": "https://cardano.ideascale.com/a/dtd/383801-48088", "category": 26237, "amount": 75000, "description": "Las formas tradicionales de gobierno tienen muchos niveles de gestión para coordinar y aplicar los procedimientos, lo que ralentiza la toma de decisiones.", "funded": 1, "upvotes": 33154336, "downvotes": 14412439, "votes_result": 18741897, "votes_cast": 214, "f6_no_assessments": 6, "f6_rating": 3.7222222222222228, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=1196"], "media": [], "f6_assessments": [{"q0": "Esta ambiciosa propuesta pretende crear la infraestructura técnica para la vida social. Es un proyecto realmente ambicioso. Sin embargo, el briefing del reto dice claramente que este reto trata de aportar \"...más y mejores soluciones para gestionar su DAO con Cardano que con cualquier otra blockchain.\" ¿Qué es KONMA? Es \"...una Organización Autónoma Descentralizada impulsada por la tecnología Blockchain con características como transparencia, seguridad y descentralización.\" Por lo tanto, en una primera pasada, no está claro cómo la propuesta aborda efectivamente el desafío, ya que describe y justifica la creación de una DAO en lugar de ser una propuesta de infraestructura de creación de DAO. Esto hace que la propuesta tenga una calificación inicial de 1 estrella.\r\n\r\nSin embargo, los proponentes escriben en la sección de objetivos que el éxito es \"...Una DAO completamente funcional para ayudar a gobernar Konma y sus Dapps\". También insinúan que son conscientes de que el reto consiste en hacer de Cardano la mejor opción para la creación de DAO al escribir \"Una vez que el DAO esté diseñado y desarrollado con la ayuda de la comunidad, ayudará aún más a Konma a traer más DAOs al ecosistema de Cardano y a gobernar varias dApps bajo Konma y otras colaboraciones.\" Sin embargo, sigue sin estar claro cómo la creación del DAO de Konma va a lograr esto aparte de ser un buen DAO que fue construido en Cardano y por lo tanto inspira a otros a usar Cardano también.\r\n\r\nAhora, si tomamos una interpretación generosa y asumimos que el código fuente es abierto, entonces este proyecto podría convertirse en algo que se convierta en una infraestructura DAO que ayude a las organizaciones de todo el mundo a lanzarse. Dando a los proponentes el beneficio de la duda y asumiendo que esto es lo que realmente pretenden hacer, entonces los problemas que KONMA resuelve podrían ser fácilmente aprovechados para la creación de una infraestructura DAO.\r\n\r\nComentarios. Sugiero que el equipo de la propuesta piense cuidadosamente en la descripción del reto y en lo que pide. Este desafío es sobre la infraestructura DAO y no sobre la financiación para la creación de DAOs en Cardano. Dados los enunciados del problema en esta propuesta, parece que los proponentes están bastante preocupados por la gobernanza y cómo ésta es ineficaz. Por lo tanto, sugiero que un punto de partida podría ser el desarrollo de una plataforma de lanzamiento de DAOs que se especialice en la toma de decisiones. Es decir, desarrollar una serie de protocolos de votación entre los que los creadores de DAO puedan elegir (democracia directa, representativa, una mezcla, etc.) cuando lancen su DAO.", "q0r": 3, "q1": "Hay algunos indicios de que este equipo tiene experiencia relevante en el desarrollo de web3, así como en el desarrollo de otros blockchains. Un poco más de investigación independiente me ayudó a encontrar algunos perfiles de LinkedIn donde se podía evaluar al equipo. La empresa ha existido durante algunos años y los sitios web son bastante profesionales. Está claro que están bien versados en el espacio de la cadena de bloques y uno de ellos ha realizado un curso de cadena de bloques de EMURGO y ha obtenido un certificado. +1 estrellas\r\n\r\nSin embargo, no hay muchos indicios de que sean conscientes de los retos que supone trabajar en Cardano (Haskell y Plutus) ni parecen indicar que conozcan los programas Plutus Pioneers o Prism Pioneers que podrían darles las habilidades necesarias para tener éxito en esto (fuerte recomendación para la siguiente ronda). Si se indicara esto, se añadiría otra estrella.\r\n\r\nEl hecho de que tengan la intención de desplegar esto como código abierto es una indicación de que esto podría ser la base de la infraestructura DAO. Por lo tanto, la propuesta recibe otra estrella. +1 estrella\r\n\r\nComentarios. Para hacer un caso creíble de su capacidad para ejecutar esta propuesta, es vital que los evaluadores y la comunidad reciban información fácilmente accesible que nos ayude a verificar las habilidades del equipo. En su caso, esto significa proporcionar los enlaces del perfil de LinkedIn y el material del repositorio de Github. Otra sugerencia es que se pida una cantidad de presupuesto más baja. Cuanto más dinero pidas, más alto será el listón a la hora de proporcionar pruebas a la comunidad. Los proyectos que piden más de 30-50 mil dólares deben tener algún producto mínimamente viable o un historial muy sólido y probado. Por lo tanto, es aconsejable pedir una cantidad menor para escribir un libro blanco y establecer asociaciones.", "q1r": 3, "q2": "Los proponentes exponen claramente los objetivos semanales del proyecto y tienen un presupuesto muy elaborado que se desglosa en componentes de salario por hora y estimaciones de costes. Esto los sitúa en 5 estrellas. Sin embargo, me gustaría señalar que, de cara al futuro, hay mucho margen de mejora en el aspecto de la transparencia. Las lagunas descritas a continuación hacen que la propuesta pierda una estrella.\r\n\r\nComentarios. Algunos de los costes no están desglosados por componentes. Por ejemplo, los costes de marketing, que ascienden a 10.000 dólares, son significativos y no están debidamente justificados. También vale la pena señalar que los salarios por hora para el desarrollo se establecen en los niveles de los EE.UU. que no está claramente justificado dado que el equipo parece estar basado en la India (lo que significa que el presupuesto de 120 horas para el desarrollo de DAO, un mero 3 semanas para un desarrollador a tiempo completo - esto no es realmente realista para ser suficiente teniendo en cuenta las muchas características que pretenden tener). Puede ser que los proponentes estén pidiendo a Emurgo que desarrolle estas características pero eso no está claro en la propuesta. También sería deseable una mayor explicación de lo que se entiende por \"compensación por el impulso temprano\".", "q2r": 4, "assessor": "z_assessor_582", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This project proposes to impose a DAO and along with the other proposals that this project has filed for fund 7, they are aiming to create one of the larger (if not, the largest) DAOs on the Cardano blockchain. The ambition and magnitude of this project is huge and could pave the way for mass adoption in areas of operation, propelling the Cardano blockchain forward. All of this would start with the successful implementation of this DAO. So it has to be recognised that the potential impact of this proposal is big. ", "q0r": 5, "q1": "The team is currently incomplete, but there is an indication of intention to move fast and assemble needed additional developers within a timespan of 2 weeks. A suggestion that might help to find them is to simply use the seek-tags in the proposal. Further improvement would be to better identify the existing team by publishing each team member and their respective skillset so it can be determined what functions are still needed. This project has a very defined plan of operations in mind. The determination and organisational skills are exceptional. ", "q1r": 4, "q2": "The proposal is very auditable and contains every criteria prescribed in detail. The only thing in terms of improvement apart from team identification that I could find that would prove useful if clarified is how the ICO is meant to be conducted in the future.  ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 26, "ne": 3, "ng": 20, "nfo": 3, "vca_o": 1}, {"q0": "This proposal aims to support the governance of the Konma organization by creating a DAO. This challenge is asking for solution that will help to make Cardano the go-to-blockchain for DAOs. Comparing the challenge setting with the goals of the proposals I don't see a full alignement between challenge and proposal. It seems that KOnma has an active community, so at least we can expect that new people would enter our ecosystem.", "q0r": 3, "q1": "The team seems to be able to implement the proposed solution. Nevertheless, it would be helpful to provide more detailed references or a proof-of-life. The plan describes many details that are planned to include into this solution. To be able to further assess this proposal and see to full scope of this proposal some more details regarding the technical implementation would be helpful. The budget refers to the payment of different development tasks and  from this point of view, the amount can be fairly classified. The marketing budget could be explained in more detail.", "q1r": 3, "q2": "The schedule and the exact end result are described. For a better auditability it would be good to provide a documentation source. In addition, to measure success, not only general metrics could be mentioned, but clear numbers as a target. This would make it easier for the community to assess whether the implementation met expectations in the end.", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Konma is an existing \"Web2\" market place for food, art, and lifestyle items.  The proposers aim to evolve it to a \"Web3\" entity, and the purpose of this proposal is to build support for governance via a \"fully functioning DAO\" on Cardano.  There is a note regarding intellectual property that Konma DAO will remain a product of Konma, with \"rights reserved\", trademark, etc.  However, the proposal also says something to the effect that MIT open source license will be used, which presumably means that others could benefit from it as well, although perhaps only after modification and customization for their own purposes.  This makes me feel that this proposal perhaps does not fit the Challenge goal perfectly of delivering *tools* for managing DAOs.  Nonetheless, it may offer some value.  There is also some suggestion that Konma can bring other DAOs into the Cardano ecosystem, though I find the discussion of this too vague to be compelling.", "q0r": 3, "q1": "The team has some experience with Web3 hackathons, creating smart contracts, but no apparent background with Haskell or Plutus, and they plan to outsource the work in this regard; they hope to work with either EMURGO or MLabs.  There is not much material to convince voters that they proposers have experience in other important areas, for example DAOs, governance, etc.  The roadmap provided lacks much detail to assess.  The first priority is apparently to acquire Haskell/Plutus developers, and then design what they should build.  Strangely, the last two weeks (23 & 24) are simply stated as \"ICO\", which has not been mentioned elsewhere in the proposal.  The bulk of the proposal is heavy on jargon and light on details, which makes it difficult to assess what the project would even like to achieve, let alone how feasible it is that it will be achieved.", "q1r": 2, "q2": "Again, the roadmap is fairly vague and lacks detail, making it difficult to see how the project can be accountable.  A few KPIs are listed, but without any quantities (the reader/voter has no idea what would constitute \"high\" values of the proposed KPIs).  Apart from being unquantified, each of the KPIs is vague and makes reference to aspects that have not been explained in the proposal.  Overall, I cannot see this project being sufficiently accountable, especially for the relatively large budget requested.", "q2r": 2, "assessor": "z_assessor_499", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1, "reply": "Impact/ Alignment\nResponse:\nKonma in an existing web2 ecosystem (marketplace, community forum, upskill etc) we plan to convert all of them into web3, for which a DAO will exist to govern the above ( this includes the Dapps and other wings we are going to co associate with .\n“It will remain an intellectual property of Konma”, doesn't mean we are not allowed to give it to the community for free, such as access to the source code . Only entities with the name “Konma” will remain Konma's. But the code, usability and so on will remain accessible to the community \n*Our aim here is so that no one uses the name Konma, without our consent and knowledge * \nWe have plans for various DAO’s (NFT DAO, charity Dao, Trust Fund DAO etc). These will also consist of “tools” to manage such DAOs. \nWith respect to “bringing other DAO” we are highly collaborative with other NGO entities . for example Trees X Konma. Planting trees and afforesting in India. This entity will be made a DAO, an NFT DAO in specific, as such any other collaboration will also be made a DAO \n\nFeasibility\nResponse:\nHaskell devs are quite scarce , hence our collaboration with Mlabs and Emurgo. The confirmation with Mlabs and Emurgo arrived after the proposal submissions and we did not have the chance to make changes. Our guidance arrives from Mlabs and Emurgo as well as other DAOs we have researched.  Please get in touch with us for new updates, as we have updates on a daily basis. If nothing works with Mlabs and Emurgo (worst case scenario) our mitigation strategy is to employ devs as such and commence work . Any token would need to go through an ICO phase, either stealth launch or fair launch . week 23 & 24 will consist of Quality assurance , final auditing and the ICO phase.\n\nAuditability\nResponse:\nThe discussion forum for the DAO will be in Konmahood, as such a safe space for proposals and voters to come in consensus for further development . this will have a certain number of people present our KPI will be associate to the tribe running the discussions, hence as we grow we expect more in number and at this moment it is hard to pinpoint . the quantitative analysis is directly proportionate to the number of members present in the tribe"}, {"q0": "This is a DAO for their platform, Konma, which is a decentralized marketplace ranging from food to life-style products. DAOs on Cardano are still very few in existence, and this one will add some DAOs into it. This proposal envision to create a DAOs that govern their set of Konmas platform, from DEX to their marketplace. ", "q0r": 5, "q1": "The proposal provide the team profile on their website. They have their action plan laid out in details for the next 6 months. They're capable of identifying the team needed to recruit, complete with salary expectation and criteria (e.g the skills for Haskell developers are preferably a Plutus pioneers, the need of governance model designers, etc). However, it will be helpful if they explained about how the DAO is being developed, what are the core features to implement, and how it will be done. For example, the feature of being able to vote for the next DEX swap token, vote on community made proposal for Konma, etc. This is a rather important aspect since creating a DAO is complex, hence narrowing it down to identifiable items (of goal and achievement) will help the development to be more focused on the objective.", "q1r": 4, "q2": "The metrics and KPIs is well defined, the roadmap is laid out in week interval, and they also have a website to check on. However, since this is supposed to be a DAO and open for audit for the public, it would be better if they mention or provide link for their source code repository. This will make audit process more transparent and available to the public.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 17, "ne": 5, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The project that this team shows in the project will help to solve the slowing decision making/ delivering of traditional forms of governance by designing a DAO with features like transparency, security, and decentralization. Surely they're within the challenge of DAOs <3 Cardano. \r\nTheir included KPIs show that this project is aligned with the challenge givens, more than that these KPIs affect directly the number of the proposers, validators, and voters. Therefore, this project is vital and essential for the development of Cardano ecosystem now and then. ", "q0r": 5, "q1": "The team shared their very detailed implementation plan is not just in user features but also tech. These detailed explanations can help us to clarify what they put in the detailed roadmap. \r\nIn addition, the budget they asked for is reasonable with their plan and the roadmap. \r\nThe only thing the team misses here is the proposal is their faced risks that will appear in their action plan. Hope that they can be aware and have plans for limiting these risks. ", "q1r": 4, "q2": "They have a roadmap that divides into 2 weeks periods and outlined KPIs that will help Catalyst community audit the project clearly. \r\nThe team also has a great view of the problem context that was described into examples. It helps easier to understand the standing problem then helps us understand how the solution can solve it effectively. So, I think all the detail in the proposal are clear and concentrate on what the team wants, and they're all clarified. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}], "solution": "Una DAO para ayudar a gobernar KONMA ORG y sus dApps para facilitar la entrega de la comunidad descentralizada.", "experience": "Participó en hackathons de Web3 y creó contratos inteligentes en ETH y BSC utilizando ERC20, ERC721 y ERC1155."}