{"id": 384890, "author": "gabrielaxel", "title": "DAOJob: The HR Tooling for DAOs", "url": "https://cardano.ideascale.com/a/dtd/384890-48088", "category": 26237, "amount": 24500, "description": "A medida que el espacio de las DAO crece, también lo hace la necesidad de colaboradores. Las bolsas de trabajo actuales tienen un alcance limitado y no están optimizadas para las operaciones de los DAO.", "funded": 2, "upvotes": 69548664, "downvotes": 9542643, "votes_result": 60006021, "votes_cast": 360, "f6_no_assessments": 6, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "El planteamiento del problema es claro y la solución propuesta también. El impacto del proyecto es alto ya que tener acceso al talento dentro del mundo especializado de las DAOs no es actualmente una tarea sencilla y sin embargo es esencial para el crecimiento. Disponer de una herramienta sencilla y eficaz para adquirir el talento necesario sería una clara ventaja para Cardano, promovería un crecimiento sostenido y es fácilmente escalable. Las personas cualificadas interesadas en el espacio DAO irán en última instancia a donde puedan encontrar trabajo. Por lo tanto, estoy firmemente de acuerdo en que esta propuesta aborda efectivamente el desafío.\r\n", "q0r": 5, "q1": "El equipo tiene todas las habilidades necesarias para hacer realidad este proyecto y proporcionó una larga biografía y perfiles de Linkedin para verificar. En el momento de redactar esta evaluación, el enlace del perfil de Linkedin de uno de los miembros del equipo no funcionaba, pero una rápida búsqueda en Google pudo proporcionar toda la información de fondo necesaria. La propuesta está claramente dividida en segmentos factibles con lo que parecen ser plazos apropiados para la realización de cada segmento. El presupuesto también se desglosa de manera que muestra cómo se gastará el dinero y parece ser razonable y realista para lograr los objetivos establecidos. Una de las preocupaciones es que la financiación solicitada sólo cubre los tres primeros meses de un proyecto con un plazo de 12 meses. Este proyecto requerirá también una financiación continua para mantenerse más allá de los 12 meses. Esta cuestión se aborda en la sección de análisis de riesgos afirmando que la financiación futura será adquirida por uno de los miembros del equipo. Tras examinar las credenciales y la experiencia de Kathleen Olstedt, parece muy probable que esto tenga éxito y también se incluyó como objetivo dentro de los hitos de la propuesta. En general, el plan es detallado, realista y describe bien cómo se ejecutará, por lo que estoy totalmente de acuerdo en que es muy probable que esta propuesta se ejecute con éxito.\r\n", "q1r": 5, "q2": "La hoja de ruta con todos los hitos incluidos está detallada, bien pensada y parece realista de alcanzar. Las métricas y los KPI para definir el éxito están presentes pero no son muy específicos. Esto es comprensible en cierto sentido, ya que se trata de una nueva herramienta en un nuevo espacio, pero se requieren algunos KPI específicos para acceder adecuadamente al progreso. Por ejemplo, una métrica es que más de 10 DAOs sean atraídos por el proyecto a Cardano. ¿Cómo se juzgaría esto? ¿Al menos un contrato cubierto por la herramienta propuesta por cada DAO, tal vez? Lamentablemente, esto no está cuantificado, como tampoco lo están la mayoría de las métricas de evaluación. Además, no hay una vía declarada para comprobar el progreso. Estoy seguro de que esto no sería difícil de implementar para este equipo, pero sería útil definir claramente un lugar en el que se pudieran verificar las actualizaciones del progreso. Dicho esto, los objetivos están bien establecidos y, aunque no se cuantifican, se califican. Lo más importante es que no se han ignorado en la propuesta. Por lo tanto, estoy de acuerdo en que esta propuesta me proporciona suficiente información para evaluar el progreso en la consecución de sus objetivos declarados.\r\n", "q2r": 4, "assessor": "z_assessor_935", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "This team want to build a DAO for DAO-related jobs and tasks. Therefore, this proposal is within the challenge goal. The funds are dedicated to deliver a POC within three months. \r\nIf a job-related Dao runs on Cardano it could help to attract specifically skilled people to work for Cardano-related DAOs, so there is potential for a positive impact for the entire Cardano ecosystem. \r\n", "q0r": 4, "q1": "The team has the relevant experience to execute this proposal. a step-by-step plan for the implementation with clear milestones and a defined time horizon, also in technical realization. \r\nBudget seems sensible and has been broken down in identifiable items. The timeline provided to complete the project seems fair. With the given information I think it is highly likely that this proposal (MVP-Version) will be implemented successfully. \r\n", "q1r": 5, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones and a defined time horizon. Also they have provided key performance indicators. To further improve auditability for the community I suggest to add a documentation source where the community can access and observe the progress of this proposal. ", "q2r": 4, "assessor": "z_assessor_484", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}, {"q0": "DAOJob provides a Cardano-integrated platform to support DAOs finding people to perform various tasks, as well as many foreseen features longer term, such as Dispute Resolution, Project/Task Management, etc.  Presumably DAOJob is a play on \"day job\", which I think is quite clever.  As someone who is excited to see Cardano grow, and especially for it to become a/the key ecosystem for DAOs in future, I think the proposed project has great potential to help scale up DAO activity in the Cardano ecosystem.  As a bonus, I think the background of one proposer (Governor of H.E.R. DAO) makes it highly likely that this project will also positively impact the Cardano ecosystem in terms of inclusiveness and diversity, which is really needed.\r\n    ", "q0r": 5, "q1": " Both proposers have impressive and valuable experience, background and connections in many relevant spaces.  I was initially concerned, however, that the team appears to lack technical ability to execute on the project.  I was also concerned that Milestone 1.3 is about recruiting for technical talent, while Month 2 includes Milesstone 2.1, which includes identifying the appropriate tech stack, *after* recruiting technical expert/consultant.  Presumably we can infer that this person will not necessarily build the prototype, but rather \"consult\" on design, stack, etc.  I also assume that the Budget item called \"Technical Architecture\" is intended for paying that consultant, though this is not clear from the proposal.  With the benefit of doubt and given that the Budget is only for the first three months and it is clear that further fundraising and recruiting will be required beyond that, I feel more comfortable that the proposers can feasibly execute on the proposed project's first three months.  I also think that the proposers are well connected and therefore well positioned for recruiting when the time comes.  I wonder if the proposers are aware of https://discoverdaos.com/ and how it relates it to DAOJob.", "q1r": 4, "q2": "The budget is for three months, and the Milestones and Deliverables set out for the first three months seem mostly reasonable and realistic.  Furthermore, I think the proposers could make the case that the deliverables can be documented for accountability and transparency.  However, the proposal's definition of success and KPIs are more focused on later stages of the project, beyond the currently proposed three months.  Furthermore, those KPIs are stated rather vaguely, with little discussion of how they can be measured or what measured values would be considered \"success\".  I am giving an Agree (4) rating on the basis that I think the three-month milestones and deliverables can provide sufficient accountability, even though that is not how the proposal addresses the question.", "q2r": 4, "assessor": "z_assessor_499", "no_vca": 14, "ne": 6, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal states that the need for contributors to DAO Space will not be fulfilled by current job boards. The purpose of this DAO job board is to offer an optimized HR tooling for the specific needs of DAO. The description of the solution is convincing, and the target of this proposal is to translate it in a proof of concept. \r\nIn a further application, I recommend that the proposal includes evidence about the problem itself, i.e. the lack of effective tooling to manage DAO related jobs, which I cannot confirm only based on my own knowledge.\r\nThe proposal goal does meet the challenge main objective to facilitate the development of DAO infrastructures on Cardano. \r\n", "q0r": 4, "q1": "The 2 teammembers are identified by their linkedIN project and gather a relevant experience in human ressources and business development. The solution is well defined and so are the conditions of success. The proposal gives confidence that DAO specific needs are well understood.\r\n3 main risks are identified, starting with recruiting of the technical consultants required to implement the proposal. For all risks, a compelling risk mitigation action plan is presented. Considering the risk that the technical consultant/skills are not yet embedded in the team, I grade feasibility with a score of 4.\r\nI'm very confident that this project will be successfully implemented.\r\n", "q1r": 4, "q2": "A quite precise budget breakdown is presented. Funds are requested to reach to proof-of-concept stage after 3 months, which reduce the risk for community if some. After PoC stage, an application to a coming Catalyst round will be made.\r\nDetailed intermediate milestones are listed, and a roadmap is presented for the full project up to full launch.\r\nMany relevant Kpis are listed, ensuring that the impact on Cardano's DAO environment will be accurately monitored.\r\nBudget allocation is detailed enough to enable a monitoring of the project up to PoC stage.\r\nBased on the given information I grade auditability with a score of 5.\r\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 15, "ne": 3, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "A successful job creation tool for DAOs is an important part of the infrastructure needed for DAOs to operate successfully on Cardano. Proposal would be fully scalable to support any number of DAOs once a launched product is available. KPIs do not directly address a key KPI of the challenge (is ADA in DAO fees > ADA spent on funding) but potential use case of product suggest this would be likely if successful. ", "q0r": 5, "q1": "Milestones for both the 3 month funded period and 12 month road map seem viable. Team has strong experience in the ecosystem, in HR functions specifically, and in product development. The team also seems to have good networks to recruit talent to work on this project. Multiple plausible routes suggested for follow up funding gives good likelihood of ongoing product development/launch if a successful product can be built. \r\nBudget is stated to be intentionally lean. It does appear to be a comparatively low rate for developers which may exacerbate stated risk around immediate hiring requirement, though potentially mitigated by teams network and high potential of ongoing funding. Team has another funding proposal which references this proposal and states DAOJob will proceed regardless of funding success so it's possible this budget concern is unlikely to hinder successful outcome", "q1r": 5, "q2": "Multiple monthly milestones for 3 month funded period. Post funding roadmap has goals defined which would not be difficult to attach KPIs too if funded in a future round.\r\nBudget audit is simple", "q2r": 5, "assessor": "z_assessor_902", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "Under the heading of \"not yet existing tools\" this seems to fit well.  It also drives the key metrics to increase DAO transactions that generate ADA fees, and would entice DAO to use Cardano as a platform for governance.  I am not sure I entirely understand a couple of the suppositions, such as \"HR is the engine of any DAO\". but I understand that certain types of DAOs would greatly benefit from decentralized HR tools.", "q0r": 4, "q1": "I would rate this more highly, except it lacks a technical lead, as noted, and likely underestimates the technical effort required to move this project forward.  Two months at $2,500 / month for an outside technical resource to develop the architecture would seem to me to be a major barrier to success.  Personally, I would rate the likelyhood of success as perhaps a four or a five if it had a higher proposal amount that reflected what would seem to be a more realistic estimate of the technical aspects.  It's entirely possible that the architecture is either more simple than I surmise, or that resources are more readily available to do this work than I have experienced.  The latter would be ironic given the nature of the proposal.  ;-)", "q1r": 3, "q2": "This proposal seemingly reflects in its detailed KPIs the long history of management and implementation enumerated in the CVs.  ", "q2r": 5, "assessor": "z_assessor_975", "no_vca": 25, "ne": 3, "ng": 19, "nfo": 3, "vca_o": 1}], "solution": "DAOJob es una bolsa de trabajo y tareas nativa de DAO que se integra perfectamente con los canales de distribución de Web2.", "experience": "Doctor en neurociencia y ética tecnológica descentralizada, ex jefe de RRHH (SingualrityNET); 15 años de creación de empresas y desarrollo corporativo."}