{"id": 382150, "author": "tobrien", "title": "Paperless Cross-Border Trade", "url": "https://cardano.ideascale.com/a/dtd/382150-48088", "category": 26249, "amount": 146960, "description": "発展途上国では、ソフトウェアや専門知識の価格が高いため、ペーパーレス・トレードの大きなメリットを実現することが困難です。", "funded": 2, "upvotes": 163935684, "downvotes": 4395870, "votes_result": 159539814, "votes_cast": 665, "f6_no_assessments": 6, "f6_rating": 4.833333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "この提案がもたらす影響は計り知れないものがあります。これは、シンプルかつ精巧な方法で提示された素晴らしいアイデアです。提案されたソリューションは、キャンペーンの概要で必要とされている「税関と国境管理」という対象登録項目を明確に言及しています。対象となるユーザーは、まだ発展途上国であるケニアとガーナで、予見可能で持続的な繁栄のためにこのようなソリューションを必要としています。提案者は、このソリューションがすでにEthereumチェーン上で実行されているが、同じものをCardanoチェーン上に移したいと考えていることにも言及している。したがって、この提案が成功すれば、新しいプレーヤーを駆り立てる世界的な影響力を持つだけでなく、多くの既存プレーヤーが、それぞれの現在のチェーンで直面しているかもしれない脆弱性を克服するために、Cardanoへの移行を促すことになるだろう。", "q0r": 5, "q1": "提案者であるティムとジョナサンは、コミュニティでよく知られた顔であり、彼らの専門知識に疑いの余地はありません。そして、この計画の詳細に注ぎ込まれた努力の量は、確かに評価されるべきだ。提案者は、明確なフェーズごとの目標、必要なリソース、リスク、測定可能な指標を含む、明確なロードマップをコミュニティと読者に提供しています。チームは、チームの簡単な概要と、エコシステムにもたらすであろう経験を提供しています。しかし、要求された資金は、このチャレンジに割り当てられた資金の25％に過ぎません。この金額は、チームが提案するかなりの作業量を正当化しているように見えますが、このチャレンジの他のアイデアを不当に評価することになります。私は、チームが次の資金調達ラウンドで資金の一部を提案し、資金7の割り当てからある程度の進歩を示すことをお勧めします。以上、私の意見を述べさせていただきましたが、実現可能性については5点満点中4点とすることが、この提案を正当に評価することになると思います。", "q1r": 4, "q2": "しかし、このチームは、監査プロセスの評価基準を提供する際に、何の留保もしていません。提案者は、各マイルストーンでの希望する結果と、それぞれの成功指標に言及しています。提案書には、キャンペーンの概要を理解した上で期待すべき必要な指標がすべて含まれています。それは、Dappのユースケースとトランザクションの数の増加、国際機関とのパートナーシップ、金融包摂への影響、グローバルなアウトリーチなど、目下の課題の重要な指標です。さらに、アプリケーションをオープンソースで公開し、アプリのデモを触媒チャンネルで提供するというチームの計画は、この提案をより現実的で信頼できるものにしています。以上のことから、この提案には、その進捗状況と最終的な成功をモニターするための十分なKPIが用意されていることがわかります。したがって、私はこの提案に満点を与えます。", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal seeks to solve the problem of high cost of customs paperwork in cross-border trace by moving the TradeTrust framework of electronic trade documents to Cardano which aligns exceptionally well with the challenge goal of foundational Customs & Border Control registry.  \r\nThe proposal is an excellent example of articulating the value to Cardano ecosystem, articulating how the solution scales to address future challenges, providing key metrics and goals that closely align with the challenge.", "q0r": 5, "q1": "The proposal's feasibility could be improved by a challenges and risks section however given that the application is currently functioning the risks are likely minimal.\r\nThe proposal's feasibility is excellently demonstrated by evidence of experience (existing application), team composition, budget is broken down and reasonable, realistic timetable and plan, resources required, detailed technical explanation of the solution.\r\n", "q1r": 5, "q2": "The proposal includes excellent examples of a roadmap, milestones, time horizon, metrics/KPIs to measure proposal success, a clear understandable description of the targeted problem, a detailed description of the solution that addresses the problem. Overall the proposal is an excellent example for future proposers to follow.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 21, "ne": 3, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "The use case of this proposal is very interesting as it is designed to improve the current way of using trading documents. It's clear that paper based trading systems can be daunting, heavy and not optimized. The proposer has brought a solution that will use the cardano network to verify documents and enable rapide trading execution between parties. From the video published in the proposal, the proposer explained that the product was running on the ethereum network but the gas fees made them switch to cardano. Altogether, this proposal fits really well into the challenge.", "q0r": 5, "q1": "Since the project is already up and running, with a working website on mainet, I think that it's feasibility is a matter of continuing. Furthermore, the proposer has added all the information and details needed to achieve a positive note on a successful implementation of the project. Linkedin profile links have been added as well as team members and resources needed to complete the project. The budget has been broken and seems reasonable based on my intuition. Since I'm not a technical guy, I can't judge the reasonableness of the prices. Altogether, I have  confidence in the successful implementation  of this project.", "q1r": 5, "q2": "The proposer has added a roadmap with milestones that can help track its progress. Metrics and KPIs that define success are also included in the proposal. The proposer has clearly, described the problem and the solution.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 15, "ne": 3, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The project aims to eliminate complicated paperwork in the process of transporting goods across borders, saving costs and time for paperwork. Currently this technology is also greatly supported in developed countries. The application is highly practical. The team has professional experience and good relationship with many government agencies.", "q0r": 5, "q1": "The project clearly outlines the project goals, barriers, challenges, and how technology connects to achieve them. With the experience of the team and the solutions they offer are objective and feasible. But it requires a lot of time to implement as well as educate the market on the new method to be accepted for paperless cross-border freight.", "q1r": 4, "q2": "It is possible to check the progress of the KPIs in each stage and verify with the documentation they have done through the information provided about the results of the practical application of the countries implementing this technology.", "q2r": 4, "assessor": "z_assessor_648", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "this proposal effectively addresses the Brief by working to place blockchain built paperless trade onto the Cardano blockchain. This is a fundamental governmental registry that is well suited for blockchains strengths.", "q0r": 5, "q1": "This team has already built the solution and has demonstrated value. The propsoal simply seeks to move the existing solution to the Cardano chain, the team has experience and the plan is sound.", "q1r": 5, "q2": "The plan presents operational auditable, measurable, specifc time-fenced milestones allowing the community the ability to audit this proposal's progress and success. it is nicely presented.", "q2r": 5, "assessor": "z_assessor_701", "no_vca": 17, "ne": 2, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "Brilliant. I recall the Government of Ghana tries to move port activities online, the initiative had a challenge integrating the process and rather cost delay. I think this proposal would be helpful, the educative component is important to integrating shipping agents and stakeholders for easy usage. ", "q0r": 5, "q1": "The team has proven evidence to ensure delivery successfully. Great team experience and I think the community should support and help the migration to Cardano blockchain.  ", "q1r": 5, "q2": "great cost breakdown. I think it would be easy to audit and trace activities. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}], "solution": "TradeTrustの相互運用フレームワークをCardanoに移行し、電子貿易文書の低コストで信頼できる相互運用を促進する。", "experience": "私たちのチームは、30年にわたる越境貿易の思想的リーダーシップと、15人の経験豊富なブロックチェーンエンジニアのチームによるブロックチェーンデザインを持っています。"}