{"id": 382620, "author": "cooton", "title": "Voted Targets 2222", "url": "https://cardano.ideascale.com/a/dtd/382620-48088", "category": 26249, "amount": 120000, "description": "地域のリーダーや選挙で選ばれた議員は、地域や世界の問題に対処するために、現実的な達成期限を持つ活動家主導の目標を必要としています。", "funded": 0, "upvotes": 14690820, "downvotes": 25319430, "votes_result": 10628610, "votes_cast": 110, "f6_no_assessments": 4, "f6_rating": 1.5, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal seeks to solve the problem of determining target dates for achieving local or global solutions by a voting dApp for target dates which partially aligns with the challenge goals but is not a foundational registry solution listed in the challenge. \r\nThe proposal could be improved by articulating the value to Cardano ecosystem, articulating how the solution scales to address future challenges, providing key metrics and goals that more closely align with the challenge and either selecting another challenge (dApps and Integrations) or more closely aligning with this challenge's goals.", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of evidence of experience (linkedin profile). \r\nThe proposal's feasibility could be improved by team composition, budget is broken down and reasonable (not enough details to determine), realistic timetable and plan, resources required, detailed technical explanation of the solution and a challenges and risks section.", "q1r": 2, "q2": "The proposal includes a clear understandable description of the targeted problem\r\nTo improve the proposal include a roadmap, milestones, time horizon, metrics/KPIs to measure proposal success and a more detailed description of the solution that addresses the problem.\r\n", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 23, "ne": 0, "ng": 17, "nfo": 6, "vca_o": 1}, {"q0": "The proposition seems interesting but the description of the users is too large. The challenge is cover specific foundational Registry solutions which are precisely named. Your solution is not precisely describing thoes users.", "q0r": 2, "q1": "Your solution is not describing\r\n•\tthe team (experience, number of people, cost etc…) that will work on it\r\n•\tThe description of the budget and what it will use for…\r\n•\tA planning of the development of your project\r\n•\tThe technical description of your solution (you say that there is a crypto payment but what next? How people are identify, how secure the vote are etc…)\r\n", "q1r": 1, "q2": "You need to had KPI, roadmap and milestone for your project in order to the community to follow the implementation of your solution", "q2r": 1, "assessor": "z_assessor_602", "no_vca": 21, "ne": 0, "ng": 13, "nfo": 8, "vca_o": 1}, {"q0": "This proposal is about developing a Dapp that citizens can vote on activist targets, incentivized with a token. This is an interesting idea. Potential impact can be seen from this idea, and conceptually, I think it has a certain fit for the challenge. However, it seems that this proposal is incomplete [without goals, road map, metrics, budget breakdown, and risk/challenge]. My advice is: go deeper into some voting-related aspects that would affect the designing of a dapp: Liquid democracy. Therefore, impact on the ecosystem can not be seen or defined, because, developing a dapp requires more detail in the plan. Based on the given information, I strongly disagree with this proposal's impact, and would give it a score of 1.", "q0r": 1, "q1": "It's difficult to evaluate an incomplete proposal [experience information, the team is too limited, without any roadmap or KPIs, and of course the risk is not defined]. Therefore, although I am impressed by this idea, but definitely there is no ground to agree on the feasibility of this proposal. Based on the given information, I strongly disagree with this proposal's feasible, and would give it with a score of 1.", "q1r": 1, "q2": "For an incomplete proposal like this, transparency can't be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "Very broadly speaking, the proposal fits the challenge. However it's hard to see how it could be effective. Everything stated in this proposal is so broad that multiple concerns are raised.", "q0r": 2, "q1": "It is unclear how the proposer's entrepreneurial experience fits with this project's aims, and the lack of specifics unfortunate don't help. It would also help this proposal greatly if members of the development team were lined up ahead of time. ", "q1r": 1, "q2": "Again, the proposal is very broad, and so are the goal, which don't appear to have any functionality as proper milestones that can be tracked or audited. The funding request is also much to large for a proposal this risky. ", "q2r": 1, "assessor": "z_assessor_853", "no_vca": 19, "ne": 2, "ng": 16, "nfo": 1, "vca_o": 1}], "solution": "市民はDappを介して活動目標に投票し、目標達成時期は2022年から1年から200年まで延長可能。トークンでインセンティブを与える", "experience": "クライアントのためのソリューション開発を成功させた、退職した弾力性のある起業家。\nwww.linkedin.com/in/rhett-hook-34607331"}