{"id": 382874, "author": "wadaghana", "title": "Cardano Care", "url": "https://cardano.ideascale.com/a/dtd/382874-48088", "category": 26249, "amount": 88145, "description": "ガーナのアクラにあるプラスチックリサイクル業界は、古い評判のモデルと、有用な技術の利用が少ないという問題を抱えています。", "funded": 1, "upvotes": 102594326, "downvotes": 6988004, "votes_result": 95606322, "votes_cast": 399, "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=5872"], "media": [], "f6_assessments": [{"q0": "This proposal seeks to solve the problem of poor plastic recycling adoption in Accra, Ghana by an Ada incentivized recycling program which partially aligns with the challenge goals but is not a foundational registry solution listed in the challenge. \r\nThe proposal does a good job of articulating the value to Cardano ecosystem (but could be improved), articulating how the solution scales to address future challenges (expansion to rest of Ghana) andproviding key metrics and goals (but should more closely align with the challenge).\r\nThe proposal could be improved by either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of evidence of experience (WADA website), team composition (very vague, should be more detailed), budget is broken down and reasonable, resources required, additional funding plan (self sustainable), realistic timetable and plan, detailed technical explanation of the solution\r\n\r\nThe proposal's feasibility could be improved by a challenges and risks section.", "q1r": 4, "q2": "The proposal includes a clear understandable description of the targeted problem and a detailed description of the solution that addresses the problem.\r\nThe proposal is an excellent example of a roadmap, milestones, time horizon and metrics/KPIs to measure proposal success.\r\n", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 22, "ne": 1, "ng": 13, "nfo": 8, "vca_o": 1, "reply": "We are greatful for your fair feedback. Just want to urge you to kindly read the final draft of the proposal as a lot of the downsides you mentioned in the impact criteria of your assessment was addressed in the proposal. Also, we would urge you to think broadly of government as not just an intitution but for the people, from the people and by the people. This will help understand why this proposal aligns perfectly with the challenge."}, {"q0": "The proposal has a Nobel aim and has the potential to radically improve many things in one go. If successful it addresses pollution, waste management, and source of revenue to poor in one single stroke. Therefore there is a need to have a holistic effort to support this dApp. ", "q0r": 5, "q1": "The proposal is by WADA and routed in Ghana for implementation. The proposal has a clear aim and has identified an important problem at the global level to solve. There is bound to be substantial risks in implementation regarding the availability of the recycling industry and movement of waste to the recycling plant. However, a dApp is the first requirement to try this experiment. The WADA team had shown good commitments in handling large projects therefore they should be able to carry out the task successfully. \r\n", "q1r": 5, "q2": "The end state after one year, performance metrics, and the budget for the project all look promising and achievable. There is a need to open source the dApp which will enable adoption/experimentation in other places. \r\n", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 18, "ne": 1, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "Relation to personal qualifications: Due to both my past political engagement and having lived in different countries with different approaches to administration on a governmental level, I have experienced, discussed and thought about this topic a lot. In addition to this, I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects. The proposal presents an excellent approach to tackling several interconnected problems: Sustainability, waste and economy, and also concrete problematics like waste beeing illegaly shipped to Ghana. This proposal approaches these problems by generating a genuine approach that connects blockchain, the SDGs and a feasible solution. Really well done. It excellently matches the challenge. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing, and the related business seems serious and credible, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they and their project partners will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 6, "ng": 6, "nfo": 8, "vca_o": 1}, {"q0": "A very impactful proposal that will, if implemented successfully, undoubtedly improve the lives and the environment of people of Ghana. Environmental policies are a very important part of SDGs and Cardano needs to be well aligned with them. The only thing missing from the proposal is the alignment with the nation of Ghana, as challenge requires, but if significant impact gets achieved, I see no reason why the state would not get involved.", "q0r": 4, "q1": "WADA team is very experienced and active in the community, plan is clearly presented in detail, timeline is realistic and well thought out. Wording of the proposal demonstrates a deep understanding and care about the proposed recycling and reputation solution. References show serious attitude and deep research.", "q1r": 5, "q2": "Measures of success and key performance indicators are clearly stated in conjecture with a realistic timeline. Budget breakdown is detailed and easily audited, proposal is written in a clear and easily understandable way.", "q2r": 5, "assessor": "z_assessor_65", "no_vca": 19, "ne": 3, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "This project addresses multiple pressing issues. First and foremost, creating an infrastructure to handle the recycling of plastic waste is going to be a huge benefit down the road, as we continue to face issues with single use plastics. Secondly, the team outlines the positive economic impact that streamlining the recycling process would have on families in Accra. ", "q0r": 5, "q1": "Could use slightly more information about the experience and background of the project team. However, their proposal clearly demonstrates their passion and knowledge about this topic. Their roadmap and KPIs also demonstrate that they have a clear plan to execute the project.", "q1r": 4, "q2": "KPIs, budget breakdown, and project roadmap  are very detailed. The team laid out the steps and costs of their project in a way that will make it easy for the Cardano community to monitor.", "q2r": 5, "assessor": "z_assessor_892", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This proposal is a great idea as it meets the goal of the challenge in developing a Dapp solution which can be adopted by the government of Ghana. It is a solution to the many tonnes of plastic waste which lay on the streets of Ghana. The proposal includes education and employment opportunities for the citizenry which is in line with the challenge solution. The marketplace if implemented successfully will educate and introduce more people to the Cardano ecosystem.", "q0r": 5, "q1": "This team has been participating in the Cardano community for a long time and I believe they have the skills and know how to execute this proposal successfully. The presented plan and roadmap is very comprehensive however, i think more detail about how the marketplace app will be developed and it's features  should be provided. With the provided implementation plan and experience of the team, I think this proposal is highly likely to be implemented successfully. ", "q1r": 4, "q2": "The proposal team have provided a comprehensive documentation and roadmap implementation.\r\nTo improve auditability, they could provide more details on the marketplace app itself. For example, the core features that would be implemented on the app. \r\nAlso they could provide more details on how they intend to use smart contracts to encourage the citizens, institutions and recycling companies to adopt blockchain technology.", "q2r": 4, "assessor": "z_assessor_922", "no_vca": 19, "ne": 4, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "認定されたプラスチックのリサイクル会社が集まった市場、Plutusによる資金保証、リサイクル処理に便利な技術。", "experience": "和田です。カルダノコミュニティの実践者、起業家、開発者からなる熟練したチームで、アフリカやディアスポラの各地にあるハブに配置されています。"}