{"id": 383954, "author": "lucasworx", "title": "Public Task and Job Management", "url": "https://cardano.ideascale.com/a/dtd/383954-48088", "category": 26249, "amount": 24000, "description": "政府が提供するサービスは、リソースを使いすぎたり、市民のニーズと実際に行われている仕事の内容がずれていたりすることがよくあります。", "funded": 0, "upvotes": 19397448, "downvotes": 15971217, "votes_result": 3426231, "votes_cast": 110, "f6_no_assessments": 4, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal seeks to solve the problem of inefficient public services management by a public services management system which partially aligns with the challenge goal of but is not a foundational registry solution listed in the challenge.\r\nThe proposal does a good job of articulating how the solution scales to address future challenges.\r\nThe proposal could be improved by better articulating the value to Cardano ecosystem, providing key metrics and goals that more closely align with the challenge either selecting another challenge (Miscellaneous) or more closely aligning with this challenge's goals.", "q0r": 3, "q1": "The proposal articulates the feasibility aspects of evidence of experience (website), team composition (could be improved), budget is broken down and reasonable (may be too small), realistic timetable and plan, technical explanation of the solution (could be more detailed), a challenges and risks section.\r\nThe proposal's feasibility could be improved by including resources required (website hosting fees).\r\n", "q1r": 4, "q2": "The proposal includes a roadmap, milestones, time horizon, a clear understandable description of the targeted problem, a detailed description of the solution that addresses the problem.\r\nTo improve the proposal include metrics/KPIs to measure proposal success.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 19, "ne": 3, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "The project does not address the stated goal of the Brief, nor its intent: \"Dapp proposals should cover foundational Registry solutions, namely:\r\n\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"", "q0r": 2, "q1": "This project requires the participation of the relevant government bodies, and accomplishing that is not a part of the proposal, therefore the project as written is not highly likely to succeed.", "q1r": 2, "q2": "these are auditable: \"SUCCESS METRICS\r\n\r\n3 MONTHS\r\n\r\nCreate team, Wireframes, Mockups or small branding guidelines, Create or working on proof of real life work mechanism\r\n\r\n6 MONTHS \r\n\r\nCreate work requests, Completing work requests and bounties for WR, Security Audit\"", "q2r": 4, "assessor": "z_assessor_701", "no_vca": 15, "ne": 0, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "This is a great idea and a well-drafted proposal. I think the proposal addresses the challenge and has community ownership by allowing community members to participate in setting up tasks and voting on the quality of tasks done. This gives a sense of ownership which is helpful for adoption. ", "q0r": 5, "q1": "I think the proposal has indicated practical timelines and associated activities that are achievable. Also, metrics for success are clear and specific. Excellent team experience, it would be useful to have included a Linkedin profile link as well.", "q1r": 5, "q2": "A detailed budget breakdown. It would be helpful to add a progress report for tracking and audit. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The proposal accurately Identifies a problem within the challenge looking at a civil registry of jobs for improvement/optimisation. The proposal is highly scalable.", "q0r": 4, "q1": "Whilst the proposer obviously holds great experience in terms of development what is lacking for me is a plan, or team member with experience in implementing systems at a institutional level as that is what will be needed for this to be a success. It is great to see potential challenges highlighted but would be good to hear the proposed solutions to those challenges. The funds requested for the scope of work required if anything seem quite low.", "q1r": 3, "q2": "There is a roadmap provided but without tangible KPIs to evaluate the progress of the project it will be difficult to determine the success and therefore audibility of the project.", "q2r": 3, "assessor": "z_assessor_745", "no_vca": 17, "ne": 2, "ng": 10, "nfo": 5, "vca_o": 1}], "solution": "市民がタスクや仕事を作り、改良し、実行できるように、センスメイキングプロトコルと透明性のある資金調達メカニズムを作る。", "experience": "開発者、起業家、JIRA/タスク管理/SCRUMを使っていた人"}