{"id": 384568, "author": "mlemay", "title": "DAPP SDK - Tragedy of the Commons", "url": "https://cardano.ideascale.com/a/dtd/384568-48088", "category": 26249, "amount": 10000, "description": "コモンズの悲劇とは、「無料」の資源に対して発生する経済理論で、資源の所有権や資源保護のための政策につながるものです。", "funded": 0, "upvotes": 17101332, "downvotes": 23191351, "votes_result": 6090019, "votes_cast": 96, "f6_no_assessments": 7, "f6_rating": 1.5238095238095237, "videos": [], "media": [], "f6_assessments": [{"q0": "The basic idea for the proposal is interesting and could have a serious impact in the way resources are regulated in terms of policies and prices, but unfortunately this proposal is not complete and lacks details about its full description on how address the problem statement presented. For the specific challenge it is extremely important to provide some info on how a DAO SDK could be integrated and used by a government.\r\nI suggest to the proposer to read the guide for proposers to write a proposal or follow the Catalyst School workshops on \"How to make a proposal\" in order to understand the level of details required to prepare a successful proposal.\r\nThis assessment is generic and reused on purpose for similar incomplete proposals.", "q0r": 1, "q1": "Unfortunately this proposal is not complete and lacks details about its implementation, budget, team, skills required and provided, technical details.\r\nFor the Feasibility section it's really important to provide info about: \r\n- Details about the technical implementation (which languages/technologies will be used?)\r\n- Details about the team: listing of the team members, skills, experience  and references for each member.\r\n- Details about the budget: a budget breakdown, estimate about the cost for each specific stage, list of actionable tasks and deliveries, a timeline for each delivery in accordance with the costs estimated.\r\nI suggest to the proposer to read the guide for proposers to write a proposal or follow the Catalyst School workshops on \"How to make a proposal\" in order to understand the level of details required to prepare a successful proposal.\r\nThis assessment is generic and reused on purpose for similar incomplete proposals.", "q1r": 1, "q2": "Unfortunately this proposal is not complete at all and lacks details about its auditability.\r\nFor the Clarity/Auditability section it's really important to provide info about: \r\n- A clear definition for the success of the project\r\n- A roadmap about the deliverables that will occur\r\n- Key Performance Indicators to allow the community to keep track of the proposal progress and implementation\r\nI suggest to the proposer to read the guide for proposers to write a proposal or follow the Catalyst School workshops on \"How to make a proposal\" in order to understand the level of details required to prepare a successful proposal.\r\nThis assessment is generic and reused on purpose for similar incomplete proposals.", "q2r": 1, "assessor": "z_assessor_147", "no_vca": 27, "ne": 9, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "This proposal is for a DAO Framework SDK solution that does not fall within the scope of the challenge which is, \"Dapp proposals should cover foundational Registry solutions, namely:\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"\r\n\r\nThe proposal adds value to the Cardano ecosystem, in the form of providing a relevant SDK.\r\n\r\nThe goals of the project are incomplete as the proposal was not finished and only partially align with the challenge.\r\nThere are no key metrics defining success.\r\n\r\nHow scalability will be achieved is not addressed in the proposal.\r\n\r\nTo improve the proposal: select a more appropriate challenge (DAOs), ensure goals align with the challenge, include key metrics of success, address how the solution scales in the proposal.\r\n", "q0r": 2, "q1": "The proposer does not provide evidence of relevant skills and experience needed to implement the proposal.\r\nThe proposer does not identify the type and number of team members required to implement the proposal.\r\nThe budget is not clearly broken down into identifiable items. \r\nThe budget seems low to achieve the set goals however impossible to determine without a budget breakdown and more specifics about the goals.\r\nThe proposal has no timetable to complete the work.\r\nThe proposal does not explain technical aspects of the implementation.\r\nThe proposal does not include challenges and risks relevant to a successful implementation.\r\nTo improve the proposal: provide specific evidence of relevant experience needed to implement the proposal or partner with developer(s) who can demonstrate the experience in the proposal, identify team members with skill sets required, breakdown the budget request, include a timetable, explain technical aspects of solution, include a challenges and risks section.", "q1r": 2, "q2": "The proposal does not include a roadmap with milestones and a time horizon for achievement. \r\nThe proposal does not provide metrics/KPIs that define the success of the proposal. \r\nThe proposal does not provide a clear understandable description of the targeted problem.\r\nThe proposal provides an incomplete solution to address the problem.\r\nTo improve the proposal: include a roadmap, include metrics/KPIs for success, provide more detail about the solution, provide a better description of the target problem, complete the solution description", "q2r": 1, "assessor": "z_assessor_344", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "I agree to the proposal because the problem needed to be solved has been identified and falling within the scope of the challenge.\r\nKey metrics and goals of the proposal  are stated and fallin withen the scope of the challenge.\r\n\r\nThe proposal also scale to Address future challengies.\r\n", "q0r": 4, "q1": "Neither agree nor disagree because relevant evidence and experiences are not really provide and links as well.\r\n\r\ntheir level of competent is poor and has not tactically listed their type of team memebers required for implementation.\r\n\r\nThe proposal has a targeted fund for the proposal but has'nt outlined clearly bedgets into identifiable items to achieve the goals of the proposal.\r\n\r\nHas not really provide any verification plans if additional funding is been required to implement the proposal.\r\n\r\nThe proposal has describe the necessary resource to implement the proposal but has no time table to complete the work.\r\n\r\n", "q1r": 3, "q2": "Neither agree nor disagree because there are not well road maps provide for the auditation if the project us funded.\r\n\r\nNot clearly defined metrics and KPI's that defines the success of the proposal  But has an understandable solutions to solve the targeted problem.\r\n\r\nNo well provide contency plans for various outlines", "q2r": 3, "assessor": "z_assessor_447", "no_vca": 23, "ne": 1, "ng": 11, "nfo": 11, "vca_o": 1}, {"q0": "I think I am competent to assess this proposal as I have been active in project Catalyst since fund 4 and I have experience analyzing business requirements from over 5 years of delivering software solutions for small business and corporations as well.\r\nI apologize, but this problem statement seems to be factually incorrect, aside from being extremely vague. The tragedy of the common postulates that individuals acting in their own self interest might lead to a situation where a highly demanded resource may become depleted due to there being no planning in how the resource is to be obtained in a sustainable manner. In this problem statement, it is simply said that the tragedy of the commons occurs on \"free\" resources (common, rather, such as drinking water in certain regions, or trees etc) and leads to resource ownership or policy to protect resources (are these two bad things? I'm very confused). \r\nThe solution as well, unfortunately, is extremely vague and does not sound like a solution at all: \"Policy making and ownership decision making is difficult to make right in many countries as power may often tip the scale.\" This is simply again stating a general problem.\r\nThis proposal does not fit in this category as it is extremely unclear what it's about. Without any details on what it wants to do, KPI's and a concrete plan, I do not think this proposal effectively addresses the challenge.", "q0r": 1, "q1": "The proposer has only mentioned that they worked on \"Wireless Spectrum Resources allocations in emerging countries via dynamic allocations\". Aside from this again being very vague, I do not see how this experience would help in building a DApp, if that is the intention here.\r\nI strongly disagree that this proposal can be implemented successfully, due to the lack of information on the team who would work on this, no details on how the budget would be used, no risk analysis and no plan outlining the technical approach and the usage of resources concretely. This is all crucial information that the proposal needs in order for us to understand how it would try to accomplish what it wants to accomplish (which again, is not specified clearly. \r\n", "q1r": 1, "q2": "I strongly disagree that the information here is sufficient for this proposal to be auditable, or clear to understand. It needs to clarify what it wants to do and it needs a roadmap of how it will do it, as well as KPI's to help track its progress.", "q2r": 1, "assessor": "z_assessor_546", "no_vca": 20, "ne": 7, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The problem statement is not likely to describe a problem/remains very abstract, and not explained in detail. I can see the solution idea related to a draft DAO Framework SDK. Because this proposal is incomplete, the solution has not transformed into details, as a result, the direction is very abstract, however, it is worth trying for completing in the future. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "Proposer's profile is not provided, and, there is no external link for verification. As a result, definitely, there are no grounds to agree on the feasibility of this proposal.\r\nMy advice would be: this idea (related to DAO) is great, so in case the proposer wants to complete this proposal in the future, he should pay attention to ensure that the following components are fully provided: (i) Goals; (2) road map (integrated with measurable KPIs/metrics); (3) Budget breakdown; (4) Risk and challenge. Based on the given information, I disagree with this proposal's feasible, and would give it a score of 2.", "q1r": 2, "q2": "For an incomplete proposal like this one, transparency can not be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 15, "ne": 0, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The problem is clear, however, the solution is not. The proposal needs more input on how it intends to solve the problem. Which region would be of focus? How does it help in government adoption of DAPP.", "q0r": 1, "q1": "The proposal leaves out the definition of success. The outcomes and deliverables and even how those metrics would be practically measured.", "q1r": 1, "q2": "The budget should consider a detailed breakdown associated road map of activities for which the fund would be used.", "q2r": 1, "assessor": "z_assessor_727", "no_vca": 18, "ne": 0, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "The proposer did not make it clear what they intend to do and how it will help the community", "q0r": 1, "q1": "The proposer did not provide any information to demonstrate that they are capable of implementing the project. No team member identity, no roadmap, no KPI, no funding breakdown", "q1r": 1, "q2": "It is completely impossible to audit the proposal because member information is not available, Roadmap is not available, specific achieved goals are not available, funding breakdown is not available.", "q2r": 1, "assessor": "z_assessor_783", "no_vca": 25, "ne": 3, "ng": 14, "nfo": 8, "vca_o": 1}], "solution": "政策決定やオーナーシップの決定は、多くの国では権力の力で左右されることが多いため、正しい方向に導くことは困難です。", "experience": "新興国でのワイヤレス・スペクトラム・リソースの割り当てを、ダイナミック・アロケーションで管理・担当しました。"}