{"id": 384540, "author": "mavster04", "title": "Vaccine Management Platform + APIs", "url": "https://cardano.ideascale.com/a/dtd/384540-48088", "category": 26249, "amount": 32000, "description": "紙ベースのワクチン認証の信憑性を確認するのは難しい。市レベルでの管理＆モニタリングも同様に困難です。", "funded": 2, "upvotes": 118412483, "downvotes": 22482616, "votes_result": 95929867, "votes_cast": 306, "f6_no_assessments": 3, "f6_rating": 4.444444444444444, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is for a Vaccination Registration solution that does fall within the scope of the challenge.\r\n\r\nThe proposal adds value to the Cardano ecosystem, in the form of a new use case and more members.\r\n\r\nThe goals of the proposal align with the challenge.\r\nThe key metrics are about the coding process instead of aligning with the challenge goals.\r\nThe proposal is able to scale to address future challenges.\r\nTo improve the proposal: ensure metrics align with the challenge goals.", "q0r": 4, "q1": "The proposer provides evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal.\r\nThe proposer identifies the type and number of team members required to implement the proposal.\r\nThe budget is outlined clearly and broken down into identifiable items. \r\nThe budget is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable to complete the work.\r\nThe proposal provides a sensible and conductible plan for implementation that shows not only what is being done but also how.\r\nThe plan describes the resources necessary to implement the proposal.\r\nThe proposal clearly explains technical aspects like architecture, language and technologies if they are crucial for implementation.\r\nThe proposer has not considered challenges and risks relevant to a successful implementation.\r\nTo improve the proposal: add a challenges/risks section (government adoption as legal proof of vaccination for instance)", "q1r": 4, "q2": "The proposal includes a roadmap with milestones and a time horizon for achievement.\r\nThe proposal includes metrics/KPIs that define the success of the proposal however success is simply defined as developing the solution instead of number of users or communities.\r\nThe proposal includes a clear understandable description of the targeted problem.\r\nThe proposal includes a clear understandable solution that addresses the problem.\r\nTo improve the proposal: the key metrics could be improved to align with the challenge goals.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 19, "ne": 8, "ng": 11, "nfo": 0, "vca_o": 1}, {"q0": "A palteform for vaccine verification is a problem that fits well into this challence. The proposer wants to build a system that can be used to track information and verifications on user vaccination.  Using a blockchain network like cardano, this can transparent  and decentralized. If the vaccination information are on the blockchain there will be the need to talk about the privacy users which I suggest to the proposer to include it the proposal.", "q0r": 5, "q1": "Based on the informations provided in this proposal, there are chances of a successful implementation. The advice that I have for the proposer is to include the evidence of the skills and experiences claimed. This can be done by adding linkedin profiles. However the proposer has provided link to similar projects but this can't be verified easily, in my opinion. I think that the proposer can incrase its chances by adding those missing informations.", "q1r": 3, "q2": "The proposer has included all the information necessary the ease the process of auditability. In fact, the proposer has added a roadmap with milestones. This proposal also includes metrics and KPIs that makes it easy to audit. Furthermore, the problem is described clearly and the solution as well.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 16, "ne": 1, "ng": 15, "nfo": 0, "vca_o": 1}, {"q0": "This proposal addresses a need that all countries currently have -- verifying vaccination. This will be useful to developing countries and developed countries alike, thus meeting the challenge.", "q0r": 5, "q1": "The proposers have experience in healthcare which is very important given the proposal. Their proposal carefully explains the budget, project roadmap, and KPIs. Given the information they provide, it points toward this being a successful project.", "q1r": 5, "q2": "The KPIs, project roadmap, and budget are the three key pieces of information needed to evaluate the progress and success of the proposal. That information is provided.", "q2r": 5, "assessor": "z_assessor_779", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}], "solution": "私たちの健康ソリューションは以下を提供します。(a)医師のためのワクチン情報システム、(b)ワクチン検証プラットフォーム、(c)開発者のためのAPIs", "experience": "私たちは、2016年からヘルスケアソリューションを開発しています。www.mycure.md。また、包括的なヘルスケアAPIを作成しました。www.hapihub.com。"}