{"id": 385164, "author": "quad33kpar", "title": "SHIELD Dapp for African Nation", "url": "https://cardano.ideascale.com/a/dtd/385164-48088", "category": 26249, "amount": 54000, "description": "アフリカの人々に直接対応する特定のバーチャルアプリケーションがロックされていることが、アフリカでのデジタル導入の普及を妨げています。", "funded": 0, "upvotes": 17760250, "downvotes": 21620007, "votes_result": 3859757, "votes_cast": 102, "f6_no_assessments": 9, "f6_rating": 2.4074074074074074, "videos": [], "media": [], "f6_assessments": [{"q0": "Providing virtual identity documents to be used by African governments is a solution that falls within the scope of the challenge.\r\n\r\nThere is an unattributed quote that mentions the Cardano blockchain but there is no indication as to how the proposal adds value to the Cardano blockchain. If the described public/private blockchain is intended to part of the Cardano mainnet or a sidechain, that is not mentioned in the proposal and it appears that the blockchain is entirely separate from Cardano.\r\n\r\nThe goals of the project align with the challenge however no key metrics are provided. \r\n\r\nHow scalability will be achieved is not addressed in the proposal however there is a target of 300 million identities activated by Q3 2023.\r\n\r\nTo improve the proposal: better articulate how the proposal adds value to the Cardano ecosystem, add key metrics and describe how scalability will be achieved.", "q0r": 3, "q1": "The proposer provides no evidence of relevant skills and experience needed to implement the proposal, including on the website provided.\r\nThe proposer does not identify the type and number of team members required to implement the proposal.\r\nThe budget is not outlined clearly and broken down into identifiable items. \r\nThe budget of is not reasonable to achieve the set goals including 300 million identities activated. \r\nIf the intent is for additional funding there is no verifiable plan in the proposal.\r\nThe proposal offers no timetable to complete the work.\r\nThe proposal does not explains technical aspects of the implementation.\r\nThe proposal does not include challenges and risks relevant to a successful implementation.\r\nTo improve the proposal: provide evidence of skills, detail the team members required, breakdown the budget, identify additional funds required with plan, provide a timetable for the work, explain the technical solution in more detail, include challenges and risks.", "q1r": 2, "q2": "The proposal does not provide a roadmap with milestones and a time horizon for achievement.\r\nThe proposal does not provide metrics/KPIs that define the success of the proposal.\r\nThe proposal provides a moderately clear understandable description of the targeted problem.\r\nThe proposal provides a high level clear understandable solution that addresses the problem.\r\nTo improve the proposal: provide a roadmap with milestones and a time horizon, provide metrics/KPIs.", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 19, "ne": 8, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "This is a marvelous solution and an all round well though idea for deploying Identity in a part of the world that needs that next step to develop and build on. More information is required to assess the stages of developing the idea into a workable platform. ", "q0r": 3, "q1": "Although is a well developed idea there are not much clarity as to the developments, goverments connections or plans required to get there. What are the relative financial, governmental and regulatory agencies will be approached to present such a platform for it to be onboarded in a national level.", "q1r": 2, "q2": "Although the skeleton of the idea is there some of the important aspects are missing, kpi and how are the funds will be used or distributed in the tasks involved in cementing the solution presented.", "q2r": 2, "assessor": "z_assessor_594", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "This proposal addresses the problem in Africa and offers solutions that could have a positive impact on the Cardano ecosystem. The idea explained in detail in the proposal could add value to the Cardano ecosystem if implemented. Because there are no KPIs, it's hard to compare KPIs with challenge setting and it's not able to scale and address future challenges.\r\n\r\n", "q0r": 1, "q1": "The proposal provides a link from a website where we can get information about the people and NGO behind this idea. But unfortunately there are no presentation of skills, knowledge and necessary experience with which this idea could be realized and we do not have a clear insight into how many people would work on this project. It would be good to open accounts on social networks as proof of existence. The proposal states a budget for which it is not clear how it will be allocated for the realization of this idea. If they had more information on how the budget will be distributed, we could make a conclusion whether it is realistic budget. The proposal does not state the plan or details of actionable tasks and also the order of execution and lacks realistic timetable to complete the work. We do not have a clear insight into what resources and technical aspects are needed for implementation, and unfortunately no possible risks are mentioned.\r\n\r\n", "q1r": 1, "q2": "Unfortunately, the roadmap with milestones is not presented in this proposal and clear time frames are missing. The KPIs are not listed and the community due to lack of data can not in any way track the progress of the proposal.\r\n\r\n", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "This proposal aligns with the stated goals and intent of the brief:\"Dapp proposals should cover foundational Registry solutions, namely:\r\n\r\nNational ID & Civil Registry, Property Registration, Medical & Vaccination, Education Census, Revenue Service, Business Incorporations, Elections Voting, Customs & Border Control, Criminal Records, Employment Census, Vehicle Registration, Licensing & Certifications.\"", "q0r": 5, "q1": "This project is immeasurably complex, and though the proposers seems competent and sound, there is no indication of the team or an acknowledgement that one is needed.\r\ngiven the international depth and breadth of this ambition, it is unlikely this proposal will be implemented successfully.", "q1r": 2, "q2": "Success, for this project, as defined as: \"Fully build SHiELD's Dapp\r\n\r\nBuild a reliable identity system for the people and governments of Africa to use.\r\n\r\nMass adoption in the country of Liberia as a Test run\r\n\r\nShield system being adopted by schools, and educational institutions across Africa.\r\n\r\nHospitals and medical institutions adaptive Shield Healthcare database.\r\n\r\nThe SHiELD Virtual Identity System is widely accepted throughout Africa\r\n\r\n300,000,000 SHiELD Virtual identity activated by Q3 2023\" does not provide interim specific, measurable, auditable milestones by which the community can judge success or progress toward it. ", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The proposed solution is to create a \"Virtual Identity\" An autonomous identity that guarantees privacy and trust, in which identity documents are secured, verified and authenticated by the participants. Authorization on the cardano blockchain is approved on a large scale in Africa.it is a great idea because it validates a valid form of ID while ensuring privacy and trust, where identity documents are secured, verified and authenticated by the participants Authorised. it fits the sentiment for this proposal", "q0r": 4, "q1": "Proposing solutions given in terms of social power, health devices, feature lists, educational and legal documents. Team has experience on social activities. however an Implementation Plan is not given, please provide one so it can be evaluated. The proposal does not know what and how the exported budget will be used.", "q1r": 3, "q2": "The proposal has not provided any key metrics/KPIs or solutions to determine if the proposal is successful", "q2r": 2, "assessor": "z_assessor_706", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "This sounds like a virtual government on blockchain. A comprehensive idea, from virtual identity, education health, government service, and movement of people and service. This is Africa, where African authoritarian governments has moved to the extreme by shutting social media for electoral convenience. I read the proposal and it state specifically that 'social application will automatically activate a government & censor survey account. This account will be used by government officials to collect up-to-date data'. This is censorship disguising itself as a decentralized application. \r\n\r\nI am sorry but some ideas advanced in this proposal would rather deepen the overly centralized continent, Africa. ", "q0r": 1, "q1": "The proposal is hugely general, it should be specific to a region and advance gradually. Also, success is unclear and difficult to measure as the proposal has not indicated any KPIs as well.", "q1r": 2, "q2": "There can be easy tracking, however, the team should do more to commit to auditing and document their activities as well.", "q2r": 2, "assessor": "z_assessor_727", "no_vca": 15, "ne": 0, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The project's problem statement is rather vague and does not necessarily translate to the challenge. It would be good to refine this in future challenges. Whilst the project clearly falls into the National building DApp category it is unclear how the project will be integrated within the Cardano ecosystem as a whole. Hence I am only Neutral with regards to impact.", "q0r": 3, "q1": "Whilst the website is listed it is hard to determine from there that the team has the technical skills required to implement and run such a grandiose Idea. SSI is something desperately needed in Africa and it is great to see projects aiming to tackle this however I would like to see a deeper technical dive as to how  this plans to be implemented. There also needs to be an accurate breakdown of funds especially due to the amount requested.", "q1r": 2, "q2": "There are no short term roadmap markers that allow for audibility with the only KPI being mentioned in 2023. It would perhaps be better in future funds to target smaller amounts with closer goals. As there is no clear  solution to the problem I disagree that this is auditable.", "q2r": 2, "assessor": "z_assessor_745", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "The proposal understands the lack of digital resources and technology which is hindering the improvement of quality of life in a yet to prosper continent such as Africa. The unified portal for the integration of applications of multiple identities across Africa can be a driving force for the prosperity of people's lives and technological advancement, especially in the blockchain sector. The proposal appears to have all the provisions required to initiate a massive unity and ecosystem. The SHIELD app could be the common entity that all sectors with already existing virtual solutions could make use of. The feature of the Dapp that does not restrict its usage to one particular sector or country provides could therefore spread its wings globally in the later stages.", "q0r": 5, "q1": "The proposer provides the community with a crystal clear description of the Dapp, and how exactly the team plans to tackle various sectors. The idea regardless of how unique and exceptional it is, the proposal lacks information in multiple sections that are required to prove its authenticity. The proposer makes no mention about the mix of the team proposed to work on the Dapp, let alone the technical specifications that might grab the attention of the geeks across the community. Apart from that, the fund being an excruciating amount, there is no elucidated break up of the same. Hence I believe a little more details on these would help the team achieve full marks.", "q1r": 3, "q2": "Several KPIs are in line with the campaign's requirement and the proposal intention to onboard as much as 300,000,000 identities by Q3 2023 makes it easier for the community to determine its success. However many other measurable quantitative and qualitative metrics would have added more insight to the proposal's goals. Even though the proposal comes with an interesting success definition, phase-wise goals would have provided the readers with the timeline they could expect the progress of the proposal to advance. The metrics towards the proposal's end are varied vague and broad, an additional set of well-defined metrics could have had sealed the deal.", "q2r": 4, "assessor": "z_assessor_751", "no_vca": 17, "ne": 8, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "Building a decentralized identity (DID) network. This has always been a core protocol that every blockchain should have. Having a good data warehouse and DID processing protocol will make it easier and more diverse to expand and develop, and apply blockchain to life. There are not many such projects because the amount of work is too great and building the protocol requires people who understand the foundation of blockchain. The proposal to build DID for the community of people living in Africa is also a great direction and in line with Cardano's direction. But Cardano itself is also building its own DID platform, ATALA PRISM, and with good relationships with African governments, it should be quite easy to build a DID on Cardano made by ATALA. If this proposal can be combined with ATALA and do their DID build in with Cardano's datastore then I think that would be great. But did not see the proposal to mention this", "q0r": 4, "q1": "Proposer just said that they are African Union SHIELD Foundation and didn't give a evidence about team member.\r\n I checked in proposal's website and found a team but they don't\r\n have profile link to check. It will be difficult to carry out a DID project without a truly professional and experienced team. Without determining the experience of the proposal team, it will be difficult to assess the feasibility of the project. Especially to build the protocol, it is necessary to have good devs and understanding of the blockchain programming language (Cardano-Haskell). The proposed member has no such person.\r\n The proposal does not provide a roadmap, the goals will be achieved according to specific timelines, and the allocation of funds is not available.\r\n If a team doesn't know what they're going to do specifically, it's very difficult for the project to succeed", "q1r": 1, "q2": "It is completely impossible to audit the proposal because member information is not available, Roadmap is not available, specific achieved goals are not available, funding breakdown is not available.", "q2r": 1, "assessor": "z_assessor_783", "no_vca": 20, "ne": 4, "ng": 12, "nfo": 4, "vca_o": 1}], "solution": "SHiELD Dappは、主要な分野を対象としたバーチャルソリューションであるため、国民や政府の日常的な活動に容易に適応・統合することができます。", "experience": "アフリカ連合SHIELD財団は、アフリカに拠点を置く独立機関で、SHiELD官民ブロックチェーン＆エコシステムを監督・監修しています。"}