{"id": 414139, "author": "migamake", "title": "StablePay - replace StableCoins", "url": "https://cardano.ideascale.com/a/dtd/414139-48088", "category": 26596, "amount": 57700, "description": "Most contractual payments stay denominated in fiat currencies. We need a payment solution denominating payments in fiat, but without financial risks of StableCoins.", "f6_no_assessments": 9, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 7151, "q0": "I love this idea, it’s about a smart contract that conducts a payment in ADA but re-computes it at the current exchange rate from an oracle. Putting such a transaction on Cardano, a user can ascertain the price. The proponent states very well what the problem is “most contractual payments stay denominated in fiat currencies” so we need a payment solution denominating payments in fiat, but without the financial risks of stablecoins. It is a very interesting use case that takes advantage of the using meta-oracle, which would allow us to avoid rate volatility by using a median of prices, avoid dependency on a single oracle provider, and increase service availability and stability even in case of a single oracle breakdown. I found the idea very promising, being able to bring a new payment solution without the financial risks of stablecoins. With this, the objectives of the challenge would be fully achieved. I think this project is something really useful and can help bring new active members into our community, thus fulfilling one of the specific goals of the challenge. Therefore, I believe the impact would be real, positive, and likely to be very successful, in line with our current goals.", "q0r": 5, "q1": "The script is good, the author explained in detail the tasks that are developed according to the passage of time. The schedules are explained in the action, where we could understand which activities would be developing each month. In that regard, there isn’t much to complain about. In the script, they divide some objectives that need to be accomplished in 6 months, and what would happen each month in the process as a whole. Now talking about the budget, a total amount of 57.7 thousand dollars is asked, which is explained in a somewhat confusing way. “Development of meta-oracle and payment smart contracts - 30k”. How much would it go for each? How many hours of work would each task, do so that we can get an idea of the price of the hours of work and conclude if the value is fair or not? “Compliance and legal services - 20k”. If so, what would the services look like? Who are the people who would work on this part? What would their work routine be like? In general, we get the total amount of $57,700, but we don’t know if these parts would need to that cost. In short, all values should be better explained clarified. Regarding the team, I think that’s the best part of feasibility because we are given their names, a very brief description of their professional roles, and their LinkedIn profile, where we can get to know them in more practically way and direct. But I think it would be better if we knew how they relate to the Cardano ecosystem. So I think the feasibility of this proposal is good, there is a roadmap, the budget breakdown is explained in a relatively basic way, and the team’s presentation is satisfactory.  ", "q1r": 4, "q2": "The auditability of the project is not bad, but at the same time, it needs to be deepened to be adequate. Some indicators are mentioned that would serve to monitor how the project development process would be happening, as the author pointed out. However, the proposal does not outline ways in which we could monitor the project, it does not provide KPIs, metrics, what would be the partial results that would need to be achieved little by little for the proposal to be considered a success… For this part to improve, it would be necessary that he left the script more detailed, so that we could have a clearer view of the process and with that more conditions to follow it, monitor it to know if what was promised was fulfilled in the right way. Afterward, it is also necessary for the proponent and his team to update the Cardano community periodically (preferable monthly) on how things are going, both quantitatively and qualitatively. This must be done through direct contact with the community, using any of the various possible platforms (telegram and discord channels, online tools, etc). And concerning the final result, I found the visualization of the success scenario to be superficial. The desire here is to the public this plan and “demonstrate and document expected cost of launching a payment service on Cardano blockchain”. I wonder how would such information be monitored and how would it become known to the Cardano community? I think the proponent needs to outline ways to verify such a scenario and prove that such impacts happened through examples. In general, I think the auditability of the project is ok, but it needs more detail on how the information would reach the Cardano community and more detailed explanations of how the success scenario would be perceived in reality.", "q2r": 3, "assessor": "z_assessor_2879", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2753, "q0": "\"The challenge of the challenge is that by any means we can provide a financial legal service. In order to meet the requirements of the challenge, the proposed team has provided a service for the challenge. allows payment in ADA, but calculates the exchange rate at the time of this action,\n  by receiving information from the oracle that provides the smart contract as a transaction condition for that contract, and a more secure solution for the information provided ensures data validators data from 3 oracle platforms, but this problem I think if to receive information from 3 different oracle platforms to make it more secure is natural, but this can lead to delays for the current exchange rate request because in order to receive 3 consecutive information, depending on the transmission speed of different platforms in time, this solution will request the fastest information or will it classify the information. Only then will you satisfy the legal conditions for the exchange in a smart contract, please explain this part further, in addition, the other arguments are logical and easy to understand.\n Most of the risks are mentioned and there are also preventive measures of the offer. \"", "q0r": 4, "q1": "\"The timeframe provided by the proposal is appropriate to achieve the stated objectives, milestones are established month by month, commitment in 3 months will, after completion of the research period, deliver the solutions legislation for regulators and attorneys to assess potential risks.\n    At the same time, the disclosure of expenditures is also reasonable, clear, with specific evidence, consistent with the common ground,\n    In the group information disclosure section, 4 members were provided with the identity of documents related to the individual such as experiences and links on the social networking site, but there was no assignment of tasks to each person. , to make sure each member does what, for example, our community has questions or concerns that can directly interact with that member in the work they undertake.", "q1r": 4, "q2": "\"The success of the proposal has not been clearly defined, only generalizing the legal framework conditions but not the proposed statement, which will create the premise for transaction services for users. The proposed team needs more affirmation of its claims to provide additional network service impacts,\n  in addition to the proposed metrics provided, and a pledge to support the community on the proposal's website. In my opinion, that is not enough initiative of the proposed group to serve the community, so there are updated reports on the progress of ideas and make them available on the most popular websites, which will better.\"", "q2r": 3, "assessor": "z_assessor_2352", "no_vca": 14, "ne": 2, "ng": 6, "nfo": 6, "vca_o": 1}, {"id": 5995, "q0": "Overall the idea of ​​the proposal fits the \"Legal & Financial Implementations\" challenge but there are a few aspects we need to discuss here. Basically, the idea is to build a smart contract that makes payments. equal to ADA. The price of ADA will be taken as the average price for a certain period of time. Oracles will be responsible for providing exchange rates from exchanges into this smart contract. The project will build a \"Meta-oracle\" that has aggregate functionality from at least 3 oracles in the market. As for the impact side of the idea, I think will bring little value to emerging projects in Catalyst because of the usefulness of the proposition. The crypto market is not always full of price risk because of its high volatility. When we look over a period of time to calculate the average price, the price nature is still subject to volatility but only to reduce its fluctuation range, this has not yet solved the stability of payment for all types of delivery contracts like buying and selling goods, stability must be guaranteed to every zero after the comma. Thus, on the whole, this proposal will not be generally applicable to the emerging projects in Catalyst.", "q0r": 3, "q1": "I do not agree on the feasibility of this proposal because there are several issues we need to discuss here:\n- First about budget breakdown: the proposed team has not yet stated the cost for each work to be done. Specifically in \"automatic monitor that writes meta-oracle data\", the proposed team offers a cost of 1.2k but how long does it take to produce an automatic monitor, the salary per hour of work is how much but total cost is 1.2k?. Same goes for other work items like \"compliance and legal services - 20k\". Therefore, I suggest that the proposed team should be more detailed in these work items, this will help the community have a more detailed view of the implementation costs.\n- Second about the roadmap: I think the time to build the synthetic oracle and provide the price for the smart contract only takes about 1 month is really very short. Because Oracle is the most important part in the blockchain space. The mechanism against currency manipulation has to be well-built and usually takes a long time to implement (in my experience 6 months or more for basic protection functions). Therefore, I advise the project that we should spend more time building oracle as securely as possible.\n- The third is about human resources: in general, we have experienced software developers and business analysts, but I think it is necessary to add more resources to develop the project's communication segment.. Because no matter how good the project is, bad marketing will lead to less attention from users.\nIn the end, I think the team recommends developing more promotion strategies for different user community groups. The guiding question is can this solution be used anywhere in the world?", "q1r": 3, "q2": "On the audit side of the project, the proposed team provided us with complete information about each team member through links to each person's profile page. But besides that, there is still some more information to be added because when looking at the milestones to measure the success of the project, the proposal team has not been able to concretize it into numbers. that we can simply measure by tracking code update progress on the website or Github. For example update frequency is 2 times/week and continuously until smart contract and oracle testing phase. Or target the number of users participating in the test, such as having #50 users sign up to participate in a product test.", "q2r": 4, "assessor": "z_assessor_2771", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6642, "q0": "There is a straightforward problem that this proposal wishes to solve - the ability to pay a certain amount of fiat (USD, GPB, etc), but the payment to be processed in ADA, at the exchange rate applicable from that point in time. For this, it is necessary to develop a smart contract and to use an oracle solution. Since the existing oracle solutions (ChainLink, Ergo and Wolfram) are still in development, the team also proposes to develop an in-house oracle just as a test basis for the smart contract. \n\nSince the project would bring to life a module that can be inserted in a payment solution and that it would be an off-the-shelf integration solution, it matches very well within the existing challenge and has excellent scalability potential. ", "q0r": 5, "q1": "The team behind the proposal consists of four members. We have Michal and Francesco, both with a software background, then Patrick, a lawyer, and Szymon, a business analyst. We are thus observing a rather broad background, which is excellent news considering the project’s blend of development and necessity for compliance since we are talking about a module from a payments solution.  \n\nTimewise, the project can be implemented in three months, followed by an additional three months of “sandbox” solution to be showcased to lawyers / regulators / etcetera. During the first month the oracle and the smart contract would be built, the second month would see the automated oracle and payment API come to life, while in the third month the integration with the CIP-0030 wallet would be executed. \n\nAnother excellent point of the proposal is that it sets aside a very modest budget for exploring the opportunity of engaging in a third party security audit at a later stage. This is especially important since IOG has recently released a video outlining the future of Cardano dapps, especially offering details regarding how their security would influence the way in which the dapps will be displayed on the upcoming dapp store. This highlights Cardano’s increased focus towards greater security, and the fact that this proposal sets aside a very significant portion of the budget for a third party certification is definitely an advantage over other dapps which will soon have to compete for “prime space” within a dapps marketplace where being certified will matter a great deal. \n\nThere are a few points which are rather unclear. First, the costs for developing the in-house oracle and the smart contract are bundled together for 50% of the overall budget. Given the fact that the oracle is only functioning as a temporary solution, it would have been a better solution to isolate its budget under a unique caption. In its current form, we cannot be sure if the 50% budget would go 50/50 for instance towards the smart contract and the mock-oracle, or 90/10, or 10/90, it is therefore difficult to judge the value for money obtained by each of the two modules, given that one of them is the core value proposition while the second is a temporary crutch. An additional 30% would go towards legal services, which is perfectly understandable considering that we are talking about a module from a payments solution.  \n\nOverall this is a highly feasible project, with perhaps a few more questions than necessary with regards to the choice of building an in-house oracle and how much resources would this necessitate, which is rather unclear. ", "q1r": 5, "q2": "The proposal delivers good results in its auditability sections. The team pledges to have a web page for the project, with regular updates, hashes made available of the deployments (although I am personally not sure why hashes are necessary here), as well as updates from the compliance front. This being a proof of concept project, the team sets as success measurement simply being able to demonstrate the idea’s feasibility and offering a flavor of how much it would cost to launch on the mainnet. Another valuable point is that the legal and compliance analysis performed during this time would be made available to the Cardano community. \n\nConsidering all of the above, we can say that this project is in a good position to deliver a transparent implementation of the smart contract + oracle that they wish to develop.  ", "q2r": 5, "assessor": "z_assessor_2824", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6957, "q0": "    - For users to have absolute peace of mind about their payments, improving security and being risk-free is of paramount importance. With the idea of ​​StablePay - replacing StableCoins. I think if this idea is successful then that's a great thing.\n    - Here the group raised the issues that are. Most contract payments are denominated in fiat currency. but We need a payment solution that pays only in fiat, but without the financial risks of StableCoins. I found the group to have raised the issues very well. If this proposal is successful, it will solve the anxiety in the risk problem that users face.\n\n    - To solve the above difficulties, the group has raised its solutions. The team will propose a smart contract that makes the payment in ADA, but recalculates it at the current exchange rate from an oracle. from here will place such a transaction on Cardano, the user can be sure of the price. Two smart contracts that are Meta-oracle will provide the exchange rate. and a settlement contract that uses the exchange rate to transfer an amount of ADA denominated in fiat currency. I find the solutions that the group has outlined to be very suitable for solving the difficulties in the challenge. With these solutions I believe the proposal will succeed in seeing the StableCoin position.\n\n    - Besides, the group also raised the risks that the proposal may face. concurrent use of oracle data by multiple payers. and user failure to comply with and satisfy regulatory risks. however, the group has also suggested solutions to reduce those risks in a very reasonable way as stated in the proposal. I find that to be enough.", "q0r": 4, "q1": "    - In the section outlining the progress of the project and important milestones. Here I see the team has identified a specific milestone. That will complete the plan in a period of six months. With the above time period, I think it is reasonable to complete the proposed tasks. The progress of the project has been divided into 6 milestones\nThe goals and results to be achieved are clear as stated in the proposal, which I find very reasonable.\n\n    - With Please provide detailed budget breakdown. With a total budget of $57,700 and has been broken down into six different categories such as costs for Meta-oracle Development and smart contracts, Meta-oracle Auto-Writing Monitor, Legal Compliance Services, Analyze and schedule project launch, quote for software security tests. I find it very reasonable with such a divided budget. Through this, it is also seen that the proposed topic has calculated very carefully the costs.\n\n    - About providing detailed information about the people who will work on the project. Here I see the group that has listed four members. There are specific tasks assigned to each member. Through reviewing and researching, I found that the capacity and experience of each member is very good. However, the identity of each member is not easy to verify.", "q1r": 4, "q2": "    - In the description of what you will measure to track your project progress. There have been a few indicators raised out of which four are the main ones that are 1- smart contract implementation steps, 2- euTxOs to verify the test transactions are done, 3- update on the implementation provides compliance analytics with links to results documents, 4-videos of billing demos. I find such indicators to be complete and specific. However, it is not easy to check and measure these indicators.\n\n\n    - With the description What does the success of this project look like? Here I see that the group has not listed many success indicators. However, the team does promise to document the project's plans transparently. The project is currently still waiting for funding, but no phase has been put into actual testing.\n\n\n    - In the funding section. This is a new proposal and has never been funded. However, during the evaluation of this proposal, I found that the idea in the proposal is very good, if successful, that is a great thing.", "q2r": 4, "assessor": "z_assessor_2856", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1}, {"id": 7976, "q0": "The creators of this proposal offer a payment solution that declares payments in fiat, but does not foresee any financial risks from Stablecoins. The makers want to introduce a smart contract where the intention is that you can pay with ADA. The current exchange rate will then be used for this. A StreamCardano-driven payment API server will also be used here. This project will have a major impact on people who would like to pay with cardano. The proposal already takes into account the various future challenges such as ensuring compliance and integration with the existing financial structure. A few potential solutions have already been envisaged, such as a compliance survey with renowned experts from Singapore's financial sector.", "q0r": 5, "q1": "The team that will develop this project is described in the proposal ( MigaMake Pte Ltd). This team consists of 14 members with relevant experience to develop this project (DevOps engineer, Frontend Developer, Web Strategy,... ). They also have 5 Alumni who have gained experience in their company. The proposal only lists Michal J. Gajda (CEO), Zarak Mahmoud (Junior Haskell Developer) and PD. The advantage is that the people who are going to work on it can always ask for help from people who work in the company. A budget plan has been included that states how the funding will be used. However, the amount requested does not correspond to the detailed breakdown of the budget. It would also be useful to write out the breakdown of the budget in even more detail, including the number of hours needed to reach a milestone, how many months it takes to complete a milestone, ... It has already been taken into account with the challenges and risks. Solutions have already been offered such as hiring reputable experts.", "q1r": 4, "q2": "With the proposed feasibility study, Cardano can assure that it is possible to replace StableCoins and fiat payments. There is a limited road map with some milestones. This roadmap could be a little more comprehensive. Using clear deadlines would be helpful. There are a few KPIs included that will appear on the project web page so that people are notified (payment demos videos; smart contract implementation hashes,...). It is good that everything will be provided publicly. Legal and compliance analyzes will ensure good transparency towards the outside world. This proposal offers a very clear solution to the requested problem. The feasibility study will be very important to determine the success of this project.", "q2r": 4, "assessor": "z_assessor_2940", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8382, "q0": "The solution of the project is to provide a smart contract solution that contributes to avoiding rate volatility by using a median of prices,\navoid dependency on a single oracle provider,\nincrease service availability and stability even in case of a single oracle breakdown.\nTherefore, I believe that the project is quite aligned with the challenge presented, emerging projects can use the solution to support financial-related problems, limiting risks during project implementation. his judgment.\nThe author also analyzes the risks of technical issues and compliance satisfaction quite carefully and offers reasonable solutions.\nHowever, I think it would be better if the author could describe more closely how the project works and give some technical examples so that the reader can easily know the highlights of the project.", "q0r": 4, "q1": "The roadmap of the project lasts 6 months, and the work to be done at each milestone is mentioned. The budget is allocated quite reasonably with the plan above. I am also quite impressed with the team when the experienced members related to the project such as law, blockchain, software, and detailed information about the team members are also mentioned in detail in the project.\nHowever, I think it would be better if the author could add specific results at each timeline of the roadmap, and how to do these work items, for the budget part, it's quite general now. In general, it should be broken down in more detail, with references to the estimated number of people needed, the number of hours completed, as well as the unit price per hour of the work items.", "q1r": 4, "q2": "Unfortunately, the audit part of the project is not specific. There are currently no criteria for the community to determine the success of the project.\nThe author should add the elements necessary to describe the success of the project in more detail.\nIn addition, ways to track the progress of the project have been presented, but there is a lack of quantitative KPIs for each specific timeline so that the community can monitor and evaluate the progress of the project.", "q2r": 3, "assessor": "z_assessor_2979", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8994, "q0": "This proposal would help to improve the Cardano ecosystem by determining the legality of a non-stable coin payment system that uses ADA while automatically determining the value in fiat, like USD. This proposal will not culminate in a usable payment system, just a report about how legal and secure a usable payment system would have to be and how to create one. This \nReport would then set up another proposal in a future fund to go through the process of creating a stable, fiat-based payment system using only ADA. Therefore while I can see the necessity of this proposal, it feels like the impact to the challenge would be delayed and not realized during this fund. But the idea is solid.\n", "q0r": 4, "q1": "The team who is proposing this is made up of a development project named migamake. This project team has many skilled team members. The team is clearly experienced and capable of following through on the project plan. They have completed many projects in the past. However while the budget is present, it lacks detail to determine exactly how the funds are to be used. There are general budget lines containing thousands of dollars. For example, 27K for “Development of meta-oracle and payment smart contracts,” and 25k for “Compliance and legal services.” It would be good to offer an hourly rate so the amount of work planned can be assessed properly. Overall it looks like the team has a plan for how to use those funds, but it makes it difficult to assess whether or not this proposal is fully feasible.", "q1r": 4, "q2": "This proposal has few metrics that they will measure to determine whether it is a success. They will be posting their compliance report and plan for creating a stable payment system. They plan on updating their progress on their website. They could have been more detailed in how they presented their metrics. How do they plan to measure them, for example. Overall this is a solid proposal, but could have provided more details. ", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 10285, "q0": "\"Most African businesses doubt the inclusion of Cardano technology in their business. Leveraging an existing project of that size as a contract is denominated in fiat currency will provide a test platform that can be scaled upon success and acceptance. but without the financial risk of StableCoins.\nThe\n+ Add tags...\nbusiness\nfiat\npayment-api\npay\n\n\nA good proposal targets a smart contract that makes payments in ADA, through an internship. With presented Migamake.com is a software company founded in Singapore in 2017, after its founder left his position in the risk department of a major international bank.\n, it looks like more African students will benefit from the implementation and this will significantly contribute to the growth of Cardano in Africa, mitigating the risk for a payment solution\"", "q0r": 4, "q1": "\"The action plan for the implementation of the project is clearly and clearly outlined The solution includes a smart contract:\nmeta-oracle of exchange rates, updated daily,\na settlement contract that uses the exchange rate to transfer an amount of ADA denominated in fiat currency.\n\nMeta-oracle will provide exchange rates from at least 3 oracles, including:\nchain link,\nErgo,\nWolfram.\n. Also, Using meta-oracle, StreamCardano based Payments API Server,\nUI for placing the checkout button on the website.\n\n The team has very rich experience to see to the end and success of the project.\nThe team has brought together diverse experiences in business skills that, when combined with blockchain technology will improve businesses and provide new opportunities., The proposed Feasibility Study will allow Cardano to secure that we have an alternative to both stablecoins and fiat payments.\n\nThe hardest part is ensuring compliance and integration with existing financial infrastructure:\nfull compliance costs are too high., the project is extremely low risk from a technical point of view, However, this risk will be eliminated thanks to the \"\"Reference Data Input\"\" CIP-0031 which allows the use of parallel read-only eUTxO data by multiple contracts\"", "q1r": 4, "q2": "\"Success Indicators are tangible and measurable The project website will host regular updates on the project that have been mapped out to audit and monitor project progress.\nYes, the goal of the proposal is well-scoped and measurable. eg\nsmart contract implementation steps,\neuTxOs to verify the test transactions made,\nupdates on providing compliance analyzes with links to resulting documents,\nvideos of payment demos\nThe information provided for the assessment is clearly formulated and presented for monitoring and evaluation. The result of this feasibility study is a project plan that will be made public\nable to demonstrate and document the expected cost of launching a payment service on the Cardano blockchain\nLegal and compliance analysis will be available for review by interested parties and submitted for the next project on Cardano Catalyst\nThis is a new project I wish you luck\"", "q2r": 4, "assessor": "z_assessor_3171", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "We propose a smart contract that conducts a payment in ADA, but recomputes it at the current exchange rate from an oracle. Putting such a transaction on Cardano, a user can ascertain the price.", "experience": "Migamake.com is a software house established in Singapore in 2017, after its founder left his position in risk department of major international bank.\nWe feel competent in the area of decreasing risks for such a payment solution."}