{"id": 416918, "author": "mplomin", "title": "Mehen: USDM State Regulatory Fees", "url": "https://cardano.ideascale.com/a/dtd/416918-48088", "category": 26596, "amount": 26578, "description": "Cardano needs a fiat-backed stable coin that can be directly converted into fiat 1:1 as an alternative to algorithmic stable coins, and to support those who prefer or need a direct-to-fiat bridge.", "f6_no_assessments": 9, "f6_rating": 3.5185185185185186, "videos": [], "media": [], "f6_assessments": [{"id": 6672, "q0": "Stablecoins! What a divisive topic amongst blockchain enthusiasts. The value proposition here is the creation of a Cardano based stablecoin backed by (and convertible to) fiat. But the proposers are asking for funding for a very limited use case - the license fees for several US states, which are necessary for making payments.  \n\nCompetition is always a catalyst that fosters innovation, drives costs down and increases consumer utility, and I fully embrace it. So in theory yes, having an alternative to the DJED stablecoin, already in testing, is a great thing to have. However, in this case, we have in front of us a value proposition that does not touch upon very critical aspects of the business model. \n\nHow far in the development is the team if they are only asking for license fees? Have they launched it yet? Do they have the technical team to implement it? Do they have the financial team to handle the reserves? \n\nWhat about the other infrastructure necessary? To launch the stablecoin you need a very solid investment team in place to handle the money proceeds and invest it into short term bonds, highly liquid and while having a strong risk management process in place. While on the project’s website there is a white paper that lightly touches upon these aspects, the level of detail presented is nowhere near what is needed in practice for such operations. \n\nConsidering the lack of details regarding the business model to be used, we cannot state for a fact that this proposal will be beneficial for the Cardano community. To reach that level, a clear business model must emerge, backed by a solid team and much needed capital. Right now, this is not the case, so only three stars I deem as appropriate. ", "q0r": 2, "q1": "This proposal’s feasibility is insubstantial. Matthew, a chartered financial analyst, is the main proposer, with background in traditional finance in the US and EU markets, including money markets (a very relevant point). But moving past this, the section that should describe the team only references that the team is “fully doxxed” on their respective website. Sadly, the website does not offer any additional details regarding the team, we can therefore not be sure of the existence of any other relevant team members so far. \n\nTimewise, things are rather simple, at least at first. The proposer expects to be able to launch each request for license soon after receiving funding, while the results should come in at most six months later, depending of course from state to state. But I am not convinced that this will be the case: handling 20+ state licenses, with different deadlines, necessary documentation and applicable legislation is a massive undertaking, and we know from above that we don’t have a proof of a solid team behind the proposal, or the money set aside to hire a consultant to help with this task. So how will it be performed by a single person? We are not being told. \n\nThe budget is very simple to explain too: it will cover licensing fees in many of the US states, with fees ranging from 100 USD to 2.000 USD. While this is clear, nothing else is when it comes to the budget. Why, you may wonder? Because the task of launching a fiat-backed stablecoin and aim towards full redeemability in many of the US states is an enormous challenge, and it needs massive amounts of capital and technical competence, nowhere near what we are being demonstrated here. Let’s take the biggest stablecoins and see how they function: in practical terms none of them is redeemable by the retail investor. For USDT, users must pay 150 USD for a KYC verification and the minimum amount to redeem is 100k USD, while USDC is issued and redeemed via Circle and Coinbase, again, not by retail investors. \n\nConsidering all the major red flags above, I think two stars are appropriate, since it is unlikely that this project can be implemented successfully in its current form. ", "q1r": 2, "q2": "The proposer begins the section by stating that the project would have its progress measured individually for each state’s license application, and that success would be achieved if a favorable outcome for each state. While these details are necessary, they are definitely not sufficient, since a true transparency for this proposal would be ensured if and only if the entire project would be transparent for the community, and we have many missing links. Just a few examples. First, a crucial element is missing: we are being informed that Mehen, the project, is registered and able to operate in 3 states. If this is the case, how is the business going? Have they been able to issue the stablecoin yet? What would be the added value of obtaining 20 additional licenses, while still lagging in terms of stablecoin development?\n\nAgain, we have in front of us a rather unconvincing section of the proposal, and we cannot be sure that the Cardano community will be in a good position to track the development of this project, if implemented. ", "q2r": 3, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 7156, "q0": "The idea of the proposal is great but it is not clear how it could meet the objectives of the challenge. It can be very summarized in the following excerpt: “Cardano DeFi urgently needs a fiat-backed stablecoin, and Mehen is building that coin following the best practices demonstrated by Circle’s USDC. The Mehen USDM coin will be directly-convertible 1:1 for USD, and is backed by fiat assets”. The proponents intend to create a fiat-backed stablecoin that has several moving parts. It is also clearly very beneficial for Cardano DeFi, as people could easily and cheaply buy and redeem stable coins. However, it is not clear how this project could help the other Catalyst projects broaden their horizons and increase their impact on the ecosystem once legal and financial frameworks. For starters, what is “fiat”? I think this idea would fit better with the Dapps challenge, for example. Therefore, as much as the fiat-backed stable coin is useful for Cardano, it would be meeting only one of the facets necessary for the challenge to mint new coins for $1 and sell them on-chain, with that, I will, unfortunately, give a low note for the impact.", "q0r": 2, "q1": "The presented script only gives us an idea of what would happen, because the time interval chosen is very confusing (for example, the first one is “immediately”, the second phase is “90-120 days”, and the final phase is “3-6 months”). Besides that, all the information we needed to know about it is provided in a very basic way. Regarding the roadmap, the proponents explain what would be done, but the establishment of the schedule is superficial. The description of the activities is done in a very summarized way. A single sentence explains each one of them, without the proper detail, we cannot understand in a deep way what will happen, or how these things would be done exactly. Another observation is about the temporal division. It is said what would happen immediately after funding successful this project, and then in the next 3-4 months and finally 3-6 months. In my opinion, this timeline is abstract because I believe that the funding of this fund would only be distributed in an approximate timeline. But anyway, the time division is very macro. In addition, we don’t know what activities would be carried out. Who would work on them, what their work routines be like, etc? Now speaking of the budget, it is very superficial and confusing. What are these indicator symbols: ID, MO, UT, DE, DC, ME, NH, NV, LA, MS, ND, AL, IN, NE, OR, VA, WA, WV, KT, MA, IA, NC, RI, SD, KS, AZ, CT? Maybe I’m not a Defi expert so I do not understand what kind of those symbols are, but I think each symbol must be very well explained. Because I’m unable to understand with solidity and specificity how the requested budget would be used. Besides that, I also don’t know who would work here, how many hours the professionals would work on this, what would their working hours be, or how much would the price of the work hour be, so that we could see more concretely if the amount asked is fair?... Regarding the team, the proponent just claims that “the team is fully doxxed on Mehen.io.”. And from what I found out on the website, I think this part is perfect, knowing in detail who the team members are: their names, areas of activity, a small resume, and their LinkedIn profile, Twitter, and email are also available where we can verify all the information said about the. We also have Cardano experts on the team which make sure we have someone very knowledgeable about our ecosystem. but overall, in terms of feasibility, only 1 of three topics is satisfactorily detailed, and the others parts need to be improved a lot. ", "q1r": 2, "q2": "The ways to audit progress are very superficial. The proponent claims that progress tracking would be done through each state’s licensing path. But how could the Cardano community monitor this? In fact, we don’t know what needs to happen, when it would happen, and I don’t see clear ways in which the community could verify this licensing path in each state. So I think that it would be better to follow the development of the activities if the script were better organized in time, and if each of the activities was better detailed. And in order to properly monitor the construction of this part, there would have to be ways to audit the task and the partial results, not just the paths or the goals. Therefore, I consider that the audit of the process is quite inadequate. Regarding the final results, I found the information provided here to be too superficial: “Success is promptly receiving a favorable outcome from our licensing examinations”. The said information is extremely abstract, basically there is no specific goals, measurable objectives. The proponents do not define KPIs, metrics, quantitative and qualitative data that make it possible to safely monitor the project. In other words, I think that this part of the proposal left a lot to be desired, the proponents do not provide enough and adequate information so that we could follow neither the development nor the results of this project. So I think there is a lot of to be improved in this part of the proposal. You should outlined exactly how the community will have access to all the audited information and you should also think more objectively about how to see if the intended success has been achieved. In my opinion, this topic would need to be reviewed and improved a lot.", "q2r": 1, "assessor": "z_assessor_2879", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 1051, "q0": "The team behind this proposal is working on a Cardano stablecoin, named Mehen, after the Egyptian name of the Ouroboros snake. In their proposal, they are requesting funding for covering the fees for Money Transmitter License within 27 states. If successful in obtaining these licenses they can start operating in these states and achieve stable values for the USDM stablecoin.\nThe need for a stablecoin on Cardano is obvious to a lot of people not just in the Cardano community, but also within the smaller Catalyst community as well. As such, I agree that this proposal would be highly welcomed in the space.\nWhat I find particularly important in the case of this proposal, is how they covered the risk section. They have provided a long list of potential risks and challenges, and for each one, they have carefully considered the solution. Especially considering the anxiety in the blockchain space, ever since the de-pegging of other stablecoins, approaching this subject carefully will convince the community to adopt the asset.\nGiven all the considerations provided, I find this proposal to be highly impactful if successful and I will rate this section a 5/5.", "q0r": 5, "q1": "The proposers have done a great job in detailing what is probably a boring procedure, the application for Money Transmitter License, in a comprehensive and enjoyable manner. The timeline provided depends entirely on each state’s availability and efficiency in generating these licenses, but they have provided some solid time intervals where they expect everything to be ready.\nI appreciate the note at the end of the detailed plan, a warning for others who might be looking into obtaining similar licenses, that online services are providing skewed numbers just to generate fear in their potential customers and convince them to use their services. \nIn the budget breakdown, the team has provided the most extensive budget I have come across so far. They have transparently provided the fixed fees for each of the 27 states they will be submitting in. And I have also done the math, the total amount checks, the entire budget is dedicated only towards covering the fees and nothing else. Further down in the proposal, I read the mention that the team is hoping to cover the remaining licensing fees through the success of the project, which I find to be a very good approach on their part.\nThe team descriptions, photos and LinkedIn profiles are available on the project’s website. Some of the names and faces I have already recognised from within the Cardano community and by judging the other ones that I do not know, I find they are highly skilled and suitable to complete this project.", "q1r": 5, "q2": "For the project’s progress, I find the answer provided, even though short, to be realistic and correct. Since they will be requesting licenses in different states, the progress will be measured according to each state’s licensing path. Perhaps the mention of a document/spreadsheet that the community would be able to glance through from time to time would have been a perfect answer, but I don’t find this information to be too significant to lower the score, as the data is probably public on the issuer’s website anyway.\nThe same observations apply to the success definition. Receiving the licenses in all 27 states would definitely prove that the proposal has been successful.\nAs such, I find the proposal to be easily auditable, in both judging its progress and its success.", "q2r": 5, "assessor": "z_assessor_2192", "no_vca": 13, "ne": 3, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 1856, "q0": "This proposal aims to buy Money Transmitter Licenses in 27 states of the US for Mehen Finance to offer their permissioned fiat-backed stablecoin in the US. Their stablecoin is nonexistent at this point. They have written two other proposals for the actual development of said stablecoin in the Dapp challenge, so they are no funded proposers yet. In the challenge brief, the description clearly references funded proposers and services to assist these. A stablecoin, if implemented correctly, would indeed be a financial service, but stablecoins are the main target for crypto-related financial regulations in the US. Therefore, it is unclear if this proposal would have any impact as it relies on successful completion of their main proposal, even if they get funded.", "q0r": 3, "q1": "I highly doubt that the team would have the sufficient skills for the extremely challenging task of creating and managing a stablecoin under US law. There are no mentions of auditing the smart contract code before launch, imposing a huge risk on potential customers.\nThe team claims that they're already able to operate in 3 states, but give no proof for this statement. Their website (mehen.io) is a quick compilation of stock images and has NO legal print, a no-go for a regulated entity working on highly sensitive use cases. They indicate that they will create a foundation only when the stablecoin scales. What will happen before that with customer funds? Who is the legal entity/custodian? Who is the trusted third party that enables minting of USDM after the sufficient amount of USD is sent to their bank account? There are no clear answers to these questions in the proposal, and I could only find conflicting information on their website. \nThey claim that their team is fully doxxed on their website. There is one trusted entity of the Catalyst ecosystem on their team: Darlington Wleh from Lidonation. Their CEO appears to be Jilian Plomin, but Matthew Plomin (main proposer) does not show up there in any capacity. \nThere are serious concerns on the trustworthiness of their CMO: Thomas Stokes (@everyepoch on Twitter). There have been reports to the official Catalyst team of scam attempts and social engineering attempts from this particular individual, threatening other Catalyst members. His claims of being a \"founding member of the Crypto Magazine team\" (said magazine is dubious at best imho: only two contributing authors but their very own shitcoin and NO legal print) or \"managing high net-worth donors for The British Heart Foundation, Cancer Research UK, and Greenpeace\" cannot be ratified. The fact that the Mehen team has chosen him as CMO raises even further doubts on the integrity of the Mehen team and their ability to successfully register and launch their stablecoin. As the development and existence of USDM is a prerequisite for the success of this proposal, it is very unlikely that they will complete it successfully.", "q1r": 1, "q2": "They claim in a one-liner that they will report their progress along each state’s licensing path, but offer no additional information on how these paths might look like, how to check on their progress or how they would report back to the community. Furthermore, they do not define what a \"favorable outcome\" means (their only criteria for success of this proposal). It is therefore hard to audit their progress. ", "q2r": 2, "assessor": "z_assessor_2275", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2963, "q0": "The idea of a fiat-collateralized stablecoin for the Cardano ecosystem is an ambitious one with obvious potential utility. It is not obvious to me that this is a market need for another fiat-collateralized stablecoin (in addition to ones like USDT, USDC and BUSD), but that market uncertainty does not change the fact that this is an innovative idea that fits well into the scope of this challenge. The Mehen team appears to have made good initial progress towards launching its coin, and if it were successful the impact could be substantial. ", "q0r": 5, "q1": "The Mehen team appears to have made good initial progress towards developing the infrastructure for its coin. Furthermore, the focus of this project is on obtaining licenses in ~27 states, and Mehen claims to already have authority to operate in 3 states and has set out a reasonably detailed plan for obtaining the additional licenses.\n\nThe proposed budget appears to be only for the regulatory fees for obtaining the additional licenses (and has provided a state-by-state breakdown of costs), apparently meaning that the team is not proposing to charge for its work to obtain the licenses.\n\nMy one concern is that launching a stablecoin is a complex process, and there is only limited explanation of how the proposed regulatory work will interact with the overall stablecoin process. Furthermore, there is fairly limited information provided about the team. This is limited to a reference to information on the Mehen.io website, which itself only includes LinkedIn links. Also, the “summary of relevant experience” in the proposal refers to Matthew Plomin, who is not listed on the team on the Mehen.io website.\n\nFor these reasons, I agree but do not strongly agree that the information provided indicates a high likelihood that the proposal will be successfully implemented.", "q1r": 4, "q2": "The progress metrics in the proposal are limited to: “We would measure our progress along each state’s licensing path.” Rhis appears to be absolutely a correct metric for a project focused on licensing, it would be helpful to have included a list of the key general steps in the license application that will be measured within the auditability section. However, it seems fair to assume that the three licensing milestones listed in the feasibility section are the ones that will be measured. Therefore, I can strongly agree that this proposal provides sufficient information to audit its progress.", "q2r": 5, "assessor": "z_assessor_2374", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6586, "q0": "This proposal is presented as a request to obtain funds in order to cover the State Regulatory Fee on the implementation of a Cardano stablecoin. In this case, the proposer identifies a problem that is the lack of a stablecoin in the network, which could provide many of the emergent project tools by the time they got funded. The volatility associated with the ADA token is still a problem when projects get funded and here resides the impact that this project could have on the environment. This proposal fits into the challenge settings because it would be clearly beneficial for those projects who are recently founded and cannot find help in legal frameworks and regulations but don´t want to be exposed to volatility. (Ranking given: 5)\n", "q0r": 5, "q1": "Since this proposal is about a project that has already been able to operate in 3 states, this is an actual stage of their milestones road map. The timeline of each milestone depends on each state, so it requires a certain amount of flexibility because it is a process that could take more time than expected. The proposer team is formed by experienced people that have already proven their abilities, which is why this project is so far registered in 3 states. Regarding the budget, it is classified and is fully orientated on covering licensing fees for each state, which makes it clearly specified and simplistic enough to be understandable by anyone. If an objection should be done, it must be focused on the lack of a plan to reduce the uncertainty related to knowing if the project would work or not with only the 27 states registered. (Ranking given: 4)", "q1r": 4, "q2": "Due to the qualities of this proposal, it is simple to track the progress and measure the success of the project. It only requires analyzing the outcome of each state licensing examination. If it is positive, then the project is able to operate in that state; if it is negative, the team should examine why wasn´t it approved and how could it be done to reach that approval. Thanks to the alignment between this project´s objectives and the settings of the challenge, the success of Mehen is beneficial for the Cardano environment and for every emerging project that requires a stablecoin. (Ranking given: 4)\n", "q2r": 4, "assessor": "z_assessor_2822", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8388, "q0": "Creating a stable coin is the next development step for all cryptocurrency in the market, and this proposal aims to satisfy this needs and facilititate people in their crypto transactions. The author is able to present his project clearly and the impacts towards Cardano community as well as outside stakeholders. However, in the project description, they should provide more information on how their solution is matched with the challenge instead of raising the cost issue of solving legal obstacles, which should be mentioned in the next part. It is good that they have informative forecast for risks which could be happened in the process and their solutions corresponding to each case.", "q0r": 4, "q1": "First of all, it is highly evaluated that Mehen was registered before and became legal in three states already, therefore it can contribute to gain more trust from community with the very first impression. Moreover, it can be said that the writer is capable of delivering a very informative project, specific milestones to achieve and clear outcomes for each phase. They also study further about many service providers and find out the suitable one for the project (avoid high-fee providers as well). Based on their research, the license fees in each state are provided reasonably in the breakdown cost. For attending members, after visiting their website mehen.io, I am very impressed that the page is built awesomely with all necessary information represented logically. In particular, team members are listed very interactive, together with their personal career achievements suitable to the project which is a bonus for them to raise more funds in this round.", "q1r": 5, "q2": "For this part, they can do better by giving us more information about each state procedures for the license. More importantly, their purpose is to create the stable coin for Cardano community so I consider even if they finish getting all licenses in the states, it seems not good enough to assure the coin will be linked with Cardano, the author has to explain more how they can make community to accept this coin as well. Therefore, I do not agree that the successful project will come when they get the outcome licenses because the coin must be approved by the community and until it has strong connection or better inseparable to Cardano, it can be considered as accomplished project only. To face the truth, getting the license is just the first step and they have to do many more after to reach their expected result.", "q2r": 3, "assessor": "z_assessor_2979", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9008, "q0": "This proposal seeks to further the compliance of a fiat-backed, US dollar pegged stable coin by  applying for license in every US state. They have already completed this process in three states. The successful completion of this proposal would add incredible value to the legal and financial nature of the Cardano ecosystem by creating a fiat-backed stable coin that is native on-chain. This could amplify the number of transactions running on chain and increase the number of people using the chain, developers on the chain, and proposals for Catalyst, meeting all the fund 9 goals and going a way toward meeting the challenge goals. The impact on the challenge may be limited as this is only ensuring the legal compliance of a single project without consideration to other legal issues faced by other projects. But the ripple effect would definitely have far-reaching positive consequences. ", "q0r": 4, "q1": "This proposal team has experience in building on the blockchain and are capable of carrying out the required tasks to accomplish the goals laid out. The proposal is set up to develop a legal framework to go through state registration and regulation. The budget is laid out so that the fees for each state are listed. I verified that the fee for my state was correct and that the team had done the appropriate research. I assume the same for other states, as it is easily checkable and the point of this proposal is for the teams to improve their compliance. Lying here when it is so easy to be verified seems crazy. The team member info is publicly available on their website listed in the comments. This seems feasible, but there is possibly a problem with how the process unfolds. There are a lot of states and their processes are all different. The timeline is sufficient for evaluating feasibility and in my opinion it should be just fine. It could have been more detailed. They could have laid out who precisely would be taking responsibility for this project. They could have linked to the state websites and posted the exact process for each state. This would have been a lot of detail, but they will need it to accomplish this proposal. ", "q1r": 4, "q2": "The goal is clear and measurable, but lacking detail. The team would measure success based upon the licensing path of each state. This implies that detail is not yet known. It would have been helpful to have that information included in this proposal, or attached to it. The primary goal is to receive favorable outcomes from the state licensing examinations, and this is also measurable, but also vague. It would have been better to be clear and detailed about what steps would be taken to ensure completion. Also, there is no mention of reporting, or publishing this data to their website, or to the community at large. To be transparent and receive full marks on auditability, there should be mention of specific measurements the team will take that align with the timeline and goal that the community can verify have been completed independently of the proposal team. ", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 12370, "q0": "A fiat backed stable coin for Cardano would be another step to get more attention. Especially for Cardano members who would like to exchange tokens from other tokens on the Cardano blockchain, this would certainly be an advantage. As the proposer has already stated, the proposal is limited to only a few American (!) states, so a large part of the community would not be able to enjoy this stablecoin. Especially in the European area, the MiCA regulation will change a lot next year. Stablecoins which will be classified as e-money token (like here) will fall under strict regulations and will have to obtain a license, which can be expensive. Therefore, the impact, because a large part of the community will be excluded, is not that significant. Above all, scalability is not possible without increased costs.", "q0r": 3, "q1": "The team is not visible on the proposal, but a website was indicated. The team consists of 10 people and a whitepaper is also available. The individual members are also linked on LinkedIn and a short description is available. They appear competent to execute. A KYC process has already been implemented, which basically allows them to operate in 3 states already, another indication of successful execution. However, it must be considered that problems can always arise with licenses and it is not exactly clear how these should be addressed.", "q1r": 4, "q2": "The proposal basically does not specify how the Cardano community will be informed. However, there is an update button on the website where there are 2 posts so far. In addition, one can sign up for a newsletter. Rough milestones were given and it is not quite clear if there is a certain order when which license will be requested or if all will be done at once. However, it has been correctly recognized that it varies from state to state, so an exact milestone setting in this case would also be incorrect.", "q2r": 4, "assessor": "z_assessor_3405", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "MUSD will be the 1:1 fiat-backed, directly-convertible stablecoin built for and by the Cardano Community.\nFiat-backed coin issuers need state money transmitter licenses. This proposal pays state fees", "experience": "Matthew Plomin, CFA\nMatt has been involved in fiduciary TradFi for nearly fifteen years, managing US credit research for liquidity products. He has navigated multiple regulatory reforms in the US and European money market industries.\nMBA, Economics, Quantitative Finance"}