{"id": 417004, "author": "rabbitholepools", "title": "Creation of a registered company", "url": "https://cardano.ideascale.com/a/dtd/417004-48088", "category": 26596, "amount": 30250, "description": "The legal and fiscal framework of funded Catalyst projects is sometimes challenging in local jurisdictions. This exposes project owners (and perspective clients) to potentially damaging risk.", "f6_no_assessments": 5, "f6_rating": 2.933333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 7157, "q0": "The idea aligns well with the objectives of the challenge, as it intends to create and maintain a registered company that would provide a fiscal (for tax purposes) and legal framework for TRACE to operate. As the proponent pointed out, it would allow the hiring of external contractors, detraction of expenses for tax purposes, and other benefits to us as developers and owners of the project. In my view, I think this would be useful for what the challenge is looking for projects that could help establish a financial and legal framework for the other Cardano projects and the Catalyst ecosystem. The idea is good but unfortunately, it is a little poorly structured. We know in general what would be done here, the purpose of the proposal, and where it would be, but we don’t know anything about the activities that are developed, or how this project would be done.  We also know the target audience of this project, but it would be interesting if the proponent clarifies how he will persuade them to use his services. Another point is, that the proponent should tell us which KPIs are targeted for the project, as this generates a sense of purpose that is very useful for the other projects, that is, we know what will be done and for what it will be done. Therefore, I think the proposal is good, but to be perfect, more explanations would be necessary.", "q0r": 4, "q1": "The feasibility of the project is not very good, unfortunately. Starting with the script, we don’t have a schedule here, we don’t know which phases would make up a whole and how long each one would take. What we have is a list of steps to need be done, but this is not a roadmap. In reality, what we need is for the proponent to explain what would be done in detail. That is, exactly what activities would be performed, by whom, how, for how long, and in what order. Which professionals would be involved here, doing what small tasks to make the prototyping process possible? What would your routines be like? What deadlines and with what specific goals? Anyway, I think that the entire development process is explained in a very superficial way, being necessary that the proponent explains in detail what would need to be done to compose each step, and it would also be better if they have a timeline. Regarding the budget, it is also explained very thinly. For example, 30,250 dollars is asked for “Social Capital”, what is that, and why would it cost 15,000 EUR? “Expenses (notarization, contracting, auditing) for the creation of the Company”, with a cost of 3,500 EUR. How much would each of these parts cost? And finally, “Recurring expenses for maintenance of the Company”, why would this part cost 10,500 EUR? I believe that here are the salaries of the professionals involved, so I think it would be interesting for us to know what their work routines would be like, the daily hours dedicated to the project and so on. Speaking of them, the professionals involved, are given very little information about the team members. We only know the names of the duo that would be responsible for the project. We don’t know what they’ve done so far in their professional lives, the example of previous work, and especially how they relate to Cardano. What are their experiences with our blockchain, and how can we trust that they are prepared to successfully develop this project? So, unfortunately, I think all parts of this proposal deserved a revamp, both the script and the budget explanation, and team presentation. As it is presented to us, the feasibility of the project is low. ", "q1r": 2, "q2": "About monitoring the process, the proponent just says: “All the major progress will be shared on the Trace Twitter account for a wider audience”. I think it is very superficial. How could we audit the progress of things by a Twitter account? And how often would these updates be made? It would be essential that a script be prepared. That way, we would have a basis on which to audit. We would know which activities should be developed in each time interval. With that, we would have goals, and partial results to be achieved. This is already good material that could be monitored. Now about the final results, this part is much vaguer, we know that success would be considered by “the creation of the company. Documenting the success will be straightforward, as the process will generate several official documents. These documents will be signed by us as founders and owners of the Company, in the presence of a notary public within the Italian jurisdiction.” But how can this be measured? How can we outline objective, measurable and direct ways to verify this scenario? In my opinion, it would be necessary for the proponent to have informed statistics and analyses, both qualitative and quantitative that would allow the Cardano community to be able to confidently verify that the objectives have been achieved. So I think the proponent doesn’t give us good ways to audit the proposal, in need of improvement.", "q2r": 1, "assessor": "z_assessor_2879", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 7409, "q0": "The proposed project to establish a legally transparent company in Italy, called “Societa 'a Responsabilita' Limitata” (Srl), the official legal representative of the TRACE project, has been disbursed from F8 through Catalyst, this project is a perfect fit for the challenge\nThis is a natural step in the right direction, helping TRACE to function well within the legal and financial framework in accordance with Italian law, users and collaborative projects are protected by law. With the recent announcements on Twitter, TRACE is a dynamic, growing, and spreading project\nHowever, in the section of risks you listed, there is no clear law in Italy regarding digital assets, other than the option of paying a qualified consultant (without knowing when to stop), Do you have any other action plans? For example, register your business as a company providing regular network services, with legal transparency. Or move the registered office to another country, where the law is more precise for digital assets, I think this is possible, the world now operates without a physical headquarters. I only have a few contributions as above, in terms of impact, the project deserves 5 points\n", "q0r": 5, "q1": "Your team has 2 members, with experience and expertise in the Cardano ecosystem, but both have no experience in a legal and physical building, which hinders the implementation of the project. I think you should incorporate at least 1 or 2 advisors who specialize in legal and company building, this is really important. When officially present in the project, the members will work effectively, have high responsibility, and devote a lot of enthusiasm to the project.\nThe project outlined 2 steps to complete the proposal, but they are not really detailed, because you do not have in-depth legal expertise and company establishment as I mentioned above. You have to be more specific in the proposal, when you do, everything will go smoothly. For example, creating a company includes: contacting the government, establishing a legal entity, declaring a tax code, head office address, industry registration ...\nThe total funding budget is 29,000 Eur ~ $30,250, which is 6% of the total Challenge. As for the detailed budget, the establishment and maintenance costs are 3,500 Eur and 10,500 Eur respectively, you should list each work item corresponding to more minor expenses. Regarding social capital, it is necessary to specify items, such as protection lawyers, consulting costs, and negotiation costs. With 15,000 Eur for how long?\nWith 2 members who are mainly responsible for this proposal, you are also working on other proposals in fund 9, and are working on the TRACE project in fund 8. Can you guarantee efficiency? How do you divide your time? Please clearly present for the community to monitor and evaluate. With all the above comments, I rate this section 3 points", "q1r": 3, "q2": "Social media accounts are specifically provided by you, this is the place to update the progress of the project, making it easy for the community to follow, I appreciate this. However, the KPIs are not found in the [AUDITABILITY] section Please describe what you will measure to track your project progress and how will you measure them? We recognize it in the [FEASIBILITY] section Please provide a detailed plan, including progress and milestones to deliver your proposal. All have 3 KPI indicators, the indicators are quite intuitive and easy to quantify. I would like to add 2 more indicators such as the image of the head office, and the business registration license. These are the most practical indicators of project outcomes. The success of the project not only helps TRACE operate transparently, and users are protected, but it is also a promise to help other projects get closer to the community and the law. I rate 4 in this section", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8209, "q0": "\"The solution has already been funded and this proposal is to create and maintain a registered company (S.r.l), which indicates the development of the team’s project. The functionalities and benefits of the company have been described in the proposal, but I expect more details on the current performance of the project, the potential to develop after establishing the company, and the scale of the company (staff, office, or operation fields - do the team have plans to expand the areas of work?). Such information will help the community get a broad overview of the proposal and assess the development potential of the founded company. However, the impact of the project will be far-reaching when supporting the funded projects in complying with the financial and legal system and ensuring success. \nThe main risk is well foreseen and followed by an addressing approach that uses a qualified consultant service. A small suggestion of mine is that the team can prepare the plan to hire the consultant according to the following aspects: the name of the chosen consultant, the estimated price, the duration, and expected results. By doing this, the team can clarify their risk management and increase the viability of the project. \n\"", "q0r": 4, "q1": "\"The delivery plan seems a bit vague. The duration of the project is 2 months and covers 2 main activities (create the company and fund it with minimum social capital). So, what tasks are involved in the creation process, and who are the stakeholders? The team needs to list all the required tasks and estimate the specific delivery time for the community to track the operation process. Based on this information, the team can easily allocate the spending in a more detailed manner. The team can clarify why it needs to be EUR 3500 for the company establishment and EUR 10500 for recurring expenses. The explanation will help the community better assess the plausibility of the team’s financial plan.\nI expect more information on the description of the team members. The team can provide details on backgrounds, experiences, or past projects to support the community in evaluating the team’s ability and productivity. However, this is a continuation of the previous project in the catalyst funding, I believe they are fully capable of executing the project successfully. \n\n\"", "q1r": 3, "q2": "The progress of the project will be published on the official Twitter account of Trace, which ensures the accessibility of the catalyst community members. However, what KPIs will be used to measure the performance is still unclear. If the team plans to use the expected deliverables and documentation as the milestones to mark the progress, they have to mention them and tag the time to track. The team promised to upload the resulting documentation and further detailed budget during the reporting phase so I believe these metrics will be clarified by then.  ", "q2r": 4, "assessor": "z_assessor_2966", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 9009, "q0": "The goals of this challenge are to create legal and financial solutions that will help community projects and future catalyst proposals. This proposal is seeking funding to help manage the legal and financial needs of a single project. Specifically, this team wants to incorporate in Italy. They will be using a law firm to help them. Frankly, without additional details on how they will work to publicize their process, their impact will be minimal. If successful, Cardano will have one more legally incorporated company working on a funded project. That is not no impact, but it is minimal. If they had laid out a process for how they would document their journey for the sake of helping others, then it would have perhaps had a higher impact score. ", "q0r": 2, "q1": "The budget includes a quote from a legal firm. I am not an Italian lawyer, and want to withhold judgment, but as an western non-european, the fees seem really high to file the equivalent of  LLC paperwork. The proposer team acknowledges in the comments that they are not experienced in these matters, which is also potentially problematic. Further, they are seeking funding to manage their accounting and legal paperwork for a total of three years. I am not certain that these funds would be best used in this process. However, to the team’s credit, they are well organized and detailed in presenting their proposal. There is sufficient detail to assess their plan and their approach looks ideal considering the circumstances. I am just not comfortable giving this a higher score due to concerns about how much money they are seeking. ", "q1r": 3, "q2": "This proposal is clear about its goals and will be auditable. They could have given more detail about how they intend to share progress ,but ultimately, if successful, they will have legal documents proving that they have been successfully incorporated. They will have accounting reports and incorporation documents that they will upload to the public. They will also share “all major progress,” on their twitter account. ", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 14624, "q0": "TRACE will be able to function within a legal and financial framework provided by the Company (for tax purposes). As a result, it will be possible to hire independent contractors, deduct expenses for taxes, and enjoy other advantages. In the event of failure or default, the project will protect potential clients. The long-term objective is to give the organizations using the Product Tracing platform the ability to influence TRACE's evolution (through a DAO and Governance Token). If problems arise, the initiative will be solvent thanks to the existence of Social Capital.\nThe proposer did not provide a specific plan for this project. All information provided in the solutions and risks section is general and incomplete. First, the proposer does not present their product functions or features or the main components and activities of the project and the potential audience they are targeting. At the same time, it is not clear how their project affects these subjects. Second, the proposer does not display the content to indicate what results in their project produces and whether it is appropriate and synchronized with the key metrics of the challenge. And after the project is completed, what results will it achieve. Finally, the risk raised by the proposer is that Italy (and typically the EU) lacks comprehensive rules governing the market for digital assets, and the solution that the proposer provided is non-specific.", "q0r": 2, "q1": "Proposer does not provide a specific roadmap, all information shown is creating the company and funding it with the required minimum social capital. The proposer did not offer specific work and timelines for its completion. In addition, the proposer did not specify the number of members and positions to implement the project.\nRegarding the budget, the proposer lists 3 expense items for social capital, expenses for the creation of the company, and recurring expenses for maintenance. The proposer did not have a specific budget plan, the categories were generic and not detailed. In addition, other costs such as notarization, contracting, and auditing should be more clearly described how much it will cost, and how long it will take to complete the cost.\nProposer does not provide complete information about the project members, except for the names of the two founders, and that's all. The proposal does not show the education and work experience of the members. I have tried to access the website the proposer provides to find more information but to avail. The information “Michele is a blockchain developer, working on TRACE and Stefano is the project manager of TRACE” is not enough to have an objective view and evaluation of the team. I recommend the proposer add a Linkedin link if available.", "q1r": 2, "q2": "I noticed that the proposer did not provide information about the milestones in the roadmap and the time to achieve the goal, but only said \"All the major progress will be shared on the Trace Twitter account for a wider audience\". There is no information about key metrics or specific KPIs to define what this proposal will be successful on and what results will be achieved when successful. Besides, the proposer also does not show how the team will manage and track the project progress, I suggest using Jira software for this problem.", "q2r": 1, "assessor": "z_assessor_4076", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "We are a funded project from F8, called TRACE - Product Tracing on Cardano. We propose to create and maintain a registered company (S.r.l in Italy, similar to an LLC in US).", "experience": "Michele is a blockchain developer, working on TRACE.\nStefano is the project manager of TRACE.\nWe both are intimately familiar with the Cardano Ecosystem and run 2 independent Stake Pool operations on it: ARMN and RABIT, respectively."}