{"id": 417828, "author": "wada", "title": "Scale-UP Hubs' Legal Framework", "url": "https://cardano.ideascale.com/a/dtd/417828-48088", "category": 26596, "amount": 21000, "description": "Startups often have difficulty ensuring they are doing everything necessary to stay legally and financially organized.", "f6_no_assessments": 11, "f6_rating": 4.515151515151516, "videos": [], "media": [], "f6_assessments": [{"id": 2951, "q0": "WADA is an African organization that has been very tremendous in promoting the Cardano ecosystem. This project comes with a problem statement that looks at the difficulty in ensuring that startups are doing their possible best in their power to stay legal and financially organized. This problem statement of this project clearly defines the problem in this challenge category which needs solutions to be modelled to ensure peace of mind for funded projects. Reding through the solution, to curb the problem, I think the project will help model out a template in favour of the necessary legal and financial framework which will be needed by the already funded project to help them resolve some of the legal and financial issues that confront them bringing about frustrations and stagnation to the project. With regards to the alignment of the KPIs to the challenge category, I see this project to be able to support many funded proposals with their legal and financial framework as a use case for funded projects. I will be very grateful if the proposer will throw more light on the global use case of the legal and financial framework to ensure adaptability.", "q0r": 5, "q1": "The WADA team can very well boast of amazing talent with great experience and skills to successfully implement this project. To talk of a few we can talk of Megan, who is an internal operation lead at WADA with great success in project management and also we can find in the person of Richmond who is a tremendous graphic designer in charge of all the graphic works on most of the WADA media channels. The team has clearly stated the involvement of a consultant in the legal field to ensure credible project implementation. In view of the budget, it has been well drafted with concise inputs to help reasonably achieve the stated objectives. The ultimate goal of this challenge is to help create solutions in the field of legal and financial services to support funded proposals. In line with achieving the target, the proposer has given a reasonable and realistic timeline to complete the work. ", "q1r": 5, "q2": "This project has provided enough information to help the community forecast its progress. Looking at the roadmap to help achieve its goal, it has provided the activities from the first month to the third month outlining some of its activities that include Hub and Partnership templates creation, the documentation and framework template. Some of the key metrics of the challenge category that maps in line with this proposal are the use case. This is where the majority of the funded proposals will make use of the legal and financial template to help curb the issues disturbing them to make progress. We can also talk about the Scalability of this project, in my view I believe this project has a good going concern that can help to scale over ten times.", "q2r": 4, "assessor": "z_assessor_2371", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 4103, "q0": "This proposal aims to support the development of Wada's HUB model for providing locales offering education and other resources to expand Cardano and DLT solution accessibility.\n\nThe theory of the proposal, to support hub development with legal and financial framework, it well intentioned, and aligns with the Legal & Financial Implementations challenge by providing solutions that are scalable and translatable to new markets.\n\nWhere the proposal lacks strength is that it provides a framework for establishing hubs (templates, checklists, handbooks) using a project management style approach to deliver those documents, without really bringing any legal or financial professionals into the ecosystem directly.\n\nWhile the physical infrastructure for the Hub model may be existing already, a more detailed use case or success metrics on operational history could help to build confidence that the Hubs are indeed accomplishing their purpose, and that production of these documents is the correct approach to expanding that model - rather than, for example, staffing legal and accounting resources to provide direct guidance.  And my slight disagreement with the impact of this proposal is due to my disagreement that this approach will provide the necessary ongoing support that startups often require - since as I have experienced as a startup operator, legal and regulatory frameworks are often dynamic, requiring regularly accessible resources in order to keep up with changes to the landscape.", "q0r": 2, "q1": "The feasibility section of this proposal provides a clear scope of deliverables, although with few in-depth details about the content of those deliverables.  It also contains a roadmap/timeline for delivery and a breakdown of cost allocation for the 29k USD budget over 6 months.\n\nThe team is also defined by contribution, and seems appropriately skilled and placed to provide value to this project.\n\nI agreed (but not strongly agreed) with this proposal.s feasibility because I generally think that $29k USD for the production of the scope of the documents mentioned is high, even-though it is structured in a way that offers a high level management and oversight on the process and delivery.\n\nI could have also been more strongly convinced of the feasibility for this proposal if the author demonstrated more in depth knowledge about the legal and financial requirements based on their relevant experience, rather than leave the determination of those factors for after funding confirmation.", "q1r": 4, "q2": "The metrics/KPI for deliver of this proposal is relatively straight forward.  The basis is that they are providing internal experience-based input plus external consultations to produce legal/financial guidelines that are aimed to facilitate onboarding new hubs and partners.\n\nThe roadmap is also clearly defined for delivery of this work.  However the reason why I hesitated to strongly support auditability is that I wasn't clear what kind of distribution the proposer intended for the finished product.  Its vaguely indicated that the templates will be \"for wada.com and Hubs\" but I'm not clear if that channel provides a high level of public awareness, especially in terms of scalability.", "q2r": 4, "assessor": "z_assessor_2517", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1, "reply": "Impact/Allignment: The assesor states that this will not bring legal and financial professionals into the ecosystem, however our proposal mentions bringing in legal and financial professionals and creating a link with them and Wada hubs."}, {"id": 4979, "q0": "This proposal to scale up hubs' legal framework at wada will address the challenge problem by providing legal support for all hubs operated by the wada. obviously, wada has several hubs accross Africa which are independently operating to execute Blockchain and Cardano projects in Nigeria, Ghana, Goma and others. These hubs do not get the needed legal support to autonomously host engage certain stakeholders such as government, banks and other financial institutions. however, if there's a legal framework to provide a guide and best practices into how wada can approach stakeholders and prospects in order to gain the regulatory compliance with the laws of the nationality in which the hub operates.  Hence, getting a framework for the local hubs is essentially significant to the success of the hubs and Cardano projects. ", "q0r": 5, "q1": "The team has the requisite experience and qualification to handle this project and wada has proven record of having executed numerous projects on Cardano with funding from catalyst. Megan to serve as Project Manager and Leo as Project Support with Richmond as Graphics person, I believe the team will be able to deliver this proposal. Also, per the timeline of 6 month given; which will be spent on MoU design, Hub checklist, documentation and finance framework for first 3 months while using the last 3 months to finalize legal frameworks for hubs, deliver procedure handbooks. Therefore, the team should be able to deliver this within the stipulated 6-month period, and this makes proposal feasible. ", "q1r": 5, "q2": "The proposal has laid down the success metrics such as having wada hubs and partnership relationships are clearly defined and transparent. The proposal has also indicated the timeline to be used to execute proposal. Wada has reputable media outlets to report progress and success of projects to the catalyst community and general public. Also, the success of this proposal will enhance the transparency, accountability and responsibility of local hubs of wada and this will improve the AUDITABLITY of the project. ", "q2r": 5, "assessor": "z_assessor_2650", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5671, "q0": "The WADA project has shown enormous impact in Africa. Hence an extension to secure its various hubs via a legal and financial framework and eventually set them up for success is a laudable initiative. My understanding of this project is to develop a model that supports and onboard new hubs. In essence, the team intend to also deliver an operating model that translates the governance framework into repeatable practices, procedures, processes, and job responsibilities. Ultimately, the team has a long term intention of making this model accessible to other hubs outside WADA. On the basis of this, I see the model for this project as a more aligned approach to the legal and financial challenge setting. Wada has several projects that falls under its auspices, therefore with the myriad of WADA hubs, the possibility of an oversight on the activities of any of the WADA hubs is very likely. Therefore, I support the idea of putting in place a framework that enable WADA track and monitor all hubs and at the same time scaling up the level of transparency and accountability across all WADA hubs. I only implore the team to provide more perspective on whether the team has long term plan of recruiting a permanent legal expert that would represent WADA for the purpose of the legal framework of this project. In my view, I would suggest that the team consider that. Anyway, kudos.\n", "q0r": 5, "q1": "Is it likely the team at WADA would implement this project successfully? Certainly! We’re previewed to the influence of WADA and its track work in terms of project execution. Aside that, the profile presented here details the work experience of the team within the ecosystem and their individual field of expertise. The team has also indicated their readiness to be transparent to the community by the provision of a link to confirm expertise. Worth mentioning here is that, the expertise of the team members would definitely be relevant to this project. With the role assigned each member within this project, there is clarity on what each person would do along the roadmap to project implementation. Apart from that, the proponent has designed a well-defined budget breakdown with allocation to various items. I think the budget here is understandable, accurate and moderate when placed alongside market value. Finally, we’re presented with a clear indication of what activities the team intends to perform along the path to project implementation. The work structure here is well detailed to include specific timeline for a set of activities.\n", "q1r": 5, "q2": "The information provided here is sufficient to audit the project. Firstly, the proposer assign specific milestone within the roadmap that is aligned with the overall objective of the project. In my opinion, these milestones provide a clear indication of what progress and success should look like. Additionally, these milestones  complement the KPIs in determining the progress and the success of this proposal. Contrary this, the proposer failed to specify clearly how the community can access the information on the metrics and how they can also monitor the progress and success of the project. I would suggest that the team make their progress report or update on the progress and success of the project available to the community via the catalyst community either via their telegram and discord", "q2r": 4, "assessor": "z_assessor_2734", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 6593, "q0": "Due to the constant doubt that startups have regarding legal frameworks, this proposal arises from WADA, which aims to provide help not only for their own hubs but for other non-WADA hubs. The fact that this proposal is focused on developing a series of processes to standardize the way blockchain-related companies should deal with legalities is proof of its own potential; it does not give startups the solution, but it shows them how to consistently reach it. A risk management analysis is also provided by the team, which is something that allows the community to rely and trust on the project. The footprint that this project can leave is significant since it will ease the work for startups and reduce the legal uncertainty that brings running a blockchain-related company. (Rating given: 5)\n", "q0r": 5, "q1": "\n\tThe WADA team counts on years of experience working in the community and helps its development in Africa, so it is a warranty of willingness towards the sustainable improvement of the Cardano ecosystem. The core team developed a detailed plan in which it is explained what documents they want to release, and how much will it take them to produce them, from a milestones perspective. It is possible to say that the timetable is realistic and balanced; it does not prevent the team from having flexibility, but at the same time it sets time limits.  Regarding the budget, the amount of money requested is clearly reasonable but it is true that more details could be provided if transparency is sought. Anyway, the proposal states that there won´t be another funding request, which means that the budget should cover the support needed.  (Rating given: 4)\n", "q1r": 4, "q2": "Thanks to making a road map from a milestones perspective, it is possible to measure success by checking whether a step was completed or not. This way of planning activities allows the community to track the progress of the project and so, to audit it. Moreover, due to the characteristics of the product, which are sort of intangible, there are not many other ways to verify how well the organization is doing. The outcome of this project is aligned with the expectations of the challenge and so it proves to be beneficial for the Cardano ecosystem. (Rating given: 4)\n\n", "q2r": 4, "assessor": "z_assessor_2822", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6680, "q0": "I love Wada! Just watch one of their videos. They’re always inspiring, refreshing, upbeat and to the point. What kind of project do they have in mind now? Let’s see. We begin with the problem statement, that startups have difficulties ensuring they are compliant with their legal framework and don’t run into a financial mess quickly. And that’s very normal, because small teams should only focus on their core competencies and value proposition instead of wasting resources on maintaining a top notch legal and accounting position and lose themselves in paperwork. How can Wada help African small businesses with these challenges? \n\nBy creating a hub model, sort of a franchise, and onboard new hubs and partners by using legal and financial frameworks to streamline these activities. This will help them to deliver an operating model that is sound, and repeatable across their geographical reach, a white-label framework framework that can potentially be used by non Wada hubs. \n\nHow is this proposal connected to the challenge? Well, remember that our goal here is to support the proposers in any way shape or form when it comes to their financial and legal challenges. Setting up a framework for Wada hubs does not help them directly, but can really boost the operations of all the hubs if they will manage to streamline their activities and service more small businesses. So the kind of work done through this project lies at the very foundation of what any hub network needs to do in order to have a solid business model behind it. Therefore there is a perfect fit with the challenge, so five stars for its potential of supporting future African businesses within the Cardano ecosystem. ", "q0r": 5, "q1": "The Wada team is very strong and especially active within the community. Just to throw a few names here, we have Megan the project manager, Lee the advisor and Richmond the graphics designer. For all of them you can read a short bio on the proposal’s page, and for all we are offered linkedin profiles - a very open and transparent approach. Wada has a physical presence in Ghana and Cameroon, a critical point in ensuring a good connection with local businesses.  \n\nThis project is supposed to last for six months. The first three would focus on creating the templates for the partnerships (memorandums of understanding, checklists, financial frameworks, etc), while the last three would personalize them according to each hub’s needs and would also focus on having the right documentation in place, both internal and external. \n\nThe budget is rather modest for what the project delivers. Half of it would go towards funding two persons for six months drafting the necessary documentation, while the rest would be split between sundry items. \n\nConsidering Wada’s strong presence in the Cardano ecosystem, the modest budget and the simple yet effective timeline, this project is highly feasible and welcomed. ", "q1r": 5, "q2": "Being majoritarily a documentation exercise, it should not be very difficult to ensure auditability - since most documents can be consulted and verified by interested stakeholders. The project lacks a certain depth in terms of defining what success looks like - we only have a simple phrase in the entire section. What would have turned this proposal into an excellent one is, in my opinion, setting some clear targets in terms of hubs onboarded within the new structure, and an added part at the end to create a feedback loop and turn the entire exercise into a user manual or at least a final report to be shared with the community, identifying best practices in the area that future regional partners can use, for instance in Latin America. In the absence of such undertakings, I feel that four stars are appropriate. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 7064, "q0": "The challenge objectives and the problem as presented in this proposal line up. By giving scale-up hubs the essential legal infrastructure to assure their lifespan, that is, to ensure they are receiving the appropriate legal and structural assistance, it strives to support projects on the ground in Africa and its diaspora. The author made it clear that this project will produce an operating model that will translate the governance framework to Wada hubs in addition to a legal and governance framework. This approach, in my perspective, is positive since it would make it possible to implement consistent governance across all Wada hubs at every level.\nThe creation of a legal framework to support and onboard new hubs and partners to position them for success could have a significant impact on the Wada hubs, the catalyst community, and the Cardano ecosystem.", "q0r": 5, "q1": "The team involved is undoubtedly capable of managing the project effectively. They seem to have a lot of connections in the Cardano community. The primary responsibilities and contributions made by each team member to the Catalyst community are listed, along with a link to their organization's website. This demonstrates that the company has a wealth of experience in connecting entrepreneurs and developers, increasing the likelihood that the project will be carried out flawlessly. \nMoreso, The proposal includes information on how the team plans to do this, and their goal appears doable. I think the amount sought is reasonable to carry out the specific actions indicated in a thorough roadmap given the budget's clearly defined allocation.\nThe team has also outlined significant risks that could thwart the successful completion of this project and has created countermeasures for these risks. The Wada team has my support because I believe they can achieve their objectives. I have faith that this idea will be brilliantly executed.", "q1r": 5, "q2": "This project's success and progress from its origin to its integration may be completely audited with the information provided and the KPIs specified. \nConsequently, the project milestone appropriately summarizes the plan, which in my opinion is a solid signal for gauging the effectiveness of developing a legal framework to support Wada new and forthcoming hubs.", "q2r": 5, "assessor": "z_assessor_2869", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7415, "q0": "Wada is one of the most active organizations in the Cardano ecosystem in Africa, based in many countries with highly constructive projects. This proposal helps Wada create regulatory frameworks for all locations, making them efficient and sustainable over the long term. With all the above orientations, the proposal is perfectly suitable in this Challenge\nWith this next step, Wada wants to affirm its responsibility to the community, to help projects operate effectively when there is a clear legal framework, compliance with the laws of the host countries, and acceptance by the people. help develop a sustainable Cardano ecosystem\nIt is proposed to provide a single governance solution that applies to all headquarters in multiple countries. Every country has different laws, has different cultures, I think this is also part of the risk. Does the project have a mitigation plan for this problem? Please share so that the community can better understand. In addition, the project has mentioned 3 other risks, all with specific plans, I appreciate this coverage. This part I completely agree with the project should rate 5 points\n", "q0r": 5, "q1": "The project lasted for 6 months with 5 main topics, and the project detailed the documents to be produced, everything was very detailed. With a total budget of $21,000 representing 4.2% of the entire Challenge, this is an appropriate number. All are fully listed in the steps. As for the translation, translating from English to French, why not another language, please clarify.\nThe main responsible team consists of 3 members with in-depth experience, spread in many areas, and with a team of Wada human resources behind, I believe the project will be implemented smoothly. However, to be more stable, the project should list one more member who specializes in law and understands African culture to be jointly responsible, this helps the project to be centralized. I only have a few small suggestions and am completely happy to rate 5\n", "q1r": 5, "q2": "The listed KPIs follow the implementation progress, are very intuitive and easy to quantify. Please provide a specific link where the project updates progress and results, making it easy for the community to follow and support. In addition, I would like to add 2 KPIs, the number of cooperation projects legally protected by Wada, the number of organizations collaborating to build their own legal framework. These are 2 indicators that I think have considerable power, helping to assess the effectiveness and scalability of the project, all in line with the Challenge requirements. The success of the project is something to look forward to, compliance with legal principles is always paramount to build a better life, thereby creating a sustainable community, the Cardano ecosystem is delighted.for that. This part of the project presented is not completely convincing, so I rate it 4 points", "q2r": 4, "assessor": "z_assessor_2893", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 8873, "q0": "Most of the newly funded project teams have to many questions that will be running in their mind on how to keep up the project with legal and financial terms with the government, and have to check every time whether any of their aspects of their work are out of financial terms of government . Hence to overcome such doubts the proposer wants to set up a framework where newcomers can verify any of their doubts easily without wasting time on different browser, the idea can help the startups in continuing their work smoothly instead of wasting time other unwanted aspects , Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The task mentioned is not much of a difficult one where it just needs 2-3 excellent legal advisors who have core knowledge related to laws of blockchain  legally and financially . the proposer's team wants to collect all those data either from people through our network or seek advice from professional consultants through clarity.fm which is great , other than that setting up all collected into one framework can be achieved by proposer's team itself where it has members who are experienced in editing documents and  coordinating the hub branding. Hence , With Given experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The audit has clear goal on how to set up a legal frameworks that will be helpful to startups and as well financial hubs, for that to achieve the proposer has clearly mentioned on whom to consult for financial assistances and later how to edit the rest of the data to make it easy and simple framework. \nThe audit has introduced his team and presented experience of these team members in blockchain development, the proposed plan has simple budget breaking idea and decent roadmap to complete the project , hence with minimal risk involved in the project the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 9019, "q0": "This proposal would have an impact on moving the challenge goals forward if it is successfully completed. I think the ideal of creating a framework for WADA to develop new legally and financially compliant hubs in Africa is a net positive for the cardano ecosystem. I am not certain, though based upon the proposal, whether or not this framework creation would have a positive effect on other projects and organizations looking to do the same thing. The fact that WADE plans to use a real-world cooperative organization as a start for their documentation makes a lot of sense. That is the closest analogy to a DAO, so they’ll start there instead of trying to start from scratch. There is not enough detail to see how they will take what they learn for internal use and really develop for external use. If they do it would be more impactful. I am certain that they will accomplish their goals here, but not sure it will be a level 5 impact. ", "q0r": 4, "q1": "The WADA team has been around for a while and has developed a positive reputation. They are competent and capable of carrying out this proposal. There are no doubts that they will be successful. They also have set out to accomplish something reasonable and doable. Instead of starting from scratch, they are going to start from an existing legal framework that is a real-world analogy of the goals of a DAO. This makes perfect sense, and I think it will benefit them. In terms of timeframe, it could have been more detailed. There are no specifics on how they plan to accomplish the workload, simply tasks listed out. This is sufficient to assess the proposal as a whole, but not enough to really be completely certain. There are many proposals this round who give far more detailed task breakouts, and plans of work. Therefore while I agree that this is feasible, it could have provided more detail to assess at a higher score.", "q1r": 4, "q2": "The goal is clear. The team wants to  create a legal and financial framework for the creation of new WADA hubs. This is a great goal, and will further the adoption of Cardano. They will take these plans and release them in a public format, though what exactly this looks like is less clear than I would prefer. The auditability metrics are clear and measurable. There could have been more detail here as well. They could have listed how they planned to make this public. They could have mentioned a plan to complete monthly reports. They could have also mentioned accessibility of work updates via a website, discord, etc. Overall, I trust the team to be transparent, and the work to get completed. However, as Catalyst grows, proposals need to add more detail to help novice proposers really assess whether or not the proposal is auditable.", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9113, "q0": "Proposal raises the issue Startups often have difficulty in ensuring that they are doing everything necessary to stay legally and financially organized. Wada will create a model with which to support and onboard new hubs and partners with a template for legal and financial frameworks to set them up for success. It will also deliver an operating model that translates the governance framework into repeatable practices, procedures, processes and job responsibilities. The framework shall be constructed in a manner that ensures it can be white-labelled and used by other non-Wada Cardano hubs. I find that this proposal fits the goal of challenge. In addition, the proposal also introduces some risks such as trying too hard at the early stage to turn Wada / Wada centers into a DAO because the concept is still quite experimental or risks related to the services of lawyers and accountants… They also offer solutions to minimize it.\n", "q0r": 5, "q1": "The project will produce documents such as: Wada Internal Procedures (Internal and External handbooks), Hub onboarding documentation, Partnership agreements. The project will be implemented in 6 months, in the first 3 months will be Hub and partnership templates (MOU template, hub checklist), Financial framework template for Wada.org and Hubs… In the next 3 months will be Financial template personalized for each existing hub, Internal Procedures documentation. The project has a clear roadmap.\n\nThe budget for the project is 21,000 USD, in which project management cost is 4,000 USD, documentation is 12,000 USD, legal advice is 2,000 USD… I find this cost quite reasonable, but according to the details, the cost adds up is 20,000 USD, not 21,000 USD.\n\nThe project team consists of 3 people from the Wada team: Megan - Internal Operations Team Leader @ Wada will be in charge of project supervision, document arrangement, communication with centers…, Leo - Advisor @ Wada will assist Creation and editing of documents, as well as strategic advice, Richmond - Design & Marketing @ Wada, will assist in coordinating the central brand with Wada's own brand. They also consult with experts on the matter before finalizing so I think they will be able to carry out this project.\n", "q1r": 4, "q2": "The project team has set the goals according to the timeline as stated in the roadmap. They will measure the progress of the project against these goals. But they have not said how the community can check the progress of the project.", "q2r": 4, "assessor": "z_assessor_3021", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}], "solution": "Wada will create a model with which to support and onboard new hubs and partners with a template for legal and financial frameworks to set them up for success.", "experience": "Wada Core Team and advisors.\nNetwork of Hubs throughout Africa."}