{"id": 419576, "author": "saqib", "title": "Documenting Human Rights Evidence", "url": "https://cardano.ideascale.com/a/dtd/419576-48088", "category": 26596, "amount": 40000, "description": "The documentary evidence of the genocidal human rights crimes against the Rohingya are at risk of being lost or destroyed.", "f6_no_assessments": 9, "f6_rating": 2.8888888888888893, "videos": [], "media": [], "f6_assessments": [{"id": 7167, "q0": "Unfortunately, this proposal does not fit the objectives of the challenge. I think it should have been launched in the challenge which relevant history or human rights (maybe). The idea is excellent and meaningful: creating a blockchain-based digital repository of human rights and historical documents critical to the Rohingya people. The author states that this project would be of a non-custodial nature which enables the permanent storage of data in a decentralised manner. However, I didn’t think it is in line with the challenge because it is not certain if Cardano will benefit from it and the connection between this project and the legal/financial fields. The proponents explain the problem situation and their proposed solutions very well but dedicate very little space in the impact part to explain the connection parts referring to legal framework or finance services on Cardano would be improved and developed. Because the purpose of this challenge is to fund projects that are beneficial to our blockchain, especially helping the other projects would broaden their horizons and increase their impact on the Cardano ecosystem once legal and financial frameworks are explored and established. So as far as impact is concerned, I don’t think we’re clear on whether the challenge’s objectives would be met.  ", "q0r": 1, "q1": "There is no roadmap in the proposal and the information in this part is superficial. I don’t think the proponent explains the development process well. All that is said is what is expected to be ready from July 2022 to June 2023. The proponents also explain what would be done, but the establishment of the schedule is very superficial. The proponents give only a cursory idea of the activities that would be done along the way (almost 1 year). Regarding the budget, the asking value is high (40 thousand dollars). It is divided into two parts, and these are just mentioned. Once again, the proponents don’t say how that part would be managed. We would need to understand where that money would go, and how long would the professionals involved perform this project? what “Documentation collection through field officer and community mobilization” would be, how “technical upgrades to existing R-Archive Interfacc” would happen, how the work routine of the professionals involved would be, and the price of their working hours,… We could not reliably understand how the requested money would be used; much more detail and clarity would be needed. It’s not very clear. Finally, speaking of the team, I think this part is good, knowing in detail who the team members are: their names, areas of activity, functions, and brief resumes. However, we do not have links to any of their social networks (LinkedIn profile, telegram, Github, for example, where we could see practical evidence of everything that was said. Overall, I think it would be necessary for more detailed explanations to be attached to each of these parts.", "q1r": 2, "q2": "All metrics chosen to measure progress are numerical. It would also be important to have qualitative information, that is, understand in a more human way how things are happening. In my view, this says about the measurement of partial goals, but not what is behind it, we need to understand how the pre-production of the project would be being done, if the money was being used properly if each professional involved would be doing the activities that were assigned to them. And talking about the final success, no scenario is drawn, it is only said that the success would be measured by some numerical indications given (number of actual documents collected on the ground, number of Rohingya community members engaged in the project, data storage space allocated for document file storing, upgrading of interface to allow for easier user meta data filtering and uploading experience). I think that’s the basics. In addition to knowing if it happened, we also need to know how it happened, what impacts were generated for Cardano, and how this can be measured directly. I believe that this part needs to be revised and improved, it is not impossible to monitor well neither the process nor the results of the way the information is dictated here.", "q2r": 2, "assessor": "z_assessor_2879", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 502, "q0": "This is a amazing idea and proposal. Recording historical documents related to Rohingya is exactly a perfect use case for blockchain technology. Recording on Arweave, all things consider, guarantees it's existence for 200 years with no maintenance cost. With that being said, I am struggling to see what this proposal has to do with the challenge. \n\nI'm unclear how the solution proposed helps provide \"legal & financial services and support to funded Proposers.\" \n\nPerhaps I'm missing a link but the proposal does nothing to specifically call and respond to asks from the challenge. ", "q0r": 1, "q1": "The budget is pretty straightforward with three itemized items. There is a Dec 2022, and a January to June 2023 milestone outline. Would have love to see this broken down further? What are the deliverables of the  moving of \"1000 documents within the next 18 months?\" Are you expecting or targeting a certain number of document per month? Per week?\n\nIs there an order to Field team training and formation, digital protocol process created, refinement of existing interface? Which is happening at month 1 vs 2, 3, and so on. Or they really all starting at month 1 and will run for 6 months? Would have love to see the proposal spell this out. \n\nTeam wise, this is certainly the right team for the job with core competencies in web3, archiving, international NGO work to name a few. ", "q1r": 2, "q2": "The proposal does not detail how it intend to track its progress. Will you be working through a public list of documents? How will you be recording the collected documents?  How will you track the development work needed to \"refinement of existing interface?\"\n\nLove that the team plan to release monthly reports showing the cost breakdown of expenses and costs. Would have love to hear where these reports will be published. ", "q2r": 1, "assessor": "z_assessor_2098", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 655, "q0": "This is a very interesting project which is well explained, has real use cases, and seems very well suited for blockchain. The use of Arweave seems particularly applicable for this use case as well. If successful the model itself could even become the standard for NGOs operating in countries where the local systems are not trustworthy to safeguard information. All that said there is one significant problem and that is that the proposal does not utilize Cardano or provide utility for Cardano or Catalyst. As such this proposal simply does not meet the criteria of the challenge or really of proposals on Catalyst in general. As a suggestion for the proposer perhaps finding a way to incorporate Cardano into the proposal would open possibilities for funding. For example this proposal seems very well suited for the use of a DID and storing that Cardano DID along with the stored document on Arweave. Reaching out to projects involved in that space may be beneficial. Unfortunately at this time I disagree and see some serious issues. The answer does not meet most of the criteria.", "q0r": 2, "q1": "The proposal itself is quite straightforward and most of the costs involved are related to logistics, training and some streamlining UX/UI work. Some more details about what specific UX/UI work is being looked at would be beneficial for a better assessment of the project and I would recommend elaborating on that. There is a roadmap, expected timeframes, a cost breakdown, and everything seems reasonable to achieve. The team for this project is highly qualified and has the relevant experience necessary to successfully implement this proposal. There was a short bio provided for each team member however no outside links to use to verify. As a suggestion for the team, providing this upfront would make it easier to assess your proposals in the future. However a quick google search of the team members provided the verification required. The budget requested is reasonable and risks were also considered and this seems to be well reflected in the way that the budget was allocated. I agree the proposed plans and budget seem feasible to deliver.", "q1r": 4, "q2": "The project itself is relatively simple to evaluate in terms of success and the KPIs listed should be more than sufficient to audit progress. There are quantifiable KPIs including the key metric of getting to 1000 documents stored on chain. The proposer has also committed to publishing progress reports for the community which is another good tool for this. However in future proposals I would recommend to the proposer to identify how this information would be shared with the community in the proposal. A web page would be a simple solve for this. With that said however this certainly is not a huge issue and I'm sure this team would be capable of finding a way to get those reports to the community therefore; I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\n", "q2r": 5, "assessor": "z_assessor_2113", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 2952, "q0": "This project is a very good one and a much elaborated proposed solution which makes me happy about the project. Unfortunately, the described proposal does not address the challenges that it finds itself. This challenge seeks to satisfy emerging projects in catalyst that faces legal and financial issues which block them from progressing with their funded projects. There is also seen to be a little impact on the Cardano ecosystem if this project is to be implemented. In as much as the documentation of human rights evidence is very vital to one's everyday life, there is little impact this project is going to have on the Cardano ecosystem in relation to the theme of the challenge category.\nAligning the KPI indicated in this proposal to the challenge, there seem to not agree. For instance, a key metric of this challenge is to look at the use case, where it looks at how many funded proposals are making use of the solutions being mentioned in this project. In my view, I see no use case with this project to already funded project seeking solutions on legal and financial issues.\n", "q0r": 3, "q1": "The team behind this project has a good wealth of experience which will be vital for the success of this project. There is enough reference and links to help the Catalyst community get an in-depth knowledge of what the project is all about. Looking at the detailed budget breakdown, I was not very much satisfied with the breakdown provided in the project as I expected a much more detailed budget approach. for instance what constitutes the budget for documentation collection through field offices and community mobilization which was assigned an amount of USD20,000. We the community need to know the constitution of the amount of $20000.\nThe project has an okay implementation plan which is not so detailed but it looks at some actionable tasks.\n", "q1r": 4, "q2": "The proposer needs to be accountable to the community by ensuring sufficient information needed to ensure the success of the project. There is not much information on the timelines and provisions on the road map to help ensure achievement.\nThe key metrics to help measure whether the project is in line with the challenge are the mutualistic nature of this proposed project and already funded proposals. This project in my view seems not to be in line with the challenge category setting and hence cannot be mutually aligned to most of the funded projects in the view of a solution to curb legal and financial issues that funded projects faces. \nFinally, we can also look at another KPI of the challenge which is the use case of the new solution or services which is intended to give solutions to already funded projects legally or financially.\n", "q2r": 3, "assessor": "z_assessor_2371", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 2965, "q0": "The goal of collecting documentation of the Rohingya people is a laudable one. \n\nHowever, it is not clear how this project is connected to the Cardano or Catalyst ecosystem. For example, the key technology being used for storage is Arweave rather than a Cardano-based technology. No connection to the Cardano blockchain is explained.\n\nAlso, this challenge relates to providing legal and financial services. Although the idea of recording evidence has some connection to legal services, the evidence in this case appears to be intended primarily for cultural purposes.\n\nIn summary, while I admire the goals of the R-Archive, I disagree that this proposal as written is properly connected to this challenge. I would urge the proposers to consider how to build a solution with greater connection to Cardano, and resubmit it (they have shown willingness to do so – “we will refine the existing proposal to improve it next round”).", "q0r": 2, "q1": "The team on this proposal is very strong and well-suited to its delivery, from cultural, technical and operational perspectives. The team has experience with gathering documents during the pilot phase of the R-Archive, and there is every reason to believe that they could deliver this project as well.\n\nHowever, the proposal does not fully satisfy some of the requirements of the proposal process:\n- The budget is quite high-level without a breakdown by tasks.\n- The proposals on which the team is working from this and previous funds are not identified.\nFor these reasons, I agree but do not strongly agree that the proposal demonstrates that it is highly likely that it will be implemented successfully.", "q1r": 4, "q2": "The success metrics for this project provide very good measures of success, focusing on interface improvements, documents collected (and associated storage space), and number of people involved.\n\nThe techniques to be used for project tracking are more limited, limited to a commitment to public monthly reporting. The proposers should consider providing more details about what information will be reported.", "q2r": 4, "assessor": "z_assessor_2374", "no_vca": 5, "ne": 1, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7068, "q0": "This project is excellent and has a well-developed proposed solution, however regrettably, the suggested solution does not deal with the situation at hand. This challenge aims to appease newly funded projects in catalyst that are hindered from moving forward with their financed projects by legal and financial difficulties. If this proposal is put into action, the Cardano ecosystem would be slightly impacted. As important as it is to one's daily life to document human rights proof, this project would have relatively little overall impact on the Cardano environment, which is hardly commendable.\nWhile the proposed solution to the aforementioned issue is incongruous, the challenge asserts that the documentary evidence of genocidal human rights crimes against the Rohingya is at risk of being lost or destroyed. The proposed solution aims to operate via a mechanism that serves as a decentralized storage system, but with the unclear purpose of storing \"human rights crimes evidence.\" How would building a platform to upload outdated passports, ID cards, and other documents impact the Cardano ecosystem as a whole? Unfortunately, I don't think the suggested solution fits the problem and I don't believe it would have a significant, immediate impact on the Cardano ecosystem.", "q0r": 2, "q1": "The proposal team is well-versed in a variety of experiences. The Catalyst community can learn a little bit about their diverse professional backgrounds, but there are no links to their personal profiles available to give a fuller picture of who they are. I had anticipated a lot more detailed budget approach, however there is not a clear breakdown of the budget in depth. The community needs to be made aware of what is included in the $20,000 earmarked for documentation collection through field offices and community mobilization. \nThe road map has been given, however in my opinion, this proposal is not one that will have a positive impact on people's lives.", "q1r": 3, "q2": "The dates and provided road map to assure achievement are not very well explained. There does not appear to be any alignment between the KPI suggested in this proposal and the challenge. The number of funded proposals using the solutions indicated in this project, for instance, is one of the major KPIs for this challenge. My opinion is that this initiative does not serve any use in relation to existing funded projects looking for answers to legal and financial problems. \nThe mutualistic nature of this proposal and the funded ideas are the primary measures to determine whether the project is in line with the challenge. My opinion is that this proposal doesn't fit the task.", "q2r": 2, "assessor": "z_assessor_2869", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8903, "q0": "As we know Indo-Aryan ethnic group who predominantly follow Islam and reside in Rakhine State, Myanmar who were called Rohingya, they don't have proper place to go and we all know the genocide of 2017 where 740,000 fled to Bangladesh. no human rights committee comes to check the lives of these people, Hence to develop a documentary where proposer who is Rohingya wants to show the world how people are facing problem is definitely a great idea to make a world a better place, so that people  raise voice over it, Hence This proposal effectively addresses the challenge.", "q0r": 4, "q1": "The task mentioned doesn't involve much of a risk, but accounting 50000 dollars for just documentation and publishing a work is way too much for this budget breaking feasibility, however the proposer himself is an Rohingya and other members who are involved in the project are also Rohingya so conducting documentary among themselves can be easily achieved , where they can share the problems faced by these people, However most of the documentation has been already done and has been published in the audit, so uploading those files will never be a difficult task to achieve , Hence with no risk involved and easy to achieve plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 4, "q2": "The audit has clearly mentioned the goal of documenting problems faced by people of Rohingya , it has even displayed all the members that will be participating in the project to make the project successful, audit contains detailed manner on how their project will counter the current challenges faced by Rohingya .\nAudit has presented detailed timeline on how to complete the project, it even contains simple budget breaking feasibility, but 50000 dollars for just documentation is way to much , proposer should have added what are the cost for each material that will be used ,and then should have proved how 50000 dollars will be utilized  , with the idea to help Rohingya's ,the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 9035, "q0": "My rating on this is in no way meant to invalidate the significance and importance of this work. The archive exists and is immediately necessary to protect the history and digital footprint of an exiled community facing extreme genocide. However, this is not a project run on Cardano. This does not meet the goals of the challenge at all. There is a legal need, and a financial need. I would consider voting for this proposal anyway, but it would not impact the Cardano network in any way other than contributing needed funds to a life-saving tool.", "q0r": 2, "q1": "The question of feasibility has already been addressed. The archive exists and is capable of storing documents on the blockchain. The funds would go to increasing the number of documents gathered by archivists. Ideally there would be a more specific budget breakdown, but the team has sufficient experience to trust they are aware of what their existing costs are. Essentially, this would be furthering their existing work, so feasibility should not realy be in question.", "q1r": 4, "q2": "The proposal is clear and they will be making regular monthly updates of how the funds have been spent. There is a clear metric involving the number of documents imported which is something they have complete control over. There is no reason to doubt this would be successful. ", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 12372, "q0": "As bad as crimes against human rights are, this is a project that is not related to Cardano. In the proposal itself, Cardano is not used even once and they themselves state that the Arweave blockchain is used here. Thus, there is basically no added value for the Cardano community (also the question about the connection in the comment section wasn't answered). If this was an archive that was connected to the Cardano blockchain, this would have to be assessed differently. The challenge of Fund 9 is therefore not met either.", "q0r": 1, "q1": "Since this is an already implemented project, which only needs further financial support, the success of the proposal can be assumed. In the Youtube video you can see how the R-Archive works. In addition, the people working on the project are described in detail. The project itself can be viewed on the given website. Furthermore, it is clearly stated how the money will be used and therefore the amount seems to be sufficient. The project has already received money from other foundations.", "q1r": 4, "q2": "A roadmap is also provided with the proposal. Although this is very roughly formulated, it makes the goal - namely to scan 1,000 documents - seem realistic. The last report from 2022 can also be seen on the link provided for the website, so the community is also informed. However, as mentioned above, the added value for the community is missing.", "q2r": 3, "assessor": "z_assessor_3405", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}], "solution": "The R-Archive is a blockchain-based digital repository of human rights and historical documents critical to the Rohingya people. ", "experience": "In the pilot phase of the R-Archive beginning in 2021, documents were collected and scanned from diaspora communities in Bangladesh, Saudi Arabia and Malaysia. "}