{"id": 419851, "author": "algaetoken", "title": "Legal and Financial Standards", "url": "https://cardano.ideascale.com/a/dtd/419851-48088", "category": 26596, "amount": 24870, "description": "There is insufficient legal direction for aspiring decentralised, globally distributed sustainable business' models on the Cardano blockchain.", "f6_no_assessments": 8, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"id": 6705, "q0": "This proposal requires just a bit of background. Algae Token is a project run by an Australian team, whose purpose is to launch algae farms as community run projects with a profit sharing agreement where half of the revenue gets reinvested in future projects. The value proposition of this proposal is to support the project in identifying the best possible legal set-up for their operations, both within Australia, as a first step, but also identifying a friendly location across the globe that can function as their world-wide headquarters. \n\nOf course, the deal is that the entire effort will be well documented and the entire community can benefit from their lessons learned, while the framework that they will select and go for can serve as a template / blueprint / user manual for similar undertakings. \n\nThis is a very enticing proposition, similar in many ways to other proposals within the challenge, like for instance “Accounting reporting France”. This is a good thing, first of all because several teams have similar ideas - that definitely means that there is both a community necessity behind them but also the desire for the community to help each other with opening up new legal / regulatory paths.\n\nFor voters deciding how to vote for these proposals, I believe that judging the value for money for each and every one should be an individual choice, and this proposal is definitely up high from my point of view in this respect. In conclusion, a great idea, with a strong use case for the Cardano community.  ", "q0r": 5, "q1": "There is a certain lack of internal competence when judging by the description of the team. Most members are of course very well positioned within their respective fields, mainly microbiology, sustainability challenges, eccetera. It is rather an unwritten message, but this task will definitely be externalized to their legal network, and that is definitely the way to go. However, I would have liked to see the proposal a bit more “beefed up” in terms of demonstrating the internal competency of launching a tender request for this project as well as demonstrating a very good capacity of going through a selection procedure at the end of which to choose the best positioned outside consultants in order to deliver on this task. And this is sadly not the case for the proposal.\n\nThe budget is lightly sketched, and we have fairly good bullet points with captions explaining where the money will go, as well as a few hourly rates for some of the external jobs. Again, judging by the presence of the hourly rates makes me wonder if the external consultants haven’t been already decided upon (I think they have) but if this is the case, a better presentation of their team / competence would have turned this proposal into an excellent one. \n\nTimewise things are fairly simple - it will take roughly four months to complete the tasks and do all the registrations required by law. I have a hunch that this timeline might be a bit too optimistic especially for the “global” portion of the project and that it will not be so easy to research, identify, select and incorporate a business entity, taking into account all the complexities that the crypto / tokens subjects will bring with them. \n\nIn conclusion I judge this proposal as having fairly good chances for a correct implementation, and I offer four stars, with indulgence. ", "q1r": 4, "q2": "This is actually the section that worries me the most. A very serious negative aspect of the proposal is that there are very little details offered in terms of how the lessons learned from this task will be passed on to the community. I do have to offer, again, the  “Accounting reporting France” in the same challenge as an excellent example of how to approach auditability for a similar project: offer frequent interactions / reports to the community, organize a few FAQ sessions with other interested parties, and pledge that at the end of the project to draft a really comprehensive report regarding your experience. This is sadly not the case, and I can only hope that the desire to pass on to the community the accumulated knowledge is much stronger than this proposal is indicating. I offer three stars since I am not convinced that the team successfully demonstrates a good case for solid auditability around this project. ", "q2r": 3, "assessor": "z_assessor_2824", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2953, "q0": "The problem statement has been well stated and is a challenging issue in the Cardano ecosystem. The issue of insufficient legal direction for most projects in the ecosystem is a key challenge which has to be addressed. The stated problem statement falls in line with the challenge category which looks at some bottlenecks in the field of legal and financial issues that face already funded projects. As part of the acceleration of development and app eco-systems which help projects to grow and evolve. Included in the problem solution of this project, there will be the legalised framework of a dApp business model providing real-world solutions and physical products over the blockchain. A key metric in this proposal in my view matches the one indicated in the challenge settings and aligns with the use case of this project. The use case is a framework for the legal and financial standards that will be very useful for already funded projects and future projects. This will help curb the issues faced by already funded projects in the field of legal and financial aspects posed by regulatory constraints. ", "q0r": 5, "q1": "Knowing that a project is doable mainly focuses on the feasibility studies that will be conducted on the project. First of all, having a look at the skills and experience of the team behind this incoming project. This is a team with many years of experience in the field of information systems, microbiology, cryptocurrency lawyers, and chartered accountants. The team's experience skills can be verified with the provided links that show the amazing skills they have. The budget of the project has been provided with a detailed breakdown that looks at the hourly charges of the project development and the legal entity cost of registration. The cost to be incurred on international legal advice and constituency was broken down into identifiable systems such as accounting fees to establish the local legal entity that administers the physical projects, local registration fees and social impact classification.\nStrongly I believe the provision of a legal financial framework as stated in this proposal will help broaden more horizons in this ecosystem and also increase its impact on the global economy. \nConsidering some risks that are forecasted in the implementation of this project, digital assets and native tokens have no clear pathway to ensure lawful operations. The timeline of the project is realistic over four months.\n", "q1r": 5, "q2": "The success of this project is said to be a fully confirmed operational business coordinated by legal and financial experts. Also, the Cardano community adopting the project will be calculated on the number of on-board members to social media platforms as one of the success models. the overall project has been well structured with provided information to ensure the success of the proposal. the information provided is in line with the roadmap and milestone has been detailed over a four-month period which will be accomplished in phases to help measure the success rate. The community can also track the progress of projects on the website of which is www.algaetoken.com.", "q2r": 4, "assessor": "z_assessor_2371", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 6602, "q0": "This proposal is about developing a series of legal standards for a specific DAO business model, which could help in setting the basements for building a template that could be used in many other projects. This potential solution could address the problem of uncertainty during the early stages of an emerging problem. It could function as a starting point for many start-ups in the Cardano Ecosystem from where people could take information to implement in their own business model. This is why this proposal's objectives are accurately aligned with the challenge settings. The proposer team also presented a risk management analysis, focused on aspects like creating insufficient legal entities or the inadequate ways to empower business development,  which is correct since they are probably the most threatening situations to take into account while running a project like this. (Rating given: 4)\n", "q0r": 4, "q1": "The proposer team is formed by experienced people from different areas that cover almost every aspect needed; having a cryptocurrency lawyer and accountant will certainly simplify the job done and will reduce the typical uncertainty related to legal frameworks and taxations in blockchain technologies related emerging projects. A milestones road map is also presented in which it is specified every activity the organization is planning to do within a time limit. Moreover, it provides great flexibility in case of trouble while running the plan, so it could be considered balanced. Regarding the budget, it is very accurate since it specifies not only why is that amount of money requested, but also how that money is going to be used, which is always a plus. It is also mentioned that the plan aims to make the project self-sustainable, so more funding won´t be needed. (Rating given: 5) \n", "q1r": 5, "q2": "The fact that the road map was created using a milestones perspective helps a lot at the time tracking the progress of the project. Every milestone accomplished would count as an improvement and so the project would be closer to success. Moreover, considering the aim of the proposal, it is correct that the quantification of registration of legal entities serves as a key metric to measure the success of the organization. Finally, the result of the successful implementation of this project could lead to a major impact on the Cardano environment given that its developed standards would be useful as templates for other business models. (Rating given: 4)\n\n", "q2r": 4, "assessor": "z_assessor_2822", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 7069, "q0": "The proposal is an spectacular attempt to characterize the legal framework for DAO business model to provide real world solutions and physical products over blockchain. This will suppress the issue of insufficiency legal directions for many projects in the catalyst community. This puts the problem statement in alignment with the challenge objectives. This proposal has the potential to make a huge impact on the Catalyst community to help projects gain the stand in legal and financial issues.", "q0r": 5, "q1": "The proposal team’s experiences and qualifications have been provided with their personal LinkedIn profiles for verification. They appear to be competent to accomplish this project, given their extensive skills and experiences. The proposal outlines details of how the project would be accomplished and their target appears attainable. The budget has also been clearly apportioned and is appropriate for the specific measures stated in the detailed roadmap.\nThe proposer has pointed out prospective risks that could obstruct the successful execution of this project and has arrived at solutions to contend the risks. I am buoyant about this team and their proposed goals.", "q1r": 5, "q2": "This proposal is well organized. The KPIs presented are sufficient enough. As it states that the progress will be tracked with regular meetings with legal and accounting professionals to ensure progress by confirmed token clarification, compliance to legal responsibilities and creation of registered legal entity. Indeed this project is auditable and I am certain that this proposal has capabilities to thrive.", "q2r": 5, "assessor": "z_assessor_2869", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 7169, "q0": "The proposal meets the objectives of the challenge well, although I think some things could be better explained. In summary, the proponent wants to develop the legal and financial framework to allow on-chain purchases of physical products. According to him, with the correct legal and financial implementation, a blockchain-based business can be constructed consisting of an online marketplace that supplies physical products for exchange of ADA or a supported native token. This would certainly be beneficial for Cardano. However, I think there was a lack of detail to better understand the idea, for example, a deeper explanation about the activities that will be developed, how this process would be done, how would people find out about this framework, etc. I think in theory it is a proposal that perfectly fits the objective of establishing the legal and financial framework to operate and comply with local legal obligations on the global Cardano network, mainly because it is about to characterize the legal framework for the DAO business model providing real-world solutions and physical products over the blockchain. However, my opinion is it would be important for us to know more details about how things would happen. Finally, I think that the impact is very high, just needing a few points of deepening, but even so, it deserves the maximum grade.", "q0r": 5, "q1": "The script is very good, we know what would happen and approximately when, in this way, it is quite possible to understand the project development process. However, I think some activities could be more detailed and the time division could be more exact, for example, phase two would be from months 2-3. What specifically would happen in month two and month three? If this division were more exact, we could understand even better how this process would happen. Regarding the budget, we have detailed explanations of how the total amount would be divided, and the parts into which it is divided are very well explained. We know the value of the work hours, how many hours they would work per week, and the total time in months they would dedicate to the project, so it is fully understood how that money would be used. About this part, I think we have the necessary level of specificity. Now speaking of the team, we know that they are 3 professionals: Dylan Kreis, Skye Thomas Hall, and Swaminathan Detchanamurthy. We know their professional attributions, a small curriculum, and also links to pages such as LinkedIn, where we can see in practice what they have done so far and we have proof as well as the information provided. However, about the cryptocurrency lawyer and chartered accountant, we don’t have details about those involved. We only know the professional roles for the project to become possible, and their brief resumes. It would be essential for us to know who would fill each of these vacancies; we would need to know them individually to convey a certain trust. It would be necessary for their full names to be informed, as well as their professional resumes, including previous jobs (so that we could get an idea of what experiences they have), as well as how these people relate to our blockchain. Overall, I think the feasibility is high, but some points could improve. ", "q1r": 4, "q2": "The proponent determines 3 KPIs to analyze for progress development (Creation of legally compliant business entity – registered legal entity; Confirmed Token Classification; Complying to legal responsibilities in local and international locations). The project's progress will also be tracked with regular meetings with legal and accounting professionals to ensure progress and task completion. But how often would these updates be made? I believe that it is necessary for the proponent to better detail what will be done so that we can monitor the construction of the project, which includes monitoring the work routine of all the professionals involved as well as the partial goals achieved. I suggest these meetings should be at least monthly. Regarding the final results, from what I understand, the proponent just repeats what is said in the measure to track the progress part; if this is achieved, the project will be considered successful. I believe that this can indeed be measured from this project, but it is not explained how this analysis would take place. As for our blockchain, how can we measure its impact for it? Did the project meet several specific challenge objectives? I think there would need to be several smaller goals, and measurable data, that would allow our community members to understand if this was achieved and how. As the proponent states that “Success is also the Cardano community adopting the project which will be calculated by the number of members onboarded to social media platforms, such as discord and Twitter.” How can we tell if new members have been added to our community if they are active, and if so, what do they do? etc. So, overall, I think this topic deserved a little more attention and depth.", "q2r": 3, "assessor": "z_assessor_2879", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7367, "q0": "As a matter of fact, there is not enough regulatory direction for ambitious decentralized, globally distributed sustainable business models on the Cardano blockchain. The author has come up with a solution to the problem. Characterizes the regulatory framework for the DAO business model, providing real-world solutions, and physical products on the blockchain. Proposed impact to challenge, and detailed description. We will build the legal and financial framework, to enable the purchase of products, physical goods on-chain. At the same time, the legal and financial implementation is correct, allowing the Cardano community to participate in the ecosystem, decentralized business. Besides, the verification of the legal and financial framework, correctness, token classification and establishment of the organization are necessary for the development of the Cardano network. Regarding Blockchain law, there will be support from law firms and lawyers in Australia, members of which advise and direct government agencies. The author recognizes the risks, and actively sets out solutions to reduce risks when the project is implemented.", "q0r": 5, "q1": "The author provides us with the necessary information to evaluate this section. The first is about the route. The project timeline and milestones are set for 4 months. The tasks in each month are presented clearly and in detail. Next is the budget. The proposal requires a $24,870 budget. In my opinion, this is a reasonable amount of funding for the work and duration of the project. The budgets are broken down, and the allocation for each job is clearly explained. Finally, about the team of team members. We know the members are all people with the right skills and experience to do the work on the project. At the same time, the author also provides presentation documents about each member, and attaches links for us to know more about the history and experiences of the members that the proposal has presented. Overall, the plan of the proposal is very good. We know how the work will be done to get to the end result of the project. Budget transparency, increase credibility and sustainability for the project. In addition, highly skilled and experienced members will spend a lot of their time and skills to complete the project on schedule. Proposal is highly feasible.", "q1r": 5, "q2": "The author provides us with indicators, to measure project progress. As the author said. Progress will be monitored by regular meetings, with legal and accounting professionals, oriented to tasks and progress, determined by registration of legal entities and completion of milestones . According to the information provided, we know the expected goals, the benefits that will bring to the community and the ecosystem. The success of this proposal is a fully operational, verified and registered legal entity; Allows purchasing of physical products by: legal chain with ADA, Native token, and financial framework. Number of members engaged on social media platforms (twitter). Clear, transparent legality will facilitate the use and development of Blockchain, Cardano.", "q2r": 5, "assessor": "z_assessor_2888", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 9042, "q0": "This project is going to have an impact through creating a template on how to become legally and financially established. This proposal seeks to enable the Algaetoken team to become a legal entity so that they can operate in the real-world and continue their mission. This process would then be reported on in a format that would allow other projects to take similar steps. This has the potential to be largely impactful as the team would become a legal entity, increasing the legal and financial influence of Cardano organization, and at the same time provide a tool others could use. The impact may be limited by the team’s specific situation and local laws, but it could have a larger impact depending upon how many are able to follow the same process. ", "q0r": 4, "q1": "This proposal is sufficiently detailed to give the general idea that this is feasible. The team is experienced in their project, and are already at the stage of development that they genuinely require legal incorporation. They have a roadmap that is detailed enough to give the sense they know what they are doing. They also have listed key milestones. The budget is aligned well with others I have seen performing similar tasks. I believe the proposal is feasible given the timeframe and tasks needed. The team intends to have a manager spend at least one day a week on this for  four months. That should be enough time to work out the legal framework and create the followup report. This proposal should be achievable by this team in this timeframe with this budget. There could have been a little more detail, especially in regards to specific legal steps taken, but overall it is sufficient. ", "q1r": 4, "q2": "This proposal has given sufficient detail to ascertain a clear plan and key metrics for success. They will work to become a fully operational business and registered legal entity, which is measurable to reviewable by the catalyst community. The tasks are clear and align with the metrics for the challenge goal. They could have done a better job expressing how they plan to report and provide details of their success to the community, whether through catalyst monthly reports, discord, github, twitter, etc. They also could have detailed how they plan to provide the model for others to follow, whether in a written report or other method. Overall, this proposal has a decent change of success, but its impact may not be as large as others. \n", "q2r": 3, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 14468, "q0": "The proposal plans to provide a legal framework as a guide for DAO organizations to help them overcome legal and financial difficulties in conducting their project. The legal issues have been an obstacle for the blockchain community to truly operate on marketplaces and sell physical products with cryptocurrencies and tokens. If there can be a legally acknowledged framework for this area, it could open a gateway for business opportunities for the blockchain community. Therefore, the impact of this proposal is great and meaningful for the Cardano community. The validity of this legal framework is ensured to some extent as crypto-related law firms and accountants are involved who work with governing bodies on cryptocurrencies and have earned their verification of the legal and financial framework that will be used for the Cardano community. The proposer is able to point out the clear impact of this for the Cardano community to join a decentralized business ecosystem. The impact is well delivered and is able to address a critical problem for the long-term growth of Cardano and blockchain community in general. The potential risks of not receiving enough acknowledgement from legal entities, the uncertainty of digital assets and tokens as well as the incompetence of blockchain system to empower businesses. These problems are well-rounded, covering all the risks from various perspectives and offering suitable mitigation.", "q0r": 5, "q1": "The timeline will be carried out in 4 months. There are clear milestones attached to each period of time, representing the progress of the proposal. The tasks that will be done are clearly presented. The budget breakdown is also provided with clarity and elaboration of what will be included in each part of the budget. For instance, for “project development”, the money is calculated based on the working hours of the Algae Token Team (with inclusion of the tasks such as project management, reporting, legal and financial advisor….). There is also a fee for registration with legal entities, which is a crucial point to present as this determines the viability of the proposal. A part of the budget is also allocated to consultancy from a blockchain lawyer and legal entities. The budget for “other expenses” is also given with listings of its sub-items. The team members are presented with their past working experiences and some with Linkedin reference. It is a good sign to see an experienced cryptocurrency lawyer and accountant in the team. The human resources of the team seem to be sufficient in terms of expertise to conduct this proposal. More positively, the proposer ascertains the self-sustainability of this proposal and no further funding will be needed in later rounds.", "q1r": 5, "q2": "Regarding auditability, it will be carried out by legal and accounting professionals through regular meetings, which gives transparency. The key metrics are the completion of the tasks such as registration of legal entities, token classification,... Although these are not quantifiable through clear-cut figures, it can be sufficient and suitable as “task-orientated” is a valid indicator of the progress of the proposal, provided that the tasks directly determine the viability of the proposal. That being said, some quantifiable indicators (can be given in the form of figures) are welcomed, I understand that in these stages most focus is placed on getting registered as legal entities. However, in the long-term plan, some metrics such as the number of revenue, transactions, businesses who adopt this legal and financial framework can be highlighted to show the progress and growth of this project. The vision of success is well-aligned with the proposal: that is to have legal purchases of tangible products through the use of tokens, cryptocurrencies,... Membership/Followers on social media (Twitter, Discord) are another indicator to measure the success. SDG goals are given at length. However, the sustainability and social contribution of this project to poverty, education, starvation… should be further explained. At the moment, it is not clear how a legal and financial framework that legally allows cryptocurrencies transitions for real-life items can help to end poverty, save up natural resources, etc. The connection is not really straightforward. But overall, the auditability is good.", "q2r": 4, "assessor": "z_assessor_4055", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Characterise the legal framework for our DAO business model providing real world solutions and physical products over the blockchain. This framework can serve as a template for similar business models", "experience": "The team has over 15 years’ experience in delivering sustainable environmental projects, with expertise in higher education, scientific publications, Information systems, Enterprise resource planning and project management, delivering commercial projects around the world."}