{"id": 420008, "author": "jx", "title": "On-chain reputation ", "url": "https://cardano.ideascale.com/a/dtd/420008-48088", "category": 26596, "amount": 10000, "description": "“Social media influencers are routinely paid by scammers to help them pump and dump new tokens on the back of pure speculation”", "f6_no_assessments": 11, "f6_rating": 1.9090909090909094, "videos": [], "media": [], "f6_assessments": [{"id": 36, "q0": "The proposal describes creating something that seems to be a cross between a new social media platform and an investment advice site. The proposal does not address the challenge brief, which calls for building effective legal and financial solutions for funded proposers. The proposal itself provides few details about the project. One of the linked sites requires an email address to receive information. The other GitHub site provides more detail about the project, although it is confusing and hard to follow. For example, the concept seems to be that on the envisioned social media platform, everyone moderates content. In the same paragraph, the site discusses the use of algorithms. It isn’t at all clear whether this is a crowd-funding play or a machine learning/AI strategy. The proposers also reference the need to run a Cardano node. It isn’t clear what is meant by this, and whether they mean they only need to download Daedalus (in order to run a node) or if they meant they want to operate a stake pool. They state that their impact comes from expressing financial reputation as a monetary value and thus “disincentivizing bad actors from spamming online disucssions.” Having read through almost the entire Github site, it is not clear how this would work. The proposal would benefit from a shorter and clear description of how they plan to accomplish the primary objective. Additionally, they probably would be better served by proposing in a different challenge. ", "q0r": 1, "q1": "The proposal would benefit from a lot more information about the team behind the project. No information is given in the proposal itself other than the name “Jan.” I couldn’t find any information on the Github site about Jan or the team.  The linked Fund8 proposal (which was not funded) provides a LinkedIn reference, but it only goes to an outdated job posting for a COO. Each step of the plan could use additional information. Step 1 involves operating a node (and was discussed above). Step 2 involves integrating with finclout-io’s API. It would be helpful to understand what entity or project is connecting to the API and for what reason. The third step states “Establish as single form of clout for financial services creators.” It would be helpful if the proposer provided a lot more detail about that idea within the proposal. Even reading through the Github site does not fully clarify what this step entails. The budget also would be improved by adding additional details. The proposer requests 5,000 for UX/UI “improvements.” It would be helpful to see screen shots or the existing UX/UI to better understand specifically what would be improved, and how this will benefit the Cardano community. The rest of the budget request is for “salaries” and additional detail around which skill sets are required would also improve the proposal. While it is a minor detail, the GitHub site lists “ccvault” as a supported wallet. CCvault changed its name to Eternl quite a while ago. Having the old reference gives the impression that the site hasn’t been updated recently or that the proposer is not that connected to developments within the community. The proposer has indicated that they are working on other proposals in Fund9. No links to other proposals were provided. Searching around Ideascale based on the proposer’s profile did not reveal any other Fund9 proposals submitted by the same person. It would be helpful to put information about other proposals in an easier to find format. ", "q1r": 1, "q2": "Neither the proposal nor the GitHub site outlines a clear roadmap. I would suggest the proposal provide this in future proposals, as it would not only help with auditability, but would also perhaps provide a clearer picture of what the proposal intends to accomplish. The proposal states that they “are using Retention rate as a key OKR for finclout.” It would be helpful to define OKR (I had to google it – Objectives and Key Results”). And I learned that OKR is a strategic framework. “Retention Rate” is not a strategic framework. Retention rate could serve as a very useful KPI. In that case, I would suggest that the proposer provide additional detail about exactly how retention rate is defined for their platform, how it will be measured, why the chosen benchmark rate is a good target, and what that benchmark rate means about performance. The PA guide references the need for an “accessible public channel for delivering regular updates” and the proposal would also be improved by a reference to this information. ", "q2r": 1, "assessor": "z_assessor_2030", "no_vca": 26, "ne": 16, "ng": 10, "nfo": 0, "vca_o": 2}, {"id": 1749, "q0": "The idea certainly does have legal implications. Though it is not one that fits with the legal or financial implementations Challenge in that it isn't focused on an outcome built to assist “funded proposers.” If rewriting, there may be a way to target these individuals as benefiting directly from your solution. Perhaps you might begin by asking funded proposers in an After Town Hall event if they could use this solution in a way that is specific to them working on Catalyst?\n\nThe solution statement is offered, though if rewriting, perhaps the author might record themself explaining each section. Then listen back and transcribe your words into each section according to what is called for in the instructions.\n\nNo key metrics are offered. It is understood that the proposer would like to help social media users remain safe from potential scammers. Again, the connection to helping the ecosystem builders that the Challenge team calls for seems missing. If rewriting, perhaps the proposer could form a Challenge team for Fund 11 that could be used for these more comprehensive legal solutions. Then the proposer can submit to their Challenge later on.\n\nOne risk is identified. If rewriting in a future round, please offer a potential mitigation tactic. For this proposal, it might begin with: \"Although these other chains may come up with a solution, one built on Cardano would offer these unique aspects:...\"", "q0r": 1, "q1": "The proposer is identified only by the first name, and no relevant skills or experience are explicitly mentioned. If rewriting, please include this, even if it is connected to the introduction of who will work on the project. If rewriting, remember the document is, beyond an introduction to your project, your way of showing trustworthiness through offering such details to build trust, among other things.\n\nThe items in the budget are a great place to start. If rewriting, consider breaking both sections down further to explain hourly rates. No additional funding is mentioned, though there are often unknowns when exploring such unknown territory; the proposal may benefit from introducing a 10% contingency fund.\n\nThere are 3 key areas mentioned that voters will find helpful in the detailed plan. Adding a timetable will help voters know how long you believe the work will take so they can decide if they agree. \n\nFuture funding from Catalyst and “crowd-sourcing” are both mentioned. Adding some rationale will help round out this aspect for voters and help the team gain clarity.\n\nThere is no mention of scaling directly, though if one were to be written, it would perhaps include such topics: 1. Website hosting, 2. Dev maintenance, 3. Coding maintenance, 4. Funds for ongoing Node operation, 5. API maintenance (integrated with Finclout.io), 6. Customer acquisition and support, 7. Continued marketing development, 8. Collaborations, and 9. future products and solutions.\n", "q1r": 1, "q2": "There are no roadmaps or milestones offered. If one were, perhaps the author could begin by laying out the significant areas of the project in order, then add the finer details under each so voters can benefit from such insights. These omissions are reflected in the score offered.\n\nHaving 10000 users on the reputation management site is the successful outcome described. Voters will like to know how you go from no users to 10000. Perhaps you can add some more thoughts on this in the proposal, if rewriting, and also offer a monthly video update from your phone, published on YouTube for community members to visit to see the latest news of your project. Many projects find this a helpful way to heighten their projects' auditability.\n\nIn conclusion, keep working! It seems there is value here! Thank you for submitting this proposal.\n", "q2r": 1, "assessor": "z_assessor_2261", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 166, "q0": "The problem presented is relevant to the crypto space as a whole. Although Finclout's whitepaper describes the solution very well, it is necessary to separate the external whitepaper from the proposal being submitted on Catalyst, because there is an intention to conduct an ISPO, so it is not clear which plan is dedicated to Catalyst and the external plan which would be funded by ISPO. The solution presented in this proposal is not well articulated. There are no KPIs with targets to project the impact of this proposal on the challenge.", "q0r": 2, "q1": "There is not enough information about the team. There is no detailed plan or roadmap. The budget was divided into salaries, marketing and UX/UI improvements, but there are no details of the estimated workload to develop the project, nor information on how the marketing campaign would be or what improvements would be made in the UI/UX, so there is no way indicate that this budget is appropriate or not.", "q1r": 1, "q2": "There is not enough information to assess auditability. KPIs were not included, only one metric was proposed, Retention rate, which is a relevant indicator, but insufficient to audit a proposal.\n\nThere is no roadmap with milestones.\n\nAlthough the problem presented is clear, the solution presented in this proposal is not. The whitepaper allows a better understanding of the concept, but as I mentioned in my previous rationale, it is necessary to separate the whitepaper from what this proposal is. Catalyst funding will be awarded based on what is proposed on the IdeaScale website.", "q2r": 1, "assessor": "z_assessor_2048", "no_vca": 16, "ne": 1, "ng": 14, "nfo": 1, "vca_o": 1}, {"id": 505, "q0": "Scammers using influencers to pump and dump new tokens is a real problem that needs to be address but I'm not sure that's the problem this challenge is wanting to address. How does \"Clout = monetary value of creator's value network\" provide a legal & financial service to funded projects? Are you building something for funded projects with token to use? The proposal does not make this clear or draw its solution directly to the challenge ask.\nWithout making this connection for the voter, there's no way to access if the impact of this proposal is the one the community voted to solve through this challenge. \n\nThe proposal also does not provide any information about risk this proposal faced of being implemented and how it intends to mitigate those risks. ", "q0r": 1, "q1": "The proposal does not provide a detail timeline or milestone. There's a list of three deliverables with no detail about what each of those entails or when they will be delivered. \nThe budget is a two line entry with no details about each item? What salaries will be paid with the 5K?", "q1r": 1, "q2": "The proposal does not provide any information about how to plan to mange the work internally (project manage) or how the plan to make regular updates to the community so they can follow along. \n\nThe proposal has one definition of success. Would have love to see that tied directly back to the challenge's definition of success so the community can easily access if the thing being delivered is the thing the community asked for. ", "q2r": 1, "assessor": "z_assessor_2098", "no_vca": 15, "ne": 0, "ng": 15, "nfo": 0, "vca_o": 1}, {"id": 1070, "q0": "The 17 words in the solution description field look to me like the first ideas for a draft submission, as they do not form complete sentences. They combine in 4 rows containing 4 short statements, that I am unable to make sense of together. From the attachment provided, I can gather a little bit of additional information. I understand that the proposer is probably looking to build a news website, moderated by people that takes place on a blockchain, that is proof of work and proof of stake at the same time.\nThe rest of the questions from the impact section also contain very short answers. “Solana or Ethereum are faster in implementing similar proposals” for example, is the answer provided for the risk mitigation question. It is impossible to comment on this answer, as I am not entirely sure what this project is about.\nOtherwise, I couldn’t say if the proposer hasn’t had the time to finish the proposal, or if the intention was to submit it in this form.\nRegardless of this, I am unable to assess the impact section of this proposal, as such, I will score it a 2.", "q0r": 2, "q1": "The detailed plan field matches the impact section, in being very lightly drafted, with short sentences lacking any kind of context or detail. The proposer has provided 3 steps for the delivery of the proposal. He has, unfortunately, not provided us with any timeline or additional details about the implementation stages.\nThe budget of $10000 is divided into two equal parts described as being for marketing and UI and the other one for salaries. Salaries for who, how long or how many people? It is not explained. There is no other metric included, nothing that would better help to judge the budget.\nAnd regarding the team’s skills, there is no detail provided. Each of the two jobs described in the budget field looks like they will be outsourced to someone else.\nGiven the information provided, I cannot judge this proposal as being successfully implemented at the moment.", "q1r": 1, "q2": "Since there is not sufficient information regarding what the proposal is about, I cannot judge the answers too well, in either the project’s progress question or in the success definition one. As a metric for the project progress, the proposer mentions retention rate, but I’m not sure if this can apply as an answer for the progress of the proposal, but rather as a way to gauge its success.\nAnother detail I have noticed, the proposer has provided an Ideascale link, for the question asking if this is a continuation of a previously funded proposal. While looking at the linked Fund 8 proposal, I went to the results table from Fund 8 and searched for it. What I found out is that not only was it not funded, but it was also not approved.\nI don’t know why this was the answer, maybe the proposer misunderstood the question, but I thought it was interesting to mention this aspect, as well.\nGiven the stated aspects, I cannot agree that the proposal can be successfully audited.", "q2r": 1, "assessor": "z_assessor_2192", "no_vca": 16, "ne": 4, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 2954, "q0": "This project is well taught and yes indeed social media influencers involve themselves in most pump and dump schemes in various ways which hurts cryptocurrency adoption. First of all, reviewing the challenge brief, there are some key understanding of some success metrics which needs this project to adhere to in other to satisfy the requirements of this challenge setting. we can look at a KPI of the challenge category which looks at the use case of this project and in my view, there is no use case by the already funded project to utilize what this proposer intends to offer. Also, have a look at the impact of this project being mutual to already funded proposals, this project will bring about mutually exclusive effects on already funded projects. This project dubbed on-chain reputation doesn’t look very scalable concerning how it is going to relate to an already funded project given legal and financial issues.", "q0r": 3, "q1": "First of all, I think we need to have at the back of our heads the challenge setting vision which is to be the benchmark for any project submitted under the challenge category. It is to note that this challenge looks out for the project that helps to implement legal and financial boundaries and framework for existing funded projects.\nWith a close look at this project, there seems to be insufficient information on the detailed plan which also looks at the key milestone for the project delivery. Given the relevant skills and experience needed there was an elaboration on that and also from the look of things it seems most of the project will be outsourced to a third party and of which the catalyst community has no means to verify the potential of the third party. There is a poorly detailed budget breakdown to ensure transparency in the use of funds. I believe the catalyst community needs to know a bit of a detailed budget which is broken into identifiable elements.", "q1r": 3, "q2": "The catalyst community needs assurance with regards to funds entrusted into the hands of proposals to help ensure the progress and success of a proposal. Given this project, there is no sufficient road map or a concise measure of progress. The proposer only made mention of the use of retention rate and of which cant be enough to be used as a measure of success, a key challenge category KPI which looks at the use case of this project is relevant to the already funded project in line with the legal and financial issues they face after being funded cannot be found in this proposal. ", "q2r": 3, "assessor": "z_assessor_2371", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 6706, "q0": "We have a very poor proposal from top to bottom. The problem statement is as follows: social media influencers often receive remuneration from scammers in order to promote their fraudulent projects. The solution is “financial clout” derived as monetary value from the network, but unfortunately the proposer does not go into the details of what exactly that means. In the detailed description we have another 20 words to make sense of the solution: clout is the value of the network, follow (user actions perhaps) become investments, and likes become shares, this value becomes social proof. I hope you understand better now. I did not. \n\nGiven the clear lack of curtoasy presented by the proposer in detailing the solution, only one star is deemed sufficient for this section.  ", "q0r": 1, "q1": "This proposal would be a one man show. Jan woud assign a marketing contract to a relevant party and sign a contract with a relevant vendor. Sadly we have no further material to work with \n\nThe detailed plan contains around 15 words, let’s summarize them here. :). Step 1 - operate Cardano node. Step 2 - integrate it with an online API. Step 3 - establish a single form of clout for financial services creators. Success! \n\nUnfortunately this proposal looks more like a draft than a serious proposition, so again, only one star. ", "q1r": 1, "q2": "Proposer states that he will be using retention rate as a key indicator for the application. Success will mean having 10k creators using the platform to manage the reputation. Again, we sadly have an unfinished proposal ahead of us. Two stars. ", "q2r": 2, "assessor": "z_assessor_2824", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 7070, "q0": "This project has been thoroughly explained. Social media influencers do, in various ways, participate in the majority of pump and dump schemes and this has a detrimental impact on the adoption of cryptocurrencies. The suggested problem's solution hasn't been given much in the way of depth. It was succinctly written by the author, who didn't go into great depth on the steps that would be taken to properly address the issue at hand. To fulfill the requirements of this challenge setting, this project must adhere to a few key understandings of specific success measures. In terms of how it will relate to projects that have previously received funding, this project doesn't appear to be highly scaleable from a legal and financial standpoint. In my opinion, there is no use case by an already funded project to utilize what this proposer plans to supply.", "q0r": 3, "q1": "There doesn't seem to be enough information in this proposal on the precise plan or the significant project delivery milestone. There was no further explanation given the pertinent knowledge and experience required. There is no information supplied on the team members and their specific skills, making it impossible for us to get to know them and fully comprehend what their roles entail. What I didn't get was names, responsibilities in the project, a brief history of prior work, and more information than I wanted to know about how these people fit into the Cardano ecosystem and how they interact with our blockchain.\nThe requested budget is not transparent, and there are no specifics regarding how the money would be spent. I think the cataly community has to be aware of a detailed budget that is divided into distinct components. Furthermore, The proposal recognized potential risks that might affect the success of this project, but it did not offer mitigation strategies. All things considered, this project cannot be feasible enough.", "q1r": 2, "q2": "For a proposal to advance and succeed, the catalyst community needs assurances about the finances entrusted to these proposers. There isn't a clear road map or a straightforward way to track progress for this project. Retention rate was the sole growth metric mentioned by the proposer, which is insufficient to be used as a success indicator. This proposal lacks a crucial KPI that examines how this project's use case relates to projects that have already received funding in light of the financial and legal difficulties they have encountered as a result of that funding.", "q2r": 2, "assessor": "z_assessor_2869", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 7907, "q0": "If you search “cardano news” on YouTube you will mostly find videos, price predictions and similar click-bait titles. I now only listen to a handful of channels to get a good, unbiased, non-paid view on what is happening in the Cardano ecosystem. I had to work through all the noise to get those handful of content creators and everyday it seems a new “expert” emerges. Most people don't have the time to go through lots of content/channels to find what is good content so they are a target for top influencers.  \n\nIn the world of crypto, top influencers are being paid lots of money to promote coins or projects that they are not even part of. Take one of the most popular crypto influencers for example. He does a dedicated review for USD 35,000! He has been called out for promoting projects that he is not a part of and projects that lost the investors their money. \n\nThe proposer offers a solution to this by having a “Financial clout derived as monetary value from the creator’s value network”. Users providing in-depth views on certain projects in a social setting where nonsense can be quickly called by peers out and being paid for it comes across as a win for all, except for the scammers :). This would be a huge improvement from the current YouTube shillers and TickTokers we have at the moment, however I cannot see this proposal as meeting one of the objectives laid out for this challenge. ", "q0r": 2, "q1": "The proposer’s url link points to a website that is already in full flow. The proposer boasts “15+ years building consumer-facing products” but no links are provided to point to such products. Providing references to past works goes a long way to showing the reader what you are capable of and may also promote the probability of future success. \n\nRegarding the risks, the proposer indicated that “Solana or Ethereum are faster in implementing similar proposals” but does not explain how these blockchains are faster at implementing them.  \n\nThe budget is not clearly laid out and items are lumped together. It is rather discouraging to see that the budget section consists of just six words. The proposer should outline what makes up the amount for “salaries” and also split the “marketing and UX/UI improvements” showing how much each part is worth. A detailed budget shows the reader that the proposer has taken great care preparing it. ", "q1r": 1, "q2": "No timelines or roadmap was provided, just a list of steps to complete. The proposer did not spend a lot of effort on this section which makes it difficult for an assessor to give a good rating. A roadmap containing tasks to be completed with a timeline needs to be shown so that the reader can see the outlined progression of the project.\n\nThe proposer does not  provide any way for the community to audit this proposal. Since the proposer already has a website, (s)he can keep the community informed by posting updates on their calendar at: https://app.finclout.io/calendar.", "q2r": 1, "assessor": "z_assessor_2935", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 9045, "q0": "This proposal seeks to extend funding for a previously funded project. The goal is to develop a reputation based source for crypto news to help reduce the amount of false information surrounding crypto. This project would make a positive impact for the legal realities facing Cardano, especially as more truth is shared about what Cardano is and what it is not. Also, working to limit the amount of scams running on Cardano that take advantage of false information is a win for the network and community. Ideally, there would have been an attempt to connect this proposal to the specific challenge goals. There is a lack of detail here that lowers the score from a 5 to a 4. The statement about financial reputation being expressed in a monetary value is correct, but there is no further detail tying that to the specific challenge goals. ", "q0r": 4, "q1": "The fact that this proposal is a continuation of a project underway makes this proposal just a little less incomplete, but there is a good amount of detail lacking that makes assessing it rather difficult. I am making assumptions that the team is qualified and capable of moving forward with the goals, but there is no real detailed timeline, just three steps, and based upon the updates on the comment thread of the previously funded proposal, this step has already been completed. It would have been better to provide all the updated details in this proposal because many assessors are new to the community and may not be aware of all the progress made, nor the connections to the community. I feel that this is a problematic approach to creating proposals. The team member detail is vague, it just says Jan, who will “assign marketing contract…” and “assign UI contract…” Again, too little detail to be rated higher. I am making a good faith assumption that Jan is qualified and competent to accomplish this. The budget is also really vague. No mention of hours worked, timeframe for work, or number of people or agents hired.", "q1r": 3, "q2": "This is a proposal that is for a funded project that is already at MVP status and functional. The next hurdle is marketing it and growing the audience. The goal is clear, to see a total of 10000 creators on the platform. This is a feasible goal given the nature of the plan. The proposer is already part of the Catalyst ecosystem and is aware of the reporting requirements. So again, I am making an assumption that this proposer will continue submitting regular update reports to the Catalyst team. I would really like to have seen that detail here in the proposal. The key metric for success is retention rate, and based upon my experience of the platform, that will be key to seeing this project grow successfully. It is likely this could have been given 5s if there had been more specifics in the key areas.", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 12414, "q0": "The issue brought up in this proposal is the rampant amount of disinformation from new token projects that are based on pure speculation and hype. The proposed solution is to make a platform (named Finclout) where the users can review the projects posted there and given monetary incentive for it. The premise is user will determine the value of a project and acts as a “score” for other users to see. The idea can add value giving user more information and peace of mind when they decide to invest in a project and in turns providing ways for projects to seek financial supports, which is aligned with challenge setting objectives. The planned features of the platform are explained in details in an attached whitepaper. ", "q0r": 5, "q1": "This proposal did not provide enough explanations regarding its budget and roadmap. The roadmap only mentioned some pointers regarding the milestones of the project but did not provide any timeline for the completion of the milestones. Without these information, the feasibility of the roadmap can’t be evaluated. The budget also lacked details since it only mentioned “5000 for UX/UI improvements” and “5000 for salaries”.  Without explanation on the total workhours and hourly rate requested, the budget also can’t be evaluated. Overall, the feasibility aspect of this proposal will need to be reworked to add information regarding the project timeline and budget breakdown so it can be evaluated properly.", "q1r": 2, "q2": "The KPIs chosen by the proposer is the retention rate of users which is a relevant metric to measure the performance of the platform. However, metrics to measure the platform growth (i.e. new monthly users/developers, etc.) or ways to measure the users participation (i.e. number of reviews by users in a month, etc.) can also be beneficial to track the platform performance. Overall, the KPIs right now is adequate and relevant but more metrics can be added to track the project performance and information on where the metric will be reported would’ve been appreciated.", "q2r": 4, "assessor": "z_assessor_3408", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}], "solution": "Financial clout derived as monetary value from the creator’s value network", "experience": "15+ years building consumer-facing products"}