{"id": 420390, "author": "cargofe2", "title": "LATAM Legal and Regulatory MindMap", "url": "https://cardano.ideascale.com/a/dtd/420390-48088", "category": 26596, "amount": 15000, "description": "There is no practical tool containing the legal and regulatory framework by country to provide clarity for non-lawyer users. ", "f6_no_assessments": 8, "f6_rating": 3.9583333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 14249, "q0": "This is a proposal with little impact. As described, the proposal would establish a legal mind map of Latin America, starting with the Andean Region at Fund 9. The proposal posed a problem that was only partially relevant to the challenge. Because Challenge aims to build a team of legal professionals who can provide legal solutions and consulting services to sponsored proposers. However, this proposal answers the question, \"How do Latin Americans understand and think logically about the legal system?\" This is a rather broad issue. They do not focus on solving the problem that Challenge aims to be a legal solution for sponsored proposers. Through this proposal, people in Latin America will have a comprehensive legal mind map in all aspects. They will be knowledgeable about the Latin American legal system. However, in response to the question \"What value does this proposal add to Cardano?\" It is very difficult to answer. This may be applicable to some funded proposers in Latin America who can legally use the proposal to initiate and operate the project. This is a proposal that can grow in the future if it is properly oriented and well run. The solution they came up with was to build a legal map that describes the legal structure of a country on any given topic. began in the Andes, then spread to other Latin American countries .. That way, users can look up related concepts based on a topic or key words, which are represented in mind maps. .. They had a perception of the risks that may be encountered when implementing it, which is the complexity and richness of legal provisions. It is not only the law but also the resolutions and directives of the public authorities, which are very difficult to find. However, that risk can be completely overcome by associating with experienced lawyers to limit the risk. This is not a bad idea. Although it is not really suitable for the challenge, I think they can completely fix and edit some points to be more suitable. In order to be able to provide legal solutions to the sponsored proposers, they can create a legal map in the blockchain field with several topics: conditions for establishing a blockchain startup? Tax? Copyright, intellectual property? What legal frameworks apply to a project? Security? Smart contract? What are the legal regulations related to blockchain? So, I have not really appreciated the impact of this proposal.\n", "q0r": 2, "q1": "They have detailed plans for the proposal. The proposal will be completed in 3 months, starting from 10/2022. The first month: researching and compiling content. Next month: building websites and information structures. Last month, we put the website into use, improved the image, and evaluated the impact on users. I appreciate the proposal being divided into 3 certain timelines. However, where possible, more detailed planning is recommended, e.g., what areas of legislation will be studied and documented? Is the document fully updated or just some important text? With a legal issue, what legal documents will the proposal provide? What to do in case some terms are changed, canceled, or expired? How do users approach this mind map? Is there any effective communication and marketing plan? A lot of problems need to be solved. You should make a clearer and more detailed plan to estimate a suitable time. 3 months is actually quite a bit to do all the work. Besides, the goal of the proposal is to build a foundational tool, a legal mind map. However, there aren't any specific metrics about the legal content in it. For example, How many topics are in the mind map? How many users will the proposal reach? The current goal of the proposal is actually quite vague. We can check out their legal mind mapping progress and results right on their platform. In terms of budget, the fundraising budget of this proposal accounts for only 3% of the total challenge. They mentioned a funding budget spending plan, but I wonder what \"Additional cost for countries: $3,000\" means? For how many countries? The fundraising budget does not have additional plans and no marketing communication budget. If the proposal's issues were to be improved, they would have to recalculate the funding budget. The team consists of 2 members: a lawyer and a professional designer. They have the qualifications and experience suitable for the proposed work. The community can verify their identity via Linkedin. However, they do not have a specific task assignment. The idea of the proposal is quite good. But to get good results, the team needs more detailed and clear planning. For example, for a topic, what content will be provided to the user; possibly relevant legal documents; practical examples of application and solutions; duration of the document copies, related documents with the same content, ... can contact the government agency to update the most current information. So the score for feasibility is low.\n", "q1r": 2, "q2": "This proposal is not really easy to control for transparency. The proposal only provides the goal of successfully building the platform; there are no other metrics to measure the success of the project. If one is only building the platform, it is not possible to properly assess the success of the project. We need to add other metrics: quantity and quality of content in legal mind maps; number of users accessing the product; number of visits per day, month, quarter, and year; reviews from platform users. The success of the project is creating a mind mapping tool and synthesizing legal documents, providing the people of Latin America. As mentioned in section A Impact, this project is not really related to the challenge. If it is possible to develop blockchain legally, it will help more funded projects in Latin America, which will be related to the challenge. This is a brand new product and has not been tested. I do not appreciate the transparency of the proposal.\n", "q2r": 2, "assessor": "z_assessor_3950", "no_vca": 3, "ne": 2, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1168, "q0": "The proposal effecitively addresses the challenge as it aims to deliver a legal mind map (or concept map) for the Latin America legal landscape, allowing users to understand legal concepts in a graphical way. This tool could in essence help people to find an answer to a legal matter and help them advance in their project (of course, if based in Latin America).\nThe team aims to expand this legal map to include the legal landscaping of other geographical areas for the next funds. ", "q0r": 4, "q1": "The team wants to deliver a web page displaying the above mentioned mind map. There is no indication if this map will be interactive, if the topics will be clustered by keywords and if so how many keywords they are targeting.\nThe budget also does not take in account the marketing expenses needed to advertise the website to help not only the Cardano community but potentially also other blockchain projects operating in Latin America. \nMoreover, I see that this proposal could be easily part of a bigger proposal https://cardano.ideascale.com/c/idea/416507, which aims to do the exact same way, by EMBEDDING the map into an AI tool. \n", "q1r": 3, "q2": "Although the team accounts a member who is familiar with Catalyst and has already been funded, I don't see the level of precision in the brief to reach a full score. A mind map which maps the legal landscape of a country is requiring months to be built. Just in Brazil there are about 180.000 laws. How do you tackle this huge number ?\nAlso the KPIs are a bit vague. the team states \"Monthly reports will be presented with precise data on the evolution through percentages\".\nAre these percentages related to the number of keywords addressed ? or the number of laws analysed ? \nIs there a number of targeted users per month ? \nAlso, if a user will have any doubt after having used the map, will he/she be able to reach you and ask for clarifications ?", "q2r": 3, "assessor": "z_assessor_2215", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4689, "q0": "The problem is clearly defined with no practical tools with a legal framework this is an issue to be solved and it is related to this challenge. This solution solves the problems of the challenge they have drawn up the legal map of Latin America, in different periods starting from the Andean Region. Authors should also be aware of the risks they may take when undertaking a legal research project, the greatest of which is finding the right legal information and keeping it up to date.", "q0r": 5, "q1": "The goals are set out clearly and specifically by the author. This is a project involving in-depth legal research on the subject and in each country. The progress of the project also makes it easier for the community to follow. The success of the project is to create a tool to help emerging projects at Catalyst solve legal problems. The legal mind map is opened to help more people access and avoid making unnecessary mistakes. This is a good proposal, if it is more widely spread around the world, the legal issues will be better solved. Creating a legal mind map as a solution to this problem is a very useful implementation for idea proponents and people working in a country, without having to fill them in. . By creating legal maps we are helping communities to access their laws, which is a tool that is scalable to all Latin American countries.", "q1r": 5, "q2": "The KIP indicators are tracked monthly by the author of their work progress. These metrics are easily measurable by logging into their website. The monthly report will be presented with accurate data on the growth via percentage giving the followers a better overview. The team consists of 2 main members: Carlos Gonzalez is a specialized artist presenting the concept and Mateo parade is a professional designer, their experience is suitable for this challenge. The author's identity is easily identifiable. The proposed funding budget of $15,000 is less than 20% of the total challenge budget. The budget is broken down by the author into small amounts that match the expenses of the entire challenge. This proposal is a brand new project and is awaiting funding.", "q2r": 5, "assessor": "z_assessor_2608", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8913, "q0": "Providing a tool where people try to understand the basic laws and regulations of the country is great project where people can be self reliable instead of adopting costly lawyers , this can also help people in understanding their rights more effectively , by providing a map where people try to understand the laws in simple manner and providing data in native language is great idea  hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Since the proposer is working as lawyer for more than 8 years and has been in catalyst project since fund 7 ,he can use both of these experience in providing a simple structure of law with cost effective and complete the project.\nSince lot of translating tools are available in the market he can make use of them to translate the laws in simple and easy manner , so provided experience and plan presented it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposer could have introduced his team in better manner where he hasn't mentioned about their expertise  field. The proposal has clear idea of making laws simple where he can achieve by his self experience in law.\nThe presented plan has well structured timeline and decent budget breaking , the proposer wants to make a report on every month end to check the progress of his project which surely is an good key indicators to measure. hence the plan presented it is highly likely this proposal will be implemented successfully", "q2r": 4, "assessor": "z_assessor_3008", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 12374, "q0": "Especially for non-lawyers it is very difficult to get an overview of the legal and regulatory regulations. Not every startup/developer has the budget to afford a lawyer at the beginning. This often leads to the fact that such projects can eventually come to legal problems, which means the end for them. Therefore, it is very important that the legal framework is offered publicly in an easily understandable way. Especially in the system of a mind-map it makes a lot of sense, because it can be structured better. Unfortunately, only a small part of the world is covered and it remains questionable which regulations are really included. Certainly not all of them are relevant for the Cardano community. Nevertheless, the idea is very good.", "q0r": 4, "q1": "In the proposal, you can also see which team will be working on the Legal Mind Map.\nThe lawyer (Carlos Gonzalez) is a specialist in public law and regulatory law, which fits very well with this topic. Especially in regulatory (supervisory) law, many important rules for crypto providers occur. Therefore, this should be the main focus.\nUnfortunately, there is not so much information about the web designer Mateo Parada, but it seems that he is active in graphic/web design.\nI can't give full stars here, because I know from my own experience that it is basically not easy to find the right information and then to present it easily, especially as a single lawyer. Therefore, I also suspect that legal researchers are needed.", "q1r": 4, "q2": "It is very clearly structured as to when the community will see the first results. In the second month (November) the website with the content will be released. This page will not only be updated continuously, but there is also an extra section with the progress. Also the final success - which should never happen, because the regulations are constantly changing - can be seen on the website. The project can be built upon and is easily scalable.", "q2r": 5, "assessor": "z_assessor_3405", "no_vca": 3, "ne": 0, "ng": 2, "nfo": 1, "vca_o": 1}, {"id": 13835, "q0": "Having a legal map of LATAM will help entrepreneurs and project developers to develop and implement their proposals. Cardano Catalyst can really profit from a dynamic and well built legal framework for their proposals and complaint implementation as blockchain technology and Cardano Catalyst is still a growing community that still has a long way to opening their road in the practical and concrete world. Consistent legal framework might be the cornerstone of the Cardano Catalyst project implementation in LATAM for those entrepreneurs and project leaders that aren’t lawyers themselves or that don’t happen to have a legal expert in their teams. The decentralization of legal information can be decisive at the time of promoting new projects and expanding and outreaching Cardano Catalyst influence. This proposal effectively addresses the challenge in which it is submitted as it will help LATAM projects broaden their horizons with an efficient legal framework explored and established.", "q0r": 5, "q1": "This project leader is a specialized lawyer that certainly knows the legal LATAM field. And as he has also presented several already funded proposals in previous funds it is a safe guarantee that he is well acquainted with Cardano Catalyst internal dynamics and timelines. Key milestones and budget is consistent and down to earth. It might be missing a developer that will help him and the dessigner he onboarded but knowing he is an proactive and experienced member of Catalyst it is to say that he will not find any hurdles at the time of finding an experienced developer that will help him develop the platform he is intending to create. Given experience and the plan presented it is highly likely this proposal will be implemented successfully. ", "q1r": 5, "q2": "From the second month the web page will be available at all times for anyone to audit the progress of this team work. Monthly reports will be shared with Catalyst Community and as this project leader is well acquainted with the Community and have already funded proposals, he has already put up with strong communication channels where to share information and milestones achieved. Some KPIs and metrics for the success stage of this proposal might be needed in order to correctly audit the finalization of the project. Number of projects or entrepreneurs that reached its webpage for information and legal framework might be easily gathered. ", "q2r": 5, "assessor": "z_assessor_3833", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 13903, "q0": "The project clearly addresses the Challenge objectives as will provide information in form of a mindmap of the legal context in some Latin American countries, in the Andean and the South cone regions. That information will be key for many projects that are aiming to do business in Latin America.", "q0r": 5, "q1": "The Lawyer seems to have the proper experience, as it has a Master at Law with several years of experience. The designer has less experience (4 months) but they do provide the skills to produce this proposal.\nThe timeline is detailed and provides proper milestones and dependencies, with a coherent timeline. A potential difficult could be reaching the proper deep of analysis as the scope aims to do it in around 10 countries.\nThe budget is well explained by role and type of assignment with rates that are ok for the professions.", "q1r": 5, "q2": "The auditability is being provided on a monthly basis by following the timeline and its deliverables which is ok. Though no outcome metrics are provided in order to measure the Return on Intention of the project. I do consider anyhow that the project will be auditable by the community", "q2r": 4, "assessor": "z_assessor_3844", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 14806, "q0": "The proposed solution is elaborating legal mind map to help users have a grasp of different legal structures of different states in Latin America which I think is aligned with the challenge. In terms of the detail explanation of the solution: I only see that the team has given the definitions of “legal map” and “mind map” , but no mention how they will create the mind map, for example, how to gather information, what is the main concept, how they will structure these information in a meaningful and comprehensive way, how they assure that users will get a good overview of all the legal facts. Besides, the team did not mention where the mind map will be delivered and how users could have access to it. The team says their goal is to create a “practical, versatile, useful and updatable” tool, but did not explain what they will do to achieve that goal. Also, the proposers haven’t pointed out the positive impact that this project will have on Cardano ecosystem. In general, I think so far, the team has just presented an idea/a goal that they wish to achieve and hasn’t gone into details about how they will do to implement that idea.", "q0r": 3, "q1": "The same lack of information could be seen in the plan that the team has provided.  The team has presented a plan with activities based on months, but no specific deliverables or KIPs were mentioned. Almost everything is vague, for example, to structure and choose a dissemination tool, the team says “there will be a specially dedicated web page”, but I think they could have given a specific name instead of saying it in a general way. About the budget breakdown, there are some parts that need to be better explained, for example, for the “Additional costs for countrys”, the proposers should have stated what these costs are, if the team can not point out exactly what they are, they could have added a note to explain why these expenses are needed and how it affects the project. About the team members’ experience, considering the proposed solution, I think they both have relevant experience to carry out the project", "q1r": 3, "q2": "The team has mentioned a web page where monthly reports will be posted this web page will also be open to public. However, there are no key performance indicators to measure the project’s progress or any criteria to define the team has accomplished the goal of this project. For example, some indicators that could be used to measure the project’s progress include: number of users accessing the map, reduction in the number of Funded proposals encountering legal issues,….", "q2r": 2, "assessor": "z_assessor_4102", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "We will elaborate the LEGAL MIND MAP OF LATIN AMERICA, in different stages starting with the Andean Region. ", "experience": "Specialized lawyer, CA, financed in fund 7 and 8. 15 years of experience in law, with extensive contacts in Latin America in the legal sector, Master in Applied Political Studies"}