{"id": 421139, "author": "ngwari", "title": "For Cardano, Accountants & Lawyersl", "url": "https://cardano.ideascale.com/a/dtd/421139-48088", "category": 26596, "amount": 79183, "description": "PA 4% growth in accounting demand is expected by 2030, a surge in the global shrinkage of accountants and lawyers, and the Cardano community will struggle to grow. ", "f6_no_assessments": 12, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 6716, "q0": "This is an interesting proposal that might have indirect effects on future Catalyst proposers, so I judge its overall impact as moderately positive. Let’s dive into it. \n\nWe have to start from the problem statement brought forward by the proposer - that the world will experience a growing demand for accounting services in the next 5-7 years, and that there is a global lack of supply for such services due to a diminishing number of new accountants. While this is a useful statement to begin with, it would have been beneficial for the prosper to quote the source of these estimations, since usually trusted niche market reports are hidden behind expensive paywalls and it is not very easy to verify the information or at least the assumptions behind it. \n\n\nThe value proposition here is thus to upskill and introduce blockchain literacy to a significant number of accountants and lawyers from Zimbabwe through organizing a dozen 4-to-6 week courses and engaging up to 900 participants, new graduates as well as practitioners. Of course, such a training program can only be launched after the trainers are already knowledgeable of current industry standards, legislative frameworks and also delivery mechanisms that can efficiently get the message across. \n\nI think it’s worth mentioning two forces acting as catalysts for this proposal. First, Africa is definitely the number one target for Cardano in terms of development and deployment of resources.  A most important example of this is the activity of IOG, since, as a reminder, one of Charles’ mission is to bank the currently unbanked. A second catalyst is the fact that the project can tap right into Zimbabwe’s high unemployment rate and ensure high attendance rates for their courses. Of course, this last point does not ensure its success, but it is nevertheless a necessary precondition for a solid project.\n\nHowever, I also see two possible headwinds for the project. First, it is worth mentioning that usually training courses have a “sink-in” period following the course being finalized, during which participants usually digest the information received, and slowly build the internal mechanisms that allow them to put into practice the newly acquired competency. This process is of course longer in the case of new technologies like distributed ledgers, which for many people, accountants included, is very challenging to wrap their heads around it. A second point connecting to this is the geographical distribution of proposers, which, if not being in full alignment with the target of the course, increases the risks of obtaining sub-optimal long term effects. And at least currently, this might be perhaps the care in the target geographical area of this proposal, but this would have to be of course validated by hard data which currently is not really available. \n\nConsidering that the forces identified above influence in both directions the proposal’s potential impact, and also considering the only indirect effects on future Catalyst proposers, I think four stars are appropriate for this project’s impact rating. ", "q0r": 4, "q1": "The roadmap of the project would be rather quick to roll out, and the proposers pledge to start the courses as early as September this year. In phase 1 a market research would be performed, and course developers would be onboarded. The second phase would bring to life the necessary recordings (since online delivery is of course one of the approaches chosen) and the necessary software would be purchased. Eight weeks from the start, the first courses would be organized, but this would be preceded by a marketing campaign to popularize the courses. \n\nThe budget section is fairly granular and very well built, clearly a sign that the proposers have put a lot of effort into coming up with a viable proposal. There are however two areas which, given their importance in the overall budget, should have been better described. First, the bulk of the money goes towards course development, which, if I understand correctly, will be shared between three companies, Trellis Training, Dope Crypto and Dash Stone Advisory. An excellent budget would have perhaps made the distinction between these three partners in terms of revenue share. Second, there is a rather significant budget caption set aside for ERP software purchasing, and it would have been very useful if the proposal contained a bit more details as to which solution exactly would be purchased, or even if such a decision had already been made.\n\nThe proposal also contains sufficient information with regards to the team behind. We are indeed offered four profiles, with sufficient information as to ascertain each member’s background and areas of expertise. And they are indeed fit for purpose. They all have Zimbabwean background and very diverse profiles, which is of course a strong point. It would have been excellent if the proposal included links to their media profiles (Linkedin for example). They do exist, I’ve checked them, but it’s always a sign of goodwill to be fully transparent with the team backing up a project. And as a personal note, an up to date profile photo works wonders in terms of immediately increasing the project’s legitimacy. Sadly this is not the case here.  \n\nConsidering all of the above, I deem four stars to be appropriate. ", "q1r": 4, "q2": "You will not find many proposals that offer this level of detail about what the proposers consider to be  a successful project. Right from the start the team offers targets which are feasible, yet challenging, and if reached, would signify that the total cost of training one accountant or lawyer to a high standard in blockchain technology to be under 1k USD, which is a fairly good result in my opinion. So, the team sets out to train up 120 course participants in general industry standards and slightly less, under 100, in smart contracts capabilities. \n\nAnother interesting side story of the proposal is that they mention rolling out an internship programme, but we are unfortunately not offered any details about any partners for this. They also state as one of their success indicators the fact that most of the trainees should be paid market based wages following the course completion. We are however not being shown the actual way in which this will be implemented. Will they have access to country relevant statistics, have they thought about a long term follow-up plan to keep track of their trainees’ jobs and current salaries?   \n\nAs a last point, the proposers also mention being able to sustain themselves financially after a one year period. While in itself this is indeed an excellent target, I would have liked to see a proper plan in place in order to reach financial independence so quickly. We are sadly not offered any indication that this topic was carefully analyzed: there is no indication of what kind of pricing would be involved, and what would be the addressable market, which of course is different from the similar market when the courses are offered for free. Do the practitioners have the means to pay for such courses, and is the market practice conducive to such practice in the target areas? \n\nIn conclusion, we have a good basis for ensuring auditability, but the proposal should have included much more details regarding the long term plans of the project, especially the financial sustainability and the internship program. For all these reasons, four stars I deem as sufficient. ", "q2r": 4, "assessor": "z_assessor_2824", "no_vca": 4, "ne": 3, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 1169, "q0": "\nThe proposal addresses the challange as it aims to deliver a series of courses for students and professionals in Zimbabwe in order to upskill them and make them ready to satisfy the market of Public Accaountants, whose demands is expected to grow 4% by 2030.\nThe team has already partnered with WADA and their courses will be available on GeniusU e-learning platform. \nThe team is part of a company, Outsource Zimbabwe, who counts on zimbabwean with an international experience who came back to their mother land and want to help other nationals to upskill and reduce the unemployment rate in the country. ", "q0r": 4, "q1": "\nThe success of this proposal depends on several factors. First of all, the course content needs to match the skills required by the PA in the job market. \nSecondly, as stated by the team itself, some professionals might not have the IT skills to face the contents of the course, while some students might not have access to electricity/resources. I would suggest in order to mitigate the risk, to avoid real time lessons of course, and record the lessons to make them available on a later date. \nI disagree on the forecast of the unemployment rate reduction. Enrolling 900 students is not likely to decrease the unemployment rate of 80%, but at top 8% within the PA population.\nThe budget requested (around 80000 usd) is likely to bring the team to the project completion. \nI see the timeing being a bit too optimistics. The forecast for the first course delivery is september 2023, which is BEFORE the funds distribution for Fund 9. \nPlease reconsider the timings for getting funded. ", "q1r": 3, "q2": "Lack of information:\nI didn't find a description about the assessment method to accredit the students at the end of the course, and if this could be included in the cardano blockchain to make it another use case on top of what is happening in Ethiopia schooling systems (grades certified on the blockchain). \nI didn't find an outline of the course content. Yes, I see in the timeline that team has stated the course development is supposed to happen in the first 4 weeks, but getting an idea of what the module titles would be could help to rate the proposal better.\nOther remarks\nLack of clarity: it is not clear who Dope Crypto and Dash Stone Advisory LLC are, I would suggest to post some links in the dedicated section ", "q2r": 2, "assessor": "z_assessor_2215", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 1846, "q0": "This proposal is very ambitious by outsourcing accountants and lawyers globally to work virtually for Africa. By having both accountants and especially lawyers involved will greatly develops the Cardano ecosystem. This project does address the challenge on implementing legal and financial boundaries and frameworks for their projects. This project starts in Zimbabwe and may scale globally providing it does the right steps and relevant skills and experience. The risks provided and solutions given is sensible and practical enough. ", "q0r": 4, "q1": "The team claims to have a combine of 12+ years’ experience onboarding and outsourcing financial and legal sectors. However, there is not enough information from their website to verify this. We do not know who or how many of those lawyers and accountants that were onboard since they started this business. In addition, there is no LinkedIn profiles to the names and professions stated in this proposal. This makes it difficult to visualize the success of this project. The team did a good job breaking down their budget. However, after considering insufficient clarity about the team the budget requested is therefore unjustifiable because we do not know how they can execute this project well due to lack of verified team members.", "q1r": 1, "q2": "It is stated that their measure of success is by having a certain number of trained lawyers and accountants with the understanding of smart contracts (Marlowe). In my view, it is not just the number of participants that were onboard or outsourced. There must be a metric to help the Cardano community to audit such as how many Cardano projects they assisted in the financial and legal sectors after having them onboard. Feedback from Cardano projects that receive advice from the proposers in terms quality and helpfulness will greatly help the success of this project.", "q2r": 3, "assessor": "z_assessor_2274", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 2967, "q0": "Upskilling lawyers and accountants in Zimbabwe is a good idea that fits well into this challenge. However, the proposers should provide additional detail about the content of the training that is being offered. This proposal is seeking ~$80K of funding (over half of it for course development). For that level of funding, one would think that there should be more advance planning of the specific content that will be developed. I am an executive of a business that evaluates and sells training content, and the content development process is not easy.", "q0r": 4, "q1": "The team appears to have relevant experience in both law and finance/accounting. There is a reasonably detailed project plan and budget, with the main concern being the one noted above that there is very little detail of the specific course content that will be developed. The proposal says that there will be 12 courses offered every 4-6 weeks, but it does not say what those courses will be. The courses are proposed to be delivered on the GeniusU platform, which seems a reasonable choice.", "q1r": 4, "q2": "There are a good set of metrics for number of lawyers who will be trained. These metrics seem rather ambitious, but ambition is good. I have a moderate concerns that some of the metrics are unclear – i.e. “90 to Outsource these professionals globally” and “Appx 2% - 5% growth in the Zimbabwean economy” (which seems an unrealistic metric for this one project). Therefore, I agree but do not strongly agree that sufficient information is provided to audit the progress of this project.", "q2r": 4, "assessor": "z_assessor_2374", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 7173, "q0": "The idea is good, the proponent suggests that a series of training courses be held, both face-to-face and online, to upskill the qualified lawyers and accountants in Zimbabwe and the SADC region and introduce blockchain literacy. In theory, the proposal meets the objectives of the challenge well, because these courses would broaden the horizons and increase the impact on the Ecosystem once legal and financial frameworks are explored and established. In this Zimbabwe country and the SADC region, I believe that the level of prejudice is very high due to the lack of education of the population, so it is essential that this type, of course, is created and changes this reality. Therefore, I will give it 5 stars, because I trust the potential of this proposal and it is very much in line with the challenge in which it would be launched.", "q0r": 5, "q1": "The roadmap is very detailed, we understand the phases of the project and what small tasks each would consist of, forming a very clear and explored chronological order. The proposer also delivers what is necessary for us to know with solidity how the development process of this project will take place. At first, they objectively inform us what will be done in the first 2 months (phase 1) and then until 7 months (phase 2). In addition, they also provide further explanation, inform us about the milestones they are aiming to achieve, and also how each front of the project will work to achieve their goals. Therefore, I consider that we are very situated in the project development process, as we know exactly what will happen so that every little thing is achieved, and what necessary activities are coming. Talking about the budget, I disagree that the amount is well justified, asking for 79,183 dollars, which the total amount would be divided should be better explained. For example, in the business outreach part, why do you need three thousand dollars for this? In the onboarding and admin part, they would add up to 4 thousand dollars, even though we know the total number of weeks, we have no idea of exactly how much time they would dedicate to the project, working part-time or full-time… By doing that, we could calculate the hourly value of their work and see if it would be a fair value or not. Regarding the team, we are introduced to the team members (Pearl Allen, Ngwari Mandrup, Brian Dzingai, Brenda Kamoto). Their areas of expertise are explained, however, it is not clear when they did not mention how they relate to Cardano. Their LinkedIn profiles are also not attached, where we could have more practical examples of their past experiences. Therefore, I think the project’s feasibility is good, but it can still improve.", "q1r": 4, "q2": "I liked the auditability of this proposal, the proponents explain very well what is expected for the progress and the final results of the project, but I think we still have aspects to improve here. Starting with analyzing the monitoring of the project’s development, we know that this progress will be measured based on the number of lawyers and accountants; the lawyers capable of leveraging smart contracts (Marlowe) and well versed in the blockchain financial and legal legislation and systems, the internship programs, growth in the Zimbabwean economy, and other indicators. However, in addition to these goals, I would like to know, for example, how we could follow the pre-production work of the course? We know that this will last for 9 months, and we know which tasks must be performed in two phases. With this, it is enough for one of the team’s participants to carry out this monthly inspection and gather general information on how everyone would be working, etc. In this way, we would know not only if the goals were achieved, but also if the tasks necessary for this were performed most adequately. And I think we would need to do both a quantitative and qualitative analysis, it would be interesting for teachers in the universities, to give feedback to the company directors which the proponents said that they need to be on the ground. Anyway, I think the auditability is good, but it can improve in some points to make it perfect.", "q2r": 4, "assessor": "z_assessor_2879", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 8391, "q0": "I think the project aligns quite well with the challenge's goal of being able to provide training courses to enhance the skills of accountants and lawyers in blockchain, and at the same time attract more people to join the Cardano ecosystem with media campaigns like\n offer financial rewards or any referrals made and offer discounts to any civil servants who sign up for our courses to encourage participation at a government level.\nThe communication campaigns and the way the project works are presented quite methodically and clearly. The project also shows its vision both before and after the training, not just focusing on the training course like transferring the trainees onto their Trellis BPO system ready to be outsourced. The related projects with FLUID7 that the team has done are also mentioned and described in quite detail.\nIn addition, the risks of being capable of navigating the software of mature professionals, power outages and internet connection are also mentioned and suitable solutions are given.", "q0r": 5, "q1": "In my opinion, the feasibility of the project is pretty high.\nThe project is divided into 2 phases and has a specific timeline, KPIs for each work in these phases, \nI was quite impressed with the budget description of the project. Here the budget for the amount of $79,183 is logically staged and analyzed in detail by the breakdown so that the reader can easily assess the project's rationality.\nThe four prominent members are described specifically about their experiences and outstanding achievements, the members' experiences are also closely related to the project such as law, finance, accounting, and the crypto industry.", "q1r": 5, "q2": "I highly appreciate the auditability of the project as many specific quantitative KPIs are described such as the number of trained lawyers and accountants trained to global industry standard, the number of lawyers capable of leveraging smart contracts (Marlowe) ) and well versed in the blockchain financial and legal legislation and systems; and many more metrics,\nThe success of the project in the short and long term, as well as its direct impact on the Cardano ecosystem, are also described in detail, helping the community have a better overview to identify the project's success.\nHowever, I think the project will be more complete if the ways and tools to help the community track the progress of the project are updated. (Will the community monitor it on the tools, on the website or through official email notifications? and on a weekly, monthly, or quarterly basis?", "q2r": 5, "assessor": "z_assessor_2979", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8921, "q0": "As cardano has very high growth by 2030 the and if number of lawyers and accountant won't increase by then, there would be scarcity in finding the lawyers and accountants due to this increased demand , lawyers and accountants can be adopted at very high price which will be difficult for middle scale developers.\nHence by developing law skills, as well as accountants skills ,students of Zimbabwe can improve their country financially , so this idea of improving students lawyers skills is great task and much needed in the future hence This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The presented team has combined experience of 12+ years of experience in outsourcing, training, and management, including 20+ years of experience in the financial and legal sectors and 15+ years of UXUI and web development experience. So the provided team has all kinds of members to achieve the job, where legal authorized members can take care of lawyers development, and financial team can develop accountant skills, the team even consists of UI/UX developer where they can handle web development activities of the project. hence, with given experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The audit has clear proposed solution where its impact can be seen in upcoming years ,when demand of cardano lawyers or financial assisting accountants are needed, which has been mentioned in presentation.\nThe presented proposal has provided details of all the members with whom the proposer wants to work with, and have fully organized team already , the proposal contains detailed budget breaking that is needed to achieve the project , the proposal even has structured timeline to achieve the success of the project with proper key indicators involved the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 7, "ne": 1, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9064, "q0": "This proposal seeks to develop qualified lawyers and accountants from the southern African region and give them skills in crypto to help them find employment in blockchain. This would greatly impact the goals of this challenge by bringing more crypt-aware lawyers and accountants into the blockchain seeking to help projects. The team has experience in the market and with the elements of the proposal. They will be marketing to reach potential lawyers and they are confident they will be able to train large numbers of them. If they are capable of following through, this proposal would have a really positive impact on achieving the challenge goals. \n", "q0r": 5, "q1": "This proposal has a detailed and doable timeframe and budget. There are clear milestones that are achievable and measurable. The team is capable and experienced in the areas of law, crypto, training/course development, and marketing. There are no questions about the capability of this team to achieve this timeline on this budget. \n", "q1r": 5, "q2": "The auditiability metrics are part of this proposal, but there is no method listed for how they will gather them or how they will report them. Ideally, they will be available via common community methods of engagement, like twitter, discord, telegram, etc, but there is no certainty in this regard. They could have added more detail into the auditability portion of their proposal, but it is clear, and in good faith, I assume they will be making these metris publicly available. ", "q2r": 4, "assessor": "z_assessor_3016", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 12226, "q0": "This proposal fully meets what the challenge asks for, as it tends to upskill the accountants and the lawyer by introducing the blockchain to them. It has summaries in the impact of their project proposal and also the video that they upload it in the media. I thought it is a good idea to educate the professionals like accountant and the lawyer to understand and familiar with blockchain that the Cardano carry it especially in Zimbabwe. To my knowledge, many locations in Zimbawe are remote areas and I believe, not all professionals in the country understand and familiar about the blockchain and how its works thus, affect to the professional jobs especially for the accountant and the lawyer. I wish they could delivery this knowledge not in English only, also use their own local language that make the students and participant easy to understand. I believe, by introducing the blockchain to them, their professional skill will be upgraded and would benefit for them in their future carrier particularly and for the nation in general. Meanwhile, since this project have some risks that they need to take into account, thus, they already mentioned the risk and how to mitigate it. it shows project team able to identify the risks that could potentially harm in the implementing of the project thus have plan to mitigate it.  ", "q0r": 5, "q1": "The project team proves to be well prepared to carry it out, because they provide briefly detail of the individual description of who they are. However, lack of description about the task/ jobs that people engage in the project. Hope, they can briefly explain the task or jobs that they are doing in the project. This can minimize the ambiguity. Meanwhile, the budget that they proposed is detail and precise. It shows they well prepared of the cost that they need to spend to run the project of upskilling the professional. However, if it sees the phase in the budget and the millstone is a bit confusing. I do not see how is it relate it. For example, in the budget there is stated ‘Phase 1 & 2”, in the millstone on the other hand, do not mention “Phase 2”, it is mentioned phase 1 only. Thus, this impact to detail activities in the budget and milestone. I think, it should phase in the budget should interrelate with phase in the milestone therefore, it easy for the team to track progress project activities and provide the report. Overall, the team provide detail cost and detail milestone activities how they implement the project upskilling professional in the Zimbabwe. given the information, I agree that this proposal will be implemented successfully   ", "q1r": 4, "q2": "The proposal includes a list of very clear and measurable deliverables on a timeframe, however, no KPI’s / matric to define the success of the proposal. I think, the team should provide KPI’s as tool to measure success of the project. Thus, each of the lists should have their own indicators. For example, “120 trained lawyers and accountants trained to global industry standard”, thus, what is the indicator to measure success of this list. It could be their present and/or certificate that they get for example. This could give clearer picture how to audit the progress of the project. In addition to this, I would neither agree nor disagree the information provided is sufficient to audit the progress and success of the proposal ", "q2r": 3, "assessor": "z_assessor_3367", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14470, "q0": "The proposal has given a projected decrease in the number of lawyers and accountants in Africa. Therefore, the objective is to provide legal and financial training to both solve unemployment and grow the Cardano community in Zimbabwe. The context is further analyzed by the proposer, with clear figures to indicate the growth of blockchain technology. In this emerging technology, lawyers and accountants will be a much needed workforce so professional development courses will be offered by Trellis Enterprise Holdings for qualified lawyers and accounts to provide them knowledge about blockchain technology to onboard them to this field. The proposer also gives details about the partnerships that will be formed (Dope Crypto and Dash Stone Advisory LLC ) and the platform that will be used (GeniusU - 4 million subscribers). This reflects the professionalism of the proposal. The proposal is able to present the clear impact of the proposal: reducing unemployment rates by training new graduates and existing professionals and potentially onboard these professionals to the Cardano ecosystem that will help this community to thrive. The proposer could tell more about the selection test for these participants. This project is such a good opportunity for upskilling and knowledge advancement so there might be a lot of people who wish to join. Furthermore, who will be the main priority of the course - students or already qualified professionals. The fee for these courses should also be mentioned to assess whether tuition is reasonable. The solution is explained with more details in how it is operated. Research will be done to create suitable educational content and deploy suitable people to deliver these courses. Marketing, connection to local authorities and civilians to promote the registration of this course is carefully planned (with financial incentive through referral). But the strongest point of the proposal is their preparation for students who enrolled. They will provide not only educational courses but also training in CV writing and virtual interviews to help them become more employable. This is really well-aligned with the objective of the proposal and done with practical measures. When the course ends, the students will be transferred to Trellis BPO to be outsourced - which means students are given assurance about employment rather than fending for themselves in the labor market. The main risks are related to internet connection, power outage, computer literacy. All of these are satisfactorily resolved where a computer literacy course, backup generators and on-premise study are available.", "q0r": 5, "q1": "The plan is clearly given with milestones divided into weeks and an estimated time for deliverables (8-9/2022). The activities are very clear and correlates with what the proposal is presenting. The budget breakdown is divided into 2 parts: 1) a long-term funding with 2 phases and their items that need a budget, 2) A detailed budget breakdown of smaller items within. For example, the budget for the tools, softwares and services that will be used is specified (Freshbook, Zoho books,...).This is really good and helps to demonstrate what materials will be used for the course as well. This manner should be applied to course and development outreach (specifying: what will be utilized, what procedures, tasks will take place, what services, people will do this and their salary). Marketing (digital campaign) may be provided with more details about the tactics and costs involved (ex: Facebook ads - ? usd). The team members are given with clear profiles and their current occupations which are relevant to the fields and skills that this project targets (barristers, business owner, project manager, accountant in the crypto industry). All these relevance will increase feasibility. It is worth noting that the team members also hold executive positions in Trellis, Dash Stone Advisory LLC and Dope Crypto which means they have the authority over the positive partnership among these companies.", "q1r": 4, "q2": "The auditability will be good because the proposer provides a specific number of lawyers, accountants in different measurements (qualified by global industry standards, ability to leverage smart contracts,...). The proposer can specify how to report these numbers (honorary mentions on websites, monthly calls/reports,...). The vision of success is also well-defined by milestones and achievements such as being self-sustainable after 6 months - 1 year, being able to give certification with universities/legally recognized bodies of law and accounting in 6 months - 1 year - This is really crucial and the efforts to earn validation from these official bodies should be mentioned earlier. The indicator of 50-100 lawyers and accountants for Cardano ecosystem and blockchain industry is really meaningful and impactful. SDG goals are positive and relevant to what the project is doing.", "q2r": 5, "assessor": "z_assessor_4055", "no_vca": 4, "ne": 2, "ng": 2, "nfo": 0, "vca_o": 1}, {"id": 14666, "q0": "As an education advocate, I really excited for this project to be launched. This aims to deliver courses to upskill African accountants and lawyers to solve the unemployment issue. The author did such a great job on describing the project with all the information needed about the target audience (lawyers and accountants in Zimbabwe and the SADC region), the platfrom to deliver courses (GeniusU platform with 4 million subscribers) and a list of the project activities. However, the main product here is course, so the qualification of the instructors is very important. I expected to know about the instructors or the recruitment process like how the team hires an instructor, basing on which standards. I do agree with the three risks mentioned in the proposal. I appreciate that the proposer has come up with some solutions to mitigate them. I have a suggestion here is about the competitors because this education field is promising yet competitive. I think the team should consider this risk and plan to deal with it. ", "q0r": 4, "q1": "The team seems to be able to successfully carry out this project. The author has give quite a brief description about themselves. We know their names, their profiles and their related experiences. There is one thing that makes me doubt here is about the marketing process. It is not clear that the team would hire a professional marketer or an agency to be in charge of this. It is a project about education, so it needs a lot of publicity to get people involved in. The plan is provided with some specifics task, but the timeline makes me really confuse. I do not know whether this is a typo or not but I think the team should have a more clear timeline for each peroid. On the financial breakdown, I think the author did quite a good job on this. The information we get is not just about spliting the total amount but also some details about each part, so that we can have a better understand of how the budget would be spent. ", "q1r": 3, "q2": "The team delivered quite a good auditability of this project. We have 7 KIPs provided as a guides to understand whether the team is going on the right way or not. Most of them are quantified which makes it easy not just for the investors to keep track but also for the team to know exactly what to do. The success picture seems very clear and achievable for me. The team set specfic KIPs and timeline for each points. I believe that with the team's experiences and ambition, they would definately be able to carry out this project. ", "q2r": 5, "assessor": "z_assessor_4079", "no_vca": 3, "ne": 0, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 14843, "q0": "So far, there has rarely been a project that addresses all of my questions and totally connects with the Challenge like this one. Professional accountants and attorneys are always among the positions that need a great deal of experience, care, and the capacity to work under pressure, thus fewer and fewer individuals are interested in this sector. As a result, the project is being upskilled and supplied with blockchain knowledge with the goal of assisting not only students but all individuals with shared interests in Zimbabwe and the SADC area. To ensure that the students who complete the course get a job, the entire team will assist students in writing their CVs and even invite them to stay at the Trellis BPO system. In particular, to ensure the support and approval of the government, the project will also reduce the price for any officer who want to participate. Instead of just limiting the age and occupation of customers like many projects, this project is open to everyone, and of course Cardano will benefit from it. I also love that the project tries to combine with many organizations not only to support its cause but also as a way to promote to many people about the diversity of the ecosystem. In addition, I also appreciate how the proposer intends to solve future difficulties or challenges. For example, the participants who do not have basic knowledge of computers, instead of being excluded from the list, the project will provide a separate course to help them consolidate their knowledge as well as create opportunities for more people in having access to blockchain. Overall, I have absolutely nothing to criticize what the author presents here. Well done!", "q0r": 5, "q1": "According to the proposer, the project will be conducted in a phrase of about 22 weeks with details of each part being mentioned. In addition, it can be seen that the author has a lot of expectations for this project when he is ready to start the next course if the project is successful. And I believe that just by following this plan, the author will achieve what is expected from this project. For the project's budget plan, instead of just listing the items to spend as usual, the proposer divides the capital into two parts. We have the main activities that will take place in each phase, plus some information such as a breakdown to demonstrate to investors how their money is being used. And to do so well, the project must have a very talented staff. They all have experience and skills directly related to the project. One is the CEO & CFO of Dash Stone Advisory LLC and Dope Crypto, the other is the Director of Trellis Enterprise Holdings LTD. It can be seen that they all have very high positions in a corporation, so I believe they have the confidence and skills to make this project as successful as possible.", "q1r": 5, "q2": "Author provides specific numbers when it comes to the number of professional lawyers and accountants, a plus point for the team as few projects do this. In addition, besides successfully supporting those who want to develop themselves, the author also mentioned the benefits that the Cardano ecosystem will receive if accepted for this project. Everything is very well prepared, but it would be better, if in the development part of the project, we get the timelines after each part is completed. This is very necessary because only then will investors be able to closely monitor the development progress of the project. In addition, I also have a question that, if it has been successful in the Zimbabwe and the SADC region, does the author intend to expand the market to other regions. If the answer is “Yes”, please briefly describe what you will be doing there.", "q2r": 4, "assessor": "z_assessor_4104", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "Upskilling African accountants weand lawyers would solve this crisis and help to address the 6.73 million unemployed in Africa, starting with Zimbabwe. We will grow Cardano and Africa together.", "experience": "Our team has a combined 12+ years of experience in outsourcing, training, and management, including 20+ years of experience in the financial and legal sectors and 15+ years of UXUI and web development experience."}