{"id": 421614, "author": "peterbisma", "title": "African Journalists - AJEOT 2022", "url": "https://cardano.ideascale.com/a/dtd/421614-48088", "category": 26596, "amount": 35000, "description": "How do we build competent journalists in sub-saharan Africa to influence policy debate and set the right tone for blockchain discourse and policy adoption?", "f6_no_assessments": 6, "f6_rating": 4.277777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 1756, "q0": "The proposal consists of two parts: 1. journalism training and 2. the future outcome of “influencing policy.” Both are outside this Challenge’s scope, which is why this section gets one star.\n      ...      \nTo clarify, the Challenge aims for legal & financial solutions that can specifically help proposers. Due to this apparent conflict, the value-added to the Cardano ecosystem is too far into the future to measure impact.\n      ...      \nTo aid the proposer, it seems helpful to mention that as it is written, this proposal currently meets the goals of these two Fund9 Challenges: 1. Challenge & Scouted for Students 2. Grow Africa, Grow Cardano. If not funded, consider rewriting to meet the Legal & Financial Implementations Challenge setting, or switch to one of the two Challenges mentioned if they are still available.\n      ...      \nThe key metrics aim at the number of journalists trained. The future “policy influence” is not mentioned in the key metrics. If this proposal is rewritten, consider a more short-term benefit directed at proposers and/or funded Catalyst teams.\n      ...      \nThe proposal does not address scaling and future sustainability. Though scaling is unnecessary to consider for this proposal, future sustainability could be planned for in terms of the future needs of the journalists in influencing policy in their future work.\n", "q0r": 1, "q1": "There is adequate evidence of relevant skills and experience needed to implement the proposal. That said, there are only two names attached to the proposal. At the same time, the mention of a team comprised of “researchers, think tank management, economists, Media Personnel, policy experts, and blockchain enthusiasts with over 20 years of experience in public policy” seems to pose a discrepancy for voters.\n...\nThe outlined budget is clear for the training aspect, though there is room for a more detailed cost breakdown (i.e. details of $7K needed for “Participant Traveling Grant”). The budget seems reasonable for prices in this area of the world. The authors include no plans for additional funds.\n...\nThe proposal does not offer a realistic timetable for completing the work. There is a timetable for the coursework, but none to accomplish “influencing policy.” However, it seems too tricky an item to define a timeline for––another reason for rewriting.\n...\nThe proposal explains only some of the technical aspects of implementation relating to the initial journalist training but not the entire solution. As a working professional in a related field, this assessor determines that there is a sound plan for training the journalist students, and a competent institution has been selected. “Influencing policy” seems difficult to plan for and will probably leave voters looking for a more measurable solution.\n...\nIn terms of risks, it brings up only one concern which appears to be solved in the budget under the “Participant Traveling Grant,” though further details would help voters determine that for themselves. No other potential risks are stated, though it seems there should be many to consider.", "q1r": 2, "q2": "There is no roadmap with milestones and a clear time horizon for achievement for voters to consider. The metrics only define one part of the success of the proposal. If rewritten to only consider the outcome of “trained journalists,” these metrics would suffice (though it would be even further outside of solving this specific Challenge’s problem statement).\n...\nThe target problem is not able to be measured by current metrics. The solution does not address the problem in full, as stated above. No accessible public channel for delivering regular updates to the community for auditing progress is given.\n...\nThis is why this section is being given 1 star.", "q2r": 1, "assessor": "z_assessor_2261", "no_vca": 7, "ne": 1, "ng": 3, "nfo": 3, "vca_o": 1, "reply": "The assessor fails to consider the proposal's description as to how it fits the challenge. Legal and Financial services should be viewed holistically to include existing laws that curtail funded proposals from functioning. In such a situation, journalists would be critical to protecting the interest of the community in their reportage and engage authorities by asking the right and hard questions if their analytical skills have been developed to understand the critical role blockchain is playing and why projects of blockchain should be given the liberty to implement. AJEOT is needed to train journalists in Africa to drive the creation of the legal environment for blockchain projects to thrive. The proposal justified the budget with simplified components including the $7K budget to be used as a flight grant to support participating journalists traveling from outside Ghana as incentives. We don't see why we should be rated low having provided the information. "}, {"id": 8934, "q0": "As Journalists are one of the most important members of the society ,where these are the people who mediate between government and people's call, these journalist help society in various way either by questioning government or even it might helping people find new ideas to improve the lifestyle.\nThe proposer's team African Journalists for Economic Opportunity Training wants to train the journalist and help them in knowing basics of blockchain so that these people can help the people understand it  so that it can create economic freedom for a prosperous society. Hence these journalist can act as bridge gap between people and cardano community , Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The task mentioned doesn't involve much of a risk , where it has clear goal just to educate the journalist about blockchain technology and cryptocurrency adoption ideas and its impact to drive for policy development and legal environment for financial inclusion, so that the team can broadcast this over there channel , which will help people to clearly understand the ideas of blockchain, the idea of workshop can be achieved as team has experience in broadcasting the blockchain related from past , Hence with minimal risk involved and given experience ,plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The audit has well described proposed solution where it can create huge impact in Africa's journalism in the future, with this  there would be severe positive impact for cardano ecosystem as members grows and in turn people of Africa can improve financially which will help them improve their lifestyle, the audit has introduced all the team members and their dedicated work towards improvement of African people's lifestyle. The audit has decent Roadmap to complete the project , it also has well structured budget breaking idea to complete the project ,With good key indicators provided to measure the success rate of the project, The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_3008", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 9069, "q0": "The goal of this project is to train journalists in the benefits of blockchain (especially Cardano) so that they will provide a more positive and accurate view of blockchain technology, thereby improving the legal and financial situations of projects in Africa. If successful, this would have a strong, long-term impact even though no short-term legal or financial solutions would be created. Thinking long-term big picture like this is very impactful. If we can create more positive media buzz around Cardano projects in Africa, it would be more likely those projects can receive the legal and financial support they need from those in power in their country. \n", "q0r": 5, "q1": "The training exists already, and there have been multiple classes already offered in past years. The team is experienced in the skills needed to carry this out and their budget is clear and sufficient to acocmplish this task. The risks are relatively minimal and they are planning on providing full financial support to the journalists who will need to travel to the training and give up three days of work to attend. The timeline is straightforward and achievable. The proposal provides sufficient detail to determine feasiliblty and it appears 100% feasible.", "q1r": 5, "q2": "The goal is to create more positive media attention toward blockchain projects and technology. This goal is measurable through the metrics that are given by the team. The proposal is clear and offers a good window on accountability. They will provide metrics regarding numbers of applicants, students in courses, and media mentions of blockchain among other things. This proposal leaves no doubt about auditability and clarity.\n", "q2r": 5, "assessor": "z_assessor_3016", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 11096, "q0": "The role of the press is vital to creating and sustaining free trade and wealth creation for prosperity. The function of a journalist is to cover major events and minor events. The knowledge of journalists in Africa about blockchain technology and its impact on economic and social development is very limited. Your proposal used the African Journalists Economic Opportunity Training (AJEOT) program to develop the analytical skills and capacities of journalists to participate in and influence the development and apply blockchain policy. I see this as a very potential proposal to enhance the work of journalists in Africa to lead blockchain conversations for policy and legislative development that will enable blockchain innovators, property owners willing to join the Cardano ecosystem. The proposal introduced some risks which are costs for journalists to travel from different countries and attend training in Ghana. The solution to overcome the risk is not specific you need to clarify where does the soft subsidy to support journalists come from?", "q0r": 5, "q1": "I find your solution quite specific: Firstly, you use AJEOT which is a trusted platform that invites journalists from all over Africa to come to Ghana for intensive population training; Secondly, you have very specificly defined the content of the training course, which is to introduce the developing blockchain technology and the ideas of applying cryptocurrencies as well as its impact to promote policy development and the environment. financial law school. In my opinion, the training program should be compiled in an open way to be able to continuously update the latest documents and news about Blookchain technology. The implementation of the training program should be designed in the direction of two-way interaction so that journalists can access new knowledge in an active and active way, making it easier for journalists to turn it into their own knowledge to Share and spread to the community. The proponent has provided a detailed budget analysis for the project, in my opinion, the contents of human expenditure should clearly state the number of people, the spending norm for 1 person per total time to clearly show the publicity. transparent. You have provided information about the people who will work on the project, have clear addresses, I feel very good.", "q1r": 4, "q2": "The proponent has provided information to check the progress of the project, in my opinion you should provide information associated with the timelines in the plan to be able to check the project implementation progress properly. more convenient. The success of the project is described quite clearly by you. I see the project very likely to succeed. I support you.", "q2r": 4, "assessor": "z_assessor_3216", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 12586, "q0": "How do we build competent journalists in sub-Saharan Africa to influence policy debate and set the right tone for blockchain discourse and policy adoption? challenges that need to be addressed. The proposal clearly states it will add value to the Cardano ecosystem by through this training, journalists will be trained in the evolving blockchain technology and crypto adoption ideas. as well as its impact to promote policy development and the regulatory environment for financial inclusion. It is important to train African journalists to understand how they can report on blockchain innovations, analyze cryptocurrency, and integrate it into their reporting to enhance public debate, promote legislation and infrastructure that creates an environment for donors and blockchain asset holders to operate freely. I believe that with a good idea and clearly presented problem this proposal can scale to address future challenges, so I rate the impact of this project 5*.\n\n\n\n ", "q0r": 5, "q1": "The proponent provided details of the relevant skills and experience required for those who will work on the project including Peter Bismark\nhttp://linkedin.com/in/peter-bismark-kwofie-93681486\nPeter has 5 years of experience as a private sector researcher and expert on public policy issues. He is also a blockchain enthusiast and was the first Ghanaian to host a blockchain radio show in Africa. EBENEZER TACKIE OBLIE\nhttps://www.linkedin.com/in/ebenezer-tackie-oblie-yamusah-acim-866b4764 Ebenezer is the Executive Director of the Center for Policy Research-CPRC, a policy advisory organization based in Accra. Nathaniel Dwamena He holds a B.A (Hons) in Geography and Rural Development. He is a researcher and has over seven years of experience in think tank development, nonprofit management and business development consulting.The proponent has also provided a detailed budget breakdown, with a total budget of 35,000, the specific budget is as follows Hotel Conference Cost - 3,000. Accommodation cost - 6,000. Feeding - 7,000. Local Transportation - $1,000....AJEOT is a three-day residency and intensive training course for journalists. The team estimated the project implementation within two months (8 weeks). The following procedure will be followed for successful execution.\nPlanning - Week 1 - Week 2.\nImplementation - Week 3 - Saturday\nImplementation - Weeks 7 - 8. With the main risk that could prevent successful project implementation is the cost for journalists traveling from different countries and attending training courses in Ghana. With such a good project I believe it is very likely that this proposal will be implemented successfully. I rate this project 5*.\n\n", "q1r": 5, "q2": "As stated in the feasibility of this project the roadmap will be implemented in two months (8 weeks), with the process clearly outlined by the proponent making it easier to track the project. When it comes to the project that will bring success is the training for journalists and the number of initiatives they take that contribute to a freer world and build blockchain readiness. and a digital future. Use the African Journalists Economic Opportunity Training (AJEOT) program to develop the analytical skills and competencies of journalists to participate in and influence blockchain policy development and adoption, clear solution easy to understand problem. i rate this project good and i rate 5*.", "q2r": 5, "assessor": "z_assessor_3438", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 13488, "q0": "Building competent journalists in sub-Saharan Africa is an issue in this regard as it impacts policy debate and sets the right tone for blockchain discourse. The author offers a solution to this problem by using the Economic Opportunity Training for African Journalists to develop the analytical skills and competencies of journalists that impact the development and apply blockchain policy. This very idea can perfectly solve this challenge. This proposal can scale up the challenge to address future problems. The main risk that could affect the proposal is the cost for journalists to travel from different countries and attend training in Ghana. They don't have a lot of money for these trips. Their workaround is to provide a soft grant that can assist journalists with travel expenses. If this proposal is funded, I think this project will be successful.", "q0r": 5, "q1": "This project is clearly timed AJEOT is a three-day residency and intensive training course for journalists. This project is estimated by the author to be implemented within 8 weeks. The author is divided into 3 phases, namely: phase 1 is planned from week 1 to week 2, phase 2 is implemented from week 3 to week 7 and phase 3 is implemented from week 3. 7 to 8. This proposal has clearly defined timelines, the implementation time is reasonable with the results of the work, the goals are detailed by the author for each job to be done. The solution of this proposal would be to build the capacity of journalists to understand blockchain, its workings and the function of cryptocurrencies in order to meaningfully participate and create a voice on inclusivity in the media. policy discourse, creating an environment for blockchain innovators to operate freely. Those who pass the training will understand how blockchain technology provides quality decentralization and more democratization in every aspect of our society. The success of the project is the impact of training on journalists and the number of initiatives they take that contribute to making the world freer and building blockchain readiness and a digital future. This is a good project if funded I think this project will be successful.", "q1r": 5, "q2": "Information about features as well as solutions is quite detailed and complete. The metrics provided by the user are sufficient for export. The author also mentioned useful metrics to track progress: number of media mentions, number of participants, number of journalists successfully completing the training, number of applications. number of signatures received, number of initiatives undertaken by journalists after training in law and policy discourse, number of publications on Blockchain innovation projects. Well-defined KPIs determine the success of the proposal. The team consists of 2 main members to carry out this project, they include Peter Bismark, Nathaniel Dwamena they are researchers, research team managers, economists, Communications personnel, policy experts and others. blockchain enthusiast with over 20 years of industry experience. The proposal also lists duties for each specific, relevant and highly specialized group of members, each of whom will be in charge of a public department. Work is based on the ability and experience of each team member. The budget for this proposal is $35.000 The required budget is explained in depth and logically in each expenditure item. With this budget, if funded, I believe the project will be successful. This is a brand new project and is waiting for funding.", "q2r": 5, "assessor": "z_assessor_3650", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Use African Journalists for Economic Opportunity Training (AJEOT) program to develop journalists’ analytical and competent skills to engage and influence blockchain policy development and adoption", "experience": "We are a team of researchers, think tank management, economists, Media Personnel, policy experts, and blockchain enthusiasts with over 20 years of experience in public policy "}