{"id": 381393, "author": "valerio.mellini87", "title": "DeFi tools for Content Creators", "url": "https://cardano.ideascale.com/a/dtd/381393-48088", "category": 26240, "amount": 10000, "description": "Karma以内容创作者为导向，帮助他们资助和组织他们的职业。", "funded": 1, "upvotes": 37298570, "downvotes": 6549748, "votes_result": 30748822, "votes_cast": 191, "f6_no_assessments": 5, "f6_rating": 4.133333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "提案人希望建立一个平台，让内容创作者能够以一种新的、更加互动的方式与他们的追随者互动。问题陈述缺乏，但我隐约明白了这个想法，而且这个想法很适合它所处的挑战。我相信这类平台在未来会变得很普遍，因为我以前也听说过类似的想法，但这是第一个实际的提议。带来像内容创作者这样的创意人，会给生态系统带来很多。这些指标与提案中的chelenge设置是一致的。我不太确定这个项目是否容易扩展，因为现在的工作是由一个开发者完成的。我认为该提案缺乏一个团队，因为它的想法是建立相当多的内容，而没有提到重复使用其他社区成员的努力。该提案绝对会增加生态系统中缺少的东西，即更多的内容创造者和他们的追随者，这对社区的发展是很有效的。  总的来说，这是一个体面的提议，我非常希望看到它对社区产生影响。", "q0r": 5, "q1": "提案人提供了一个链接到他的linkedin acocunt，他有必要的技能来承担这样的任务，但在这种情况下时间将是一个问题。然而，他用自己的名字支持他的项目这一事实使项目感觉更真实，并带来可信度。瓦莱里奥有一个想法，他需要组建一个什么样的团队，以使该提案获得成功，但我猜还没有找到人。我觉得奇怪的是，他提到如果要雇人的话，需要更多的资金（在这种情况下，这将是很好的），但他似乎并不打算这样做，因为他没有要求这个预算，而是打算自己工作。虽然这很高尚，但这并不是成功的最佳途径。预算可以使用一点细目，如小时费率和工作估算。我不确定所设定的时间表对一个人来说是否现实。   建议书对项目的象征性意义描绘得非常清楚，这一点不常见，值得称赞。提案人提到了合理的挑战，如寻找内容创作者，同时保持与其他平台的竞争力，这对一个人来说也是很难做到的。我对提案人的建议是，看看社区已经建立了哪些工具，并重新使用它们来加快开发过程，并专注于寻找与内容创作者的合同。总的来说，我不确定这个提议是否可行，但我鼓励提议者寻找一个团队，并在下一轮融资中再次尝试", "q1r": 3, "q2": "提案中没有提到项目的可追溯性。我没有看到有什么方法可以让社区关注项目的发展或进展。我建议根据其他提案的做法，建立一个电报或迪斯科频道。这将有助于寻找未来的合作者，以及内容创作者和简单的项目追随者在一个地方。关键绩效指标似乎是相关的，但没有提到衡量这些关键绩效指标的指标。路线图足够清晰，里程碑与项目相关，我同意作者对时间的估计。建议书可以对目标问题有更好的描述，但解决方案的陈述似乎很扎实，也很容易理解。   总而言之，项目资助者有办法在发放资金前检查项目的进展情况，但我认为提议者也应该让社区能够跟踪项目的进展情况。", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "这个想法与挑战的主要目标完全一致。在这里，意图是创建一个Dapp，在这里，区块链宇宙之外的人可以，正如作者在提案的开头所引用的那样，在没有重大困难的情况下，说谎和操纵本地活动。这里的区别将是一个非常 \"友好 \"的界面，正如他所描述的那样，我相信这将是一个符合人体工程学和易于理解的平台；此外，Dapp并不是100%专注于一种类型的受众，会有创造者（可以是人或小团体）和支持者。这样一来，目标受众将是多样化的，加上处理代币和NFT的便利性，Cardano肯定会受益匪浅，完全实现这一挑战提出的目标。非常积极的是，作者为我们描述了每个行为者（创造者或支持者）可以做什么，在Dapp中的主要活动是什么，让我们对这个想法是什么以及它在实践中如何发生有了坚实的了解。我相信这是一个高价值的主张，它将给我们的社区带来积极的影响。", "q0r": 5, "q1": "关于作者的描述非常短，他本可以写一篇短文，除了解释他的工作职能外，还可以解释他以前参加的一些经验和项目。然而，当他向我们提供他的linkedin资料时，这个空白就被填补了；但我认为最理想的是有一个更详细的介绍和linkedin的资料。在提案的最后，作者提到了将在团队中工作的其他专业人员，但据我所知，他仍然没有确定人员，这些专业人员仍然会被雇用。如果他已经有了一个成型的团队，那会更好，会传达出更多的安全感，但由于情况并非如此，我建议在大量研究的基础上进行招聘，当团队成型后，要与社区其他成员举行某种会议，以展示它。作者在团队建设中没有包括任何人来宣传Dapp，那么宣传会如何进行？广泛宣传这个项目是很重要的，因为它的主要目标是使人们在管理土著人方面的生活更容易，即使是那些不是来自我们社区的人，具体而言。作者提出了一个路线图，一个每3个月要遵循的步骤，我们可以知道他想在每个时期大致上实现什么，因为没有太多的细节。而关于融资的划分，细节是令人满意的，我们知道所要求的每一部分资金的去向。但是，这笔钱基本上被分给了相关人员的工资，它没有想到，正如我之前所说的，任何营销计划，超过了提案成功的必要条件。因此，我建议修改这些细节，以便进一步提高提案的水平。", "q1r": 3, "q2": "作者向我们提出了一些关键绩效指标，简而言之，就是应用程序的用户数量和将被创建/流通的代币数量。然而，由于这是一个非常复杂和昂贵的项目，我认为每月进行监测会更合适。因此，作者有必要建立更具体的目标，以通过每个月的工作，如果他能在更小的范围内看待要做的工作并提供细节，那就更好了；例如，在第一个月，你每周会做什么？我们如何在此基础上运行审计性？也许，选出一些有准备的团队成员来密切关注项目的进展，项目发展的所有阶段。因此，我认为，是的，作者为我们提供了关于可审计性的工作内容，但是因为这个项目，我觉得需要更加详细和具体的内容，可以定期监测，分析的结果会引起社区其他成员的注意。", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "There are a large number of content creators who could sell NFTs,royalties and fan tokens if the technical threshold to create, sell NFTs and present NFTs are made userfriendly. This proposal is aiming to address this important issue and more such experiments are required to create a user-friendly NFT world. Therefore it can be said that the project is addressing an important challenge in the ecosystem. ", "q0r": 5, "q1": "The proposer has five years of experience in software development and good academic background as seen from his LinkedIn profile. The proposer also has to onboard a Plutus developer for the development of smart contracts which have to be included in the site. The proposal is for creating a site that will enable minting and selling of tokens on Cardano easily. This can be used by content creators and others to raise funds for their enterprise or work. The proposer should be able to implement the project successfully.", "q1r": 5, "q2": "The fund requested is in alignment with the task in hand and seems a reasonable estimate. The project has economic sustainability and may bring value to the ecosystem in a reasonable time if successful. The project has well defined achievable task. Therefore the project is assessed as auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 18, "ne": 2, "ng": 16, "nfo": 0, "vca_o": 1}, {"q0": "The proposal includes a nice dapp overview and the github wiki link provides solid content but the proposer does not include any in depth technical documentation on their dapp/plan to get to MVP. ", "q0r": 3, "q1": "Usually the dapp technical design and team development comes before funding requests, odd to see it in reverse here. 3/5 because the proposer has a solid well built github wiki/team development plans mentioned in proposal. The proposer has technical plutus development experience.", "q1r": 3, "q2": "The proposer goes into strong detail in the github wiki, less so in the proposal budget/roadmap sections. Still so for the development of an MVP this proposal is solid.", "q2r": 4, "assessor": "z_assessor_826", "no_vca": 14, "ne": 2, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "The Karma solution is a unique dApp for content creators and consumers and effectively addresses the dapp challenge.", "q0r": 5, "q1": "The main developer of this project has a Cardano background receiving the Emurgo developer certification. The Github link contains good details on the technical components of the system. ", "q1r": 5, "q2": "The information provided in this proposal is sufficient and includes a roadmap, GitHub Wiki, budget, KPIs, Risks and a initial product feature set. ", "q2r": 5, "assessor": "z_assessor_828", "no_vca": 17, "ne": 1, "ng": 9, "nfo": 7, "vca_o": 1}], "solution": "我们的使命是为内容创作者和自由职业者提供工具，以获得资金，并通过tokenomics加强其品牌。", "experience": "- 具有5年以上微服务和云架构经验的软件架构师\n- 拥有Emurgo Cardano开发者协会认证"}