{"id": 381454, "author": "ali.m", "title": "P2P dApp for sharing tech gadgets.", "url": "https://cardano.ideascale.com/a/dtd/381454-48088", "category": 26240, "amount": 56000, "description": "全球每年有53,600万吨电子垃圾产生，而28%的人口愿意分享他们的小工具。", "funded": 1, "upvotes": 26373968, "downvotes": 20092188, "votes_result": 6281780, "votes_cast": 150, "f6_no_assessments": 7, "f6_rating": 3.619047619047619, "videos": [], "media": [], "f6_assessments": [{"q0": "该提案具有最高价值，很好地满足了挑战的目标，我将解释原因。这里的想法是创建一个电子数据共享平台，这肯定会对Cardano生态系统产生积极的影响。我相信，能够很好地总结这个提案的短语是下面这句话，就在描述的开头找到。\"通过基于Cardano的智能合约，安全地分享和出租你的技术小工具\"。考虑到这一目标，即使从技术上对这一想法的描述来看，该团队似乎非常有能力，它可以开展一项活动，对很多缺乏这种服务的人来说是有用的，同时增加智能合约在我们区块链中的应用。作者还强调，他们的DApp需要以总结和有效的方式解释目前的市场是如何的，电子共享的这个利基是如何成倍增长的，以及如何仍然缺乏解决这个问题的平台/公司/倡议。用一个基于Cardano的DApp来填补这个空白似乎是一个明智之举，因为肯定会有好处的。该团队关注的是准确解释它将创建的产品，它的特点和部分将是什么，使人们对这个想法本身的理解非常清楚。所以，这个评论主题的最高分。", "q0r": 5, "q1": "我认为团队在介绍时可以更慷慨一些。我们不知道他们的名字，谁是做什么的，他们以前的经历是什么，他们是如何来到催化剂公司的，他们是否已经与我们的区块链有任何工作关系......缺少细节，无法更深入地了解他们是谁。在财务部门的部分，我认为还可以有更多的细节，他们要求的金额很高，虽然对于项目的复杂性来说是合理的，但我想更多地了解所提到的每个部分。例如，他们引用的营销运作会是什么？我想的另一件事是，了解项目的视觉识别，不那么熟悉区块链的人如何使用dApp，它的界面会是什么样子，等等，都会非常有趣。我认为一切都会得到很好的研究和执行，毕竟团队里有一个UI/UX设计师，但这样的信息是可以呈现的。和上面提到的几点一样，我认为脚本也可以更详细；提到的时间间隔非常长，每三个月一次。我们知道在这样的时间间隔内应该发生什么，但我希望这些信息能够更加详细。例如，团队可以提供每月的活动时间表，这里的整个生产过程是非常复杂的，非技术人员可能不会完全理解正在发生的事情；那么，如果用一种易懂的语言解释各阶段，就像每3个月的脚本一样，以达到大多数人的理解，那就完美了。由于缺乏一般的细节，我认为这部分建议可以修改。", "q1r": 3, "q2": "这里的可审计性是非常好的。我们有每月的关键绩效指标，包括量化的指标，也就是说，我们知道在某个时间点要准备好多少百分比的DApp，产生的智能合约的数量，用户等等。作者还确定了项目的成功方式，所以我们在这里有必要的信息来监督该提案。对我们来说，关注活动的进展就足够了，如果社区中一些了解该想法中存在的技术的成员能与团队定期开会，从而了解该项目在那一刻的确切情况，给社区的其他成员带来反馈，那就更好了。监测dApp的遵守情况，有多少用户在使用它，平均来说，自这个项目以来，智能合约和我们的区块链的使用是如何增长的，这也是很有趣的。我们确实有与可审计性相关的信息，正如我所说的，这足以得出策略，以便不浪费。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 16, "ne": 9, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "这里的想法是非常好的。事实上，循环经济是一个日益增长的大趋势，其空间越来越大，解决一般废物的解决方案总是受到欢迎。我特别喜欢这个建议，用数字来验证建议的观点（如产生的电子废物吨数和愿意分享他们的小工具的人的百分比），并在建议的最后有链接，与这些数字的来源的文章（我在这里唯一的改进是直接将这些参考资料与文本链接，就像在真正的论文中一样，但这是细节）。\n似乎有一个健全的计划，有一个MVP，这在这样的项目中是至关重要的。我也很欣赏该项目已经有其商业模式和收入来源的细节。该建议也符合挑战指标，因为它将导致应用程序输出数量/增长、交易量的增加，并可能为其创建者带来利润。\n\n作为进一步的具体建议，我将在提案中更清楚地说明如何评估小工具用户的良好和不良行为，以及具有法律约束力的协议将如何扩展到 \"公司 \"矩阵以外的世界区域（或者即使意图是，至少在初期，将其限制在一些特定的国家--范围区域）。其他需要考虑的是物流问题（如何交换设备？是由应用程序/分包商提供专门的取货和送货服务，还是由用户自己交换？）\n\n总的来说，该项目具有良好的潜在影响，提案写得很好，只是需要在某些方面提供更多的细节。\n\n\n", "q0r": 5, "q1": "关于团队，提供的信息非常少。它只是说出了参与人员的名字，并简单描述了团队的整体经验，这让人很难理解这个团队开发DApp的可行性如何。为了改善这一点，我想在这里介绍一下参与的6位专业人员的个人背景、经验和能力，并提供链接来验证这些信息。\n\n\n有一个健全的计划和可交付的成果，但如果能对所涉及的活动有更多的描述，那就更好了。不过，我特别喜欢在第一个月进行的初步市场验证。这在开发技术之前是非常重要的，因为它往往是一个便宜但关键的步骤（没有这个，产品就不会有商业价值，也就没有用）。\n\n没有预算明细，只有创建MVP（提案整体）所需的总资金。为了改善这一点，我会尝试在支付给团队的时间中细分，每一步将花费多少钱（市场验证、产品开发本身、MVP等）。\n\n总而言之，计划/路线图是好的（只是需要一些小的改进），但团队和预算明细需要在提案中改进，以更好地评估其可行性。\n\n\n", "q1r": 3, "q2": "该项目总体上是可审计的。有很好的时间框架的关键绩效指标，目标已经确定。它们包括市场验证和技术Dapp部分的开发，这涵盖了项目中的两个主要风险（市场接受度和技术障碍）。路线图中也有良好的、可审计的里程碑，并对成功有明确的定义。\n\n作为进一步的建议，我认为该项目在风险管理方面非常重要。如前所述，市场和技术风险是至关重要的，最好能有一些缓解战略。还有其他与DApp的质量有关的小风险（只要有用户的反馈回路/迭代，MVP就能覆盖这些风险），以及满足拟议的时间表。\n\n", "q2r": 5, "assessor": "z_assessor_298", "no_vca": 23, "ne": 12, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "A marketplace based on the cardano blockchain for sharing/renting technical gadgets. The authors plan to do a dapp so it's in the right category and fits the challenge settings. There will be impact on the community, and there were prety interesting documents about the \"sharing market\".  There were success definition and somekind of a roadmap, but I didn't see any metrics, which was a bit of a letdown. Not sure if the project will be able to scale as well, because I didn't see a possible challenges section even though there were such accepted comments. The proposal is lacking key metrics like user adoption, growth rate and so on. It's a unique proposal to be sure. I haven't seen anything of the sort. As a developer, I'm not too sure on the technical part, because no details were specified. Overall I like the idea, but the proposal could have been more detailed.", "q0r": 4, "q1": "I didn't find any references or links to any kind of credentials. There was a presentation linked, and there were some team members there, but I couldn't match them with the names of the proposers so I weren't able to verify the members that plan to work on this proposal. Unfortunately that brings the credibility of the project down. I see there's some idea of the type of team members, but they haven't approached them yet or at least that was my impression after reading the proposal again. The budgets is clear enoiugh, although it's a bit strange for the developer experts and marketing, business & customer operations to have the same low salary, but kudos if they manage to find these people. I'd say the timetable is realistic only if they already have found the people to work on the project. The proposal might have done a better job at explaining the technical implementation of the sharing market, but I won't hold that agains them since I don't thing they haven't found the devs yet.   One thing that IMO is lacking is the consideration of challenges and risks. What would happen if a gadget is broken once its lended. Are there any safety mechanisms in place like locking some token in or any kind of value before borrowing a gadget? How would legal disputes be managed? Does the smart contract hold weight in court? These are all important questions that weren't mentioned.  Overall I like the proposal, but I don't think it's feasible in it's current state. ", "q1r": 2, "q2": "I don't see a way for any interested community member to follow along with the progress and development of this proposal. There are no metrics to speak of, but there was a small definition of success table, which is a start. The roadmap is a bit coarse and could be a lot more detailed. The problem and solution statements are clear enough.  I'd suggest to the proposers to put themselves in the shoes of the voter and take a look at their proposal. I believe this will help them come back in the next funding roud with and even stronger proposal. Good luck! ", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 22, "ne": 10, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "As an active Catalyst member, experienced Technology builder and Sharing economy former entrepreneur I strongly agree this proposal aligns with the Challenge objectives and will generate a positive impact to the Cardano Blockchain by creating smart contracts and their use by the lenders/renters in the platform. The amount of impact expected in the short and medium term are even quantified as KPIs.", "q0r": 5, "q1": "Even though the team is mentioned and the co-proposers are present in the platform, there is no extra details or external references provided to be able to validate their skills and experience, there is also the need to hire a PLUTUS developer which could be tough to find, hire and produce in 3 months, it would've been better to produce an agreement with any of the plutus devs in the Catalyst community or any of the organizations that can provide that capacity to mitigate that risk.\nThe plan provided is aggressive, but  doable with the amount of people assigned (4 devs and 2 Business/Ops), specially as the aim is to launch a first MVP in 3 months.\nThe requested budget breakdown is clear and aligned with market prices (considering full time dedication of team - not clarified in the proposal though), and the total amount for the Return On Intention of product with this capabilities I think it is OK.\nThere is also an analysis and plan to create a sustainable Business Model after funding and launching, which makes the proposal more solid.\nThere are no risks identified and I think there will be many hurdles in the way, that will arise unexpected, with the complexity, amount of team and short time to deliver and aggressive goals. So if project is voted I'd sit with the team first and understand deeply those challenges and have some ideas on how to mitigate them.", "q1r": 4, "q2": "The milestones provided, KPIs identified are SMART and will enable our community to audit the progress of the project during the 3 months project plan. There are also some objectives for the medium term provided and a sustainable business model to be tried. So I do believe the project will be auditable and transparent for the community.  ", "q2r": 5, "assessor": "z_assessor_288", "no_vca": 24, "ne": 9, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": "Its a good idea at face value but I have a hard time seeing this coming together. For example, people typically store persinal sensitive data on their devices such as passwords, accounts, emails and addresses. How do you share these devices and at the same time ensure that they are wiped of sensitive information? I think this is difficult to solve and its not addressed at all.", "q0r": 2, "q1": "It would help to have more information about the team and what past projects they have worked on. In reading it appears to me they are looking for an expert developer meaning they currently dont have a qualified team and their first milestone is having the app already finished in a month which is completely unrealistic. The whole idea is centered around the app but it appears that it is a minor thing to accomplish in the milestones.. just makes no sense to me as a developer. I think more detail is needed on the design of the app and how the user will interact with it. How will users connect to each other?", "q1r": 1, "q2": "There are some decent metrics and kpi but they rely on the fundamental app which has little information on how it will work. I think more needs to be accomplished in defining all the parts of this process before a clear audit trail can be recognized.", "q2r": 1, "assessor": "z_assessor_119", "no_vca": 22, "ne": 3, "ng": 15, "nfo": 4, "vca_o": 1}, {"q0": "It identifies a potential problem some Cardano users might have. The problem the world has with e-waste is unfortunately not a problem in this challenge, but there could be some Cardano users that can't afford Tech and it would be better for them to rent devices. It aims to ad value to the Cardano ecosystem by bringing some of the \"sharing economy\" to Cardano. Some of the key metrics align with the challenge in bringing new users to the ecosystem. This project is able to scale as technology always evolves and there is always old tech lying around that could be better off in someone else's hands. ", "q0r": 4, "q1": "They haven't provided any evidence of experience or existence and they stated that they are looking for a Cardano developer expert. The current team of 6 claims to  have experience in UI/UX product design, business, marketing and branding. Considering that they still need a plutus developer their targets might not be achievable should they fail to acquire the dev. The budget is somewhat reasonable and broken down, but they haven't allocated anything for the plutus dev. They go into great detail about how their product will work and I appreciate the risks they have considered and the way the will mitigate them. They don't however go into any technical details. We don't know what will be used for frontend and backend developement. How users data will be stored. etc.  Having a plutus dev on your team and providing the reader with the technical details of your product will show your approach to the problem and boost voter confidence.", "q1r": 2, "q2": "The roadmap they provided is broken down into 1, 3 and 6 months. The milestones are a little vague and could've been better explained. The KPIs are measurable making it easy to track the performance and progress of this project. They identify the problem of old devices not being used and people in need of devices that can't afford them. They plan to solve this by building a marketplace where people can rent and share their devices for extra income.", "q2r": 4, "assessor": "z_assessor_140", "no_vca": 27, "ne": 8, "ng": 19, "nfo": 0, "vca_o": 1}, {"q0": "This is a great idea bringing Blockchain technology specifically smart contracts to an increasingly sharing global economy with trust and security as a major selling point. This proposal is definitely with the campaign brief and goals with the potential to increase the adoption of the ecosystem and particularly onboarding new members.", "q0r": 5, "q1": "There is much information about the team's ability and experience to deliver this project however the fact, the proposal was well thought out with detailed roadmap and realistic budget estimate including the realisation that they definitely need a developer from onset. Am convinced that the proposal will be successfully implemented. ", "q1r": 4, "q2": "The proposal has presented more than enough information to ensure effective assessment and monitoring of the project if funded", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 24, "ne": 1, "ng": 17, "nfo": 6, "vca_o": 1}], "solution": "创建一个端到端的解决方案，使人们能够安全地分享和租赁他们的科技小工具，并由基于Cardano的智能合约保证。", "experience": "我们是一个由6名专业人士组成的多学科团队，拥有技术、UX/UI、产品设计、商业、营销和品牌等方面的丰富技能。"}