{"id": 381623, "author": "grisemetamoonverse", "title": "NFT market place to metaverse", "url": "https://cardano.ideascale.com/a/dtd/381623-48088", "category": 26240, "amount": 21000, "description": "这些天在Cardano上的Nfts大多是pfps。一个诱人的Nft经济理念，吸引了大量的用户，这些用户被输送到一个不断增长的生态系统。", "funded": 0, "upvotes": 15357776, "downvotes": 16446756, "votes_result": 1088980, "votes_cast": 146, "f6_no_assessments": 5, "f6_rating": 2.0, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=11740"], "media": [], "f6_assessments": [{"q0": "这里给出的问题陈述很容易理解，问题的解决方案是解决当前许多艺术家的痛点之一，他们希望通过一个简单的用户界面一次性发布收藏品。\r\n\r\n因此，NFT市场与NFT的大规模发行是当务之急。我同意，这个建议有效地解决了挑战，然而，在我看来，可以提供更多的细节，特别是在他们声称--\"已经开发了具有平台设置功能的cnfts...... \"的意义上。- 我可以看到一张截图，其中一个程序正在本地主机上运行，如果有一个简单的演示（视频）或演示测试服务器就更好了，这样社区就可以验证他们的说法。", "q0r": 4, "q1": "我对这个提案的经验和计划部分的写法有点失望，尽管我非常喜欢这个想法。\r\n\r\n没有任何团队成员的详细资料，也很难核实提案人所说的他们已经有一定的用户基础和正在进行的开发工作。\r\n\r\n该计划提出的意义是，他们想在未来4个月和3个月内通过让更多的用户进入他们的市场实现什么，但我不明白的是，该提案是如何从解决方案（谈到有能力产生大量的NFT）部分转移到在市场上带来用户基础的？我的意思是，提案人不应该给出要点描述（逐步计划），分成几周、3个月、6个月？我可以看到意图可能是好的，但写得很散乱，难以理解。\r\n\r\n此外，预算细目也不尽合理。提案人认为，要实现提案人所要求的21000美元的全功能（d）app，需要哪些努力？在我看来，前端后端工作必须分成小时费，并向社区提供更多细节，说明完成每个部分（前端，后端，测试）需要多少努力（时间*小时费）。\r\n\r\n 在我看来，这并不是一个教育社区的有规律的方式，因此我不同意这一点，认为这有很大的可能性被成功实施。", "q1r": 2, "q2": "我在这里也有不同意见，提案中谈到3-4个月内将尽可能多的卡诺用户带到他们的平台，还给出了后台/前台代码开发的预算估计。\r\n\r\n提案人忽略了的是什么时候完成实施（1-2个月？），目前的实施状态是什么，我们作为社区将如何跟踪这个提案的进展，我们将与谁联系？\r\n\r\n从字面上看，这个项目没有公开的资料（github/链接），也没有任何mira/jira板，他们正在跟踪他们的进展（当前状态）和未来的实施（基于如果这个项目被批准）。这使得，我认为，这个建议很难被审计，因此，我不得不在这里表示反对。\r\n\r\n我建议提案人看看前几轮的成功提案，并在下一轮中再次尝试。祝好运", "q2r": 2, "assessor": "z_assessor_454", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "To be honest after reading the proposal twice I'm not a 100% sure if it's a platform to launch NFTs or just a marketplace for NFTs. There were a lot of  abbreviations I didn't understand like: \"peps\", \"atm\", \"bsc\" \"cNFTS\". I searched for them, but I'm still unsure about some of them. Since the proposal wants to build a dapp or some kind of a decentralized platform, it should fit the challenge it's in. The proposal has some issue with clearly articulating what problem does it solve and how will it bring value to the cardano ecosystem. For me there were glimpses but the overall picture eludes me. The metrics are related to the platform growth which is reasonable and in line with the growth measurement. I'm not sure about the proposal being able to scale, but I'll touch on that in the feasability section. Compared to other proposals this one is missing a couple of key items like: the team standing behind the proposal, skillsets, challenges that the project is expecting to fail along with a couple of minor ones. I'm sure this proposal will bring something to the table, because the idea to mix games and an nft marketplace is very intriguing to me. As a developer I'm a bit woried about the implementation, since no specific people or needed skillset is mentioned. Overall I believe this project could have some impact for the cardano community if it's better structured and a couple of key elements are added in.", "q0r": 3, "q1": "Unfortunately the authors of the proposal haven't left any links or references to team members or skillset necessary for the proposals implementation. This is really a bummer for me, because a known team standing with their names behind an idea brings more credability to a proposal in the eyes of the voter. Maybe the proposer has forgotten to include team members or just hasn't gotten the clear idea of the skillset necessary to finish the implementation. The budget is just an outline without any specific breakdown. I would suggest to the authors to check out other proposals and I believe it could be greatly beneficial for them to do so to improve their own proposal for the next funding rounds.  I saw a lot of interesting ideas in this proposal, but none of them felt like a well formulated plan yet. So there's no clarity for the implementation as well. As I mentioned I'm not sure if the proposal will be able to scale since the team members or possible team members are not mentioned and neither are future challenges or a specific roadmap with concrete milestones. The technical aspects of the proposal are not mentioned.   I encourage the proposers to work on this and give a new and improved version that has all the suggestions from myself and the comments implemented in the next funding round. Good luck! ", "q1r": 2, "q2": "There was no mention of any place that the cardano community will be informed about the progress of the project. I've found that a discord or a telegram channel does wanders for forming a community arround an idea. There are some relevant metrics concerningg adoption and possible user count for the platform, which is great, because no process can be optimized if it's not measured first.  The description of the whole proposal can be more clear so that anyone can understand it. It will help if not so many abbreviations are used. The problem statement as well as the solution needs some work. My suggestion would be to put yourselves in the shoes of the voter that sees your project for the first time and should understand what it's all about by a glancing read. Overall I thing the tracability of the project is not great. \r\n", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "An NFT marketplace and metaverse gaming would be things that could bring tremendous value to the cardano ecosystem. As they've stated, there are a large amount of users in the gaming industry and there are large economic incentives with NFTs at the moment.", "q0r": 4, "q1": "This proposal does not provide any information on their team, nor does it provide details on a comprehensive plan of action. With little details to go off of, its hard to say there is a high likeliness of success.", "q1r": 1, "q2": "This proposal does not provide sufficient information to audit the success and progress. It gives an overall mission statement with some research points, but there are no KPIs, no information on the team, no roadmap, and very limited information on the budget breakdown.", "q2r": 1, "assessor": "z_assessor_612", "no_vca": 20, "ne": 0, "ng": 12, "nfo": 8, "vca_o": 1}, {"q0": "This main point is about cnfts with functionality on a platform set up to be integrated for mass nft launches. The problem statement is not quite convincing, and not explained in detail. Besides, the solution was not clearly explained in detail [without a goal, roadmap/milestones,...]. As a result, not likely to address this challenge of developing Dapp and unclear impact. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "Since this proposal did not provide a clear intention of what is going to do, and lacks important components of information [no team/proposer's profile, no goal, no roadmap, no KPI/metric,...], It is hard to evaluate how feasible it is. My advice is: the proposal's solution should be clarified in detail for answering the question of: what is the function of this dapp, how long does it take to build it, who are your partners, what should the KPIs/metrics be to measure the success,... After all, based on the given information, I can not agree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "Since this proposal lacks important components of information [no team/proposer's profile, no goal, no roadmap, no KPI/metric, no budget explanation for each item,... auditability can not be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "The proposal states they have developed a platform that will help with mass NFT launches. This is an interpretation from solution statement as it was hard to follow. The proposal mentions the growth of NFT marketplace and suggests they will help to onboard more users with their solution. No details are provided on the existing solutions in the market and what is different from their solution that they have started working on. It is very unclear on what additional value this proposal is making beyond the existing platforms and clearly defining the differences.", "q0r": 2, "q1": "No team information is provided nor is any sources to showcase their existing work and execution. It is very difficult to gage whether this proposal is feasible to be executed by the proposal team. A basic budget break down is provided however no evidence as to who will execute those deliverables and any evidence they can deliver on those statements.", "q1r": 1, "q2": "The only success objective mentioned is 'The success for this sub section of the project will look like many cNFT collections being easily launched on our platform.'  This statement alone doesn't provide much confidence for usage of effective success objectives. No KPIs are also provided. The proposal requires more clarity on how it differs from existing solutions and then should include information on existing metrics of success and other relevant KPIs.", "q2r": 1, "assessor": "z_assessor_758", "no_vca": 15, "ne": 0, "ng": 13, "nfo": 2, "vca_o": 1}], "solution": "我们已经在一个平台上开发了具有功能的cnfts，以便为大规模的nft发射进行整合。", "experience": "我们的项目正处于一个发展的轨迹上，目的是尽可能多地吸收用户。我们的人员配备齐全，并在不断增长。"}