{"id": 383100, "author": "bef7103", "title": "Wine open market - Stappato", "url": "https://cardano.ideascale.com/a/dtd/383100-48088", "category": 26240, "amount": 10000, "description": "获得葡萄酒的机会可能具有挑战性：分配和等待名单是出了名的难以进入，限制了对市场的参与。", "funded": 0, "upvotes": 16927940, "downvotes": 19122429, "votes_result": 2194489, "votes_cast": 165, "f6_no_assessments": 11, "f6_rating": 3.3333333333333326, "videos": [], "media": [], "f6_assessments": [{"q0": "这里还不是很清楚如何在葡萄酒销售和Cardano生态系统之间架起桥梁。支持者打算创建一个Dapp，这将是一个葡萄酒交易平台，使用智能合约。但是，这些合同到底会被用来做什么？会不会是销售数据？什么数据？我们的区块链网络上到底会托管什么？这对葡萄酒生产商会有什么好处？在某一点上，支持者说，目标之一是 \"将新的酒厂纳入该项目，向他们展示开放其葡萄酒的优势\"。重要的是，他们要在提案本身中定义这些优势是什么。另外，对最终消费者有什么好处？我认为，目标受众是年龄较大的上层人士，这些人通常消费更精致的葡萄酒。这个受众不是我们项目中习惯面对的受众--大多数时候，我们的目标是已经使用区块链技术的人（已经有技术领域的知识和对加密世界感兴趣的人）；甚至是潜在用户，他们更可能使用Cardano生态系统服务。但这里的受众似乎是不同的，真的，我们不期望与Cardano有任何联系的人。如何让这些公众了解这里存在的优势，如何说服他们离开传统并使用这些新技术？因为有这么多的疑虑，不幸的是，我不认为这个提议是可以保证成功的，那就是创建一个Dapp，增加Cardano的交易数量，为我们的生态系统带来新的用户。这是一个非常特殊的利基项目，它需要对我提出的观点进行更好的论证。如果有关于1）这将如何有利于Cardano的解释，更详细的2）生产者和消费者将如何说服自己使用区块链，对其影响的信心可能会大大增加。", "q0r": 2, "q1": "我们对这个团队知之甚少，我们被告知的是，他们是三个有葡萄酒业务经验的人，也有关于区块链的知识。然而，这是非常少的!我们需要知道他们的名字，每个人的工作内容，以前工作的简要历史，最重要的是，这些人与Cardano生态系统的关系如何。他们声称有具有区块链经验的专业人士--但这种经验会是什么样的？你以前在Cardano做过任何项目吗？如果有，是哪一个？不幸的是，我们没有办法信任一个我们几乎不认识的团队。我建议投标人包括每个人的详细和个性化的描述，最好有以前工作的例子，如果还有linkedin简介。这里有一个脚本，但它是肤浅的。例如，前3个月将致力于创建平台，向制作人展示，对吗？他们知道要用哪个目标做什么，但如何做？为了获得这样的产品，将按时间顺序开展哪些活动，由谁来完成？我还认为3个月的时间太长了；如果活动按月划分和组织，会更有意思。这里有一点让我非常担心。\"有葡萄酒业务经验的外部兼职顾问（~1天/周，3个月1500美元/月）。我们将支付一个人每周只为这个项目工作1天，也就是说，大约4天的工作将花费1500美元？我发现这个数值非常高，与工作时间不协调。许多来自其他提案的专业人士全职工作，以获得这样的工资，无论是设计师、开发人员、宣传人员等。在我看来，这有点不相称。关于预算，它是与路线图一起解释的。在每个阶段，我们被告知报告的活动将花费多少钱。关于这一点，我相信我们有足够的信息来理解资金，我在这里的观察只是（在我看来）一些价值是公平的，但另一些是不相称的，正如前面评论的情况。因此，结论是：1）没有办法相信这个团队，因为关于他们的信息很少；2）剧本是肤浅的，但可以看到整体；3）预算是可以理解的，但在某些部分是不成比例的。", "q1r": 2, "q2": "这里的可审计性很好，因为提案的作者概述了一些关键绩效指标，用于监测平台的直接结果：消费者、供应商、销售产品的数量...。这些都是纯粹的量化数据，但它们可以简明地表明项目是否成功。如果有某种分析产生了多少智能合约，对Cardano生态系统的直接影响是什么，那也是很好的。这一部分在整个提案中很少被探讨，在最后的指标中也是如此。根据给定的路线图，是可以跟踪项目的发展的。但是，正如我所提到的，没有太多的细节和几个月编制的广泛的时间划分，除了我们不知道谁会做什么之外，也不可能进行这样具体的监测。因此，我的建议是，作者定义一些完全专注于Cardano的指标（KPI），路线图要更详细。我们需要与销售人员和Cardano的开发人员进行接触，以了解项目的所有方面将如何发展。我们有可能对提案进行审计，但如果评论数据的创建、修改和改进，这可以以更令人满意的方式完成。", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 31, "ne": 18, "ng": 13, "nfo": 0, "vca_o": 2}, {"q0": "虽然引用的问题可以理解，但没有足够的信息来解释问题的层面。葡萄酒市场有多大？市场上存在哪些困难可以通过区块链来解决？\n\n我可以看到葡萄酒市场的潜力，但这一建议的价值主张还没有很好地确立。\n\n所提出的指标将允许衡量客户、酒庄和所售物品的数量，但还没有建立可以评估潜在影响的目标/关键绩效指标。\n\n如果不澄清以上几点，就没有办法进行准确的影响评估，所以我建议包括这些要点。", "q0r": 2, "q1": "没有足够的信息来评估这个团队的资质，我们甚至不知道参与这个提案的人的名字。即使提到了在区块链和葡萄酒领域的经验，也没有来源或链接来支持这一信息。谁将负责智能合约的开发？\n\n该项目计划分为3个阶段，但几乎没有表明可行性的细节。没有关于智能合约的开发和谁将开发的信息。第一阶段将有一个MVP，但我建议团队在理由上多下功夫，以证明这个想法/概念的合理性，因为提案的表述方式没有足够的信息来表明可行性。\n\n预算没有得到很好的界定。建议书要求10,000美元，并提到雇佣一名销售人员的费用为1,500美元，一名顾问的费用为1,500美元，为期3个月，以及1,500美元的营销费用（根据这些价值，你如何得到10,000美元？），但这些费用都不涉及开发一个应用程序，考虑到挑战的目的是开发应用程序，建议只为挑战的主要范围以外的项目要求资金，这没有意义。判断预算可行性的要点是了解开发应用程序的成本，尽管该团队提到它将支付额外的费用，但这并不是支持可行性的论据。\n\n没有考虑提案的风险和挑战。在创建葡萄酒市场之前，必须了解这个市场的潜力、需求以及在区块链上创建市场的吸引力是什么。这些葡萄酒是否会被区块链认证/认证？是否有意向创建一个供应链模式？是否有意向使用元数据？如果葡萄酒通过区块链认证，将有哪些机制来避免区块链中包含的数据和葡萄酒本身之间的欺诈？\n\n这个想法本身是有效的，市场将在挑战的范围内，但我建议该团队提供更多的细节，以便有可能正确评估该建议的可行性。", "q1r": 1, "q2": "问题描述得不好，我建议提供更多的数据和信息，以了解将Cardano区块链用于葡萄酒市场的价值主张。提出的解决方案没有显示关于智能合约开发的技术计划的足够信息。\n\n所描述的指标对于理解区块链的使用是有用的，但由于没有建立目标/关键绩效指标，可审计性变得非常主观。\n\n虽然有一个有既定时间表的计划，但我认为提出的计划是一个草案，因为没有关于如何使用智能合约的信息，而且商业计划本身非常主观。", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 28, "ne": 15, "ng": 13, "nfo": 0, "vca_o": 2}, {"q0": "This proposal would be a good innovation towards the Cardano blockchain, and it would gain attraction on new users as well as current users. This is because, 1) The wine market only in the U.S alone have a market worth of $88 billion. 2) Deploying smart contracts are considered a simplicity for both consumers and sellers (Though bugs, errors or malicious actors can trigger undesirable results that are hard to correct.) 3) The involvement of traditional markets into the blockchain. ", "q0r": 5, "q1": "With the given experience and connections, I believe this will an interesting project for the Cardano ecosystem to provide wineries into the blockchain, though elaboration of the hiring of team members can be further informed - but the proposer only requires funding on the marketing side. I would also like to add on the Phase 2, (what are the risks when onboarding new wineries into the project?). As it will also add as a good point to where the expansion of the project to success.", "q1r": 5, "q2": "The funding required is only for marketing purposes and seems reasonable, and I am thrilled that the project will be implemented in the blockchain. Though, further elaboration on outreach campaigns and milestones for the marketing would be helpful to give a glimpse of the Wine Open Market. I believe it would be revolutionary to provide wineries or maybe in the future other types of spirits into the blockchain whereby users can directly buy it via smart contracts.", "q2r": 4, "assessor": "z_assessor_669", "no_vca": 19, "ne": 3, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "It isn't clear how much value and users this app. will bring to Cardano. Please give more information about the waiting lists for buying directly from wineries, as this isn't something many people have experience with. How will the trade platform work? Will there be buy/sell orders?", "q0r": 3, "q1": "Who are the team members? What previous achievements can you show? It seems that you're determined to make this project work; it might be helpful to complete the MVP and then ask for funding.", "q1r": 2, "q2": "There are simple KPIs which are measurable and realistic.", "q2r": 5, "assessor": "z_assessor_80", "no_vca": 32, "ne": 3, "ng": 19, "nfo": 10, "vca_o": 1}, {"q0": "The proposer wants to build a platform to enabe wine lovers to be treated more fair when buying wine directly from producers. A dapp will be built so the project is in line with the challenge. There's an implicit benefit for the cardano ecosystem so no problems there. The key metrics make sense for such a proposal tracking the adoption of the platform once made. I'm not sure if the project will be capable of scaling because no team members are directly specified. And I don't think the types of members mentioned will be enough to bring the project to it's success once scaling is necessary. I see quite a bit of things missing in the proposal: an understandable budget, any kind of proof for stated skills, thought about reusing what's already been done and open sourced, probing for partnerships or talks with producers and a couple of other minor things like supply chain management research, price points, competitiveness.  As a developer, I was expecting more detail. With all due respect, this looks like an idea and not a business plan. Overall a good idea that fits with the challenge. ", "q0r": 4, "q1": "Unfortunately I couldn't find any evidence of the mentioned skills in the proposal. This brings down the credability of the project alongside the fact there are details missing in the proposal. I didn't understand the budget break down, there was some mention of 3 months 1500 which makes 4500 and then 3 months of 1300 which makes 8400 and 1500 for marketing making 9900 in total, but the budget is 10000 so I didn't see where the last 100$ are. I hope the proposer wasn't rounding up and just made a mistake in calculating the end cost. I encourage the proposer to come back for the next funding rounds and take better care when compiling the proposal keeping in mind the proposal requirements. Putting yourself in the eyes of the voter is also a good idea when writing a proposal. Overall there were a couple of more things missing in the proposal that I already mentioned. Keeping in mind all said things I'd advise the author to take a look at other proposals and look at how does a proposal that is already funded look like. A good idea, but I couldn't call it feasible for the aforementioned reasons.        Taking in potential risks like competition also seems like a reasonable thing to do.", "q1r": 2, "q2": "No mention of any way to trace the progress of the project. I'd suggest a telegram channel or some other medium to keep the community involved as they could be future customers of the app. Metrics and KPIs seem good, but that's not enough to make a good proposal. The roadmap is a bit hectic, but it's structured. The description of the problem and solution are understandable.   Overall an idea that needs more work in order to turn into a serious proposal IMO. Good luck!", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 32, "ne": 13, "ng": 18, "nfo": 1, "vca_o": 1}, {"q0": "This proposal intends to create an online marketplace and cut out the middleman that takes margins on sales transactions. What is proposed is basically like an online cooperative which wineries can join and where consumers can buy wine. So it should be profitable for both producer and consumer. If successful, it could generate additional transactions on the Cardano blockchain. ", "q0r": 5, "q1": "The proposal speaks of a 'blockchain professional', which I suppose will build the smart contract. The unbacked relative experience that is claimed would suffice to run the business. But who would create the online marketplace and website? \nTo enhance the feasibility and community trust in this proposal, consider publishing the team's identity and some proof of experience. ", "q1r": 3, "q2": "While there is a clear roadmap, plan and KPIs included in the proposal, there is no information on what would happen if the project initially turns out to be not as successful as anticipated. Is there a plan b to mitigate this risk if it were to occur? \nThis in combination with details on what is intended with the marketing campaign (online advertising, tv ads, ...) and a website where additional information could be found would improve the auditability of this proposal greatly. ", "q2r": 2, "assessor": "z_assessor_113", "no_vca": 32, "ne": 3, "ng": 26, "nfo": 3, "vca_o": 1}, {"q0": "The idea is about filling the demand and supply gap between wine consumers and producers using Blockchain smart contract functionalities. This is a project that has the potential great use case globally and more adoption of the ecosystem. It definitely address the campaign challenge and should he be given a chance.", "q0r": 4, "q1": "The team has already brought the project to a realistic level and they are just asking for funds to promote the platform and for administrative costs. I am convinced that the proposal will definitely be implemented successfully. Also considering the detailed milestones and realistic budget request and the project has a great chance for a successful launch. However no challenges or risk factors had been mentioned, I still believe that the team has enough passion to ensure success.", "q1r": 4, "q2": "The proposal has given considerable information to assess and the progress of the proposal if funded.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 31, "ne": 1, "ng": 19, "nfo": 11, "vca_o": 1}, {"q0": "As an experienced Technical builder and Active Catalyst member, coming from one of the TOP wine producer countries in the world I found this proposal aligned with the Challenge objectives, as implementing the smart contract in the trading platform will drive more usage and increase transactions in the Cardano Blockchain. Though its impact is not clear as no much information was provided in order to clearly assess that. As the proposal is aimed to support the validation of an MVP and business model in the market it does makes sense that this information will be better understood once that model is validated.", "q0r": 4, "q1": "The team brief description seems to be appropriate for the successful achievement of the project goals for this phase, though no specific details or external reference links were provided in order to further validate those capabilities. As the requested funds will be used to fund Sales/Marketing/Customer Validation I don't see there will be too much problem to carry out the desired goals, but no information was presented on the technical side as well, on how and whom will produce the prototype/MVP and wether those members of the team are already identified or hired.\nThe timeline is clear but not detailed, and we are talking about an MVP in 3 months, so I'd add many more details and deliverables to the project in order for others to assess if the plan fits the purpose and what type of platform/complexity will be built.\nNo details on the Business Model or Platform operation were provided, besides that it seems to be a double sided platform with a Smart Contract, I'd recommend to add those details so anyone can understand what is behind the idea, to form an opinion on its chances of success.\nI do value the expressed commitment that you will fund the building of the project on your own, that's great but not enough to reach the success of the project if what is being built is not the proper platform, and to understand that more details are needed.\nThe requested budget breakdown was provided and makes sense with its intended usage and market prices and seems reasonable for a Prototype (at least with what I imagine with the information provided)\nNo risks were identified within the proposal and there will be many to be addressed in the way.\nI recommend to add all of these details to produce a complete proposal presentation weather you are voted and funded, so you can provide progress reports (they will be needed) and if not voted to participate in the next funding round, loved the idea to disintermediate the wine industry.", "q1r": 3, "q2": "Even though a general goal of delivering an MVP and support the validation with the funds, no specific KPIs were provided, so it will be hard for the community to be able to audit the progress of the project. I recommend to add SMART KPIs in enough details within the 3 months project period to be able to measure and audit progress. General Production KPIs will also be great to have to understand the level of impact this project can/aim to produce.", "q2r": 3, "assessor": "z_assessor_288", "no_vca": 32, "ne": 14, "ng": 18, "nfo": 0, "vca_o": 1}, {"q0": "The tracking of wine, like other merchandise is something that blockchain should play a big future role in. This app in particular is set to make it easier to get on the list to be able to purchase and distribute directly from wineries in a fair manner which I think is great. There are a lot of wineries in Italy, my concern currently with how much impact it will have is that they dont appear to have any direct communication with a winery at this time which would be a great way to get started in knowing that this is something that is important to the wineries in their area.", "q0r": 4, "q1": "There is mention that the team has blockchain experience but there is a lack of information on exactly what they worked on in the past or links to previous projects and repositories. It would also be a good idea to attach member linkedin profiles or similar.", "q1r": 3, "q2": "I think the milestones that they came up with are well thought out and are achievable. I think the rationale for the salaries could use some additional work. For example with the part time external consultant, are you saying they will work 1 day per week and for each of the 3 months they would get 1500 usd? that seems quite high for roughly 4 days of work in the month. Its possible Im misunderstanding but some clarification on that would be appreciated.", "q2r": 3, "assessor": "z_assessor_119", "no_vca": 32, "ne": 2, "ng": 29, "nfo": 1, "vca_o": 1}, {"q0": "The proposal do achieve the challenge goal. Which is bringing more users to the platform (which runs in the ADA environment).\nIt has a potential to make a huge impact, since according to Fortune Business Insights  [https://www.fortunebusinessinsights.com/wine-market-102836], it has a projected grow to USD 456,76 bi in 2028. Therefore, if this platform could get 0,5% of its market, its a volume of USD 2 bi in 2028, which is huge.", "q0r": 5, "q1": "The proposal did not show the reference and links that shows the team experience. It would be good having this info.\nAbout the budget, I’ve not understood it quite well. I’m missing a more broken down information. Since you’re using the money just for marketing and sales, it should be added where are you intending to advertise, for example, for how long and which methods are going to be used to do it and check its reach.\nThe timetable seems fair to develop what you’re proposing.\nOne point that I’m missing is the logistic strategy. I’m wondering here if you’re going to be only a platform which connects the seller and buyer or you’re planning to have some logistics solutions. I’ve seen this site here (https://www.liv-ex.com) which looks like your proposal, however they have some warehouses to implement logistics. Here in Brazil we have some fidelity clubs which send different wines every month to the subscribers, but they too have their own logistic net (or they provide this service, not having the actual places). Therefore, you might find that providing this service to the seller is a way to increase their participation.\nWould be great to have a risk map, considering marketing effectiveness, logistics (is it going to sell all around the world?), seller stock, etc.", "q1r": 3, "q2": "It should be added some more KPIs like volume of transactions, number of countries supplied, etc. It would help to track the development of the platform.\nMoreover, since it was not defined the advertising methods, it’s quite hard to verify its effectiveness and audit it, needing more information (method, platform, tracking, etc). ", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 32, "ne": 8, "ng": 22, "nfo": 2, "vca_o": 1}, {"q0": "The idea is valid but some points in the proposal could be clearer. First, its not clear how this application would leverage blockchain and smart contract technolgies in relation to regular market place or plataform for wine selling. More details on this could be given.\nSecond, its also not mentioned the potential market for this business, which makes it difficult to assess its full impact. for instance, it says, waiting list are hard to get into, but it could also say how many people are trying to get on these lists and how many there are in the lists. However, I particularly like that the business development part will happen in paralell from the technical development. It would be nice also to see the business model that is being thought for this DApp or how it intend to get revenue from. It could be from a monthly subscribe fee, transaction fee, etc.\nI'd also provide more information on communication strategy to target audience. How will they be reached and what kinds of advertising would be made?\n\nImpotant to say that proposal is aligned with challenge as it will likely increase \"Number/growth of application output\", \"Number/growth of application transactions\", Total \"volume of Ada involved in application transactions\" and other challenge KPIs.\n\nIn general, the idea is good but proposal could better explore the advatnages of smart contract (specially for those not very familiar with it) and the total impact, considering number of potential users.\n\n\n\n", "q0r": 4, "q1": "There are very few information about the team. It only mentions that 3 people are committed and their general experience, with some vague terms (as wine world connections). To make this part better strucutured, it would be imporant to see their individual capabilities and experience, have linkk to verify the information and bring more concrete example. For istance, when it is mentiones \"wine world connection\", it could say with whom is this connection and what level of connection is this, if any toher project was already developed with them, etc.\n\n\nThe plan is sound as it is time-framed and contain acitivites and deliverables. Again, much appreciated that business development happens together with technical development. I also liked that a MVP will be done first. Theres also a fair budget breakdown distribuited in the timeline.", "q1r": 3, "q2": "There are milestones in the timeline and 3 KPIs defined. It would be imporant though, to see some targets spread out in time, to check its evolution and see if its going accordin to plan.\nOther possible metric to add is someway to measure the number of reccurrent purchases from same costumer. This could give som insight on the quality of the service as a whole (wine + platform).\n\nIn regard to risk analsysis, I'd consider both technical and business risks to be addressed have a mitigation startegy in place since begining.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 30, "ne": 11, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "为直接从生产商那里购买葡萄酒的权利开发一个开放的贸易平台，使其能够更广泛和公平地获得，并增加流动性。", "experience": "3人团队，拥有多年的行业经验，包括区块链专业人士和侍酒师毕业生+葡萄酒世界的联系"}