{"id": 383558, "author": "toddchapin", "title": "Building 'Realverse' Metaverse Dapp", "url": "https://cardano.ideascale.com/a/dtd/383558-48088", "category": 26240, "amount": 10000, "description": "Metaverse项目代表了幻想的世界。  现实世界的愿景、使用和效用是需要的。  需要一个 \"真实 \"的地球地理空间Dapp。", "funded": 0, "upvotes": 15019507, "downvotes": 15943188, "votes_result": 923681, "votes_cast": 139, "f6_no_assessments": 6, "f6_rating": 2.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "the proposal fully meets the challenge goals by building a game engine using the Cardano blockchain and its associated technology.", "q0r": 5, "q1": "The proposal team has a working GIS model that is growing. there is no indication of skillsets regarding Plutus or Cardano programming.", "q1r": 3, "q2": "the proposal makes no attempt to provide Audibility or KPIs for the challenge teams to monitor and measure ROI.", "q2r": 1, "assessor": "z_assessor_218", "no_vca": 21, "ne": 0, "ng": 14, "nfo": 7, "vca_o": 1}, {"q0": "Yes, for sure this proposal and project will give  big value for the end user in 2022. Especially with the geospatial stuff, it will bring something new & interesting to the Cardano Ecosystem. It's aligned with the challenge settings.", "q0r": 5, "q1": "There is no budget break down provided. Only a lump sum of 10000 USD. Still missing roadmap & milestones also (1 month, 3months, 6 months, 1 year). And how long does this project will be finished. Team members are not well explained in the proposal, so the community could not check the credibility of the team. Would be great to put a LinkedIn link in the proposal.", "q1r": 3, "q2": "There is only GitHub repo link to Geodaka project. How will the team provide project progress is not describe in the proposal. The key metrics are still missing. I could only see the test example from the metaverse in https://geodaka-cesium-test-environment.netlify.app/  \r\n\r\nMaybe describing how the team will be responsible with the funded money woule be great, as it assures community that the fund will be used properly with achievable target result that could be audited.", "q2r": 3, "assessor": "z_assessor_282", "no_vca": 15, "ne": 2, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "This looks like an enormous project that seeks to create a decentralised version of the entire planet. The workload is substantial but that doesn't mean that it is not obtainable. Will follow this one with interest as I feel this project is in early development stage and will need further collaborators/funding to hit full speed. ", "q0r": 4, "q1": "The proposer appears to have the necessary experience required to get the project up and running as can be evidenced by the website provided. At this stage a one person team in the process of reaching out for collaborators. The plan presented is lacking detail but that is understandable as this is early in the incubation stage it seems. There are really no specifics to do with milestones presented and that makes it difficult to realise potential. ", "q1r": 3, "q2": "The information provided is solid and serves to garner interest. It provides a taste of what is being offered and what is the problem to be solved. The budget is reasonable and not aggressive. The project is very much in its infancy and appears to be looking for collaborators in order to build momentum and launch in a future Funding round.  ", "q2r": 3, "assessor": "z_assessor_53", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "\"In my opinion, this is a solution that converts properties or locations from the real world to the virtual world. But through a few explanations of the proposal, I still see that it only has the same features as Google Map, but there is no difference. The only difference is that it is implemented on the blockchain platform.\r\nBut all the things proposed by the proposer are still in the form of ideas, products and solutions that are not yet clearly explained. Not having an implementation plan is another thing that makes impact very difficult to determine\"", "q0r": 2, "q1": "\"The team of the proposal is implementing the project https://geodaka.github.io/ which is also a proof to demonstrate the team's ability.\r\nBut the lack of a specific plan and product description is a big problem in the feasibility of the proposal\"", "q1r": 2, "q2": "\"No information about any relevant aspects are given, making the proposal not auditable. The proposer would have to add the following parts to his proposal to make the idea assessible:\r\nRoadmap and milestones\r\nDefinition of success  (e.g. metrics or KPIs appropriate to this challenge)\r\nAt the moment it does not seem reasonable to ask for 10.000 Dollars without providing relevant information on auditability. Documentation would have to be included as well.\"", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This main point is about developing Geodaka.com, .io Geospatial digital twin of the planet.  GIS, Game Engine, and the Cardano are combined to create a Dapp for all. The problem statement is not quite convincing, and not explained in detail. Besides, this proposer did not show what he/she is going to do with the requested budget [$10,000] through this proposal [creating Native token EEE ? Building team of international GIS Gaming and Blockchain developers to bring the Realverse to life in 2022 ?]. As an urban planner, I like this idea very much, however, it [this proposal] is incomplete. As a result, not likely to address this challenge of developing Dapp and unclear impact. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "Through the provided link [https://github.com/Geodaka/Geodaka.github.io], the project's mission can be seen. However, since this proposal did not provide a clear intention of what is going to do, and lacks important components of information [no goal, no roadmap, no KPI/metric, no budget breakdown,...], It is hard to evaluate how feasible it is. My advice is: based on the defined missions, the proposal's solution should be clarified in detail for answering the question of: what is the function of this dapp, how long it takes to build it, who is your partner, what KPIs/metric should be to measure the success,...\r\nAfter all, based on the given information, I can not agree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "Since this proposal lacks important components of information [no goal, no roadmap, no KPI/metric, no budget breakdown,... transparency can not be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "Unfortunately, this proposal lacks all the basic elements of a Catalyst proposal, as outlined in the self-assessment checklist, making it impossible to assess its impact and how well it addresses the objectives of the dapps & integrations challenge. \r\nPerhaps an improved version, containing the roadmap, KPIs, a detailed budget and most importantly a clear description of the project goals, can be resubmitted to a future fund. The concept of a digital replica of the Earth is intriguing, but it's not clear from the proposal exactly what it would be used for, how it would be recreated and integrated with the Cardano blockchain.", "q0r": 1, "q1": "Impossible to assess whether or not the proposers would successfully complete the project's goals and objectives and it's not clear from the proposer what those are. The proposal lacks a detailed plan, roadmap or broken down budget. I would advise adding all these elements in future a version of the proposal, as well as an estimated start date.", "q1r": 1, "q2": "The community would find it extremely difficult to evaluate the effectiveness of the proposal in addressing the goal of increasing adoption of the Cardano blockchain as long as no metrics for auditing the proposal are included. I would suggest including a clear set of KPIs and defined deliverables in a future iteration of the proposal.", "q2r": 1, "assessor": "z_assessor_681", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "开发Geodaka.com，.io地球的地理空间数字双胞胎。  GIS、游戏引擎和Cardano结合起来，创造出一个适用于所有人的Dapp。", "experience": "开发 https://geodaka.com/ 一个正常运作的POC MVP GIS，公共汽车/公共汽车车主可以在此注册自己的数字空间，数字世界平台。"}