{"id": 384071, "author": "keith", "title": "Music NFT Launchpad", "url": "https://cardano.ideascale.com/a/dtd/384071-48088", "category": 26240, "amount": 20500, "description": "音乐家们无法有效地实现多样化，也无法利用目前由主导企业主导的平台来实现其音乐的货币化。", "funded": 1, "upvotes": 47129533, "downvotes": 9794957, "votes_result": 37334576, "votes_cast": 183, "f6_no_assessments": 6, "f6_rating": 3.5, "videos": [], "media": [], "f6_assessments": [{"q0": "这项提案解决了音乐人无法利用音乐行业现有的平台使其音乐盈利的问题。我自己也是一名音乐家，对此深有体会。问题陈述的解决方案并不包含实际的解决方案，但幸运的是，在问题陈述的标题和路线图中都可以找到。该团队的目标是为音乐家创造一种学习音乐NFT的方式，并将其作为一种方式发布，同时在流媒体平台上发布。考虑到音乐产业是相当复杂的，我希望他们的平台能有更多一点详细的解释，但我以后会说到这个问题。将音乐和艺术家有效地整合到NFT空间，以前已经被提出并尝试过很多次（因为非常需要），但还没有一个真正坚实的平台被推出。这个核心想法非常有意义和伟大，如果成功并得到适当的发展，它可能对Cardano生态系统和整个音乐产业都是一个巨大的交易。我同意这个建议解决了这个挑战，尽管它的目标是如何执行上述计划，但很模糊。", "q0r": 4, "q1": "该团队在营销、设计、工程和咨询方面拥有大量的专业知识。首席创始人是一位股权池运营商，这证明了他对Cardano生态系统的深度参与和理解。一个可以进一步加强团队可信度的补充是包括一些其他来源，可以验证团队的专业知识和能力。有一个链接提供给产品的测试版（这很好），但我要求的是团队成员本身的介绍。该提案要求的资金不到挑战赛总预算的10%，但如果能在提案的资金分配部分看到对工作时间的估计，那就更好了。例如，网络开发人员的5000美元拨款意味着多少个小时，以及在什么时期？启动板（artistdrop.io）已经启动并运行，这是非常有希望的，这对项目的未来是很好的说明。如果我对提案的理解是正确的，团队将是把艺术家的原创作品铸成NFT，这可能既会得到艺术家的赞赏，也会受到他们的批评。如果能从艺术家和买家的角度对平台的使用过程做一个简单的例子描述，将为这个提议提供很多的明确性。  总而言之，我同意这个建议很有可能成功实施。", "q1r": 4, "q2": "该提案包括一个从2021年第四季度到2022年第二季度的路线图。为了进一步提高提案的透明度，在我看来（作为一个有经验的社区顾问），在路线图中加入一些关键绩效指标会很有帮助。例如，从什么时候开始，\"每月有4名音乐家上岗，每周有一次NFT投放\"？它已经开始了吗？另外，解释去除造币服务中间商的过程，以及这样做可能遇到的挑战，因为很多人不熟悉NFT造币的内幕。\r\n真正能提高团队和提案的可信度的是对与这个项目的发展相关的潜在风险和挑战的一些思考。作为一个活跃的音乐家和与唱片公司签约的经验，我想知道如果音乐在其他平台发布，但同时在artistdrop.io铸造，团队将如何处理音乐的权利？是否会与流媒体平台和唱片公司合作，或者在他们不知情的情况下？还是会将提案的重点放在独立艺术家身上？在音乐行业有很多合同和陷阱，我相信为艺术家创建一个坚实的NFT平台的最大挑战就在这里。如果能解释一下团队的目标是如何解决这个问题，将会相应地增加提案的信任度和可信度。由于本提案提供的信息有限，我既不反对也不同意本提案为我提供了足够的信息来评估实现其既定目标的进展。", "q2r": 3, "assessor": "z_assessor_349", "no_vca": 18, "ne": 11, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "The proposal defines a problem and introduces a solution to tackle it. It could have been made clearer what exactly makes this marketplace special in comparison to other marketplaces. ", "q0r": 4, "q1": "The proposal is already in the works which shows the commitment of the team. The team has a wide experience in tech and blockchain and the lead founder is already involved in the cardano community since several years. They could have added some more technical aspects to the proposal in my opinion, why I will rate this with a four.", "q1r": 4, "q2": "The proposal provides information about the team, the roadmap and how they will use the budget. In my opinion the roadmap could be more detailed. Also the key-succes metrics could be explained a bit more in detail. Overall the proposal provided more than enough information to asses it and get an idea of the product", "q2r": 4, "assessor": "z_assessor_41", "no_vca": 14, "ne": 1, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The problem in the proposal is within this challenge. Their success metrics also fit with the challenge direction. But the team should provide more info about how their event will impact the Cardano ecosystem. ", "q0r": 4, "q1": "The team doesn't have a clear implementation plan that helps to understand what they will do. This project is not simple and they need to think more about the plan to add to the proposal instead of only brief info for each field of activity. \r\nAfter that, they should make a more detailed roadmap. And some relevant risks, that the team doesn't mention here. \r\nAt last, the budget that the team required is suitable with the provided roadmap, but as I mentioned above, they should make a better plan, then a better roadmap to help CA assess it. ", "q1r": 3, "q2": "For the idea of this project, my advice to the team is that they should make a better roadmap. The current roadmap and key metrics are close enough to audit what they will do in the future. \r\nThey don't have any content to show about the well-acknowledgment about problem context and clarify how their solution can address it. ", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The music NFT launchpad proposal fits well with dApp & integrations by allowing the artist to launch their singles or albums using a NFT along with a release to their streaming platform. This will encourage more artists to use the platform and lead to increasing adoption on Cardano.", "q0r": 5, "q1": "Although the proposer team has no direct experience in music, their technical background (engineer, consultant, and designer) will help them to implement this proposal. It would be quite good for them to locate someone who could look into smart contract development as they will work closely with smart contract developer and it will be a smooth operation when the team can communicate which feature is necessary for the future launchpad.", "q1r": 4, "q2": "The funding allocation looks plausible but the community would appreciate more elaborate response for this part. To create the launchpad ready in 6months is quite an impressive task in itself. Anyhow the community can assess the fund flow as well as monitor the project progress anytime at ease with the mentioned KPIs. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "I see value in creating a platform where creators/musicians can sell their music NFT(s) in the Cardano ecosystem. This will in fact benefit the current users and attract new users, as the problem has been clearly  stated, that musicians in the traditional schemes of this business are being monetized by corporations and not having the true value of their own crafts. ", "q0r": 4, "q1": "The team members are clearly stated, and I have looked up to the website. I am not sure what the proposer means as live, as the current website have only few information about the proposal. Moreover, I have tried joining the discord server but was unable to as the invitation was expired. In addition to this, as a UI/UX designer that uses Figma, the prototype on the given link is only half way done. This gives a lack of confidence for both CA(s)  - to understand clearly the proposer's idea, and voters - to have confidence in which how the technical development of the idea. Though the roadmap has been defined, but vision of expansion, milestones to develop, and risks to be taken are not well delivered. ", "q1r": 2, "q2": "The required funding must be broken down in a detailed manner and take account of risks that will be addressed, as to have better auditability. What's lacking is the milestones and management on the KPI(s) given. For example, how do the proposer intend to increase musician revenue by 20% by Q2 2022. What steps should be taken to put importance and protect/avoid musicians from scammers in the platform? What are the UX features that enables users to adopt the platform easily? ", "q2r": 3, "assessor": "z_assessor_669", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Onboarding musicians to distribute their work through NFTs on Cardano, has the potential to greatly popularise the platform. However, after reading the proposal I'm not convinced that the team behind it is the right candidate for the job. On the other hand, this may be the result of a rushed proposal due to lack of time.\r\nThe idea has a lot of potential, and it would be great to see a CNFT \"record label\" be born, that's why I would hope that the team resubmits a more complete and thought out version of the proposal in the future.", "q0r": 2, "q1": "The description of the proposers' experience is very promising at first glance, but no credentials or links to previous works are given to allow the community to verify and better judge for themselves.\r\nGiven that their landing page is presented as a working platform I have my doubts about the standards of the team at the moment.\r\nI would advise filling in the gaps in the gaps in the proposal, elaborating on the promising concept and resubmitting it to a future fund.", "q1r": 3, "q2": "Not a lot of thought seems to have been given to the KPIs of the proposal, they are present, but are very shallow. I would suggest further elaborating on them in a future iteration of the proposal.\r\nThe proposers are keen to point out that their service is already live, however on inspection of their website I discovered that it is little more than a landing page with a brief FAQs section.\r\nThe budget is broken down, but the figures seem a bit generic, particularly the sum allocated to the smart contract developer. The roadmap is brief and introduces elements not detailed elsewhere in the proposal.", "q2r": 3, "assessor": "z_assessor_681", "no_vca": 13, "ne": 2, "ng": 11, "nfo": 0, "vca_o": 1}], "solution": "音乐家们将能够在向流媒体平台发布单曲或专辑的同时，将其作为NFT发布。", "experience": "我们的团队目前包括三名成员，他们在技术、区块链金融和营销方面有广泛的经验。"}