{"id": 385153, "author": "titan", "title": "Web based transaction editor", "url": "https://cardano.ideascale.com/a/dtd/385153-48088", "category": 26240, "amount": 16000, "description": "Cardano CLI在大型复杂交易中的使用过于繁琐，并将非技术人员锁在一边。", "funded": 2, "upvotes": 141093638, "downvotes": 2810792, "votes_result": 138282846, "votes_cast": 791, "f6_no_assessments": 7, "f6_rating": 4.857142857142857, "videos": [], "media": [], "f6_assessments": [{"q0": "提案人想引入一个更可用的交易网络编辑器，以取代Cardano CLI（命令行界面）。作为一个开发者，我可以理解提案中所描述的问题，并验证它符合挑战的设定。它清楚地阐述了这将如何为cardano生态系统中的开发者带来价值并激发他们的喜悦，包括我在内。关键绩效指标是相关的，因为它们是用用户体验来衡量的。衡量标准是相关的，而且很明显，提案人在实际的提案中花了很多心思，不亚于在工具本身。会有一些挑战，但考虑到作者的经验和时间管理，我毫不怀疑所有的障碍都会被顺利跨越这个提案中没有任何遗漏，这很难得。这个项目将增加生态系统中所缺少的东西：一个简单的方法来处理交易，而不必遭受痛苦。这里没有任何担忧。如果得到资助，这个项目将对社区产生巨大的影响，我鼓励人们像我一样投票支持这个项目!", "q0r": 5, "q1": "所列的证书和技能非常多，我花了一些时间来阅读和核实它们。这家伙是理论物理学的博士，而且有证书可以证明。有一个明确的执行计划，他知道需要完成的工作以及完成工作的时间和过程。预算很清楚，分解得很好，足以合理地实现既定目标，其中有很多目标，而且是雄心勃勃的目标。提出了一个完成工作的现实时间表，但我想知道一个团队是否更有好处，但我可以肯定地尊重那些想以适当方式建立一个工具的人，而拥有团队成员并不总是达到最终日期的方法。不仅对 \"什么\"，而且对 \"如何 \"也提供了详细的解释，这很难得，我很感激。项目开发所需的资源都被列出。技术方面，如所选择的编辑器和已经存在的功能，以及未来的计划，都作为里程碑进行了描述，并且很有意义。建议者已经考虑了与成功实施有关的挑战和风险。除此之外，他还分析了这些决定的影响。该项目与已经完成的工作同步，我相信这将是未来发展和建设的一个基石。绝对是提案的明星之作!祝您好运!", "q1r": 5, "q2": "说到可追溯性，作者已经有了非常具体的时间表，并计划如何让社区的beta测试者在工作周期中帮助他，以及计划编写文档。让社区知道正在提供的功能是一个优先事项。我认为让人们知道所做的和开发的东西没有问题。衡量标准和关键绩效指标也与提案的其他部分相一致，这在许多其他提案中也是如此。一个带有里程碑和所有必要项目的路线图，以及一个考虑到挑战并为其提供缓冲的时间表。可以理解的问题和相应的解决方案是存在的，而且写得很好，尽管有时有点技术性。这是为日常软件工程师的斗争提供的解决方案。  好运!我为你投票!", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is brilliant and  clearly addresses the challenge by creating a user friendly alternative without sacrificing the power and utility of the Cardano CLI. The transaction editor aims lower the technical barrier to crafting complex transactions and become more accessible to a wider range of users. This proposal is a  great example of an application that pushes power to the edges. I believe this project can significantly boost development in Cardano's DeFi ecosystem.", "q0r": 5, "q1": "The proposer has shown to have the ability, technical skills, and plan of action to follow through with proposal. The GitHub repository for this project shows that there is already a significant amount of progress and currently has a working \\alpha-prototype of the the transaction editor. The proposer offers a well defined and realistic timeline to complete the project along with a reasonable budget. This project seems like a promising venture and at a good value to the community. ", "q1r": 5, "q2": "Easily auditable record of accountability through GitHub. The proposer clearly has experience with open source production, which allows the community to more easily track and audit the progress of this project after the project is funded. The proposal offers a clear set of metrics and key points of friction that can be used to measure their progress and thus maintain transparency with the community.", "q2r": 5, "assessor": "z_assessor_338", "no_vca": 21, "ne": 5, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "The command-line tool Cardano-CLI is powerful and versatile. Due to its versatile nature, the learning curve is quite steep and demanding. A web GUI-based step-by-step app is likely to help onboarding new developers and reduce the friction for new people trying to learn the Cardano ecosystem. This tool will be a great help even for SPO and those trying to experiment with things like multi-party signed messages etc. ", "q0r": 5, "q1": "The proposer is a prize winner in the Capstone challenge which was conducted during the Cardano summit. Therefore he has demonstrated capability in the area of work. Moreover, the project has less technical risk, therefore I believe that the proposer will be able to achieve his objective. ", "q1r": 5, "q2": "The list of features and the set of transactions that this web application will help in the building has not been clearly brought out. However, the end state and the objective is clear and straightforward. This is likely to improve the auditable and success measurement. The fund requested is slightly on the higher side and maybe broken down to be more transparent.", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 19, "ne": 4, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "This proposal I believe could possibly be a great fit for two different categories, this one and the open-source developer ecosystem as I feel it is a great fit for both challenges. \r\n\r\nThe proposal itself makes a great point about Cardano-CLI which is in fact not very user friendly, and I and many others anticipated something like this eventually coming along and allowing a higher-level UX for less experienced developers to be able to create txs for the Cardano blockchain in a user friendly way, which the Cardalo-CLI is evidently not. ", "q0r": 5, "q1": "Oscar is a fantastic programmer and has made previous contributions to the Cardano ecosystem, he was also a very active Plutus Pioneer and contributor.\r\n\r\nGive his details plan of execution and timeline, I believe we have more than enough information to determine that this proposal has a very high likelihood of success. Oscar has also opted not to use Blockfrost API which proves his level of competence in utilising Cardano DB-Sync, and interacting with the Cardano blockchain.", "q1r": 5, "q2": "I believe given the prior work on this tool already with the working text editor porting it to be a web based editor will be well within the proposers reach and given the roadmap posted with detailed milestones and KPIs, I believe this proposal will be incredibly easy to audit and determine just how successful it was.", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 16, "ne": 2, "ng": 13, "nfo": 1, "vca_o": 1}, {"q0": "Very strong proposal with a great potential and utility for the community. Since it will be available on GitHub licensed GPL3, it is highly likely that other blockchain projects might be interested in adopting this innovation. Addresses the challenge very well.", "q0r": 5, "q1": "The necessary experience is presented, impressive skills + Plutus pioneer program. The plan is very good and convincing from the technical point of view.", "q1r": 5, "q2": "While the information to audit the progress does not match the VPS budget, the proposal gives a convincing justification for that. In addition, the progress (and later the success) of the proposal is easy to measure from the Github.", "q2r": 5, "assessor": "z_assessor_685", "no_vca": 16, "ne": 1, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "The proposal clearly identifies a need within the challenge. As well a clear path to implementing that need through a transaction editor layered on top of the CLI.", "q0r": 5, "q1": "The proposer is well known within the community and holds the skills required to perform the task. The funds requested are well allocated and clearly defined. The implementation is well thought out and expressed although it would be good to highlight possible pitfalls such an implementation may come across. ", "q1r": 5, "q2": "There is a clear path to audibility. The road map is well defined. The KPIs listed are very well thought out. ", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "The proposal addresses the issues of adoption and attracting new (especially technically inexperienced) people to Cardano. ", "q0r": 5, "q1": "Since the proposer is already an experienced developer and has provided github repositories of existing work. The only risk that isn't considered: what if the dapp testers won't be representative of the real use-cases? This could be detrimental to the UX of the final product. ", "q1r": 4, "q2": "Due to the fact that the project will be open-source from the get-go and will explicitly gather community feedback, the progress will be easily auditable. ", "q2r": 5, "assessor": "z_assessor_832", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "一个基于网络的交易编辑器，一个让你在指导性的用户体验中制作你的代币铸币交易的服务。", "experience": "为文本编辑器建立交易编辑器，它是Plutus先锋Capstone挑战赛的获奖作品。"}