{"id": 385138, "author": "javiertc86", "title": "Distributed storage Infrastructure", "url": "https://cardano.ideascale.com/a/dtd/385138-48088", "category": 26240, "amount": 15000, "description": "维护一个IPFS基础设施是非常耗时和昂贵的。", "funded": 1, "upvotes": 75187394, "downvotes": 3789782, "votes_result": 71397612, "votes_cast": 324, "f6_no_assessments": 4, "f6_rating": 4.499999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "该提案非常有效地解决了这一挑战，并提供了一个全面的计划，为在Cardano上使用IPFS的去中心化存储解决方案建立一套开发者工具。他们清楚地阐述了他们将如何通过提供一个易于使用、高可用性的API和开发者工具（SDK）来与IPFS互动来解决这个问题。为开发者创建这些工具将使在Cardano上开发的人更容易（特别是NFTs的创造者），同时也进一步吸引更多的开发者在Cardano上开发（降低进入开发的门槛），这最终将导致在Cardano上构建的dApp越来越被采用。", "q0r": 5, "q1": "这个提案被证明有一个经验丰富和出色的团队，我们可以在Linkedin上查看他们的资料。不仅团队的角色已经确立，而且有详细的解释，每个人在各自的领域都有7年以上的经验。预算对于今天每个角色的工资来说是合理的，但它缺乏关于事情成本的细节。如果他们至少能提供更多的细节，例如，服务器基础设施的成本：你将使用什么样的服务器？它的成本和维护费用是多少？等等。除了预算之外，他们还能以合理和可操作的方式提供一个实施计划，例如JS SDK会是什么样子，HTTP API端点是什么，用户界面会如何实现，等等。我没有给它五星的原因是缺乏预算细节，特别是关于 \"服务器基础设施 \"的预算。除此之外，总的来说，这个建议有很大的潜力可以成功实施。", "q1r": 4, "q2": "这项提议的成功是明确定义的，并且很容易衡量，即API和SDKs要么成功交付，要么不成功。然而，他们并没有说明这个SDK是否会在Github上开源，这将使检查进展的透明度降低。看看他们之前的Github repo（cardano-wallet-js），看起来他们可以很容易地在tango-crypto下创建一个新的 repo。但话说回来，由于这看起来是一项付费服务（从他们的网站上看，不同的服务有不同的等级），我不能确定他们是否会把这个开源。给它4颗星是因为我想确定如何以更透明的方式检查进度。", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Could not stress enough how important distributed storage is for DApps going forward.\r\n\r\nIn fact, most \"decentralized\" applications still rely on some centralized backend utilising PostgresQL or some other database. This challenge is perfect for the Cardano and web3 ecosystem in general, and could be utilised, if successful, by basically every DApp.", "q0r": 5, "q1": "Given the progress made on other tools created by the team members, the progress on the API endpoints that the team has mapped out already I cannot give this proposal any less than 5 stars when it comes to how likely it is that team will successfully implement this roadmap and reach their milestones.", "q1r": 5, "q2": "The roadmap too, looks great. Roadmap includes detailed milestones with specific KPis for each which is what I generally like to see because it greatly enhances our ability to audit the success of the proposal.\r\n\r\nThe team has provided a very detailed look into the very API endpoints that they are creating for this JS SDK.\r\n\r\nThis proposal is highly auditable and is definitely worth of 5 stars!\r\n", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The proposal will have a positive effect on the Cardano ecosystem and will drive NFT consumers and producers to Cardano, however the risk could be in gateways which seem to be centralized. This could lead to time lag when resolving IPFS URLs. ", "q0r": 4, "q1": "The proposers have a vast range of experience with all things Cardano and have presented a rich amount of evidence to that effect. ", "q1r": 5, "q2": "Going from the history of the team, it is very likely that their solution will be open-sourced, and therefore subject to public scrutiny, although that is not explicitly mentioned. ", "q2r": 4, "assessor": "z_assessor_832", "no_vca": 13, "ne": 2, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "Decentralised File Systems like IPFS are fundamental to build pure DApps. This proposal will heavily drive an increase of the utility and adoption of Cardano by allowing other projects to use IPFS through their APIs. Plus, it will provide a service layer which will allow to mint NFTs. To me, it looks like an essential piece of infrastructure needed by other projects, in order to be more productive and focus more on Their business objectives.", "q0r": 5, "q1": "The plan is detailed and clear. The team is experienced and has built with success several other applications in the Blockchain space. From my point of view, the budget should have been a bit higher to cater for unforeseen circumstances. \r\nOf course, I believe the server infrastructure is 9000 and not 90k - That 90k is probably a typo. ", "q1r": 4, "q2": "The proposal roadmap is simple, clear, and can be audited effectively. I really wish I could give 5 stars, because the roadmap is linear and easy to audit. However, we are  missing Key elements from the challenge that is the measure of the growth/usage of the system.\r\nI think this is because in the roadmap are mixed the auditability with the implementation plan and. There is a simple way to add the missing important information: I would have added one more step to the roadmap: After the service is launched, monitor (1) how many projects are actually using the APIs, and (2) how many files are added to IPFS, (3) how many NFTs are minted. \r\n", "q2r": 4, "assessor": "z_assessor_956", "no_vca": 22, "ne": 7, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "我们为IPFS存储提供易于使用的HTTP API和SDK。", "experience": "我们运营TANGO赌注池，并开发了Cardano-wallet-js和Tangocrypto软件作为一种服务。"}