{"id": 397184, "author": "essbante", "title": "WAL-CLI Communication", "url": "https://cardano.ideascale.com/a/dtd/397184-48088", "category": 26451, "amount": 10000, "description": "The communication protocol required to enable interaction between RootsWallet wallets and WAL-CLI instances needs to be implemented.", "f6_no_assessments": 5, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 614, "q0": "More critical infrastructure for a fully functional SSI wallet from RootID.  In this case, they need to build the communication channels that allow peers to talk to each other without the need of a mediator.  The most likely form of use, in this case, will be the Issuers in the system to be able to communicate directly with the holders.  Among the things needed to establish this connection will be protocols to establish channels when the requirements being expressed aren't \"known\" (for example, if a connection had been established in the past, this isn't a requirement that can be known by either party, so the connection gets made all over again).  This type of peer communication is what makes the difference between a UX that is versatile and intuitive, and one that blocks you constantly, and requires contant workarounds.  As another piece of the RootsID rollout, this is a must have bit of code.", "q0r": 5, "q1": "Inclusion of the DIF and ARIES documentation was very helpful to drill down on exactly what functionality this component was adding, and it exactly this kind of attention to detail that gives me confidence in this team and this project.  SSI is an area of endeavor where you have to tread carefully and thoughtfully --measure twice, cut once kind of thinking-- and this team has demonstrated repeatedly that they take the principles of SSI very seriously, such as their contributions to the working groups in DIF and ToIP and others.  In my opinion, that might be the most important characteristic to comptete successfully in this space.  But it helps to be on top of the coding and development as well, and there, too, they keep demonstrating an ability to manage large projects with agility and keep delivering the commits.  In fact, the only real issue I see across areas like the timeline and budget, will be keeping this project on track and prioritized in order not to block other areas that will be undergoing implementation for the wallet.  But the clarity of the tasks to be accomplished and the assigned times as they have presented them here indicate to me that they will be able to get it done.", "q1r": 5, "q2": "The entire RootsID project is opensource, and they are already maintaining an impressive list of reps for this project on Github.  This component is no different, and we can expect that between tracking issues and commits, and the project tracking Github board, that we will be able to keep up.  In addition they are running a discussion panel in the WAL-CLI github, which aggregates all of their announcements in one place.  This is exactly the profile I would like to see every opensource project maintain.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 16, "ne": 6, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 1929, "q0": "The project clearly states that there must a communication protocol between the RootsWallet wallets and WAL-CLI.  The solution to this problem is to expand WAL implementation in order to achieve communication between them.  This is needed for the cardano ecosystem to grow and keep it going.  The KPIs addressed in the proposal are aligned with the challenge.", "q0r": 5, "q1": "The team is fully qualified and with experience in implementing the project with success.  Links have been provided showing their past work as well as videos.  A detail weekly timetable with detailed tasks is provided which seems reasonable and viable. and also the budget is broken down according to hours of work/task.  The team clearly stated that the nature of the project is technical and implementing the project has no risks as they feel very comfortable in regards to their technical abilities.", "q1r": 5, "q2": "The proposer added that the development of the project will  be managed in a public Github repository so that the community can audit the progress of the project.  The KPIs added are aligned with success and are quantifiable.  This is an excellent presentation of the proposal and brings out a lot of confidence not only about the need of the project but also its success.", "q2r": 5, "assessor": "z_assessor_1434", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 6718, "q0": "There is a requirement for development of subsidiary software tools for exploiting AtalaPrisam. one such piece of the code is the Wallet in cli and its communication with the rootwallet. This will enable the building of the Atla prism project. therefore the proposal is critical and is in alignment with the challenge.", "q0r": 5, "q1": "The team has develped WAL-CLI after Fund 7 allotment. Therefore the team should be capable of developing the solution. The team also has the necessary qualifications and experience in carrying out the proposal based on the references cited in the proposal.", "q1r": 5, "q2": "The proposal is for the allotment of 10K USD for eight weeks of work by the team. This proposal can potentially move DID solutions using Atala into the testing phase. The output of the proposal is clearly defined, and it can be evaluated realistically. Considering the above details, it can be said that the proposal is highly measurable and auditable. ", "q2r": 5, "assessor": "z_assessor_46", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 6882, "q0": "Identity wallet infrastructure is crucial to an effective SSI ecosystem, and the WAL-CLI and RootsWallet projects are the leading ID wallet projects in the Cardano ecosystem. So this project to build infrastructure to connect the two is clearly within the scope of the challenge brief to position Cardano as a leader in the SSI space. This project very effectively addresses the challenge.\n\nI am qualified to give this assessment due to 20+ involvement in identify applications, and as a funded Catalyst proposer (F6 and F7) for authentication/identity related applications and an Atala Prism Pioneer.", "q0r": 5, "q1": "This team is known in the Catalyst SSI community and has a track record of delivering the WAL-CLI application, which is available on Github. The project plan is clear and the budget is reasonable. It appears highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "This is a software development project with a clear specification. The ability to track development of the proposed functionality on Github is sufficient to audit the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_495", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"id": 9727, "q0": "The proposal looks to expand on an already completed proposal from fund 7 that was a CLI for working with Atala PRISM credentials so that a secure communication channel can be established between the issuers (who would use the CLI) and holders (who would use Roots mobile wallet). The identity ecosystem requires infrastructure for both the issuers and holders for it to start gaining adoption amongst different organisations and communities. The team identify the core specifications from within the SSI community that are relevant to the efforts for this proposal. The potential impact of this open source infrastructure and the collaboration between the proposer and Roots wallet is high and is well aligned with the challenge of further pushing forward identity adoption in the ecosystem.", "q0r": 5, "q1": "The proposal breaks down a roadmap of the key areas of development such as research, design, implementation and testing. Each heading has a list of well broken down items to complete. For the budget an hourly amount and total is provided to show how the final budget was derived. In terms of the team the original proposer initially was working on the CLI implementation independently and now has joined the Roots wallet initiative to combine the learnings. The proposer provides a link to the initial release for the CLI which has not been incorporated into the Roots wallet Github. It is clear that the proposers are both technically capable of implementing this proposal and have also shown great collaboration within the community initiatives. Both team members provide their LinkedIn profile and key information which helps generate a high confidence that this team will be able to deliver against what has been proposed based on the evidence and sources provided.", "q1r": 5, "q2": "The proposal team provide a Github repository where all the code will be stored for this proposal. Previous implementations can already be seen which gives confidence that this proposal will follow the same path of being easy to audit for the community and also be a good source of knowledge to learn from. The team mention a weekly progress updates part that will go into a discussions page on the Github repository which will also help keep the community informed. The success of the project is suitable given this is infrastructure that takes it to the next step of the evolution within the identity space. Based on the previous evidence provided and their plan for this work it looks highly likely that it will be easy to audit and track this proposals execution and the intention of the project has high clarity.", "q2r": 5, "assessor": "z_assessor_758", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}], "solution": "Expand WAL implementation to include required functionality so a communication channel can be stablished between RootsWallet and WAL-CLI", "experience": "The team is fully engaged on Decentralized Identity projects in the Cardano community with projects already funded and delivered on F7. They've delivered WAL-CLI and are currently working on development of RootsWallet."}