{"id": 397983, "author": "michiel", "title": "Control your data - PRISM (Profila)", "url": "https://cardano.ideascale.com/a/dtd/397983-48088", "category": 26451, "amount": 67500, "description": "Today, companies have your data and (mis)use it for their benefit. People should control the use of their personal data and benefit from it.", "f6_no_assessments": 3, "f6_rating": 4.777777777777779, "videos": [], "media": [], "f6_assessments": [{"id": 628, "q0": "Of all the various pieces of the puzzle that Profila is assembling to build out their DeMar/ZKA (decentralized marketing/zero-knowledge advertising) solution, I think this piece here might be the most critical.  SSI, which is the foundation of the ZKA concept, is enormously complex.  With their B2B integration of PRISM already underway, and complex in its own right, it is the point at which they link that SSI functionality to the PRISM wallet holder where the complexity skyrockets, the current limits and possibilities of Atala come to the foreground, and the reality of the products viability start to show up.  While the proposal isn't as clear as it could have been on this particular component of the project (I appreciate all of the general context provided for the overall project, but I would have preferred to see it formatted as short overviews with links to details for the Profila high concept, its roadmap, all funded proposals, and all current fund proposals, in that order, with the majority of the proposal focused on the details of this component), this is the part where the Profila app is able to work with the platform backend and actually give the end user the critical control of how to \"facet\" their data.  By that, I mean have total control of how that data is presented to advertisers, what combinations are used, and the ability to cryptographically secure that info so that even the advertiser doesn't know what it is, they just have verified proof that you are a target cohort for them.  The secret-sauce of the Profila platform is that by truly building on an SSI foundation, rather than just paying lip service with 3rd party servers rolling out incomplete and compromised SSI, they have completely flipped the data conversation on its head: instead of talking about how to hide your data from evil prying eyes, they are empowering consumers by giving them actual control of the data, and anticipating that control, they are simultaneously opening a reciprocal channel between consumers and businesses.  I can't overemphasize how elegant this is...by making a path for businesses to become the customer of the consumer, the relationship between the two becomes more balanced, and in becoming balanced, more harmonious.  No more middlemen tilting one side or the other in order to get a cut, just equally vested parties engaging in consenting acts of commerce.", "q0r": 5, "q1": "As important as I think this overall endeavor is, and as important as this particular component is to its success, I have to admit that I wanted to see less about the overall project and more about the specifics of this piece.  The timeline and the budget are clear examples of what I am talking about with line items for hundreds of hours of development work, but no description of what is to be developed, beyond the high level Atala integration.  I would like to know if they are looking at presentation exchange at this point, of being able to recognize ID from other SSI ecosystems like Sovrin, or things like whether this is still part of the DIDcomm rollout, or if that is fully implementable already.  Basically, I don't know the SCOPE of what they mean by Atala integration for B2C, and even just a bullet list of 4 or 5 aspects of the integration would have set my mind at ease that they are approaching this in an integrated consistent way.  Having said that, the history of these Profila proposals has always been a bit \"emergent\", almost like research projects with development departments, so I still anticipate that this proposal will be among their success stories.  The big risk, of course, is meshing what Atala is capable of at any given point in this timeline with what they need.  It's called the \"Future Now\" problem, and it is very real in SSI:  the platform is capable, the potential is there, but what can actually be delivered on the tech as it exists now in Atala...  could be two different things.  The fact that IOG Professional Services is mentoring Profila is a really good sign and the best option for mitigation that is available.", "q1r": 5, "q2": "There are two elements of the auditing characteristics that can stand out on a proposal: one is having a roadmap with clear milestones at regular intervals. That is not the case here, but jut as good can be very clear protocols for how a proposal will approach the auditing process, and that is what the proposer has provided here in great deal.  Not only do they have their github repositories available to view, and significant community contact at townhalls and swarm breakout rooms, but they even have a newsletter available to subscribe to, for those interested in following the project.  That is a first, and something I think is a great idea for large projects like this.  All in all I have no doubts about the auditability of this project.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 14, "ne": 5, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2096, "q0": "Profila is a privacy-oriented marketing platform that enables customers to engage with companies in a way that allows them to control their data. Profila is live, with an excellent use-case and very good development prospects. The team behind it has received funding from as back as Fund 6. \n\nThis project is a follow-up and the team asks for funding to extend the Atala Prism as identity provider to their Atala Prism integration from only for businesses (as is now) to include the users too. I think it is an excellent proposal that can foster adoption of both Atala Prism and Profila and is definitely in line with the challenge. Very good fit! ", "q0r": 5, "q1": "The team behind the proposal is excellent, with a very strong physical presence in Switzerland and has an amazing track record . The collaboration with IOHK is another strong indication of competence and low risks for non delivery of the project. The project would take 6 months to complete, \n\nThe budget is only lightly sketched, so perhaps a better granularity in terms of hours of work necessary would have been very appreciated. The proposal would fund only partially the project, but we are not given an indication of how much exactly, whether it is 20%, 50% or 90%. Again, more details in future iterations would definitely turn this proposal into an excellent one. ", "q1r": 4, "q2": "With more than 5 projects already underway, I have checked their reporting status on all ongoing projects - and they are all in green - which is an excellent indicator that the team truly delivers and communication with the Cardano community is at the core of their activities. \n\nOf course, for this project too we would get public github repositories, weekly / monthly progress reports and frequent Q&A sessions with the wider audience. Excellent prospects in terms of auditability. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5378, "q0": "The team of this proposal is leading the way in many instances to effectively address the main factors of this challenge. They are working with existing projects in the cardano ecosystem to implement the factors laid out in their proposal. They do this with very concise and information, and they took the time to explain things so they can be easily understood.\n   Although cardano is not incorporated into the mobile application at launch, once ADA is implemented into the rewards part of the application it will be very impactful in many different ways to the cardano ecosystem as a whole. The team fully understands the complexities involved and are very clear about their next step. One thing i would like to know is their thought on gaining the trust of their users before the implementation of the blockchain part of their project. its seem to me that some users may feel that they are just handing their data over to another company. I do realize the user can opt out the advertising services all together, but im wondering if their is a risk of loosing user trust unless it is completely disclosed to the user the limits of the app pending the further development", "q0r": 5, "q1": "This project if very large in scope and vision. There is a lot of things relying on some other crypto projects, and some of these other projects are still pretty new themselves. The proposals team acknowledges the fact that they will be leveraging to success of these other projects, notably IOHK in the implementation of Atla Prism into their mobile app Profilia. The fact that this is acknowledged, and give detailed roadmap of the work that will be done with these other projects does give this project great odds of success. This proposal is for completing specific areas of the project as a whole, so success will also rely on future funding rounds, im assuming, to be completed. Given the track record of the teams successful implementation of funded proposals in past funding rounds, I expect them to do things to the best of their ability what is outlined in their proposal. The budget is broken into defined bullet points. Due to the nature of the distribution of the funds, i believe the team is taking this into consideration and underestimating costs in order to not be skipped in a over budget situation  ", "q1r": 4, "q2": "This team has been working in this community and the crypto space for quite some time now. They know what they are doing and how to manage the project through the challenges laid out in the proposal. They lay out in the proposal exactly what part of their project overall the  budget will be used for, and with monthly project milestones being met over a six moth time period. It is made clear their team members roles and the detailed duties of the other projects.", "q2r": 5, "assessor": "z_assessor_1959", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Consent-based data vault (D)app with integrated DID, that record personal data licenses; compensating people for their data & attention", "experience": "Privacy/Tech lawyer + Profila team of (20+) industry experts with marketing & privacy expertise from multinationals. Product bèta-ready, pilot ongoing, first POC of Atala Prism being funded under fund 6."}