{"id": 398478, "author": "elementarysoftware", "title": "Standard SSI templates library", "url": "https://cardano.ideascale.com/a/dtd/398478-48088", "category": 26451, "amount": 21000, "description": "There are no standards for which properties a digital credential must contain. Without standards, verification will be impossible", "funded": 2, "upvotes": 40954824, "downvotes": 11259154, "votes_result": 29695670, "votes_cast": 201, "f6_no_assessments": 5, "f6_rating": 4.8, "videos": [], "media": [], "f6_assessments": [{"id": 646, "q0": "Sometimes the simplest things can have the most impact.  Of all the proposals in this challenge setting, this one has perhaps the most universal impact, as it could conceivably be used by half or more of the other projects.  The goal is straightforward:  build out an extensive, expandable, forkable opensource library of standard SSI, VC and DID credential templates.  Beyond just the ability for an event venue to grab a \"ticket\" template or for a highschool to grab a \"diploma\" template to use in their own SSI schemes, a homeschool curriculum could fork a \"diploma\" template and adapt it to its own particular case, and in the process expand the library for everyone else.  And the scalability doesn't end there:  the repository root could be expanded to include templates for SSI concepts like \"Claims\" (what standard statements can be made about subjects) or \"Presentations\" (what standard selective views might be selected by holders of data credentials).  Libraries of this nature could experience exponential growth and have their own OSS communities dedicated to maintaining them.  But it has to start somewhere.", "q0r": 5, "q1": "The proposer does a good job of delimiting the scope of this library to a readily executable subset of templates, and wisely makes community collaboration an early goal.  The timeline starts with developing protocols for community communication and creation of templates, a \"template of templates\" approach that should pay dividends down the line.  It quickly moves into execution and development of the library, taking into account the need for dedicated communication protocols to manage contributions in an orderly fashion, and that is where most of the time and budget is spent.  Finally, a solid QA and rollout phase is included where the last budget fumes should be enough to push the project over the finish line.  The budget itself is timed to the these phases, but it would be ideal if we could see a bit more granularity from the development budget (how many hours are we talking here and is $15k enough?).  However the percentage of the budget apportioned to each area (development 71%, documentation 19%, communications/nmanagement 10%) all seem very appropriate.  There is very little risk associated with this project.  Worst case scenario there is not a lot of community involvement, and the Library is built out only enough to suit this proposer's associated DID project, but it would still be opensource and still publicly available to be expanded.", "q1r": 5, "q2": "As an opensource project the proposer intends to make the Library available from first notes to final implemenation.  The proposer's intention to work with the community to expand the templates submitted means they will have open, accessible channels of communication for the project.  They also indicate familiarity with the IOG protocols for monthly progress and KPI reporting.  In this case, the KPIs to be reported (commits, community engagement) should be easy enough to track and include in the audits, and the Library itself will be available at all times to include along with a changelog for simple, easy to understand reports.  There is an elegant simplicity to this project, and it is really driven home in the transparency and ease with which it should be able to be audited.  This is a classic Catalyst proposal in line with the best principles of the community.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2, "reply": "Yes, exactly right! You describe this in a very good way and have nailed the concept. I will use your assessment as inspiration for clarifying the content when adressing the community on completion. I have received some negative assessments because the concept I propose has been misunderstood by some CAs. I think with some clarifications from your assessment, these CAs would not have disagreed with my proposal.\nI will need partners for getting this proposal off to a good start. Feel free to connect with me if interested."}, {"id": 142, "q0": "The proposal fits nicely into the challenge description as it asks for projects that will lead to growing SSI adoption, usability and accessibility and governance frameworks. Since the proposed library will be open source, this also promise interoperability benefits for other SSI platforms in the Cardano SSI community.\nThis proposal promises to deliver a common open source library that will enable the Cardano SSI community to share blueprints or templates for credentials. I believe this will be of great help to the community as standardization and reusable blueprints are needed early in the adoption of new technology.", "q0r": 5, "q1": "The referenced resource display relevant skills and experience from development and maintenance of similar solutions.\nThe budget and timeline are outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals. \n\nEven though I have confidence in the success of this proposal, I think the proposal description would benefit from some mention about how to ensure adoption of this library. You mention the risk, but there is no mitigation other than making use of the library in you own tool. I do believe that demo activity will be one mitigation and perhaps some collaboration efforts with other tool creators?", "q1r": 5, "q2": "The proposal provides clear insights into how the progress and success can be audited by the community. Kudos for the plan to host a demo session for Catalyst After town hall and in IOG Discord! Proposal also gives good description why the proposal should be funded and what the benefits are for the ecosystem.\n\nProposal contains clear description of what to expect and also how the community can assess the successful delivery of the proposal.", "q2r": 5, "assessor": "z_assessor_1075", "no_vca": 14, "ne": 4, "ng": 10, "nfo": 0, "vca_o": 1, "reply": "Thank you and yes I agree I could have added more mitigation actions as you say and I think demos and discussions in Catalyst after town hall will be good arenas this. I plan to do this, but see that I could have been more clear.\nI will need partners for getting this proposal off to a good start. Feel free to connect with me if interested."}, {"id": 5381, "q0": "This particular challenge is very specific in what it will require, and this proposal hits on a lot of the main goals. The team consists of pioneers of Atala PRISM, a very valuable recourse that will be used in seeing this challenge inevitably completed. The proposals team has a background in working with security, and articulate their understanding very well on the topic. They explain that without standards for the way secure infrastructure should be implemented, you end up with a huge mess. The proposal is to guarantee these standards are put in place. They do not suggest to build the standards themselves, but understand how a decentralized community works, and have explained the importance of community involvement to lay the framework for what the standards will actually be based upon. This challenge needs what this proposal is willing to solve and i would say its importance is a critical part of the challenge that needs to be complete inevitably. ", "q0r": 5, "q1": "the proposal seems to have a good coherently focused vision, and the information that is given does give a sense of competence in the challenge as a whole. I already mentioned the background of at least one team member being one of the  pioneers of a project that will be one of the main building blocks for implementing the challenge as a whole. This just helps make a stronger case for the feasibility of the proposal, along with a very detailed description of what steps will be involved in implementing the proposal. They did an excellent job in making sure they explained things so that most people, if they read the entire proposal, can get a grasp on the direction the project is going. This is followed up with a very reasonable budget and timeframe that is described in much detail,.", "q1r": 5, "q2": "With the team consisting of veteran community members, they know the importance of this step in the proposal. The proposal outlines some KPI goals that will help with internal progress updates, while also stating they will be turning in progress reports periodically to the catalyst team, and are committed to having the entire library from start to finish available to the community. These are all mentioned by the proposers and leave nothing left to assumption. ", "q2r": 5, "assessor": "z_assessor_1959", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Thank you for your comments and support for the proposal"}, {"id": 9728, "q0": "The proposer looks to create a set of templates that can be used within the SSI ecosystem. No easy to use and well thought of standards have been created in the identity space and the execution of this proposal could help to provide insight in what some suitable standards could be. As the proposer mentions there are many variations and types of credentials. This task is not an easy one as without the use cases of the credentials being explored it will be hard to say beforehand the exact data that will be required in the credentials. The requirements in many instances could evolve and mutate based on the evolution of the identity market and the types of data that are valuable to be used in certain credential types. There is definitely a need for efforts towards standardisation however due to the inherent risks of a large number of approaches emerging making the interconnectivity between multiple applications more expensive and confusing in terms of a technical implementation. It would have been good for the proposer to suggest some of the risks that if they did make good standards that there is a risk that they could not foresee some evolution of the market and as such that standard actually becomes a burden instead of an effective data model for certain credential types. Overall there is value to exploring this work and seeing what standards come out of it - the proposer would definitely benefit from considering how to be more specific on credential areas that are more predictable where possible!", "q0r": 4, "q1": "The proposer breaks down the roadmap into monthly deliveries each with a set of itemised tasks. A simple budget is broken down based upon the areas of work with a total cost provided. The proposer provides their information regarding themselves and a LinkedIn profile to showcase their background. The timeline is reasonable given the work mentioned as they have provided multiple months to interact with people across the ecosystem as well as their creation of the templates. The proposer has a sufficient technical background and a simple and reasonable plan to execute the proposal that has been presented.", "q1r": 4, "q2": "The proposal team provide a set of KPIs that cover tracking the deliverables of the project. As well as the delivery of the templates this is also where being more specific on the credential focus areas would be useful. Metrics based off these focus areas could then be created where the proposer could have looked to onboard a number of projects that require a credential of this type. On it's own the work should still provide inspiration to other creators in the identity space though it would have been useful to be more specific than SSI creators and SSI tools alike.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for your comments and support for the proposal"}, {"id": 10447, "q0": "This proposal creates open source library of tools for identity very effectively addressing the challenge. These tools will be able to help developers and users to verify peoples identities using PRISM based tools. The proposal is well thought out and is very informative. Definitely within the parameters of the challenge.", "q0r": 5, "q1": "The proposer has experience with programing and computers and is also a prism pioneer from the first cohort. This gives the project a distinct advantage and is very likely to succeed in my opinion. The plan, timeline/roadmap is laid out clearly so that it makes sense to the reader. I think the proposer put a lot of thought into this and is very likely to succeed. These are the exact kind of tools needed for the Cardano ecosystem to be able to meet our goals as a community. ", "q1r": 5, "q2": "The proposal can be audited through the stated KPI's and also by measuring community engagement. The platform is pubic and open source and can be independently verified by any interested party. The proposal provides sufficient information to be able to audit the progress of the proposal.", "q2r": 5, "assessor": "z_assessor_916", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for your comments and support for the proposal"}], "solution": "We propose to create a library of standard templates for SSI related objects that can be integrated with and used by SSI platforms and tools", "experience": "Atala PRISM pioneer first cohort, background from defence and maritime technology industry with in-depth knowledge about secure handling of personal information. About 20 years experience as application architect, developer and consultant"}