{"id": 398553, "author": "danbonfil", "title": "DID Community Trust Registry", "url": "https://cardano.ideascale.com/a/dtd/398553-48088", "category": 26451, "amount": 15000, "description": "SSI initiatives can identify the trust triangle but often lack the governance authority or trust registry to complete the trust diamond", "f6_no_assessments": 5, "f6_rating": 3.6666666666666665, "videos": [], "media": [], "f6_assessments": [{"id": 143, "q0": "Challenge description asks for creation of working groups and growing participation on SSI discussions. This proposal is entitled DID Community Trust Registry and sets out to create a site containing some training material and tools for verifying and issuing credentials. In some ways this proposal seems to be inside the challenge, but I am unsure how having this site will complete the trust diamond.", "q0r": 3, "q1": "Budget does not include any easily identifiable items for the training material, only PRISM development and project management costs. Training material typically takes much time to develop, so this give lower confidence in budget. Timeplan contains good amount of time for a project of this size. 8 months for the total span and \"only\" $15000 divided on two resources seems a bit low, or at least is not a 100% workload effort.\nReferenced resources display relevant experience for successfully developing the proposed site.\n\nNeutral rating because of unclear and seemingly too low budget. Would recommend more clarity in budget on how to develop the proposed training material.", "q1r": 3, "q2": "Unfortunately I cannot see any clear link between the problem statement and the proposed solution. Problem statement say that trust registries and governance authorities are missing, which leaves the trust diamond incomplete. The proposal then wants to solve this problem by creating a site for training and sharing of knowledge with some functionality for issuing and verifying credentials. This unfortunately makes little sense to me and I would have liked some more clarity regarding how this site will complete the trust diamond. \n\nWhen seeing the proposal title, I was led into thinking this proposal will deliver a trust registry or perhaps a template for trust registries to use when being set up. From what I understand, this proposal will deliver a playground for playing with SSI functionality and learning about it.\n\nThe proposal states that project progress can be followed in gitbooks and bi-weekly reports. I do however fear it is difficult for the community to assess the success of this proposal as the description lack clarity about what to expect and why we need it.\n\nI would recommend the proposers to work with the clarity of this proposal and resubmit. Focus must be given to define what the problem is, and a logical solution for the problem and a related title. In my head, a logical solution to the stated problem would be to create templates for trust registry governances or template for reusable functionality to be used by trust registries. I unfortunately disagree with the proposed solution.", "q2r": 2, "assessor": "z_assessor_1075", "no_vca": 10, "ne": 4, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 649, "q0": "I really want to love this project.  The idea of a learning space for community members to go and get their hands on a basic DID implemenation to play around with, with the the dual purpose of not only allowing community members to get their hands dirty in the SSI sandbox, but also to teach and clarify the need for the often unacknowledged critical 4th leg of the SSI stool --trust registries-- by allowing the participants to see and experience the limits imposed on the DID by these critical frameworks, makes my day.  It is critically important that adopters of DIDs understand that an onchain hash with a bit of metadata means NOTHING, except that the state of that hash is cryptographically secure.  It is the trust registry and its governing framework which provide the value and content a DID intends to represent with that hash. But the proposal, as it is composed, does not make it clear that what I have described is the exact intent.  And there are a couple of other ways in which this proposal could go, quite reasonably, which I would not be interested in or in voting for.  My downgrade on impact here is purely because this critical clarity is lacking, and the role of trust registries is not well described here, leaving me to doubt that this component is considered as essential to the delivery of this proposal as I would have liked to have seen.", "q0r": 4, "q1": "The team plans on starting with a hosted console which can perform the basic Issuer->Holder->Verifier roles.  Presumably, in collaboration with RootsID, they will have a simple, console based wallet-to-wallet interface.  Basically a little DID testnet with, hopefully, a no-code UI, and the potential for users to learn to create validity and use for DIDs they issue.  They don't include a lot of details here.  But the concern is that the timeline includes no reference to building out the trust registry specifically, or specific educational content for the trust registry, or any place where the trust registry is introduced as a topic of consideration to those building in the sandbox.  Additionally, there is no budget set aside for this kind of education or documentation, nor for any templates or the introduction of any resources for trust registry adoption.  If the intent of this proposal is NOT to have anything to do with trust registries, than all of this, of course, looks a lot different.  But if this isn't about trust registries, what is it about?  If you want to practice with DIDs you can go to DIF, Hyperledger or Sovrin and play around and learn in their sandboxes.  If the proposer is serious about trust registries (and I believe they, and all of us, should be), then a robust description of how they intend to teach with this tool is critical.  There are so many ways that could work, from video tutorials to hands-on templates that can be customized to show different ways trust accrues or is lost.  But I really needed to see something more here to think they will do this.", "q1r": 3, "q2": "As an opensource project, the console development is valuable in its own right, and including the basic teaching protocols they intend to use in that opensource bucket would be a great move.  They also intend to do bi-weekly reports on the development and rollout of the console, plus they have some marketing in their timeline and budget, so that will need to have some metrics reported as well.  The github repos will be the key to keeping up with the progress, and presumably there will be at least a beta release, which means they can include some use metrics as those start to come in.  The ultimate delivery of the \"DID MakerSpace\" is certainly within the scope and parameters set by this proposal, my only concern is what the trust registry component looks like at that final state, if it is there at all.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 6, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1507, "q0": "This proposal seeks to create an informal space to increase awareness of Self-Sovereign Identity and Decentralized identifiers. From personal experience it is an area that is not so much talked about compared to many other subjects within the Cardano / Catalyst community. In other words, the proposal is impactful since it strives to solve this problem. Furthermore, the proposal does the Community Advisors job for free and identifies all the aspects in the proposal that aligns with the  Self-Sovereign Identity challenge. To summarize, the proposal aligns well and have identified a knowledge gap in the community that is necessary to address. Score given in terms of impact: 5 stars.", "q0r": 5, "q1": "A simple plan has been presented in the proposal, given the scope and complexity of the project, it is deemed sufficient and enough. The budget is split up into 6 relevant posts and from an outsiders point of view, the requested funding seems in line and reasonable for each post. The proposer claims to have great academic experience and the relevant toolbox to go through with their idea if the proposal were to be funded. I have attempted to further verify their claims of experience but have not succeeded to do so, their handle @danbonfil brings up  a private Instagram page. I might have missed something but a suggestion could be to include more direct evidence in the proposal in order to raise its credibility. This is not a big problem given the scope and complexity of the proposal and the resulting score will be 5 stars in terms of feasibility. ", "q1r": 5, "q2": "The progress of the project can be audited through bi-weekly reports and the final project (to my understanding) will be made available via Gitbooks upon completion. This allows the community to try out the implementation and audit the proposal throughout its development. One thing that is lacking is clear KPI's and some goals attached to them. It would be favorable for the proposal if this was stated more clearly, but the overall auditability of the proposal is good. Score: 4 stars.", "q2r": 4, "assessor": "z_assessor_139", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6077, "q0": "Well , i am all up for any cardano project that focuses on local community training and engagement because that is one of the fastest way to increase the Utility of cardano and also achieve this challenge objectives.The impact of this proposal cannot be overstated and i am giving 5 stars.I will  also raise something that was not discussed in the impact section which is the first location this \"Informal space\" will first be started and also will it only be in English? will it cover Native tongues? What are the intended partnerships with the local government in the pilot location?(These are all relating to the materials of the Informal hub)", "q0r": 5, "q1": "The feasibility section of this proposal was concise clear and still provided all the necessary requirements  like a clear plan with timelines, a detailed cost breakdown and the list of the proposal team with links to the profiles (actually links to their proposals was provided which leads to their profile.).\nI will be giving 5 star as the team have demonstrated capability with verifiable link that they can execute the proposal to success.", "q1r": 5, "q2": "There is not much to say here as the team clearly stated their KPI which can be followed through gitbooks and the project website.All the required detailed for this proposal to be audited was provided and i will be giving 5 star according to the CA assessment guidelines. I am giving 5 star and i wish the team good luck.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 6885, "q0": "This proposal clearly relates to SSI, but the details are not clear. The proposal says that it is solving confusion about trust registries and governance authorities, but then it suggests that it will start by creating a console for issuing and verifying VCs. These task are at the core of what Atala PRISM does, so it appears what is being proposed is adding a \"low code\" layer to Atala PRISM. But this is separate from the idea of a trust registry or governance authority, which are outside the scope of what Atala PRISM does now. The proposal needs additional clarity on these issues, and therefor I neither agree or disagree that it effectively addresses the challenge. I would suggest that the proposers provide further detail in a future proposal.\n\nI am qualified to assess this proposal due to 20+ years involvement with authentication applications, and as a funded Catalyst proposer (F6 and F7) on authentication-related applications.", "q0r": 3, "q1": "The plan proposed does not have enough detail to understand what the proposal would involve. This relates to the issues mentioned under Impact about the lack of clarity on what the proposal intends to deliver.\n\nAlthough there is more detail on the budget, it somewhat adds to the confusion about what would be build here. For example, why are there separate developers for issuer and verifier pilot projects -- what are these pilots?\n\nRegarding the team, the proposer provides information on two collaborations, but does not seem to provide any information on his own qualifications.\n\nFor these reasons, based on the plan and experience presented, I disagree that it appears highly likely that the proposal will be implemented successfully.", "q1r": 2, "q2": "The proposer agrees to make the results of the proposal public, but there are no specific metrics on functions that will be delivered. Combined with the uncertainty about the solution being proposed (see Impact and Feasibility responses), this will make it hard to measure success. Therefore, I disagree that sufficient information is provided to audit the proposal's progress.", "q2r": 2, "assessor": "z_assessor_495", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Generate an initially \"informal\" space for increasing awareness of SSI/DID technologies through didactical and applied sharing of knowledge", "experience": "@danbonfil: Msc Economics focused on Quantitative Finance, Incentives and Blockchain\nPhD in Management: Institutions, Government and Policy\n\n@andreassosilo: Cardano Ambassador, Atala PRISM Pioneer, Software Developer"}