{"id": 398633, "author": "fluxcap", "title": "Immigration Documents On Chain", "url": "https://cardano.ideascale.com/a/dtd/398633-48088", "category": 26451, "amount": 1800, "description": "Immigration documents at U.S. colleges and around the world are paper based creating issues paper based solutions have.", "f6_no_assessments": 4, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"id": 651, "q0": "This is a research project that wants to look into an SSI solution for universities around the globe to be able to have a way to manage a students immigration documentation (which is typically a messy paper trail).  Besides making the paperwork hassle better, the research is also looking for ways to clean up the documentation when the student no longer requires the university to have it (the critical \"revoke\" command that is a hallmark of true SSI...the freedom to opt out).  It appears to me less about whether the tech is possible (its sounds to me like the proposer has an idea about how to go about this), but rather, digging deep into the privacy and regulatory compliance issues around SSI in this space, which is a minefield deserving of a critical look before rushing into anything.  I believe these are solvable issues, in fact, I think SSI is the ONLY way to solve them, so I expect that this project will discover the answers they are looking for, which means that going forward the basic opensource MVP package for such a protocol will be available for any university or school to handle immigration documentation.  And when you are talking PRISM you are reminded how important developing world education credentials are.  Chances are, a lot of those students are going to have SSI that needs a compatible \"socket\" around the globe at universities where they wish to continue their education.  This has the potential to be critical opensource infrastructure.", "q0r": 5, "q1": "The proposer seems ideally suited to the task at hand, to the point that it seems he has already done much of the leg work required.  The budget is a modest ask, about the equivalent of asking someone to take a week or two off work to pull together some collaborators to consolidate a bunch of information.  I do believe there is real work to be done around the governance protocols for the MVP that he seeks to design, in order for it to be able to run alongside the existing FERPA regulation in that space, so dedicated time for hashing it out is desirable.  The proposer has both the technical IT background to understand the stack underying whatever protocol gets designed, but also, and more importantly, he has an insider's view of the nuts and bolts of both the student and university side of things.  It seems an ideal combination to see this through.  Additionally he has already identified what sources to approach to figure out the missing links in the psooible roadmap for a solution, including, critically, Jim StClair from the LinuxFoundation working group that addresses HIPAA compliance issues for software and ID solutions.  It would not surprise me if a side-effect of this research is the establishment of a FERPA working group in entities like the LF, or with ToIP, DIF and others.  If there is any risk to a research project of this nature, as a first step in an actual working model, it is that you need to capture more than a static state for the regulatory compliance.  In other words, compliance is a moving target and an MVP roadmap could quickly become outdated.  This is where I think the proposer's IT background helps the most.  Opensourcing the information in Github is the first step to allowing this information to evolve, but having it drawn up in a flexible way that can absorb the future changes and implementation is the second step, and that is what IT infrastructure is all about.", "q1r": 5, "q2": "The only issue here is that it may be hard to effectively communicate to the community progress on the work until it is complete.  Some milestones that deserve reporting are:  delivery of a Github repo framework for the MVP (which may allow for incremental progress to be tracked as elements of the MVP are realized), scheduling and completing important collaborative meetings, perhaps with documentation, and of course, delivery of the final MVP, which could be delivered as a few separate items, such as a roadmap, completed repo, overview documentation, etc.  All in all, this budget shouldn't require more than 2 or 3 progress reports (and frankly, it should probably just be the initial proof of life funding and then the finalization report, IMO), so it seems eminently doable.", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 13, "ne": 6, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4145, "q0": "The description of the problem posed by the project still confuses me because the project doesn't explain what the problems paper-based solutions have. Also, it seems that this is only phase one of the project and there will be more to follow. I hope that in the next fundraising the project will explain more carefully about their problem.", "q0r": 3, "q1": "The experience of the founder of the project is very rich. I believe that with these experiences, the project will be implemented effectively. However, in order to measure success, the project needs to provide a concrete plan with a clear roadmap that is established on a weekly or monthly basis. Thereby, it is possible to track the progress of the project through the timelines set by the project.", "q1r": 3, "q2": "The description of how the project measures project progress is too limited. I suggest that in addition to tracking the project progress through the timelines established in the plan, the project can create checklists of work items and make this checklist available to the project team. project to track progress. In addition, a detailed report on expenditures and updated balances in the use of raised funds should also be made public. In addition, the project could further describe how they measure progress on Github, possibly by the number of reach and interactions for assignments on Github.", "q2r": 3, "assessor": "z_assessor_1710", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6281, "q0": "The proposal addresses the challenge and can bring relevant innovation to the immigration system. However, it's hard to tell yet if it will be scaffolded into a concrete product, as the proposal is based on a preliminary study. ", "q0r": 3, "q1": "The proposal has some potential, still need to be fully discovered. In any cases, for what is being asked, proposers have given evidence of the technical capacity to conduct this phase. Budget is small but has coherence. ", "q1r": 4, "q2": "There's little information about a roadmap and the deliverables are not very much concrete - and this has to do partially with the nature of the proposal, a more exploratory one to be then developed further. Still, even being exploratory, more indicators could have been presented. Either the ones that are subjective, qualitative, or not.\n\nThe solution in this current proposal is limited by the fact that it comprises a study that is still on the very embryonic phase. Not that the study doesn't deserve the investment, but the proposal would be much stronger and proposers could request a bigger budget if it gets more mature first.", "q2r": 3, "assessor": "z_assessor_386", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 6886, "q0": "This is a very good use of SSI and fits squarely within the challenge. Documents for immigration purposes needed to be authenticated, and shared individually or together, which SSI can effectively enable.\n\nI am qualified to give this assessment as a funded Catalyst proposer (F6 and F7) on authentication projects, and a lawyer who has sometimes handled immigration matters.", "q0r": 5, "q1": "The approach of an initial small project ($1800) to investigate the best way to move forward the broader project is very sensible.  I have no doubt that this proposer can successfully implement the project by developing a sensible proposal for the broader project.\n\nThe initial indicative approach of using blockchain plus IPFS is a good one for this type of solution. I encounter many proposals that suggest putting data on chain when this in unnecessary or inappropriate. The proposer's understanding that IPFS is a better location for the documents themselves (including so they can later be deleted) shows that he has already thought carefully about this.", "q1r": 5, "q2": "The main measure of success of this project will be delivery of the proposed design for the broader solution. The proposer plans to share these publicly, which would allow auditing of the project. ", "q2r": 5, "assessor": "z_assessor_495", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "Immigration documents, and their data, are placed on chain, confirmed, and eventually deleting leaving only credentials behind.", "experience": "I started IT development and support in early 1990, eventually moved to media production, and in 2015: back to IT in International Education. I supervise immigration compliance at the Univ. of Arkansas, and have been studying blockchain dev for a few years. CTO of a few companies"}