{"id": 398763, "author": "rodolfo.miranda", "title": "DIDComm v2 Mediator", "url": "https://cardano.ideascale.com/a/dtd/398763-48088", "category": 26451, "amount": 20425, "description": "Mobile identity wallets require a Mediator to communicate with other wallets and agents, but no Mediators are available based on DIDComm v2.", "f6_no_assessments": 3, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"id": 653, "q0": "If you don't know what DIDComm is, and why we need this mediator, let me sum up:  DIDComm is the protocol that allows us to use the blockchain security of individual DIDs to allow true, encrypted peer-to-peer messaging that can use any protocol for transport.  That means secure messaging on HTTP, BlueTooth, SMTP, raw sockets, you name it.  This is usually envisioned with mobile devices as the nodes, and if implemented, would allow an identity wallet on that device to communicate seamlessly and securely with another wallet on another device.  Where the mediator comes in is that we require a routing protocol for when the mobile peers aren't directly connected.  Like all things SSI, you can dig much deeper into this topic with DYOR:  https://identity.foundation/didcomm-messaging/spec/#routing .  This proposal team is working on all aspects of a community wallet, and the addition of DIDComm can truly make this a robust solution.  RootsWallet is starting to look like a Cardano flagship product.", "q0r": 5, "q1": "In the SSI space it is learning and iterating that qualifies the teams working on solutions, and this team exemplifies these qualities.  They have been reaching deep into the SSI space via the working groups around DIF, Hyperledger, ToIP and others and returning with specific projects and products that they have been testing and developing to meet the Cardano community's needs.  The Git for the overall RootsID project is becoming truly robust, a dense and crunchy set of repos, and even the \"pre-repo\" for the DIDComm shows clear direction and purpose.  The issue with any work in SSI is the complexity, of finding beginnings and ends to things that are constantly iterating and changing.  But a project, at some point needs to move from that complex, \"anything could happen\" state to one where things might be complicated, but everything is a set of solvable problems that just need to have time and work applied.  Many aspects of RootID are getting to that complicated but no longer complex state.  The Github for this mediator is still in the \"complex\" state, but it lays out a map that shows where they need to be searching, which should yield a list of simple actionable tasks (simple tasks, but because there will be MANY of them, complicated).", "q1r": 5, "q2": "The mediator roadmap is gaining clarity in their repo (see Process Flow in their DIDcomm repo), and it lays out several deliverables that they have listed an approach to over the course of 3 months:  the scope and architecture work is critical, but the yield will be the documentation in the repo.  Beyond that they have the code for the mediator and then the testing results and retrospective for that.  Among the deliverables is a working cloud-based mediator, but as well the whole thing is opensource, so anyone who wanted to could host the mediator to bare-metal and get the decentralization quality up (worth noting that the security of the DIDs is already technically decentralized, but getting the transport and routing protocols spread around will be critical for resilient uptake down the line).  There should be no problem tracking this project due to its open source nature, and the reporting process has plenty of natural beats for the auditing.  If there is any issue here it will be the pain in the butt they will have reporting all these integrated projects as individual reports across multiple proposals.  My advice is to pull someone from the community (plenty of people are already tracking everything they do) to do all the audit reports so the team is free to get after the project.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 14, "ne": 10, "ng": 4, "nfo": 0, "vca_o": 2}, {"id": 5602, "q0": "Very useful and necessary proposal for the Atala PRISM ecosystem. It is a necessary bridge to the other existing SSI systems. The successful implementation will not only benefit the Cardano community by allowing them to leverage offerings outside of Atala PRISM's SSI solution, but will also allow external solutions to gain access to the Cardano ecosystem.", "q0r": 5, "q1": "The proposing team has a detailed plan and a very good idea of the tasks that need to be done. Based on the experience gained, it can be assumed that the project will be successful.", "q1r": 5, "q2": "The project team is very open and transparent about their other suggestions and the time given to the proposers. The result is an open source project and accordingly very doable.", "q2r": 5, "assessor": "z_assessor_2024", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 6887, "q0": "DIDComm is a really cool application of SSI! Much of the insecurity on the Internet is due to the fact that endpoints are not associated with any kind of identity. Mobile networks solve this problem to some extent with SIM cards, and operating systems increasingly support device identifiers, but we need a robust solution for web3 and DIDComm is a good one. Providing open source software to enable DIDComm v2 (specifically the mediator proposed here) clearly fits the challenge brief of advancing SSI.\n\nI am qualified to give this assessment by having been involved with Internet authentication technologies for 20+ years and being a funded Catalyst proposer (F6 and F7) for solutions related to identity and authentication.", "q0r": 5, "q1": "This team are active participants in the Catalyst identity ecosystem and are developing a strong track record of delivering open source software for it, including as part of the RootsWallet project.\n\nThey present a clear plan and a realistic budget.\n\nI am confident that this proposal will be implemented successfully.", "q1r": 5, "q2": "This is a software development project with clear deliverables. The process described is sufficient to monitor and audit those deliverables.", "q2r": 5, "assessor": "z_assessor_495", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}], "solution": "We plan to develop an Open Source Mediator agent based on latest standardized protocols and host a cloud instance for anyone to use for free", "experience": "The team is fully engaged on Self-Sovereign Identity projects in the Cardano community with several projects already funded and delivered on F6 and F7.\nRodolfo Miranda: https://www.linkedin.com/in/rodolfomirandaEsteban García: https://www.linkedin.com/in/esteban-garcia-cr"}