{"id": 399791, "author": "iandebeer", "title": "Bridge Atala and Sovrin -Indy/Aries", "url": "https://cardano.ideascale.com/a/dtd/399791-48088", "category": 26451, "amount": 150000, "description": "Cardano Atala is not interoperable with the Sovrin Network", "f6_no_assessments": 4, "f6_rating": 2.25, "videos": [], "media": [], "f6_assessments": [{"id": 678, "q0": "The idea started off great, but then it sort of got off the tracks before wandering off into the weeds.  I think it might still be out there.  First, I see that they are looking at interoperability between Atala and Sovrin.  Yes, please!  Then I see a budget of $150,000...uh, what? (I am convinced this was a typo.  It had to be.)  To my knowledge you just need to create some drivers for did:prism to work with the hyperledger resolver (which the proposer seems to be familiar with), and now a Sovrin ID is welcome in Atala and vice versa, interoperability.  Maybe there is more to it?  There certainly is.  The suggestion continues on to what looks like a complete SSI platform buildout, holder wallets, verifier nodes, Issuers (presumably with governance), which is all cool but I'm not seeing the Sovrin interoperability at this point.  No worries, it will become clear in the timeline and budget...  *looks around*  *looks under desk, behind curtains* ...alrighty then.  So what I would have liked to have seen from the rest of the proposal was a little more clarification about what was being built out here, especially the interoperability part, as well as making sure that the different sections are consistent.", "q0r": 2, "q1": "Besides lacking clarity about what is being rolled out here, the timeline and budget do little to add confidence.  In particular the extremely high budget ask of 40% of the total challenge funds, and the misalignment with the rest of the proposal.  The 10 weeks of development hardly seems reasonable for that budget: it implies an hourly rate somewhere between $300 and $400.  Additionally the budget breakdown (at a much more reasonable hourly rate of $170...still a little high) only adds up to about $7k...a far cry from the total ask.  It would be good to see a better breakdown of the tech stack being implemented here, with an actionable list of tasks on a timeline, as well as a detailed budget breakdown that accounted for all project costs within reason.  For the Sovrin interoperability, in particular, it would be good to know just what each implementation provided to that interoperability, so that impact (and thus success) could be correctly assigned to the project.", "q1r": 2, "q2": "Bonus points for being opensource, which means that tracking the repos will be no problem.  There was one metric of success included that might be a way to suss out the proposer's intent here:  \"Atala PRISM is compliant with the Sovrin Network Standards\"...if the intention is to build a Sovrin standards clone on Atala, then some of this makes a little more sense, and is a little easier to assess.  I probably wouldn't agree with the idea, but I don't need to agree to give an idea a fair shake, I just need to understand.  As all of the standards are opensource, I don't see the need to repeat them (especially given that Atala will be its own standards for a reason), but I do see the value in interoperability, which I would count as the greatest measure of success a project like this should shoot for, and which would be directly in keeping with the challenge setting.", "q2r": 2, "assessor": "z_assessor_1193", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5640, "q0": "The challenge brief includes the phrase \"This challenge is looking for projects that help position Cardano as one of the leaders in the SSI space.\" and this proposed bridge to Sovrin Network would add functionality, interoperability, and likely new users to Cardano. However, the proposal does not indicate how this will bring more users to Cardano and Atala Prism. The problem statement and solution are clear, and interoperability between the two networks would be a valuable endeavour. This proposal however leaves out some critical information that would help voters assess the impact of this proposal. It is not clear what reach or userbase would be brought in by the proposing team, and who would be the likely users of this bridge if it was built. ", "q0r": 4, "q1": "The proposer has experience with Sovrin Network, and is likely capable of delivering on this proposal. However, there is no information to suggest that the proposer or proposing team has a deep understanding of the Atala Prism architecture, and have the technical skills to implement this. The proposal acknowledges this risk with the following quote: \"We are specialist in developing SSI implementation on Sovrin, while we are new to Cardano.\" The budge is a significant amount at $150,000 while there is no detailed breakdown for how this money will be used, or how this estimate was created. It would improve this proposal to include specific milestones, quantifiable KPI's and a more detailed timeline for development. Additionally the budget is not clear as the proposal asks for $150,000 however in the budget section the proposer writes \"Please provide a detailed budget breakdown.\nWe shall require 3 dedicated developers for 14 weeks = $170\" and it's not clear if this is an hourly wage, or a typo of $170,000. If this is 170 thousand, why does the proposal have a budget requested of 150 thousand. ", "q1r": 3, "q2": "Because this is an open source project on Github, I have given 3 stars, however it would be good to see more detailed reporting to the community and more information about how we can audit this project. I believe this is an important and valuable project, but this proposal is lacking some important details around the technical feasibility, the use of the budget and timeline, and how the community can track the progress and audited the success (or failure) of this proposal. ", "q2r": 3, "assessor": "z_assessor_215", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6893, "q0": "Integration between Atala PRISM and Sovrin is a worthy goal that fits this challenge. However, this proposal is very short on details of what will be built, and admittedly reflects a limited understanding of Atala PRISM, so I disagree that it *effectively* addresses the challenge.\n\nFor example, what type of integration is being proposed? The summary solution refers to \"a translation layer between Cardano and HL Indy by retaining wallet storage on Atala while integrating with the Sovrin standard\". Which blockchain will be used for the storage? There is no wallet standard in Atala PRISM, so does this mean a way to store Sovrin credentials on the Cardano blockchain using Atala PRISM? Does it also include storing Atala PRISM credentials on the Sovrin blockchain?\n\nGiven the large amount of funding requested ($150K), significantly greater detail is required before this proposal is funded. I would encourage the proposer to develop a more detailed proposal and re-submit it.\n\nI am qualified to give this review as someone who has been involved with authentication applications for 20+ years as an advisor, and as a funded Catalyst proposer (F6 and F7) for Atala PRISM applications.", "q0r": 2, "q1": "Although the proposer has relevant experience with Sovrin (and Hyperledger Indy and Aries), there is very little detail of how this proposal will be implemented.\n\nThe project plan is extremely summary. The budget specifies 3 developers for 14 weeks (which seems an unduly optimistic timeline for someone who does not yet understand Atala PRISM), and mentions an amount of $170 without explaining how this connects to the requested funding of $150K. It is not explained how the developers to do this work would be recruited.\n\nAccordingly, I disagree (and almost strongly disagree) that it is likely based upon the plan presented that this proposal will be implemented successfully.", "q1r": 2, "q2": "The only KPIs indicated are \"Github visibility, Sovrin\". Perhaps more important, as summarized under Impact, this proposal does not provide sufficient detail regarding what will be built. So there is no plan to audit. This is particularly problematic given the high budget that is requested. Accordingly, I strongly disagree that the information provided gives a sufficient basis to audit the proposal.", "q2r": 1, "assessor": "z_assessor_495", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9151, "q0": "From the impact information, the proposal is trying to address and utilise the Hyperledger foundation libraries (Based on Python, .NET, GO, Ruby, JavaScript) that Sovrin Network is currently using. Currently, developers are working on DID and SSI applications or wallets on Hyperledger foundation and Sovrin Network would redirect the focus into Atala Prism or Cardano blockchain for storage.\n\nMy findings: Sovrin Network is based on Hyperledger foundation, and Atala Prism is based on the Cardano ecosystem. Sovrin Network is a public blockchain with a fee of around $5000 per annual. (https://sovrin.org/mainnet-endorser-did-application-form/) for Endorser DID and users for free. \n\nExtract from the proposal “Pluggable wallet storage for Holder, Verifier, and Issuer agent integration are created by developing an SSI agency that bridges Atala PRISM.”. I believe the proposal should highlight at least one impact on the Holder, Verifier and Issuer of the current Sovrin Network in the first phases of your pilot program were not mentioned anywhere in feasibility or audibility stages. \nIt's a proposal being implemented, and I believe the impact on Cardano Atala PRISM would be enormous,\nFor that, I rate 4 out of 5 for the impact of this proposal.\n", "q0r": 4, "q1": "Here is the extracted information from the entire proposal feasibility.\n\nPlease provide a detailed plan and timeline for delivering the solution.\n“Understanding Atala Prism: 2 weeks\nImplementing the DID controller and Wallet edge agent for an Atala wallet: 8 weeks\nTesting: 4 weeks”\n\nPlease provide a detailed budget breakdown. \n“We shall require 3 dedicated developers for 14 weeks = $170”\n\nAssuming you may have quite an expertise in coding based on the formation of h Hyperledger Library packages has the coding knowledge. And taking two weeks in understanding the Atala prism can be varied. With the $150,000 requested proposal and require a detailed plan and timeline to deliver the solution and the detailed budget breakdown, suggestions need to improve both feasibility and audibility. Here’s the link where it may help you start again if you ever need it.\nhttps://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true\n", "q1r": 1, "q2": "Similar to feasibility, the proposal only provided two lines for the audibility for $150,000 request proposal, which would be very difficult for whoever involved with the project, starting with the challenge team, communities, as well as CA who assess this proposal, would be extremely hard to rate more than a neutral rate which is 3. Again, I enclose the proposal guide here if you ever need to update or improve your and the proposal for your audibility.\nhttps://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true\n", "q2r": 1, "assessor": "z_assessor_726", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Build a translation layer between Cardano and HL Indy by retaining wallet storage on Atala while integrating with the Sovrin standard", "experience": "We have been working on the Hyperledger Foundation SSI initiative for 2 years and have successfully implemented an SSI agency on top of the Sovrin Network. We have built a custom storage layer for SSI wallets using IPFS and smart contracts using Hyperledger Fabric and DAML."}