{"id": 399788, "author": "chaux", "title": "Green Yoma - SSI SDG Marketplace", "url": "https://cardano.ideascale.com/a/dtd/399788-48088", "category": 26451, "amount": 110000, "description": "To measure, verify and incentivise SDG impact claims, we require scalable credential issuance and smart contract capabilities.", "f6_no_assessments": 6, "f6_rating": 4.388888888888888, "videos": [], "media": [], "f6_assessments": [{"q0": "Yoma has a fast growing, SSI rooted, high impact ecosystem that would be a perfect candidate for Atala integration.  They aim to have 3million users by the end of the year (they are 10% of the way there, with good growth trajectory) and those users need even more functionality.  We are talking native token support, digital and physical marketplaces, smart contract support, DeFi/RealFi, (they didn't mention cNFT support, but there are clear use cases here)... they are well aware of and have their eye on a role for their platform in Ethiopia, working with the Ministry of Education.  Cardano and Yoma could be an explosive combo.  And under the hood this project has got the right principles in place: totally opensource, built on the SSI foundation of HyperledgerINDY (Linux Foundation), and committed to the future of Africa, both the youth and, through the tokenomics they wish to implement, sustainable development goals.  This is a great looking project.", "q0r": 5, "q1": "The team they have assembled here is...impressive.  They have full stack developers, and a full stack of PHDs, and more than that they have the hyper-successful Yoma project behind them.  The goal to integrate did:prism is relatively humble in light of this, and they are taking advantage of the opportunity to integrate to wider Cardano as well, with smart contract adoption to roll out a token scheme aimed at incentivizing their youth marketplace to get involved in entrepreneurial activity (specifically designed for SDG, it sounds like).  The budget covers really only three things, so it is hard to parse it too deeply for alignment with the goals.  The item that seems the clearest is a Yoma light wallet client integrated to their platform at $25k so in comparison the token rollout ($30k) and the PRISM integration ($55K) seem all right...though I would still like to see more details of how that breaks down, especially the Atala integration.  Because they are already running an identity solution with INDY, I would like to know what protocols, such as DIDcomm, that they already have in place, and what Exchanges and  Channel supports they will need to build for their architecture to absorb did:prism.  There are several other projects in this Catalyst round that are also making the same tools, so that part is most interesting to me.", "q1r": 4, "q2": "As always, opensource code makes me very confident in the ability of the community to audit a project in real time.  They have listed issues and commits, as well as a workspace that can be tracked.  They have also indicated weekly meetings to capture the state of the project which should fill up the progress reports nicely.  The listed KPIs, basically milestones from the project, don't begin to cover the possible metrics they could measure at finalization.  Their PRISM and cardano light wallet instances have a chance to be huge, and of course, tx through their ecosystem would be a nice capture as well.  They will also have robust reporting capacity for the token issuance.  If I have a concern, it is that the token issuance is sort of running along behind this project trying to catch up, but the budget and team indicate that they have this covered.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 15, "ne": 6, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "Yoma is an ecosystem that connects youth with employers, NGOs and authorities via an online platform by  providing youth with opportunities for social & environmental engagement, skills acquisition and employment. For 2022 they plan to reach 3 million young people, to be present across 3 continents and to match individuals with 500k job opportunities. These are figures taken from their website and difficult to verify independently, but if true, they position Yoma as an excellent long term partner for Cardano. \n\nThis proposal asks for funding in order for Yoma to connect their Sovereign Identity systems (SSI), called Hyperledger Aries and Indy SSI, with the Cardano SSI, Atala Prism. In terms of numbers, impact and future scalability, this partnership could act as a great catalyst for both ecosystems and I think the Cardano community would miss a great opportunity by not supporting this project, since it connects in an excellent fashion with the challenge. ", "q0r": 5, "q1": "The team. Yoma’s founding members are impactful players worldwide, with UNICEF being the highest visible one. In 2021 they have reached more than 1.5 million youth and onboarded 250k more. However there is no word of Yoma’s internal competence with the solution development. Do they have it in-house or will it be outsourced? If outsourced, what kind of due diligence process is in place to make sure that things are done right? There are questions that don’t seem to have been addressed throughout the proposal \n\nThe plan. The project should take six months to be delivered, and rough milestones would follow this logic: (1) enabling Yoma users to created prism identifiers to interact with Cardano, (2) light wallet integration into Yoma platform, (3) enable Yoma to issue / revoke credentials, (4) Yoma universal token testing (developed in partnership with IOHK) and (5) rollout / integration of additional projects. Again, a point of caution is whether Yoma has already on-boarded IOHK for developing the token together, or is something to be done after receiving funding. If the latter case is true (not clear right now), are there any plan Bs in place in case IOHK cannot / will not assist? \n\nThe budget. 50% of the budget would go towards developing the integration tool between the two systems. 25% would go towards a light wallet integration with Yoma platform(s), and 25% would go towards developing and testing the Yoma universal token. A rather major blunder of the proposal is that budget granularity is very poor, and a project of this size + the partners behind Yoma would definitely require a better level of detail for the money spent. \n\nTechnical side. Integrating the two systems together is definitely complex at least due to the different protocols, standards and maturity of each project. The flip side being that Yoma has an active platform and can bring real life experience into the future development of Atala Prism, especially in terms of governance, usability of low-tech SSI solutions and trust registries.\n\nI indulgently offer 5 stars in the hope that UNICEF's name behind Yoma will lead to an excellent governance of the project. ", "q1r": 5, "q2": "The proposers promise to track the progress of the project by setting sub-targets for each milestone and tracking GitHub commits. There will also be daily and weekly meetings to help define project objectives and report back on progress. It would have been an excellent addition if the proposers would have appointed a figure to act as a point of contact between Yoma and the Cardano community and why not to promise regular updates through the popular communication channels. But I am sure that this suggestion can be taken into consideration if the project gets funded. \n\nOn a final note, I have reviewed many proposals in this funding round, and this project truly stands out amongst the top 1% of them. Do not miss the chance to vote for it!", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This is a well written proposal that directly addresses the challenge question: \"How can we take the next step to support the principles of self-sovereign identity\" and also as this would create a high quality product and valuable integration with hyperledger, it also addresses the challenge question; What would success look like? \"Receiving high quality projects; growing participation on SSI discussions; partnering with ecosystem, governance and working groups\" This particular proposal is a perfect fit for this challenge. \"Currently, yoma is being incubated by RLabs in South Africa and is expected to expand globally as a separate non-profit entity in 2022. By the end of 2022, yoma aims to reach 3 million young people and have evidence for improving youth’s relational wellbeing.\" This quote from the proposal shows that Yoma is focused on the same target market as Cardano, and will be bringing onboard potentially millions of African youth, creating digital ID's and wallets on the Cardano blockchain. \nThe vision of Yoma as stated on their website is:\"Engage, learn and earn while achieving impact\" and this vision seems to be well aligned with that of Cardano. This would be a valuable partnership between Yoma and the Cardano community, Cardano foundation, and IOG. ", "q0r": 5, "q1": "The team has provided a detailed 6 month plan, with a milestones and a budget breakdown for each goal. \nThe proposal includes the team members, and their linkedin profiles that show the teams extensive credentials and background. For example, the bio of Johannes Wedenig includes: \"Exploring how to scale digitally enabled and data driven models for identifying and nurturing untapped African Youth talent and link them with industries. \" as well as experience working \"in collaboration with the Botnar Foundation and UNICEF develop during a two year design phase a new instrument to support digital youth led innovation in Africa\" The have acknowledged the risk/challenge of their lack of knowledge of cardano smart contracts, but plan to mitigate that by \"Close interaction with the Atala Prism team and Partner with IOHK to co-design and develop the Yoma Universal Token requirements and implementation for testing\" \nAssuming they will be working with the expertise and backing of IOHK and the Atala Prism team, there is no better team in the world to successfully implement this plan. ", "q1r": 5, "q2": "The proposal has a clear roadmap with key milestones and timeline. They proposal includes the following auditing information:\n\nProgress will be measured by setting sub-targets for each milestone and tracking associated GitHub commits.\nWeekly/Daily meetings are held to define sprint objectives and report back on progress.\n\nWhat does success for this project look like?\nSuccessful implementation of did: prism into Yoma SSI stack\nBatch issuance/revocation of credentials through Prism\nDeployment of the token through Cardano smart contracts\nYoma Universal Token tested with Youth through project interactions\nBy including these specific and measurable milestones and building an open source project on github, it will be easy for the Cardano community to audit the progress of this development and clearly assess weather it has achieved the stated goals or not. ", "q2r": 5, "assessor": "z_assessor_215", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Yoma is a very well-regarded player in SSI, particularly in Africa but also more broadly. Providing technology to link Yoma to the Cardano ecosystem is very exciting and very effectively addresses the challenge.\n\nI am qualified to give this assessment as an active participant in the Cardano authentication ecosystem, including as a funded Catalyst proposer (F6 and F7) on authentication solutions and an Atala Prism Pioneer.", "q0r": 5, "q1": "Yoma has a strong existing team who clearly seem to have the capability to deliver this project. However, the plan presented is very high-level and general for a proposal seeking $110K of funding. Therefore, I agree but do not strongly agree that the plan presented is sufficient to conclude that it is highly likely that the proposal will be implemented successfully.", "q1r": 4, "q2": "The proposal presents a reasonable set of KPIs, but the lack of specificity on the plan that is noted under Feasibility makes it difficult to determine exactly what delivery will be audited. Therefore, I agree but do not strongly agree that the information provided is sufficient for auditing delivery.", "q2r": 4, "assessor": "z_assessor_495", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "I know the Yoma project.  Nicky Hickman was one of the personalities invited to one of the FireSide chats of the Atala Prism Pioneers. From that FireSide, in which Nicky talked about Yoma, I started to study a little more about the project. And the conclusion never changed: it is a beautiful project. In addition to its purpose, it makes a clean connection between stakeholders, roles, technology and the system that communicates it all.  It is a well-oiled machine.  When a young person enters your network, they have no choice but to come out the other side as a better version of themselves. \n\nThere is no doubt that the integration of the Yoma project into our ecosystem is of great benefit to us, just as there is no other ecosystem that understands the purpose of Yoma better than Cardano.  \n\nSo, after reading all the material provided in the proposal, including the attachments, I am surprised that there is not a more thorough and rigorous explanation of the process of integrating the Hyperledger Aries/Indy stack with Atala Prism. ", "q0r": 3, "q1": "The proposal is clear in highlighting in the Risks section the risk of integration \"due to the different protocols, standards and maturity of each project ...\" which makes perfect sense, and for which the experienced IOG team is prepared.  \"which makes perfect sense, and for which the experienced IOG team is prepared.  However, this risk is not described in the Roadmap activities or budget. Only general activities are cited that lack further information on their implementation.  This situation leaves the future voter with many unknowns to fill in based on assumptions while not giving voice to the difficulties.\n  \nTherefore, more technical information about the integration of the current Hyperledger Aries/Indy stack with Atala Prism would be required to reach a more informed conclusion.\n\nOf course the idea is not to drown the voter in an ocean of technical information, the idea is simply to provide a technical perspective on the difficulties ahead and where specifically the most important pressure points are.  That kind of rigorous but pedagogical dialogue with the outside world is absolutely possible, especially when we are talking about an organization like Yoma, used to communicate with those who want to understand.   ", "q1r": 3, "q2": "The generality of the KPIs provided reveals the generality of the proposal already highlighted in the previous points.  These KPIs are not a performance measurement tool, more so for a proposal that aims for 27.5% of the total budget allocated to the challenge.", "q2r": 1, "assessor": "z_assessor_541", "no_vca": 9, "ne": 0, "ng": 7, "nfo": 2, "vca_o": 1}, {"q0": "The proposal has a clear and precise objective laid out. The objective is to integrate Cardano DIDs and smart contracts into the existing ecosystems of Yoma and Green Yoma. This is perfectly in line with the objectives of this challenge as it directly relates to almost every major point of the challenge and as an added bonus will also be looking at integration of Cardano DIDs with a hyperledger which is a main goal of accelerate decentralized identity challenge. This proposal is integrating an existing ecosystem which already has a use case, live platform and active members. The proposal has a stated growth aim of reaching 3 million youth by the end of 2022 who could all be Atala prism identity users if this proposal succeeds. The project also aims to link to the currently single largest DID project on Cardano, the ministry of education of Ethiopia. In terms of ROI the funds requested are significant however the potential impact is also very high as can be clearly seen. If successful this would not just add a significant number of new members but could increase the relevance of Cardano DIDs with governments and organizations across Africa. Therefore, I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team listed has a good mix of all relevant experience needed to take on a project of this size including several well known and experiences leaders and organizers but also importantly two members with significant expertise in blockchain and self sovereign identity. The one area of concern is a lack of direct expertise in Cardano specific smart contracts. This was clearly identified by the team in the proposal which shows that there is a clear understanding of problem and given the level of experience and contacts of this team I do not believe this would pose too great an obstacle were this project receive funding. All relevant experience was verifiable through links provided. If I had one piece of advice here for the proposer it would be to list a summary of the CV of each member in the proposal for greater ease of assessment by CAs and voters. The project lists clear objectives, individually costed with a specific timeframe for completion. The timeframe listed is aggressive in my opinion for this type of implementation but not altogether unrealistic. The amounts requested are considerable but not surprising considering the fact that this is not simply a matter of producing a new platform but also integration into an existing one which increases complexity considerably. Again this was acknowledged in the proposal which shows that this was carefully considered. Also the integration with a hyperledger itself is valuable to the community as stated in the impact section. One section of this proposal where I would have liked to have seen more information is surrounding the Yoma token and smart contract section of the funding. The assumption is that this has to do with incentivization and integration into a local marketplace but we do not have details to gauge the complexity of this part of the proposal. That said this is not a major concern to me regarding feasibility since the main idea is there, we are just lacking some details. There is also a good level of acknowledgement of the challenges this proposal would face and so the expectations throughout seem realistic. I strongly agree that it is highly likely that this proposal will be implemented successfully. ", "q1r": 5, "q2": "The proposal has a clear set of objectives and a clear timeline for reaching those objectives. The objectives are easily verifiable since they are new features of a platform which would be used by a group of people. You can verify them by seeing if the feature is online and functional. The team also states that they would hold \"weekly/daily meetings\" and report back. The team also states they would use github which could be used to verify progress and that sub-targets would be identified for each milestone which could be posted for the community to verify. There are no major concerns regarding this teams ability to report this information back to the community however there was not a lot of specifics beyond this listed. It would have been nice to have seen a specific avenue for the community to check on progress regarding meeting or other progress that would not fit into github. The team has multiple websites in operation and it would be easy to commit to a blog or a list of meeting minutes that would be posted. However given that the main targets of this proposal are easy to verify for the community and that this project already has a functioning platform with a formed online presence I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_935", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Integrate current Hyperledger Aries/Indy stack with Atala Prism to expose youth to the Cardano ecosystem and related projects (MoE).", "experience": "Our team have been working with SSI technologies for over 5 years and is a thought leader in the field. We developed an open-source SSI stack with Hyperledger Aries/Indy and our MVP platform already engaged with 300k+ youth and have 40k registered youth on the platform."}