{"id": 399939, "author": "submarine7", "title": "Trustworthy News", "url": "https://cardano.ideascale.com/a/dtd/399939-48088", "category": 26451, "amount": 12000, "description": "The digital news fragmentation allows unreliable parties to publish content making audiences less informed due to the lack of accountability", "f6_no_assessments": 6, "f6_rating": 3.6111111111111107, "videos": [], "media": [], "f6_assessments": [{"id": 681, "q0": "This very interesting idea unfortunately gets off to a rough start in describing its content, and then struggles to bring it in line with the Challenge Setting.  The idea of a platform where verified users audit \"digital news sources and contents\" in exchange for reputation that builds up to a verified credential sounds like it might work.  My first question is what incentive do these verified users have to do this work?  The implication from the proposal seems to be threefold: 1) the chance to be issued a DID, 2) accrual of a reputation that leads to a badge that could be used elsewhere to signal the persons interests, accomplishments and 3) people already want to do this work, they just need a platform to do it on.  These answers bring up a number of questions not answered in the proposal that amount to layer upon layer of difficulties that just keep piling up.  The SSI as membership to the platform has grand implications, around requirements for membership or revocation, around how a rep system can be accrued to the DID, what the root of trust is to establish what is allowed on the site and what isn't, what the implications are of such limits or of a wild west.  The idea is thoughtful, but it isn't well thought out.", "q0r": 3, "q1": "This is the area where the proposal struggles the most.  There is no mention of a trust registry to establish how DIDs are issued, or of the role of such a registry in issuing a rep based credential.  The robustness of the incentive system is an afterthought, even though it is probably the most critical  element to this ever getting off the ground.  The very large issue of what is in and out of bounds content wise isn't defined, and under the terms that are presented, it is only limited, initially, to content of interest to Catalyst Community.  Even this scope is far too wide, as they could potentially be interested in anything, in almost any language.  The attempt to capture swarm intelligence for the purpose of news curation, without incentives beyond badges and flairs sounds more like reddit than Cardano.  Fixing this with SSI seems to be a non-starter as well....the integration of a holder wallet (PRISM) for the member, and the platform level integration of a CLI type wallet is a big project...with no real description of what is required.  The proposer suggest that the development and atala integration will be the easier part, but without any links to their qualifications or skills, it is hard to agree, because a DID implementation is much easier said than done.  Additionally, while the budget is heavy to development, that is only because the proposer is declining to apply for funds for marketing, project management, or community building (the part the proposer feels will be the hardest, yet no budget for it).  The proposer, of course, can provide all these services pro-bono, but it wouldn't be wise, and is more likely to lead to the failure of the project for want of enough funding.  All in all, the execution of the idea needs significant tightening up in order to find out if it can reach its potential.", "q1r": 3, "q2": "The proposer establishes that they will begin the work in a private repo, but opensource what they can, which is a good sign, but not very committal.  For finalization, they suggest a number of KPIs to measure the success of the project, but what we really need to see are some milestones on a roadmap.  The general description on the project is as close as we get, and it isn't really in order or tied to a timeline, so I found it difficult to effectively parse how they see the workflow of the technology stack going, or how it could be tracked.  Github, even a private repo has plenty of tools for this that can be reported, including kanban boards for establishing a map of the work and a workspace for organizing everything and assigning tasks.  Additionally a tool like sprint burndown will help to not only track the work for themselves, but it provides a %complete metric which is good for those parts of the project that don't fit well into monthly reports with clear beginnings and ends.", "q2r": 3, "assessor": "z_assessor_1193", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2, "reply": "Impact / Alignment\nThe scope presented here is for the MVP with the clearly defined functionalities narrowed down to the basics. \nRegarding the specific questions:\na) How a reputation system can be accrued to the DID? - Verifiable credentials related functionality fully covers this item\nb) What is allowed on the site and what isn't? - This is usually defined and controlled by the site’s user interface\nc) What the implications are of such limits? - Once the MVP is implemented it will be clear the strong and the week points of the app. Any observed strong limitations will imply quick fixes or possibly bigger developments in the future.\n\nFeasibility\nThe scope of the proposal is the MVP of a news, content management site powered by SSI. Therefore, there whole “trust framework” could be radically simplified at the beginning and possibly a bit (!) augmented in the future.\nWe are planning to use the standard Atala PRISM functionalities. The holder wallets project is under active development (a demo of the Atala PRISM web wallet could be seen here; https://www.youtube.com/watch?v=wemcgPA3IPQ) and there are some uncertainties there. However, we trust the Atala PRISM and the whole Cardano dev community! There have been indications about the new software releases at the end of Q2 – which would be totally in line with the proposal implementation time line.\nRegarding the budget – we would be very happy to get the outlined funding. The team strongly believes in the project idea and would like to cover bigger part of costs.\nOur Team\nCassiano (https://www.linkedin.com/in/cassianogobbet/) is an experienced journalist (the profile will provide an idea about the extent of it) and has also expertise dealing with very complex content management platforms, where technology and communities played key roles. \nAndre (https://www.linkedin.com/in/andre-piza/) is an experienced project manager with a long list of engineering projects managed. \nVidas (https://www.linkedin.com/in/vidas-pleta-baa2321/) is an experienced IT developer, statistics/data professional\n\nAuditability\nWe have indicated implementation schedule with the major milestones. \nWe are thankful for the mentioned productivity tools – we will test them and possibly use them in our project implementation!"}, {"id": 925, "q0": "This is a very good example of a creative way to use Atala PRISM that has not been explored in the format proposed and has the potential to serve as a showcase for new projects with similar focus to increase the total level of adoption. Fake news has become a large problem and solving this problem using blockchain technology could yet develop into some sort of \"killer app\" for trustless verification, identity and provenance. It is too early to discuss scalability and some technical detail and see the modestly priced proposal for what it is: low risk value for money. The proposers include the volunteering their own development work and 1 year of maintenance for a total project cost of 12k to create an MVP that has the potential to be the modest \"genesis block\" of a new area of application. I see a high potential impact and a creative and highly effective use of funds.\nA diagram has been attached that does a good job of visualizing the idea and its implementation.", "q0r": 5, "q1": "The feasibility section is well structured with a four item roadmap and concrete timing of the delivery and structure of the work to be carried out. The budget is broken down and contains many \"pro bono\" elements where the proposers volunteer their time or have existing code or implementations that are provided for free. 5 KPIs are provided that align well with the project goals.\nIt would have been nice to see more details about the proposers, learn their names or background in addition to the very high-level description in the head section of the proposal. I would have liked to learn more about their relevant experience, and links to their credentials, previous work or other external links like a videos in addition to the (good) diagram attached.", "q1r": 4, "q2": "A good amount of work and care has gone into the Auditability section of this proposal. KPIs are present and make sense for the work to be carried out. As this is a usecase for the blockchain that has not been explored before (to my knowledge) I think the timeline and goalposts of articles ingested, flags etc. is good enough and the modest budget also makes a highly granular audit unnecessary. Therefore, I do not deduct any score and consider auditability as fully sufficient.", "q2r": 5, "assessor": "z_assessor_1243", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 988, "q0": "This is an interesting application of SSI, essentially a community news aggregator service that will attempt to leverage the user's skin in the game in the form of their SSI reputation. The impact statement is thorough with, I would argue, the exception of the incentive section. This part could use elaboration and some risk assessment of potential unforeseen outcomes. An SSI reputation system is a tempting model, but how will the community avoid this from becoming a kind of localized social credit score that can be gamed by charismatic influencers? \n\nI don't think this problem is necessarily insurmountable, but I would like to see it addressed.", "q0r": 3, "q1": "The proposal has a fairly aggressive timetable, with a modest budget dedicated almost entirely to development. Much of the non-development work on the project will be done on an unpaid basis, which could speak to the team's dedication to the project. It could also mean the project is overscoped. How many hours will be dedicated to project management and marketing? And why is there no cost to platform maintenance?\n\nThe proposal mentions team members with backgrounds in journalism and IT but does not provide links to bios. On the journalism note, is the team member(s)' background in content aggregation or content creation? We need a bit more information on the team members to get a good sense of this project's feasibility.", "q1r": 3, "q2": "As a project that will have a very visible public interface, it should be quite auditable. The KPIs as given should be sufficient to get a sense of the project's progress. Though it's listed under longer-term goals, the ability to establish patterns of non-reliable-reliable content will be the factor that this project lives or dies by. Would the team be able to provide any kind of KPI that would give us a sense of how this model is developing earlier in the process? ", "q2r": 4, "assessor": "z_assessor_1251", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Impact / Alignment\nIncentives should be understood as a temporary asset and not a definitive one, it’s an eternally ongoing process and not a static one. Communities usually follow a model where early adopters get an advantage regarding the clout they generate compared to late arrivals. The reputation model designed for the tool has a few extra features. In addition to the date of registration in the community and the activity performed by the user, reputation is defined by other criteria (which will be transparent to all members) such as availability, amount of data entered, participation in the forums, diversity of sources entered and analysed, among others, plus new criteria and features developed as the platform matures. Finally, the reputation of community members will not simply be cumulative. Users who have acquired high reputations only will keep them if they remain active constantly. Even early adopters may see their credit expire after periods of inactivity or red flags from other users.\n\nFeasibility\nBreaking down the question:\nPM and marketing costs: the initial development and management will be done by a small team, already with the availability agreed, so no further costs are predicted. Marketing will be limited to social media activity because the application core-audience will be within the Catalyst community, heavily relying on the individual networks within the community. Platform maintenance: operational costs (like hosting and processing power) will be limited in the beginning. When they increase, extra funds will be raised from public and private investment sources. \nOur Team\nCassiano (https://www.linkedin.com/in/cassianogobbet/) is an experienced journalist (the profile will provide an idea about the extent of it) and has also expertise dealing with very complex content management platforms, where technology and communities played key roles. \nAndre (https://www.linkedin.com/in/andre-piza/) is an experienced project manager with a long list of engineering projects managed. \nVidas (https://www.linkedin.com/in/vidas-pleta-baa2321/) is an experienced IT developer, statistics/data professional\n\nAuditability\nAlthough users will have their statistics private by default (with the ability to make them public if they wish), the usage of the platform will be transparent for users to understand how the information is flowing, as well as the development benchmarks. We must have in mind that this is an MVP, not the application in all its maturity, because the potential to evolve is massive. \nReliability measurements: the definition of reliability is the key to the process, but at the same time, the term can be interpreted in so many ways. There is a clear plan to that. The starting point relates to usage, mostly, because it is the low-hanging fruit, and can be easily measured without much controversy. In time, however, new ways to measure become available. The reliability patterns won’t be given - they will be built over by the community input. As more data is processed by the app, more resources will be available to increase the accuracy of the output for users. In the media industry, reliability (or quality) has always been a slippery subject because it involves a great deal of opinion. However, if one observes the “behaviours” generated by usage, solid patterns emerge, with strong, transparent and comprehensible explanations backing it. We have a clear set of concepts to apply when defining these patterns, but we need to have the data first, or we run the risk of confirmation bias.\nIn a nutshell: reliability KPIs start from basic ones (quantitative usage like popularity and upvotes) and evolve to patterns that can be extracted from larger datasets."}, {"id": 4645, "q0": "With so much news items published everyday (more than 200 per day by major news platforms each) and people constantly accusing of faking the news, it is crucial that the data published, by any source, is scrutinized. It would be in the best interest to give this power to the users and also incentivize or asses credibility in order to keep personal contributions aligned with the objective of the project. The pivotal impact of the DID implementation would speak for itself in the long run if well executed.", "q0r": 4, "q1": "MVP time for a web-app could have been less(2-3 months), for launch but taking the design and the budget ask, the timeline is a justified. The infrastructure costs could have been more detailed. The details of the source of articles which will be scrutinized should have been specified, and who would monitor the articles submitted, in order avoid copyright violation issues. The current idea doesn't provide any details of the idea submitter but a previous idea submission in Fund7 mentions a 20 years experience in full-stack development, which is more than enough to execute this project. A LinkedIn profile should have been attached, to verify the claimed experience in journalism and software development.", "q1r": 3, "q2": "The \"Delivery timeline\" in the Feasibility section can be considered for monitoring and auditing the development process taking number of hours worked and goals achieved. The goals have can be more specific, the details of which can be requested during auditing. The details in the Auditability section can be considered for quality of execution and success of the project. The parameters have been well set, although the count of visits to the site could have been included.", "q2r": 4, "assessor": "z_assessor_1748", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6894, "q0": "I like the idea of Trustworthy News. The world needs ways to combat misinformation. And although there are many people working on this problem, efforts to do so within Cardano should be welcomed. To make this effort more relevant, the proposers plan to start with news on Cardano-specific interests, which is an intelligent niche in which to start.\n\nHowever, this proposal is not really about SSI. The use of SSI would just be to issue (1) membership confirmation and (2) reputation scores. While the first makes sense, I do not understand why an SSI credential is needed for a reputation score. If this reputation score is held by a centralized entity, than the credential adds little value (and quite a lot of complexity and cost) to the entity simply reporting the reputation score (like Ideascale does with kudos). If some kind of decentralized reputation score is intended, that should be explained.\n\nThe challenge brief says that the challenge is \"looking for projects that help position Cardano as one of the leaders in the SSI space\". Because of the fairly limited connection of this proposal to SSI, and lack of clarity on the SSI implementation, it does not seem to me to meet this standard, even though I like the idea.\n\nFor these reasons, I neither agree nor disagree that the proposal effectively addresses the challenge. \n\nI am qualified to give this assessment as a serial entrepreneur and investor with experience in data businesses, a funder Catalyst proposer (F6 and F7) on authentication projects, and an Atala Prism Pioneer.", "q0r": 3, "q1": "The proposal presents a plan, but it is significantly lacking in detail for such a complex project. The plan indicates various modules to be built for the MVP, but none of them relate to SSI, which is the reason that this proposal is in this challenge (see Impact above).\n\nThe budget proposed is extremely modest for the project. In fact, it appears literally impossible to build the project with the amount of development time specified. If in fact the proposer is expecting to donate additional free resources to make this project happen (as appears to be the case in some aspects of the budget), that should be made explicit.\n\nThe team description does not identify the specific team members, so it is not possible to assess whether they have the expertise required for the project.\n\nFor these reasons, I strongly disagree that the experience and plan presented are sufficient to conclude that it is highly likely that this proposal will be implemented successfully.", "q1r": 1, "q2": "The proposal identifies some KPIs that would be useful to measure the progress of the underlying Trustworthy News application. But because of the serious issues with the project plan (see Feasibility), it would be very difficult to measure actual deliverables. Furthermore, like the development plan, the KPIs do not relate to deliver of SSI. Therefore, I disagree that the information provided is sufficient to allow audit of the proposal.", "q2r": 2, "assessor": "z_assessor_495", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1, "reply": "Impact / Alignment\nThe proposal is (broadly) about the “application” of the SSI technology (Atala PRISM) in the media space. Once Trustworthy News starts to grow and becomes successful – it will drive the usage of the Cardano blockchain and serve as the reference blueprint of the SSI deployment for the media applications.\nThe SSI role here is to provide an incentive for the individual to bind his/her behaviour and effort (not only in TN but in any other application with the same feature) to an ID he/she will want to preserve, because it holds tangible value to it. Plus, the SSI allows the individual to preserve his/her privacy. Having the SSI as the instrument to “hold” the reputation 1) provide an incentive for the user to have a healthy behaviour and responsibility within the community, 2) protects the privacy of the SSI owner, 3) creates an extra obstacle for bad actors to try to game the system by creating multiple accounts, 4) increases awareness for the average user over the versatility that the SSI can have as information storage resource), spreading its adoption in the users’ networks, 5) acts as a tool for users to display elsewhere the reputation they gathered within the community. \n\nFeasibility\nThe scope presented here is for the MVP (the goal of this project) and the implementation of this MVP is not that complex. It consists mainly of features related to content management (inserting, displaying, calculating analytics for text/URLs) and binding a user’s activity to an SSI ID in the system. For the SSI part we will use Atala PRISM. The future development potential is way bigger and we are planning to participate in Cardano Catalyst program again or organize crowdfunding campaign.\nOur Team\nCassiano (https://www.linkedin.com/in/cassianogobbet/) is an experienced journalist (the profile will provide an idea about the extent of it) and has also expertise dealing with very complex content management platforms, where technology and communities played key roles. \nAndre (https://www.linkedin.com/in/andre-piza/) is an experienced project manager with a long list of engineering projects managed. \nVidas (https://www.linkedin.com/in/vidas-pleta-baa2321/) is an experienced IT developer, statistics/data professional\n\nAuditability\nWe will rely in Atala PRISM for the SSI part and the rest of the application is not that complex. Our goal is to make all the technical implementation and user-building activities as open, auditable as possible."}, {"id": 10671, "q0": "The proposal thinks that the digital news that is published is unreliable and less unaccountable, thus making audiences less informed. It suggests forming a user community platform called Trustworthy News.  Each user is identified by SSI and shares the content he thinks is reliable. As time goes by, there will be a trustworthy publishers list. To achieve that it's proposing a platform created where users contribute reliable news sources.\n\nThe user, as a member of the Trustworthy News, can submit news pieces he considers reliable; get help from other members to vouch / scrutinize information; flag or alert misleading information. \n\nThe use of SSI confirms membership and his credentials and that affirms the interests, knowledge, trust and reputation.\n\nThe proposal foresees the challenge that the amount of information contents may not be large enough to realise the reliability and accuracy of the information. It is also concerned about the bad egg in the system.\n\nI think this proposal has considered the challenges well and worked towards that principle. With that I strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "A prototype version of the platform is ready in 90 days. It is planned starting may 2022, all the modules and features are implemented to have it launched in September/October 2022. Further developments will be considered based on users' decision for catalyst funding.\n\nThe total cost is 12000. The main portion, 10k, is devoted to developer's work.  Marketing is an important element but it's allocated zero budget (it seems a member with this expertise is a volunteer).\n\nThe proposal gives me so much confidence I strongly agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "I agree with the proposal that the application being budgeted for and built serves only as a tool to achieve the objective, namely the user community and news information contents. Therefore the latter is an important element to measure the project success. The proposer laid out a list of KPIs and its goal: 200 users registration, 20 daily active users, 400 articles contributed, 100 sources with at least one taken into the content. All these are to be achieved after  90 days. The proposal also gives qualitative goals after 6 months and longer term.\n\nWith that I strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 5, "assessor": "z_assessor_968", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "\nA community with users identified by SSIDs share the content they find reliable - this way creating publishers lists that are trustworthy", "experience": "\nOur team has professionals with more than 20 years of experience in\n1) the journalism and digital platforms (including Yahoo)\n2) IT (including Plutus, Atala Prism Pioneers)"}