{"id": 400164, "author": "yeepeekoo", "title": "NFT - Proof of Authenticity", "url": "https://cardano.ideascale.com/a/dtd/400164-48088", "category": 26451, "amount": 42600, "description": "How do you verify the origin, the legitimacy, and the rights associated with an NFT? If you cannot, why risk buying it? Only FOMO?", "f6_no_assessments": 5, "f6_rating": 4.066666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is to add proof of authenticity to NFTs by introducing DID into the NFT ecosystem. The proposal describes how this will have positive effects for the Cardano ecosystem, and I am sure everyone would agree that more security and confidence is needed in the NFT ecosystem. There are some problems for me when it comes to how this proposal will impact the community. \"Yes\" - it will make use of DIDs in NFT ecosystem, but will we get better authentication of artists from this? I would say \"no\". My reasoning is that this proposal sets out directly to implement a verification solution, but has no clear concept for the trust registry or the \"forum\" that decides if an artist is real or a scam. The app is said to be decentralized, but the flagging of artists and how this will work is not described. Will we get a centralized entity deciding if the artist is real or a scam? \n\nI would much more have liked this proposal to start as an initiative to define exactly what the mentioned \"properly accredited body\" is, put down rules and governance for this body and then in a later fund, propose an implementation according to the rules defined. Unfortunately, instead this proposal wants to deliver a solution for verification, but without any notion of what \"properly accredited body\" needs to be.\nThe authentication issue of artists is not solved by tools alone because DIDs are just as anonymous as wallets or minting policy ids in the absence of a functioning accredited body.\n\nI would encourage the proposer to resubmit a proposal in a later fund and start with the fundamentals.", "q0r": 2, "q1": "Proposal provides reference links to resources with relevant developer background. There is a budget for developing a verification solution and this looks reasonable. As stated in my Impact assessment, I think more work is needed beforehand to set the governance of the \"accredited body\". In this regard, the budget lacks budgeting. Only $3000 dollars is set aside for specification, and the need for governance is not mentioned in the activity. The project is not simply a development effort. I have low confidence for a more secure NFT ecosystem after this solution has been implemented.", "q1r": 2, "q2": "Proposal provides measures for being able to follow the progress in github-repo and discord after some time. It should be easy gain insight about and follow the progress to assess the successful implementation of the software solution.\nReason for neutral 3 stars rating is that I disagree with how the proposal wants to solve the problem as stated in their problem statement. This proposal is unfortunately jumping over the obstacle of defining the fundamental rules and governance for the artist verification process and runs directly to the development of a solution.\n\nPlease resubmit as governance definition proposal next fund before submitting an implementation proposal. ", "q2r": 3, "assessor": "z_assessor_1075", "no_vca": 10, "ne": 1, "ng": 7, "nfo": 2, "vca_o": 1, "reply": "Impact: agreed that this project jumps directly in delivering a solution (you may want to call it an advanced PoC) and not asking for a budget to assess all possible feasibilities and accreditations. We prefer to build, in light with the good understanding of problems faced with authenticity and copyrights. When we build and provide solutions, we improve the ecosystem more than anything else.  The copyright solution is not assessed by the assessor, and it is not understood why. Buying an  NFT without knowing what rights you have about it or its related content is no good, and it is certain that in the future, copyright metadata will have to be provided. We feel that we bring a good solution. Regarding proof of authenticity, the flagging of fake artists can be done by the community (does not need a private / centralised system for this).\n\nFeasibility / budget: It needs to be clarified that the budget we ask is NOT necessarily the entire budget we will send. We need/want a commitment from the Cardano community to kick start this project, but once we have it, we will likely spend more time, effort and money than the amount of the grant. Overall, is we get funded, this will be a far larger project for longer than what is described here, but we need to kick start it. \n\nAuditability: understood your point, but prefer to build a solution to resolve a known problem, rather than to submit a governance proposal, wait, and then what...?"}, {"q0": "Very innovative approach here.  I want to jump right into the future with this idea and say that this is going to bring DID authenticity of NFT artists to the space, which means publishing art on the blockchain, as an original artist, will be very nearly fraud-proof (which will incentivize royalty-programs to start turning a profit, which is required to bring things like authors into the NFT space).  But this early iteration will only be part of the solution (true royalty protection will come with a trust registry for the artists, which means a decentralized governance framework for artists, which the proposer correctly notes is far too much sprawl for the project at this early date.)  But as a PoC for an authenticated (not just verified, its a big difference) artist and copyright?  It is still a huge step in the right direction, and only appropriate that it happens on Catalyst.", "q0r": 5, "q1": "Frankly, I think this team can deliver on far more than these proof of concepts (authentication, copyright), but as the wise man once said \"Always leave them wanting more.\"  As an author I had a lot of fun looking into their Ceramic project, which is a content decentralization protocol that seems fantastic.  I can imagine all sorts of layering of logic and curation on the streams described there to create a better information age for readers and content consumers.  Looking at this proposal in that light, I realize it is probably safe to start imagining all the promise held in an idea like authentic NFTs as well.  Looking over their actionable items list, it is beautifully robust, with every step of the development for this idea lined out in discrete solvable steps.  I am no SSI whiz, but I know my way around the space, and I saw no \"Unsolvable Conundrums\" nested in the list like a bad peirogi on the plate.  A complicated roadmap, but not unsolvably complex, with clear a clear beginning and end.  So clear, in fact, that they go out of their way to clarify what the results are expected to be no less than three times.  Tell them what you'll say, say it, tell them what you said.  This seems to be a lesson they have taken to heart.  The budget is very heavy to development, which I like to see when the roadmap opens with a development sprint.  The risk here is the same with any SSI rollout on Cardano, and it is the progress being made behind the scenes on the Atala SDK, which I do think is a significant risk (until it isn't...Voltaire is leaning hard on progress in this area, so I don't think anyone at Atala is slacking), and which the proposer's feel is unwarranted to worry about.", "q1r": 5, "q2": "As you would expect from a clear roadmap, the auditable points are clear as well, with 13 solid milestones to hit over the 20-24 weeks the project expects to take.  For the in between time, they will be opensourceed heavily through the early development, so tracking on Github makes progress and KPIs easy to find and fill in.  Towards the end when they start to lean into the proprietary stuff around authenticating the artists, there will likely be less ability for transparency, but the progress reports could still be running on the Web app development, as well as announcements from the NFT onboarding side.  The simple issuance of a single authenticated NFT with copyright protection would be proof of success.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 15, "ne": 6, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "I have been on the lookout for a solution to this problem, and I agree with the proposers evaluation of the need for a verification tool to evaluate authenticity in the NFT space as it relates to self-sovereign identity.  And while I believe verification will be an essential part of the growing NFT trade, I have 2 suggestions that may help you develop this idea.  1) Perhaps the platform can serve as a verification tool by acting as a centralized authority to issue certificates that verify the CREATOR is authentic.  That way, artists could advertise their verification credentials, and maybe NFTs minted by a verified artist would then automatically certify in the NFT's metadata, linking its production to the creator's identity.  I believe in the future, a catalog of verified creators may be easier to execute/advertise than a more NFT-level solution.  Consider the Certik audit badge, a project-level trust mark that has become popular in the crypto space.  It indicates a third-party review of the project, but has no practical link to the team/creators that could be useful to audiences on other projects.   2) Please consider how this kind of solution might extend beyond the digital art world to include NFT projects that deal in trade of goods/services, having secondary-markets as a key feature (i.e. jewelry, wine, clothes).  In the example of a wine bottle NFT purchase on a secondary collectors market, a purchaser might like to see an authentication stamp attached to the NFT as a way to feel comfortable about the authenticity of the goods.  But it would be more important to be able to track and view the creator's profile or website, and validate that creator is real, and that the NFT originated from that real creator, rather than originating from any creator who's identity was validated allowing them to stamp the NFT.", "q0r": 5, "q1": "While the elements of the delivery plan are present with comments about general timeline, there is little in terms of detail that might help technical peers to evaluate the links between budget, complexity, and schedule.  The proposers comments on mitigating the risks of overrunning the 5-6 month proposed timeline using a “safe and detailed plan” falls short of providing substance as it relates to that plan’s details, other than to comment that the project’s commercial success may require its own tokenomics at a later stage.  While the budget seems like it could be reasonable to accomplish the volume of work proposed, it would be helpful to see a more detailed cost breakdown that incentivizes key team members to complete and delivery at least an MVP for this project on the timeline stated, or how they will could market test the idea to gain community feedback before a commercial solution goes live.", "q1r": 3, "q2": "The open source nature of this project provides a good basis for tracking the project on a technical development level.  However the other 2 key metrics for success (engagement and commercial) are purely dependent upon adoption of this solution by the relevant market, even though the plan presents no concrete way to build awareness of its existence or develop partnerships that may help creators to become aware of its existence and utility.  My suggestion to improve audibility would be to consider identifying a partner (or many) for market testing this solution (perhaps a mid-level artist or creator) to help you gain feedback/experience on deployment of the MVP from a user perspective.  Those third-party collaborations could help to keep the project on time and also help to make sure it maintains focus on market utility, rather than just purely tech operation.", "q2r": 4, "assessor": "z_assessor_1224", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1, "reply": "Feasibility : the development of smart contract is detailed more in features, but not in cost at this stage. As always, things can change a little when in the weeds of the project, so the cost was put as a best allocation of funds. It has to be clarified that the grant is not necessarily the full amount required, but this is what we ask to kick start this project. It is likely that the project will grow bigger in the future, ands therefore for additional time, effort and money will be spent by the team, above the initial grant. \n\nAuditability: good point, we take on board."}, {"q0": "This is an excellent proposal and aligns very well with the challenge.  The problem statement defines a dilemma that leaves one wondering how anyone in their right mind would invest large sums in NFTs without the solution being already in place.  The proposal harmonizes with several of the directions of the challenge, including Participation and adoption growth, NFT and smart contracts integration, Trust registries, Governance frameworks,  and Business models.  The proposal does an excellent job of detailing the risks involved and the mitigation strategies.", "q0r": 5, "q1": "The team appears to have the appropriate experience to pull this off.  The description of the project lead is solid and includes a linked-in profile for more information.  The fact that this individual has already received funding in F7 is a plus.  The team member in the role of Software Architect is a Prism pioneer, which is relevant for the proposal.  It would have been better to include a more detailed description of the experience and accomplishments of the other three team members besides the project lead.  The plan seems to have all the right elements, including an effort to finalize a specification; all of the necessary bits regarding smart contracts, prism, copyright certificate; API and web app integration; and a website for marketing and engagement. While the main stages have been defined, they could be improved with more detail on the specific tasks and their timelines. The budget is straightforward.  It's easy to see how funds are to be allocated, and the amounts appear reasonable for the effort involved.\n", "q1r": 4, "q2": "Transparency is to be facilitated by using Github.  The fact that this is primarily an open-source project is exciting in that the technical community can follow along closely.  Auditability is straightforward, but we will have to wait until the end to see if what is delivered is promised.  That will take approximately six months based on the plan as written, and it could be improved with more measurable goals as to phases to be accomplished by definite dates.  The way it is written, we have to wait until the end of the project.", "q2r": 3, "assessor": "z_assessor_1375", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1, "reply": "Auditability: the project has milestones with some independent deliveries (not all delivered at the end). There are 2 \"smart contracts\" (one for proof of authenticity ; one for proof of copyright) which will be delivered independently and well ahead of the final delivery of the web3 API and web app, which are only a wrapper around the smart contracts. As such, the project is delivered in several independent milestones."}, {"q0": "The NFT market is a mess of deception and fraud. If the market is going to succeed, it will absolutely need a solution like the one proposed here to help cut through that fraud. Kudos on a very clear and focused proposal that clearly fits within the challenge brief.\n\nI am qualified to assess the proposal as a funded Catalyst proposer (F6/F7) on identity-related projects.", "q0r": 5, "q1": "The proposal articulates a clear solution to the problem and roadmap for delivery. Eric and his supporting team appear to have the skills needed to deliver the project. Eric also has a track record building and selling a significant business, which is encouraging and impressive for the Cardano ecosystem.\n\nI do have a suggestion that the proposal seems rather heavily weighted to smart contracts. It seems to me that much of the proposed functionality could be delivered with basic SSI functions and a clear protocol for implementing them in NFT projects, without the need for smart contract integration. But Eric is clearly thinking about this carefully, and this suggestion on approach does not change my view that it is highly likely this proposal will be implemented successfully.", "q1r": 5, "q2": "The proposal articulates a clear protocol and states that success will be the delivery of that protocol, along with building a community around it on Discord (aiming for 1000 people within six months). These targets are straightforward and easy to measure.", "q2r": 5, "assessor": "z_assessor_495", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}], "solution": "With SSI and DID, a provably verified artist can stamp an NFT with a certificate to prove its origin, its authenticity, and a set of rights.", "experience": "Since early 2021, I have worked on DIDs (Ceramic) and various web3 proof of concept projects around authentication, authorization, data and identity, as well as designing solutions for providing on-chain runtime dynamic attestations of proof from static certificates."}