{"id": 400385, "author": "proofspace.nick", "title": "Credential-based token, e.g. KYC", "url": "https://cardano.ideascale.com/a/dtd/400385-48088", "category": 26451, "amount": 34668, "description": "Digital KYC repeated for each new user onboarding results in a valuable identity asset that is underutilized.", "f6_no_assessments": 5, "f6_rating": 4.7333333333333325, "videos": [], "media": [], "f6_assessments": [{"q0": "With the growing need for regulation around KYC, DIDs and the tokenization of a reusable credential can rapidly increase adoption. Allowing services to check a current credential versus repeating the process provides huge impact to cost effectiveness and thus increased adoption of a Self Sovereign Identity. The proposer has a experienced understanding of the risks and has outlined & accounted for them well.", "q0r": 5, "q1": "There is a clear path for developing a PoC with a very well defined scope of deliverables. I would like to see how the proposer plans on incorporating this with other KYC providers and projects in the space, although they do mention that may be a F9/F10 next step. With the expected deliverable of a smart contract with demo, it’s highly likely to be implemented with the team’s experience. ", "q1r": 5, "q2": "With such a narrow and well defined scope Auditability is quite binary and easy to track. They account for project in progress, near completion, success and continued success metrics which are aligned with the challenge criteria. It would be worthwhile having more quantitate metrics of success, but the qualitative results are likely more realistic to scope out.", "q2r": 5, "assessor": "z_assessor_1122", "no_vca": 13, "ne": 0, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "At first glance this proposal looks pretty good and seems to align with SSI principles.  A reusable KYC token that saves users the hassle of multiple KYC onboarding events, and saves businesses the cost and poor UX that is a fellow traveler of this common regulatory burden.  But upon closer inspection, this is actually not using SSI in its intended way and actually runs the risk of raising costs for businesses.  The first thing to note, is that under the principles of SSI, you don't want a third party provider between you and your data.  The way SSI should solve the KYC problem is by originating better verified documents in the first place:  DIDS and VCs.  At the point a KYC check is underway, you are still reliant on the 3rd party, where the KYC check has to be maintained and stored.  In the proposers solution, the token that is issued represents that a traditional KYC check has taken place, but it doesn't validate it.  This is different from the need to verify it, which is what other businesses would be doing when they accept the token.  But they will only accept the token in lieu of trusting the validation process of the original token issuer (i.e. the issuer's trust registry).  Think of the liability a company is taking on in trusting someone else's KYC process.  Furthermore, this leads to issues regarding maintenance of the KYC documents.  Are they out of date?  Is the jurisdictional rule being followed?  If all of these protocols were lined out, and the governance framework they constituted created a trust registry for the 3rd party issuer of the tokens that was acceptable from a liability standpoint for a cohort of businesses, you would still have the issue of the original documents for the KYC check being stored and maintained with a 3rd party provider in violation of basic SSI principles --opensource, openstandards non-KYC checks performed with the customers informed consent, using credentials they own, that have been issued by originating authorities, cryptographically secured and verified, in real time. Just first party and second party, no middlemen, no additional fees and complexity.  As this proposal stands, could it provide a service of some value to the KYC business community?  Absolutely, no argument from me, and I believe there are plenty of businesses that would adopt this model.  Are there interesting use cases for the proof of concept laid out here, such as in voting protocols?  Yes. But can it provide an actual SSI solution, in an SSI challenge setting, that abides by the opensource standards of SSI?  No.", "q0r": 3, "q1": "This is not a feasibility rating of the SSI protocol, but rather of the implementation of the plan provided.  See my impact assessment for my concerns about SSI.  This team, Proofspace, is well underway for delivering a number of the aspects of this proposal, including already having the partnership with Onfido (a major travel industry solutions provider) onboarding and claims that they have others lined up with interest.  The budget has been painstakingly laid out, and it is helpfully aligned to the timeline.  The timeline  covers multiple sprints and for such a large project is very tight, coming in at just under 4 months.  All the steps in the timeline are described in actionable terms (enable..., draft..., deploy...) which makes it easy to count up the auditable beats, and each phase (roughly correlating to the months) contains a clear deliverable.  You can tell you have fullstack developers on the team, as every tech in the stack is spelled out.  Beyond the SSI issues I noted above, the team does take into account risk involving the makeup of their trust registry (what if they only have one Issuer?), by noting that the protocol still works with just one issuer, and additional issuers can be onboarded at any time.  Since there is no intent in this MVP to go beyond the one issuer (would be nice to test the dashboard with multiples) I find the risk to be low and adequately addressed.", "q1r": 5, "q2": "While disappointed to see something that isn't explicitly opensource (Proofspace is built on HyperledgerINDY, I believe) in the SSI challenge, it was not an explicit requirement of the challenge. So, while we don't have opensource Github repos to drool over, the team has committed to the monthly progress and KPI reports, and indicates a willingness to give more significant updates (making the smart contract repo public would be nice) in town halls or other community events.  The clarity with which they mapped out the process indicates to me that they have a good feel for how to deliver the project, and the absence of any openended \"soft\" action points tells me that their focus will be on the project and keeping it on track.\n", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 10, "ne": 2, "ng": 7, "nfo": 1, "vca_o": 1, "reply": "The reviewer has provided some really fantastic arguments and we take seriously the points made in the impact / alignment feedback. My concern is that the reviewer makes a set of claims about SSI that are idealogical and subjective, rather than realistic and objective:\n\nIMPACT\nReviewer: \"The first thing to note, is that under the principles of SSI, you don't want a third party provider between you and your data.\"\nResponse: It's true that we want KYC data to be originated as VCs and DIDs in the first place, but this requires us to convince Governments to issue foundational identity through SSI. Unfortunately, this is not realistic in the near/mid-term. In the meantime, there is an opportunity to grow the adoption and utility of SSI, still bringing significant benefits to end users in terms of privacy, while partly relying on well-adopted and well-trusted solutions in the market. There is unlikely to be a \"big bang\" transformation in how our online identities are managed. It takes experimentation, compromise and a willingness to work with the existing markets to gain entry to those markets. If we remain staunchly idealogical about the origination of foundational ID credentials in SSI networks, then the SSI market will not be able to make use of those credentials and it will struggle to provide value to businesses who rely on them.\n\nReviewer: \"Think of the liability a company is taking on in trusting someone else's KYC process.  Furthermore, this leads to issues regarding maintenance of the KYC documents.  Are they out of date?  Is the jurisdictional rule being followed?\"\nResponse: The reviewer assumes the credentials will immediately be used in regulated settings, where of course there is a liability issue. We would start with organizations who see business value in a higher-assurance identity verification, but for whom that identity verification is not a regulatory requirement. This lowers the liability risk / if not waives it. As for whether documents are out of date: these settings can be configured in ProofSpace. Verifying parties can can configure predicates to set their tolerance levels on particular identity values/attributes. And as for whether jurisdictional rules are being followed: I don't see the relevance - it is the responsibility of the verifier to meet their jurisdictional requirements. But, going back to the original point - it assumes a regulated setting, which in all likelihood is not where this solution will be first deployed.\n\nReviwer: \"...violation of basic SSI principles --opensource... issued by originating authorities\"\nThe reviewer makes untrue and subjective claims about the basic principles of SSI.\n+ Opensource is a good long-term objective, and one that we hold, but it is not a basic principle of SSI and there is no principle prohibiting us from developing intellectual property. We use and contribute to open source technologies and standards, but we also develop our own IP. Sovrin is a reliable authority on \"Basic Principles of SSI\" and opensource is not one of them - https://sovrin.org/principles-of-ssi/. Open standards, yes (and we comply). But not open source.\n+ Originating authorities: discussed above, it's an unrealistic stance that risks ruling SSI out of transactions where identity binding is needed."}, {"q0": "I am convinced that the proposal addresses the challenge. KYC (credential-based token) will work like a physical ID. There are many benefits like cost reduction, reduce customer drop off, tranparency improvement via KYC tokens, and the possible use in smart contracts. The KYC is a useful medium when the organizations need to perform customer identification. However, I think relying on one KYC provider is a risk in itself. I don't agree that the customer should take comfort that they only need one KYC provider as the proposal said. Other than that, the utility of KYC-verified token still has limitation in some regulated entities depending on their jurisdiction context. The proposal can be improved by offering ways to mitigate these risks. With more alternatives of KYC providers and the addressed concerns, the credential-based token e.g. KYC should help to position Cardano as the leader in SSI.  ", "q0r": 4, "q1": "As per proposal, the project will be completed in 2 months. Either that the team has designed a very tight schedule or the project doesn't require many steps to achieve the outcome of KYC credential-based tokens.  The  Explanation is needed here by the team why the project will only take 2 months with high number of requested funding. They offer the room to perform other tasks if they have capacity. If not, they will push it to fund 9 and fund 10. However, they will need to address the short time frame required for this project as it doesn't reasonate well with their funding. Wouldn't it be more reasonable to expand the proposal length and include tasks which they plan to perform in fund 9 & fund 10. The team should plan to conduct the project effectively and not stretch the budget across many funds. Given the diverse experience of team, I believe it is highly that the proposal will be implemented successfully. ", "q1r": 4, "q2": "The team plans to report the progress via Catalyst monthly report and end of project reports. The team should pay attention to their timeline. The monthly deliverables of May and June doesn't match with the project timeline they specified earlier of June July.  The team should cross check that the project timeline is coherent throughout the proposal. As I already pointed out on the timeline concern, the score in auditability will not be deducted by the same flaw. The team has defined several terminologies ie. the project in progress, project almost complete, project success and project continued success making the project easy enough for auditing.  ", "q2r": 5, "assessor": "z_assessor_1358", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal builds on the F7 proposal “No-Code SSI SaaS for Mass Adoption”  This is a high quality project with clear problem statement and solution that gives control of ones digital identity.  The fact that the project targets companies and organizations promises a leading role in SSI space, growth of cardano ecosystem, and trust, to name a few.  The KPIs specified in the proposal match those of the challenge. The impact that the project will have on cardano ecosystem and end users is immense. ", "q0r": 5, "q1": "The proposer has provided information on all team members who are qualified and with experience in the subject, therefore, I believe they can implement the project.  The duration of the project is two months which seems realistic since the team is already composed of five professionals.  The proposer has given detailed timeline with deliverables and budget which are also realistic and feasible to accomplish. Technical details have been provided from impact through completion. The proposer has identified a risk related to business relationship which has been tackled already by taking actions in advance.     ", "q1r": 5, "q2": "The team has provided clear information in regards to auditability. The information that will be provided to the community according to the KPIs has been clearly stated and is measurable thus helping the cardano community monitor the progress of the project. Therefore, within the auditability plan there will be a documentation + PoC-Level code, a repository with smart-contract for review, and a video demo. In all, the proposer has provided sufficient information to monitor the project and its goals.     ", "q2r": 5, "assessor": "z_assessor_1434", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "It should be noted that this proposal was presented in the old question format in previous funds and i will be assessing this proposal based on the current structure of questions in fund 8.\nThis proposal is trying to tokenise verified identity by a trusted registry that can be used in a smart-contract .\nI like it as it will be very flexible to work with but i have a few questions.Generating a token introduces the problem of verification for the smart-contract for each token, this can be easily achieved on a single blockchain, but how will you tackle this being used across multiple blockchains as i wouldn't want to have separate identity tokens for different blockchains.\nI am giving 5 star for the impact of this proposal because this has a huge potential of moving cardano SSI to the next level and in a simple way if implemented correctly.", "q0r": 5, "q1": "The proposal provided a detailed plan with timelines , a detailed cost breakdown but failed to provide the verifiable link of the team.I will encourage the proposer to add this on the assessment comment section for other CA's to see .\nDespite the above issue i will still give 5 stars for feasibility as i believe the team are capable of delivering this proposal to success.", "q1r": 5, "q2": "Github repos will be shared with the community and the proposal highlighted its KPI's which are clear and trackable.I have nothing much to add.\nI will be giving 5 star according to the CA assessment requirements fulfilled for auditability.\nI wish the team good luck.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}], "solution": "Integrate ID Providers (e.g. Onfido) to issue PRISM VCs so unique ID check gets bound to DID & published as token for use in smart contract.", "experience": "Engineering team with 80+ yrs full stack dev and distributed systems research. Business team with 60+yrs legal, sales, product and ops across industries and geographies."}