{"id": 400313, "author": "proofspace.nick", "title": "Trust Registry with Smart Contract", "url": "https://cardano.ideascale.com/a/dtd/400313-48088", "category": 26451, "amount": 27685, "description": "Creating and maintaining trust registries is a complex, time-consuming and costly exercise", "funded": 2, "upvotes": 44524913, "downvotes": 5250171, "votes_result": 39274742, "votes_cast": 148, "f6_no_assessments": 5, "f6_rating": 4.6, "videos": [], "media": [], "f6_assessments": [{"id": 152, "q0": "Proposal fits nicely into the challenge. Trust registry is one of the topics encouraged by the challenge description. The proposed outcomes would be a great addition to the PRISM community. \n\nI must admit that no-code and smart contract in the same sentence leads me to think very basic customization possibilities in this first release like changing parameters or yes/no to include some part of workflow. This is pointed out in the risks section which is good, but not completely confident this will be easily mitigated in later funds as indicated.\nProblem statement say creating and maintaining trust registry is complex and this is something I believe too. Still, because the proposal promise configurable smart contracts, creating smart contracts will most likely be cost-effective as long as you can make use of these standard contracts with ProofSpace. Changes to the smart contract workflows going beyond changing some parameters will still require code, time and cost. I agree this proposal effectively addresses the challenge", "q0r": 4, "q1": "Reference links provided and shows a competent team with relevant skills. Proposal is a continuation of a previously funded project. Budget is reasonable and is broken down into identifiable items. Realistic time table.", "q1r": 5, "q2": "Roadmap showing how this proposal fits into the big picture! Clear deliverables listed. No direct listing of KPIs.", "q2r": 5, "assessor": "z_assessor_1075", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 692, "q0": "This is a really great idea, and a bullseye on the challenge setting.  Very few of the proposals in this challenge setting have approached the DID framework from the perspective of trust registries, despite these registries (more particularly the governance frameworks behind them) being perhaps the most important aspect of the DID space (after the cryptography, of course).  This proposal suggests the creation of a template for a trust registry that allows verifiers to not only verify the credentials issued from them, but to verify the issuer themselves.  This is a critical component of the logic of being able to set this up in a smart contract and validate it.  Where it really gets interesting is their plan to take that smart contract template and give it adjustable parameters and roles, so that someone can customize it to fit a DAO or token or whatever you might need a DID issuing governance framework for.  But the hits keep coming:  on top of being able to customize the smart contract, the end user does it in a no-code GUI.  Yes, please.  There is a high likelihood that this is not going to be a solution that can cover every  possible governance scenario some nascent DAO thinks up, but that is ok too, because the template itself will be released as opensource code, so any number of templates could be designed on that foundation logic.  Always remember, the trick of DIDs is getting the trust registry right.  Glad to see someone working on it.", "q0r": 5, "q1": "The development team looks fantastic, with each team member bringing something critical, from full stack developer, to scientific researcher to UI/UX specialist and more.  The budget is laid out clearly, spaced out by the associated deliverable.  The timeline specifies delivery within the 6 month timeframe and speculates on what can be done with any extra time, to \"boost\" the final product.  An associated tasklist is helpfully included, which corresponds to the budget, as well.  Their description of the base trust registry logic gives me confidence that they will be approaching the smart contract in a solvable way, which should save time.  One thing I haven't mentioned is their intent to get a voting schema running on the no-code app, which would be a fascinating test case, and could be scaled to include adjustable voting protocols, so that there could be choices about 1 DID/1 vote, or quadratic voting.  Very encouraging to see the choice for proof of concept.  Also worth noting the no-code platform is already built, so it is going to be an integration for the smart contract, rather than a build for the no-code.", "q1r": 5, "q2": "The initial documentation and template will be going to opensource, so that is an easy one to keep track of. Once they move to implementing it in their no-code platform, tracking gets a little trickier.  There are fewer obvious milestones, so maybe a sprint burndown to track a %complete would be useful here.  Once they have a demonstration of the no-code smart contract customization, it is really all downhill.  They have mentioned they would be willing to do some townhall updates, which could help bridge the expected dryspell during the no-code implementation.  Overall, I expect they will have no problem staying on track.", "q2r": 5, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 6088, "q0": "This proposal directly addresses one of the challenge highlighted topics \"Trust registries\" and it is trying to create a kind of standard template powered by a smart-contract with no code.\nI wouldn't pretend to understand the subject but i did a little reading and with trust registries , will help in the journey of a robust SSI on cardano.\nIn the risk section this proposal spoke about external storage as a solution for storing the associated identities ,my question is that introduces a new problem of which oracle external datasource will guaranteed to be the law when interacting with the smart-contract on the chain? how will the security architecture be to ensure validity of the data? (These questions are for a case where the data will be more expensive to store on the chain).\nI will be giving this a 5 star for impact.", "q0r": 5, "q1": "It should be noted that this proposal follows the old series of questions of past funding rounds but will be assessed based on the fund 8 question structures.\nThat being said , The plan and timeline provided by the proposal was very clear and the cost breakdown was very detailed. one problem is the lack of a verifiable link for the proposing team and this is important to verify the capability of the team to deliver the proposal to completion.\nI will encourage the proposer to add linkedIn or private website profile links of all the team members listed in the assessment comment section.\ndue to the above raised, i will be giving 4 stars because i still believe the team can execute the proposal despite the missing verifiable link of the team.", "q1r": 4, "q2": "The proposal will employ an open reporting model to track the progress of the proposal.I will suggest the proposing share a trello link or the github link link which i believe that is the intention.\nI will be giving 5 star as the proposal provided KPIs and how the progress will be audited.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 9741, "q0": "The proposal looks to create a trust registry where issuers who require high trust have a way to verify they are issuers and join the trust registry that end users can use to verify the issuer is who they say they are. Trust registries will be an important growing need for the identity ecosystem so that when there is an ever increasing amount of issuers there are a number who have went through verification and governance to be added to a trust registry so that holders can verify the DIDs that they can trust as issuers - especially for credentials which are more sensitive. The proposal is very well aligned with the challenge due to the need for the infrastructure to be in place for the ecosystem to start to evolve and have governance structures in place. The team highlight some of the technical issues behind the usage smart contracts for the trust registries and the governance around the registry. They highlight that some of these issues will be addressed in future proposals. Overall there is a clear and evident need for the education and registries that solve the issues around the need for high trust issuers and as such the high potential impact for this proposal is clear.", "q0r": 5, "q1": "The roadmap is broken down into a set of itemised tasks and also a monthly roadmap is provided stating which things will be intended to be completed. For each of these areas a budget has been calculated. Six proposal team members have been listed, their roles and some basic information. No background sources are provided such as a LinkedIn profile to more easily verify the team. The team do not provide a Github repository or a link to their site on the proposal. By looking at their previous proposals you can find Zaka https://www.zaka.io/about-us which is there no code platform. With this you could find a small amount of extra details regarding the team. It would be good in future to provide more information on existing open source code and professional background to increase the confidence given that the team can execute the proposals they present.", "q1r": 4, "q2": "The team detail out an itemised list where what they want to implement is covered under each month. In terms of the success outcomes they cover the execution of the proposal and collaboration with partners in the ecosystem in terms of getting initial adoption and usage. It would have been good to at this stage share a Github repository where this can be tracked in the proposal and also for clarity to have any specific use cases in mind that they believe may be good initial users for this trust registry. This type of information would give more confidence in being able to audit whether the proposal is a success in a reasonable time after execution which would be useful for the community to help improve future funding decisions for this project.", "q2r": 4, "assessor": "z_assessor_758", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10466, "q0": "This proposal aims to develop a minimal DAO-template and also an open source template for trust registries in a smart contract. The latter is directly mentioned in challenge settings and therefore aligned with them. Trust registries are one critical component for SSI-solutions and it is of utmost importance to be able to create your own trust registries as a project in a permissionless way, meaning that you are not reliant on a third party, like a software provider or a government. \nThey also want to use this in their own app ProofSpace and offer additional functionalities in that app. ProofSpace appears to be closed source with no mentioning of pricing, so the merit of this is not clear. Nonetheless, having a smart contract template to define a trust registry is already an important outcome.", "q0r": 5, "q1": "All of the team appears to be part of the ProofSpace team with sufficient work experience in the SSI-sector and enough knowledge to correctly estimate the effort and scope of their proposed solution. The roadmap is detailed and has clear deliverables that are achievable and are attached to a decent budget. They are the first proposal I've seen that lists success-criteria at multiple stages of the project (progress -> sustained success), which I like a lot.", "q1r": 5, "q2": "Although the proposal details a nice set of deliverables, they are only reported on in the monthly progress report in a one-sided way. No GitHub-repository is mentioned for the open source parts, and all other deliverables related to ProofSpace are not independently verifiable due to the closed source nature of it. Additionally, there is NO website or any link attached to identify the team or what they are doing. On web-searching, you find them on linkedIn, which links to their outdated Zaka-website, where you can confirm most of the teammembers. This needs to be included directly in the proposal and not be left to the merit of the community advisors, e.g. there is a different proofspace website (proofspace.net) which does not seem to be affiliated with them.\nAs I have seen some of the proposers personally in PRISM meetings (Nick & Ruslan) this does not weigh as heavily as it would have otherwise.", "q2r": 3, "assessor": "z_assessor_924", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1, "reply": "Thank you for the feedback about the auditability. We have now addressed many of the issues by:\n(a) posting our linkedin profiles to the comments section of the proposal\n(b) launching our new website\n\nIn future we will take care to add links and resources to our proposals."}], "solution": "Define a Smart Contract template that describes a TrustRegistry: DIDs in registry have right to issue VC. Result: verify VC and VC issuer.", "experience": "Engineering team with 80+ yrs full stack dev and distributed systems research. Business team with 60+yrs legal, sales, product and ops across industries and geographies."}