{"id": 400791, "author": "jeffrey.downard", "title": "Disability, Accessibility & Equity", "url": "https://cardano.ideascale.com/a/dtd/400791-48088", "category": 26451, "amount": 28000, "description": "Individuals with disabilities face many challenges and barriers. How can Cardano resources help support rights to equal access?", "f6_no_assessments": 3, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "This is an interesting use case for DIDs, and a quite useful case is to be made for SSI in this space, especially when you think of scaling some of the principles to engage disabilities and wider Cardano use, something which DIDs could completely alter the landscapes of.  But I have to say up front, given the challenge setting this is in, that this is not an SSI project.  It does intend to use DIDs, but there are several issues which crop up due to it not being true SSI, and as a result, the actual feasibility of the project is in jeopardy.  With that in mind, the consideration here is that a pretty large population would probably like to be onboarded (along with their service animals) into a protocol that gives them verified credentials for their animal that would be recognizable as authentic and able to authorize the animal to accompany that owner without worry of harassment.  And while the core idea of the DIDs needs to be rethought, the general idea regarding a DAO is actually a promising first step, rather than a follow up, and the proposer is encouraged to start there in order to get here.  The ability to set up a trust registry for a DID is an important component, not just in implementing the DID, but in thinking about how these kinds of processes need to be designed.", "q0r": 3, "q1": "The plan as laid out by the proposer has a lot of things to like, especially the creation of educational portals for both self learning and educating others about disabilities and service animals.  Where it starts to go sideways is in the intention to set up a 3rd party server to store medical records and animal training records.  The whole point of SSI is to NOT need this kind of privacy violation, while still maintaining the ability to securely confirm and verify matters of private record.  This is is the purpose of the trust registry, as it establishes how the things behind the encrypted DID are validated and authenticated.  A common shortcut to SSI, which is actually a short circuit, is to insert oneself as the middleman, and say \"I have verified and authenticated this document\", but that just creates an infinite regression, because how have we verified and authenticated you?  No, what we need is logical protocol that bases off some fundamental facts.  The best validator of a record is the actual issuer of the record itself, not someone who holds a copy of it, but unless the government starts issuing DIDs, that isn't an option.  This is why I suggest the DAO as a starting point.  Citizens can't issue government documents (and why governments have that power is a conversation worth having, but not here), but using certain frameworks, they can actually have far MORE credibility than even a government has, as far as the authenticity of a documented claim.  Over time, with a good governance framework, the DAO could establish best practices, definitions, roles and requirements for what a proper service animal blockchain credential could look like.  It could seek endorsement for that governance from the ADA or a regulatory agency, but even if it couldn't get that endorsement, it could create its own trust registry that logically validates any claims it makes against that trust.  It does this through clear guidelines, and membership requirements for the DAO.  Based on this level of trust, the credentials now can be issued with zk-proofs, which means that no one needs to see your medical records to verify that your service animal is who they say they are.  Whether in the form of a DAO or a regular trust registry, the proposers will need to make these issues clear, or else the lack of privacy will prevent users from onboarding and the lack of trust will prevent verifiers from onboarding.  You can issue credentials with Atala quite easily with the did:prism call, but they don't mean anything without the trust registry.", "q1r": 3, "q2": "The standards laid out here for keeping up with the project look to be fully opensource (excellent) and cover many areas of development within the project making it a cinch to follow along with.  The only issue here is the inclusion of KPIs to measure the onboarding of users to the database...but as discussed, this is not a measure of success, as adding your private data to yet another 3rd party server is the opposite of privacy, even if they have the best intentions and great security protocols.  What would be good to see here is the development of the DAO first, get the governance for this project into the progress reports and developed, and then start looking into solutions for the SSI wallets (several community projects are working on this, so a collaboration or partnership would be a good metric to attain).", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The idea has a good potential but it lacks in providing some relevant info and is unclear what is the added value to the Cardano ecosystem. It is not clear who is going to create this form of digital identification (it's about all public identifiers of an identity) and why Atala Prism has a key role in this process.\nWith an SSI solution, master data is issued electronically by accredited issuers (how this request is met?)", "q0r": 3, "q1": "There are no traits about the team members experience, only statements about their area of expertize without providing references (links, social media etc.) to support them.\n\nThe budget is broken down into identifiable items but it seems that the cost per working hor for some of them are under or over priced (the web development cost per hor is less that the one for Research on disability laws - how come?)\n\nThe proposer has not considered challenges and risks relevant to a successful implementation (as I said in the previous section, all types of digital identification must be issued by accredited entities).\n\nThere is a timetable defined with achievable milestones and seems realistic.", "q1r": 3, "q2": "The main challenge to be solved for this proposal is how the forms of digital identifications will be implemented and used on the platform.\nIt this aspect is clarified it will be a step forward for this proposal on its path to success.", "q2r": 3, "assessor": "z_assessor_309", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "This is a clever proposal for a solution to a very focused disability problem involving service animals. It is particularly relevant that there is no existing registry to address this problem, so developing a SSI/web3 solution makes a lot of sense.\n\nHowever, I have a number of concerns about the details of the proposal:\n(1) The proposal involves both building an SSI solution and a DAO to deliver it. There is no explanation of how the DAO would work, and building the DAO seems a rather separate task.\n2) Much of the budget for the proposal is for legal research, publications and marketing. If the proposers understand the issues as well as they claim to do, it would seem better to focus on development of a proof-of-concept application before engaging in all of these related activities.\n\nFor these reasons, I agree but do not strongly agree that this proposal effectively addresses the challenge.\n\nI am qualified to make this assessment as a serial entrepreneur for 15+ years and a funded Catalyst proposer (F6 and F7) for solutions related to authentication using Atala PRISM.", "q0r": 4, "q1": "This proposal has detailed plan and a large team who seem to have the broad expertise related to the problem being addressed. \n\nHowever, I have concerns regarding technical delivery. The team has fairly limited technical expertise, and the budget for technical delivery is a relatively small part of the overall budget. There seems to be no budget for DAO coding or plan for DAO structure / tokenomics.\n\nFor these reasons, I neither agree nor disagree that it is highly likely that the proposal will be delivered effectively. If the proposal is not funded, I would encourage the team to develop a technically more complete plan and resubmit the proposal.", "q1r": 3, "q2": "There is a very detailed set of deliverables for the project. These should permit auditing, but there are some issues (detailed above under Impact and Feasibility) regarding the match of deliverables with plan and funding. Probably the largest issue is how the DAO will be delivered. Therefore, I agree but do strongly agree that the information presented is sufficient to audit the proposal.", "q2r": 4, "assessor": "z_assessor_495", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "We aim to use Atala Prism to promote access and ensure equity for individuals with disabilities who use service animals.", "experience": "Education, ethics, law, business consultant, developer, data management, blockchain development, team members have personal experience living with disability and in the training and use of service and emotional support animals."}