{"id": 381405, "author": "dwayne", "title": "DAO-NET: Multilingual Translation", "url": "https://cardano.ideascale.com/a/dtd/381405-48088", "category": 26252, "amount": 19000, "description": "Traduzir e criar plataformas multilíngües requer financiamento sustentado, porém o financiamento Catalyst é para projetos específicos.", "funded": 2, "upvotes": 68055931, "downvotes": 3385966, "votes_result": 64669965, "votes_cast": 174, "f6_no_assessments": 4, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "A proposta atende bem aos objetivos do desafio, pois procura criar um DAO que fornecerá financiamento para diferentes tradutores trabalharem em diferentes projetos, com o objetivo de traduzir inicialmente uma página de votação. A idéia aqui é, como eu entendo, conseguir que o máximo de conteúdo deste tipo seja traduzido para o maior número de idiomas possível. O que foi um pouco confuso em minha opinião é se o projeto visa traduzir apenas este tipo de conteúdo (votação) ou se pretende, mais tarde, começar a produzir outros tipos de projetos. É positivo que os autores já tenham definido tradutores e parceiros, pois este projeto não vai se materializar apenas do ponto de vista técnico, e ter profissionais nesta área de tradução em mente já vai acelerar parte do processo de desenvolvimento. Portanto, acredito que o que faltava seria a compreensão do que aconteceria além da tradução do conteúdo da votação; além disso, acredito que a proposta é muito relevante para o desafio, pois aborda diretamente a premissa de levar o conteúdo do ecossistema Cardano a diferentes pessoas que não falam inglês.", "q0r": 4, "q1": "Os autores da proposta têm muito envolvimento com nossa cadeia de bloqueio, sendo pioneiros de Plutus, operadores de SPO, CAs e etc., de acordo com o que é dito. Recebemos uma breve descrição da dupla, na qual podemos identificar seus nomes, áreas de especialização e seus perfis interligados, onde podemos ver mais sobre sua trajetória e conhecê-los com mais detalhes. Acredito que eles têm muita confiança em sua capacidade de promover este projeto, pois têm muita experiência com a cadeia de bloqueio e já participam do ecossistema através de suas piscinas e do Catalyst. Eles também anexam um roteiro, que decompõe em meses o que seria feito através de uma lista de tópicos. Com isto, é possível ter uma visão do todo, uma compreensão sólida do processo, pois sabemos quais atividades serão realizadas e em que ordem resultarão no produto final. E, finalmente, eles compartilham como o financiamento seria utilizado. Sobre esta parte, gostaria de comentar que, em minha opinião, eu poderia ter tido mais detalhes sobre os dois tópicos que não são Algorithmic DAO Smart Contract. Por exemplo, na parte da tradução, eles reservaram $6.000 dos quais não sabemos quantas pessoas serão divididas, qual o custo da hora de trabalho do tradutor, se todos os tradutores ganhariam a mesma quantia (ou de repente quem souber traduzir um idioma menos comum, que é mais difícil de encontrar tradutores, ganharia mais...). Portanto, esta parte deixou um pouco a desejar em termos de detalhes, se houvesse mais explicações, teríamos uma visão mais específica do que aconteceria com o dinheiro solicitado.", "q1r": 4, "q2": "Os autores estabelecem uma série de KPIs, que podem ser utilizados para compreender objetivamente os principais resultados a serem alcançados com este projeto. Observa-se que eles dialogam diretamente com os objetivos do desafio, reforçando ainda mais a questão do impacto; e através deles, é possível monitorar de forma simples se o que foi proposto foi alcançado. As definições de sucesso de acordo com os meses também são fornecidas, ou seja, os autores tiveram o cuidado de detalhar os objetivos específicos de acordo com a passagem do tempo, tornando a auditabilidade do projeto totalmente possível. A meu ver, por ser uma plataforma que guiará outras plataformas, e haveria várias línguas sendo trabalhadas, com pessoas muito diferentes sendo alcançadas, é complicado eleger membros da comunidade para trabalhar com a auditabilidade deste projeto (há muitas coisas diferentes a serem monitoradas e teriam que ser pessoas que falam as línguas atuais). Creio que é melhor que a própria equipe do projeto, juntamente com seus tradutores, promova este monitoramento e organize os dados coletados em relatórios para serem expostos à comunidade. Isto poderia ser feito em conjunto com a apresentação dos resultados de outras propostas financiadas pelo desafio, por exemplo, durante a prefeitura ou por outros meios de comunicação com a comunidade Cardano.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 15, "ne": 10, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "Very good idea! Creating a dao for translators can basically solve this challenge fund for good! \r\n\r\nDefinetly in accordance to the challenge goal and being very effective!\r\n\r\nRating given 5.", "q0r": 5, "q1": "Based on the information in the proposal, it is highly likely that they will implement the proposal successfully.\r\n\r\nI find their experience and skill suitable for the aim, the only drawback are missing positions to be filled.\r\n\r\nBesides that, I am confident.\r\n\r\nRating given 4.", "q1r": 4, "q2": "The roadmap is provided in very detail, sufficient for audit.\r\n\r\nAlso, the relevant KPIs are stated, along with a budget description increasing the possibility to audit.\r\n\r\nAlong with addressing possible risks and their mitigation, IP being open source, the progress and the outcome will be transparent.\r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "Cardano is a growing ecosystem, and adoption is crucial part for its success. Multilingual resources is still limited, and needs initiative and funding (for example, through this Fund 7 challenge setting). This proposal will create a DAO, that will govern around this multilingual resource ecosystem in Cardano. Although we already have Project Catalyst to fund these project, it just wouldn't enough to kickstart and fund a lot of multilingual resource in this early stages. DAO-NET will help to address this, by creating a DAO specifically to fund translators for various documentations, software interfaces, videos, etc. However, this proposal doesn't belong in this challenge, since the product they're building are DAOs, not the multilingual resource itself. It should be placed under 'DAOs <3 Cardano' challenge category. I acknowledge that this team have another proposal on DID challenge setting, but it would be better if they could combine this to one single DAO-NET proposal under the DAO challenge category. ", "q0r": 3, "q1": "This proposal provide team's linkedin profile, and able to prove that they have the experience needed for this type of project. This proposal can identify the skill requirements for Product Manager and the Lead Developer, both explained well. This proposal laid out the plan in details, from the roadmap, action plans, goals and achievement for each months. The budgets is explained in identifiable manner, and future funding consideration also provided. The team able to identify the risk and explain the mitigation solution, such as DAOs regulations, and bad actors from the participants within the DAO ecosystem. Overall, this is a well written and comprehensive proposal and have a high chance of successfully implemented. ", "q1r": 5, "q2": "The roadmap is well explained, with achievements and goals laid out in details. Metrics and KPIs are also provided, such as number of non-English speakers joining Cardano/DAO-NET community. However, it would be better if they provide the target number for each metrics, such as 100 people minimum joining the DAO-NET community.", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "It is true that AI-based automatic translation tools have many shortcomings, but I think that it should still be focused on developing them rather than investing in traditional translation. Automation is the trend of current world. We need to invest in the right places to minimize waste of resources. However, in the short term, traditional translation still proves its superiority based on accuracy and sensitiveness.", "q0r": 3, "q1": "The team has many years of experience in the related field and present it well in the proposal. The proposal also includes a specific and reasonable plan (including phases and desired output for each phase). They also analyze risks and have corresponding provisions for those risks.", "q1r": 5, "q2": "The proposal includes KPIs along with Success Definition. Moreover, the outcome of project is easy to audit (output is document).", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Criar um DAO, com financiamento sustentado para tradutores, para fornecer traduções para interfaces de software, documentação, reuniões e vídeos.", "experience": "Uma equipe experiente de desenvolvedores Blockchain, pioneiros de Plutus, operadores de SPO, Conselheiros Comunitários e Analistas de Soluções."}