{"id": 381003, "author": "dwayne", "title": "DAO-NET: Voting DApp", "url": "https://cardano.ideascale.com/a/dtd/381003-48088", "category": 26240, "amount": 49000, "description": "DAO Netは、カルダノのエコシステムに参加するための有意義なインセンティブを提供しますが、そのためには使いやすい投票ウォレットDappが必要です。", "funded": 1, "upvotes": 84377037, "downvotes": 9211936, "votes_result": 75165101, "votes_cast": 329, "f6_no_assessments": 4, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "提案者は、DAO-netプロセスへの有意義な参加を可能にするDappを持ちたいと考えています。それは、投票やトークンを使った作業を意味します。提案書はファンド7にいくつかの興味深い提案があり、互いにうまく機能していますが、すべての提案が投票されない場合には、個々の提案として見ることができます。プロポーザルは、同じ目標を持つ多くの人々が身元を隠したまま共同作業を行うための組み合わせを提供することで、カルダノのエコシステムにどのような価値をもたらすかを説明するのに十分な仕事をしています。プロポーザルの主要な指標は、チャレンジの設定に関連しています。提案書には、将来の課題やスケールにどのように対応するのかという項目があります。非常に詳細に書かれており、他の提案が追随するような例となっています。Currentyl 提案書に欠けている大きな部分はありませんが、予算の内訳など、改善すべき点がいくつかあります。これまで50件以上の企画書を見てきて、ほとんどの企画書のタイトルを読んだことがありますが、この企画書は他に類を見ないものです。これは非常に興味深く、革新的なアイデアだと思います。開発者として、私はこの提案に非常に興味を持っており、投票段階を待って投票したいと思います。この素晴らしいプロジェクトの提案者には幸運が訪れますように。\r\n", "q0r": 5, "q1": "提案者はリンク先のプロフィールを提供しており、彼らはこの実装に必要なものをカバーするために必要なすべての経験を持っています。チームメンバーの数は決められていますが、必要に応じて成長し、規模を拡大する余地があります。このプロジェクトに参加するために必要な具体的な人材やスキルも記載されています。これにより、プロジェクトの信頼性を高めることができます。予算が明確に示され、実行すべき確実な項目に分けられています。このプロジェクトを成功に導くための現実的で詳細なタイムテーブルがありますが、私はこのプロジェクトが終わることはなく、むしろコストをかけて成長し続けると考えています。  提案書には、実行のための非常に詳細な計画が示されており、DAOの匿名性を維持する方法など、多くのデリケートなケースのためのすべてのリスク管理に関する非常に具体的なセクションも含まれています。提案の計画とその実行は、時間枠と目標を考えると合理的です。提案書は、技術的な側面をもっとうまく説明できたはずですが、それほど大きな問題ではありません。  最も重要なことは、このプロジェクトが、すでに行われていることについて調査を行い、その上に構築するということです。全体的には良い実現可能な提案です。", "q1r": 5, "q2": "プロジェクト・カタリストには、資金を出す前にマイルストーンを達成するための監査要件がすでにありますが、私はプロジェクト・カタリストだけでなく、コミュニティによる監査を期待していました。この点については、githubのレポがリンクされているので、興味のある人は中を見て、提案の進捗を確認することができます。また、テレグラムやディスコードでのやりとりもあるので、トレーサビリティも確保されています。言及されているメトリクスは、最終目標とプロジェクトの成功に関連しています。ロードマップとマイルストーンもよく分解されており、成功に至るまでの詳細なステップ・バイ・ステップのプランを提供しています。明確でわかりやすい説明がなされているだけでなく、非常に詳細で、ほとんどの場合、適用可能で実用的な説明がなされています。  提案者が有権者の立場に立って考え、コミュニティの人々のコメントに耳を傾けたことは明らかです。ドウェインとジュードの二人に幸運が訪れますように。", "q2r": 5, "assessor": "z_assessor_536", "no_vca": 14, "ne": 9, "ng": 5, "nfo": 0, "vca_o": 2}, {"q0": "提出されたマニフェストは、目前の課題を明確に理解し、信頼できる投票用Dappが存在しないという問題に対する実用的な解決策を提示しています。キャンペーンの概要は、この解決策によって最適に対処されています。また、提案者は長期的な目標として、DAOトークンのウォレットを実装することを明確にしています。したがって、課題の主要な要件の1つであるCardanoの採用と統合を増やすことになります。この提案は、全体として、Cardanoのエコシステムとその水準に宇宙的な影響を与える可能性があります。そのため、提案のインパクトという点では満点です。", "q0r": 5, "q1": "アクションプランやチームが直面する可能性のある課題を細かく設定している点は興味深く、提案されたアイデアに沿ったものとなっています。要求された資金も、その内訳を見てみると、現実的で妥当なものであることがわかります。段階ごとのマイルストーンと、それを達成するための時間的制約も、理にかなっていると思います。実現可能性に5点満点中4点をつける唯一の理由は、プロダクトマネージャーとリードは非常に才能があり、提案を成功に導く能力があるにもかかわらず、フロントエンド開発者とオープンソースウォレットの貢献者の穴を埋めようとしないメンバーは、暫定的な期限内に提案を100％成功させることに疑問を残しているからです。", "q1r": 4, "q2": "チームメンバーが不安を抱えているにもかかわらず、提案者は、監査役が進捗状況を確認するための指標を間違いなく提示しています。明確な成功の定義とロードマップは、提案の成功に対するコミュニティの信頼を高めます。また、提案者は、次のラウンドで必要になる可能性のある資金の概要を示すことで、目的地に到達するための意思、意志、情熱を示している。提案書に記載されている3つの主なKPIは、キャンペーンで期待される指標と一致しています。DAOがオープンソース化され、ライセンスされていることで、監査のプロセスが容易になり、また多くの人に利用されています。この提案は、すべてのギャップを埋めるために強力なチームを編成すれば、このチャレンジの重鎮となる特徴をすべて備えていると私は強く信じています。", "q2r": 5, "assessor": "z_assessor_751", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is about creating a voting DApp that incentivizes meaningful participation in DAO Net processes, including a wallet for DAO token awards. The problem is clearly described, and explained in detail so that it addresses this challenge. The solution is clearly defined, suitable for the challenge, shows a clear impact on the Cardano ecosystem as a whole in the short term and long term. Therefore, based on the given information, I strongly agree with this proposal's impact, I would rate it with a score of 5", "q0r": 5, "q1": "This team consists of very active members of the Catalyst, and their profile shows suitable skills and experiences for implementing this work. However, some members [Atala Prism Developer] and partners [Legal Firm, Tax Accountant] are not defined. After all, in my opinion, this is proof of feasibility from the team profile. The budget is clear and logical. Risk is very clearly defined with mitigation, and further analysis [this is very convincing, I think]. After all, based on the given information, I still strongly agree with this proposal's feasibility, I would rate it with a score of 5", "q1r": 5, "q2": "This proposal provided a lot of meaningful information, with external links [profiles, resources, documents] for verification. Therefore, based on the given information, I strongly agree with this proposal's auditability, I would rate it with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 15, "ne": 2, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "Integration and/or stand alone voting apps for DAO's if a need not yet filled. ", "q0r": 4, "q1": "The proposers however look to bolt this on to their own product and dont describe solution that could work with ANY DAO. I would however be a step in the right direction if a codebase was made for DAO voting and integrated with wallets (as they suggest), but would be better if it could be used by any DAO or easily modifiable to work on custom DAO's. The proposers have proposed DAO NET in another proposal however, so what happens if they dont build DAO NET? does DAO voting (this proposal) not work at all?, or can they adjust it to be less DAO contract specific, i.e., not only work with their DAO product? ", "q1r": 4, "q2": "I agree that this team has a good understanding and sets goals that can be measured, however my concern still lies in their budget for DAO contract code development. This particular proposal would be a good if it wasn't so DAO NET specific and made a suggestion to layer to improvements (if possible)", "q2r": 4, "assessor": "z_assessor_750", "no_vca": 13, "ne": 2, "ng": 8, "nfo": 3, "vca_o": 1}], "solution": "DAOトークンアワードのウォレットを含む、DAOネットプロセスへの有意義な参加をインセンティブとする投票DAppを作成する。", "experience": "ブロックチェーン開発者、Plutusのパイオニア、SPOオペレーター、コミュニティアドバイザー、ソリューションアナリストからなる経験豊富なチームです。"}