{"id": 381646, "author": "oswald", "title": "Interaction with blockchain", "url": "https://cardano.ideascale.com/a/dtd/381646-48088", "category": 26240, "amount": 20000, "description": "アフリカでは、クリプトの購入、販売、交換、NFTS......不用意な懸念が残っており、採用にブレーキがかかっています。", "funded": 0, "upvotes": 14606923, "downvotes": 18493204, "votes_result": 3886281, "votes_cast": 144, "f6_no_assessments": 6, "f6_rating": 1.5555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "この提案は、CardanoのエコシステムやDApps & Integrationsの課題自体には、ほとんど重要ではないと思います。はい、BCoinは新しいコーイングです。BXchangeは新しい駆け出しの取引所です。はい、ホワイトペーパーがあります。ホワイトペーパーには、「BRYO Xchange Coin AKA Bcoinは、BRYO Xchangeのエコシステムで使用されるトークンです」と明記されています。そのスマートコントラクトはEthereumブロックチェーンの属性で設計されており、BRYO Xchange内の取引所をつなぐためにBSC（Binance Smart Chain）に展開されています。\"OK、つまり-最初から-BCoinプラットフォームはネイティブなCardanoプラットフォームではないことがわかります。いくつかの新しいアプローチが使用される可能性があることは理解しています（ラッピングトークン？ ブリッジプロトコル？...しかし、ここでは何も決まっていません）。実際、ホワイトペーパーではCardanoについては全く触れられていません。それから、取引所のウェブサイトには比較的素人っぽい要素があります。例えば、\"Why shan't I miss this pre-sale?\" (BCoinトークンの)という質問に答えている。[BCoinトークンの）先行販売を見逃すわけにはいかないでしょう」という質問に対して、サイトにはこう書かれています。という質問に対して、「このプレセールには絶対に参加すべきです。なぜなら、このプレセールの後、Bcoinの価格はかなり上昇し、あなたが得られるチャンスはあまりにも低いからです。また、人々はお金を得たいと思っています。プロジェクトの将来性が高ければ高いほど、システム内でのトークンの使用数が多くなり、価格が上昇する可能性が高くなります」...。OK、さあ、それが実用性ですか？提案書の中でCardanoについて言及しているのは、次の一文だけだ。\"-Make Bcoin compatible with other blockchain (Cardano Ethereum ...) to accelerate its adoption \"です。しかし、そのための計画は見当たりません。そのため、この課題の主要な問題を直接的に解決するためには、この提案をさらに微調整する必要があります。私たちの努力は、[CARDANO]プラットフォームにユーザーを引きつけることができましたか？私たちの努力によって、Cardanoの上に構築された新しい、実行可能なアプリケーションが生まれたか？", "q0r": 1, "q1": "実現可能性はインパクトとは全く別のものです。確かに、ある提案のインパクトは課題の中では低いかもしれませんが、実現可能性は非常に高いかもしれません。つまり、簡単に実装できて、実現する可能性が高いということです。つまり、インパクトを低く採点したとしても、この提案は実現可能性が高いと判断できるのです。しかし、このケースではそうではありません。提案されたソリューションは、どちらかというとウィッシュリストに近いもので、本当の完成度は言葉で表現されているだけです。Exchange V1 [ https://xchange.bryocorp.com/demofiat.avi ] のデモへのリンクは、私が開こうとしたときには機能していませんでした。Exchange V1 と e-learning platform は、ロードマップではすでに未開発です」という意味不明な説明もありました。この文脈で「すでに未開発」が何を意味するのかよくわからない。また、アフリカという大陸への言及や、無名の国への言及が多く見られます［「私たちのトークンはicoで、アフリカの5つの国から、私たちの決済ツールを使って、携帯電話から現地通貨で直接購入してもらっています」］。しかし、この特定の国を探すのは私たちに任されています（見つかりませんでした）。また、ご存知のように、暗号取引所は大陸レベルではなく国レベルで規制されています。提案者には、提案が成功したかどうかを後で監査できるように、ターゲットとしている市場やサービスについて明確にするようアドバイスします。20,000ドルの予算の使い方は、行き当たりばったりで、非常に一般的なものです。「80%はエコシステムの開発を加速し、他のブロックチェーンとのBcoinブリッジのために」、「残りの20%はプロジェクト周辺のマーケティングとコミュニティの成長のために使う」。これは、カルダノのエコシステムにおける技術的なノウハウをまだ証明していないチームに、多くの信頼を寄せているように思えます。また、https://coinmarketcap.com/currencies/bombcrypto/ にはすでにBCoin（Rank #2819）があります。これは同じコインですか？もしそうでなければ、問題があるでしょうか？BCOINをあなたが掲載している取引所[https://info.bankcex.com/project-list.html]で見たことがありますが、そこにはプロジェクトが2021年11月25日にサブミートされ、総供給量が1,100と記載されています[あなた自身のサイトでは総供給量が16.000.000と記載されていますが]。\r\n16.000.000].私は供給量が1,600万であると推測しています。あなたの取引所のサイトには、\"BRYO Xchangeでは、世界中のあらゆる場所で、あなたの暗号通貨を現地通貨や外国通貨に交換することができます \"と書かれています。- しかし、BRYO Xchangeがどこに拠点を置いているのか、その公式登録の詳細はどこにあるのかわかりません。連絡先は電子メールとTelegramグループだけです。誰がKYCを行うのか、またKYC会社とのパートナーシップ契約は完了しているのか？", "q1r": 2, "q2": "この提案には良い点があります。アフリカの市場でクリプトやNFTの取引へのアクセスを改善しようとしています。それは立派な目的です。しかし、アフリカには（他の大陸と同様に）、国ごとに異なる規制やインフラ、市場の制限があります。提案者が目標を達成するためには、これらの障壁を克服するための非常に的を射たプロジェクトを実施しなければなりません。私の理解が正しければ、これはアフリカのためのBinanceと、取引所で使用するBinanceコインのような提案です。野心という点ではいろいろあるようですが、予算はそのような野心にしては比較的小さく（2万ドル）、また、Cardanoとのリンクは非常に議論の余地があり、はるか先の話です。私は、この提案をそのまま監査することは比較的難しいと思います。指標やKPIは正確ではありません。例：\"v1取引所の立ち上げ、これによりアフリカ諸国での暗号通貨の導入が大幅に促進され、当社の不換紙幣決済システム（現地通貨）でカバーすることになる。\"いい響きですが、どの国がターゲットになっているのかわからないという事実を考えるまでは。また、「-BLearn e-learning platformの立ち上げ」も、「BLearn platformが何なのかわからない」ということを考えれば、問題ないように思えます。チームは、Blearnが次のようなものであると述べています。「完全に分散化された安全なeラーニングプラットフォームで、現場の知識へのアクセスを容易にする」。しかし、それは新たな問題を引き起こすことになります。完全に分散化された安全なeラーニングプラットフォーム」とは何なのか、なぜ中央集権的な取引所や暗号コインに「完全に分散化された安全なeラーニングプラットフォーム」が必要なのか、なぜこの部分は特にセキュリティに焦点を当て、分散化に焦点を当てているのか。範囲が狭い中央集権型のeラーニング・プラットフォームでは何が悪いのか？このように、このプロジェクトは様々な方向に向かっており、多くの声明や願望があり、予算もそれに見合っていないように思われます。", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 21, "ne": 11, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "There's no correlation about the problem and proposer's solution. This proposal is trying to get funding then develop their BRYO xchange coin (or they said BCOIN) with their planned ecosystem. I don't really understand what they wanna bring to provide the most value for end users in 2022 in Cardano blockchain. I read BCOIN whitepaper v2 and it explanation makes me confused. Whitepaper explained all the basic of cryptocurrencies but I found no correlation at all. There's no proof this \"Bryo xchange\" is developing in Cardano.", "q0r": 1, "q1": "The website have Team Members section with some link to LinkedIn profile, but the profiles they linked seems look kind of suspicious. Example: CEO start working at February 2021 with no other experience, some members also not add their latest job at Bryo on their LinkedIn profiles.\r\n\r\nBudget are broken down generally. Proposer asked for $20,000. 80% (means $16,000) will be used to accelerate their ecosystem and for the Bcoin brigde with other blockchain, but with no detailed what will they working on first or later. If the proposer want to build bridge to other blockchain, it means Bcoin have their own blockchain. There's no link to proof their blockchain are exist. Better to detailed down the budget, so the community can audit this project easily.", "q1r": 1, "q2": "Proposer written the timetable in their website, but there's some typo with all of the roadmap. For example April 2021 = Q1, Januari - May 2022 = Q1 2022. I assume the team behind this BCOIN projects are not aware with this typo thing. Author explained in their Whitepaper V2, but it's too basic for a whitepaper. KPIs or key metrics are rewritten roadmap. Better put some relatable key metrics the team will working on.", "q2r": 2, "assessor": "z_assessor_639", "no_vca": 19, "ne": 3, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This ecosystem is necessary for helping the situation that the team mention in the problem, it can help boost more adoption in the Cardano ecosystem too. But they should provide much more info to show their plan. For making an impact with the challenge, the team should have some key metrics that align with the challenge given, they can refer to the tab \"about\" of the challenge, then write down some word to explain why their idea impact or bring value to Cardano ecosystem. This proposal has none of those. ", "q0r": 1, "q1": "The team should provide more detail about the implementation plan than just a few words about features and outline what needs to do.  For getting a high assessment on feasibility the team must show how good their ability on implementing the project is. A detailed implementation plan for their solution in this scope can be coding features in the ecosystem, launching plan, marketing activities... they're something that the team should consider and well explain to convince Catalyst community. \r\nGood thing is that the team provided an demo, e-learning platform that is in scope of whole project. But for all of them, they lack a detailed roadmap that help CA/ vCA assess whether the required budget is reasonable or not. \r\n", "q1r": 3, "q2": "We can't audit this proposal because there is nothing for it. They have outlines of what steps they will do, but I don't think it's a roadmap. \r\nFor info, the team will have to report regularly to Catalyst their progress, hence, the team must provide a roadmap and key metrics for CA/ vCA assesses that are available to audit this project. And the key metrics must be aligned with the challenge given as first, they don't have it, too. \r\nOne more thing is the team must describe how they are aware of the problem context by detailed explaining it, then detailing the solution that must address those problems. If not, it will be hard for everyone to understand what the team wants to do and is it helpful or not. This means the proposal can get a low scoring in all three-part: impact, feasibility, auditability.", "q2r": 1, "assessor": "z_assessor_651", "no_vca": 19, "ne": 4, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "The solution in this proposal is making an ecosystem that helps facilitate interactions with blockchain that address the problem, is within the challenge, but the proposal doesn't have basic things for assessing the impact: \r\n- Explanation about how it will add value to Cardano ecosystem, this help convince CA/ vCA and voter to easily clear the impact of the project on the ecosystem\r\n- Key metrics that align with the challenge setting, it will show how the project will affect the ecosystem by specific criteria. ", "q0r": 2, "q1": "This proposal has some referral links to show their done work including: \r\n- Demo\r\n- Platform that they say it's finished 50% without evidence\r\n\r\nThen it lacks all the basic things for assessing the feasibility. Include: \r\n- Detailed roadmap to help CA/ vCA know its milestone and summery things to do or finish at this time. \r\n-> All it has there are outlined steps to do without explanation. \r\n- Detail implementation plan with a detailed explanation about features, actions, activities of the plan. This will help to assess all other parts in the proposal are suitable or not. \r\n-> The proposal only has features descriptions. \r\n- Detailed budget that should be pointed which/ who it will be used for. Based on the plan, it will be assessed reasonable or not to be funded and help voters make decisions on voting. \r\n-> In this proposal, the budget is 100% nonsense. \r\n", "q1r": 2, "q2": "The proposal doesn't have the basic things for auditing, including: \r\n- Roadmap with a detailed and realistic timeline, its outline about the steps is nonsense because doesn't have a timeline. More detail will help Catalyst team easier on track and check the project regularly, currently, the project team has to report in biweek. \r\n- Key metrics that are clear and fittable with the plan and vision of the team, of course, must be aligned with the challenge setting. \r\nAnd 2 explanation to help Catalyst team easy understand what the proposal want to do: \r\n- Problem explanation, should be in case studies, context that the team has been aware and motivated to make the proposal.\r\n- Solution explanation, to explain detail about how the solution can help to solve the problem. ", "q2r": 1, "assessor": "z_assessor_670", "no_vca": 17, "ne": 4, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "This proposal just has a few outlined features with poorly brief and simple steps to do that cannot be named as a plan. It has no impact on the Cardano ecosystem because they have no info to tell that what value their project adds to the Cardano ecosystem and all of these infos are common, and key metrics to make sure that they are concerned about the challenge setting. ", "q0r": 1, "q1": "The proposer showed only some outline brief about the features, some attach a link to the demo, this project has whitepaper in their website... those some info can't help I figure out what they gonna do in the future after being funded. \r\nThe roadmap the proposer showed in the proposal is just some outlines that have no timeline and are without detail, I think can't help to track anything. \r\nMoreover, the budget breakdown and explanation are so confused. If that budget for development, at least they have to clear those amount of money will be used for how long (hour/ day/ week/ month) ", "q1r": 2, "q2": "The proposer does provide not enough info that's sufficient to audit the progress and the success of this project. He has no detailed roadmap and key metrics, that's the basic things for auditing the project. \r\nMoreover, because the content in the proposal is poorly explained about what he want only, all only feature brief, so I can't understand in detail the problem that the propopser wants to solve and their solution can address it or not. Of course, there is no risk management that is included in this proposal also. ", "q2r": 1, "assessor": "z_assessor_671", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "The problem stated by this proposal is a brake to Cardano adoption, caused by a difficulty in interactions with blockchain. The team does not provide a very detailed description of the problem to be solved, and at the same time the plan describes a very wide range of tools as a solution.\r\nThe plan includes a very wide list of modules planning to be developed (exchanges, crowdfunding platform, e-learning platform, a tool to create NFTs and tokens) :  there is no clear description on what impact is expected from each part of the project, and no Kpis. The added value of each part to Cardano ecosystem is not explained, and it is difficult to estimate for the community.\r\nI would suggest the team to focus on a short list of short-term objectives, to ensure a better description to the expected impact with some quick success. \r\nI disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "Some demos are provided of the website which suggests that a development has indeed started. \r\nHowever, the team is not identified, and it provides no evidence of having the required skills to manage all the targeted development. I recommend to the proposer to further detail the plan by giving a timeline for the project and elaborate the challenges to be taken at each step of the development.\r\n", "q1r": 2, "q2": "The proposal states that 80% of the budget will be used to \"accelerate the development of the ecosystem\" : that is unprecise and needs to be detailed. It also states that part of the budget will be dedicated to the \"Bcoin bridge\" development, but there are no description and details about this bridge.\r\nBased on the current description of the proposal, I consider that the community will not have the capacity to estimate the progress of the project in attaining its goals. This proposal needs to be reworked for a coming Catalyst Round : I recommend to add more precision about everything that will enable the community to monitor the progress (roadmap, Kpis, budget detailed breakdown).\r\n", "q2r": 1, "assessor": "z_assessor_78", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "私たちは、ブロックチェーンとその派生物を、特定の人や企業を問わず、誰でも簡単に扱えるようなエコシステムを構築し、導入を促進します。", "experience": "私たちのトークンはicoで、人々は携帯電話から直接、私たちの決済ツールを介してアフリカの5つの国の現地通貨を購入します。"}