{"id": 382053, "author": "nftdao", "title": "NFT-DAO Boxcar Framework Contracts", "url": "https://cardano.ideascale.com/a/dtd/382053-48088", "category": 26240, "amount": 29600, "description": "現在、安全なDAPスマートコントラクトを書くことは難しく、開発者は監査可能なスマートコントラクトを確保するためのツールを持っていません。", "funded": 1, "upvotes": 26757318, "downvotes": 16848210, "votes_result": 9909108, "votes_cast": 158, "f6_no_assessments": 4, "f6_rating": 3.833333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "If successful the proposal will make it easier and faster for project teams to develop DApps. If DApps are developed faster, it will attract more users and in that way increase the utility of the Cardano ecosystem. I feel indirectly the proposal does address the challenge. ", "q0r": 2, "q1": "The proposal provided bios on the 5 team members, I would like to see a link to LinkedIn or similar to verify. I would like the team to expand on how Glow programming language will tie in with Cardano and the PAB. ", "q1r": 2, "q2": "The proposal provided a high level roadmap and line item budget based on hourly rates. I would like the team to recreate a detailed roadmap with milestones that are connected to the KPIs and budget, in this way the team can track performance vs. expenditure over time. Furthermore, I would like to see the team add measurable goals to the KPIs identified – create/sign up/ X number by Y date – create 5 box wires by month 2, have 10 users by month 4, etc. As the proposal stands at the moment it might be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 19, "ne": 0, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "The proposal is for buiding a open source NFT marketplace framework in Glow which can be used by other to build and host a NFT market place like CNFT.io. This is a nice idea. There are few projects and proposals on similar lines. But this proposal is to use Glow which is considered as a cross-platform easy to use smart contract language. Therefore this is a good proposal for the ecosystem. ", "q0r": 5, "q1": "Muku and the Glow team had demonstrated the technical capability in Cardano360 and town halls in the past. The Glow language is reportedly is simple and is considered as easy to write a smart contracts with. Therefore I believe that this team will be able to complete that task.", "q1r": 5, "q2": "The budget of approximately 30K USD is for the development of the NFT framework in Glow. The budget looks reasonable given the task involved in building an NFT trading site. However, a breakdown and a rationale for the budget in the proposal would have added value.  ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 25, "ne": 1, "ng": 19, "nfo": 5, "vca_o": 1, "reply": "\"I love this Proposal\" and them assess it as a 3? Perhaps overstated, or under voted."}, {"q0": "The proposers want to build a framework on top of Glow that will enable building infrastructure smart contracts and help NFT developers. A framework would fit better in the Developer ecosystem, but It's ok for this challenge as well. There will be a tremendous impact if this gets implemented since NFTs are a hot topic for the past year and continue to grow and evolve. I didn't see any metrics per se, but there is some mention of a definition of success. I would have liked to have some measurable KPIs though. Keeping in ming how large the team is and their skills, I think they wouldn't have an issue with scaling up when necessary.  Compared to other proposals, this could have been a bit more detailed on the technical side, but other than that, it seems legit.  Overall I like the proposal and the impact it's going to have.", "q0r": 4, "q1": "I love the fact there are plenty of linkedin profiles links and verifiable information of all the team members. That brings the credability for this project way up. There are know number of team members as well as a required skilset in order to get the job done. The budget is more or less clear, although as a developer I find it strange that the hourly rate for all different types of jobs is the same. It seems a bit strange, but if that's the way they want to go, that's their perogative. There's a realistic timetable to do the described work, so no worries there. There's a very concrete and detailed plan for implementation - kudos for that.  The technical aspects of the project could have been a bit more detailed, because as a developer I like to dig in, but I can appreciate not all projects want to be open sources so that's understandable.  I really respect the fact the project will build on top of open source projects, because that's the way to go IMHO. Overall I think the proposal is feasible.", "q1r": 5, "q2": "I have my doubts about the tracability of the project because no channels like telegram or discord were mentioned. I really didn't see how would a regular comunity member be able to follow along with the progress of the project. The metrics are a bit lacking, but there is some definition of success. The roadmap could be a bit more detailed, but it's good enough to understand the milestones of the project.  There's a clear and understandable problem, but the author of the proposal could have done a better job explaining the solutuion, because it assumes the voter and all readers will have prior knowledge of a lot of technical terms.   When you're writing a proposal it really helps to put yourself in the shoes of the voter. Overall I don’t think I have enough information to know if the project is auditable or not.", "q2r": 3, "assessor": "z_assessor_536", "no_vca": 21, "ne": 8, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "The proposal wants to create tools and framework for a  particular programming languages to ensure a secured and auditable smart contract and also a marketplace to mint and trade NFTs. This is a great idea and within the challenge setting and brief. This proposal is definitely poised to onboard new developers and expand the usage of Dapps ecosystem.", "q0r": 5, "q1": "The team is well qualified and experienced to champion this project and considering the indepth details, budget analysis and Roadmaps, am convinced that this proposal will be successfully implemented. Also, NFT-DAO has proven itself to be a reliable and credible team to handle this project.", "q1r": 5, "q2": "There were no specific KPIs and success metrics provided however the roadmap contains relevant metrics to assess the progress of the proposal if eventually funded", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 24, "ne": 2, "ng": 17, "nfo": 5, "vca_o": 1}], "solution": "MuKn.io/Glowと提携することで、インフラストラクチャーのコントラクトの構築を迅速に、簡単に書けるようにし、開発者を登用するための監査を行っています。", "experience": "MuKn.io/Glowは、サイバーセキュリティ、暗号、分散システム、システムプログラミング、経済モデルとメカニズムデザインのスキルを持っています。"}