{"id": 382508, "author": "lloydduhon", "title": "Urban Farmer dApp", "url": "https://cardano.ideascale.com/a/dtd/382508-48088", "category": 26240, "amount": 5000, "description": "食糧不安は世界的な危機です。サプライチェーンの問題は、この問題をより深刻にしています。", "funded": 1, "upvotes": 59049776, "downvotes": 10917224, "votes_result": 48132552, "votes_cast": 214, "f6_no_assessments": 3, "f6_rating": 3.888888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "このアイデアは、課題の目的に沿った、非常に現代的で適切なものだと思いました。食品業界は世界最大級の規模と収益性を誇っていますが、そのために誰もが公平に食料を入手できるわけではありません。多国籍のスーパーマーケット・チェーンが選択する価格と入手のしやすさ、さらには防腐剤や肥料を使った不快な食品の消費（野菜や果物の場合）によって、人口が規定されていることが多いのです。このような状況から、食料へのアクセスを多様化する必要があり、その方法のひとつとして、小規模生産者が挙げられます。例えば、地元の生産者によるオーガニックフェアの開催や、フードデザインをテーマにしたInstagramのプロフィール、場所を変えて毎週開催されるストリートフェアなどのプロジェクトなど、こうした取り組みはすでに実現しています。生産者と消費者の橋渡しをするDappを持つことは、Cardanoのブロックチェーン技術をこのような産業に関与させ、それを奨励する良いアイデアです。著者がDappでどのような活動が見られるのかを詳細に説明し、どのように機能するのか、またこのプロジェクトがどのようにCardanoのエコシステムに利益をもたらすのかについて、より正確な見解を示しているのは好ましいことです。私の理解では、将来的にADAを使っていくつかの支払いが行われ、その活動を遂行するためにブロックチェーンが使用されることになりますが、しかし、この橋は私にとってまだ少し抽象的でした。Dappがブロックチェーンにどのようなメリットをもたらすのか、あまり明確な説明がなかったように思います。ですから、素晴らしいアイデアだと思いますが、カルダノとの関係をさらに細分化して、このプロジェクトがチャレンジの目的をどのように満たすのか、より深い理解を促すことができたのではないでしょうか。", "q0r": 1, "q1": "行動計画」の部分では、開発すべき活動をより深く理解することができます。彼らは、行うべきそれぞれのことをよく説明し、その順序を決定します。そして、「スクリプトとマイルストーン」の部分では、これらの行動が統合され、時間的な概念に関連づけられ、理解された情報がより正確でモニタリング可能なものになります（次のトピックでコメントします）。チームについては、ペアで構成されていますが、彼らが誰であるかについての詳細は不明です。彼らの主な専門分野と、片方が25年の経験を持つその道のスペシャリストであることはわかっています。しかし、誰が何をしたのかがわかっていて、提案書の中に彼らのキャリアをより深く説明するセクションがあれば、より良いでしょうし、さらに重要なのは、これらの人々がブロックチェーンのカルダノにどのように報告するのかということです。つまり、例えば、著者がコミュニティでどのように出会い、どのように行動したかを説明してくれれば重要であり、この考えはここで明らかになりました。また、要求されたお金については、他の提案に比べて本当に少額で、プロジェクトとしては正当化されていますが、より詳細な説明が必要です。例えば、デザインの部分では、何人かの大学生が作業をすると言われていますが、何人なのか？また、それぞれの価値観はどのようなものなのでしょうか？提示された情報は、理解を深めるためのものですが、あまり深いものではありません。", "q1r": 4, "q2": "ここでは、監査可能性を行使する2つの方法があります。1つはアクションプランの詳細で、著者は非常に詳細な方法で活動内容を提示しており、約束したことが実際にきちんと行われるかどうかを監視することができます。いくつかの結果は、「主要業績評価指標」の部分にも示されていますが、これらの指標は、2022年7月までに期待される結果、2022年末までに期待される結果、2023年末までに期待される結果というように、非常に長い時間をカバーしています。例えば、月ごと、あるいは隔月ごとに目標を設定すれば、私たちが活動をモニターすることが可能になります。半年間というのは、正確なモニタリングができない期間です。したがって、筆者がアクションプランで提示した間接的な手段によって、監査可能性を促進する方が容易であると思います、重要な指標はより詳細になるでしょう。また、このプロジェクトの監査可能性は、著者の情報をコミュニティに常に提供することで実現できると思います。これは、Catalyst Swarmグループが推進するAfter Townhallのいくつかの部屋で行うことができます。", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 18, "ne": 10, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "This dApp addresses challenge objects directly because it will provide high value for small farmers and consumers.  In the growing market of micro urban farms, this app, once completely developed, could attract new cardano users and increase transactions on the network.  Success looks like small farms using the Cardano Blockchain, tokens, and DAOs to manage farm operations such as initial set up (system construction, specific crop instructions), collection of environmental data and IOT sensors - I feel this will be a common app in the near future because of the issues noted in the proposal and in the \"Sustainable agriculture - EMURGO Trace\"  program.\r\n\r\nAs a microgreen farmer myself, I understand the problem for small farms to access markets and get started.  Additionally, small, urban farmers are (in my opinion) likely to be tech savvy, early adopters, highly connected to multiple networks.  The consumers / buyers are likely to be influencers and trend-setters, as well.  The proposed application will satisfy the challenge by attracting new users to the platform.  ", "q0r": 5, "q1": "This proposal is likely to be a success because the Wife and Husband team are an established small farm (see the website), have technical skills (see the linkedIn profile), have a collaborative mindset (see comments section and work with local university students).  Because they have a real need, have the skills and are willing to collaborate and learn, this app can be built.  I have no doubt it an app like this will be built soon.   \r\n\r\nMy concern is that the plan is too wide or unfocused and that  risks and potential problems are not addressed.  It is an early stage plan and I expect it will be iterated and revised.  It's not immediately clear from the plan what deliverables will be during this round and what are future intentions.  For instance, the last Key Performance Indicator concerning a DAO is not within the scope of this proposal (It's awesome, but not appropriate in this section).  And the budget breakdown could be more detailed. More details and clarity in the roadmap and milestones would build trust in successful completion.   ", "q1r": 4, "q2": "At this stage, the plan is barely sufficient concerning auditability.  The roadmap and milestones are in place, but could be more clear and focused.  More details about Hydra, Machine Learning (ML) and centralized AWS (Amazon Web Services) would improve this plan.  It does meet the challenge very well, but risks are not specifically mentioned.  The risks include lack of awareness and adoption:  How do people discover the app?  How and why do they stop what they are doing now and do something new?  Will getting 10 new farms onboarded next summer be difficult?  and then 30 new farms (5 per month for 6 months)?  It seems a monumental and audacious task for the funds requested. \r\n\r\nI love audacious tasks - that's what our community is about.  Proposers, please be encouraged and, and voters, please consider this impactful and fledgling proposal carefully.   ", "q2r": 4, "assessor": "z_assessor_56", "no_vca": 16, "ne": 8, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "A very well presented proposal with a great idea. If this app works it could also get a lot of people to start an urban farm as a means to  provide for their families alleviating unemployment, while providing fresh produce to clients. This Dapp will increase adoption of Cardano, and will have a positive impact on the Cardano Ecosystem. The KpI's are in line with that of the Challenge.", "q0r": 5, "q1": "The proposers have the necessary skills and a LinkedIn profile is given that shows their experience, skills and education. The budget is outlined and very reasonable. A detailed action plan sets out how they plan to roll out the project. They will make use of a local design college's students to help implement the UX/UI. KPI's are laid out well, as well as a road map with milestones. I do not see Risks discussed in the proposal. All the skills required is also listed.", "q1r": 4, "q2": "This proposal does include a road map with mile stones and KPI's, that can be used to quantify the success of the proposal. The proposer does not indicate how the community can follow progress of the project.", "q2r": 4, "assessor": "z_assessor_795", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "都市部の小規模農場の運営・拡大を支援するとともに、地域住民が農場に農産物を注文しやすくするためのdAppを開発します。", "experience": "Living Greens Urban Farmのオーナー/オペレーター。  \nIT業界で25年の経験を持ち、CTOレベルの経験を持つ。  \nCardano Plutus Pioneer 2nd Cohort。"}