{"id": 383590, "author": "taki183", "title": "Integration in Trustee Wallet", "url": "https://cardano.ideascale.com/a/dtd/383590-48088", "category": 26240, "amount": 45000, "description": "カルダノを使うためには、ユーザーはADAに関する多くの情報を勉強し、さまざまなアプリケーションを使用しなければならず、便利ではなく大変です。", "funded": 1, "upvotes": 27071993, "downvotes": 15871321, "votes_result": 11200672, "votes_cast": 166, "f6_no_assessments": 5, "f6_rating": 3.9333333333333327, "videos": ["https://www.youtube.com/watch?v=TpMZGtgk9Q4&start=1965"], "media": [], "f6_assessments": [{"q0": "私はこの提案が好きですし、これが「Dapps and integrations」のカテゴリーに属することに同意します。しかし、一般的には、問題文と解決策をもっと詳しく説明することができたのではないかと思います。\r\n\r\n問題文の「カルダノを使うためには、ユーザーは多くの情報を勉強しなければならない」 - これは正しいとは思えませんし、「カルダノを使う」という言葉の意味も理解できません - 私の意見では、このような言葉は一般ユーザーにとっては曖昧で不明瞭です。代替案としては、「adaを使う（売る／買う／貯める）ためには、新規ユーザーは、取引所でアカウントを作成したり、KYCを行ったり、adaを使って何らかの取引ができるようにテレグラムチャンネルで話したりと、多くの苦痛を経験しなければならず、それは便利ではなく難しい」というものが考えられます。\r\n\r\n提案されている解決策は、Trustee Walletを使用し、ユーザーが必要な操作をすべてアプリ内で行えるようにすることを述べています。必要な操作とは？\r\n\r\n私の考えでは、提案書は、提案者が読者に提案者と同じ知識を持っていると仮定しないように、あるいは読者が提案者の頭の中を覗けるように書くべきだと思います :)\r\n\r\nそのため、改善の余地があると思われるので、満点にはしません。とはいえ、CAとしては、この提案が言いたいことを理解していたので、賛成です。", "q0r": 4, "q1": "チームの経験は非常に優れており、彼らはtrustee walletの作成者です。githubの活動は健全で、コードはオープンソースであり、これは常にcardanoのビジョンと一致しています。\r\n\r\nさらに、チームはタイムラインに関して非常に短い計画を提示しており、将来の資金調達で拡張を続けるために、一般的にこの統合を早急に実現したいと考えていることに好感が持てます。\r\n\r\n2022年2月の予算内訳は、少し高めに設定されています。そのため、個人的には、2週間＋2週間の作業に何人の開発者（時給）を想定しているのかを知ることができたら良かったと思います。金額が少し高めなので、この情報を提示してもらえると助かります。\r\n\r\nとはいえ、製品はすでに機能しており、他の暗号通貨も統合されていますので、この提案が所定の期間内に成功裏に実施されることを確信しています。", "q1r": 5, "q2": "チームは提案実施のためのロードマップを提示しており、この実施のためのタイムラインは2ヶ月であるため、その進捗状況をコミュニティが容易に把握できることに強く同意します。\r\n\r\nまた、チームはそれぞれの実装活動を2週間のタイムフレームに分割していますが、これは（私自身が2週間のスプリントとアジャイル作業の経験者であることから）常に良い兆候であり、コミュニティがより短いタイムフレームで進捗を監査するのに良い能力を与えてくれています。\r\n\r\n言及されているKPIは、ウォレットのダウンロード数が多く（10万以上）、通常はこの数に達するとダウンロード数が急増するので信頼できます。ですから、この提案が成功するかどうかの監査可能性は非常に高いと確信しています。", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This proposal is a great and complex implementation that could improve adoption and usability on cardano blockchain,  beacuse Wallet app is a huge pain on all newbie ADA holders. The proposal articulates how it will add value to the Cardano ecosystem and for the stakeholders (in deep detail for users, professional and so on.. ).\r\nAt the same time the statement of how problem is to be solved is only specified with implementation and not throught business case that support economic model (eg. revenues of the tax service provider, cost related to the service,…).\r\nHowever the objective of the proposal is interesting, but I think it's important to improve details about the solution for the challenge (eg. with business case support) and functionalities (eg. Staking function).", "q0r": 4, "q1": "The proposer team is very well skilled about the whole context and, knows the Cardano community very well because they work as developers and there is a functional pilot (https://trusteeglobal.com/).\r\nThe scope of the solution is well explained (e.g. how the funds will be spent, what features will be implemented, and so on…).\r\nIn my opinion (I'm 20 years experienced senior information manager on financial sectors) the budget requested is coherent with the elapsed.", "q1r": 4, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, but no  KPI metrics are shown. I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…) The proposal offers a realistic timetable to complete the work and coherent budget with this challenge. I miss in this area that the proposer has not mentioned possible difficulties and market competitor.", "q2r": 4, "assessor": "z_assessor_114", "no_vca": 29, "ne": 4, "ng": 14, "nfo": 11, "vca_o": 1}, {"q0": "The problem statement chosen address on the fact that to use cardano and based services the end user has to look into multiple sources and applications which can be tedious process and the proposal address it by making a universal all in one app with features to access all the functionalities in one place. The provide a blend of multiple functionalities to manage the cryptocurrencies.", "q0r": 4, "q1": "The proposer attending to comments on proposal (kudos!!) has put in informtion regarding details about the team who will be working to bring the project to reality. and have a number of highly experinced resources  with prior experinec in successfully developing and commercialising similar projects. These details and experince would be sufficient to successfully implement the proposed project.", "q1r": 4, "q2": "The proposal holds details regarding roadmap and realistic timeline of implemntation phases of the project and also the have well defined pre determined set of required and will be implemnted features. They have also mentioned the fund breakdown for reources and corresponding work pieces which would be great measure for auditing the progress and release of funcds monitoring the success of the proposal implementation", "q2r": 5, "assessor": "z_assessor_16", "no_vca": 20, "ne": 4, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "In this proposal, the emphasis is more on the project itself than on the Cardano ecosystem. The team clearly points out the problem and offers an adequate solution. This project has a positive impact on the Cardano ecosystem but it would be good if it was explained in more detail how it will add value to the Cardano and Catalyst ecosystem? KPIs indicated in the proposal are not clearly presented but in the description of the roadmap we can see that if the set goals would be achived then KPIs will match the ones indicated in the challenge. The proposal is not able to scale and address future challenges.", "q0r": 3, "q1": "The team states in the proposal how many people will work on this project and transparently via LinkedIn and Github shows the work done so far and the skills, knowledge and experience needed to implement this project. The budget is presented but not realistic. It would be good to specify the hourly rate and fee per hour to get a clearer insight into the budget allocation. The budget is divided into identifiable items but it's not realistic. In my opinion, the team is asking for too much money, considering that the budget of the challenge is limited. It would be good if the team has presented a detailed implementing plan and details of actionable tasks and order of execution to clarify the whole preparation and implementation of this project. The team states the real time within this project could be completed. It would be good if the team has presented the necessary resources to implement this proposal. The proposal explains the technical aspects and technologies required for implementation. It would be great if the team worked out and presented the possible risks, especially when larger funds are required.\r\n\r\n", "q1r": 3, "q2": "Proposal has clear roadmap with dates and a time frame within the project will be completed. KPIs are not clearly explained but we can find measures in the roadmap that can scale the success of this project. The community could through great effort track the development of the project.", "q2r": 2, "assessor": "z_assessor_656", "no_vca": 16, "ne": 4, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "Integrating Cardano through easy access to ADA and CNFTs into an already well established and easy to use mobile app could prove to be a boon for the entire ecosystem by helping it reach more casual crypto users and investors. \r\nAlthough the assumption that \"a user has to study a lot of information about ADA and use many different applications\" is a bit of an exaggeration, for example, one can set up a new wallet in Yoroy, CCVault or Nami, transfer funds from an exchange and purchase CNFTs in a matter of minutes.\r\nStill, more good option is always a positive, especially when they also come with exposure to new markets and users.", "q0r": 4, "q1": "Given that we're talking about integrating Cardano into an already existent and polished app, I see very little risk associated with the work actually getting done if the proposer gets funded. The proposers have provided adequate information about their background, and the work they have already done is proof of their competency. The roadmap presented is clear and feasible. The budget estimations are a bit high for some of the tasks, but ultimately everyone is entitled to ask what they feel their work is worth and is up to the community to decide by voting if they want to invest in the project.", "q1r": 4, "q2": "The KPI given are not very clear and would not necessarily aid in the auditing process in the short term, I assume the meaning of KPIs was a bit misunderstood by the proposers.\r\nHowever, given the very clear and straightforward nature of the roadmap, the progress of the project would be easy to monitor and audit.", "q2r": 4, "assessor": "z_assessor_681", "no_vca": 13, "ne": 2, "ng": 10, "nfo": 1, "vca_o": 1}], "solution": "この問題は、ユーザーが必要な操作を1つのアプリで行うことができる「Trustee Wallet https://trusteeglobal.com」で解決できます。", "experience": "10年以上の経験を持つフルスタック開発者およびアーキテクト\nスキルJS/React Native/Postgresql/Kafka + Bitcoin/Ethereumの低レベルコーディング"}