{"id": 383736, "author": "itakademia", "title": "Cardano Smart Students DApp", "url": "https://cardano.ideascale.com/a/dtd/383736-48088", "category": 26240, "amount": 80000, "description": "IT分野の教育やヨーロッパのディプロマは、世界中の学生にとって手の届くものでなければなりません。しかし、それは高価で、ほとんど手が届きません。", "funded": 1, "upvotes": 28614008, "downvotes": 16286049, "votes_result": 12327959, "votes_cast": 191, "f6_no_assessments": 9, "f6_rating": 3.814814814814815, "videos": [], "media": [], "f6_assessments": [{"q0": "私のコミュニティ・アドバイザーとしての経験の中で、この提案は今まで出会った中で最も野心的な提案の一つかもしれません。私の理解では、この提案は、教育プラットフォーム（Smart Student dApp）を作ることを目的としています。大学や学校と提携して、ブロックチェーン上で、カルダノを使って。この提案が意図した通りに成功すれば、他の国のように多くの特権を持っていない遠隔地の人々にとって、大きな資産となるでしょう。  また、チームがいくつかの大学とのコラボレーションを開始することができれば、カルダノのエコシステムに真の意味でのゲームチェンジャーとなります。何十万人ものユーザーを獲得できる可能性があります。教育者として、また研究者として、大学と競争するのではなく、提携することが正しい道だと信じています。問題文はわかりやすく提示されており、問題に対する解決策は問題文と課題設定の両方に相関しています。このプロジェクトが国庫の有効活用になるかどうかは、プロジェクトが適切にスケールアップできるかどうかにかかっています。このプロジェクトは非常に野心的で、短期間で多くのことを行うことを目的としていますが、提案書には長期的な投資であり、より長い将来のための開発であることも明確に書かれています。このプロジェクトの可用性と共同作業のアイデアは、この提案の最も強い特徴のひとつであり、正しく販売されるのであれば、非常に望ましいものだと言えるでしょう。この提案書を何度も熟読してみると、チームがカルダノを単なる足がかりとしてではなく、開発の大きな部分として含めることを目指していることがわかります。\r\n全体として、この提案がこの課題を効果的に解決するものであることに強く同意します。", "q0r": 5, "q1": "提案書には、プロジェクトを構成する基本理念、理由、アイデアに加えて、Smart Student dAppが開発のさまざまな段階でどのように機能するかについての詳細が記載されており、多くの有用な情報が提供されています。ヨーロッパの教育機関と学生を結びつけ、ヨーロッパ以外の人々にも提供するというアイデアは、非常に大きな課題ですが、提案書には、チームがどのようにそれを実現しようとしているのかが詳細に記されています。プロジェクトの大きな範囲に対処するために、チームはプラットフォームが変更可能でスケーラブルであることを保証するために、いくつかの優れたソリューション（モジュール、ステージ、AIの使用）を提供することに成功していると私は考えています。このプラットフォームが5年前から開発されている（カルダノブロックチェーンとは統合されていないが存在している）という事実は、このプロジェクトの範囲を考えると非常に有望です。提案書には、予算の内訳と、多額の資金を要求する根拠が記載されています。予算と提案書全体をより明確にするために、予算にはより詳細な情報を記載していただきたいと思いました。例えば、プラットフォームの設計には週に何時間かかるのか、設計チームには何人が含まれるのか。また、モバイルアプリの開発には何人の開発者が携わり、同じ時給で働くのか。予算には全部で何人が含まれているのでしょうか？そして、チームといえば。提案の実現可能性と透明性を高めるために、コアチームのリンクと、プロジェクトの開発に関連する彼らの専門知識と能力を示した短いプレゼンテーションがあれば、提案は非常に強化されます。また、コアメンバーのLinkedInプロフィールや、提携している大学、さらには以前の仕事の証拠となる資料なども必要です。コメント欄にあるように、提案者が主張するアプリケーションの開発前の進捗状況を共有することで、大きな違いが生まれます。長期的な視野に立った詳細な計画が提示されていますが（将来のCatalystファンドへの申請を目指しているかどうかも提案書で明確にした方が分かりやすいかもしれません）、誰が背後にいるのかという情報がもっとあれば有益です。\r\n以上のことから、この提案が成功する可能性は高いと考えています。", "q1r": 4, "q2": "このプロジェクトを発展させていく上での潜在的な課題に関する短いセクションが含まれていれば、この提案に大きなメリットがあるでしょう。例えば、（コメント欄で指摘されているように）このプロジェクトは、EU政府から正式な認定を受けたディプロマや、EU規格の品質スタンプのようなものを受け取ることを目指しているのでしょうか？チームはその目標をどのように達成しようとしているのでしょうか？\r\nロードマップには、最大9ヶ月間の推定期間が記載されています。さらに、非常に野心的ではありますが、非常に包括的なKPI（重要業績評価指標）のリストが用意されています。マーケティングがうまくいけば、1年以内に1,000人の生徒と50の教育機関が登録されることも可能です。チームは、プラットフォームに評価システムを組み込むことを目指していますが（学生や教師のためのカスタマイズ性などを考慮して）、これと教育機関とのコラボレーションは、必要とされる「追加の監査」、つまりコミュニティがプラットフォームの開発をフォローする方法を提供します。素晴らしい点は、開発の最終段階において、カルダノコミュニティがテストプロセスに参加することをチームが特に求めていることです。私がコミュニティ・アドバイザーとして活動してきた間（そして数々の評価を受けてきた間）、このような招待は一度も見たことがなく、この提案を高く評価しています。全体的に見て、この提案は、その規定された目標の達成状況を評価するのに十分な情報を提供していることに強く同意します。", "q2r": 5, "assessor": "z_assessor_349", "no_vca": 18, "ne": 12, "ng": 5, "nfo": 1, "vca_o": 2, "reply": "Here are some educational institutions interested in Cardano Smart Students DApp: https://gikn.eu/ ; https://collegeomega.com/ and a project of the International Higher School of Informatics and E-Leadership, Plovdiv, Bulgaria (in process of accreditation). We have presented the Smart Students DApp project to some other universities and we hope it will be accepted."}, {"q0": "提案者は、オープンソースのオンライン学習プラットフォームを計画しており、EUと連携して、条件を満たせばユーザーに「欧州の卒業証書」を提供するとしています。この提案は、dappになるので、課題設定に合っています。このアプリケーションのユーザーには付加価値があることは明らかですし、もし実装されれば、カルダノコミュニティやその他の地域にも大きな影響を与えるでしょう。そうは言っても、この提案には以下のようないくつかの懸念事項があります（前述の支払いの欠如）。また、スケーリングについてもよくわかりません。この提案を実現するために必要なすべての作業をチームが管理できると思わせるだけの詳細が提供されていません。この提案は非常に幅広く、多くの可動部分があり、私にとってはその不安を解消するような詳細が提案書にはありません。  開発者としては、なぜAPIが用意されていて、管理パネルやすべてのリソースや関係性を維持するために必要なアーキテクチャを備えたプラットフォームを再利用するのではなく、自分たちの内部で使用するためにプラットフォームを変換したいのかが疑問です。ただ、もっと簡単な方法で到達できる結果に対して、あまりにも労力がかかりすぎているように思えます。", "q0r": 4, "q1": "残念ながら、「Akademia JSC」のスキルセットやチームメンバーを示す証拠は見つからなかったので、この点については検証できません。特定のチームメンバーについても言及されておらず、ただ漠然と、このようなプラットフォームを実装するためには1000時間以上、あるいはその2、3倍の時間が必要だと考えられています。開発者としては、提案者が調査を行ったと言っているのに、この見積もりには非常に不満があります。調査が行われたにもかかわらず、どうしてこのようなことが起こるのか理解できません。Khan Academyと同じような学習用のオープンソースのプラットフォームはたくさんありますし、著者は社内のツールを再利用するのではなく、ブロックチェーンの実装を行えばよいのです。私の経験から言うと、大きなコミュニティを持つオープンソースのプラットフォームを再利用する方が、長い目で見ればずっと安くて良いと思います。予算が記載されており、その内訳も記載されていますが、数字の裏には根拠がありません。提案書には、管理パネルに40,000ドル、モバイルアプリの開発に15,000ドルと書かれています。私はアンドロイド開発者として4年の経験がありますが、この規模のアプリに15,000ドルでは無理だと断言できます。私は3-4の管理パネルを作ったことがありますが、モバイルアプリケーションよりも難しいことはないと断言できます。このことは、すでに管理パネルが完成しているオープンソースのプラットフォームを再利用することについての私の先ほどの指摘につながります。前述の理由から、私はこのスケジュールは不可能だと思います。私は著者に、この提案をいくつかの小さな提案に分割し、次の資金調達ラウンドで段階的に取り組んでいくことを提案します。マーケティングの予算が2万ドルというのは、その根拠や調査結果が示されていないのでおかしいと思います。現状では、使用するプラットフォームや代理店についての言及がないため、2万ドルでいいのか、1万ドルでは多すぎるのかわかりません。この提案を実現するために必要なリソースについては言及されていますが、いずれも詳細は不明です。技術的なことが書かれていないのは残念ですが、提案者を責めることはできませんし、そのことを理由に減点することはありません。提案者は、この提案を妨げる可能性のある関連するリスクについて、もっと考えることができるのではないでしょうか。EUがあなたのプラットフォームとの提携を望んでいない場合は？  全体的に見て、この提案がうまく実行されるとは思えません。実現可能とは思えないからです。私の意見を参考にして、次の資金調達ラウンドではより小さな提案をしてくれることを期待しています。", "q1r": 2, "q2": "このプロジェクトの進捗状況を簡単に把握する方法はないようです。フィードバックについて最初に言及しているのは、プラットフォームを普及させるためのマーケティングキャンペーンが行われる9ヶ月目ですが、それ以前にコミュニティからフィードバックを得ることについては何も言及されていません。KPIと指標は妥当なものですが、ここでもコミュニティの検証可能性についての言及はありません。  このプロジェクトは良いアイデアであり、説明は十分に簡潔で理解しやすいものですが、ソリューションの説明にはもう少し工夫が必要です。  私は提案者に、プロジェクトの実施とその進捗をフォローして助けたいと思っているコミュニティのメンバーの目で見ることを提案します。次の提案が行われるときに、その人のことを念頭に置いておけば、IMOの品質は大きく向上するでしょう。全体的には良いアイデアであり、次の資金調達ラウンドでの幸運を祈っています。", "q2r": 2, "assessor": "z_assessor_536", "no_vca": 29, "ne": 20, "ng": 7, "nfo": 2, "vca_o": 2}, {"q0": "教師であり、アカデミーの元共同創設者であり、Catalystエコシステムの活発なメンバーである私は、提案が課題の目的に沿っていることに同意します。彼らはシステム内でCardanoブロックチェーンを使用することを目的としており、最終的にはブロックチェーンを使用してより多くのトランザクションとインタラクションをもたらします。\nしかし、この提案を本当の意味で整合させるためには、ブロックチェーンがどのように、何のために使われるのかをもう少し詳しく説明した方が良かったと思います。", "q0r": 4, "q1": "この提案を行うグループがいくつか特定されていて、教育関連のビジネスがすでに行われていることが言及されているにもかかわらず、提案書の中にはリンクや参照先、さらには経験についての詳細は書かれていませんでした。今回提案されているLMSシステムは、既存のものをベースに強化されていますが、参照先やリンク、詳細は一切提供されていません。提案されているスケジュールは、8ヶ月（設計に2ヶ月、Web/APIとモバイルアプリの開発に6ヶ月）と作業時間が多く、製品の数回の反復には妥当だと思われますが、最初のMVPに労力を割いた方が、要求金額もリスクも少なく、コミュニティで最初に検証することができたのではないかと思います。\n要求された予算は、提案者がすでに投資した資金（8万ドルの投資）に合わせたもののようで、配分の詳細は提供されましたが、チームがどのように構成されるのか、UX/UIや開発者は何人いるのか、チームリーダーはいるのか、などについては示されていません。提案者の各グループがどれだけ関与するのか...。\n予算内訳の詳細は提供されており、提示された期間に対して妥当と思われますが（デザイン2ヶ月で5,000ドル、開発6ヶ月で40,000ドル）、労働力が詳細に記載されていないため、この見積もりをさらに評価することはできません。\nリスクや軽減策は提示されていませんが、このプロジェクトは約1年続くプロジェクトであるため、プロジェクトの成功のために考慮すべきです。", "q1r": 2, "q2": "また、プロジェクトに必要なチームや労力の詳細が記載されていないため、コミュニティがプロジェクトの進捗や資金の使用状況を把握することは非常に困難です。\nプロジェクトに投票した場合、提案者チームが最初に取り組むべきことは、各ステップで必要とされる専門家の役割と人数、プロジェクトの中間的な成果物とマイルストーンを含む詳細な計画であり、それによって適切な監査が行われ、適切な資金調達のタイムラインが合意されることになります。", "q2r": 2, "assessor": "z_assessor_288", "no_vca": 29, "ne": 16, "ng": 12, "nfo": 1, "vca_o": 2}, {"q0": "提案書のプレゼンテーションでは、Dappがどのように機能するのか、少し混乱しました。最初に理解したのは、このプロジェクトは、Cardano Smart StudentsというDappを通じて、IT分野におけるヨーロッパの学位を生成することを目的としているということです。しかし、やや不明だったのは、そのような学位がどこで生成されるのかということでした。ヨーロッパの大学がオンラインで、Dappとある種のパートナーシップを結び、Dappを通じて学位を取得できるようにするのだろうか。抜粋すると、「このプロジェクトは、\"ブリック（建物）\"から \"バーチャル電子大学（VeU）\"への進化を表しています。\"バーチャル電子大学 \"とは、Cardano Smart Students Dappの学習プロセスをモデル化したウェブベースの環境のことです。このVirtual Electronic Universityは、Dappを受け入れる大学を代表しているのでしょうか、それとも1つの機関なのでしょうか。獲得したユーザー」の項では初年度に1,000人の学生が登録し、50の教育機関がプラットフォームに登録」というKPIの部分では、複数の大学がシステムを採用するケースであることがより明らかになっています。しかし、これについてはもっと明確に説明してほしいと思っています。しかし、物事の理論を考えてみると、Cardanoブロックチェーンをベースに学位を生成するDappを作ることで、我々のブロックチェーンへの情報の保存量を増やすことができ、チャレンジの目的をよく達成している提案だと思います。また、提案者が主張するように、経済的な理由や官僚的な理由で、ヨーロッパに移住して勉強する余裕がない学生にとっても、非常にプラスになるでしょう。もう1つの意見は、提案者が、学生がこのDappを使用する際のコストをより詳細に説明してくれると面白いと思います。獲得」のトピックでは、提案者は、あるものは無料（ダウンロード、購読など）で、あるものは有料（学生が特定の教育プログラムに参加したとき）であると説明しています。しかし、どのくらいの金額のことを言っているのだろうか？トークンを使った支払いは誰が受け取るのでしょうか？インパクトについての私の結論は、「問題化は明確であり、解決策も明確である」ということです。しかし、このプロジェクトの具体的な内容は少し混乱しているため、その影響がCardanoのエコシステムにとって非常にポジティブなものかどうかを理解することはできません。", "q0r": 4, "q1": "残念ながら、関与しているチームであるIt Akademia JSCは、自分たちが何者であるかについてほとんど情報を持っていません。彼らは、プロジェクトの適切な開発のために必要な知識を持っていると主張しています：オンラインとブロックチェーンとITプラットフォームの開発です。しかし、これは単なる要約にすぎません。誰がこのチームを構成しているのか、それぞれの役割は何なのか、このプロジェクトにどのように貢献するのか、もっと深く理解する必要があります。彼らが技術的に非の打ち所のない方法で何をしようとしているかを説明してくれたとしても、実践的なデモンストレーションは常に歓迎されるものだからです。提案者は、このプロジェクトはゼロから始めるものではなく、すでにオンラインプラットフォームの開発経験があると主張していますので、そのようなものを見てみたいと思います。また、チームの中で誰が私たちのブロックチェーンとの統合を担当するのか、そのバックグラウンドは何か、すでにCardanoでの作業経験があるのか、などを理解することも非常に重要です。スクリプトに関しては、良い情報が揃っているので、どのように実行されるのかを大まかに理解することができると思います。しかし、その説明があまりにも包括的すぎるのです。例えば、プロジェクトの最初に、彼らはインターフェイスを作るために2ヶ月を捧げ、基本的にUI/UXデザインを設計します。しかし、1ヶ月目と2ヶ月目には何が起こるのでしょうか？誰がここで働くのか、どんな仕事をするのか。同じように、次のステップでは、もっと具体的に書いてもいいと思います。そうすれば、より具体的にプロセスを把握することができます。資金調達については、高額ではありますが、プロジェクトの複雑さを考えれば納得できます。しかし、ここでももう少し詳細な説明が必要だと思います。例えば、マーケティング費用として2万円を要求していますが、なぜこの金額なのか、広告戦略はどのように与えられるのか、などの説明がありません。これをマイナーで理解することが重要でしょう。全体的に、スクリプトと予算の部分は良いのですが（もっと細かくても良いのですが）、チームのプレゼンテーションの部分には何か物足りなさを感じます。", "q1r": 3, "q2": "KPIの定義は素晴らしい。提案者が何を期待するかについて多くの情報を提供してくれるので、非常に堅実な方法でプロジェクトの成果をモニタリングする可能性が広がります。定量的なデータと定性的なデータの両方が提供されています。Dappに登録された学生や教育機関の数を示すデータもあれば、ネットワークの安定性やサービスの質を示すデータもあります（提案者は次のように述べています）。「カルダノエコシステムの信頼性、信用、安全性、効率性」）です。これらは非常に多様で公平なモニタリング方法であると考えています。さらに、提供されているロードマップを通じて、活動がどのように展開しているか、物事のプロセスという意味で、プロジェクトの進捗を追うことも可能です。繰り返しになりますが、スクリプトがもっと詳しければ、このようなモニタリングはもっとうまくできるはずです。プロジェクトのためのコミュニティのモニタリングを容易にするために、提案者にはこの部分をもう少し詳しく説明するようアドバイスします。月ごとのタスクと目標の定義があれば、このギャップを埋めることができるでしょう。しかし、一般的には、提供された情報をもとに、非常に監査可能な提案であると思います。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 28, "ne": 18, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "興味深いプロジェクトです。これは、世界中の多くの人々（私も含めて）が直面している問題を解決するものです。私は、イギリスの大学でエンジニアリングを学ぶために1年間留学する機会がありました（私はブラジル出身です）。そして、教授から修士課程への入学を勧められました。私はとても興奮しました。しかし、Eng.Directorと話していると、EU圏外の学生には奨学金がないと言われてしまいました。とはいえ、もしその時にこのツールを使う機会があれば、それは素晴らしいことです。しかも、少なくともここブラジルでは、パンデミックの影響で、いくつかの教育機関がオンラインベースでコースを継続しているので、タイミングとしては完璧だと思います。", "q0r": 5, "q1": "提案書は非常によくできていますが、残念ながら提案者は経験を証明するもの（リンクなど）を提示していません。\n気になった点としては、予算の説明があります。一見合理的に見えますが、内訳の直前に簡単な説明があり、\"As Cardano Smart Students Dapp is a blockchain project and it will have unique features, so the final estimate may exceed twice or more times for development of the platform. \"とあります。これは私にとって非常に不思議なことです。なぜなら、開発に必要な時間が明確になっていない予算を分解しているからです。これは、仕事の価格設定が作業時間に基づいているため、重要な指標となります。これは、仕事の価格設定が作業時間に基づいているため、重要な指標です。したがって、追加できる情報としては、実際に開発に必要な時間（近似値）です。\n理解できなかった点は、市場をいつスタートさせるのかということです。すべての広告が資金調達から始まるのか、それとも開発が完了するまで待つのか。もし後者であれば、企画書を細分化することが一つのポイントになります。課題予算の±30％を要求しているのですから、スコープを少し減らしてチャンスを増やすことができます。\nリスクマップ（競合、自社のユニ、プラットフォーム、コストなど）を追加するのも面白いでしょう。\n先ほど言及しなかった点として、コストがあります。問題提起では、EUのディプロマを取得するためのコストが高いとしていますが、誰もが取得できるようにするための戦略は何でしょうか。例）ブラジルの最低賃金は±200米ドルで、ブラジル人の90％はその3.5倍以下の収入しかない（https://economia.uol.com.br/noticias/bbc/2021/12/13/calculadora-de-renda-90-brasileiros-ganham-menos-de-r-35-mil-confira-sua-posicao-lista.htm#:~:text=A%20renda%20mensal%20m%C3%A9dia%20de,as%20fontes%202019%2C%20do%20IBGE.）。.そのため、導入の障害になる可能性があります。\nヒントこれらのエンティティ（大学）の重要な側面は、そのビジュアル・アイデンティティです。あなたはインターフェイスとして働くことになるので、アプリが大学のビジュアル・アイデンティティをプラットフォームに加えることを可能にすることが重要です。\n", "q1r": 3, "q2": "通常、KPIは数値的な指標であり、「製品力の構築」や「ネットワークの安定性」などは、もっと充実させるべきだと考えています。興味深いのは、マーケティングに関連したKPIで、多くの人を獲得しているかどうかを確認することができます。また、社会階層に関連した学生数や国別の学生数なども追加すべきで、これらの指標はアプリの目的が達成されているかどうかを確認するのに役立ちます。", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 28, "ne": 16, "ng": 11, "nfo": 1, "vca_o": 2}, {"q0": "The proposal seeks to create a DApp centred around education yet it is unclear exactly how the proposal will be linked to the Cardano ecosystem. It is difficult to determine the value this proposal will provide without a clear explanation of how it utilises blockchain technology fo its benefit, for example will there be some form of DID implementation?", "q0r": 3, "q1": "The project sets exciting and ambitious goals however without a detailed breakdown of the team and the requisite experience it is difficult to asses the feasibility of such an undertaking. Due to the large amount of requested funds a more detailed  breakdown is required.", "q1r": 3, "q2": "The project has a defined roadmap and KPIs are listed. As it is such a large undertaking it would be good to see interim metrics to measure continued success on a weekly/biweekly basis.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 12, "ne": 2, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "Providing an online Blockchain learning platform with an engaging DApps, is within the challenge brief as the project is poised to bring enormous adoption and onboarding of new members into the ecosystem.", "q0r": 5, "q1": "There is not much information about the qualification and capacity of the team to deliver on this project. However, it is clear that much thought and planning had been made couple with fact the project has been worked to some level. It is obvious that this is a proposal that might require funding beyond this funding cycle as stated and with with the budget breakdown of funds required and the articulated timelines for the project, this proposal can be effectively implemented.", "q1r": 4, "q2": "The proposal has provided enough information to assess and monitor the progress of this project. The KPI and the well detailed milestone", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 27, "ne": 0, "ng": 19, "nfo": 8, "vca_o": 1}, {"q0": "The proposal seeks to launch an online education in IT and Diploma for people all over the world who have not had opportunity to acquire IT education in Europe where IT education and Diploma is expensive and not even easy to access. The end impact is to give reliable on line educational environment for students in the world making it affordable and accessible. This is laudable. Hence my 4 star rating.", "q0r": 4, "q1": "The proposer called Akademia JCS already has experience in development of online platforms, IT education and block chain applications and are capable of implementing the project successfully. The detailed plan mentions, among others, that the education is online and will cut transportation cost; virtual E-Library, access to E-Resources, etc. bringing education closer to students all over the world. This proposal can be implemented successfully.", "q1r": 4, "q2": "The road map clearly shows 2 months, 6 months and 9 months with different schedules of work which will make auditing easy. The KPIs are also clear showing that 1,000 students are expected to be enrolled within the period; 50 educational institutions to be registered; 10,000 students and 300 additional institutions in the second year expected. All these can be measured easily. The budget is broken down with details for easy auditing. Hence my 5 star rating.", "q2r": 5, "assessor": "z_assessor_688", "no_vca": 29, "ne": 2, "ng": 23, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is a game changer and is capable of onboarding many users thereby bring value unto the cardano ecosystem. The proposal is elaborative and addresses the challenge.", "q0r": 5, "q1": "The proposer seem to posses the skill for the task. The proposer however has not provided any information about the team members who will assist in the execution of the project.  Furthermore more the budget is not so elaborative which makes it a little difficult to draw a reasonable conclusion.", "q1r": 3, "q2": "The proposer has done a great job by outlining the roadmap,  listed the KPI's and clearly stated how success will look like when the project is executed. ", "q2r": 5, "assessor": "z_assessor_420", "no_vca": 26, "ne": 1, "ng": 14, "nfo": 11, "vca_o": 1}], "solution": "IT分野のヨーロッパの卒業証書は、Smart Students DAppとそのエコシステムを通じて、Cardanoネットワークで手数料なしでオンラインで取得することができます。", "experience": "It Akademia JSCは、オンラインプラットフォーム、IT教育、ブロックチェーンアプリケーションの開発に幅広い経験を持っています。"}