{"id": 384575, "author": "jeffghome2020", "title": "StoryTime - A Writers Marketplace", "url": "https://cardano.ideascale.com/a/dtd/384575-48088", "category": 26240, "amount": 41200, "description": "作家は、自分の意見や物語の結果として、不当な扱いを受けます。彼らの自由と権利はしばしば危険にさらされています。", "funded": 0, "upvotes": 17281303, "downvotes": 16707663, "votes_result": 573640, "votes_cast": 155, "f6_no_assessments": 5, "f6_rating": 2.466666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "私の理解では、この提案は、作家が自分の作品を共有・販売するためのマーケットプレイスを作ることを目的としており、作家は匿名を選択することができますが、ブロックチェーン技術の透明性と利点を維持することができます。文化的な分野で働き、暗号通貨の分野にも関わってきましたが、芸術や文化に関連したdAppsの開発は適切に行われていないと思います。アーティストは、企業が利益のほとんどを握っていることに苦しみ、どのようなコンテンツを作るべきかについては、いまだに中間者に支配されています。この提案は、正しく実行されれば、作家が独立して作品を制作・管理できる場所を開発するための一歩となります。問題文の記述は、問題の解決策と同様に明確である。一見すると、この提案は著作者だけを対象にしたもののように見えますが、よく考えてみると、このプロジェクトは消費者とのつながりも目指しており（もちろん）、アウトリーチや採用という点ではまったく別の話になります。正しく実行されれば、将来的に規模を拡大できる可能性があり、Catalystの資金を有効に活用することができます。最良のシナリオは（提案者によると）、すべてがうまくいけば、これは最初の分散型ライブラリの1つになるでしょう。この提案が課題を効果的に解決することに同意します。", "q0r": 4, "q1": "提案者/チームは、ファンド4とファンド6で資金調達を行った経験があり、チームの信頼性と能力を物語っています。提案書には、コアチームのメンバーの能力をさらに確認するためのリンクが含まれていると有益である。これは、彼らのLinkedInプロファイルへのリンクや、チームがすでに資金を獲得しているプロポーザルへのリンクなどが考えられます。提案書には、創業者が登場するyoutubeのビデオがありますが（これはとても良いものです）、私はこの提案書に関連するもう少し詳細な情報が欲しかったです。提案書には、コアチームのメンバーの貴重な連絡先が記載されていますが、これは提案書ではほとんど見られません（コミュニティアドバイザーとしての経験から）。\r\nこの提案の資金を1年以内に返済するという記述は、このプロジェクトとコミュニティに対する高いコミットメントを物語っていますが、この資金がどこから来るのか、また1年間でどのように分配されるのかについて、より詳細な情報があるといいと思います。予算配分は非常にわかりやすく、必要な能力を持った開発者を雇用する計画が含まれており、労働時間と長い時間枠での時給の見積もりが提示されています（約2ヶ月後、フルタイムの開発者1名とパートタイムの開発者2名）。予算配分の中に、週に30時間働く創業者に支払われる部分がありますが、そのワークパッケージに何が含まれているのか、簡単な内訳を教えていただけると幸いです。マーケティングなのか、このプロジェクトだけの管理なのか、それとも他のプロジェクトなのか。もし創業者がこのプロジェクトで週30時間働くとしたら、他のプロジェクトには参加しないということでしょうか？提案の実現可能性は、dApp自体の詳細を知ることができれば、より強固なものになるでしょう。素材をアップロード・購入する以外にどのような機能があるのか？購入者は匿名で、どのように配布されるのでしょうか？また、NFTを組み込んで、どのように機能するのでしょうか？これらは「当たり前」の質問かもしれませんが、カルダノやブロックチェーン技術全般に関わる様々な経験を持つ人々に広く働きかけることを目的としているのであれば、提案書にこれらの情報が含まれていることは有益だと思います。以上の理由から、私はこの提案が成功裏に実施される可能性が高いとは思わないし、賛成もしない。", "q1r": 3, "q2": "監査可能性を明確かつ構造的な方法で測定するために、提案者はプロジェクトの開発とプロセスに関して、より詳細な情報を追加することを提案します。マイルストーンを含む明確なロードマップと、推定時間枠が含まれていれば、非常に有益である。現時点では、提案者がマーケットプレイスを作るということしかわかりませんが、著者のためのマーケットプレイスを作るにはどのようなステップが必要なのでしょうか。3ヶ月後、6ヶ月後、9ヶ月後、12ヶ月後のプロジェクトの状況は？どのようなソーシャルチャンネルでコミュニティはプロジェクトの進捗を追うことができますか？また、開発状況をモニターするために、成功の尺度（KPIやメトリクス）をいくつか含めることをお勧めします。最初の1ヶ月間、あるいは6ヶ月後にはどれくらいのユーザーが見込まれますか？私の理解が正しければ、Cardano Outreachはソーシャルメディアでかなり積極的に活動しているようですが、その計画やプロセスを提案書に含めることで、プロジェクト全体の監査可能性と透明性がさらに高まるでしょう。また、リスクや課題を説明する短い段落や、チームがそれらにどのように対処するかを説明する文章を含めることで、チームへの信頼性がさらに高まり、プロジェクトのミクロとマクロの両方の側面を多面的に見て深く理解していることを示すことができます。\r\n提供された情報の不足に基づき、私はこの提案が、提示された目標の達成状況を評価するのに十分な情報を提供しているとは思わない。", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "この提案は、非常に興味深い問題とその解決策の可能性を地域社会に提供するものであることに同意します。\r\n\r\nGoogle、facebook、twitterなどのプラットフォームと作家の視点が一致しないと、ますます統制や独占が行われるようになり、多くの作家が自分を表現することを恐れるようになっています。したがって、私の意見では、この解決策が実施されれば、初めてそのような作家に発言権を与え、自分自身を表現するだけでなく、それによって報酬を得ることができるようになります。\r\n\r\n特に、このアプリがどのように機能するのかをもう少し詳しく説明する必要があります。現在の説明は非常に抽象的なので、少なくとも高レベルの機能セットとワークフロー、または機能性の情報があればより良いでしょう。改善の余地があると思うので、星4つとさせていただきました。\r\n", "q0r": 4, "q1": "経験の観点から言えば、この提案の創設者やリーダーは十分な経験を積んでいますが、私にとっては最終的に、このソリューションを実装する開発者にかかっています。\r\n\r\n一方で、コメント欄に提案者が投稿した制限のために、チームがその詳細をここで公開するために開発者を集めることができなかったことは理解できます。しかし、それを実現している提案が他にもあることを忘れてはなりません。\r\n\r\n私にとっては、提案者がアプリから発生した料金を返済することを提案しているアイデアが気に入っています。これは、提案者がこの提案に非常にコミットしており、このアイデアの実行を開始したいと考えていることを意味しています。そのため、星4つにしたいと思いますが、いくつかの改善が必要なので、完全には同意できません。", "q1r": 4, "q2": "この提案の良い点は、アイデア提案者がカルダノコミュニティで非常に活発に活動していることであり、したがって、彼がプロジェクトのロードマップを提供するためにコミュニティに利用可能であるという信頼をコミュニティに提供しています。\r\n\r\nとはいえ、この提案が完全な評価を得るためには、多くの改善が必要であることがわかります。計画、KPI、成功指標が欠けています。成功とはどのようなものか、MVPの詳細なロードマップは何か。アイデアは抽象的で、常に開発者と一緒に座って、MVPがどのような機能を持つか、いつデプロイするか、誰が監査してフィードバックを提供するかなど、基本的な計画を考えた方が良いでしょう。\r\n\r\nつまり、このアイデアが監査され、完璧に追跡される可能性がどの程度あるのか、確信を持って言うことができないのです。", "q2r": 3, "assessor": "z_assessor_454", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "This idea is excellent! Proposer clearly presents the problem with writers and offers a clear solution. This proposal if implemented, would have a positive impact on the Cardano ecosystem and is clearly visible in the proposal on how it will add value to the Cardano ecosystem. Unfortunately, KPIs are not listed so it's hard to compare KPIs with challenge setting and proposal is not able to scale and address future challenges.\r\n\r\n", "q0r": 3, "q1": "In this proposal it is clear how the proposer is looking for developers who would realize this idea. It would be good to know who is behind this proposal. Maybe some link from a proposer via LinkedIn or a website. The bearer of the idea does not have the necessary skills and knowledge needed for the realization of this idea. But if he could find developers with experience, knowledge and the necessary skills, the project surely could be realized. The proposer clearly communicates how many developers are needed in the team and most of the requested budget that is clearly presented would go to external collaborators aka developers. The budget is reasonable and broken down into identifiable items. An additional funding is required to implement the proposal but the proposer states that they will be borne by the founder and the devs. Proposer does not specify a detailed implementable plan and details of actionable tasks and order of execution are missing. Unfortunately, there is no more detailed timetable to complete the work and the possible risks have not been elaborated. In the proposal we can find the necessary resources to implement this idea but it would be better to present them in more detail. The explanation and technical aspects and technologies required for implementation are missing.", "q1r": 2, "q2": "It would be good to have an elaborate roadmap with milestones and a time frame within which the idea would be realized. It is also necessary to present KPIs with which the success of this proposal could be measured. Unfortunately the community can't follow the development of this project in any way due to the lack of necessary data.", "q2r": 1, "assessor": "z_assessor_656", "no_vca": 16, "ne": 3, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "I find it difficult to see an app like this becoming popular at this time. \r\nThe DApps success defined as attracting users to Cardano. The service that this app aim to provide is not appealing enough compered to many other apps proposed in this challenge.\r\nThere are many platforms for publishing, and readers will not pay for more texts that in the current environment.  ", "q0r": 2, "q1": "The experience \r\n of the proposer seems legit, but there is a lack of information about the rest of the team - in the proposal it specified - \"3 Developers \r\n• Front End, Back End, UI\"\r\nBut there are no names. Is those developers are already part of the team or the plan is to recruit them later? It is not clear. ", "q1r": 3, "q2": "There are no KPIs. ", "q2r": 2, "assessor": "z_assessor_871", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The problem stated is the lack of publishing platforms for writers. I assume StoryTime would be the decentralized version of Amazon KDP publishing, instead of a blogging platform. If so, then this proposal fits the Challenge's needs and could drive more adoption. But if it's a blogging platform, then Publish0x and Steemit is already providing a solution. This proposal would benefit from having a clear statement on its unique selling point. What does safe and decentralized environment mean? Amazon KDP publishers face the risk of being taken down and their funds frozen if the subject material does not meet their requirements. Are StoryTime writers protected from this? There is also no KPI on how the success of this project can be measured. The proposal can be much stronger if these details are added.", "q0r": 2, "q1": "\r\n\r\nNot enough time is spent on the technical aspect of the proposal. The proposal has a clear idea on the manpower needed for the job, but comments seem to reveal that the developers are busy with full-time jobs until January. The team's linkedin/github profiles should be shared to add credibility to the proposal. The dev cost for an MVP product is $32,000 and $9,200 is paid to the founder. More details on StoryTime's implementation needs to be included to justify the money involved. The proposal could also benefit from a section on the risks involved: what if there's too low of an adoption? What if no one finds out about StoryTime? How would censorship or quality management of published content be enforced? Just a few questions that come in my mind.", "q1r": 1, "q2": "No roadmap with milestones for the MVP. No metrics to measure success of the project as well. The proposal would benefit from sharing some technical details as well as expected number of users/sales/books published. Maybe a comparison to Publish0x and Steemit would help? Like a chart showing the differences.", "q2r": 1, "assessor": "z_assessor_948", "no_vca": 18, "ne": 4, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "私たちは、彼らが自分の作品を販売し、DAPPを介して分散化された安全な環境で公正な報酬を得るための市場を作りたいと考えています。", "experience": "Cardano Outreachの創設者であり、ファンド4/6の勝者。経営者、ビジネスオーナー、教育者として20年以上の経験を持つ。"}