{"id": 384580, "author": "nftdao", "title": "Portal: NFQ's digital asset mgmt.", "url": "https://cardano.ideascale.com/a/dtd/384580-48088", "category": 26240, "amount": 35000, "description": "偽造品市場は、ブランドや消費者のお金を強力に奪います。\nブランドは、デジタル資産としてのNFTの可能性を最大限に引き出すためのプラットフォームを必要としています。", "funded": 1, "upvotes": 47329434, "downvotes": 9730432, "votes_result": 37599002, "votes_cast": 237, "f6_no_assessments": 4, "f6_rating": 4.583333333333334, "videos": [], "media": [], "f6_assessments": [{"q0": "Relation to personal qualifications: Since I am actively observing the general crypto space since several years and also the projects in Project Catalyst, I have a certain understanding of what opportunities the sector has to offer and what applications could provide added value to the community. In addition to this I have an understanding of budgeting, both due to my past engagement as a treasurer in a political organisation and my current work as a project engineer, which will give me a good grasp of realistic budgeting of projects.  In addition to this, I learned some programming during my university studies, so I can comprehend the basic ideas behind a lot of the technical details. This proposal identifies a real-world problem, and provides a solution to ti that however is not primarily based on the Cardano blockchain and rather focused on general industry than blockchain industry, even though it utilizes blockchain (even though not neccesarily Cardano. If the Plutus compatibility however is delivered as promised, it will still be beneficial towards the Cardano ecosystem. KPIs/Metrics are not presented.Scalability should be given.", "q0r": 4, "q1": "The proposers are transparent about themselves and seem competent and up to the task. They are transparent about the type and number of team members they are going to use. It is highly likely that they are up for the challenge.  \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals. The proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown.This proposal can confidently be assessed as feasible. Generally, the proposal was very professionally made.", "q1r": 5, "q2": "A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution. The timeline/roadmap is reasonable and comprehensible. KPIs and further metrics are however not presented.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 18, "ne": 4, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Huge backers in the form of NFT-DAO and the Uni of Wyoming. Using NFTs to authenticate brands is something Cardano must allocate resources to. This is a key use case for Cardano. Any dApp that can bring in everyday users to Cardano is a serious contender for funding.", "q0r": 5, "q1": "Steve Lupien is the founder of Beefchain which is well known in the Cardano community. He has a proven track record of success.", "q1r": 5, "q2": "Could the KPIs be fleshed out more? Are there quantitative numbers that can be measured, such as the number of brands on boarded?", "q2r": 4, "assessor": "z_assessor_80", "no_vca": 23, "ne": 2, "ng": 11, "nfo": 10, "vca_o": 1}, {"q0": "A dapp that will leverage RFID tech + blockchain to enable brand protection and verification. The problem fits the challenge setting, since it's a dapp. If successful this dapp will have a tremendous impact for the comunity and cardano. I like the set goals of the proposal and them seem very reasonable, considering how large of a scale this project has. I also love the ongoing colaborations between already existing solutions like Glow. I'm a bit worried about scaling, because they mentioned a few developers that are going to be working on this PoC, which is ok for now, but for the future more developers would be necessary considering the scale. I don't see anything missing from the proposal, all checkboxes are there. Compared to other proposals this is quite original and leveraging blockchain in the right way. In combination with RFID tech, seems ieresting. As a developer I'd like to have seen a more technical idea of how they plan to build this dapp, but that's not going to affect my scoring in any way. Overall I love this proposal as it's quite technical and inovative. ", "q0r": 5, "q1": "There are plenty of links and references to match people to their respective skills. I was able to verify all skills mentioned in the proposal. This gives me confort this proposal will be implemented although just a proof of concept. The authors of the proposal have a right idea about the respective skillset necessary for a successful implementation. The proposers have listened to the comments from the community and have broken down the budget in a clear and understandable manner. Timetable is more than realistic and will be enough to complete the work described. I like the fact incentives for devs to stay with the project are predicted from the start of the project. All elements necessary to implement the proposals are linked at the bottom for anyone to look through. Technical aspects of the proposal could have been more clear, but I wouldn't hold that against them.  The project is really in sync with what's already been done and it shows they've been actively looking to build on top of other peoples work, which is the way to go to save time and effort. Overall I really like this proposal, and believe it will be successfully implemented.", "q1r": 5, "q2": "The KPIs of the project are straightforward and are easy to track. Having said that I would have liked to have some social network channels linked for each community member interested in the proposal to be able to track it. I've seen telegram and discord are great places to do that.  The roadmap has clear milestones 3,6 12 months as requested and tasks to match it. Clear understandable description to the problem and the solution.   Overall a good proposal that shows it listens to it's community. ", "q2r": 4, "assessor": "z_assessor_536", "no_vca": 24, "ne": 11, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "There is no doubt that this proposal will create an environment for interoperability with other Blockchains and greater adoption of cardano ecosystem. Providing a Dapp for for easy access of this novel idea of digital authentication of goods and brands is surely welcome idea and the idea is poised to be awesome product for the ecosystem", "q0r": 5, "q1": "There is enough information to conclude that the proposal will effectively implemented. The proposal has provided a well articulated budget and detailed explanation from the  creation of concept to a realistic minimum viable product. Considering that Risk factors have considered, am more than confident that the team has the capacity to deliver this proposal. ", "q1r": 5, "q2": "Obviously, the projected success metric of this proposal is the launch of the MVP and in addition, the detailed milestones also proves to ensure the effective monitoring of the  progress of the proposal if successfully funded.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 25, "ne": 0, "ng": 18, "nfo": 7, "vca_o": 1}], "solution": "NFQタグが埋め込まれた物理的な製品のデジタル資産管理プラットフォームとして、消費者やブランドをサポートする直感的なdAppです。", "experience": "スティーブ・ルピエン：ビーフチェイン、RFID/ブロックチェイン\n15以上のアプリを作成。\nSolidityでのブロックチェーンコーディングプロジェクト。\n衣料品ブランドを所有。"}