{"id": 384922, "author": "rajatauton", "title": "Liquidity Aggregator for Cardano", "url": "https://cardano.ideascale.com/a/dtd/384922-48088", "category": 26240, "amount": 50000, "description": "現在、カルダノやオーダーブックベースのDEXには、流動性を集約する機能がなく、トレーダーは厳しい競争にさらされています。", "funded": 2, "upvotes": 145223690, "downvotes": 10823828, "votes_result": 134399862, "votes_cast": 699, "f6_no_assessments": 4, "f6_rating": 4.75, "videos": [], "media": [], "f6_assessments": [{"q0": "この提案が課題を効果的に解決することに同意します。この提案は、Orion protocolが行っているような、Cardano上の流動性アグリゲーターをターゲットにしています。このアイデアは、この分野では新しいものではありませんが、Cardanoではこれが最初のものになるかもしれません。  詳細な計画では、このソリューションがDeFiスペースにおけるCardanoエコシステムにどのように役立つかについても説明されています。\r\n\r\n\r\nソリューションの説明はわかりやすいです。さらに詳細計画では、チームがなぜそのソリューションが必要だと考えているのかをさらに詳しく説明しています。例えば、SmartDex 2.0のSmartpoolsは、リテールトレーダーや投資家がより良い投資リターンを得るための平等な機会を提供する、非常に興味深いアイデアだと思います。", "q0r": 5, "q1": "提案書の説明に記載されているウェブサイトのリンクには、この提案を支えるチームの詳細な説明があります。\r\n\r\nこのチームには優秀な開発者が揃っており、Ben Goertzel氏が名を連ねるアドバイザーのリストもあります。これまでの経験から、このチームには自信を持っています。\r\n\r\nプランの観点では、資金の配分が明確に説明されています。時間給ではありませんが、月給が提示されており、それは正当なものです。四半期ごとのマイルストーンについては、チームが各四半期に何を達成しようとしているのか、詳細に説明されています。\r\n\r\n全体的によくできた提案であり、成功する可能性が高いと強く感じました。", "q1r": 5, "q2": "この計画では、どのような問題があり、この提案が何を達成しようとしているのかを、コミュニティに対して詳細に説明しています。このさらに先は、ロードマップ、四半期ごとによく分解されています。\r\n\r\n3ヶ月後、6ヶ月後、9ヶ月後の成功の定義がポイントごとに示されているので、理解しやすく、従うことができます。また、テストネット・ベータ版とメインネット・ベータ版の暫定的な日程も示されています。\r\n\r\nチームプロフィールが公開されているので、私の意見では、この提案の進捗状況を監査するために必要な条件はすべて満たされており、提供された情報はこの提案の進捗状況と成功を監査するのに十分であると確信しています。", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2, "reply": "Thank you for the assessment. We look forward to being an asset to the Cardano blockchain and helping to onboard users to the space."}, {"q0": "Interesting idea. If we can have such a \"hybrid\" dex, it can definitely attract more users to the Cardano blockchain and increase its adaptability.\r\n\r\n\r\nQuestion is - why there is not such a product already? (by someone else) where is the catch? \r\n\r\nI find this proposal highly in accordance with the challenge impact. Rating is given 5.", "q0r": 5, "q1": "Their product is working, yet I could not find any information about the proposers, no links nor relevant experience stated.\r\n\r\nIt would definitely increase the credibility of proposers if such information would be included. \r\n\r\nRelevant experience stated.\r\n\r\nGiven the working website- \r\n\r\nRating given 4.", "q1r": 4, "q2": "A detailed roadmap is provided, in reasonable detail.\r\n\r\nAlso, the definition of success if stated, which is increasing the audit. \r\n\r\nBased on the information given, I find it sufficient for audit. \r\n\r\nRating given 5.", "q2r": 5, "assessor": "z_assessor_54", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "Cross-chain liquidity aggregation will be a massive catalyst for onboarding billions of dollars in liquidity from other blockchains, right as Cardano defi comes online. This is a crucial time for Cardano and implementing corss-chain liquidity and swapping functionality will exponentially grow our ecosystem faster than just about any other single factor. I believe this proposal succeeding will go a long way to making Cardano the blockchain of choice for defi in the web3 world!", "q0r": 5, "q1": "The team has experience with building on other blockchains that they will bridge Cardano to. They have a live product already deployed on ethereum and binance smart chain and polygon  where they have already built a DEX and a cross chain liquduity aggregator for cross chain swaps.\r\n\r\nI think this proposal as written has a very high probability of success and will benefit the entire cardano ecosystem greatly once implemented.", "q1r": 5, "q2": "The roadmap for this proposal is very impressive, detailed with reasonable milestones and contains specific KPIs for each  milestone on the roadmap. \r\n\r\nI think project catalyst has plenty of information to successfully audit this proposal and determine whether it was successful or not.\r\n", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1, "reply": "I'd like to thank you for the great words of encouragement in our project. Autonio plans on being a boon to Cardano and a crucial project for helping onboard users to the Cardano ecosystem with our Smartdex."}, {"q0": "Extremely accurate challenge fit. Provides a good summation of the problem and a well delivered presentation. ", "q0r": 5, "q1": "The proposal provides a clear use prior Dex knowledge and presents a clear and defined roadmap. The proposal also take not from leading players and makes efforts/plan to include them in the future. What will make this project stand out from other DEXs being launched on Cardano? ", "q1r": 4, "q2": "Yes. The proposal contains detailed points of reference and provides a clear outline of how the requested funds will be spent. My only concern is the shear number of items on the roadmap. I'm concerned voters may not be able to process such an aggressive action plan and believe it is not possible to complete in the proposed time. Maybe provide a cleaner timeline that is easier to audit. ", "q2r": 4, "assessor": "z_assessor_970", "no_vca": 23, "ne": 3, "ng": 13, "nfo": 7, "vca_o": 1, "reply": "Smartdex will be set apart from other DEXs by our ease of use, cross chain bridging and liquidity aggregation and other features. It is already aggregating liquidity on ETH, Polygon, and BSC and we are working to incorporate Cardano currently as well as others. Users will be able to trade, bridge, swap, cross chain bridge, cross chain swap, invest in smartpools and liquidity pools, earn through our earn section, and more planned for the future. We have updated our timeline as well as our project experience."}], "solution": "Smartdexは、DEX全体の流動性を集約し、オフチェーン取引のオンチェーン決済ソリューションとともに、ユーザーに効率的な取引を提供します。", "experience": "ETHのDEX、Polygon、ブック＆スワップ付きBSC、2020年に0x v2.1にアップグレード、流動性集約＆クロスチェーンスワップ付き2.0のリリース。"}