{"id": 385120, "author": "adosiawolf", "title": "P2P Manufacturing with Adosia IoT", "url": "https://cardano.ideascale.com/a/dtd/385120-48088", "category": 26240, "amount": 40000, "description": "製造拠点が集中しているため、輸送費がかさみ、環境に悪影響を及ぼします。", "funded": 1, "upvotes": 42600128, "downvotes": 17746744, "votes_result": 24853384, "votes_cast": 247, "f6_no_assessments": 5, "f6_rating": 4.066666666666666, "videos": [], "media": [], "f6_assessments": [{"q0": "IoT P2PプラットフォームとNFTドロップ、マーケットプレイスにカルダノスマートコントラクトを適用し、dAppを開発することで、カルダノのエコシステムを発展させるという興味深い提案です。この提案が正しい方法で資金提供され、管理されれば、うまく展開され、現実世界での利用や有用性に価値をもたらし、作者の希望通り、次の開発やイニシアチブをサポートすることになるでしょう。この提案は、Cardanoのエコシステムとコミュニティに良い影響を与えると思います。", "q0r": 5, "q1": "一見すると、提案書の内容は非常に短く、チームや作品の証拠について十分な情報がありませんでしたが、参考となったLinkedinやAdosia White paper、AdosiaのGithubを読んで、著者の専門性やチームが制作した作品を理解することができました。しかし、チームのメンバーや共同作業者の詳細についてのリンクはありませんでした。  その上、この提案書にはクインに関するサポート情報が見当たらず、彼がカルダノのスマートコントラクト市場で重要な役割を担っているチームで働いているのか、なぜ提出したチームの中に入っておらず、ただの拍手役なのか疑問です。\r\nまた、提案者が予算を明確な項目に分解していないのが残念です。例えば、何人のチームメンバーが様々な3Dプリンタのハードウェアを使うのか、各メンバーの労働時間の給料でどれくらいの時間がかかるのか...。それが明確に修正されていれば、この提案の実現可能性はコミュニティから高く評価されると思います。\r\nしかし、何千ものデザインと何百もの3dプリンターのオペレーターを抱えることは、提案者がマーケティング戦略を暗示していなければ難しく、マーケティングのための予算も考慮に入れる必要があります。\r\n技術面では、このIoTプラットフォームは無線LAN接続だけで成り立っており、今のところは問題ありませんが、提案者が携帯電話網（3G/4G/LTE）、Lora、RFMeshなどの補完的なメディアを追加して、エリアによってはハードウェアボックスを動的に配置することができればより良いと思います。\r\nこの提案では、3Dプリンター製品の高度化や品質がエンドユーザーの需要を満たせないといった課題やリスク、その緩和や変更の方法が示されていません。\r\n最後に、私はこの提案が正しい方法で管理されていれば、成功する可能性が高いと信じています。", "q1r": 4, "q2": "この提案の監査可能性は、コミュニティが簡単に追跡できるほど十分ではなく、提案者の著者は、成功の定義を評価するための測定可能な指標やKPIを提示していないため、修正する必要があります。著者が詳細な測定基準を提示するのはとても良いことです。例えば、資金調達から1～2ヶ月でマーケットプレイスのフロントエンドを構築し、次の2ヶ月で3dプリンタのハードウェアネットワークをチーム内で構築する、などです。\r\nチームのキャパシティと作業量からして、12ヶ月以内のロードマップとマイルストーンは実行可能だと思います。\r\n共通して言えることは、私はこの潜在的な提案の監査可能性に賛成も反対もせず、提案者がもっと注意を払うことを望みます。", "q2r": 3, "assessor": "z_assessor_777", "no_vca": 14, "ne": 9, "ng": 4, "nfo": 1, "vca_o": 2}, {"q0": "The project is great. ADOSIA is one of the few Cardano community members dealing with tangible products (like their ag devices). Perfectly matching the Challenge. Integrating digital (blockchain+internet), and physical technology  Normally, a 5 star rating.  However, this rating is 4 starts. Only because the impact of this proposal depends on adoption by two niche groups of customers: People interested in operating 3D printing services as a business (part time or full time) PLUS customers for those kinds of services. So significant impact might take quite a while. But it will come as 3D printing becomes more mainstream.", "q0r": 4, "q1": "ASOSIA's demonstrated performance in the real world building devices, even before CARDANO tells me they can complete the tasks they have proposed to complete. They exist with or without Project Catalyst funding. Different from so many other proposals which have  no life without Catalyst funding. And if unable to produce what they promise, go on to something else. Not ADOSIA. for that reason 5 stars. ", "q1r": 5, "q2": "The whitepaper, links and the Adosia.com website provide all of the needed information to fully grasp the essences of the proposal which when combined with  what is described or explained in the text of the proposal clarifies the proposal. But I did have to use all the sources that were provided. If others do not, they might miss the full understanding. The information is there.", "q2r": 5, "assessor": "z_assessor_251", "no_vca": 18, "ne": 4, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Interesting idea to decrease the shipping and protect the environment by IOT 3D Pritning, If the demand would be high - which I assume will be increasing over time - it can serve as a place not only for solo entrepreneurs but also companies for marketing and sharing via web.\r\n\r\nI think that on a scale 1-5 this can potentially impact cardano on 4. \r\n\r\n\r\n", "q0r": 4, "q1": "the linked in profile is posted, and the website is already running. I have a strong belief they can deliver, yet it would be nice to see more information about the team to increase the creditability. \r\n\r\nI find it strange that the team is 20 members at the top and then15 members below. This would require more clarification and detail about what does it mean. \r\n\r\nrating given 4.", "q1r": 5, "q2": "the progress and the overall product can be audited, yet this information is missing in the proposal, but I can imagine how it would work:\r\n\r\n1. code and interface progress\r\n2. number of users\r\n\r\nBut it would be nice to have it stated.\r\n\r\nThe roadmap is provided in reasonable detail.\r\n\r\nRating given 4.", "q2r": 4, "assessor": "z_assessor_54", "no_vca": 13, "ne": 1, "ng": 7, "nfo": 5, "vca_o": 1}, {"q0": "The proposal is accurately placed within dApps and integrations and successfully highlights a problem and solution whilst bringing value to the ecosystem through a functional marketplace. ", "q0r": 4, "q1": "The team seems to hold the requisite experience  however I would like to see more of the team listed to fully prove this. The funds requested seem reasonable however as it is a large amount I would like to see a more detailed cost breakdown in the future.  and so I can only agree", "q1r": 4, "q2": "The roadmap laid out is reasonable and well spaced however there are no KPIs referenced and. It would be great to see hard figures that can be measured.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 14, "ne": 1, "ng": 7, "nfo": 6, "vca_o": 1}, {"q0": "As an IoT technological person, I feel this proposal very interesting, decentralizing market from manufacturer to user/buyer using IoT P2P platform combined with Cardano smart contract and token distribution models is a good way to develop the Cardano ecosystem. It funded and deployed successfully with metrics of Product MVP within 3 months, production software within 6 months and marketplace within a year, I think this is a valued real world use and utility to Cardano that this proposal delivered. By hence, it will support the following development and operational initiatives in the future.", "q0r": 4, "q1": "The proposer provides reference linkedin with specialties to show evidence of relevant skills and experience needed to implement the proposal but I could not find any link for details of team members. The Adosia White paper is so impressed with roadmap and many supporting information and also the Github of Adosia/contracts that some readers could ignore if not read carefully. I think it would positive if the proposer provides some important details of some team members, their works and especially about the relationship and role of Quinn in this proposal because he is a key for smart contract marketplace on Cardano.\r\nThe budget is not broken down into identifiable items, it is better if the Author gives detail number of people and work hours for each work, for example: 2 people * 40 hours * 50$/h for build out marketplace front end, etc.\r\nI think 12 months is a realistic timetable for marketplace but harboring thousands of designs and hundreds of 3d printer operators are a difficult if the proposer does not imply to the marketing strategy and so the budget for marketing also needed to take into account.\r\nAbout the technology aspect, I find this IoT platform just based on the wifi connection and it's ok for now, but it would be better if the proposer add some complimentary media such as celular network (3G/4G/LTE), Lora, RFMesh,... for dynamically placing hardware box in some areas.\r\nThe challenge/risk is not implied in this proposal such as the sophistication/quality of 3D printer product could not meet demand of end users and the ways for mitigating/changing.\r\nAt last, I still believe this proposal is likely to be successfully implemented if it is managed in a correct manner. ", "q1r": 4, "q2": "About the roadmap and milestones within 3-6-12 months are still ok for achievement. But the metrics or KPIs is not appropriate to this challenge, not clear for definitiion of success for community tracking and following. It'd be better if the proposer could give out details like: building out marketplace front end in the 2nd month, enable team members with various 3d printer hardware in the 4th month, execute dynamic NFTs drop using 3rd printers in the 6th month, hardware installation in the 7th month,... \r\nBy this reason, I don't think the auditability of this proposal  is good enough for community tracking easily and hope to see the modifying on it.", "q2r": 2, "assessor": "z_assessor_775", "no_vca": 15, "ne": 6, "ng": 7, "nfo": 2, "vca_o": 1}], "solution": "オープンなP2Pマーケットプレイスを展開し、3Dデザインの収益化と分散型プリントジョブの実行という新たな経済機会を提供する。", "experience": "Adosiaは、洗練されたカルダノ開発者からspacexのシニアデザインエンジニアまで、15人以上のレギュラーチームメンバーに成長しました。"}