{"id": 385138, "author": "javiertc86", "title": "Distributed storage Infrastructure", "url": "https://cardano.ideascale.com/a/dtd/385138-48088", "category": 26240, "amount": 15000, "description": "IPFSのインフラを維持するには、時間とコストがかかります。", "funded": 1, "upvotes": 75187394, "downvotes": 3789782, "votes_result": 71397612, "votes_cast": 324, "f6_no_assessments": 4, "f6_rating": 4.499999999999999, "videos": [], "media": [], "f6_assessments": [{"q0": "この提案は、非常に効果的に課題に取り組み、カルダノ上のIPFSを使用した分散型ストレージソリューションのための開発者ツールのセットを構築するための徹底的な計画を提供しています。IPFSを利用するためのAPIと開発者ツール（SDK）を、使いやすく、可用性の高い形で提供することで、この問題にどのように対処するのかを明確に示しています。このような開発者向けのツールを用意することで、Cardano上で開発を行っている人たち（特にNFTの開発者）が容易になり、また、より多くの開発者がCardano上で開発を行うようになり（開発への参入障壁が低くなり）、最終的にはCardano上で構築されたdAppの普及が進むことになるだろう。", "q0r": 5, "q1": "この提案には、経験豊富で優れたチームがいることが証明されており、Linkedinで彼らのプロフィールを確認することができます。チームの役割が確立され、詳細に説明されているだけでなく、各人がそれぞれの分野で7年以上の経験を持っています。予算は、それぞれの役割の今日の給料としては妥当なものですが、何に費用がかかるのかという詳細が不足しています。例えば、サーバーのインフラにかかる費用は、どのようなサーバーを使用するのか、それにかかる費用や維持費はどのくらいなのかなど、少なくとも詳細を提示してもらえると助かります。どのようなサーバーを使用するのか、それを維持するにはどのくらいの費用がかかるのか、などです。予算以外では、JS SDKがどのようなものか、HTTP APIのエンドポイントは何か、ユーザーインターフェースはどのように実装されるのかなど、実装に関する計画を常識的かつ実行可能な方法で提供しています。5つ星ではない理由は、予算の詳細が不足しているためで、特に「サーバーインフラ」の予算が不足しています。それ以外の点では、全体的にこの提案は成功する可能性が高いと思います。", "q1r": 4, "q2": "この提案の成功は明確に定義されており、APIとSDKの提供が成功するかしないかという意味で、簡単に測定することができます。しかし、このSDKがGithub上でオープンソース化されるかどうかは明記されていないため、途中の進捗状況を確認するための透明性が低くなっています。彼らの以前のGithubレポ（cardano-wallet-js）を見ると、tango-cryptoの下に新しいレポを簡単に作ることができるように見える。ただ、有料のサービスのようなので（ウェブサイトを見ると、サービスごとに階層がある）、オープンソース化するかどうかはわかりません。星4つなのは、もっと透明性の高い方法で進捗状況を確認したいからです。", "q2r": 4, "assessor": "z_assessor_640", "no_vca": 15, "ne": 8, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Could not stress enough how important distributed storage is for DApps going forward.\r\n\r\nIn fact, most \"decentralized\" applications still rely on some centralized backend utilising PostgresQL or some other database. This challenge is perfect for the Cardano and web3 ecosystem in general, and could be utilised, if successful, by basically every DApp.", "q0r": 5, "q1": "Given the progress made on other tools created by the team members, the progress on the API endpoints that the team has mapped out already I cannot give this proposal any less than 5 stars when it comes to how likely it is that team will successfully implement this roadmap and reach their milestones.", "q1r": 5, "q2": "The roadmap too, looks great. Roadmap includes detailed milestones with specific KPis for each which is what I generally like to see because it greatly enhances our ability to audit the success of the proposal.\r\n\r\nThe team has provided a very detailed look into the very API endpoints that they are creating for this JS SDK.\r\n\r\nThis proposal is highly auditable and is definitely worth of 5 stars!\r\n", "q2r": 5, "assessor": "z_assessor_577", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "The proposal will have a positive effect on the Cardano ecosystem and will drive NFT consumers and producers to Cardano, however the risk could be in gateways which seem to be centralized. This could lead to time lag when resolving IPFS URLs. ", "q0r": 4, "q1": "The proposers have a vast range of experience with all things Cardano and have presented a rich amount of evidence to that effect. ", "q1r": 5, "q2": "Going from the history of the team, it is very likely that their solution will be open-sourced, and therefore subject to public scrutiny, although that is not explicitly mentioned. ", "q2r": 4, "assessor": "z_assessor_832", "no_vca": 13, "ne": 2, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "Decentralised File Systems like IPFS are fundamental to build pure DApps. This proposal will heavily drive an increase of the utility and adoption of Cardano by allowing other projects to use IPFS through their APIs. Plus, it will provide a service layer which will allow to mint NFTs. To me, it looks like an essential piece of infrastructure needed by other projects, in order to be more productive and focus more on Their business objectives.", "q0r": 5, "q1": "The plan is detailed and clear. The team is experienced and has built with success several other applications in the Blockchain space. From my point of view, the budget should have been a bit higher to cater for unforeseen circumstances. \r\nOf course, I believe the server infrastructure is 9000 and not 90k - That 90k is probably a typo. ", "q1r": 4, "q2": "The proposal roadmap is simple, clear, and can be audited effectively. I really wish I could give 5 stars, because the roadmap is linear and easy to audit. However, we are  missing Key elements from the challenge that is the measure of the growth/usage of the system.\r\nI think this is because in the roadmap are mixed the auditability with the implementation plan and. There is a simple way to add the missing important information: I would have added one more step to the roadmap: After the service is launched, monitor (1) how many projects are actually using the APIs, and (2) how many files are added to IPFS, (3) how many NFTs are minted. \r\n", "q2r": 4, "assessor": "z_assessor_956", "no_vca": 22, "ne": 7, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "IPFSストレージのために、使いやすいHTTP APIとSDKを提供しています。", "experience": "TANGOステークスプールを運営し、cardano-wallet-jsやTangocrypto Software as a Serviceを開発しました。"}