{"id": 383792, "author": "janh", "title": "Semi-public collaboration platform", "url": "https://cardano.ideascale.com/a/dtd/383792-48088", "category": 26247, "amount": 75000, "description": "产品或项目团队往往与目标受众脱节，错过了反馈和宣传的机会。", "funded": 1, "upvotes": 47575893, "downvotes": 9091065, "votes_result": 38484828, "votes_cast": 162, "f6_no_assessments": 6, "f6_rating": 4.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a nice project to develop AI reputation assessing tools to act as gatekeepers for access to various levels of communication with the employees of SingularityNet. Meets the breif by directly applying AI to comms from SingularityNet which will help improve collaboration with the wider community.", "q0r": 5, "q1": "The proposer is from within SingularityNet and presumably speaks for them in terms of using these funds to run a project within there. Whilst the details are on a separate document (would have been nice you just have in ideascale directly), there is a detailed plan and hourly breakdown of work required. I would expect them to deliver.", "q1r": 5, "q2": "The project has a clear set of deliverables for which progress should be auditable. There is not much in the way of what success is. Technical delivery is great, but I would assume success here would mean measuring the increase in communication across the company walls enabled by this. How many people are expected to make it to each reputation level, how much info will be shared etc.", "q2r": 4, "assessor": "z_assessor_11", "no_vca": 29, "ne": 1, "ng": 27, "nfo": 1, "vca_o": 1}, {"q0": "The proposal suggests an AI-moderated, layered means of communication to lower collaboration tresholds between project teams and communities. Community involvement is what the Voltaire Incentivised Testnet (Project Catalyst) is all about and a step towards Cardano's Voltaire era (governance). Having a more efficient communication system would drive productivity to new heights and catalyse development on many levels. The Enhanced Liquid Reputation Assessment is interesting and could serve its use as Project Catalyst has been looking for a reputation system.   ", "q0r": 5, "q1": "This proposal's team is highly experienced and holds SingularityNet's CEO and VP of product. So there is no doubt that they'll be able to develop this. One concern is that the variables of the scoring mechanism should be very well defined for it to work properly, which might prove to be more difficult than it initially seems. For example: the length of text in a message can be too short or too lengthy for it to retain a certain level of quality. To define the ideal length that holds maximum efficiency would take a lot of effort. \r\nFurthermore, the notion of decreasing the number of AI-services and thus also decreasing complexity in case of higher cost is a lesser option in my opinion. There might be applied for a second fund in that case, upholding application quality as intended and reassuring community confidence. ", "q1r": 4, "q2": "The proposal has a nice overview as it's made out of a short and clear proposal, accompanied by a five-page presentation that holds more in depth details. The general elements to determine the auditability of this proposal are present. There is a roadmap spanning a year in the future, a detailed budget estimate and a prospected launch period. To improve the proposal, there could be additional background information  provided on the proposers as not all voters will be fully aware of their identity. A risk assessment would also be advisable in case difficulties arise in variable definition. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 25, "ne": 7, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "I've been a CA and vCA since the very earliest funds that were open for public participation and I've seen all sorts of challenges. This one is very specific one and the name of the Challenge \"F7: A.I. & SingularityNet a $5T market\" might be a bit misleading. The principal question in the challenge \"How can we create a mutually beneficial partnership with SingularityNet and other A.I. developers and researchers?\" is what I think that proposers should focus mostly on - and this proposal does it. It is hard to jump to super-ambitious projects without taking things a step at a time and this proposing team does it. Creating a a \"semi-open, AI curated communication and collaboration platform that connects project teams, external ambassadors and the wider community\" is a project of extreme relevance fo Cardano and Project Catalyst specifically, especially as full implementation of decentralized governance is round the corner. The idea to utilize a \"scoring mechanism supported by AI algorithms\" to identify outside constructive users that can enter the 'public closed' area to collaborate with the internal crew - is amazing and could be super beneficial for any community that needs to ensure that it does not operate in a bubble. The Cardano community also utilizes Slack and Telegram, which are the initial focus of the proposal - meaning that any developed tools could be transposed. Spot on. ", "q0r": 5, "q1": "\r\nThe team behind this proposal includes the VP of product at SingularityNET, while the co-proposers is a leading authority on AI and Cardano partner Ben Goertzel. If there is a team that is qualified to pull it off, this is it. The attached plan includes monthly steps & an associated timeline - with a budget that is broken down into person days and includes day rates. I don't know too much about AI, but I know when I see a team that can prepare a good plan, a good budget and is experienced with the matter at hand. This proposal is both realistic in the way it sets out a timetable and in terms of the plan that will be implemented. Highest marks from me. I especially commend the team for going into detail about the Dayrate and variables that could influence the cost. The transparency and readiness to be open about the cost is commendable. I quote: [\"The dayrate depends heavily on the team that we will be able to form This ranges from rockstar AI dev freelance rates, to regular 'western world based' employee rates, to low salary countries or enthusiastic community members. for this proposal I will estimate the daily rates on 350 dollar a day, which is somewhat of an average but not overly optimistic.] The team also is planning ahead in case the dayrates are not too high: \"Should we be able to collect a team with lower dayrates, then we can expand the scope\" - very very good. \r\n", "q1r": 5, "q2": "The attached document with the plan, timetable and milestones is excellent. It makes the proposal easily auditable and I think that the proposal is a very good example of how to create a valuable contribution inside Project Catalyst. I think it will be relatively straightforward to audit a proposal such as this if it is approved by voters and hats off (pun intended) to Ben Goerzel and Jan Horlings and this team for the interesting step towards implementing AI in connecting product or project teams with the wider audience or a wider circle of contributors and stakeholders. \r\n", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 20, "ne": 8, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "Nice proposal with a solid briefing attached to it. The idea of the proposal is to use AI to build a platform within a large community/company so that ideas from one project team to another get attention. Today large companies are usually structured in smaller groups and the ideas that burst within these groups tend to fade away after the supervisor. By using this AI platform all group communication could be linked if the idea has promise. This fits within the challenge settings although the value to ADA is indirect.", "q0r": 4, "q1": "The team on this proposal is experienced, to say the least. As VP of SingularityNet, this leaves no doubt about the relevant experience to develop this idea. My concern is the rating system, as it is stated in the attached file it looks more like a whos more popular rating rather than who has the most valuable ideas. Since the rating system is based on the frequency of posts, reactions, comments, and length of the post. This would in my eyes not be enough to produce a solid rating system of valuable ideas.", "q1r": 2, "q2": "The PDF that comes with the proposal gives a professional feel. We get everything needed for auditability. We get a very good roadmap and the budget breakdown is feasible. The only thing that would've made this perfect is some more info on the team behind this proposal.", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 19, "ne": 1, "ng": 17, "nfo": 1, "vca_o": 1}, {"q0": "The idea of this team is to develop an AI that can help to solve the disconnection between the product or project team with their target audience, to prevent the missing opportunities for feedback and publicity. This idea is essential for improving the communication between project stakeholders that will help to improve the development of the ecosystem. \r\nThe team also attach their detailed document but still lacks the key metrics that they will use for nailing their progress and goals. Hope that they can set some key results to help Catalyst assess how much this AI development will align with the challenge setting and help to develop the Cardano ecosystem. ", "q0r": 3, "q1": "As the detail inside the attached document, I think this team is experienced enough to run this project. There is a detailed roadmap that is broken down into months with detailed outlined tasks that look fit with their detail plan in above paragraphs. And their budget also estimated very clear into work-days. \r\nMoreover, the one who leads this project is VP of product at SingularityNET so I think that the team has a strong ability to succeed this project. \r\nThe only thing I concern about this proposal is that the relevant risk that they will face off when implementing their plan, and if they have some key metrics about the user, I wish to see more info about the marketing plan that can increase the number of users. ", "q1r": 4, "q2": "The team provides us with a detailed roadmap in the attached document with a realistic timeline, but the proposal is lacking key metrics to define how this project be success - and it's matter for audit the project. \r\nThey also have a good awareness of the problem context and give a detailed solution that can absolutely address that problem with detailed explanations about the features and technology under their solution.", "q2r": 3, "assessor": "z_assessor_651", "no_vca": 20, "ne": 5, "ng": 10, "nfo": 5, "vca_o": 1}, {"q0": "\"The proposition is clear, and implements building a semi-open, AI-managed communication and collaboration platform that connects project teams, external ambassadors, and the broader community. You should have an initial limit of interactions with certain social media platforms. Also, has the proponent submitted a proposal \"\"Anti-Polarization Social Platform\"\" is there any combination between these two proposals to solve more complex problems?. What language is the solution used for or multi-language?\"", "q0r": 4, "q1": "The proponent gives a very detailed and specific reputation scoring solution, it would be better to have an actual demo. What difficulties will be encountered in the interaction with the partner platforms you include in the solution and is there a plan to handle it?. Human resources used are described clearly and reasonably, but some items need more details. The proponent's identity is well described but difficult to identify", "q1r": 4, "q2": "Reasonable roadmap, clear time each month with KPI targets to be achieved. In addition, the proponent should test the scoring method many times to detect and eliminate influence risks. The proponent can add future plans if any", "q2r": 4, "assessor": "z_assessor_697", "no_vca": 16, "ne": 2, "ng": 12, "nfo": 2, "vca_o": 1}], "solution": "一个半开放的、由人工智能策划的沟通和协作平台，连接着项目团队、外部大使和更广泛的社区。", "experience": "SingularityNET的产品副总裁。过去在大规模的B2B/B2C电子商务战略和实施项目方面有经验。"}