{"id": 383917, "author": "pierre", "title": "MUSEVERSE: AI bridge to Metaverse", "url": "https://cardano.ideascale.com/a/dtd/383917-48088", "category": 26247, "amount": 50000, "description": "目前还没有一个现有的音乐平台将人工智能和由SingularityNET和Cardano区块链驱动的Metaverse世界相结合。", "funded": 1, "upvotes": 50554176, "downvotes": 6596766, "votes_result": 43957410, "votes_cast": 196, "f6_no_assessments": 3, "f6_rating": 3.8888888888888893, "videos": [], "media": [], "f6_assessments": [{"q0": "Having read through this a couple of times I am struggling to understand the core proposal is. There are three instrument NFT's, which are desinged for ease of use by users. Then it talks about artists and clubs. Are these musical artists playing on those 3 instruments and you are expecting people to pay to listen to xylophone, drum and piano music? Or are they graphic design artists making versions of those (or other) instruments. But in that case where do the clubs come in. The proposal plans to use somnium space, but have plutus contracts for the NFT's on Cardano. But it appears Somnuim only supports Ethereum?\r\nAs for AI, it seems like an afterthought. It is used to count the number of people attending a musical concert from an image shot. Surely the number of attendees is metadata that can be accessed directly from the virtual space. ", "q0r": 2, "q1": "Whilst the proposers have experience in the space, the plan is not clearly stated. I can't really understand what the goal and deliverables of the proposal are (see discussion above) thus I cannot give a high likelihood of a successful delivery.", "q1r": 2, "q2": "Whilst the proposal does have some clear point in the roadmap for which delivery should be auditable (the three NFTS, testing the image recognition), some major parts of the deliverables are the design of the system (whitepaper, tokenomics, rewarding system architecture). How do you audit delivery of the design of a plan. \r\nFurther no metrics or goals for success have been presented. Do you have goals for the number of NFT's sold, arists signed up, club partnerships, ICO raise etc?", "q2r": 2, "assessor": "z_assessor_11", "no_vca": 28, "ne": 2, "ng": 21, "nfo": 5, "vca_o": 1}, {"q0": "This is an interesting project that enables users to experience live VR-music from the comfort of their own home. As a music enthusiast, I can perfectly imagine this having its use, as in modern times people have less and less spare time to commute to and from a concert. This is the next best thing, so it has a potential of becoming quite popular. Launching the project token through a FISO is highly encouraged as it's better for token stability and creates a fair environment for all. ", "q0r": 5, "q1": "Impressive team. The requested funding is realistically set. With an eye on the near future and current metaverse hype, I can certainly see a wide range of support for this project. This also raises the concern wether the metaverse(s) that are intended for cooperation would be ready in time to integrate this, otherwise there are bound to be some delays. Some short information on their state of development in the proposal would assure this concern. Furthermore, the roadmap mentions 'websites' in november 2021, so is it slightly running behind? ", "q1r": 4, "q2": "This proposal is highly auditable. There is a roadmap, estimated launch period, marketing details, team identification. Pretty much everything that is needed at this stage is included in the atteched slides. Further improvement of the auditability could be achieved by adding clear set KPI and tokeno;ics details in the whitepaper, which is scheduled for Q1 2022. Nice layout!", "q2r": 5, "assessor": "z_assessor_113", "no_vca": 26, "ne": 2, "ng": 24, "nfo": 0, "vca_o": 1}, {"q0": "Really cool idea. This proposal shows what is capable when using AI and blockchain together. The project is about making a new experience for musicians by utilizing VR-space. This could get a lot of traction now in the Covid age.", "q0r": 5, "q1": "Regarding feasibility, we get a very well-explained proposal. The team behind it certainly has everything they need to successfully implement this. By using Metaverse they are jumping on the hype that is around Metaverse. Fund requirements are clear and feasable.", "q1r": 5, "q2": "The proposal has everything we need for an audit. A perfect-looking roadmap that gives full transparency to the project. Detailed information about the team behind the project. One impeccable proposal, good job.", "q2r": 5, "assessor": "z_assessor_471", "no_vca": 21, "ne": 1, "ng": 13, "nfo": 7, "vca_o": 1}], "solution": "我们正在Cardano上建立一个去中心化的音乐平台，通过使用集成在AI和SingularityNet上的Metaverse的互动能力。", "experience": "-用于音乐创作的AI智能工具开发者\n-VR开发者\n-区块链开发者\n-股票池运营商\n-创业者\n-顾问"}