{"id": 380970, "author": "felixweber", "title": "Idea Fest by Catalyst Swarm", "url": "https://cardano.ideascale.com/a/dtd/380970-48088", "category": 26234, "amount": 22700, "description": "提案者と有権者の間に交流がなく、提案者が有権者に連絡を取ってプロジェクトを紹介することが難しい。", "funded": 2, "upvotes": 174765398, "downvotes": 3082804, "votes_result": 171682594, "votes_cast": 1026, "f6_no_assessments": 16, "f6_rating": 4.791666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "コミュニティが成功させたイベントの継続です。投票者とプロポーザルの間のギャップを埋め、Project Catalystへの参加者を増やし、新しいメンバーをProject Catalystに統合し、さらに、コミュニティが一生懸命作ったプロポーザルを宣伝し、投票される機会を増やすことができる場を持つことで、コミュニティを一つにまとめるという点で成功しています。この提案は、チャレンジの設定に効果的に答えているだけでなく、おそらく無意識のうちに、現在行われているが残念ながら十分に強調されていない、別のレベルに引き上げられるべき存在を生み出しています。これは、様々な言語に対応したIdeaFestという形をとっています。プロポーザーの皆さん、お疲れ様でした。最後になりますが、私はまだこのイベントが自分自身を超えたものになったり、分岐してシャークタンクのようなものになったりするのを見たことがありません。提案者が有権者ではなく、投資家に向けてプレゼンテーションを行うのです。", "q0r": 5, "q1": "提案者は、カルダノへの献身を一貫して証明してきた3人の非常に影響力のある人物で構成されている。この3人の間で、彼らは数多くのコミュニティ主導の組織を設立したり、その火付け役となったりしている。Catalyst Swarm、Catalyst School、WADA、After Town Hall、Eastern Town Hall、そしておそらく私が知らない他の多くの団体などです。これまでの経験から、この提案の継続がうまくいくことは間違いありません。予算も明確に示され、半端なく詳細なアクションプランが添えられています。詳細なタイムラインはありませんが、これまでの経験から、提案者は常に素晴らしい成果を上げてきました。しかし残念なことに、提案者が将来遭遇するかもしれない潜在的な課題やリスクについては言及されていません。例えば、「どのようにして、あるいは類似したアイデアとの統合やコラボレーションを行いたいのか」、「類似したアイデアとの統合やコラボレーションを検討する際には、どのような指標を考慮する必要があるのか」などです。以上の点を考慮した結果、4つ星の評価となりました。", "q1r": 4, "q2": "いくつかの数値指標とGitHubリポジトリを使用することで、一貫性と責任を持って監査を行うことができます。問題提起と解決策の相互関係は、強力で包括的な提案として表現されています。", "q2r": 5, "assessor": "z_assessor_635", "no_vca": 21, "ne": 11, "ng": 9, "nfo": 1, "vca_o": 2}, {"q0": "The Idea Fest, in my opinion is a good place where proposers could convey their project to the voters. This also help increasing active participation in Catalyst too. It provides place for new people that active in Project Catalyst to engage more and have some discussion or even getting answer for their question for certain proposal. \r\n\r\nThe key metrics and goal of this proposal also align with the challenge settings. It increases voter-proposer interaction.", "q0r": 5, "q1": "The team consists of experienced people in Project Catalyst, such as: Felix Weber and Victor Corcino. And they already do this Idea Fest also in Fund 6. I've seen the video of last Idea Fest in Fund 6. In my opinion, if funded, this proposal will be implemented successfully. Moreover, budget is outlined clearly and broken down properly. And the sum is still reasonable in my opinion. \r\n\r\nThe team could also include timeline or milestone, so the voter could understand the time frame, if it's mentioned in the proposal.", "q1r": 5, "q2": "The team described the targeted problem clearly. And community could track the project progress via their website and also by checking IOG YouTube channel. \r\n\r\nIt would be nice if the team could also include report on the last Idea Fest (Fund 6) and how much do they improve the situation. The rest, I think it's quite clear & easy to be measured accordingly.", "q2r": 4, "assessor": "z_assessor_282", "no_vca": 18, "ne": 6, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "\r\nThe problem needing to be solved has been identified and articulated namely there is a lack of interaction between proposers and voters and its hard for Proposers to reach out to voters to present their projects. It is clear that this proposal falls within the scope of the challenge brief by organizing Idea Fest which provides proposers a stage to pitch their ideas and allows the voters & community to interact and discuss with them. \r\nThis proposal shows how it adds value to the Cardano system by creating  these opportunities for proposers and voters. Key metrics  would be  number of participants,  number of breakout rooms, number of participants in each Ideafest session, number of propsers and voters.The key metrics and goals of the proposal fall within the scope of the challenge. Proposal can be scaled up to address future challenges by adding more rooms and events. This project will have a positive impact on Cardano system by increasing the collaboration between community members in presentations and discussions.\r\n\r\nI can say that this proposal adequately addresses the challenge  hence i have given it a 5 star rating.\r\n \r\n.", "q0r": 5, "q1": "The proposers  have provided ample evidence  of themselves with their skills and experience in  hosting Town Hall and After Town Hall events as well as previous Ideafests.  The links are sufficient. I have visited these links and contacted the relevant people. The proposers are well experienced and competent to do the event.  The type and number of team members required to implement the proposal is stated. The team structure is listed and experienced. The budget has not been given in detail. The budget is  reasonable to achieve the set goals. The proposer has not provided a verifiable plan if additional funding is required. \r\nThere is no plan for additional funding  if objectives are not met. There's a realistic timetable  to complete the work. The proposal gives  a sensible and conductible plan for implementation.  .Resources  necessary to implement the proposal are described.   The proposal has technical aspects which have been addressed. The proposer has not identified risks in this proposal. This proposal is detailed and budget is reasonable hence I have given it a 5 star rating.   \r\n \r\n\r\n\r\n \r\n\r\n\r\n", "q1r": 5, "q2": "There is a roadmap with milestones . There are  Metrics such of number of participants and number of presentations and discussion rooms. The problem has been clearly understood and solution has been given in much detail. The proposer has not identified possible hurdles, challenges and difficulties. The information provided is  sufficient to audit the progress and the success of the proposal hence I have given it a  5 star rating.\r\n  \r\n", "q2r": 5, "assessor": "z_assessor_460", "no_vca": 19, "ne": 6, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I have organized various events and know about the importance of setting them up properly content-wise for them to be successful, so I am confident I can determine whether their concepts are set up in a meaningful manner. Since I am also Participating in catalyst since several funds I am competent to determine what kind of community events could be beneficial. The proposal identifies an important point within the challenge which by adressing it, will bring an great benefit to the Catalyst community and the Cardano ecosystem; by connecting proposers and voters and thus adding more awareness and transparency to the process. A continuation is highly encouraged. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince the Catalyst Swarm is a great multiplicator and people active in it keep on growing, it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "The proposers are a really active and vital part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large part of the community as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a very detailed description of what is going to be done and how and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is without a doubt a perfect example of a good, feasible proposal.", "q1r": 5, "q2": " Well-defined, detailed metrics and KPIs are presented that define the success of the proposal. A clear, understandable problem description is supplemented by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 18, "ne": 6, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "This idea is absolutely impacted on Cardano ecosystem and creates a big value for communities. As a proposer, I experienced this event once on the fund6 and it motivate me a lot and can help me connect to the community better. As the key metrics in the proposal says, I hope that it can increase the number of presented proposals in each next idea fest by 50%, and can get 100% soon. ", "q0r": 5, "q1": "This team has experience about organize this event in fund 5-6 and now fund 7. So it's no doubt that they can deploy this event successfully without any risk. \r\nReading carefully the proposal we can understand what they will do for the event and its meanings, moreover there is also have a marketing plan for this event that is outlined clearly in the proposal.", "q1r": 5, "q2": "They're experienced in running this event and have a full option for help auditing this event. Throughout 2 previous funds, their reports in Catalyst community can show how hard they working for it. \r\nMoreover, the team is still not lazy and input a good explanation about the context in the past then their improved solution for the next fund in this proposal. All the detail is clear in every corner of the key activity in the event and you can join with them in this fund. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 17, "ne": 1, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "The ideafest proposal address the challenge setting by allowing the proposers to present their proposal to voters and this should increase the community participations in the next 6 months as a result.", "q0r": 5, "q1": "The plan is clearly laid out to make this IdeaFest going Live. The proposal will get a better ranking if the budget is more reasonable with the project tasks as it doesn't align with the current market rate.", "q1r": 3, "q2": "The proposal provides the metrics to measure the success. The proposal should try to add more activities that can help to promote proposers and separate activities from Catalyst Swarm as these could be an overlapping area in term of funding for voters. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 16, "ne": 2, "ng": 9, "nfo": 5, "vca_o": 1}, {"q0": "this proposal is addressing the challenge to increase awareness about Cardano and catalyst and this project plans to organize public events to reach this goal. As the Catalyst budget is growing, therefore more and more projects are applying for the funds. Idea Fest event is a great way to increase participation in Project Catalyst as it allows the proposers to present their proposal as well as receive comments. Additionally, this bounds the community and helps the new Cardano member onboarding process.", "q0r": 5, "q1": "This team of proposers has a solid track record of organizing the IdeaFest event on previous rounds as well as improving the quality of the event every time. therefore it's very highly likely, that they will implement the proposal successfully. Additionally, each member has already proven their ability to organize and execute other public events, therefore it's highly likely that the event will be executed successfully even in the case that one/some of the organizers will become absent. ", "q1r": 5, "q2": "The team has indicated transparent metrics to easily measure the progress and the success of this proposal. They have indicated also the tools/communication channels they will be using as well as that they will be continuing to update the progress on the Town Hall events ", "q2r": 5, "assessor": "z_assessor_713", "no_vca": 13, "ne": 3, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is a great idea, very impactful for the growth of Cardano ecosystem and Project Catalyst by organizing a space for proposers to present their idea and interact with other members in Cardano community. The proposal is completely within the challenge and clearly going to add value to the Cardano ecosystem. Additional, the metrics and goals of the proposal are fit to the challenge setting (This point is clear articulated in the proposal's Impact section). Therefore, I rate impact with a score of 5.", "q0r": 5, "q1": "The proposal team are Catalyst Community members (fulltime); besides, they have organized the Idea Fest successfully twice. (This is following up of the funded 'Idea Fest' proposal in Fund5 and Fund6). The proposal provides a 11 hour- long Youtube video of Idea fest in Fund6 (part 1). That is a strong evidence for the team's experience and relevant skills for this proposal's successfully implementation. The budget is outlined clearly and broken down into identifiable items and be reasonable to achieve the set goals. I completely agree the proposal is fully feasible.", "q1r": 5, "q2": "I strongly agree the proposal is fully auditable because the team provides a transparent and understandable process by publishing all activities and meeting protocols in Github repository and Idea Fest will be recorded and uploaded to Catalyst Swarm Youtube channel. Roadmap with milestones and time horizon are provided clearly. The targeted problem and the solution is describe in understandable details.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 14, "ne": 6, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "As the goal of the proposal is to create a connection or interaction between proposers and voters, the proposal fits into the challenge settings. If this proposal is implemented, I see it making a positive mark for Cardano because it would enhance congruence between voters and proposers and the community as a whole which tackles the targeted problem.", "q0r": 5, "q1": "The team have been participating in Cardano since fund 5. I believe they have the skills and experience needed (they have attached links and references) to create that liaison between proposers and voters. The presented plan is comprehensible. What is missing are the possible risks/challenges involved in the implementation of the proposal.", "q1r": 4, "q2": "The proposer has outlined the roadmap and time horizon for the implementation of the proposal. It is good to see the metrics that define the success of the proposal. The targeted problem which is the lack of communication between proposers and voters would be solved if the proposal is implemented.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}, {"q0": "Idea Fest effectively addresses the Community Events challenge by producing an open and collaborative event that connects proposers with voters, and increases meaningful participation in Project Catalyst & Cardano.  Events like this are essential to keep the community connected and engaged as we continue to grow!", "q0r": 5, "q1": "This team has demonstrated their ability to successfully implement their plan twice already now with the previous two Idea Fests which were funded in Funds 5, and 6.  These events were extremely successful and productive events for the community and thus it is highly likely that they will be successful again here in Fund 7.  ", "q1r": 5, "q2": "The Idea Fest team has demonstrated excellent transparency by publishing all of their activities and meeting protocols in a public Github repository.  The events are recorded and uploaded to YouTube and they have set clear metrics to assess their success.  They continue to optimize and improve the event with each successive event which is very encouraging!  ", "q2r": 5, "assessor": "z_assessor_723", "no_vca": 14, "ne": 6, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is great and really addresses the problem by giving human faces to the ideas on the catalyst community. This event is significant and I think it is a great opportunity for proposers to interact with voters. The partnership with Eastern Town Hall would be helpful for expanding the project.", "q0r": 5, "q1": "The plan of execution is detailed, specific, and measurable. The plan has measurable outcomes and associated percentages for the outcomes, making it easy to measure success. Also, owing to the experience of the team in organizing the same event in the past, I think the event would be successfully implemented.", "q1r": 5, "q2": "The proposal has an open documentation process involved which is good and helpful for tracking and auditing. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "Great proposal. the shared video explains it all and once have done it before it is very clear that you can do it again. I really wish that you could have shared numbers who participated per the various implementation. that would have helped us to appreciate your impact.", "q0r": 4, "q1": "From the information provided and the watching from the video on previous events, this is a solid team. i believe they can deliver their plan to the latter.", "q1r": 5, "q2": "the KPIs are clear for audit purposes but the actual numbers from which to strike the percentages are not given. Providing the previous numbers will appreciate the increase you seek to bring on board.", "q2r": 4, "assessor": "z_assessor_728", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The IdeaFest proposal is in line with the challenge, they have been doing this work for several Funds and it continues to demonstrate its impact in the community.", "q0r": 5, "q1": "The Swarm Session team has presented a clear plan, where they detail that they want to continue with the development of the IdeaFest in each Fund, which allows to make visible the community projects and give a voice space. Their team, plan, experience and support from the community and IOG, show that they can continue developing this activity in the future.", "q1r": 5, "q2": "It seems to me that it is easy to audit the activity they propose and they give some applicable metrics to analyze it. The only lack I see for the 5 stars, is the vision for the future, it has been funded for 2 Funds, however we do not know what the future goal is, 6 months or 1 year from now, this event will still be what it is, or does it have future plans?", "q2r": 4, "assessor": "z_assessor_729", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "Providing the platform to bring proposers and voters together with the aim of interacting, connecting and providing the stage to pitch their idea to the voters is a great initiative.", "q0r": 5, "q1": "Taking into account the team lead's experience and the track record of WADA, executing this project will be less demanding. There are well designed activities scheduled within the proposal and a well-developed timelines for each event to ease execution of the project. This shows that there is a clear work breakdown structure. Aside that, there is also a detailed breakdown of budgetary allocation for the proposal.\r\n\r\n\r\n\r\n", "q1r": 5, "q2": "The project provides a metric to monitor and track the progress and success of the project. For instance, the project intends to;\r\n\r\n1.record videos from the workshops which will be made available to the public \r\n2.Increase the number of presented proposals in each Idea Fest by 50%\r\n3.Increase the number of participants on each Idea Fest by 50%\r\n4.Increase the relative number of approved proposals in the voting process that have presented their project in Idea Fest\r\n5.Increasing the relative percentage of successful funded proposers that have presented their project at Idea Fest\r\n \r\n\r\n", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 17, "ne": 6, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "Idea fest is a great community engagement programme whose impact will actually exceed the goals of the challenge. Connecting proposers and other community stakeholders will boost the bond of the community that will affect proposal, reviews and voting positive.", "q0r": 5, "q1": "the team has already shown that it is possible by implementing the same idea in fund 5 and fund7. the evidence of idea fest in previous funds suggest that we give them a chance again", "q1r": 5, "q2": "Activities are hosted online, recorded and made available for community members, and a clear demonstration of what the project seeks to achieve.", "q2r": 5, "assessor": "z_assessor_733", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The proposal has an overwhelming impact on the challenges being addressed on the campaign. The idea has been a success in improving active participation and collaborations amongst all stakeholders and the general project catalyst community. ", "q0r": 5, "q1": "Having moderated and hosted these community events in previous funding cycles, the team can be said to have more than enough experience and capacity to continuously execute the project. Having consider its detailed budget breakdowns, it is obvious that will be implemented successfully.", "q1r": 5, "q2": "The proposal has already provided well detailed metrics to assess the performance of the proposal. Also having consider the fact that the various activities of the event will be made available and easily accessible to the community to judge its success.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}], "solution": "アイデアフェストは、提案者が自分のアイデアを発表する場であり、有権者やコミュニティが提案者と交流し、議論する場でもあります。", "experience": "私たちは、Catalyst Communityのフルタイムメンバーとして、Fund 5以来、Idea Festを成功させています。"}