{"id": 381318, "author": "manfo2021", "title": "Clubs+hackathons = Cardano adoption", "url": "https://cardano.ideascale.com/a/dtd/381318-48088", "category": 26234, "amount": 15000, "description": "独立したイベントや1回限りのイベントでは、カルダノのプロモーターとターゲットとなる観客との間に継続的な関係を築くことはできません。", "funded": 2, "upvotes": 96124996, "downvotes": 3570282, "votes_result": 92554714, "votes_cast": 384, "f6_no_assessments": 13, "f6_rating": 4.410256410256411, "videos": [], "media": [], "f6_assessments": [{"q0": "学生を対象としたコースやハッカソンのコンセプトは、次世代の人々がカルダノのエコシステムに関与し、将来の触媒提案を開発する可能性を促すという点で素晴らしいものです。このイベントは、新しいコミュニティメンバーにエコシステムを理解してもらい、自分のアイデアを提供してもらうための素晴らしい方法です。さらに、ハッカソンのような競争的な環境は、カルダノに関わる方法を探している聡明な人たちを引き出すのに最適な方法です。ひとつ疑問があるのは、成功の鍵となる評価基準についてです。高校が3校、専門学校が4校というのは決して多い数字ではありませんが、参加者が少ない場合、どのようにして良い競争をインセンティブにすることができるのでしょうか？提案者がこの質問に答えることができれば、提案を強化することができます。(評価：4点)", "q0r": 4, "q1": "提案者はソフトウェアエンジニアリングの分野で豊富な経験を持っているので、この計画が成功する可能性は高いと思います。提案書の予算は、プロジェクトに投入される時間を考慮すると妥当だと思われます。賞金とその分配方法を明確にすることは、この提案にとって有益です。\r\nしかし、提案者は、ミニコースで教えられるコンテンツの具体例について、あまり情報を提供していません。学生はどのような内容を学ぶのだろうか。提案者が具体的な例を示すことができれば、提案はより明確になるでしょう。また、提案者の将来の目標である「行方不明の人や物を探す人をつなぐ全国規模のプラットフォームを開発する」ことに、この提案がどのように役立つのかが少しわからない。この点を明確にしてもらえれば、有権者の理解も深まると思います。(与えられたスコア：4）", "q1r": 4, "q2": "提案者は、提案書の中で優れた重要業績評価指標を提示している。彼らは、6ヶ月のプロジェクト終了後に到達することを目標とした具体的な数字を設定しています。しかし、提案者がどのようにして長期的なカルダノエコシステムとプロジェクト触媒への関与を促すのか疑問です。ハッカソンの後、学生は将来の提案を開発したり、投票者やコミュニティ・アドバイザーになることを奨励されるのでしょうか？(評価：4点)", "q2r": 4, "assessor": "z_assessor_310", "no_vca": 22, "ne": 12, "ng": 10, "nfo": 0, "vca_o": 2}, {"q0": "このアイデアは非常に興味深く、他のチャレンジの提案とは異なり、ターゲットとなる人々との継続的な接触を促進したいと考えています。教育機関でミーティングやミニコースを推進し、ブロックチェーンやカルダノなどについて若者に紹介しています。なぜなら、これらの技術（エコシステム技術）は多くの人々にとって非常に新しいものであり、どんなに大規模なイベントであっても、そのような技術を学び、採用することへの確かな関心を築くには最善の方法ではないからです。いくつかのミーティングを開催すれば、新しい人々をコミュニティにしっかりと参加させることができる可能性が高くなります。ここで私が考えたのは、これらのセッションがどれくらい続くのかということだ。いくつかのセッションがあるにもかかわらず、著者はその数を明示していないので、プロジェクトの大きさを理解するためには、この概念が重要になります。また、どのようにして学生の注意を引いて、このようなミーティングに参加させるのかを具体的に知ることも重要である。報酬があることはわかっていますが、どのようなものでしょうか。報酬はADAや現地通貨なのか？ミーティングの内容は誰が発表するのか？チームメンバーはいますが、彼らが自分でやるのか、外注するのかはわかりません。彼らだと思いますが、全員がそうかどうかはわかりませんし、教えを伝えるための戦略を持つために教育界と接点を持つ人がいるかどうかもわかりません。全体的には非常に良いアイデアだと思いますし、カルダノのエコシステムに貢献するイベントを推進し、新たな参加者を増やすという課題にも合致しています。また、以下のディスカッショントピックで説明するように、これらのミーティングのためのより詳細なタイムラインを作成することも非常に重要である。", "q0r": 4, "q1": "このチームは、カルダノのエコシステムの技術に固有の知識に関して、非常によく準備されていると思います。さまざまな分野の専門家がおり、さまざまな言語を話し、ほとんどの人が長年の経験を持っています。和田グループがCatalystでかなり活発に活動していることを知っていますし（私はすでに彼らの提案をいくつか評価しました）、彼らはすでに達成したマイルストーンを指摘しています。和田グループがCatalystでかなり活躍していることは知っていますし（すでにいくつかの提案を評価しています）、すでに達成されたマイルストーンも指摘されています。もうひとつ思ったのは、このプロジェクトでは、技術的な部分ではあまり技術的な仕事も必要ではないということです。例えば、マーケティングや会議のロジスティックス、イベントそのものの制作などです。これらの部分は自分たちで作るのか、それとも他の人が作るのか。このプロジェクトを成功させるためには、マーケティングの部分が不可欠です。アウトリーチはミーティングの内容と同様に必要なものですから、その仕事ができる経験豊富な人が重要になるでしょう。また、プレゼンテーション自体にもグラフィックコンテンツがあると思うのですが（おそらくスライドやグラフィック、言っていることを視覚的に示すものが使われていると思います）、そのコンテンツはどこかのデザイナーが行うのでしょうか？それがベストな選択だと思います。今回のプロジェクトでは、この2人のプロ（広告主とデザイナー）についての言及がありませんでした。スクリプトについては、著者はより一般的に何をするのか、ミーティングでカバーされるテーマを含んでいます。しかし、もう少し詳細な情報があってもいいのではないでしょうか。例えば、いくつかの教育機関と連絡を取り合うことがわかっています（どこの教育機関でしょうか）。また、ミーティングを促進することもわかっています（日程がわかっていれば、あるいは少なくともどれくらいの頻度で開催されるかがわかっていれば、より良いでしょう）し、ミーティングで扱うテーマもわかっています（最初のミーティングではどのテーマ、2回目のミーティングではどのテーマ、というように分けることができます）。資金の分割については、提案の中でも最も表面的な部分だと思います。残念ながら、彼らが言及しているお金の各部分で何が行われるのかについて、私たちはあまり深く理解していません。例えば、9,000円の賞品ですが、それぞれの賞品の価値はどのようなものでしょうか？本当のお金なのか、それともノートパソコンなどの備品を購入して受賞者に渡すつもりなのか。チームのモチベーション/misc.その他のモチベーションでは、これはどういうことなのかという説明を入れてくれると良いと思いますが、私にはよくわかりませんでした。総じて、チーム、脚本、資金部門などの情報を提供していただきましたが、脚本、特にお金については、もう少し詳細な説明があると、より理解が深まると思います。", "q1r": 3, "q2": "著者は有効な情報を提供してくれるので、私たちは適切なモニタリングを行うことができます。ここでの成功は、2つの方法で測ることができると思います。まず、著者が引用したデータに基づいて、プロジェクトに参加した若者や機関の数を測定します。しかし、それだけではなく、参加者がイベント後に何をするのかを追跡することもできます。例えば、参加した42人の学生のうち、20人がプログラミングやCatalystプロジェクトなどの勉強を通して、コミュニティに入ることに強い興味を示したとします。そのような若者の成長をモニターすることは、プロジェクトが期待通りの成果を上げているかどうかを確認する意味でも、非常に価値のあることだと思います。要約すると、このプロジェクトの監査は非常に可能であり、それほど複雑ではないと思います。コミュニティの一部のメンバーが、著者が引用したデータに従うことを約束し（あるいは自らフィードバックを提供し）、今後の参加に興味を示した人たちのためにイベント後のフォローアップを行うだけで十分です。", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Cardanoコミュニティに継続的に参加することで得られる洞察力から生まれた素晴らしい提案だと思います。確かに現在、場つなぎ的なイベントはいろいろありますが、この提案のように、カルダノ以外のコミュニティに入り込もうとするイベントはほとんどありません。教育がカルダノの鍵であることを考えると、「カルダノ大学クラブ」の創設を通じて学校や大学などの教育機関にアプローチすることは論理的に合致しており、カルダノを紹介するための非侵襲的な方法であると言えます。教育は侵襲的になりがちで、新しいことを教えるには多くの時間がかかるため、侵襲的でないことは重要です。大学内のクラブのエコシステムと統合することで、それぞれが独自のテーマを持っているにもかかわらず、全員が交流し、お互いを知るためのメルティングポットのような役割を果たしています。現在のカルダノのアプローチでは、このような社会的側面の導入が希薄になっているようです。繰り返しになりますが、素晴らしい提案であり、拡張性があり、チャレンジに完全にマッチしています。", "q0r": 5, "q1": "提供された情報によると、証明するリンクはないものの、このチームは必要なものを備えています。教育に情熱を持っており、チームの大半が教師であり、さらにソフトウェア開発者としての経歴もあることから、これらの具体的なデータに基づいたこの提案は、うまく実行できる可能性があります。また、チームがどのような学校や教育機関にアプローチするかなどの追加情報は、チームの評価能力やこの提案の成功度を測るのに役立ちます。例えば、ブロックチェーン技術に触れることから（基礎学力の観点から）何段階も離れている学校をターゲットにした場合、この提案はおそらく効果がないでしょう。残念なことに、私がこの提案を気に入っているにもかかわらず、すべての予算構成が明確に説明されていません。具体的には、予算9000ドルの賞品の要素です。9000ドルはそれ自体が提案になり得るので、その用途を明確にする必要があります。また、モチベーションの予算として5000ドルと1000ドルがあります。例えば、ゲストスピーカーの招待、YouTubeにアップされた教育的でモチベーションの高いビデオ、マーケティング資料としての役割、大学でのクラブ設立のためのサービスなどです。プロジェクト管理の面では、この美しい提案がうまく実行されているという自信が持てないのが残念です。", "q1r": 3, "q2": "また、この提案は、残念ながら、どのようにして成果物を達成するのか、明確なロードマップとタイムラインを持っていません。この提案が自分たちに課した評価基準を達成できるかどうかは、「あなたの言葉を信じて」にかかっています。標準的な0-3ヶ月、3-6ヶ月の評価基準が見られると良かった。前述のように、測定可能なKPIがあり、一括払いではありますが、監査を受けることができます。問題提起と解決策には強い相互関係があり、的確である。", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 19, "ne": 12, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": " \r\n\r\nThe problem needing to be solved been identified and articulated namely that Independent or one time events do not build a continuous relationship between Cardano promoters and the target audience.\r\n \r\nIt is clear that this proposal falls within the scope of the challenge brief  \r\n \r\nThis proposal shows clearly how it adds value to the Cardano system as it would create a continuous relationship with local schools via clubs and prize driven hackathons \r\n \r\n  Key metrics are clear, reasonable and realistic. THese include  Number of schools, how many students in clubs, how many tech institutions, how many clubs,  \r\n \r\n \r\nThe key metrics and goals of the proposal fall within the scope of the challenge.\r\n\r\n \r\nProposal can scale to address future challenges by increasing the numbers of abovementioned key metrics. \r\n\r\n\r\nThis project will have a positive impact on Cardano system by increasing the awareness and skills in schools and tech institutions for Cardano Tech and skills\r\n\r\nI have given this proposal a 4 star rating because it has gone into detail and shown a realistic and reasonable understanding of the scope of work as well as a reasonable budget. \r\n\r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.", "q0r": 4, "q1": "\r\nThe proposer has   provided evidence  of himself  where he is has experience of various WADA projects that have got funding. \r\n \r\n \r\nLinks provided are sufficient.\r\n \r\n I have visited these links \r\nThe proposer is competent to organize and run this event.   \r\n \r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\n\r\nThe proposal  gives  details of other partners from different parts of Africa.  \r\n  \r\nHe has provided the team structure of partners  \r\n\r\n \r\n The budget has  been outlined broadly and broken down into identifiable items. General  costs have been given for the various costs. Ideally a budget breakdown should be provided.\r\n\r\nIs budget reasonable to achieve the set goals?\r\nThe budget is   reasonable to achieve the set goals.  The only point of concern is that 9000$ for prizes and 5000 for team motivation is somewhat high.\r\n\r\n\r\n\r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required.  \r\nThere is no plan for additional funding  if objectives are not met. \r\n\r\nThe timetable is realstic to organize the event.\r\n \r\nThe proposal  does not  provide  a sensible and conductible plan for implementation. IT only has a broad outline of categories of costs.\r\nResources  necessary to implement the proposal are not well described beyond broad cost centres\r\nThe proposal has no technical aspects which have need to be addressed  \r\nThe proposer has not identified risks in this proposal  \r\n \r\n \r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities\r\n\r\n\r\nGiven experience and plan presented it is possible this proposal will be implemented successfully hence I have given a 3 star rating. I would have given a 4 star rating if a proper budget and schedule of actual costs, and activities was given along with a timeline.\r\n", "q1r": 4, "q2": "There is a  roadmap with milestones and a time horizon for achievement  but with only broad goals.  how these are to be acheived is not laid out. \r\nThere are  clearly defined Metrics/KPIs that define the success of the proposal  they could define number of schools, how many students in clubs, how many tech institutions, how many clubs, how many new wallets.\r\n\r\nThere is a clear understandable description of the targeted problem  \r\nThe proposer has not identified possible hurdles, challenges and difficulties. \r\nAre there contingency plans in place for various outcomes?\r\n \r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\nThe information provided is sufficient to audit the progress and the success of the proposal hence i have given a 4 star rating. ", "q2r": 4, "assessor": "z_assessor_460", "no_vca": 17, "ne": 4, "ng": 5, "nfo": 8, "vca_o": 1}, {"q0": "''Clubs+Hackathons=Cardano adoption'' the tile of their proposal shows how the proposers are pushing the idea one step ahead of common ideas on community events. I feel they would like to scale up the community members involvement and participation. This idea clearly aligns with the challenge ", "q0r": 5, "q1": "Metrics, KPI and budget are well detailed. What I feel is missing from my opinion is to describe how will those hackathon prizes be won. \r\nAlso, the universities and schools may have been described, and their level of involvement in this project as partners.\r\nHaving prizes for participants and other motivation would attract more people, and also would help students cover some of their school related expenses, which will encourage them to stay involved. And get them start using the Cardano, while receiving the ADA token through various prizes.", "q1r": 5, "q2": "WADA as a main partner in this proposal, is a guarantee about auditability and evaluation of the success.\r\n", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 17, "ne": 2, "ng": 14, "nfo": 1, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I have organized various events and know about the importance of setting them up properly content-wise for them to be successful, so I am confident I can determine whether their concepts are set up in a meaningful manner. Since I am also Participating in catalyst since several funds I am competent to determine what kind of community events could be beneficial. The proposal identifies an important problem within the challenge which by adressing it, will bring an great benefit to the Catalyst community and the Cardano ecosystem - by increasing the traction and adoption of Cardano by continuous efforts. The key metrics and goals of the proposal align excellently with the outlined challenge settings.\r\nSince WADA is a great multiplicator and keeps establishing,  it can sure be said that the proposal is able to scale to address future challenges.", "q0r": 5, "q1": "WADA are a really active and established part of the Catalyst community. Without a doubt they will be able to successfully implement this proposal. The proposers know the type and number of team members required to implement the proposal and basically have a large group as their support network. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": " Well-defined, detailed metrics are presented that define the success of the proposal. A clear, understandable problem description is supplemented by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 17, "ne": 4, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "The club & Hackathon proposal will give the meaningful recurring events to promote Cardano. The example of which are content creation, Clubs & Hackathon events. It fits within the challange nicely.", "q0r": 5, "q1": "The Wada team has organized the monthly meetups regularly. The team has good track record to implement the project successfully. The roadmap,  budget and KPIs are mentioned in the proposal. The KPI should be revised upward to reach the full potential of this proposal. ", "q1r": 4, "q2": "The project budget is traceable as they will detail how much they will spend on clubs, hackathons etc. Suggest that they increase their reach in KPIs and address risk & challenge fot  the project. ", "q2r": 4, "assessor": "z_assessor_653", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "The project team, Wada have initiated and supported a number of monthly introduction to Cardano meet-ups across hubs in France and Africa. This project is aimed at the introduction of Cardano and blockchain technology in schools in Africa, adding value to the Cardano ecosystem through diversifying particiaption and opportunity to young people that are seeking to leverage technology to grow their future careers. The project is aligned with the challenge and increases particpation and engagement through incentivised hackathons using Cardano technology. \r\n\r\nThe project has a local focus, however it is a model that could be tested and refined for other regions as mentioned in the proposal the WADA team have plans to implement this in the USA soon. \r\n\r\n\r\n", "q0r": 4, "q1": "Schools are notoriously difficult partners to engage so seeing that the team has two qualified Maths teachers involved from the outset gives some indiciation that there will be a solid understanding of how to engage and integrate this project within a school setting successfully. \r\n\r\nThe team have some impressive experience that is aligned with the objective & have demonstrated expertise through already working in this space in multiple locations. \r\n\r\nThe timeline and budget are clear and specific, project timeframe is 6 months with clear objectives within this period to be achieved, and attached to budget allocation. There's little discussed around risk, however it does appear the team have expertise relevant to working in school environments and would be able to handle this space. ", "q1r": 5, "q2": "The project timeline and budget are clear so there is a way for the community to ensure the project is on track. It is however very much locally driven which would require the project team to develop some way for them to report back to the community to share updates with the progress of their project. ", "q2r": 4, "assessor": "z_assessor_699", "no_vca": 14, "ne": 5, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "I strongly agree with the proposers about the problem statement 'Independent or one time events do not build a continuous relationship between Cardano promoters and the target audience'. This is definitely within the challenge which need to be solved. The proposal clearly articulates how it will add value to the Cardano system as well as how it fits into the challenge.\r\n In my opinion, it is a great idea because the proposal's target audience are young students (in local schools, universities and technical institutions) who will be human resource potential for Cardano system, and because the proposal's purpose is create a strong and committed relationship between those people and Cardano ecosystem by reoccurring events in schools and universities through Hackathons sessions and Cardano Clubs. While single events introduce contents (about Cardano),  continuous events will make that contents go deeper in people's minds and surely make a good connection participants-participants as well as participants-Cardano system.", "q0r": 5, "q1": "I agree that the proposal is likely to be successfully implemented because of following points:\r\n- The proposal decribes in detail what being done in the past and present (success organizing monthly meet-ups with contents about Cardano, Project Catalyst, and Blockchain technology and success established active hubs in some African countries). The team also provide link to be evidence. Additional, the proposal provides type and number of team members and roles in the proposal. That means the team has ability and experience and relevant skills to implement the proposal successfully.\r\n- The budget is clear and broken down into identifiable items and reasonable to achieve the set goals.\r\n- The prosal provide a plan in which what is being and done as well as how to do in 6 months. (They also have already had connections with 5 local schools. That is an advantage for the success of the implementation.) \r\nHowever, I would recommend the proposal should add the timetable to complete the work in each step.\r\n", "q1r": 4, "q2": "The proposal has roadmap and clear understandable description of the targeted problem as well as the solution that addresses the problem. Metrics are also clear and easy to audit. Therefore I rate auditability with a score of 4. \r\nHowever I recommend the proposers should add milestones and time horizon in every two-week or every month , so that it is easier for the community and the challenge team to audit the proposal. ", "q2r": 4, "assessor": "z_assessor_714", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "As the goal of this proposal is to reoccur events in schools through hackathon sessions and club, this proposal fits into the challenge settings. If this proposal is implemented, Cardano undoubtedly will benefit. ", "q0r": 5, "q1": "With the information provided I believe the team is experienced and skilled. The budget is stated and broken down into identifiable items and for me that is good. The plan is reasonable to implement the proposal. The proposal has not expressly outlined challenges that may arise from the implementation of the proposal.", "q1r": 4, "q2": "The proposal provides a roadmap. Milestones are vague. The proposal has not stated a time horizon for implementation of the proposal. However, the targeted problem is well described.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "Great initiative, I think the reward would stimulate healthy competition for an exciting engagement at events in Cameroon. The target group is one that has a lasting future and would impact meaningfully the lives of students.", "q0r": 5, "q1": "The team has great experience to deliver the project successfully. It is great to have an educator on board. This would help easy adoption and set-up club on campuses. Clubs are effective in creating continuous engagement. \r\n\r\nThe KPIs are specific and measurable as well. With a well-defined success, it would be easy to implement the practical step outlined in the proposal. ", "q1r": 5, "q2": "The proposal has a detailed road map of activities and has established partnerships within the community for easy tracking and auditing. I think this would impact greatly in Cameroon and should be supported.", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 17, "ne": 1, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "I agree with the fact that developing a sustained interest about the cardano block chain in the minds of new community members requires incentives and a sustained hosting of hackathons events. Therefore this proposal is well defined to address the challenge.", "q0r": 5, "q1": "Taking into account the team leads work experiences and that of the experience of WADA in the Cardano community makes them ideal to handle this project. More importantly, the target audience that is the students, is well captured and there is a well-developed timeline for the proposal. Also, there are well outlined events scheduled within specific timeline for the project and a work breakdown structure is also incorporated within the proposal. The events scheduled for the proposal will definitely increase the cardano presence in the various selected schools in  Ghana and also increase the user base.", "q1r": 5, "q2": "By way of determining the progress and success of the project, the team intends to meet set targets. For instance, the team intend to engage;\r\n1. 3 high schools \r\n2. 4 technical institutions and also ensure that \r\n42 students are also present in any cardano event participating\r\n  3. create 7 cardano clubs in the schools.\r\n", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is about continually hosting of training events with rewards mechanisms for competitions across various participating institutions  towards a particular targeted audiences. The idea within the brief and requirements of the campaign and its immense benefits to onboarding new members to the ecosystem ", "q0r": 5, "q1": "From the information, am convinced that with experience and skill presented by the team, it seems very obvious that this proposal is very feasible. A point to note is the plant to collaborate with other experts across the region(WADA). However, I would have expected that the proposal considers any potential risk factors that derailed the goals of the project considering the global health issues and having to deal with local institutions and schools across the country, this information will be helpful.", "q1r": 4, "q2": "The success measures to assess the progress of the project is adequate to monitor its success although a detailed roadmaps and /or stages of deploying would helpful in assessment of the proposal.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 17, "ne": 1, "ng": 11, "nfo": 5, "vca_o": 1}], "solution": "クラブ活動や賞金付きハッカソンを通じて、地域の学校と継続的な関係を築き、カルダノのエコシステムへの深い関心を喚起する。", "experience": "ワダ・カメルーン・チームシニアソフトウェアアーキテクトと教師（15年以上の経験者）"}