{"id": 384076, "author": "cardano4climate", "title": "Cardano4Climate Community Events", "url": "https://cardano.ideascale.com/a/dtd/384076-48088", "category": 26234, "amount": 4181, "description": "O impacto de Cardano na mudança climática deve ser mensurável. Eventos e reuniões são cruciais para conectar desafios locais e soluções orientadas por missão", "funded": 2, "upvotes": 109109384, "downvotes": 9475141, "votes_result": 99634243, "votes_cast": 873, "f6_no_assessments": 9, "f6_rating": 4.777777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "Como um membro ativo da comunidade Catalyst, um organizador de eventos/comunidades e um cidadão da Terra muito preocupado com as questões climáticas que estamos prestes a enfrentar, concordo plenamente que esta iniciativa produzirá um grande impacto, não apenas para a comunidade através dos Eventos que estão hospedando, mas também para a comunidade mais ampla do Planeta, visando ajudar a resolver dois problemas-chave, o Desafio um e o da Terra/Humano.\r\n\r\nA proposta tem uma declaração clara em como criar esse impacto, resolvendo um problema específico, que é impulsionar uma comunidade consciente e promover a capacidade do Cardano de ajudar na solução de aspectos críticos do problema climático.\r\n\r\nOs objetivos do desafio procuram permitir que eventos comunitários promovam a participação, a bordo de novos membros, formem novas equipes, etc. e esta proposta se alinha muito bem com todos esses objetivos, fornecendo KPIs relevantes para provar isso.", "q0r": 5, "q1": "O cronograma e os marcos propostos e claramente delineados, o cronograma proposto é adequado e o número de eventos como uma combinação de semanais (12) e mensais (3), pode ser alcançado, com base nas evidências, no histórico e na equipe designada.\r\n\r\nA equipe é composta por vários membros relevantes da comunidade Catalyst, que não só são muito ativos dentro da comunidade, mas também já estão realizando outras iniciativas e projetos. Eles demonstram uma boa combinação de habilidades e conhecimentos para formar uma equipe diversificada e bem preparada, à altura do desafio.\r\n\r\nO orçamento solicitado embora seja detalhado e muito específico, é meio conservador, prevejo que alguns custos serão mais altos do que o delineado na proposta, continuo confiante de que o projeto será feito de qualquer forma, conforme o apoio da WADA e da SWARM, mas teria sido melhor solicitar uma quantia adequada que não crie dúvidas nessa frente.\r\nTambém se você estiver planejando ter outras fontes de financiamento, como com os 150 membros da comunidade, fundos pessoais ou através da colaboração com outros grupos, recomendo que mencione isso na proposta, para mostrar ainda mais transparência e viabilidade.\r\n\r\nComo acontece com muitas propostas neste espaço, que visam uma produção contínua de eventos, pode haver alguns riscos no caminho, que podem ser mitigados se forem identificados e compreendidos adequadamente, que devem fazer parte da proposta sobre os próximos fundos, para mostrar como você planeja abordar a continuação e a sustentabilidade da iniciativa.\r\n", "q1r": 4, "q2": "A Linha do Tempo, Marcos e KPIs fornecidos são específicos e bem pensados, com conceitos SMART dentro deles.\r\nA comunidade será capaz de acompanhar e auditar este projeto sem problemas, e também os proponentes serão capazes de fornecer claramente provas e provas de realização.\r\nO github fornecido e o compromisso de documentar e publicar todas as atividades produzidas será um grande recurso para produzir também provas públicas dos esforços realizados e do impacto.\r\n", "q2r": 5, "assessor": "z_assessor_288", "no_vca": 20, "ne": 12, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "O tema desta proposta é premente, pois aborda uma parte do \"Risco Existencial\" que nossa sociedade está enfrentando atualmente, que é a Mudança Climática. Como esta proposta aborda esta questão dentro do contexto do Desafio é criando um espaço para que indivíduos com os mesmos interesses discutam este tópico e eventualmente apresentem uma proposta sobre ele que utilize a cadeia de bloqueio Cardano. Uma nova comunidade refrescante sairá desta proposta, abrindo uma variedade de novas soluções que talvez o Projeto Catalisador nunca tenha visto. Tudo isso aborda vários cenários de Desafio; desde o embarque e integração de novos membros ao Catalyst, usando eventos para criar novas equipes e workshops/braak out rooms para aumentar a colaboração. Infelizmente, porém, o fornecimento de conhecimento técnico e os regulamentos de apoio à união da mudança climática com a cadeia de bloqueios faz com que isso seja um pouco menos prioritário. Resumindo, Cardano precisa de mais desenvolvedores. O caso da \"Agricultura Regenerativa\", embora logicamente, ecológica e numericamente faça sentido a longo prazo, é muito perturbador e demorado para facilitar a sua aplicação no mercado atual. Especialmente com a covidez, os agricultores e tais precisam de uma reviravolta rápida para lucrar.", "q0r": 4, "q1": "Embora não existam links para verificar sua experiência, a equipe é um membro ativo da comunidade. No mínimo, 5 em cada 8 são altamente ativos e continuamente fornecem valor ao Projeto Catalisador através de contribuição direta e ao ecossistema Cardano, através de propostas financiadas. Não há dúvida de que esta proposta será bem sucedida. Seu orçamento, embora muito claro e acompanhado de planos de ação correlatos, levanta novamente questões sobre o sistema ou estrutura do Projeto Catalisador. Como poderiam 8 membros ativos e comprovados que estão criando uma nova equipe totalmente nova, eles mesmos, com uma bola baixa? Um orçamento de apenas 4.000 dólares para 8 indivíduos durante 3 meses? Inicialmente, pensava-se que esta era uma questão de proposição, mas este é o 7º caso de baixa de bola. Quanto ao cronograma de implementação também é claro, ele procura acompanhar seu projeto piloto. A única diferença aqui é que eles estão pedindo financiamento para desenvolver esta iniciativa para que ela possa ter impacto e atingir mais indivíduos. Infelizmente, eles não consideraram os riscos e desafios potenciais que poderiam enfrentar na implementação posterior de seu movimento.", "q1r": 4, "q2": "O roteiro fornecido é muito detalhado e há marcos suficientes que tornam o rastreamento deste evento auditável. Isto também leva em conta seus KPI's, embora nem todos sejam acompanhados de números, os KPI's centrais são de fato mensuráveis. Embora tanto a declaração do problema quanto a solução se conectem, a mensagem destinada a ser entregue é um pouco vaga. Em sua declaração de problema, está escrito: \"O impacto do Cardano sobre a mudança climática deve ser mensurável\", as perguntas são: \"Por quê? Se a resposta é para que as pessoas possam encontrar gravações, discussões e dados sobre o assunto para construir consciência e know-how, então isto se sobrepõe ao trabalho de QA-DAO. Que no caso da QA-DAO, seu trabalho é fazer e propor um trabalho estelar. O conteúdo da proposta é ótimo e tinha um objetivo claro, mas não sabem como a aparência desta proposta se desenvolverá no aplicativo do eleitor.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 17, "ne": 9, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "C4C cresceu uma pequena proposta em uma comunidade que agora é difícil de perder para qualquer pessoa envolvida com Cardano e Catalyst.  Eles trazem uma voz positiva e orientada a soluções para o diálogo sobre mudanças climáticas, centrada na sustentabilidade de Cardano e na capacidade do Projeto Catalisador de ajudar a encontrar soluções e alcançar o sucesso.  Sua proposta atual procura aumentar a exposição desta mensagem dentro da Comunidade Catalisadora, e com esta exposição encontrar e desenvolver propostas que abordem a mudança climática e a adoção de Cardano.  Essas propostas, por sua vez, devem escalar todo o esforço para impulsionar a adoção de Cardano como uma cadeia de bloqueio sustentável para o futuro.  ", "q0r": 5, "q1": "Esta equipe de proposta já implementou muitos dos resultados desta proposta, incluindo salas de descanso e reuniões regulares e organizou eventos como suas \"Metas de Sustentabilidade Catalisadoras\" com 7 horas de conteúdo e colaboração, resultados que poderiam ser 3x ou melhores se o financiamento for gerado.  Eles forneceram diretrizes claras para a disposição do orçamento, e prazos para a entrega das primeiras reuniões (basicamente instantaneamente).  Sua equipe é entusiasta e extensa, uma verdadeira barganha para este orçamento e uma prova de seu compromisso.  Eles forneceram uma série de KPIs específicos que podem perseguir dentro da comunidade, tais como a adesão discordante ao longo do tempo, mas também sugerem a capacidade de aumentar o twitter e o alcance do youtube, o que tem potencial para trazer mais participantes de fora da comunidade Catalyst, de modo que essas métricas são igualmente valiosas.", "q1r": 5, "q2": "Como o produto desta proposta será um monte de vídeos e eventos disponíveis ao público, deve ser fácil para a comunidade acompanhar, e desde que foram financiados originalmente no Fundo6, eles têm sido bastante ativos engajando-se com os outros e mantendo todos atualizados.  Além disso, esta rodada de financiamento indica um desejo de aumentar ainda mais sua transparência, registrando um repositório github público (talvez considere ser adicionado ao QA-DAO gitbook?) que será útil para qualquer um que queira acompanhar o projeto desde o seu início.", "q2r": 5, "assessor": "z_assessor_811", "no_vca": 17, "ne": 10, "ng": 7, "nfo": 0, "vca_o": 2}, {"q0": "Strengthening climate action in the Cardano ecosystem is fundamental to strengthening our competitive advantage as one of the lowest carbon footprint blockchains on the planet.  \r\n\r\nIt would be a mistake to ignore the power of engagement and commitment that ecological concerns possess. Today, they are an issue that breathe for itself. Their rationale is clearly understandable. Their ability to inspire the best in human beings, that fire that is believed to be lost in the darkness of the everyday world, is incredible. So, as a matter of both strategy and human decency, Cardano4Climate and its related initiatives should be as high on the Cardano agenda as they are on the global agenda of the 21st century.\r\n\r\nTherefore, when talking about community events, this proposal must have all the support it can possibly offer.  Also, look at their budget figure: $4181.  I bet all my chips that no proposal presents its budget figure in dollars and cents (181).  A sign of honesty and commitment. Every drop of budget used for exactly what is required.", "q0r": 5, "q1": "Please provide more detailed information about the budget.  The information presented is too general.", "q1r": 4, "q2": "Its KPIs are adjusted to the reality of events implementation and are presented as instruments that are easy to measure and relate to the progress of the proposal. ", "q2r": 5, "assessor": "z_assessor_541", "no_vca": 17, "ne": 2, "ng": 7, "nfo": 8, "vca_o": 1}, {"q0": "This is a meaningful project that will help a lot to human life now and then, developing more to spread this meaning is the mission of humans, not just this team. As the team said in the proposal, this project will have a strong impact globally and will inspire everyone about Cardano community. \r\nThe KPIs shows clearly the team is really concerned about what challenge givens and they're trying their best for making a better impact on not just Cardano ecosystem but human life. ", "q0r": 5, "q1": "The team had held 1st event in 11/23/2011 and also hosted a lot of Catalyst event. Hence, no doubt that they can do it further. They have a well-explanation about what will happen in this project that helps the roadmap make sense. About the budget, is reasonable with their 1-week event plan. \r\nMoreover, they have shown clearly how feasibility this proposal is in detail with the past experiences and future co-create with other partners. \r\nThe budget required in the scope of this project is reasonable", "q1r": 5, "q2": "They have a detailed roadmap, inspired KPIs and milestone that includes monthly goals and overall metrics guideline. Those infos is fulfilling to help to audit easily this project. \r\nThe team also states the content of the problem in very detail, and that helps their solution make sense and perfectly to solve that problem ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 21, "ne": 1, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "Awesome idea. Not creating a 'one size fits all' climate solution but driven to host community focus events to discuss climate ideas and provide a participatory solution-based with community members involvement.", "q0r": 5, "q1": "Given the experience and strategic collaboration with other community members, I trust the team to deliver. The proposal has a detailed round of activities and specific and achievable outcomes.  ", "q1r": 5, "q2": "There is more than one process of documenting activities within the proposal. It tells much about the teams' transparency and openness. I think the metric for tracking success is open and easy to follow as well. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The heighten urgency to address climate related problems within the climate community provides the opportunity for the cardano community to show how eco-friendly the cardano community is. Indeed a mission-driven solution to solving climate change will help market the cardano brand. Therefore funding this proposal is laudable.", "q0r": 5, "q1": "The experience of the team in the Cardano community cannot be overestimated hence their track record makes them the ideal team for the climate change project. More importantly, there are well outlined events scheduled within the project and a work breakdown structure is also incorporated within the proposal as well as a well-developed timeline for the proposal. The events scheduled for the proposal will definitely increase the awareness of climate related problems and also enhance the cardano brand. Additionally, the proposal also provides a detailed breakdown of the budgetary allocation for each activity the team seeks to undertake. Therefore, with the inclusion of a well-developed timelines for each event and a proper budgetary allocation, it will be very easy implementing the project successfully when given the fund.", "q1r": 5, "q2": "By way of determining the progress and success of the project, the team intends to meet set targets. For instance, the team has an expectation of increasing its; \r\n  1. Monthly growth rate of their telegram channel & discord server by 33% per month\r\n   2. Average number of participants in Cardano4Climate meetings & events by 50% per month\r\n   3. Number of Followers on Twitter\r\n   4. Number of Video-Clicks, Likes & Followers on YouTube\r\n", "q2r": 5, "assessor": "z_assessor_732", "no_vca": 17, "ne": 6, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "I totally agree that this proposal is creating a robust and collaborative environment, promoting engagements, discussions and iterations about  a particular niche that  is of  tremendous importance  to the global environment and using cardano ecosystem to chart the way to a sustainable global climate through collaborations in free, transparent and friendly manner. ", "q0r": 5, "q1": "The proposal has given more than enough information on the capacity and competence of the team to implement the project successfully. In addition, the well articulated plans and budgetary breakdowns goes to indicate that the proposal is highly feasible", "q1r": 4, "q2": "Am convinced that the proposal has provided adequate and effective measures to assess its progress and performamce if funded.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 20, "ne": 1, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "With all of the talk surrounding the negative environmental impact of Bitcoin, it would be a huge selling point to position Cardano as not only better for the environment (due to our proof of stake approach) but also as a true visionary in the space. Having the opportunity to convene and plan a coordinated approach is a great idea.", "q0r": 5, "q1": "It is outlined in the proposal the experience that the core team brings to the table. The feasibility and project plan are all explained in a very detailed manner. If the in-depth nature of this project shows anything, it's that this team notices the details.", "q1r": 5, "q2": "The team has outlined their success metrics, budget, and project plan. With this in mind, we have all the necessary information to determine their success if funding is approved.", "q2r": 5, "assessor": "z_assessor_964", "no_vca": 24, "ne": 4, "ng": 13, "nfo": 7, "vca_o": 1}], "solution": "Organizar, facilitar, expandir, promover e registrar eventos mensais e reuniões semanais", "experience": "Hospedado após as salas de descanso da prefeitura durante o Fundo 6\nRealização de reuniões semanais prévias à prefeitura desde meados de outubro\nAcolhido o primeiro evento 11-23-2021"}