{"id": 384003, "author": "cryptotexty", "title": "Cardano goes to Milan", "url": "https://cardano.ideascale.com/a/dtd/384003-48088", "category": 26234, "amount": 25000, "description": "Podemos organizar um evento de alta qualidade na Itália, para atrair/interagir com um bom número de pessoas interessadas no Ecossistema Cardano?", "funded": 1, "upvotes": 44453448, "downvotes": 14543371, "votes_result": 29910077, "votes_cast": 255, "f6_no_assessments": 11, "f6_rating": 3.8181818181818175, "videos": [], "media": [], "f6_assessments": [{"q0": " \r\nThe problem needing to be solved has been identified and articulated namely there is no high-quality event in Italy, to attract/interact with people interested in the Cardano Ecosystem\r\n. \r\nIt is clear that this proposal falls within the scope of the challenge brief by Organizing a conference to reach Milanese community\r\n \r\nThis proposal shows how it adds value to the Cardano system by organizing a conference in a high value city location.\r\n \r\n  Key metrics  have  been stated clearly. They include Number of attendees, Percentage who become CAs, Percentage who become referrers, Number of brilliant proposals to solve local problems, Percentage who become proposers, Number of students who create native cardano wallets, no of new voters, local Haskell Developers, Number of schools who participate, Number of corporates who participate. \r\n \r\nThe key metrics and goals   fall within the scope of the challenge\r\n   \r\nProposal can possibly scale up by bringing in new schools and universities, corporates and organizations. \r\n\r\nThis project will have a positive impact on Cardano system by enabling ease of seeing events going on as well as listing yhour own event\r\n\r\nI can say that this proposal  adequately addresses the challenge   hence i have given it a 5 star rating.\r\n \r\n\r\nIf this does not receive funding for whatever reason, one way proposer can improve it is by continuing to build and send press releases to media of your country or social media relating to your subject. Sometimes that one step might motivate someone to view the link and add credibility for your project and give him a better idea on the project which enables him to vote for the project. \r\n\r\nYou can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise.\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country.I have done live event with guests in studio, discussing various topics on the State Broadcasting Channels for both National and International audiences.\r\n", "q0r": 5, "q1": "\r\nThe proposers  has  provided some evidence  of themselves with their skills and experience in  conference management. His name is  given and  profile links on Linkedin are given.   \r\n \r\n The links are sufficient. \r\n \r\nI have visited the linke.\r\n  \r\n \r\n The proposers may be experienced and competent to do the event. But only one event has been given. So with just one event I cannot call a person experienced but can say he has experience of organizing one event. \r\n\r\nDoes proposer know, in an identifiable manner, the type and number of team members required to implement the proposal?\r\n The type and number of team members required to implement the proposal is not fully known\r\n \r\n \r\nThe team structure is listed as the two leaders but other team members are not listed.  \r\n \r\n \r\n The budget has  been given in detail. It is somewhat high in my professional opinion as a CEO of a web development company for over 10 years and organizer of various events.\r\nMost of the money has been allocated for conference venue, incentivizing organizers and beer and apertivo which are unnecessary expenses in my opinion. \r\nAlso travel expenses of resources persons is another expense. In this case a better option is to have an online conference. Another large cost component is refreshements and gadgets\r\n \r\nThe budget is not reasonable to achieve the set goals.   \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required \r\n\r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\n \r\nTheres a realistic timetable  to complete the work\r\n\r\nDoes the proposal provide a sensible and conductible plan for implementation that shows not only what is being done but also how?\r\n \r\nThe proposal gives  a sensible and conductible plan for implementation.  .\r\n \r\nResources  necessary to implement the proposal are  described.   \r\n  \r\nThe proposal has technical aspects which have  been addressed \r\n\r\nThe proposer has not identified risks in this proposal  \r\n \r\nGiven experience and plan presented it is possible this proposal will be implemented successfully\r\n This proposal is detailed but budget is much higher than it could be if considered a little more, hence I have given it a 3 star rating.   \r\n\r\nA piece of advice... You can also look more into developing a contingency plan if for any reason your original plan does not work out. This planning is very favorable when CAs and voters consider proposals since more often than not, what we think will happen wont happen but some complication or issue will arise. A proposer who has considered this, would be looked on more favorably since it shows that they are prepared for various situations and eventualities", "q1r": 3, "q2": " \r\nThere is a clearly laid out roadmap with milestones  \r\n \r\n There are  Metrics such as Number of attendees,  Number of brilliant proposals to solve local problems, Percentage who become proposers, Number of new native cardano wallets, no of new voters.\r\n   \r\nThe problem has been  understood and solution has been given in  detail but the solution is not a cost effective one based on projections and cost centres.\r\n \r\n    The proposer has not identified possible hurdles, challenges and difficulties.\r\n\r\nAre there contingency plans in place for various outcomes?\r\n\r\nThere are no contingency plans in place for various outcomes.\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal but the budget is very high hence I have given it a  3 star rating.\r\n ", "q2r": 3, "assessor": "z_assessor_460", "no_vca": 14, "ne": 4, "ng": 4, "nfo": 6, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I have organized various events and know about the importance of setting them up properly content-wise for them to be successful, so I am confident I can determine whether their concepts are set up in a meaningful manner. Since I am also Participating in catalyst since several funds I am competent to determine what kind of community events could be beneficial. The proposal identifies a valid place where a community event could have an impact and will, if executed correctly, add value to the Cardano ecosystem. The key metrics, goals and general planning however are formulated well so it can be said that this proposal aligns with the challenge. In general, the proposal seems to be a bit unfinished in ist planning. While scalability is adressed implicitly, it cannot be said for sure it will be well considered, as the plan for the event simply is not detailed enough", "q0r": 4, "q1": "The claims of the proposers are valid and assign them some competencies. The budget is outlined clearly and broken down into identifiable items.  No planning for the case of additional funding being required is presented. A sufficient timetable for the planning process is done. However, no detailed plan on what the events should contain is presented. The plan vaguely and implicitly describes the resources necessary to implement the proposal, however only to the degree of mentioning that some local people will be included and some contacts already exist. The proposers discuss some risks, like the Covid-sensible scheduling of the event, but beyond that not a lot of planning is presented. Feedback: Make a more structured plan for your proposals, considering everything likes resources, risks and details of the implementation.", "q1r": 4, "q2": "Sufficient metrics, milestones and a problem description is provided. The solution description could however be more detailed, e.G. about the event contents.", "q2r": 4, "assessor": "z_assessor_52", "no_vca": 17, "ne": 5, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "This proposal effectively address the challenge because it gives a clear solution to the defined problem statement.\r\nBut, defined problem from the proposers is not actually a problem but a solution. If you want to reach out to the Milan community and present the cardano to the possible adopters the problem should be defined like: Increase cardano reach within Milan population. Maybe also do a little research before like a questionnaire on the street (Have you ever heard of a cardano blockchain?) So, just from perspective point of view this proposal's problem statement  should be updated.On the other hand future scalability is huge and potential impact on cardano Ecosystem could be  very rewarding.\r\nDue to the above I can agree with this proposal.", "q0r": 4, "q1": "For the feasibility I rank this proposal as very likely to be implemented with considarable level of success;\r\nteam is presented and capable (done similar in the past), detailed plan is existing, budget is reasonable. Therefore I strongly agree with this proposal.", "q1r": 5, "q2": "Proposal's progress can be easily audited with clear deliverables (roadmap and timings are presented) and good transparency. KPI and metrics should be updated (for example attendance statistics, number of rasied questions during a conference topic, etc..). Also risks and possible challenges are not mentioned inside this proposal and that is the reason I have to \"only agree\" with this proposal. Missing points should be updated by the proposer.", "q2r": 4, "assessor": "z_assessor_605", "no_vca": 13, "ne": 4, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "This proposal to a certain extent does addresses 3 (three) issues in the Challenge settings. Such are; onboarding and integrating new people, utilizing workshops/hackathons to increase collaboration and using events to build new teams. Though there must be an emphasis on 'to a certain extent', because this proposal does not specifically mention Project Catalyst but the Cardano Ecosystem. There is no fault in that, but the Challenge setting does continuously mention Project Catalyst. This also continues into the metric to be measured, which the majority are related to components in Project Catalyst, such as; CA's, voters and proposals. The proposal articulates well the preparation regarding the event, but besides increasing general awareness of Cardano and having 1-to-1 hackathon sessions, there is limited mentioning of how this event will effect or add value to the Cardano Ecosystem. The specific materials that will be presented during the event is also not mentioned. Hence, the 3-star rating of it's effectiveness in addressing the challenge.", "q0r": 3, "q1": "On the basis of creating the event itself, given how one of the proposer provides links to their track record, previous achievements and the information provided in this proposal, the event will be held successfully. On the basis of value added or achieving metrics of the Challenge setting would most likely be unsuccessful. Though this might not be down to lack of skill but more due to non-existent action plan to achieve those metrics. Budget provided although high, is sufficient. Further break down of the budget would garner more credibility, most specifically the action with the highest budget, which is marketing. Timeline provided is also clear, with adjoining action plan that is also moderately detailed. Proposer has also assessed the potential risk and challenge this proposal may face and has adjusted to that potential risk and challenge by adjusting the day and adjusting the month when to have the event. This proposal is very close to becoming highly effective, recommend to try again and while at it, to participate in workshops held by the Catalyst School.", "q1r": 4, "q2": "There are roadmaps, some form of metrics in the shape of action plans that have an intended goal but very limited measurable KPI's. The only clearly measurable KPI is the intended attendance of 100 individuals (including students and professors). Unfortunately, although there are a lot of wording in this proposal there is insufficient data that would be able to be audited responsibly. The problem statement is not a statement, though the solution is clear and concise. These disconnects between problem statement and solution tends to lead to a proposal that are not concise also. Again, this proposal is very close to becoming a highly impactful proposal. Please do seek out individuals from the Catalyst School to learn more on the methods of creating a proposal.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 18, "ne": 9, "ng": 9, "nfo": 0, "vca_o": 1}, {"q0": "The proposal has been worked out well and is in line with the campaign briefing. This event could be a meaningful entry to increase Project Catalyst. This is only 1 event with 100 participants, the impact will be rather small I guess. I see a well fleshed out event with a lot of content, this event could serve a larger number of visitors, if I see the rather ambitious size of the event. Feel free to be a bit more ambitious in your attendance. The city, Milan, is certainly well chosen in terms of impact.", "q0r": 4, "q1": "Good that one of you has already organized an Open Source Event, that provides knowledge, yet 2 organizers seem rather little. (in the end you are talking about 5 organizers?) Are there any relevant partners to help organize this event? Which expertise do you need and are in your network allready? How you are going to select these people? It is very good to take the language barrier into account, but be aware that this requires a lot of extra budget. Is this worthwhile if you only want to reach 100 people with the event?", "q1r": 4, "q2": "The timeline is clear and looks realistic, but again I wonder if the budget is worth the number of visitors. Maybe the university can host the location so less budget is needed? The 'extra costs' are also a bit high and rather serve as a buffer. Compensating the 15 presenters seems fair to me, but I wonder, how long will this conference take if 15 presentations are given? Or do they go on simultaneously so that visitors have to make a choice?", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 13, "ne": 3, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This proposal is related to organizing a high-quality event in Italy. This proposal's problem statement did not likely describe the problem, some questions should be clarified (ex: Cardano community lacks high-quality event in Italy? and/or there are some high-quality events in Italy about Cardano but with low attraction ?).\r\nThe solution is quite clear, and fits the challenge, with expected impact in long term (transforming this event into a \"Cardano Summit Italy\"). My advice is: proposer should rewrite the problem statement by considering adding more details for proving authentic, urgent...\r\nTherefore, based on the given information,  I agree with this proposal's impact and rate this proposal with a score of 4.", "q0r": 4, "q1": "The team's description is enough for understanding with suitable skill, experiences for implementation, but no reference/proof (documents/links,...) for varifying. There is no information of similar experience is provided, is there any similar event organized by your team before. The budget is provided in detail with items structure and explanation. Risk (and mitigation) is not provided. My advice is: (i) Proposers should provide more details with documents/links for feasibility verification (ex: LinkedIn, Twitter,...); (ii) Defining risks with mitigations.\r\nTherefore, based on the given information I am neutral with this proposal's feasibility, and rate a score of 3", "q1r": 3, "q2": "The proposal provided a lot of informaton. The team's description is enough for understanding without reference/proof (documents/links,...) for verification, this makes it difficult to verify the information and monitor the community. The budget is provided in detail with items structure and some explanation of conference venue. Besides, risk (and mitigation) is not provided. My advice is: (i) Proposers should provide more details with documents/links for feasibility verification (ex: LinkedIn, Twitter,...), especially for Mr. Adrii; (ii) Besides the conference venue, other budget items should be explained in detail (ex: why $6000 for marketing and why $7000 for incentivizing presenters/organizers ?,...)\r\nTherefore, based on the given information I am neutral with this proposal's feasibility, and rate a score of 3", "q2r": 3, "assessor": "z_assessor_679", "no_vca": 14, "ne": 3, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "The proposal is brilliant. The proposal attempts to address the challenge. I appreciate the fact that cardano ecosystem will benefit absolutely from the proposal. \r\nI can also see that the goals aligns with the challenge of the proposal.", "q0r": 4, "q1": "Given their qualification, the team is made up of professionals. I also appreciate the fact that they have each organized cardano events previously. But I will suggest that next time you include links and references. It is good that the number of team members are stated and identifiable. The budget presentation is good because I can actually see a breakdown of the budget (amount) in into identifiable items. The team didn't outline risks/challenges that are involved with the implementation of the proposal.", "q1r": 4, "q2": "Roadmap, milestones and time horizon for the achievement of the proposal are stated. That's great. However, what is missing are the KPI/metrics for the proposal's success. The proposal has a clear and understandable solution to tackle the problem.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 10, "ne": 1, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "Great proposal and it effectively seek to increase community participation. With Milan as a strategic location, I think the location would serve as a diffusion point to help easy adoption and acceptability of Cardano ecosystem.", "q0r": 4, "q1": "This is achievable and the team has what it take and immense experience to implement the proposal. Also, there is an established partnership within universities to help in the execution of the project. The project has stated a specific target of 100 participants and such a marketing strategy in place, it can be more.  My little concern is how the proposer seeks to mitigate possible COVID restrictions.", "q1r": 4, "q2": "There is a detailed breakdown of the budget associated with activities. I think this is great for transparency and auditing. ", "q2r": 5, "assessor": "z_assessor_727", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The essence of each cardano project is to ultimately expand the cardano ecosystem. This project provides the platform to address such a challenge. The project takes into account not only the short term growth in Milan but also across the country Italy.", "q0r": 4, "q1": "The proposal provides a clear picture of its target audience, which is the youth. Aside that, the team has experienced personnel who prepared to push the project to achieve its goals. Also, the project provides a clear work breakdown structure outlined to execute the proposal from the start to the finish. Additionally, the project provides a clear timeline for each event, with a set target for both the short and long term. Finally a detailed breakdown of budgetary allocation is provided for the proposal. Without a shadow of doubt, I'm clear in my mind that this project will be executed successfully when provided the fund.", "q1r": 5, "q2": "The proposal has a well outlined time line for each event and a set target for each event, this makes it easy to track the success of each event. I'll also suggest the team develop a database to capture the details of all newbies at each event so as to engage them further on the cardano project.\r\n\r\n", "q2r": 4, "assessor": "z_assessor_732", "no_vca": 14, "ne": 3, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "it is a great idea but bringing on board 100 visitors is a small impact given the background you gave to the setting, Milan.\r\nOut of the 100 visitors how many do we expect to become proposer, CAs, vCA, voters etc which are the true measure of success for this challenge", "q0r": 3, "q1": "the team behind this proposal is a great team per the information provide. the plan is is quite clear but what i wish to have seen is an evidence of previous workdone images or video format.", "q1r": 4, "q2": "the plan is elaborate and the budget is well digested to assist in auditing purposes", "q2r": 4, "assessor": "z_assessor_733", "no_vca": 13, "ne": 1, "ng": 8, "nfo": 4, "vca_o": 1}, {"q0": "There is much to like about this proposal, and the idea of holding an event in a financial and cultural center like Milan. Italy is ripe for outreach. That being said, the challenge is about holding community events around Catalyst, not Cardano more broadly, and the proposal suffers a little by not even mentioning Catalyst in the body of its text. If this project moves forward it should definitely make a point to include some events about Catalyst and decentralized governance.", "q0r": 2, "q1": "Mr. Suzzi has experience that fits the task and there is little doubt that they could pull off an event like this successfully. I would like to see more detail on Mr. Voloshyn and what exactly he brings to the table, and the proposal suffers a bit for lacking that. I like that they plan to hold sessions in both English and Italian, which is essential. But it is also curious that neither individual behind this event appears to be Italian themselves. I could be wrong on the details of that since I don't have their full biographies, only that they're from Switzerland and Ukraine respectively in broad strokes. Regardless, if they're successful they'll have room to grow, and I'd hope they would plan to have at least one native Italian on their team in the long-term \"Cardano Summit Italy\" plans they mention. ", "q1r": 4, "q2": "The costs are well laid out, if a bit on the pricy side. It would be an improvement if they could lay out some media that could be produced as a result of this event. Footage of any of the more prominent sessions, for example. Events like these can grow quickly largely because the events themselves can serve as material for publicity and it would reflect well on the team if they were prepared for that.", "q2r": 3, "assessor": "z_assessor_853", "no_vca": 14, "ne": 1, "ng": 11, "nfo": 2, "vca_o": 1}], "solution": "Organizar um evento em Milão: um centro financeiro líder na Itália, em uma área densamente povoada rodeada por muitas Universidades e empresas.", "experience": "Um dos proponentes é especialista em marketing\nUm dos proponentes já organizou um evento de código aberto em Milão, em 2017"}