{"id": 384672, "author": "azlankonma", "title": "KONMAHOOD - Defining Communities.", "url": "https://cardano.ideascale.com/a/dtd/384672-48088", "category": 26234, "amount": 30000, "description": "Uma verdadeira plataforma comunitária democrática para aprender, sinergizar e compartilhar opiniões só pode existir em um espaço descentralizado. Problema? Ainda não existe.", "funded": 1, "upvotes": 30755610, "downvotes": 14431471, "votes_result": 16324139, "votes_cast": 222, "f6_no_assessments": 5, "f6_rating": 3.8, "videos": ["https://www.youtube.com/watch?v=Wr7DTGQLxyE&start=5055"], "media": [], "f6_assessments": [{"q0": "The proposal aims to create a social media platform created specifically to merge all the branches of their ecosystem. Much like a classic internet-forum, but with specialised functions. In the problem statement, it is said that 'a democratic community platform to learn, synergize & share opinions' does not exist yet. In a way, Project Catalyst's Ideascale is kind of like such a space. Perhaps a collaboration in the future could mitigate Project Catalyst's limitations on Ideascale. ", "q0r": 5, "q1": "The platform seems pre-built and ready to roll out with some minor changes to the structure. There is no clarification on who is in the proposing team, how many members there are and what their individual capabilities are. Adding this information would improve the proposal. ", "q1r": 4, "q2": "Like all their proposals in this fund, Konma has provided very good auditability factors to track progress, except for one: information on the team. This could elevate their proposals quality to near perfect. ", "q2r": 4, "assessor": "z_assessor_113", "no_vca": 22, "ne": 1, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "The challenge objectives ask for increased participation in Catalyst with better collaboration. This proposal meets those objectives creating a space for people (specifically proposers, CA's, voters) to meet and help develop their own knowledge and their proposals thus potentially leading to better quality proposals being submitted in each fund. There are a couple of elements bugging me. 1. the proposal starts off with a bold statement of calling itself a 'decentralized space' however it has the hallmarks of a closed community. Registering on konmahood is not immediate, the user needs to be accepted and the community is focussed around India. This geographical restriction could hinder progress as many experienced catalyst members across the could help accelerate this initiative.  ", "q0r": 4, "q1": "Of the $30k requested , if we take away the incentives amount that leave 50%+ of the funds for the trainers. As this is a key element of the proposal i would have expected to see named resources with their relevant experience listed. In addition this TTT funding looks excessive without explanation or if the proposers explored collaborations with other community members (eg Catalyst school) who could help accelerate this and bring the costs down thus making for a better value for money proposal. \r\nHaving delivered multiple digital platform over the last 10 years the timeline and deliverables look sensible.\r\nThe finances overall need further explanation. Konma is promoting itself as an established organisation but is asking for money for zoom and milo software, this needs an explanation. Also what do project coordinators do exactly? Voters need to see they are getting value for money here. \r\nI would suggest the proposers use their time in ideafest or oaths platforms to really drive this home to voters or this proposal could easily get sidelined in favour of one offering more value for money.    ", "q1r": 3, "q2": "The KPIs listed have the right idea but need to be more specific.eg monitoring the total number of proposals submitted by the catalyst tribe is great but what is a sensible target for Fund 8? Voters need to see results. All KPI's should be reviewed to make them specific and measurable.", "q2r": 3, "assessor": "z_assessor_45", "no_vca": 15, "ne": 3, "ng": 10, "nfo": 2, "vca_o": 1, "reply": "Impact/ Alignment\nResponse:\nThe platform is a decentralized space as we mentioned and is in beta testing stage, hence has limited access to avoid the issues of bots infiltering the platform which we have seen here in Ideascale as well, as it seems like Bots assessing the proposal which all look similar. Once the testing is done with the existing group of individuals we will be opening the platform for all users. Any decentralized platform starts off with testing and then becomes completely decentralized. It is also stated in the proposal that we are a global platform open to all. Instead of marketing to the whole world, we chose to start with targeted marketing from south east Asia as the phase one of the project. \n\nFeasibility\nResponse:\nIn the budget we have specified software including zoom and miro to name a few. The assessor has pointed out that Konma being an established organization is asking for money for these software. We are an established organization that uses paid software that is essential. The request here is to setup an exclusive software to run the events and workshops for Project Catalyst to build the community.\n\n    "}, {"q0": "This proposals intention, although noble, seems to misunderstand Project Catalyst and all the communities and projects that was born from it. What this proposal is trying to create is basically Project Catalyst without the backing of funds. Quoting their problem statement and solution, 'A true democratic community platform to learn, synergize & share opinions can only exist in a decentralized space.' + 'Konmahood is where we plan to build strong communities governed by the DAO. An exclusive space for users to form tribes, learn and be free!' which is the general definition of Project Catalyst and it's community, the difference being Project Catalyst focuses on the use of Cardano. The other difference being is Project Catalyst is on its way to become a DAO. Since it is Project Catalyst, it indeed does fit all the Challenge settings. But since it is a duplication of effort, this proposal will not be effective. Reckon to please be more involved within the community if they have not. Please also review all the Town Hall recordings to have a better understanding of Project Catalyst. If that seems time consuming, please join the Project Catalyst Discord Channel and communicate there. Please do not be discourage though, since the proposers shares the same values of Projecet Catalyst, high possibility a good proposal will come from the proposers in the future.", "q0r": 2, "q1": "Having reviewed all links, IG, Twitter, Facebook and all their LinkedIn profiles I will only share the data that I have found. The founder states Konmahood was founded 3 (three) years ago. Yet, their Facebook earliest entry is the date April 3rd 2020, their IG earliest entry is the date April 14th 2021, their Twitter account has only 1 (one) follower and was opened on June 2021 with no tweets. Their Head of Social Media joined on January 2021, which meant she had ample time to create content. Their Head of Technology is a crypto-trader who associates himself with Binance Exchange since 2015. To my understanding, Binance was founded in 2017 (can be verified here; https://www.techinasia.com/cryptocurrency-exchange-binance). There are numerous discrepancies that needs to be taken account. This is not implying anything only reporting findings. Based on the data above, this proposal most likely will not be implemented successfully on the basis of the performance of their Head of Social Media, and the founders assessment of their Head of Social Media's performance. If at that very level, that is the benchmark to be expected, creating the complicated deliverables of this proposal will be unachievable. If this assessment would like to be challenged, please do. Prior to that, please DYOR starting from this link : https://www.konma.community/pages/about-us", "q1r": 1, "q2": "A detailed roadmap and milestones are clearly provided, with accompanying equally detailed action plan. A lengthy KPI is provided but will be difficult to measure for it has no clear targets. Problem statement and solution are also solid and interconnecting. Again, when these two elements are done right, it usually translate into a solid proposal.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 18, "ne": 3, "ng": 7, "nfo": 8, "vca_o": 1, "reply": "Impact/ Alignment\nResponse:\nThe fact pointed out by the assessor is that we are “trying to create a Project Catalyst without the funding” Our rebuttal is that, maybe the assessor didn’t fully understand what we were proposing and what Konma’s essence is. If we were hoping to create a Project Catalyst to mention the exact words the assessor has used which are “duplication of effort” we wouldn’t be applying on Project Catalyst in the first place. \nWe are all people who have ideas and ideologies, some similar some different so just because two people believe in the same thing doesn’t make one person’s idea inferior. That said, the whole idea of decentralization we believe is to take away this competitive thought process that is common in the corporate world and that is why we truly believe in the values of Cardano. The assessor also kindly went on to add what is the difference between Project Catalyst and Konma and we can’t stop ourselves from thinking that maybe the assessor understood what Konma is doing but still chose to say we are duplicating the effort of Project Catalyst. \nFor the benefit of the VCA, we are repeating the brief of Konma. We are on the pursuit of building a decentralized community and already have an existing platform that is on beta testing and is open to a few people on request. This platform is called Konmahood. The goal of the community is to learn, share knowledge and grow. Konmahood hosts multiple niches that are broken down into tribes ranging from Farming, Health and Wellness, Performing arts, Chocolate Making, Biotechnology to name a few. Blockchain is just one of the niche that we have on Konmahood. Our proposal on Community Events challenge was to use this very platform (a resource we have that we are ready to use for betterment) to bring awareness and more people to participate in Project Catalyst. This we hope to do by creating a tribe exclusively to bring people into one place - “The Project Catalyst Tribe” from multiple other tribes on Konmahood we mentioned above to get further information on Project Catalyst, take part in mock proposal submission and help people who want to become CA’s to better assess these mock proposals. We will also host workshops on various topics which also include blockchain and it’s use cases which is one of the many topics we do. This will bring more refined proposals to Project Catalyst and more proposals from various fields. If two projects cannot function with similar ideas then most of the online marketplaces, cab service brands, food delivery brands, which we are all aware of are also duplication of each other? We believe we are very much in alignment with the challenge and do not agree with the assessor’s rationale and scoring.\n\nFeasibility\nResponse:\nThe assessor actually took the effort to visit all the links related to the team and has come up with an investigative report. Let us start with the assessor saying, “The founder states Konmahood was founded 3 (three) years ago. Yet, their Facebook earliest entry is the date April 3rd 2020, their IG earliest entry is the date April 14th 2021”. Any venture starts from the day the idea was translated to papers and we have a registered company from 3 years ago. Also, to clarify that the venture is named Konma as opposed to what the assessor has stated as “Konmahood”. You can check our Linkedin profile to clarify that. The assessor has correlated the starting of a company based on the entries in social media. We could have deleted the posts and redone the feed at our convenience which we are not answerable to anyone. Sadly, the validity of the company depends on our social media presence is what the assessor arrived at. Marketing is not just on social media, at least not for us. We have multiple on-ground marketing strategies like social experiments and the likes and online marketing strategy which is internal to us. Simple question and we might be wrong, but we don’t seem to find Cardano’s official Instagram handle. Does it say Cardano’s marketing is poor? Project Catalyst and Ideascale has fewer participants when compared to Ethereum and the likes, does it diminish the efforts of Cardano that has been existent since 2017 and their efforts put in since 2015 to develop the project? We believe in Cardano for the values it holds and not the number of followers it has on social media platforms. Marketing has been existent even before social media era and businesses have functioned but the assessor seems to be inclined towards social media relevance. This is why we are structuring Konmahood (our decentralized social media platform) to be a democratic forum that doesn’t function on number of likes and followers. We have a strong marketing team and that is why the “Our give back to earth” project has planted 300k trees entirely by volunteers that we brought in. Another thing pointed out by the assessor is the fact that our Head of Technology mentioned that he is associated with Binance since 2015 though it was founded in 2017. We are thankful that the assessor pointed this discrepancy which was a mere mistake from our teammate’s end. Instead of mentioning Bitfinex he had mentioned it as Binance and the error has been rectified from our end which was a genuine mistake. Individual personal branding is their own choice and our tech head is someone who doesn’t prefer to be active on social media platforms, but still has cracked deals with Mlabs and the likes. Diminishing someone’s effort and ideas just because they aren’t active on social media is sad. The assessor ends by saying “this proposal most likely will not be implemented successfully on the basis of the performance of their Head of Social Media. If at that very level, that is the benchmark to be expected, creating the complicated deliverables of this proposal will be unachievable.” This comes to show that the assessor has made up his mind and believes that we are not capable. This seems more of a judgment with conviction than an assessment which the assessor is free to have. But being in a community that we believed uplifts each other and gives constructive criticism (which we have experienced in this community), the assessor showed that you can put someone down by dragging in some data that is baseless. The assessor as it seems started off with the assessment believing that we are duplicating something and decided to stick to the thought. We do not agree with the rationale and scoring provided by the assessor.\n\nAuditability\nResponse:\nWe have no comments on the Auditability. We do have a clear roadmap. We humbly take the point on improving the KPI.\n"}, {"q0": "This project will help to deploy smart contracts on the Cardano chain easier and can help utilize sales tools for an easy ICO process. This is what a lot of upcoming projects in Cardano ecosystem want, therefore it will make a high impact on the Cardano ecosystem. But I advise the proposer that they should make more content to show that this project will add value to the Cardano ecosystem. \r\nThe project KPIs and product KPIs that the proposer provides are aligned with the challenge settings. ", "q0r": 5, "q1": "The proposer state clearly the action plan of the project into pieces that can help us understand well what this project will bring to the public. Their roadmap is divided into 2-week sprints which each focuses on solving 1 big problem, hence the budget they required is reasonable with that roadmap and implementation plan. \r\nAlthough the proposer provides a link to their website, I still hard to find the info of this team independently, this team also sent many proposals to fund7 that all of them make a big picture of their platform. Hence, for easier assessing these proposals, my recommendation is that the proposer should give some team info", "q1r": 4, "q2": "The proposer stated the roadmap clearly, and with KPIs, the desired outcome of the project I think this proposal has enough info for auditing. \r\nThe proposer also shows us the context of the problem and how advantage this project can address it. My advice only for the proposer is that should show some risk and how the team can control it because this is a piece of a big picture, which means it's very complex and has a lot of potential problems", "q2r": 4, "assessor": "z_assessor_671", "no_vca": 13, "ne": 3, "ng": 5, "nfo": 5, "vca_o": 1}, {"q0": "The proposal aims to improve active participation of the  catalyst community members from a particular Indian sub continent using an already existing platform and even to reach and engage new members from this region. This is a holistic  approach to ensuring active collaborations and participation of catalyst members and onboarding of new members. In my opnion, the proposal has the potential to positively impact on the campaign goals and objectives.", "q0r": 5, "q1": "Having an existing and robust social platform which is being bootstrap the idea is fantastic and from the information provided on the roadmaps and its budget implementation, am convinced that this proposal can be effectively implemented.", "q1r": 4, "q2": "There is more than enough information provided by the proposal to assess  and verify what success would look like if this proposal is funded.", "q2r": 5, "assessor": "z_assessor_9", "no_vca": 18, "ne": 1, "ng": 10, "nfo": 7, "vca_o": 1}], "solution": "Konmahood é onde planejamos construir comunidades fortes governadas pelo DAO. Um espaço exclusivo para que os usuários formem tribos, aprendam e sejam livres!", "experience": "Konma tem um fórum comunitário existente usado para o aprendizado onde diferentes nichos são divididos em tribos como as tribos blockchain & crypto."}