{"id": 384974, "author": "nftdao", "title": "College Student Recruitment", "url": "https://cardano.ideascale.com/a/dtd/384974-48088", "category": 26234, "amount": 9600, "description": "Como novas oportunidades de carreira surgirão com o uso crescente de estudantes de tecnologia de cadeias de bloqueio precisarão de oportunidades de mentoria.", "funded": 1, "upvotes": 41676055, "downvotes": 12540077, "votes_result": 29135978, "votes_cast": 271, "f6_no_assessments": 10, "f6_rating": 3.9666666666666663, "videos": [], "media": [], "f6_assessments": [{"q0": " \r\nThe problem needing to be solved has not been identified and articulated clearly namely blockchain technology students will need mentorship opportunities which they dont currently have.\r\n. \r\nIt is clear this proposal does fall within the scope of the challenge brief   by putting on workshops to get students educated on the new opportunities the Cardano chain presents and connect them with projects.\r\n \r\nThis proposal does show  how it may add value to the Cardano system by putting on workshops to get students educated on the new opportunities the Cardano chain presents and connect them with projects\r\n \r\n  Key metrics have  been presented at all.  THey include how many colleges have relationships been built with , number of student entrepreurs, web traffic metrics\r\n  \r\nThe proposal can scale to address future challenges by carrying out more  workshops and engaging more universities. \r\n \r\n\r\nI can say that this proposal  adequately addresss the challenge needs, hence i have given it a 4 star rating.\r\n\r\n\r\nI am qualified to write this assessment based on being a translator since 1992 at the State Broadcasting Corporation as well as since that time,running my own translation agency, working with the two native languages of my country as well as working on various translation projects into other languages, including translation, transcription and proofreading. I have also been an event organizer in various capacities, both through my company and on a voluntary basis for youth groups and churches.  I also have run a web development company from 1997 and have been the author of many ground breaking projects in web and Flash related projects in my country. Also I am an educator , teaching English both online and in real life and am an ICF Coach in training.As such I am familiar with Neuroscience and its benefits. I am also involved in AI and ML projects. \r\n ", "q0r": 4, "q1": " \r\nThe proposers  hasnt  provided evidence  of themselves with their skills and experience   \r\n The links arent sufficient. \r\n  \r\nThe proposers cannot be said to be experienced and competent to do the project  as yet\r\n \r\n The type and number of team members required to implement the proposal is not stated.\r\n \r\n \r\nThe team structure isnt  listed and experienced.\r\n \r\n \r\n The budget has not been given in detail. It is broad and has no details of cost breakdowns but has some designated cost centres.\r\n  \r\nThe budget is not reasonable to achieve the set goals. \r\n \r\n \r\nThe proposer has not provided a verifiable plan if additional funding is required  \r\n\r\n \r\nThere is no plan for additional funding  if objectives are not met. \r\n \r\n\r\n \r\nTheres a realistic timetable  to complete the work. \r\n \r\n \r\nThe proposal doesnt give  a sensible and conductible plan for implementation.  . \r\n\r\nResources  necessary to implement the proposal are not described.  \r\n\r\n\r\nThe proposal has no technical aspects which have been addressed \r\n\r\n \r\nThe proposer has not identified risks in this proposal  \r\n  \r\n This proposal is detailed and budget is not reasonable hence I have given it a 3 star rating.   \r\n", "q1r": 3, "q2": " \r\nThere is a roadmap with milestones  \r\n \r\n There are  some Metrics given by proposer.  How many relationships with colleges, how many student entrepreneurs, web traffic metrics.\r\n   \r\nThe problem has been understood and solution has been given broadly.  \r\n  \r\n \r\n    The proposer hasnt  identified possible hurdles, challenges and difficulties. \r\n  \r\n\r\n\r\n\r\nNonetheless one piece of advice for the proposer.  Make as many metrics which you can track easily. Use Trello or Notion or some similar project management tool.\r\n\r\n\r\nThe information provided is  sufficient to audit the progress and the success of the proposal but the auditability of the budget remains in question, hence I have given it a  3 star rating.\r\n ", "q2r": 3, "assessor": "z_assessor_460", "no_vca": 16, "ne": 3, "ng": 6, "nfo": 7, "vca_o": 1}, {"q0": "The targeting of college students is highly effective, the incentive to get involved with blockchain is very high amongst college level students, however there is uncertainty about how to go about doing it. By providing mentorship to these students it introduces them to the ins and outs of Cardano and will hopefully allow them to engage with the community.", "q0r": 4, "q1": "The proposer's field is in retail. This is useful in the ability to network and build relationships with people and colleges, however it is important to gain the expertise of someone in education to allow for the successful mentorship of the students.\r\nHaving worked in education, especially in teaching technical skills to college aged students, it is important to have a fleshed out and clear plan for the mentorship and teaching for which it would be useful to have the experience of an educator.", "q1r": 3, "q2": "Clear success criteria have been laid out, giving the plan for the next 12 months. However the criteria are quite vague and more detail of how to quantify the success would be useful", "q2r": 4, "assessor": "z_assessor_525", "no_vca": 18, "ne": 3, "ng": 10, "nfo": 5, "vca_o": 1, "reply": "Impact/ Alignment:\nThe proposals isn't aimed at solving a particular problem but instead geared toward increasing meaningful participation, onboarding new people into Project Catalyst, and to building new team within our community. \n\nAuditability:\nMy transport costs are based on my average mileage cost between these different Universities with the current Colorado gas cost factored in. It used the average miles driven to calculate my cost."}, {"q0": "This proposal is very interesting, it starts from the fact that blockchain technology is growing and more and more students in the technology field would be interested in working with it. Therefore, it would be beneficial for the Cardano ecosystem to promote classes/courses that teach these students to work with their technologies. In this way, \"events\" would be carried out with the purpose of instructing them. It is positive that the author already has in mind a place (Colorado) and even better, some universities, where he can start to apply the work. This demonstrates that he thought about the practice of the project, beyond just a theoretical and abstract plan. He also has a very specific target audience, which would be computing and design students with more than three years of training, which is another way to demonstrate how he already took care of the pragmatic details of the thing. I believe that, even though it is not a traditional event, it is an action that will promote the union of people in favor of learning (can you call it a hub?), and the products that would result from such meetings would be very impactful for the ecosystem. Therefore, I believe that the proposal is very relevant and positive for this topic of analysis.", "q0r": 5, "q1": "Unfortunately at this point I will have some observations of aspects that are worrisome. Starting with the author's preparation: he gives us very little about himself, we don't know what his background was; how many years he worked in the drop shipping field (I didn't even know this term and I had to do some research to understand); his area of ​​professional activity has nothing to do with the technologies of the Cardano ecosystem (at least I didn't see any relationship, if there is, it would be necessary for the author to clarify); it does not define the formation of a team, we do not know which other professionals would be involved in the project (many would be needed: marketing, professors, designers...); in general, the author seems to me unprepared to carry out this proposal. Nothing here gives me the feeling that he has the technical knowledge to turn the project into reality, despite having given some practical details, as I mentioned in the topic above. About a script: it doesn't exist. The author does not determine which activities would be carried out to achieve the final product, in which order, how long each would take, etc., that is, we do not have any information on how the process of carrying out this proposal would take place. And finally, the budget division even exists, but it is very lacking in detail, when he talks about transport, for example. Take who where? Hours of work: who would work for how many hours and at what hourly rate? Anyway, there is an almost complete absence of the items analyzed in this topic, I suggest that the author reformulate the proposal including the necessary information.", "q1r": 1, "q2": "In terms of auditability, it is better than the topic analyzed above, but there is still a lot to be improved. The author provides information on what success would look like, but this is done in a very superficial way. For example, he sets 3 months to enter into contact with universities. Why would it take so long just to establish initial communication? He says that in 6 months, 2 university clubs should be up and running, but he doesn't specify what that would be like. For example, how often would they be taking class? How many students are expected, on average, per class? And the success metrics are existent but they are also very shallow, I didn't understand the \"web traffic\" part, because this event seemed to be in person, what would you need to monitor online, exactly? The other metrics are based on measuring how many students/universities were mobilized by the project, which I believe is the most basic data of the proposal. I think it would be necessary for the author to elaborate some more specific, more numerous and detailed data that would be able to give us a solid notion of how the project was being developed. It would also be great if there was some contact with the students, to understand if they decided to work with Cardano, to hear about their experiences, the quality of the teachings passed on, etc. This part could be done directly by the community. I think there is even information to monitor the project, but not enough.", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 17, "ne": 5, "ng": 8, "nfo": 4, "vca_o": 1, "reply": "Feasibility:\nThe team behind the this proposal is NFT-DAO which is stated in the proposer document as well as highlighted in blue below the title of the proposal.\n\nThe relevant experience section is small, which doesn't leave room to elaborate on oneself and you can't insert a link to portfolios, Linkedin, etc. This is a consistent feature through other proposals as well. I don't believe it is reasonable to be sceptical about one's abilities when there isn't an opportunity for one to present them. This proposal is also carried out by the NFT-DAO's team which can be seen through the DAO's previous proposals. \n\n\"The author does not determine which activities would be carried out to achieve the final product\"; I have, it is written in the \"Success Defined section\"\n\nTo answer the second to last sentence; To take the co-proposer who uses \"I\" to reference themselves and specifically states their name will be performing the actions stated in the proposal. This will involve them driving and their working hours.\n\n\n\nAuditability:\nResponding to the first half of the evaluators comments, The time allocated in the proposal is used to find out this information because it isn't a feasible idea to get specific students schedules etc. as a metric until those this topics have been discussed with the University and the students themselves which it part of the 3 month initial startup time.\n\nTo answer the topic of web traffic matric, $1,500 is allocated to building a website for this club so that Students and Catalyst member can communicate with one another and be coordinated. This web traffic is what will be measured.\n\nTo answer the the last part of the comment, yes that is what the time is for and  is stated in the Success Defined section, almost verbatim!"}, {"q0": "The project proposed would onboard new people to the Cardano ecosystem.  It will potentially result in new Catalyst proposals.  The name \"NFT-DAO\" puzzles me.  Are we talking about non-fungible tokens? Is this a DAO?  If so it is not described well in the proposal, although presumably these could be topics covered by the groups formed.   \r\n", "q0r": 4, "q1": "The stated \"Relevant experience\" is about retail drop-shipping and does not seem related to the proposal.  This is partially offset by the steps already taken such as engaging Colorado State University.  The budget is at a high level and the proposal could benefit from adding more detail.  \r\n", "q1r": 4, "q2": "The proposal's metrics and success definition seem reasonable although I question the timeline.  Does it really take a year?  I write this assessment through the lens of my 20 years experience as a business analyst and product manager, enthusiastically supporting Cardano for the last two years.  I am not however a developer, so my analysis of highly technical features may be lacking.\r\n", "q2r": 4, "assessor": "z_assessor_607", "no_vca": 15, "ne": 2, "ng": 10, "nfo": 3, "vca_o": 1}, {"q0": "It is a good idea to involve students in the community. The increasing blockchain technologies are also the interests and challenges of these students later in their careers. The earlier they become acquainted with this, the better they grow with this development.\r\nIt makes a lot of sense for Catalyst to work with schools and universities to adapt training to the latest trends.\r\nThe creation of blockchain clubs can lead to new teams for Catalyst.", "q0r": 5, "q1": "I am sure that students from relevant disciplines are interested in this subject. The plan is realistic – 4 selected universities - the department has also been determined in advance, the proposer has a clear target group in mind. The proposer is still a student himself, so it is not clear whether he has enough relevant skills or experience. He will carry out the project alone, which is certainly possible given the size of the project. The budget is transparent and looks plausible to a student. Leading and managing 2 clubs is rather ambitious, but he can give a club member more responsibility to help.", "q1r": 5, "q2": "The roadmap is simple yet realistic, it is not clear how many members the clubs can count and whether there's a need to indicate a maximum of members. The success he describes is realistic, in the long run, this project has many growth opportunities to implement in other universities. It is not described what the duties and contents of the club are.", "q2r": 5, "assessor": "z_assessor_667", "no_vca": 16, "ne": 4, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "The proposal is an excellent idea. As the goal of the proposal is to educate students on Cardano blockchain it fits into the challenge settings and also would bring a positive impact to the Cardano community if achieved. The proposer has made use of some key metrics and that's great. The proposal has also got a long term impact potential to address future challenges.", "q0r": 4, "q1": "The proposer appears to possess skills and experience as seen in the relevant experience section. I can see some links and that's good. However, I can't see a team for the proposal. The budget is well presented and broken down. I can see some key metrics. The proposer has not factored in risks/challenges involved in the implementation of the proposal. The proposal has a comprehensive plan to help in the implementation. ", "q1r": 4, "q2": "It is good that the proposal has a roadmap and time horizon for implementation. However there are no milestones, which are also important in the success of a proposal. Also metrics that define the success of the proposal are stated and that for me is good. The problem is well stated and the proposal is geared towards providing solution.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 12, "ne": 1, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "Awesome idea. Collaborating with four specific universities gives focus to the proposal. Campus Club would be a great entry point to get students introduced to the catalyst community and explore its opportunities.", "q0r": 4, "q1": "It is great to have an existing collaboration at the University of Wyoming. Given the team experience, I think this proposal is achievable. There is a clear definition of success as well. ", "q1r": 4, "q2": "The proposal has little documentation involved which would be good for auditing. More information is needed on the auditing process of the great project. The metrics are measurable and realistic to determine success. ", "q2r": 3, "assessor": "z_assessor_727", "no_vca": 13, "ne": 1, "ng": 6, "nfo": 6, "vca_o": 1}, {"q0": "Mentorship, conferences and workshops are all great avenue for expanding the cardano user base. The idea of capturing the youth into the cardano ecosystem via mentorship in the universities is an excellent idea and will definitely add value to the cardano ecosystem.", "q0r": 5, "q1": "In the absence of funding for the project, the initial attempts of engagement and networking by the team lead with the institutions and personalities critical to this project is very impressive. This clearly shows the proposal has a clear work breakdown structure. Aside that, there is a detailed breakdown of budgetary allocation for the proposal. Meanwhile, the target audience for the project is clearly indicated. \r\n\r\n", "q1r": 4, "q2": "The details required in respect of metrics to gauge and track the progress and success of this proposal when funded is adequate.", "q2r": 4, "assessor": "z_assessor_732", "no_vca": 16, "ne": 3, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "I believe that the proposal meets the criteria of getting new people onboard and integrate  into Project Catalyst.  The proposal specifically targets University students and aims to educate and provide mentorship to connect them & increase active participation. The proposed concept has the potential to expand globally. Funds requested looks sensible however the proposer should look at the risk, eg. travel expenses, number of visits required to Universities etc.  Will the budget get consumed very quickly?", "q0r": 5, "q1": "The proposer has demonstrated an initial successful implementation of the plans by getting a couple of Universities involved and 2 new students onboard who have created their own proposals.  \r\nThe plan mentions a team but does not provide information on how many people are involved and what their roles are.  However, the proposer does seem to have good experience in delivering a web based service. ", "q1r": 5, "q2": "Yes, between the Metrics and success defined, it covers information on timeframe of engaging Universities and students.  The KPI on web traffic and student led proposals should be made more specific, eg. how many student led proposal can we expect in the next 12 months. The risk of running out of money should be flagged and mitigated. eg through scope reduction or request of further funds should this scenario arise.", "q2r": 5, "assessor": "z_assessor_774", "no_vca": 14, "ne": 3, "ng": 9, "nfo": 2, "vca_o": 1}, {"q0": "The proposal seem to basically onboard  and engage new members from college students in any particular locality thereby creating awareness about cardano and it's ecosystem and catalyst in general.\r\n In my opinion, the proposal's problem effectively address the challenge in this campaign.\r\nThe project", "q0r": 4, "q1": "There is not much information about the skill and experience profile of the team. However, the team's passion to engage and onboard new members from college environment through their platform; NFT-DAO is commendable and highly sufficient to implement the proposal successfully. In addition, considering, the scope of the project and it's comprehensive budget details, am confident that the proposal will be implemented.", "q1r": 4, "q2": "The proposal has provided success metrics to audit the proposal's performance if funded. However, there should be a clear measure about the no of new members that can on-boarded within a specified time scope of the proposal should have been included.", "q2r": 4, "assessor": "z_assessor_9", "no_vca": 18, "ne": 4, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "A NFT-DAO realizará oficinas para educar os estudantes sobre as novas oportunidades que a cadeia Cardano apresenta e conectá-los aos projetos.", "experience": "Tenho três anos de experiência com envio de produtos e tenho gerenciado mais de um milhão de unidades de produtos através de meus sites de varejo."}