{"id": 385109, "author": "awuraadwoa", "title": "Educating head porters in vocations", "url": "https://cardano.ideascale.com/a/dtd/385109-48088", "category": 26234, "amount": 40000, "description": "O trabalho infantil feminino é um problema em Gana, onde jovens fêmeas, especialmente do norte, são usadas para transportar mercadorias de um local para outro.", "funded": 0, "upvotes": 17743664, "downvotes": 22686793, "votes_result": 4943129, "votes_cast": 228, "f6_no_assessments": 20, "f6_rating": 2.05, "videos": ["https://www.youtube.com/watch?v=T3knDtCvSec&start=22270"], "media": [], "f6_assessments": [{"q0": "It's quite clear that this proposal address a solution for a specific problem. But I don't think it identifies a problem within the challenge. Where this challenge category is basically to increase active participation in Project Catalyst among all stakeholders.\r\n\r\nMaybe the proposal could be improved by adding key metrics and goals that align with the outlined challenge settings.", "q0r": 3, "q1": "First, it would be nice if we could know who is the team member behind this project proposal. Second, adding a break down for the budget would give more clearance on what the proposal is going to do with the budget.\r\n\r\nAdding a LinkedIn, GitHub or a website that we could check, would add more credibility to the project.", "q1r": 1, "q2": "It would be great if the proposer could include also a roadmap with milestones. And a KPI for what the proposer would try to achieve.\r\n\r\nAdding an understandable solution that addresses the problem and a link or place where the Cardano Community could track the project progress will also add some additional value to the proposal.", "q2r": 2, "assessor": "z_assessor_282", "no_vca": 24, "ne": 2, "ng": 19, "nfo": 3, "vca_o": 1}, {"q0": "Whilst the proposal states a problem (child labour) and provides a solution (education) it would help to maybe write down a little bit more informations on how the team plans to do this in practise", "q0r": 4, "q1": "There is no team being mentioned and no roadmap provided unfortunately. Given the provided informations I have to say I see it as unlikely that the proposal will be implemented sucessfully. I would recommend to re-submit the proposal for the next fund and add some more informations not only as attachments. ", "q1r": 1, "q2": "The proposal is really short and contains almost no informations. It wasn't really possible to properly assess it.", "q2r": 1, "assessor": "z_assessor_41", "no_vca": 22, "ne": 0, "ng": 14, "nfo": 8, "vca_o": 1}, {"q0": "This proposal does not relate to Cardano community or to blockchain in any way, thus there is no reason to assess it in relation to Fund7. \r\n\r\nFor the proposer's future application, please read and understand the purpose and criteria of the funding you are applying for first, before submitting your application. \r\n\r\nFor the project to develop outside of Fund7: Please consider justifying the return of impact on the investment of USD $40,000 into training 5-10 individuals. What would be the long-term impact? why your project is different from many more vocational projects that are being run in Ghana, and Africa in general? How can you make this project more sustainable, continuous, self-sustained and long-term? What would be your operation model to achieve those? ", "q0r": 1, "q1": "Rated 1 for being unrelated to Cardano community. \r\n\r\nFor the project to develop outside of Fund7: From considering the impact questions, please build a long-term plan with clear roadmap and milestones and KPIs to achieve your vision. There are many published case studies and new learnings on vocational training that you can easily search and benchmark from the Internet. One good example is the Out of School Youth Education program from Educate! Africa: https://www.experienceeducate.org/.", "q1r": 1, "q2": "Rated 1 for being unrelated to Cardano community. \r\n\r\nFor the project to develop outside of Fund7: After considering previous comments, please also consider describe your definition of success (in both qualitative and quantitative measures), further develop measuring and auditing approach into your working steps. \r\n\r\n", "q2r": 1, "assessor": "z_assessor_953", "no_vca": 26, "ne": 4, "ng": 18, "nfo": 4, "vca_o": 1}, {"q0": "This is a great initiative, I hope you will get the funding you needed from IOG or other sources. The reason I give this a 4 stars is I fail to see in the proposal the connection of this initiative with the cardano blockchain. This is probably quite crucial with this funding. I hope the proposer can connect with its community advisers in Ghana to work on this proposal for the next funding.", "q0r": 4, "q1": "The proposal seems to be quite informative actually. It is quite detail regarding the timeline and objective. Looking at it I sense that its proposer has experience in the field. I have to give this a 3 stars due to lack of information on who are in the team and their respective experiences though.  ", "q1r": 3, "q2": "The proposal is well prepared in this regard with clear milestones that are achievable. ", "q2r": 4, "assessor": "z_assessor_846", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "A very noble cause, however, The proposal doesn't really address the objectives of the challenge.  The score reflects this.  The proposer should explore ways in which Cardano could be used for the betterment of young females lives.  ", "q0r": 1, "q1": "Unable to assess the feasibility of this proposal, $40K has been asked for but no details on plans, deliverables, resources and budget breakdown have been provided. ", "q1r": 1, "q2": "Unable to assess this section as no metrics, KPIs, risks etc have not been articulated. The score reflects this. ", "q2r": 1, "assessor": "z_assessor_774", "no_vca": 23, "ne": 2, "ng": 16, "nfo": 5, "vca_o": 1}, {"q0": "Employment in third countries, especially women and children, is a matter of great concern in today's world.\r\nIt is essential to help them improve their lives by learning more skills, but it is not clear what and how the solution will be and how blockchain and cardano's platform will help. What are they like? (Projects by cardano have been working in Africa)", "q0r": 1, "q1": "\r\nThe proponent has work experience, but the project will have a specific team or group, need more information about the members to join, references and publicly identifiable links to community. known community, especially with community project\r\nThere is no specific roadmap for implementation and milestone yet\r\n\r\nNeed to add KPIs to monitor the progress and development of the project", "q1r": 1, "q2": "The proposed funding amount is $ 40000, but there is no clear roadmap.\r\n\r\nNeed more information about budget allocation for items: personnel, materials,...\r\n\r\nThe KPIs that define success should also be clearly stated: how long it will take, 3-6-9-12 months", "q2r": 1, "assessor": "z_assessor_757", "no_vca": 18, "ne": 1, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "this idea seeks to helps headporters in Ghana develop a skills for empower. it is a great philantropic endeavour but does not have any plan to build the cardano community which the goal of this particular challenge. the skills to be taught has no relation to technology or blockchain.", "q0r": 1, "q1": "The plan is quite clear but experience in the act of training such girls is not captured. i believe it can be implement but not within the goals of this challenge", "q1r": 1, "q2": "if this idea is implemented, extra effort will have to be put in to make it auditable because nothing of it can easily be traced online.", "q2r": 2, "assessor": "z_assessor_733", "no_vca": 21, "ne": 0, "ng": 17, "nfo": 4, "vca_o": 1}, {"q0": "Addressing girl child labor is a great initiative. And the remedy to this problem is well capture in addressing it clearly. However, it is difficult to ascertain how the project will impact on the cardano ecosystem ", "q0r": 3, "q1": "Despite the difficulty in attempting  to address a critical problem like this, the plan to execute this project is very detailed, considering the screening process to recruits these girls. Additionally, the proposal captures the specific audience (that is those willing) and the number of audience needed for the project at each stage and also outlines timeline for every event. Aside that, the proposal provides a detailed breakdown of budgetary allocation. This will make it easy to implement this project\r\n\r\n", "q1r": 4, "q2": "Having a data base for monitoring the young ladies who will be recruited unto this project will make it easy to monitor and track the success of the project. However, the absence of a clear number of ladies to be recruit for the project should be relooked at.", "q2r": 4, "assessor": "z_assessor_732", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "A great idea to support the plight of head portals but it seems to me that this proposal will not meet the goals of this section, Community events. The proposal should look for an opportunity to it up for a more appropriate challenge. it is a great idea.", "q0r": 2, "q1": "WADA is an experience team and i believe a proposal submitted under the name will see the light of day. the proposer has not given any evidence of previous workdone.", "q1r": 4, "q2": "there is a problem with the budget calculation. Either the conversions are not right or wrong use of Ghana Cedis and Dollar signs. Please check and put it right because it seems to have made the amount higher than the impact expected.", "q2r": 3, "assessor": "z_assessor_728", "no_vca": 18, "ne": 0, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "Great idea. However, much is needed to make a great proposal. How would the girls be tracked or supported to make sure they have abandoned the head-port business? Also, the proposal did not detail the exact vocational skills to be taught to these girls and how they would suit the business environment in the northern part of Ghana? ", "q0r": 2, "q1": "The proposal should share relevant information on team experience and a detailed plan on how the proposal would be achieved and define success.", "q1r": 1, "q2": "The proposal should include transparent processes, budget breakdown, and documentation of activities to help easy tracking and auditing. ", "q2r": 1, "assessor": "z_assessor_727", "no_vca": 22, "ne": 0, "ng": 13, "nfo": 9, "vca_o": 1}, {"q0": "This is a great proposal. However it would be good you state whether the training would be formal or informal. In order words would they be enrolled in vocational institutions or they would be taught the skills traditionally. It is important because most of the vocational skills today require academic experts in such fields not just local experts, this is to ensure productivity in the long run. Also, I find it difficult to ascertain the benefit Cardano will gain from this proposal.", "q0r": 3, "q1": "The skills and experience of the proposer are not evidential enough because there are no links and references to prove the claim. The proposal lacks a team for the implementation. I think it would be good you make clear to the community your team members because definitely you will need helping hands to assist in carrying out the task should your proposal be funded. The goals and plan of the proposal are not outlined. These are important to ensure the successful implementation of the proposal. The budget is not well presented because it is not broken down into identifiable items. The proposal lacks risks/challenges involved in the implementation of the proposal.", "q1r": 3, "q2": "There is a clear time horizon for the proposal. But the road map and milestones are just almost invisible. I was hoping to see contingencies included in the proposal but it's actually not there, and this is important because it helps to cater for other costs that would arise outside the budget. Also there are no KPIs that define the success of the proposal. There is insufficient description of the targeted problem.", "q2r": 3, "assessor": "z_assessor_717", "no_vca": 18, "ne": 3, "ng": 12, "nfo": 3, "vca_o": 1}, {"q0": "Thank you for suggesting this project, to be honest, this is an issue that I am quite concerned with at the present time in this developed world. However, in some undeveloped countries, it still shows the lagging behind for people, especially for girl child labour. Besides that I judge your solution to this problem is still not optimal. In addition to improving the lives of those girls, they deserve a better living environment. Especially being taught until adulthood. I wish we could have communities to condemn this forced use of girls. When we have a strong enough community we can call on the international community to help them more.", "q0r": 3, "q1": "The feasibility of this project, I am a bit concerned because I have not seen your specific profile. Do you have your own team or community? As a catalyst, I would like you to give us a specific project roadmap with KPIs for this project. Your vision and how you wish to influence this issue.", "q1r": 1, "q2": "With 40000$, how can you deploy the project? From the next 3-6 months, can you build a community for this project? I suggest you use the money to create media with a specific level of influence. In addition, build a team that is trained to have more specific expertise", "q2r": 1, "assessor": "z_assessor_710", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "this proposal presents the problem of bringing together young women and teenagers entering the porter profession to learn new job skills that will help them improve their way of life. Job skills specific to sewing and soap making projects. this is a good project but it doesn't seem suitable for this challenge, the proposal does not add value to the cardano ecosystem", "q0r": 2, "q1": "The proposal does not provide references, nor disclose the identity of the implementing team or their experience to demonstrate that the proposal can be implemented. The completion date of the work has not been given.", "q1r": 1, "q2": "the proposed budget request is 40000$ equal to 20% of the test budget, for which amount i would like to have a detailed detailed plan, solutions to implement and how this budget is to be spent . however I cannot find it. Second, I can't set valid calculation of the request. it needs more editing to be able to be rated", "q2r": 1, "assessor": "z_assessor_706", "no_vca": 18, "ne": 1, "ng": 13, "nfo": 4, "vca_o": 1}, {"q0": "This proposal focuses on bringing young females who are into head-porterage together to learn vocational skills which will help them improve on their ways of living. Because this proposal is not completed, the solution is still very abstract, not clear impact, however, in my opinion, the idea related to education in Ghana is very worth trying for completing in the future. Based on the given information, I disagree with this proposal's impact, and would give it a score of 2.", "q0r": 2, "q1": "The team's profile is briefly described as supported by basic database entries, 2 years of training the youth in development and for the betterment of the country and world as a whole, however, without any proof/link for verification. Therefore, there is no proof of feasibility. Based on the given information, I disagree with this proposal's feasibility, and would give it a score of 2.", "q1r": 2, "q2": "Because this proposal is incomplete where auditability/transparency can't be guaranteed. Therefore, based on the given information, I strongly disagree with this proposal's auditability, and would give it a score of 1.", "q2r": 1, "assessor": "z_assessor_679", "no_vca": 20, "ne": 1, "ng": 11, "nfo": 8, "vca_o": 1}, {"q0": "For me, as a social worker, this is a very good idea. Ideas that empower women/people are still very much needed. I miss the link to Project Catalyst in the proposal, how does this idea want to make Catalyst visible or contribute to the ecosystem?", "q0r": 4, "q1": "The small scale of the idea ensures that the project can succeed. However, I think that just helping them with the start-up is not enough, also a follow-up and a knowledge of business management is necessary for the participants. Learning how to make soap and how to sew is not enough if they want to start their own business. The proposal describes how many people will participate in the project, but not how many people will support the participants. The budget for the participants is realistic, but extra money will also be needed to finance the mentors for the participants.", "q1r": 3, "q2": "There is a proper roadmap, 2 weeks to find candidates is short, do you already know where you will look for these women? The timing will also strongly depend on the number of people who will guide these women, if 1 person has to guide all of tthem, this does not seem feasible, especially not to start a company in 1 month.", "q2r": 3, "assessor": "z_assessor_667", "no_vca": 19, "ne": 2, "ng": 14, "nfo": 3, "vca_o": 1}, {"q0": "I really sympathize with this problem statement. Because I have seen a lot of girls who have to work hard to earn money because they don't have vocational skills. Those were very sad scenes. I really want this proposal to be successful to help those girls. But apart from giving an idea is to bring improve young females who are into head-porterage together to learn vocational skills which will help them on their ways of living. I don't really see a specific plan or solution to help those girls in any proposal", "q0r": 1, "q1": "With 2 years experience of training the youth in development and for the betterment of the country and world as a whole. Proposer can understand and find a solution to this problem. But I have not seen any evidence to support that experience of the proposer.\r\nIn addition, the lack of a specific plan and solution also makes this proposal unfeasible", "q1r": 1, "q2": "Since it's only an idea, there is nothing to audit: No budget details, roadmap, timetable, milestones, metrics, etc.", "q2r": 1, "assessor": "z_assessor_645", "no_vca": 23, "ne": 0, "ng": 16, "nfo": 7, "vca_o": 1}, {"q0": "Though this proposal is noble, its effort to provide vocational education may be misplaced. Vocational education aim is to prepare individuals with basic academic skills, industry specific skill and a broad set of transferable skills through a curriculum so these individuals would be able to find employment with the skills learned. There is no clear explanation what type of skills will be provided but since this proposal is requesting funds from Project Catalyst, we can assume the proposer wants to provide education on blockchain. If that's the case, then perhaps Cardano is not ready yet for they are still trying to find the best methods of educating for mass adoption. There is no clear bridge that guides someone from a conceptual level to a technical level. Then there's the situation of the landscape of blockchain job opportunities in the Ghana perhaps is non-existent. If the goal is to provide education so they can have a role in Project Catalyst then the whole proposal's approach should be worded different, perhaps in future iteration it could be worded as following; 'Providing Free Workshops on Opportunities in Project Catalyst.' Though this proposal addresses a problem in the Challenge setting, due to data available it at best only partially provides solution to the problem. This proposal unfortunately is not effective in addressing the Challenge and highly recommend to connect with these two following entities, WADA and Catalyst School. WADA (an African base Cardano community) to get a better feel how to integrate Africa with Cardano and Catalyst School to learn on how to submit a proposal.", "q0r": 2, "q1": "There is no further detailed information that is fleshed out in the proposal, for example; providing info of the location of the training that the proposer has done, providing a description what was trained, providing information trainer was in collaboration/under what entity, provide documentation etc. Then the fact there is no implementation plan, budget details or timeline provided makes implementing this proposal highly unsuccessful. Again, recommend to contact Catalyst School or for starters to look over all the recorded workshop held by Catalyst School in their YouTube channel.", "q1r": 1, "q2": "There are no roadmap with milestones, no measurable KPI's make this proposal very difficult to audit. Though problem statement and solution are interconnected, they are not integrated well with the Challenge parameters. Please do make an effort to contact Catalyst School and return with a revised proposal.", "q2r": 1, "assessor": "z_assessor_635", "no_vca": 22, "ne": 10, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "Great idea, the proposal is about educating young women to have a better chance in life. Also great seeing that WADA is still very much alive. The only problem I have with the proposal is the connection to Cardano. The proposer did not state this anywhere.", "q0r": 3, "q1": "Regarding feasibility, we get some information but not everything. For instance, we are missing relevant information about the proposer. They state to have experience in training youth but nowhere is mentioned with how many they are and who they are. This is crucial information to the community. We get a very well-explained roadmap and budget breakdown. I would advise the proposers to give the same amount of detail in who they are as in these 2 subjects.", "q1r": 2, "q2": "For auditability as stated about the proposal has a valid roadmap and budget breakdown. What could be more explained is how the proposers plan their actions? Where will they search for the young females?", "q2r": 4, "assessor": "z_assessor_471", "no_vca": 22, "ne": 2, "ng": 16, "nfo": 4, "vca_o": 1}, {"q0": "i strongly agree because \r\n1.  the proposal falls within the scope with the challenge and also the problem needed to be solved is been identified in the solution.\r\n2. the proposal aslso shows clearly how it will add value to the cardano ecosystem by bringing young females who are into head-porterage together to learn vocational skills which will help them improve on their ways of living.\r\n3. the goal of the proposal is also good because through this some good potentials may be lifted up from female youth in Ghana.\r\n4. The proposal also scale to adress future challengies because day in and out the number of female youth in Ghana are increasing..", "q0r": 5, "q1": "I neither agree nor disagree because;\r\n1.. Evidences, reference,link etc of relevant skills and esperience needed to implement the proposal are not provided well.\r\n2. no sufficient links provided to.\r\n3. the proposer did not identifiably in manner listed the type, number of team memebers required to implement the proposal if funded.\r\n4. budgets are also not outline clearly and brocken down into identifiable items and has not also added verifiable plan if additional is required to implement the proposal..", "q1r": 3, "q2": "I neither agree nor didagree due to;\r\n1. there are no clearly laid out roadmaps to track the project of this proposal if funded But there are clearly understanderble describtion of the targeted problem and clearly understanderble solutions to  adress the problem..\r\n2. the proposal also plans to deal with the difficulty in such a nice way but no contency plans in  place  for various outcome's ", "q2r": 3, "assessor": "z_assessor_447", "no_vca": 23, "ne": 5, "ng": 9, "nfo": 9, "vca_o": 1}, {"q0": "This is a great idea I support, but what I still see is the theme of the project\r\n  It is not clear how to add value to the Cardalo ecosystem and it is suggested that the problem can be scaled up in the future. How do you solve this problem, the project topic needs to provide enough information and documents for the CA community to see the assessment more easily, thank you", "q0r": 1, "q1": "If the proposal wants to have a high success rate, then the writer needs to give specific solutions for example how can you help young workers especially women and children in ghana, or solve any method that has an impact on this matter", "q1r": 1, "q2": "The proponent has not provided evidence and relevant factors. As for the budget, it is necessary to break down the details into small items and if additional funding is needed to implement the proposal, a specific and clear plan should be given. the proposal needs to state more about a plan to complete the work as well as how to do it, list resources for implementation, moreover it is necessary to consider the challenges and risks related to the implementation, the metric that determines the success of the proposal. It would be great if the proposal writer had a more detailed plan for the proposal.", "q2r": 1, "assessor": "z_assessor_958", "no_vca": 25, "ne": 1, "ng": 18, "nfo": 6, "vca_o": 1}], "solution": "Reunir jovens fêmeas que se dedicam à formação profissional para aprender habilidades vocacionais que as ajudarão a melhorar seus modos de vida.", "experience": "Entradas básicas do banco de dados, 2 anos de treinamento dos jovens em desenvolvimento e para a melhoria do país e do mundo como um todo."}