{"id": 396652, "author": "henokp50", "title": "Tokenized Security Exchange", "url": "https://cardano.ideascale.com/a/dtd/396652-48088", "category": 26442, "amount": 45000, "description": "Lack of marketplace for blockchain-based startups in Africa", "f6_no_assessments": 6, "f6_rating": 4.0, "videos": [], "media": [], "f6_assessments": [{"q0": "First of all, I want to express my regret when the proposer was a little careless in arranging the information for each part. After reading through the entire proposal, surely everyone realizes that you have included the detailed Impact part in the Feasibility. The key pieces of information outlined aren't unhelpful, but it's still not enough, you know. Therefore, in addition to the topic on potential risks, I will review the information related to Impact in the following part (because you left it there). And I also regret to give this part a score of 2. Please be more careful.\nThe proposer has outlined three potential risks to the success of this project, and I can see your clear perception when it comes to specific countries that will be exposed to these risks. But if possible, please also briefly outline how you would address these.\n", "q0r": 2, "q1": "First, I'm definitely going to review the information related to the Impact part that shouldn't be here.\nThe development of a project related to a cryptocurrency exchange in Africa, of course, ALIGNS CLOSELY with supporting the development of Cardano in this continent. I really appreciate the introduction of this project (Again, it's a shame it's not in the right place); the proposal fully describes the Ennarea Exchange and all three of its platforms. Featured services are also listed in detail and are easy to understand. And significantly, the ongoing trial release of Ennarea Pro will greatly increase the confidence level of investors.\nMoreover, the problems and solutions given are entirely responsive to the requirements set by the challenge, as well as linked to its KPIs. The proposal clarified who they are targeting and how their project will affect them. The Ennarea Exchange will not only increase the number of African developers in the future, but will also have local impacts in Africa through helping to raise capital for startups and simply the exchange of cryptocurrencies for the people. And, of course, with a cryptocurrency exchange established in all 56 countries, it is possible for local partnerships to be formed.\nHowever, I would still like to have a few lines to describe where the project's direct impact on the Cardano ecosystem is and whether it can be expanded in the future.\nNext, I will review the official Feasibility part.\nThere is no need to argue about the detail and meticulousness of the roadmap presented by this proposal. I can clearly see the specific milestones to the point of the month and year and the main activities for each milestone. Not too cumbersome and too sketchy, I find all the information that investors need and very detailed quantitative numbers. The fact that the demo has been tested before makes this project even more successful and solid.\nAnd thanks to such a complete Roadmap, the budget requested and financial plan are, of course, also highly meticulous. From the main categories, such as cost of materials, talent recruitment and team member costs, to subcategories related to advertising and other expenses are wholly listed very clearly. Through this excellent Feasibility part, I think investors will see the seriousness of your team and the bright future of this project.\n", "q1r": 5, "q2": "With a very well-presented roadmap above, it also means that your team has already outlined the goals and desires for the future of this project. Indeed, you have shown investors how serious you are, by being able to present them with a sharp vision of the future with full timelines and clear quantifiable numbers. However, it is a pity that you are so sketchy in describing how you will measure the progress and the development of the project. It's not enough just for the community to track the progress of your project, please distribute the information properly so that both responses are complete.", "q2r": 4, "assessor": "z_assessor_1666", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal is very well articulated and presented and it fits perfectly with the challenge settings. The team has provided a project URL for reference and it helps people to have the realest idea of the project. The problem statement is easy to understand with a very detailed analyzation of the source of the problem and the explanation of how this proposal can be a solution. The team has great ambition and the idea to create an implement of a tokenized security and cryptocurrency exchange for Africa. This fits the challenge setting and would have great impact across the community and the future of Cardano in Africa if implemented. This project is sure to add value to the objectives of this challenge. The team is skilled enough to scale with future challenges which is important for such a big task. It’s an amazing challenge to accept. If anything that can make this proposal better, then it’s some ideas to solve the main foreseeable challenges or risks. ", "q0r": 5, "q1": "I can see that every aspect of this project is covered. The team has targeted a specific market and customer segment. All the featured services are introduced briefly but enough for the community to understand the principles of how they are going to work. With the pilot release, I think the team has started to build a very solid foundation for this project. Moreover, the proposers have a clear idea on the work that needs to be done and a timeline to do it. There is a budget table explaining team salaries and timelines in months for the necessary work. It also comes with the introduction of the team members and the reference for their skills and experiences. The fact that the work has been done shows that no extra unnecessary efforts are spent. The proposers have a clear idea of the team they need to bring together. Overall it seems like a feasible project with a good team standing behind it.", "q1r": 5, "q2": "There is an open source repository where anyone can follow the progress of the proposal, it’s a great concerning the auditability since any community member can easily checkout the work being done. The key metrics are provided with specific KPIs. However there is a roadmap, so i think it’s still better if the KPIs follows the roadmap more closely. There is a clear problem to work on here and the means to solve it. It’s east to see, they’ve really thought things thoroughly before making this proposal and really digging in the business and development problems to come with out with this solution. Finally, I want to send the best of luck to the team and hope that this proposal will work out in their favour. ", "q2r": 4, "assessor": "z_assessor_1703", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal has not provided much information of the team's project. I didn't see the features or how the project were going to work. Tthe team has explained some of their ideas about how to address the challenge. However, it would be better if they could include some specific numbers so that the proposal might be aligned more with the challenge's key metrics. About the possible risks, they have foreseen them and listed them out.", "q0r": 3, "q1": "In this section of feasibility, the team has showed so much information about the team, including their problems and solutions to them. However, I think the problems and the solutions they should have put in the section of Impact, it would assure that they follow the guideline when writing the proposal. A good thing is that they have provided a roadmap of the project till July 2022 which is pretty detailed. A detailed budget breakdown was also included in the proposal, they also put the time together with the budget which might help in considering the suitability. The team members were introduced in the proposal, together with some of their information.", "q1r": 4, "q2": "They said that all the progress will be updated on their social platforms so that people can check it up. However, I think it would be better if they could put some specific numbers or targets on their works to clarify when they need to move to the next stage or what tasks should be done next. Their overview of the success has been expressed in the proposal. One more thing I wish they had done is telling if this is a whole new project or it belongs to a previously funded one.", "q2r": 3, "assessor": "z_assessor_1714", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "\nIMPORTANT NOTE: This review might be susbstantially similar to the reviews of two other proposals by the same team as the other two proposals differ in name, but are proposing the delivery of the same *The Ennarea Exchange*, with the same Roadmap, with the same Financial Plan and the same definition of success.\nThis proposal is part of a three-part array of proposals submitted in Fund 8 by the same team in three different challenges. The proposal is under different names and has different problem statements, in the case of this specific proposal the problem statement is defined as \"Lack of marketplace for blockchain-based startups in Africa\", while the solution is to develop a tokenized security and cryptocurrency exchange for Africa. The team apparently decided to split a budget request for roughly $150,000 into three proposals for a third of the sum, each. What is different is that one proposal talks about a pan-African exchange for 54 countries, while this one addresses three specific markets Eritrea, Somali, Djibouti. However, the three proposals have at their crux *The Ennarea Exchange*, with the same Roadmap, with the same Financial Plan and the same definition of success. The impact of this proposal - on its own - is difficult to ascertain, as it's financing is co-dependent on the success of the other two proposals and does not have a discrete - standalone - budget. THe entire project as a whole  requires $350,000 for the first year of project development and management. So, the impact of financing this component may be negligible as this proposal requires $45,000, which is less than one-seventh of the required funds for one year of development. The rest of the funds is figuratively \"up in the air\". \n", "q0r": 3, "q1": "The proposed Ennarea exchange seems to be very ambitious. There are many aspects to the exchange ranging from cryptocurrency trading to trading in CBDC currencies and tokenized securities. The team specifies that the following countries are some of the destinations its exchange can start its operations without regulatory challenges. 1. Ethiopia 2. Gahanna 3. Nigeria 4. South Africa 5. Angola 6. Egypt. However, in another part of the document, the team states that this proposal addresses three specific markets Eritrea, Somali, Djibouti. Also, the team foresees fiat currency challenges relating to fiat currency deposit and withdrawal gateway in Eritrea, Somali, Djibouti, as well as a challenge for regulatory approval in Somali, Eritrea.\nThe team mentions that the architectural and application design of Ennarea is being finalized, however I visited the ennarea.com domain and was not overly impressed. The site named Ennarea Finance seems very early in development. As regards the demo, available at https://pilot.ennarea.com , it seems like a template demo, not a work in progress (not a criticism, just an observation). This same project has been in different forms submitted for funding in the F6 and F7 funds, which means that the team is persistent. It would have been good if the team could have reported on any specific progress since then. Then we come to the budget. According to the proposers, Ennarea Finance requires $350,000 for the first year of project development and management. Apparently, no other sources of financing (outside Catalyst) have been secured - or this has not been documented in the proposal. The team is requesting roughly $150,000 (less than half of the money) in this funding round and the remaining budget will be requested in another funding challenge. The initial roughly $150,000 budget will be disbursed among 3 different proposals in Fund 8. This proposal being reviewed here - is just one of the three. However, if only one proposal is accepted in this fund 8 -what happens to the project? The team has not addressed this clearly and it seems that the risk of partial funding is a real danger. Does the team intend to return the funds if only 1 or 2 (out of 3) proposals are funded in Fund 8? This needs to be addressed, if Feasibility is to be assessed properly. If the team secured additional funding from other sources, it would be good to list them in the proposal. Tentatively, the team members do seem to have the qualifications to pursue a software project of this type from the links to their Linkedin URLs. \n", "q1r": 2, "q2": "Unfortunately, the team has possibly made a mistake in terms of auditability. The specific budget for this proposal $45,000 is not broken down into components, while a breakdown is available for roughly $138,000 worth of expenses for the entire project - to be funded from three Fund 8 proposals. Hence, it will be almost impossible to audit the implementation of this specific proposal as it does not have a budget breakdown - on its own. This proposal is part of a wider budget - and individual components cannot be attributed to this single proposal. \nSome deliverables still seem to be too vague. It is good that the team intends to use its social media platforms as well as webpage blog posts to announced progress. I would advise the team to commit to deeper weekly progress reports (on a regular schedule) - due to the amounts of funding involved from Catalyst. Also, I think that the expenses and engagement of personnel and payments should also be easily auditable. \nThe three month goal includes a commitment to \"enable users to buy and sell ADA in our exchange\". This is not sufficiently clear. Users from which jurisdictions? The goal of having 10,000 active users on the platform after three months, seems optimistic to me as an outsider. But great. However, to make it clearer it would be good also to provide insight into the definition of an \"active user\" - a user with an account or a user that has performed a trade? Also, how will the auditability of this project be impacted if the other two Fund 8 proposals for the Ennarea exchange are NOT funded? Will this proposal - on its own - be auditable - if the team misses out on obtaining funding from its other two proposals? We are left to ponder about this, so it would be best if the team addressed these funding issues and also if the team were to reveal why are other sources of funding not available for a project that seems so promising? The project expects at least 50 thousand active users in 12 months, there must be other potential sources of capital. If these have been approached, what was the response? \nIf the team is not funded this round, I would advise the team to create separate financing modules for their project. So that each module (proposal) stands on its own merits and can be implemented alone. These independent modules might be part of a wider picture, umbrella proposal - but they need to be independently auditable. \n", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "This a great idea and well thought out into fine proposal. Indeed, the targeted problem that has been identified by this proposal  is one real problem that Africans are facing. A typical example is what's happening Sean of Littercoins' friend Pike in Malawi now. Sean has managed to send Pike 100ADA with the aim of he being able to trade for local Fiat in order to buy a new phone for running the Littercoin project over there but there's no infrastructure being it digital or physical to help Pike perform this trade. This problem clearly points out a barrier that hinders the smooth adoption of Cardano in some African countries and it's a problem needing to be solved in the challenge. The proposed solution in this proposal clearly addresses the targeted problem. I'm really sure that if this proposal is funded and the project is successfully implemented, Pike would be able to finally trade his 100 ADA for local Fiat to take care of necessary duty.\nThe Key Metrics of this proposal clearly align with the challenge setting as the proposing team behind the project clearly demonstrate Cardano tech use-case solutions and it's really going to have a local impact as one of the African projects seeded in 2022.\nGreat idea! Great proposal and I strongly agree that it effectively addresses the challenge.\nGood luck!", "q0r": 5, "q1": "The proposers behind this proposal took the chance to elaborate more on the problem and solution of the project. However, I think this information should've been included in the impact section instead as the idea for that section is to collate detailed description of the solution and problem. By so doing, CAs, vCAs and anybody who chances on this proposal could have the opportunity to easily determine the impact and feasibility rather than having to read back and fort. Anyways, that doesn't affect my scoring.\nThe team, as described in this proposal, I see to be competent and well experienced for successful implementation of this proposal once funded. This is a team who have been able to create a working crypto-exchange platform which's running in the pilot release. I have visited their work and it's an amazing interface. i tried using it by trading ADA/GHS and my little note is that at least, if one should input a value for GHS, the system should automatically convert it into corresponding ADA.\nThe budget ($45K) is well thought out and broken down into deliverable items. From the layout of the budget, the community is able to know how the requested funds is spent. \nUnfortunately, according to the roadmap, it looks like there's no plan for Malawi. This makes me question as to whether a market research was conducted before putting together this proposal. I think the team should look at including Malawi in their roadmap and it must be a priority as the problem of crypto-exchange is really tough over there as compared to Ghana.\nAnyways, I strongly agree that it is highly likely that this proposal will be implemented successfully.", "q1r": 5, "q2": "From this proposal, it is stated that progress of the project will be announced to the public via their social media platforms and webpage blog posts. However, no information on the projects' social media platforms has been provided for the community to access and follow. The proposing team, I advise to provide either links or details to these social media platforms.\nThe key metrics, provided in this proposal provides the community with enough information on what is to be expected and when we should expect it and that puts me in a comfortable position to say that this proposal, if funded, can be assessed with regards to progress.\nGood job and  good luck to this proposal!", "q2r": 5, "assessor": "z_assessor_69", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "This is an interesting idea, it is about to build a security crypto exchange platform in which African can buy and sell ADA by their local currency.\nIn order to do this plan, the author proposes it as 3 proposals in different challenges. They are:\nhttps://cardano.ideascale.com/c/idea/396652  (This is I am assessing)\nhttps://cardano.ideascale.com/c/idea/396673\nhttps://cardano.ideascale.com/c/idea/396654\nThe proposal certainly fits very well with the objective laid out in the challenge “seed and grow Cardano in Africa” and clearly adds value to Cardano system. If success the platform will help to contribute to the mass adoption of the Cardano blockchain and increase the quality and quantity of Cardano engagement.\nIt is great when the author considers 3 challenges/risks that he/she has to face to implement the project successfully, but it would be greater if these challenges/risks could be explained more in details and the author could consider the mitigation of each of them. It’s just my suggestion for the proposal be more greater. I still strongly agree the proposal is impactful.\n", "q0r": 5, "q1": "The platform is currently under the development with link and video included for readers to have the first vision of how the product will be, and it is the strong evidence of the author and his/her team’s talent, experience and skills relevant to executing the proposal. The type and number of team members as well as their roles in the project are showed, even though there is not much about members’ information, but we can see more about them in their social links which are included. The plan is well written in a very clear, succinct and understandable way with lists of activities that the team needs to do. Because of it we can understand about Ennarea and Ennarea pro, what and how it helps users trade and invest through the platform, and so on. \nAbout the financial amount, I see the big plan need a big amount budget, it is broken down into identifiables items in reasonable and clear way, and the author did mentioned $150K is request in this Fund in three proposals (as I said above). This proposal’s budget requesting is $45K, for lists of items as the author’s explaination: office setup, talent acquisition, team building, hosting, data center development, and other management expenses. I would have a suggestion here: if the $45K budget of this proposal could be shown in seperating section, it would help readers to see easier and clearer.\nIt is interesting about the explaination of the problems and solutions of delivering the Ennarea product, it shows that the author has a deep research about them, however I think it would be more interesting if that research could be showed with links or any reference about: how low the adoption and development of blockchain technology in Africa are; the number of this statement in the proposal “Out of fifty-four countries, only five countries' fiat currencies have trading pairs on major exchanges, the remaining forty-nine are not supported and don't have trading pairs” (Where is the number from?), and so on. Besides, it would be more beneficial if we know more detailed about the security features which will be applied on the platform, to raise the trust in the platform for users.\n", "q1r": 5, "q2": "The author shows the well-done preparation for the plan of the project by including the long term vision, success metrics, KPIs and roadmap as well as the short term. The information is provided with a good level of detail, so that we can understand what results would be expected and what the specific goals are in the periods of 3 months, 6 months and 12 months. Moreover, the team commits the progress will be shown on social media platform to be easy monitered by the challenge team and the community, so I do not doubt about the proposal’s auditability.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "A tokenized security and cryptocurrency exchange for Africa.", "experience": "software engineer and blockchain developer developed a production-ready cryptocurrency trading platform."}