{"id": 397565, "author": "eagle", "title": "Translate Pool Peek Mobile: Swahili", "url": "https://cardano.ideascale.com/a/dtd/397565-48088", "category": 26442, "amount": 2400, "description": "It is not straight forward for non-English speaking users to onboard into the Cardano ecosystem.", "f6_no_assessments": 12, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a great proposition that certainly applies to the goals of the challenge. The idea is to translate to Sualí an application that helps people buy Ada and delegate it to some community pool, the application already exists and is well evaluated in the apple store and google play, that is, we will not be betting on the unknown. This directly achieves the objectives of the challenge because at the same time it will benefit Swali speakers (note: I have already seen some proposals aimed at this language in other funds, I did some research and found that one of the most important dialects in Africa, so certainly is very useful to invest in it), it will also help our Cardano blockchain to expand to new horizons. It's important that we make Cardano more accessible to everyone, and language is without a doubt the biggest barrier we face. As stated in the challenge, most pools are located either in the United States or in Europe, if we invest in taking this knowledge to other languages, we will be investing so that in the long term people from different parts of the world can enter the Cardano ecosystem and who knows, become involved enough to create their own pools. A suggestion that I can make for this specific project and include a small guide, which can be in text, video or images format, explaining the main concepts of our ecosystem. For example, if a person who has never heard of Cardano downloads the app out of curiosity, they will be able to understand at least the basics - what is blockchain, cryptocurrency, a pool, etc. That said, I believe that we should finance this proposal, it meets well what we are looking for in the challenge and is not complicated to execute. \n", "q0r": 5, "q1": "Despite being a simple execution proposal, it would be interesting to include more details in this part. For example, the author of the proposal does not specify how long the application translation process would take more or less. It would be nice to set aside some time, so that we can situate ourselves, for example: the project will take place in two months, week 1 being this, week 2 that and so on. It would also be beneficial if we knew who will do the translation, the Swali language is of indisputable importance but I believe it is not as quick to find a professional translator for it, as it would be for Spanish or French for example, because there are many people working with the translation of those languages. Therefore, the author could have included how the selection process for this translator would go, or better yet, if he has someone in mind, introduce that person and their resume. I also missed thinking a little about marketing. We can't expect Swali speakers to take the initiative to play the app's name on the play store/apple store, right? It would be more prudent to draw up a dissemination plan, through which the target audience could get to know and get involved with the app. In this way, we would be even more certain that the desired impact was being achieved. Regarding the developer, it would also be important to know who he is, what his relationship with the Cardano ecosystem is and also a little history of his previous work, in order to convey more confidence in his ability to carry out the proposal successfully. And about the funding, it is possible to have a good understanding of how it will be used, it is a low value compared to the other proposals, but it would also be nice to understand, for example, how long the translation would take to be done to find out the amount of 2k is adequate as a translator's salary. I think that perhaps this professional's hour of work may be more expensive due to the lower number of translators for this language, compared to languages ​​such as Spanish and French (as I said above). Is it the same? Anyway, I think it is possible to understand the process and how the budget is being used in an ok way, but because it is a more different language it would be important to know the translator who would work here. So I won't give it full marks just because I would like these details included.", "q1r": 4, "q2": "Because it is a relatively simple proposal, auditability is also simple. The author does not detail this part of the proposal very well, he says that the success can be measured based on the popularity of the app in Swali and people of that language buying and delegating Ada. In fact, it is the most direct way for us to understand if the project was successful and achieved what it was looking for. However, other ways can be thought of. For example, it would be very positive if a schedule (however short) was attached to the proposal, so that we could monitor whether the translation process was being carried out properly and within the expected time, for example. It would also be positive if any member of the Swali-speaking Cardano community used the app and brought feedback to the rest of the community, is it working well, is it adequate? Another thing I thought about would be that we understand the impact of this on the Swali-speaking cryptographic community. As I said in this evaluation, I have already seen other proposals focused on this language, whether in a challenge aimed at Africa or for translation, so this portion (Swalí speakers) is very relevant to us in the Cardano community. It would be positive if there was a small satisfaction survey, it could be done directly in the app, which would help us understand what has changed in these people's lives, when it comes to investments and blockchain. And a small 5-question questionnaire in my opinion would be enough, asking things like “have you started to acquire more Ada?” or “have you researched more about Cardano, the activities that can be developed on the blockchain and the difference between our ecosystem and other blockchains/cryptocurrencies?”. That way, a deeper analysis of the impact of the app's translation would be carried out, don't you think? But they are suggestions, because measuring quantitatively is also satisfactory in this case. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 10, "ne": 7, "ng": 2, "nfo": 1, "vca_o": 2}, {"q0": "Similar to the proposal that aims to translate the Pool Peek application into French, this proposal also aims to increase Cardano's insertion in the African continent, through the translation of the application into another language, Swahili, which is the Bantu language. with the largest number of speakers in Africa.\n\nIn this context, we have that the more usable the application is among African citizens, the greater the impact of Cardano on this continent that has an emerging economy, so one of the main objectives of the challenge in which this proposal is found is then fulfilled. And one of the consequences of this is also greater strength and disclosure for the ADA and its investment pools.\n\nSo, in the short term, we have benefits being brought both to the African continent and to Cardano. Also the amount of capital being asked for by this proposal seems quite plausible: $2400.", "q0r": 5, "q1": "As in the proposal to translate this application into French, we have that the final objective of the same is very important, but it does not constitute an innovative or very complex idea. Consequently, we don't need a very complicated structuring in the development stages.\n\nMaking a comparison with the proposed translation of this application into French, it is possible to notice that now the target language of the project is rarer than French. As a result, the expenses that will be destined for the translation ($2000) are justifiable and understandably higher than the expenses with the previous translation ($1400).\n\nIt's also very encouraging that the amount being earmarked for development remains the same, $400. Once again, as the application was developed by a very experienced professional, it is certainly quite scalable, with no problems in its translation. Also, an email was found to contact the developer via the Play Store: support@colorworkapps.com.\n\nWe also have that as the application already exists and the main differential of this project is its translation, an initial concern with marketing and dissemination is not necessary. In fact, with the growth in the number of Cardano projects in Africa, there will be greater interest in how to invest the return of these projects and, consequently, the expectation is that services such as Pool Peek will become more talked about.", "q1r": 5, "q2": "Once again, the way to verify the success of this project is done in a simple way, once the new version available online is validated by the users, through the application's rating. Possible problems of the same can also be verified through user comments.\n\nIn fact, another way of auditing the project's success and also trying to find new uses for the app would be to create periodic questionnaires on the app's homepage, trying to find some 'pattern' of pool that is sought by users who speak a certain language or meet in a certain locality.\n\nWith these steps, there will be a better use, on the African continent, of the return of projects involving Cardano's technology, making the project more relevant in this location and also fostering the growth of the emerging local economy.", "q2r": 4, "assessor": "z_assessor_1146", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "Proposer has not described the problem that he/she wants to create a program to solve, so the way the solution is presented is not really convincing. If the proposer can provide information related to the lack of Swahili when Swahili users have many or example cases for the project, the proposal will become more convincing. In addition, the Founder has not given much information related to the solution such as the features of the solution, how the solution works specifically as well as how to describe the impact of the solution on the Cardano exchange. also quite sketchy. This is a big omission as it is an important part of the 'IMPACT' section.", "q0r": 2, "q1": "The feasibility part was written by the proposer in a rather hazy manner. First, the founder was unable to present a clear roadmap or schedule. Regardless of how many similar projects he has worked on, the proposer should present a clear timeframe and tasks to be performed so that the voters can see the suggested strategy. Furthermore, the 'a full budget breakdown' portion does not include precise expenses; instead, the information is vague and unhelpful. The translator's expenses can be specified by the proposer, such as how much the salary is (in words or translations) and what development costs are included. There should be no ambiguity in any of the material. The proposer has provided the developer's job experience in the member information area but has not been able to provide a complete profile such as name and contact information.", "q1r": 2, "q2": "The proposer has outlined a few objectives that they want to achieve, but these objectives have not been supported by real facts or figures. When voters wish to validate the project's success or development, this will be tough. Furthermore, no metrics or benchmarks to assess the project's performance or progress are provided. This section of the proposal should be written with more care by the originator.", "q2r": 2, "assessor": "z_assessor_1652", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The proposal considered about how to let non-English speaking user have chances to approach into the Cardano ecosystem. The proposal is currently too short for the audience to understand on how the idea will valid in reality. \nRegarding to the solutions explanation, it is necessary to mention on what kinds of functions and expectation of the application which need to be translated to Swahili and how it influence in the community to increase the number of users although the application already got trusts from customer by high ratings in Google play and Apple App Store. The proposer can add more information on how much this proposal will move the Swahili community to approach to the Cardano ecosystem. Details need to include both quantitative indicator and explanation on its appropriateness.  \nThe proposer understood that, if the application is translated into native languages of Swahili people, they will invest more. By the way, It will be better if they can provide several successful case-studies in how the translated application will support to increase the number of user. \nAlthough there might be no risk under this project, the proposer can explain more on the reason why they think there will be no risk.\nThe proposal has no metrics or KPI set to ensure its completion will be done. The proposer can breakdown more of the information on this part, put both data and explanation of metrics.\nThere was no linking information about how much the App in Swahili can contribute to Cardano system. The proposer can add more information on that. \n", "q0r": 2, "q1": "The proposers are experienced in developing an Application and success in translating this application into others languages. However, regarding to make the application in Swahili, they had to provide information on expertise, knowledge and experiences of the translator to make it become understandable for Swahili  people. In addition, the proposer can provide more information on number of personnel needed to complete the application’s translation in certain timeline. \nTentative timeline is not available in this proposal yet, which might cause the misunderstanding by the audience. Although the work might be simple, the proposer need to add more information on the roadmap and milestone in each period. \nThe budget was allocated for two main activities, however, it is better to break down more on kinds of payment and how it align with the detailed timeline and set key metrics.\nRegarding personnel, the project has one experienced developer which described detailed by the proposer. However, a big part of proposal is translation service has not been clarified yet. The propose can add more information of this expected service company to make their proposal be more suitable and realistic. \n", "q1r": 2, "q2": "The proposer are confident in their proposal as they are successful from the former translated application. However, currently, the proposal lack of detailed information on how to monitor the implementation of the project. The more concertedly considerations on progress monitoring and evaluation indicators are put, the more reliable the project can be. \nThe end success was mentioned by the proposer. It is clear to see that, the number of Swahili people use and pay for this application by ADA will not only be the success of this project but also will contribute to the spreading of this application. \nProposer already mentioned that, this project is entirely new one. \n", "q2r": 2, "assessor": "z_assessor_1655", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Because English is neither a first nor a second language in my country, the project's challenge is practical. Many people, particularly investors, do not frequently comprehend English, making blockchain initiatives written in that language difficult to reach. Furthermore, the project's solution was quite beneficial in resolving this issue. The project will build a translation platform if the training does not fulfill the time criteria, implying that learning English is a lengthy process. The premise of this endeavor appeals to me, and it would be fantastic if the platform could be translated into several languages.", "q0r": 4, "q1": "The project does not specify whether or not the applicant has previous experience in the same field. Apart from that, the implementation strategy isn't very thorough. A more specific roadmap should be presented, with weekly and monthly timeframes. Based on the current plan, it's hard for me to assess the project's success. Budgeting was also discussed, but not in as much depth. It is necessary to mention the costs of the smaller job items. This illustrates the team's thorough preparation for the project, as well as the project's higher chances of success when thoroughly prepared.", "q1r": 3, "q2": "The problem posed by the project is practical because in my country English is neither a first nor a second language. Many people especially investors do not use English often and it is difficult for them to access blockchain projects that are written in English. The solution that the project came up with was also very helpful in solving this problem. If training does not meet the requirements in terms of time, which means that learning English is a time-consuming process, the project will build a translation platform. I appreciate this project's solution and it would be nice if the platform could translate into multiple languages.\n\nThe project has not mentioned the experience in the same field. Besides, the implementation plan is not really detailed. There should be a more specific roadmap with weekly and monthly timelines. With the current plan, it is difficult for me to assess the success of the project. Detailed budget analysis was also mentioned but not as detailed. The smaller work items and their costs should be stated. This shows that the team's thorough preparation for the project and the possibility of success will be higher when the project is carefully prepared.\n\nThe current information is not enough to assess the transparency and likelihood of the project's success. I suggest that in terms of planning, the project should have a specific plan on a weekly or monthly basis. At the same time, that plan is also the deadline for work items. And when the deadlines have been completed or not will be disclosed to the stakeholders. Thus, transparency will be higher. Avoid the case that the team abandons the project. Regarding the specific budget analysis, the project also needs to list the work items in more detail. The cost of the items also needs to be estimated more accurately. Project expenditures should also be recorded and disclosed to stakeholders to increase transparency. I suggest that the project should develop a checklist of expenses and each expenditure should report the information as well as the balance to the stakeholders.", "q2r": 3, "assessor": "z_assessor_1710", "no_vca": 6, "ne": 1, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "This proposal aims to expand access to the Pool Peek application in African countries where the population speaks Swahili, thus expanding people's potential to be part of the Cardano community. The proposal does not clearly provide the blueprint for how it will add value to the Cardano ecosystem. The proposer has set a goal for thousands of Swahili language users in Asia to download and use the application, so I believe the proposal is relevant.\n* The proponent created several similar proposals, the only change was the change of the language to be translated and the challenges focus on different continents. So I'm using standardized assessments.", "q0r": 4, "q1": "In the description of the proposal, the following statement was informed ''because we have already translated the application into several foreign languages'' when accessing the link and checking the website, I detected that the option for languages ​​other than English was not included, and when accessing the Mobile app encountered the same problem, which makes it difficult to assess feasibility. It is unclear how many people are needed to implement the given proposal. The proposer reported 10 years of experience in mobile development, but did not include a link to provide us with more details of their professional experiences. The budget was divided into two parts, translation and development, but there is no information on the amount of material to be translated. There is no estimated workload for the development part. The plan does not present a timeline to be evaluated. The proposal does not present an implementation plan, so there is no way to assess this criterion.\n* The proposer created several similar proposals, the only change was the change of the language to be translated and the challenges focus on different continents. So I'm using standardized assessments.", "q1r": 2, "q2": "There is no timeline with milestones and time for completion. The proposer intends that there will be thousands of Swahili-speaking users in Africa downloading and using the app, although an uncertain number can be audited, I recommend including more metrics in the project.\nThe problem description is clear and understandable, but the solution could be more concrete.\n* The proposer created several similar proposals, the only change was the change of language to be translated and the challenges focus on different continents. So I'm using standardized assessments.", "q2r": 3, "assessor": "z_assessor_1828", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The proposer has a series of 6 almost identical proposals in “Grow Africa, Grow Cardano\" and “Grow East Asia, Grow Cardano” challenge, as they all deal with the translation of an already functional web and mobile app in 6 different languages. I mention this, not because I see a problem, but because, as a consequence, my reviews will also be quite similar.\nPool Peek’s website and mobile app help you view information about all stake pools on Cardano and make an informed decision when staking. One might think at first that there is no need for another tool with these features, but when looking at how the website works, one can see that some of the features are not available elsewhere - at least not to my knowledge - and that actually makes Pool Peek a valuable tool to have and worth translating into other languages, that will help get as many people as possible understanding how their ADA is staked, and what the difference is between one pool and another.\nAs such, the impact this proposal can have on the Cardano ecosystem is quite positive, and it also addresses the challenge of Grow Africa, Grow Cardano.", "q0r": 5, "q1": "For me the Android app didn’t install on 2 different devices, so I cannot offer any opinion on that, but the website is working really well and offers valuable information on the stake pools. Even though the proposal is quite straight forward, some additional details in the feasibility section about plan description and some links that could prove the skills of the proposer would have been important to add. Otherwise, the veracity of the facts cannot be proven, so we’ll have to take the proposer by his word. \nRegarding the budget, I found it  to be balanced and sufficiently described, the task of the proposal is quite simple, so there’s no need for any additional info regarding this aspect.", "q1r": 4, "q2": "Being a simple task to develop, the progress of this set of (translation) proposals are quite simple to track: to have the app published on the two app stores and the success is having thousands of downloads from the Swahili speaking community in Africa and all around the world, which in the case of Google App Store is verifiable on the app page by anyone with an active internet access.\nAs such, I find the proposal to be easily tracked and assessed by the community. ", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "Given the information provided, I think that this proposal is in line with the challenge setting. The proposers aim to translate their app, Peek Pool Mobile into Swahili, which will open up the opportunity for many people to get into the cardano space. The proposers mentioned that there are over 200 million Swahili speakers, so the potential impact is huge. Even onboarding a small fraction of that population would still be a huge benefit to the cardano community as well as the people themselves. These people who get into the app to learn about staking, could then stay because they are inspired by the cardano ecosystem’s use cases in many aspects of their lives. This could lead to new proposers, new CAs/vCAs, and new voters. The proposers mentioned that they see no risks associated with this proposal, but I would imagine that marketing the app would be an issue that could be solved. In order to have a more widespread impact, I would encourage the proposers to include how they will market this app to the people who speak Swahili. (score given: 4)", "q0r": 4, "q1": "Given the information provided, I cannot say whether I think that this proposal will be successfully implemented. The proposers have not provided any information about themselves that can be verified since they did not include any external links to something like a linkedin. Also, since I don’t know the names of the proposers, I can’t make any conclusions about their qualifications. The proposal itself is very sparse and does not include any roadmap that shows when the proposal will be completed. The proposers say that it will be easy to translate the app, and I believe them, but it would have been nice for them to include the name of the translator they will use, so I can have more confidence in the proposal. The budget is broken down minimally, but I think that this is acceptable since the scope of the proposal isn’t very large. The funds requested seem reasonable as well since this proposal isn’t very large. Overall, more information about the process, such as when it can be expected to be completed, would have made the proposal stronger. (score given: 3)", "q1r": 3, "q2": "Given the information provided, I don’t think that the proposal is very auditable. The proposers only listed the completion of the translation and publishing of the app as a metric of success. Additionally, they mentioned that thousands of users will download the app. How will these metrics be reported? Is there a format that will be used to share the information with the cardano community? Also, it would have been good to include more metrics about how the proposal is successful. For example, how many people view the app in Swahili? How many people will this app actually reach? More information would need to be provided in order for me to say that this proposal is fully auditable. (score given: 2)", "q2r": 2, "assessor": "z_assessor_310", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The problem presented in this proposal is within the scope of the challenge as there is a large Swahili-speaking community in Africa and translating the Pool Peek app could increase the access of newSwahilli-speaking users to information about Cardano.\n\nThe proposal plan does not clearly demonstrate how it will add value to the Cardano community, but considering the simplicity of the purpose (translating the app into Swahilli) I believe that the proposal is relevant and would have a positive impact on the challenge.\n\nA goal was set to get thousands of users on the app, which I consider a relevant goal, but I would like to see a more precise target in this goal (thousands is somewhat subjective) and metrics/KPIs that indicate the quality of the app could also be included to facilitate impact assessment.\n\n*This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible.\n\n*Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q0r": 3, "q1": "The proposer described relevant experience in mobile development, but there are no sources to confirm his expertise. There is no information on how many team members will develop this proposal (is it just the proposer?) I would like to see more clarity on this point. There is an intention to hire a professional translation service.\n\nAn important point to note is that the proposer described that the app has translations in other languages(\"We will work with a professional translator to translate the Pool Peek mobile application and app store listing as we have done with other languages. \"), but I couldn't find a language option other than English in the app, I would recommend this clarification.\n\nThe budget could be better detailed, as there is no information on the number of words to be translated, which makes it difficult to assess whether the requested budget is appropriate.\n\nA plan was not presented, I understand that the proposal has a low level of complexity, but I think it is important to have at least a basic plan and a timeline with an estimated delivery date for the translated version of the app.\n\n *This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible. *Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q1r": 2, "q2": "There is clarity in the problem presented and in the relationship with the challenge. There is no plan, the solution presented could have a plan that more clearly indicates the development of the solution. There is no roadmap, no milestones and no timeline for app delivery, this negatively compromises the ability to audit the development of the proposal. The established goal (thousands of downloads) is relevant and a way to track the success of the proposal, but there could be a minimum target for this KPI, as thousands are somewhat vague (can be 2 thousand or 100 thousand, a significant difference) . I would recommend including more KPIs and metrics that allow you to gauge feedback from app users. *This proposal used a template and has 4 other proposals almost entirely identical, the only items that changed were the language to be translated and the budget for the translation (it is not clear why the budget in different languages changes, I know that translation costs vary according to the language, but the proposer did not establish what the hourly rate would be (charged for the translation) by language, so it is not possible to assess whether this variation is plausible. *Due to the use of the template and the great similarity between these proposals, it does not make sense to write a different assessment for each proposal, so I will use a template.", "q2r": 2, "assessor": "z_assessor_43", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Just as I assessed the other proposal(https://cardano.ideascale.com/c/idea/397560) being proposed by this proposer, the impact still remains the same as I stated over there. A lot of people who are not English-speaking really find it difficult to defy the information coming out of Cardano and I think this is a great solution to at least have a Swahili-translated version of Stake Pool information right at the exposure of Swahili users. The impact, I foresee to  be really huge and hence strongly agree that this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The budget for this proposal is quite skeptical for me as $2K for translation services is an overstated figure with reference to the average price tag for English to Swahili translation being $5 per 400 words on Fiverr which's a job marketplace(https://www.fiverr.com/goodluckgabriel/translate-texts-from-english-to-swahili?context_referrer=search_gigs&source=top-bar&ref_ctx_id=2e7128346d0a9fc65245f8c88591a1b2&pckg_id=1&pos=5&context_type=auto&funnel=2e7128346d0a9fc65245f8c88591a1b2&imp_id=ba121d26-8884-4844-b1f1-e0034bd5cd94). I think the team could've done a good job by including in this proposal the total number of words to be translated, number of hours to be used for that, number of translators working, etc to help the assessment of the budget's feasibility.\nThe team seems to be unknown. There's only a description that says: \"The primary developer for this mobile application has over 10 years of mobile development experience and his applications have been downloaded from the Google Play and Apple App Stores several million times.\" but connected to no name nor link which makes me doubt  the availability and capacity for successful implementation of this proposal if funded. I'm sorry Joseph, but I think you should refer to the Catalyst School on how to write a good proposal and I'm sure you'll be able to churn your wonderful idea into a great proposal probably for next fund (Fund 9). Good luck.", "q1r": 3, "q2": "Very less information is presented on clarity in this proposal. I'm provided with only the main deliverable which is Swahili version of the application and what platform to expect it. i.e., Google Play Store and Apple Store but no details are provided on what the actual timelines and milestones would be. This makes me disagree that this proposal provides sufficient information to enhance auditability.", "q2r": 2, "assessor": "z_assessor_69", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This is a great idea but I must admit that I am not familiar with pool peek mobile. I would appreciate that in subsequent proposals you give a little information on something of this nature. The idea to translate a staking platform is great to win the hearts of people who speak Swahili which can later be scaled to meet the needs of many non- English speaking Africans by adding more languages. I would have loved to see clearly some key metric to measure success.", "q0r": 4, "q1": "The proposer is basing on previous work done on the app. I must say that I am not familiar with this app but I wished to have seen the stages of accomplish this work tied to appropriate timeline. They would have spiced the proposal more and more. Also I think that the budget is small but the proposal claims that much work has been done already and so may not need that much. The proposal omitted the team to execute this idea which is an important ingredient. The experience needed was not mentioned. The reference to the pool peck app gives an idea a good team. I encourage the proposer to mention the team in later proposals. Timeline for translation and how to reach out to people with the app was omitted.", "q1r": 5, "q2": "It in a great thing for the application to be but the time line is not stated. It would help a great deal. Also beyond launching the app how will you help the people to locate it. No advertisement or education is captured in your write up. Indeed I must say that this is a great idea but needs some more information like earlier time line for auditability.", "q2r": 5, "assessor": "z_assessor_728", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "Note to VCa: this proposal being very similar to several other proposals by the same team, my assessment may include similarities.\nThis proposal offers to translate into Swahili an existing web-app named “Pool Peek Mobile”. This web app educates and assists new Cardano users about staking, includes a pool map and a pool search engine. \nThis app has good reviews in Google and Apple app stores, and after having tested it myself, I found it useful, and I confirm I will keep it on my phone.\nEven if Swahili is a widely spoken language in Africa, so is English. The proposer does not show how this proposal will widely contribute to make Cardano the blockchain of choice in Africa. Indication about the evaluation of potential new users would enable a higher impact score.\n", "q0r": 3, "q1": " The team intends to hire a professional translation service to support the work and evaluates the budget is 2kUSD. There should be no difficulty to perform this task, but the proposer could have made it more clear by adding precisions about what the team has done so far to source this external translation skill.", "q1r": 4, "q2": "Success being defined as “the publication of the app on Google Play Store and Apple App store in Swahili” does not align with the challenge brief. I recommend for a further application on Catalyst to include metrics that clearly relates the goal of the proposal to the challenge brief. In this case, for the “Grow Africa, Grow Cardano” challenge, it is for example: Number of African developers onboarded in 2022, local impact, local partnerships.", "q2r": 2, "assessor": "z_assessor_78", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "We built Pool Peek Mobile to assist users with the staking process. We will translate the app into Swahili (~200 million African speakers).", "experience": "Pool Peek mobile has already been translated into several over languages and has and average rating of 4.5 stars across the Google Play and Apple App stores."}