{"id": 398056, "author": "zakiristesting", "title": "DemeterGift", "url": "https://cardano.ideascale.com/a/dtd/398056-48088", "category": 26442, "amount": 60000, "description": "For instance, in Africa there are more than 25 million people living with HIV.", "f6_no_assessments": 7, "f6_rating": 1.8095238095238095, "videos": [], "media": [], "f6_assessments": [{"id": 366, "q0": "The central idea of ​​the project fits the goals of the challenge, since the DemeterGift proposal is to establish NFT auctions aimed at charity and that will help humanitarian institutions. Given the recent rise in the commercial importance of NFTs, using blockchain technology to carry out these auctions is also an innovative idea.\n\nWith the success of this initiative, great benefits would occur, charities would be helped and Cardano's technology would gain visibility in a new community in which its projection is still not so great. In addition, specific problems in Africa that can be mitigated through the initiative were mentioned, showing that the proposal is well aligned with this juncture and understands the goal of the challenge in question.\n\nHowever, the amount of $60,000 being requested is high and we note that little information has been given on how the project is intended to be carried out. It is necessary that not only the problem that you want to work on is well defined (as it really is here), but also that the path traced to it is clear.", "q0r": 4, "q1": "Regarding the feasibility of the project in question here, it is very important to mention at the outset that, given the information as it is presented here, we could imagine that the project is still at a very conceptual level and the kick-off has not been given. So here's the tip of trying to organize this information a little better so that we can better understand what has been done so far. For example, in the comments below the proposal we can find the link:\n\nhttps://docs.google.com/document/d/1UnmmWtj_5Ejc3g1MBpegx5pmRH-UGBRD/edit\n\nAnd this one has a lot of rich information about what has been done so far, including usability examples; the biggest difference in the presentation of the proposal, in my opinion, are exactly these materials. However, it should be mentioned that, even with an idea that was initially well structured, the steps that must be followed for the evolution of the project were not very clear here. The detailed plan and schedule to be followed by the project only present the information present in the “chalenges” section of the link indicated above, but we were not able to identify clear actions that will be carried out in certain periods of time so that the objective is achieved.\n\nIn the same way, we have a very strong lack of information about the detailed budget description. We just have the description that the budget will cover the main parts of the job, but what would those parts be? What amount would be allocated to each of them? It is critical that a description of how the $60,000 will be used be more detailed.\n\nIt was also not easy to locate the CVs of the main people involved in the proposal to prove the experience of each one of them and how they contribute to the execution of the project. Additionally, it is always interesting that a well-detailed marketing strategy is defined for proposals that need a great deal of knowledge on the part of the public.", "q1r": 2, "q2": "Regarding the metrics to monitor the success of the project, we also noticed the absence of better structured indicators that show us whether or not the project is achieving what is expected. Given the objectives of the platform, we could have some indicative parameters such as the number of NFT's being offered in the auctions, the average number of participants in these events, how much movement is being carried out and also the evolution of these numbers, establishing a before/after comparison of what is possible fund contribution.\n\nThe perception of what would be the success of the proposal is described in a way that is consistent with everything that has been presented so far and the team has the clear objective of carrying out an integration between two large markets. It is worth noting, once again, that the central idea of ​​the proposal already has a body, and that a better polishing of the information and strategies available here would considerably increase the chances of success of the project.", "q2r": 2, "assessor": "z_assessor_1146", "no_vca": 12, "ne": 6, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2593, "q0": "I really find this proposal very confusing and difficult to comprehend. First of all, the problem stated in this proposal does not align with the challenge. Again,the solution given in the proposal does not align to the problem stated, this is very confusing. I feel the proposer did not get much understanding of the challenge. The idea in this proposal to me clearly has no impact on the cardano ecosystem.\nAlso, the proposer did not give us any information on how demetergift can help seed and grow cardano in Africa, therefore this proposal does not match the challenge at all. I also don't think the proposer understood the questions asked at the impact section,the answers given clearly donot answer those questions.", "q0r": 1, "q1": "To begin with, this proposal does not have a budget breakdown and to me this means there is no plan for this project, and this makes me wonder, how then do we know what the 60000USD requested is going to be used for.\nAgain,the proposer did not give us any detailed  description of the team members, the proposer just stated their names.we donot even know if they have the experience required for this project.Their roles in the project is also not stated and I doubt the feasibility of this proposal. My advice to the proposer is to try getting more knowledge and information on how proposals are written in order to come out with good proposals that will gain funding.", "q1r": 1, "q2": "I strongly disagree this proposal will be auditable because there are no roadmaps, metrics and key performance indicators showing how success of the project will be measured.I don't even know what the team aims to achieve in this proposal,I only got a somehow confused explanation about how success of the project will look like.\nIn general,I strongly disagree that this project will be auditable,I donot see any details on what they aim at or hope to achieve based on the information provided in the proposal.", "q2r": 1, "assessor": "z_assessor_1537", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 3411, "q0": "This proposal write lacks a lot of essential information. In the 'solution description' section, the proposer does not provide the required sections such as an introduction to the problem at hand, a clear introduction of the solution, providing project characteristics, good working projects or function of the project. The information is absolutely not provided in a specific way. Then, for the second part, the proposer continued to not show how this project affects Cardano or the KPIs/Key metrics for voters to better understand the impact of the project on Cardano or Cardano users. In addition, the risks or challenges that the project may encounter are not explained in detail, making it difficult for voters to understand.", "q0r": 1, "q1": "Outline provided is quite confusing for voters to follow when only giving titles without captions, all information in the roadmap should be indicated in more detail. In addition, the information in 'a detailed budget breakdown' is almost nonexistent. It does not provide any information to help voters see the future of the project. Proposer must add information about main work packages such as salary for each team member. In addition, specific information about team members such as job position, education level, and work experience should be added so that the voter knows who is implementing the project and is easy to check. more information.", "q1r": 1, "q2": "The fact that the project will be monitored and updated on GIthub is a good thing to ensure transparency for the project. Proposer should give clearer information for the development or success of the project based on KPIs/Key metrics so the information will be more convincing. In addition, setting a goal with metrics will also help voters gain more confidence in the project.", "q2r": 2, "assessor": "z_assessor_1652", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 4079, "q0": "Firstly I have to say this idea has such a meaningful objectives. However, the proposal is all over the place. The proposer has not delivered the project’s principles and how it’s going to meet the challenge. The proposed solution is barely described, it doesn’t explain how it is going to benefit any party, how it’s going to be operated or whatsoever. I don’t get it why the fact that it will outcome as Charity Event Donation will address the challenge. Is it because it’ll somehow promote Cardano in Africa? \nAnd for the part of challenges or risks that you foresee to deliver this project, I reckon that the team totally misunderstood it. This section is meant for you to present the difficulties that you may encounter while running this project to help the community get a whole picture of this project, all of its pros and cons. I hope that the team can work more thoroughly to build a proper proposal ", "q0r": 2, "q1": "In term of feasibility, I don’t think the team has delivered any roadmap or milestones, so we have absolutely no idea of the operation of the project. It’s almost impossible to see how this project is going to turn out. To be fair, I think the team has the wrong idea of what to present for feasibility. The budget breakdown does not exist, hence no justification of the requested amount can be made. I think for $60K, we need a lot more than whatever the team is showing here. It’s a pretty high amount, but no further information is given about how it’s going to be spent, such as how many developers will work, the distribution for the budget or simply just hourly rates. There’s also no descriptions of the team members with their technical expertise, so we also have no idea if the project will be assisted by people with relevant skills or experiences. The team really need to spend more details in there, otherwise, I can not agree that the team has good experience for the implementation of this proposal. ", "q1r": 1, "q2": "I totally disagree that this information provided is sufficient to audit the progress and the success of this proposal. This project is delivered without any roadmap, key metrics or KPIs. I personally don’t think the auditor can do much in term of auditing this project in the future. I would suggest the team to build some KPIs regarding the influence of the project, the impact, the effective donation or so. In conclusion, the project is not given with clear cut distribution of milestones that can be tracked anytime, hence in my opinion, this is not a good articulated proposal. ", "q2r": 1, "assessor": "z_assessor_1703", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4113, "q0": "For this project, the proposed idea is aimed at Africans living with HIV and the idea is to create a charity auction to raise funds to support charities. I think this is a great idea with a lot of potential for growth.\nThe proposal team has also planned for the upcoming challenges when implementing the project. At the same time, the proposers also had a general view of how to solve those problems when they arise.\nHowever, the proposal has not shown the functions or functions, product features or the main components, and main activities of the project. The description of the solution is too sketchy. There is not enough data or data to judge if the proposal fits the challenge or not or how this project will impact the cardano ecosystem. Please describe in detail how the project will operate as well as indicate the potential audiences that the project specifically targets and show the impact this project has on the Cardano ecosystem. Moreover, please explain more in depth about the technical side of the project with examples or case studies.\nWhat results will this project produce? How influential is Charity Event Donation? Please provide more information about the outcome when the project is completed and convince that the project is fully consistent with the key metrics of the challenge.  Please describe in detail about KPIs of Charity Event Donation event step by step. So I cannot overestimate the impact this project has on the Cardano ecosystem.", "q0r": 2, "q1": "It's seem to be a short-term project. The roadmap that the proposal team provided should be more detail. The proposal should describe in detail the products that the project will produce in each milestone. How the work items to be completed. Please describe in detail the technical and technological aspects required to develop the project.\nProposal has not provided a suitable budget plan. The expenditure items to be spent in the project implementation have not been found. Imagine what human resources are needed for the project to be implemented? What items are required for investment? What necessary assets need to be paid for to develop the project? or at least the project should have a personnel salary plan. It could be hourly, weekly or monthly wages. A specific budget plan will convince investors to take the project seriously and increase the likelihood of getting funding for the project.\nWhat experience do the members managing this project have? What knowledge do they have to develop the project? It will be difficult to trust the development of a project if you only provide a sketch of the names of the managers without any information about their qualifications and experience. Use the background of managers as a highlight of the proposal.", "q1r": 2, "q2": "In this section, the proposer will have to clearly show quantitative indicators to monitor the progress of the project. For example, the number of users, the time to complete which part - what activities, the number of traffic ...\nThe community will monitor and evaluate each step of the project implementation through the indicators proposed by the project. Proposers must show the project expectations through key metrics. Please provide specific numbers on the amount of traffic that the project will attract if successful.\nIn addition, what are the criteria to evaluate the successful implementation of the project? Proposal mentioned the amount of money raised in 2020 and 2021, but the expected number to be reached next has not been mentioned. The proposers should provide more details about the project when it is completed to get a clearer picture of the project's success.", "q2r": 2, "assessor": "z_assessor_1709", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 4473, "q0": "This proposal has a great idea, however the presentation is a little shaky and missing much important material. First of all, you must explicitly outline the aspects of this project. As previously said, this project will be a charity event donation; thus, what will the content of this donation be? Who will be the special guests? Which institution or charity will get the donations? You must specify how the features of your proposal would have a direct influence on the Cardano ecosystem. In addition, you must ensure the goals that this project can achieve are similar to the key metrics of the challenge. In the section about possible risks, you need to clearly provide predictions about problems during project implementation, along with solutions for each problem. Difficulties in fundraising, organization and placement issues, marketing issues, ensuring monies are given to the correct individuals, and so on are examples. To clarify the implications of this suggestion, you must state the aforementioned elements extremely clearly and in depth.", "q0r": 2, "q1": "Your preliminary plan does not clearly state all the tasks that need to be done. You need to clearly state what to do with each certain milestone. Furthermore, you must explicitly indicate how you intend to carry out those actions. Each task will have its own set of KPIs or objectives that must be met within a specific time frame and in a variety of methods. From there, you should be able to come up with the detailed budget. Budget proposals should be clear and broken down for each task. In terms of the member introduction, you must clearly express each person's experience and talents, therefore research the qualifications that are relevant to the project. The project should also explicitly define each team member's duties, such as who will be in charge of what tasks. You may also submit more LinkedIn profiles so that we can easily verify members. We can only appreciate the feasibility of this idea if you offer sufficient and clear information above.", "q1r": 2, "q2": "In order for us to measure project development, you must have clear metrics on Github. In addition to various measures (contribution and digital NFTs), you could specify more about the project's development, such as the procedures to organize the donation, the donation process, the guest list, the list of persons and organizations receiving funding, and so on. You must have particular reports and charts in order to make them public. This project's success must also serve community reasons, such as raising awareness and quality of life in Africa, consequently fostering the growth of the Cadarno environment. More research and case studies should be included to increase the quality of this proposal.", "q2r": 2, "assessor": "z_assessor_1726", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 6443, "q0": "The proposer presented the problem that Africa has more than 25 million people living with HIV. As a solution, he presented the DemeterGift app to create an NFT charity auction. It was unclear whether the charity auction will be to help people living with HIV, I would imagine so but that should have been made clearer. It was also unclear how this proposal addresses the challenge; this could be better explained in the proposal. ", "q0r": 3, "q1": "The proposer identified the team members but did not present evidence of their experiences, so it is not possible to assess whether they would be able to successfully implement the proposal, so it is important to provide this information. The budget was not detailed, which is important for us to assess its reasonableness. The proposer did not present a plan detailing what will be done and did not present a timeline to finish the work. Not enough information was provided to assess the feasibility of this proposal. ", "q1r": 2, "q2": "The proposer clearly described the target problem but did not explain the proposed solution well, there was a lack of more information for evaluation. A roadmap with milestones and time horizon for achievement was not presented. No metrics or KPIs were presented to track the success of the proposal. These data are very important for us to assess the auditability of the project.", "q2r": 2, "assessor": "z_assessor_429", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "DemeterGift creates the most easy, transparent and fun NFT charity auction on Web3, by helping charities raise additional support!", "experience": "Get access to care and treatment at the right time and location.\nThe payment infrastructure is not always transparent for donators\nDonation processes create a lot of administration\nEngaging donators with charity events, like auctions, is difficult to organize"}