{"id": 399035, "author": "mucu", "title": "Cardano For Ugandan Universities", "url": "https://cardano.ideascale.com/a/dtd/399035-48088", "category": 26442, "amount": 18000, "description": "Blockchain projects are ideal for final year university projects, this requires an open source platform and Cardano should be our choice.", "f6_no_assessments": 8, "f6_rating": 4.166666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 8733, "q0": "A problem needing to be solved in the challenge has indeed been identified by this proposal and it demonstrates a clear solution that scales to address this problem now and probably any futuristic problems that shows up. Indeed the back-lag challenge in the different folds of development being faced by Uganda is a problem in the African continent. This problem is actually not facing only Uganda but some other African countries as well who unfortunate for one reason or another, have not even heard or discovered the Cardano Ecosystem being a hub of solution. The problem, I see to be affecting about 80% of African countries and if this solution, which is kind of following the footprints of Wada, is successfully implemented, gradually Catalyst would receive a greater onboarding and adoption experience from Africa as it extends. I see the bigger picture of this proposal is to onboard software engineers to adopt the Cardano Dev Ecosystem even though the target audience for this proposal is local developers and especially for those who are still in colleges and the universities. That alone, addresses the Catalyst Fund goals of accelerating the developer and app ecosystem, preparing a group of people willing and able to make contributions to the ecosystem and in all, it makes me strongly agree that this proposal effectively addresses the challenge. ", "q0r": 5, "q1": "This proposal seems to have about 90% understanding of which resources are needed to enable a successful implementation. The missing 10% has to do with the lack of information on topics that they intend to teach participants who join this initiative and also the required partnerships to ensure delivery. This is evident to statement made in the risks/challenges that \"We anticipate to face huge challenges with the man power to walk the students through the most relevant tutorials for Cardano.\", \"Whereas we have two experience devs in the Blockchain Club of Uganda, they are quite busy with an availability of about twenty hours a month.\", and \"Otherwise, we hope to push this as possible as we can through good use of the available tutorials on the Cardano Academy\". From the comments, I realized a community member suggested that they reach out to either Wada, ABCD, or POA as a point of either information or collaboration but unfortunately that suggestion, I see to not be utilized. However, those organizations in the community could really be of great help to this proposal and the project as a whole and I suggest that the team reconsider their thought about that and further reach out to Gimbalabs or MLabs as well as they're more of Cardano Devs education and building.\nAnyways, I see that the team has had a success in hosting a Cardano event in Kampala even though the attendees weren't many but at least better than zero and it probably gives this proposal a heads up as those participants can be utilized positively as described in the proposal.\nThe team, I think would be feasible enough if they're able to partner with Gimbalabs or MLabs and/or Wada or ABCD or POA. The idea is that, Gimbalabs or MLabs would give them that technical educational experience while Wada, ABCD, or POA would help them with the organisation of the various events needed for successful implementation.\nAs for the budget, it's unfortunate that I'm unable to tell whether it's feasible or not. Reason being that, from this proposal, there was a reference to an event that has been hosted by the team but there's no information as to whether or not it's a catalyst funded project. An information on that, with a link could've helped my investigation into the budget. But a random research that I performed on event spaces and their costs in Uganda tells me an average range of $182 for a 5,036 sq. ft. event space which's enough room for successful hosting of the events. I am unable to verify for the other logistics as details like total number of expected participants, and banners to be printed aren't provided in this proposal.\nHaving in mind all of the above raised concerns, I remain skeptical about this proposal being successfully implemented if funded but I want to urge the team to kindly take into consideration working on the concerns raised in my comments and by so doing, they will come up with a great proposal in next iteration and probably get funded if not in Fund 8. Good luck! and great job!", "q1r": 3, "q2": "This proposal provides a clear roadmap with concise definition of success and metrics to help me assess its progress towards the stated goals. It's unfortunate that there's no communication on where exactly the community can track the progress of this project. A typical example could be a particular YouTube channel where videos of these event recordings would be posted for as to track, a website or blog where articles about held events will be posted for tracking purposes, social media channels, etc. However, a website link is provided but nothing was said about it. After accessing the website, I realized it's not a fully grown website as all buttons eventually leads to homepage which has no information about this particular proposal. I suggest the team should consider building it completely or better still set up a Discord channel and provide the link to it as a point of contact for auditability in the next iteration of funding cycle. As it stands, I neither agree nor disagree that this proposal provides me with sufficient information to assess the progress of its goals.", "q2r": 3, "assessor": "z_assessor_69", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 790, "q0": "Cardano For Ugandan Universities is a great initiative to develop the Cardano African community in general and the Cardano Ugandan community in particular. Organizing sharing sessions and building Cardano research clubs at major Ugandan universities for year-end students is a very practical work. It will help students quickly gain knowledge about Cardano and from there can participate in starting a business, changing lives on the Cardano platform. This will end up propelling Cardano to fast and solid growth in the Ugandan region in particular and the Africa region in general.", "q0r": 4, "q1": "I believe, with the experience of Mucunguzi Moses, Ahimbisibwe Brian and other team members, you can completely do this suggestion well. However, what is missing is that you need to give more detailed information about the group members so that the community can have a deeper understanding of the experience and skills of the group members. The information you give is quite sketchy, it makes it harder for the community to understand you. Also, I think you need to put in more details about the risks you might take in making the proposal fail. Example: Too few final year students at major Ugandan universities are interested or they don't know about your project. How will you solve this problem? In addition, in the case of too many participants, do you have any solutions? I believe that if you come up with a way to solve these problems, the community will greatly appreciate it.", "q1r": 4, "q2": "With 6 programs launched in the first 3 months or meetings in the next 3 months, I believe that this roadmap can be implemented well. On the other hand, I would greatly appreciate using the $18000 if funded. You guys are very transparent and clear in this matter. What is missing is that you need to give KPIs clearly and fully in terms of numbers so that the community can track the success of the project. Example: How many new seniors from universities will participate in the development of the Cardano ecosystem? How many new projects will be proposed on Catalyst?... I believe that if you give all this information, the community will appreciate you much more.", "q2r": 4, "assessor": "z_assessor_1213", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2425, "q0": "The 'Grow Africa, Grow Cardano' challenge aims to raise Cardano awareness and knowledge across the African continent. Through community outreach in the form of meetings, seminars, and a hackathon, this proposal aims to establish Cardano Study Clubs at Uganda's main universities in order to onboard learning developers on Cardano as a platform for blockchain-based projects. Uganda has suffered a technological gap that has caused it to fall behind in several aspects of growth; as a result, its education system has recently supported progress through steps to reorganize in order to boost innovation.. In comparison to its East African neighbors Kenya and Tanzania, Uganda falls behind in blockchain-related innovation. To solve the aforementioned issue, the Blockchain Club of Uganda will launch a campaign to expose Cardano as a legitimate opensource platform for developing Ugandan solutions to students studying software engineering. More developers will be onboarded to Cardano as a result of this, and Cardano will be the preferred blockchain in Africa. Hence, this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer proves that he or she has the necessary abilities and expertise to carry out the project. The proposer has identified the team that will be needed to carry out the project, as well as a budget that is well-defined, broken down, and appropriate in order to meet the objectives. The plan provides a realistic timeframe for completing the work and analyzes the challenges and risks associated with a successful implementation. However, the proposal would have been more detailed if additional solutions to the potential challenges had been included. This proposal can be implemented successfully anyway.", "q1r": 5, "q2": "The proposal gives sufficient information that will audit the progress and the success of the proposal as its elaborates the processes of implementation and the metrics of success measurement as well as the key performance indicators.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 3080, "q0": "The intent is to convince senior students to create their blockchain projects on Cardano. The petitioners want to create a kind of study clubs in Ugandan universities. By convincing the students to use Cardano, there will be a greater chance of expanding developers specializing in Cardano. This project can have a positive impact because convincing talented people from universities to use Cardano will create new project developers. The goals are included in the proposal and correspond to the challenge (Cardano awareness, new developers, graduation project on Cardano,..).", "q0r": 4, "q1": "The names of the team members are on the website as well as in the proposal. It is good that a student is given the opportunity to participate in this project (Halimah). The team includes developers, blockchain specialists and someone with experience in education. The proposal states which 6 universities from Uganda will participate. Study clubs will be set up at the universities to hold Cardano study meetings. A timetable of 6 months has been included. The timetable provides sufficient time to realize the project. It is good that 3 large meetings are held with representatives of the university. Virtual meetings will be held with developers who are already working with existing ecosystems from Africa (Wada). By inviting these people, detailed projects will be shown. It is good that a Cardano hackathlon is being held in the sixth month in order to make even more contacts. A budget overview is available. This contains the material items, location rental, transport costs,… . The budget overview is fully and clearly described in the proposal. The switch from web2 to web3 has been taken into account. It is also difficult to have the 2 developers from Uganda's blockchain team available for 20 hours. Unfortunately, no additional solution has been offered if these persons become ill or do not have time. It would be good to find a spare developer.", "q1r": 4, "q2": "In the elaboration plan, the events are written down with the corresponding location. No interim milestones have been included. To track the progress of the project, several proposals have been outlined (social media, number of commits in the GitHub repo, partnerships). By carrying out this project, there is a good chance that students will carry out their projects on the Cardano network. This proposal ensures that students gain insights into the possibilities of Cardano.", "q2r": 5, "assessor": "z_assessor_1606", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 6841, "q0": "Growing Cardano in Africa passes by hosting activities such those described in this proposal: hackathon, presentation and workshop around the Cardano ecosystem. 6 universities and 3 regions are targeted by the proposers. This is specific and help understand where efforts of proposers will be put.\nPossibility of scalability hasn't been mentioned but the idea presented may be expanded in future as needed by proposers.", "q0r": 5, "q1": "The proposers team if formed by people who are already members of the Kampala Blockchain Club. That being said, we would assume they have knowledge about the functionality of blockchain. Also, their intention to collaborate with Wada is important as they may benefit great guidance during the implementation process. This would be positive factors that would facilitate the success of the initiative\nOne thing I would point out is that there's no much reference about the Proposers background(LinkedIn links) that demonstrates their experience and/or expertise.\nIn different universities where workkshops and meetups will be taking, the proposers are expecting to have groups formed, but it would may be important to be specific by developing a strategy to identify a contact person for each group/university. So that would help the proposers to connect easily with the group through that person.\nThe time frame is detailed and budget contains most relevant expenses, however they are some sections of it that would be important to clarify. The $200 of venue, is this for the office venue or workshop? And if workshop, which one? Same thing for the transportation($100) and honorarium ($600).\nWouldn't also be preferable to use the participants incentive in ADA? So these people would by attending the workshops have a ADA wallet and be attached to the Cardano ecosystem?\n", "q1r": 4, "q2": "The road map is well dfined on a six months period. It hasn't been clearly stated but it would be important for the community to learn about the project progress instance by using the Kampala Blockchain Club website for instance to publish information about it (project).\nThe risk raised by Proposers may be more serious than expected if the Experienced Trainers are not available enough. Why not connect with other external trainers who are 1005 sure available during the entire period of the project activities to prevent delays or postponement of activities.", "q2r": 4, "assessor": "z_assessor_478", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7669, "q0": "Education, education and education. This is my personal belief regarding where Cardano should focus on, something that this proposer also focuses on. This proposer also understands that you can not just barge in and force Cardano onto to people through grand events but rather through a systematical and thought out process. This proposer starts with 6 (six) technical events at pre-determined universities, ensure continuous engagement by establishing a study club at each university. This is then followed up by 3 (three) regional meet-ups than closed of by a hackathon. All in total a 6 (six) month process. Now this is how I personally feel the method you should deploy to increase engagement. Growing it small, maintaining it and then celebrating it. The reach of this proposal is holistic which if executed with the proper budget can have solid reach. By having a solid reach, most likely the amount of onboarded developers will be moderate to moderately high. This is a thought out and on paper most likely successful proposal.", "q0r": 5, "q1": "Where it falls a bit short is in the project admins. The team in this proposal might seem insufficient but after viewing their website, they have enough team leaders that can act as the core team. The only issues I have would be 3 (three) things about the team assembled. One would be a history/some form of credentials that we could look through to validate indeed they have the technical background and the managerial background to drive this long term project successfully, second would be a history of collaboration between the core team and third would be their other sources/materials they will use to educate and onboard developers. Though what makes this uneasiness subside is their identifying the need to collaborate with WADA. I appreciate the thoughtfulness and thoroughness of this proposal.\n\nIn terms of the action plan, they have done a good job, almost everything is there. Having these milestone events can only be effective if it is followed up by engagement plans. Where they will initiate through a mix  use of Twitter, Telegram and social media which culminates to their hackathon. Budget wise although imperfect, especially the details for the 2 (two) big ticket items; the Regional Meet-ups and University Meet-Ups would have been great if it were more detailed to mirror their action plan.", "q1r": 4, "q2": "I enjoyed going back and forth with this proposal. Everything although not perfect, it's almost all there. One aspect they should have considered is documentation as a method of reporting back to the community. This though is not well portrayed in the proposal, not even for one instance. I am assuming the budget for this is lump summed in their 2 (two) big ticket items though it does cause a bit of concern for documentation is standard for these type of events. This though is eased by the fact they are using a bit of documentation in this proposal by attaching a photo of their previous work. What also further eases me is their intent to use GitHub, monitor media coverage and engagement metrics through platforms such as Telegram and Twitter. Although this proposal has it's risk, it is quite auditable and seemingly quite gathered and concise.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9009, "q0": "The statement of the problem is a suitable fit for the challenge category. Introducing Cardano to Ugandan students is one of the effective ways of getting them informed and influencing their decision to adopt the use of the blockchain. Although Cardano is spreading to so many people in Africa, I believe this proposal will even help more in spreading the news of Cardano blockchain to many people (in this case, students) in Uganda, this is a  great benefit not to only the targeted location but Cardano as a whole.", "q0r": 4, "q1": "I am confident that the team is well equipped to implement the project taking into consideration their expertise and relevant experience. The budget is very detailed and I don’t doubt it’s reasonability to achieve the set goals. Going through the plan, I discovered that it is very comprehensive as to how the project would be executed. Also the timeline is very clear and definite (it’s expected that the project would take six months to be executed). There are some challenges or risks stated however I don’t really see the measures employed by the proposer to handle or mitigate them although the bullet 4 is a general mitigation measure, but I think it does satisfactorily address all of the risks/challenges. For example, the first challenge stated has to do with the challenge of walking students through Cardano tutorials but there is no specific mitigation measure directed to addressing that challenge.  Without the measures of mitigation, per adventure these risks arise then it means the project execution will be curtailed. I will advise that measures of risks mitigation be stated so that in the unfortunate situation the project can still be executed. ", "q1r": 3, "q2": "The roadmap is very detailed with milestones and time horizon that are clear. Having university Cardano study groups set up in at least 6 major universities according to the proposer is the initial success of this project, I have the confidence that the metrics/KPIs provided are good indicators for achieving the desired outcome.\nThere is clarity in the problem targeted together with the solution. I believe the solution proposed is strong to tackle the problem.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10477, "q0": "There is a great potential for African youth in the Cardano ecosystem. However there is a gap, this is exactly the gap this proposal seek to achieve. They intimates in this proposal that Blockchain projects are ideal for final year university projects, this requires an open source platform and Cardano should be their platform to help in onboarding and making it more popular among all others.\n\nI realized from their initiative will help in addressing the challenge through the following ways;\n\n1. More Cardano awareness in Uganda\n2. More developers onboarded onto Cardano\n3. Some university and college students start to work out their final year projects on Cardano\n4. Ugandan local devs will be connected to already proven Cardano ecosystems in the region such as Wada\n5. More college and university students from Uganda join the Cardano Academy https://tutorials.cardanoacademy.io/\nThis to me is a great proposal that can help address the challenge.", "q0r": 4, "q1": "The 6 months period for the project implementation is worth commending. The manner it was presented are well designed and straight to the point. I was only looking forward to seeing more details on the team members. Though they mentioned who constitute the team but details about their experiences is scanty. The information on themselves and their experiences must not only define who they are, what they do individually, what their areas of training are, but also include several links from their social networks, such as linkedin, where we can get to know them more intimately , and several direct communication channels, where individual contact can be established with each other. ", "q1r": 4, "q2": "The information provided on the KPIs are well designed with clear understanding of what to look out for. I however suggest that the team could provide more updates to ensure an excellent way of reporting. They should also include very clear measurable accomplishments. They may also consider collaborating with Wada, ABCD, or POA  for a successful project. They should also try to include some more educational resources beyond the tutorial page mentioned. ", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Build Cardano Study Clubs in the major Ugandan Universities to onboard learning devs on Cardano as a platform for blockchain based projects.", "experience": "Blockchain Project management for 5 years with a tested team of community builders, blockchain local devs and blockchain advocacy in the country with a dream of bridging the technology gap in on the region."}