{"id": 399158, "author": "carlhenryglobal", "title": "Protecting wildlife & Maasai, Kenya", "url": "https://cardano.ideascale.com/a/dtd/399158-48088", "category": 26442, "amount": 9750, "description": "Population increase, wildlife habitat encroachment, permanent settlements, increased wildlife, land sale/division = a strained ecosystem", "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 3421, "q0": "Proposal has provided a lof of useful information in the proposal. Specific information such as the project's characteristics, the participants, the purpose and impact of the project should Cardano or the Cardano developers are included in the proposal. All of the above information will help voters better understand the project and the values it brings. In addition, the proposer has also outlined the parties to cooperate and provided information for everyone to find out, which is a plus point for the transparency of the project. Not to mention, the founder has also made the risks quite clear and with how to solve this, the project risk will be more limited.", "q0r": 5, "q1": "Proposer has presented the background and intention to implement the plan, but has not stated the specific plan and time. Proposer should add implementation steps such as how to execute the build or steps in the build. All information should be clearly stated. In addition, in the 'detailed budget breakdown' section, the proposer should consider providing a little more background information before providing a detailed link. Profiles of project members should also be mentioned in more detail, there are some members who are not provided with any information other than their working position, some only have reference links. Proposer can provide general information such as job location, experience and achievements.", "q1r": 3, "q2": "The goals for the development and success of the project are quite clear, which will help the voters clearly see the direction and value of the project. Not only that, the proposer also provided some indicators and criteria for the success of the project. This makes it easier for everyone to monitor and evaluate the success of the project.", "q2r": 5, "assessor": "z_assessor_1652", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 3664, "q0": "Starting with the description of your proposed solution, I see a lot of responsibility being placed on the Cardano Community Hub this project wants to create. They all have a lot of significance in protecting natural ecosystems in Africa. I appreciate this project as it has the potential to bring great value not only to Africa but also to the sustainable development of the earth. However, the way you mentioned the solution directly confused me, and I even had to read it a second time to see your proposal of starting a Cardano Community Hub. Perhaps due to the way of text presentation and the proposal’s wording, I urge you to reconsider these faces.\nContinuing with your solution's alignment with the challenge, you do a great job with paragraphs highlighting the great significance this project can have for the development of Africa and the Cardano ecosystem. You show the reader how powerful an invested community is, and I love it.\nEnding with main challenges and risks, a project with a large stature will, of course, have many unwanted risks, and I see that your team has foreseen quite a few challenges. However, once again, you confused me a bit reading your proposal. Are these the risks that will affect the formation of the Cardano Community Hub this project wants to create, or are the challenges that will arise when the Community has fulfilled its responsibilities? Moreover, about the solutions related to environmental pollution, population growth, the participation of residents and especially the black market problem, I feel they are all quite general solutions and not highly solved, when this is what nature conservation organizations and even the government are always trying to do but cannot succeed. So, let's reconsider the risks that will directly affect the establishment of the project's community, and let's ignore such overly profound dangers for the time being.", "q0r": 5, "q1": "To be honest, the proposer, I feel confused because of your wording. Let's talk about the detailed plan first, what is your purpose when you put the first 3 paragraphs here? While you never mentioned The Enkuseru Sampu conservancy and Oloosidan Community Dam in the Impact part. And what is this Community Area? After all, is your team proposing to build a Cardano Community Hub or a dam? And with a project purpose starting to become unclear, I don't think your budget link or preliminary members’ list will convince me either. Sorry to give this part 2 points.", "q1r": 2, "q2": "Building a thriving community leads to a bright future, and you seem to have set many goals for the development of this project. I see the numbers related to human resources are set out and their responsibilities. But why haven't you mentioned these things in your detailed plan? I feel like the Feasibility part is from some other proposal, and it has nothing to do with the opening and ending. I give you 3 points because the KPIs you provided are linked to the proposal of creating a Cardano Community Hub, but in reality, it is still a lot of unclear things.", "q2r": 3, "assessor": "z_assessor_1666", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 4233, "q0": "Here is all of the information required for a comprehensive project, and I admire the proposer for being so well prepared. Other programs with the topic of wildlife protection merely focus to specific core characteristics such as habitat construction or promoting awareness. However, the proposer has contributed a lot of ideas to this project. In addition to the usual activities, they have promoted a number of ideas such as assisting breeders in protecting their animals from predators, establishing rangers to guard the weekly wildlife conservation area, and especially the project supports the provision of water sources for people, animals, motels, and tourist attractions. The aforementioned aspects are absolutely novel for a wildlife conservation effort, and they constitute the project's centerpiece. Besides, the initiative benefits from extending the market for Cardano in Africa, which is currently lacking in access to new technology. By partnering with the local government, propagating and educating people about this community, Cardano's popularity is certainly not far away. Furthermore, the issues they raised were backed by realistic and concrete answers. Although the choices for cooperating with the government are still unclear, it is still reasonable and acceptable in general.", "q0r": 5, "q1": "What is said here is rather hazy and ambiguous. First and foremost, the proposer lacks a precise strategy with the requisite dates. The lack of a list of tasks to complete in the project by month or week will cause the project to quickly slip into a stalemate, since not knowing what to do first, or in the wrong sequence of work. And it's tough for investors to put money into a project when they don't know the priority. In addition, the proposer gives a link to the budget breakdown, however, it does not reveal any relevant information. I hope the proposer will have a look at this area. Finally, for team members, the proposer should highlight their accomplishments or years of industry expertise. This will make it simpler for the project to attract investment funds by putting together a strong team of personnel rather than simply names and positions.", "q1r": 3, "q2": "Overall, I', quite satisfied with the success of the project, which is mentioned at the end of the project. Not only does it help preserve ecosystems for wildlife, but it also promotes sustainable use of biodiversity in the future. On the other hand, the proposal does not clarify how the development progress of the project will take place over a period of time. For each development step, the proposer should include a specific timeline to make the project more convincing. Additionally, the proposer first suggested promoting Cardano's popularity or supplying water for people, however, this was not included in the success of this project part. Therefore, this section needs to be examined more closely.", "q2r": 3, "assessor": "z_assessor_1713", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6080, "q0": "I can see the intentions behind this proposal which is to help with the work done with conservation of not only parks but also fighting pollution and educating the community.This is a very impactful proposal as it interacts with the local community and it is trying to solve a local/global problem at the same time, but i have some concerns as listed below:\n- I feel the proposal should have touched more on the legal aspect of this proposal and how the government in this area are open to the idea of a crypto project around their parks.I am saying this because some African countries have strict laws/stereotype around crypto and it is important to know how the people feel about a project in their place.\n-  Another thing i noticed is that the proposal was all about conservation in its response to \"Please describe your proposed solution\" but the completely went opposite talking about 4th Industrialisation on answering \"Please describe how your proposed solution will address the challenge\" without telling us how the power can be managed without pollution and how industrialisation is not almost a polar opposite to conservation.It is possible to achieve the 4th Industrialisation without pollution and a conserved environment, but you have to explain how you intend to achieve that .\nIrrespective of the issues raised above , i will be giving this proposal a 5 star as there is lots to be done about poaching, conservation, education and pollution and using Cardano as the platform with positively impact the cardano ecosystem.", "q0r": 5, "q1": "The proposal presented a clear roadmap with timelines and a detailed cost breakdown detailing the acres that will be covered .I feel the requested amount for $9000 is too small for the amount of activities but economics varies from region to region.\n- There also is the aspect of logistics, This is also important to a project like this as the team will be travelling to various communities from base.\nA well listed team with verifiable links were provided and the team shows the ability to implement this proposal to success. I am giving 5 star.", "q1r": 5, "q2": "I use to be a PRO(public relations officer - https://www.linkedin.com/in/omojo-akawo-80a846a0/ ) for the UN SDG project in 2012 and it gives me joy to see the key metrics of this proposal aligning with the SDG goals.\nI will encourage the team to also include the means to which the community will get feedback as this will help community members track the progress of the proposal if funded independently.\n I am giving 5 stars.", "q2r": 5, "assessor": "z_assessor_331", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Introducing Systems to decrease the strain on the farmers, herders, wildlife, the landscape and the people of the Maasai community", "experience": "The Enkuseru Sampu conservancy was established in January 0f 2013.The conservancy has been present for the past decade at least, which indicates that there are skilled and experienced persons on the ground to share knowledge with other newly established conservancies"}