{"id": 399187, "author": "ditcameroon", "title": "100+ Plutus Trained Women", "url": "https://cardano.ideascale.com/a/dtd/399187-48088", "category": 26442, "amount": 18000, "description": "Women play a central role in Defi within the African local context. They are being left behind in making solutions to local problems.", "f6_no_assessments": 3, "f6_rating": 4.555555555555556, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is fully in line with the objectives of the challenge, as it intends to train women, more specifically in Cameroon, to educate them about Cardano, thus generating education and, in the future, an income for this community. According to the proponents, the DeFi community in Cameroon is already significant. I wish they had addressed a specific subject better, so that we could have a more detailed view of what happens there. It would be interesting for them to explain what is already happening, even if it has nothing to do with blockchain/Cardano, and support their statements with research and local reports, if any. In this way we would have a proof of the said scenario. I am not suspicious of the legitimacy of this information, I would just like to understand it better, to situate myself, because the expressiveness of these technologies is unique in a corner of the world and, except for a few exceptions, in places that are famous for their technological development, we are not able to know the characteristics and realities of each location. Other than that, I think the proposal is very good and perfectly achieves what we are looking for in the challenge: to finance proposals that benefit the inhabitants of Africa, generating opportunities to help communities, either through the development of humanitarian projects or through the education of their inhabitants. , so that they can work with Cardano and thus change their reality and also that of those around them; while, of course, our ecosystem is expanded, investment in Ada increases, Dapps are created, digital wallets, NFTs are minted on our blockchain and so on. This idea does exactly that: it helps the local community through education and in the future this will generate employment, I think it is even more special that the target audience is women, because the proportion between men and women who are part of our community is still very unequal. There are many, many men and rare women, so in my view all projects that give visibility and invest especially in this part of the population are already important in themselves. It is also clear because this investment would be long term, as proponents claim that Cardano is not very popular in the country, educating its inhabitants about this could start a wave of development in the place, who knows, men would also be interested and run after the many opportunities that our ecosystem has, in short, I think the idea is exactly what we are looking for in the challenge and has the potential to generate a very strong and positive impact. \n", "q0r": 5, "q1": "The feasibility of the proposal is good, with only a few details to improve. We have the basic information about what would happen, when and by whom, but they all lack detail and organization. Starting with the analysis of the script, there is not one, per se. We know what would need to be done, but they are a series of activities described in a somewhat superficial way and without any temporal organization. It would be necessary for these tasks to be subdivided into months (from what I understand the project would last 1 year). What would happen in the first month? And in the second, and so on? In the way it is described, we have no way of knowing how long each thing will last and how it would relate to the others (activities that would take place in parallel, or if it would be necessary for one to end to start the other, etc.). I also feel that the description of the activities is done in a very superficial way, some of them needed more detail so that it was possible to understand them better. For example, in partnership with Wada, a very active and respected group here at Cardano (I've seen several of their proposals), a marketing campaign would be carried out. In what way? How would that disclosure be? Through which media? Would videos, texts, images be made? Would we have a specialized team with advertisers and designers ahead of this stage? Proponents say they would visit universities and technical schools to talk about Cardano. Which? In which cities? And why would each be chosen? How would they go about identifying female candidates who would fit the vacancy? What would the criteria be like, the selection? In general, this part of the proposal fills us with information, but without the necessary degree of detail and the organization needs so that we could fully understand it. The budget issue is also informed in a somewhat superficial way. There are 18k orders, in which: 3k go to marketing (we don't know how the campaign would be carried out, so it's also not possible to understand if the value is fair); 3k for prizes (which and how many prizes?); logistics, for example, involve many factors, so how would the 2k be distributed? Anyway, each part could have been more detailed, in order to generate a better understanding of whether the requested amount is justified or not. And finally, as far as the team is concerned, this part was great, we know exactly who we would be dealing with, their names, and previous experiences as well as their resumes through their linkedin profiles. However, they did not name who would do what in this project specifically, and also how these people are involved with Cardano. \n", "q1r": 4, "q2": "I think that the proponents even inform means of auditing the proposal, but not enough. What they say is that success would be measured by the number of women enrolled in educational programs and also how many obtained a certificate of acquired knowledge, the goal being that all women achieve. Female participation in hacktowns and Wada events would also be measured. These shapes are good for numerically understanding the consequences of the project, but a more detailed analysis would be appropriate here as well. In addition to monitoring how many women enrolled in the courses, an individualized follow-up of their learning process could be carried out. That is, to know if they are understanding the subjects, if they are able to program in the languages ​​taught, if they already have some projects in view in which they could intern to put into practice what they have learned, if they have any complaints or imminent problems... they should be followed up afterwards, where they are after the program, have they become active members of the Cardano community, whether through Catalyst, Wada or other initiatives that somehow belong to our blockchain? This research should be done in order to understand the impact of the courses both on their lives and on Cardano. Regarding the monitoring of the process, this is not so possible since we do not have a definition of dates, that is, deadlines to be met so that the goal is reached. If there was a schedule, I think it would be easier to monitor whether the proposed activities were being done at the right time and in the right way too. In other words, in my view, the auditability established here says much more about the results than about the process, when both parties lack monitoring. \n", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 9, "ne": 5, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "This proposal seems exactly in line with the Challenge brief. It should not only have strong impacts on seeding long-term projects and forming partnerships by providing job training, but by increasing Haskell and Plutus developers, that should squarely help position Cardano to be the leading blockchain in the region while giving Africans the tools and education to be the leader in Web 3.0 technology that the Campaign goals seek.\n\nProviding Hackathon prizes is a very creative way to incentivize participants and students to join the free-to-them learning program that this Proposal will offer. Covering childcare during the learning sessions and/or Hackathons is an important, notable, and valuable way to further ensure that this project succeeds; again a great local impact and great Cardano marketing for future impact. \n\nVery clearly a strong proposal, and onboarding 100+ more Haskell and Plutus developers, and in a diverse region, is a phenomenal way to ensure that Cardano is exactly what we want it to be, and is again right in line with the Campaign. \n", "q0r": 5, "q1": "Because the project seems early on, in the recruiting phase still, I am not fully confident in its ability to become reality. However, a very well drawn out plan seems to be laid out, and equally importantly, a strong and expert/senior team already seems to be in place, showing that once the recruiting of students to participate is done, everything else seems pretty well ironed out and should run smoothly. \n\nWADA already having a Haskell and Plutus training program established, and a hub already in Cameroon and one of the others next door in Nigeria shows that this project is ready to start and become a reality and is pretty much only waiting on finding women interested in becoming the next programmers for Cardano. \n", "q1r": 4, "q2": "As far as I can see, just about every step along the way of this project should be quite auditable. Seeing where advertisements have been posted, following applications and students joining on, seeing Hackathon results, and eventually seeing certification results at the end of year 1 and year 2, how closely those align with the 50 + 50 planned for. \n\nEach piece in the budget breakdown in Feasibility should allow for following along with marketing, prizes/awards, event and space rental, trainer pay, and more. This is most definitely very auditable. \n", "q2r": 5, "assessor": "z_assessor_1446", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The main goal of the 'Grow Africa, Grow Cardano' challenge is to raise Cardano awareness and knowledge on the African continent. The goal of this proposal is to train these women, equipping them with the right tools to put the full power of brainstorming, designing, and implementing solutions (on the blockchain) into their hands because in the African local context, women play a key role in designing and running local Defi solutions within their communities as there is potential for blockchain-based solutions. This increases the likelihood of mass acceptance, which widens local effect. This proposal illustrates Cardano tech use-case solutions in a straightforward and concise manner. Hence this proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team at Wada have shown over the period their knowledge and expertise in block chain specifically Cardano and have the necessary abilities to carry out the plan. The proposer has clearly stated the team members needed to carry out the plan and gives a budget that is broken down into pieces, and acceptable in order to meet the established objectives. The proposal also includes a clear and actionable implementation strategy that demonstrates what is being done and how it is being done. The proposer has considered the challenges that may arise during implementation and suggested possible solutions. Hence, problem solution listed has a high chance being implemented successfully.", "q1r": 5, "q2": "The proposal comprises a timeline and milestones, as well as metrics and key performance indicators (KPIs) that determine the proposal's success. The proposal offers a clear explanation of the targeted problem as well as a remedy that solves the problem similarly. As a result, the information given is adequate to audit the proposal's development and success.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 13, "ne": 0, "ng": 9, "nfo": 4, "vca_o": 1}], "solution": "Launch training program specifically targeting women in Cameroon focusing on some Defi solutions (already funded) to address local problems.", "experience": "Cameroonian female family members deeply ingrained in local context Defi already taking place (without blockchain)\n\nCameroon Team: skilled Haskell and Plutus developers and blockchain/distributed ledger technology trainers"}