{"id": 399235, "author": "manucho", "title": "Cardano tokens in loyalty programs", "url": "https://cardano.ideascale.com/a/dtd/399235-48088", "category": 26442, "amount": 15000, "description": "Reward programs motivate existing or potential customers without delivering real value, usability or freedom.", "f6_no_assessments": 3, "f6_rating": 3.111111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "I didn't understand why this proposal was launched in the Africa challenge, because it doesn't say anything about the continent at any time. The idea is to create a new rewards system for customers who buy products or services from partner companies, once they make these purchases, they will receive a token minted on the Cardano blockchain that can be accessed through a QR Code. In the future, this token can be exchanged for some cryptocurrency or for local currencies, such as dollars, euros, etc. At least, that's what I understood from the proposal. I thought it was a good idea, because sometimes store rewards are not very useful, they are more about cashback for future purchases, where the customer is forced to spend even more to enjoy the benefit. The idea of ​​you having more autonomy in relation to the benefit gained, being able to use it now or in the future, if you prefer, is quite interesting. And involving our blockchain technology in this is great because it can organically attract new members to the Cardano community (people who are not necessarily interested in blockchain, but want their rewards, want a cashback in a way). I think this proposal is very positive in the sense of generating new members for Cardano and benefiting the ecosystem, as it would be compatible with both the challenge of the Dapps and the new members on board. However, the challenge in which it was launched aims, in addition to benefiting the Cardano ecosystem, to promote the improvement of the African continent, whether in an economic, social, environmental, etc. And at no point is it mentioned how the African people would especially benefit here. So as much as I liked the idea, it doesn't quite align with the challenge, so it's not fair that it gets a good grade on impact. \n", "q0r": 2, "q1": "A roadmap is not provided. Everything we know about the development process can be found in the following snippet: “I have regional cardano developers who can work with me, so in the next two months I believe the architecture and designs will be ready. The next couple of months could be collaborating with guys to let us build their payment system on us and sign contracts. By the end of 2022, we plan to launch the platform.” How will the proponent and fellow developers work for the next two months? For how many days a week, for how many hours a day? Doing what? They aim to launch the platform at the end of 2022, but until then, what will happen each month? It would be necessary for the proponent to detail what would be done monthly, enumerate the activities and describe each one of them in detail. As we are told, it is not possible to understand clearly what the day-to-day work would be like that would result from the final process. Regarding the budget, most of the money is intended to pay the salaries of the professionals involved. However, we do not have much knowledge about what their work routines would be like, as I have already mentioned. If we knew for how many months they would work, during the week, for how many days they would dedicate themselves to this project, for how many hours a day, it would be much more possible to understand how this money would be used. We have a portion of the budget dedicated to “other subscriptions and future unaccounted for issues”, which would be $3,000. I thought it was a very high value for us to not even know what exactly these things would be. Would they be unforeseen? If there was no problem, where would that money go? Finally, speaking of the team, the proponent states that he does not yet have a team. He says he thinks he's qualified to lead the developers, I believe he has the potential to be a good person for that, but I don't know if this is the moment because he seems to be still a little inexperienced, being at the beginning of his career. It would be much better for him to prove why he is qualified to take charge of the project through experience and previous work. It's also unclear what kind of relationship he has with the Cardano ecosystem. Regarding the other components, it would be much better if he had already introduced the team members, it is difficult to bet on the work of people who are not yet defined. And it is worth remembering that a good part of the funding would go towards this, towards the salary of those involved, so it would be more appropriate if there was already a team formed and that conveys confidence in relation to the preparation to carry out this project. Therefore, I think the feasibility is not good, having many points to improve. \n", "q1r": 2, "q2": "As I understand it, the proponent would monitor the project's progress at regular intervals via trello. Trello is an online tool used a lot in the design field, as I recall, as it allows a team to work on the same project at the same time. I think that this is a great way to audit the partial results of the project, it is enough that the time interval that will be used in this audit is really defined. In my view, at most 1 month to go from one update to another. All progress must be recorded there: how were the work routines of the professionals involved, if any problems were faced, if the small successes expected for this time step were reached... Github will also be used, which I think which is one more factor to improve the auditability of the project. Regarding the final results, the success scenario outlined by the proponent seems to me to be very much in relation to the adoption of companies for their token, I think this is a very practical and effective way of measuring success, after all, what we want is generate an alternative and more effective form of reward, which is advantageous for Cardano but also for the companies that work with it. I believe this is the way to audit the proposal, it is enough for this data collection to be taken to the Cardano community, which can be done, for example, through a meeting during Town Hall. The proponent can prepare a brief presentation containing information on whether companies have adopted their token, what reflection this had for Cardano, if in a way new people have also come to know and invest in our blockchain. What kind of impact did this have for the African continent (this part is still a mystery to me) and etc. I think that the auditability part was in fact the best part of the proposal, having only a few points to improve. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Proposer showed the problem and introduced an alternative solution. However, the information for the solution - Epay has not been specified by explaining or citing the recommendations. For example, the founder can give evidence for 'providing higher engagement', so the voter will better understand what the proposer wants to mention. However, the proposer also provided information related to how to use Epay, the benefits of the application for customers and for Cardano. In the risk section for the project, the Team has given the risks and solutions but has not yet explained the solutions. The team should pay more attention to the explanations in Impact to get the best results.", "q0r": 4, "q1": "Proposer does not provide specific information regarding a detailed plan and timeline for delivering the solution. If the project has been established as mentioned by the proposer, it is not too difficult to include relevant information in this proposal. Proposer can also share more about the specific roadmap in the next 2 months instead of just saying 'the project will be lauched by the end of 2022'. Failure to provide a specific roadmap will make it difficult for voters to see the project development plan. In addition, in the 'a detailed budget breakdown' section, instead of just saying the total amount to be paid for the positions, the proposer can tell more about how that salary is calculated (for example, by month, how much is the salary). ). Information about the members of the group is quite good, working experience has also been mentioned. However, the proposer can also share more about his/her own achievements and educational qualifications to provide more detailed information.", "q1r": 3, "q2": "The information on the 'Auditability' section is given quite well. The goal of the project is clearly set out by the founder. Project monitoring will be done by a third party, Github, to create transparency and clarity for the project. However, the proposer should provide more clear KPIs/Key metrics for voters to better understand the criteria for evaluating the project's development.", "q2r": 3, "assessor": "z_assessor_1652", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "After reading the introduction of your team's project, I see how you raise the disadvantages issue of the traditional loyalty programs and rewards schemes, and the benefits that Cardano tokens can bring to the users in the future. The presentation of the EPT coin and its practical uses is also clear and convincing. \nHowever, I can see that this is an expansion project to attract users into the Cardano ecosystem, and it can be applied everywhere, not just in Africa. So, of course, this project is still linked to the challenge, it's just that you don't make it clear in the introduction of the proposal. A project for the challenge to develop in Africa, but not seeing a single word that mentions Africa, is not advisable, in my opinion. \nFurthermore, I find it unnecessary regarding the risk related to the resources you mentioned. Since this is a project you are working on your own and would like to collaborate with other developers, please include your personal information in the Feasibility part so they can trust in collaboration with you, instead of writing this line of risk. And finally, about the risk associated with “Acceptance to the involved audience”, I don't quite understand, and I would like you to be able to cite your data (that's where the data comes from, about where's the audiences and why does it affect your project).\n", "q0r": 4, "q1": "First, let's talk about the detailed plan for this project, and I emphasize DETAILED. I see you provided an estimated time to complete the required work and also announced that you already have Cardano developers in the area to work with. But that's still not enough, if not that your presentation is too general and not convincing. Who are those developers? When is “As everything is set”? And specifically, what will you need to do to make your progress complete?\nNext, regarding your proposed budget, this is the budget for future team formation, not for carrying out the activities outlined above. And setting a cost for “other subscriptions and future unaccounted issues” is a bit too vague. If you have not planned these issues, please write them as \"\"incurred costs\"\".\nFinally, as I said in the assessment of Impact part, please describe more about your professional skills, your achievements or, at least, your experiences gained after working on BSc and Eth so that the experts developers can see your capabilities and investors see a return on investment for you.\n", "q1r": 3, "q2": "In this part, do not discuss the SDG goals and KPIs that your project wants to achieve, I don’t understand and don’t visualize what you have presented. The information provided by the proposal is not enough to assume it is funded, this information can help the community monitor and evaluate the step-by-step process of completing the proposed plan. Moreover, I do not see key metrics or specific KPIs to define this proposal's success based on what and how. Since this is your first proposal, please be more serious about the presentation and concretization of the content. ", "q2r": 3, "assessor": "z_assessor_1666", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "The E-pay app offers the solution to these issues by providing higher engagement and customer lifetime value by being on the blockchain.", "experience": "I am almost graduating from C.Sci and Iearning haskell at the moment. I have built on Eth and Bsc and I believe this solution will work to build cardano use cases in not only Kenya but also Africa."}