{"id": 399765, "author": "fanna", "title": "Cardano and Smart City Awareness", "url": "https://cardano.ideascale.com/a/dtd/399765-48088", "category": 26442, "amount": 1249, "description": "Cardano will power the Entebbe Smart City - how do we raise awareness and educate residents in the city about the project and Cardano?", "f6_no_assessments": 7, "f6_rating": 4.285714285714286, "videos": [], "media": [], "f6_assessments": [{"id": 7382, "q0": "The proposal aligns perfectly with the objectives of the challenge because it promises to promote a series of teachings about the Cardano ecosystem for the residents of the African city Entebbe. I found this proposal very well written and organized, we know what topics will be covered in these teachings, the proposer claims that the explanations will be focused on different cases, as she cites, blockchain can be used for “DID integration, payment platform for public services, savings and loan products, land registrations and property rights” and so on. All this knowledge will be passed on to the city's inhabitants through an “awareness campaign through workshops and publicity”, which will be funded at a very low amount compared to what is asked for in most other proposals. It is positive how the bidder sees that the biggest challenge here would be to engage the locals of Entebbe to actively participate in the campaign, and how this will be overcome through marketing campaigns. This already demonstrates a certain maturity in relation to the process, the possible difficulties to be overcome and how the bidder has already thought about how to overcome them with her team. Another positive point is also that they have strong partnerships with groups that are already working to promote Cardano throughout Africa, the presence of networking is always an important thing, whatever the nature of the proposal. Therefore, I totally agree that the idea will achieve the specific objectives of the challenge, which are to benefit at the same time the African continent, introducing its inhabitants to what Cardano is and through that generating education and employment opportunities (mainly in the areas of business, programming and legal, which are the ones that need more manpower). At the same time, the proposal would make several people (if all goes well) enter the Cardano ecosystem, thus increasing the overall investment in our blockchain (buying and selling Ada, delegating to pools, buying CNFTs, building or sponsoring Dapps and etc), mainly because the bidder says that there are already potential future blockchain users in sight in the city. With that, I believe that the impact here would be maximum. \n", "q0r": 5, "q1": "The feasibility of the project is almost perfect. Regarding the script, we have a weekly time division, something rare to see. Generally, proposals divide the total time into quarters, but as this is a shorter proposal, the proposer explains for weeks what will happen, listing the activities, which I think is very good, as it gives us a very solid view of the process. . These activities could be even more detailed, in my view, but at the same time they are already satisfactory information. For example in the “advertise and promote the $75 event” part, in the third week, how would that be done? What are the marketing strategies to be adopted, how will the content that will be created be disseminated to the target audience? Regarding the budget division, less than 2 thousand dollars is requested, which is very rare here at Catalyst, I think the team involved was very honest and only asked for the funding really necessary for the activities to be carried out. We were able to understand in a very complete way how this money would be used, as it is divided into each of the activities, for example the announcement of the event, which I said could be better explained, by itself costs USD 75. I think it is possible We fully understand the need for the requested value. Regarding these two parts, the feasibility of the project is excellent, what I commented about being almost perfect was due to the team presentation. We know who the professionals involved are in a very basic way. The bidder attaches his linkedin profile, but does not explain in detail who he is. The other two team members already provide a brief explanation of who they are and their professional roles, but they also don't go into detail. It would be more appropriate if we had a more detailed explanation of who they are, what they have done professionally so far, how they relate to the Cardano ecosystem, what exact role they would play here and preferably that the 3 of them had attached their linkedin profiles. Therefore, if this part were increased, it would also give maximum grade for the feasibility of the project, as the other questions are commented in an ideal way. \n", "q1r": 4, "q2": "The proponent suggests some means of auditing the process, but I think his propositions are quite basic, there is no rigid plan for monitoring the process. And, from what I understand, the main goal is to reach 1000 people in this campaign. But beyond that, I think we would need to explore a few more things. Regarding the process, for example, I think it is necessary for a member of the Cardano community who is engaged with this process to closely monitor the progress of activities, or even one of the 3 team members to update weekly on how the process is going. project development process for members of the Cardano community. It would be interesting if this data collection were made available online so that all members of our community could access such information. This can be done through various platforms, such as google docs, miro and notion, for example. Regarding the final results, it would be important that, in addition to this numerical issue of how many people became aware of Cardano and its opportunities for use, it would be important to understand how they were reached. Did these people create DIDs, as mentioned? Did they acquire Ada? Are they participating in Catalyst? To clarify these doubts, the team members themselves could organize a meeting with some of the people who participated in this campaign, in order to understand what kind of activities they are currently developing. Or, an individualized form could be applied, trying to capture the impact of this campaign on their lives, as I explained earlier. In this way, we would have a more complete auditability, which would go beyond quantitative issues. I will give it 4 stars for two reasons: the proponent already presents us with some ways to monitor the process, even if basic; the presence of a very detailed roadmap makes monitoring the process more possible. With my suggestions, we can increase the level of auditability here. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2429, "q0": "Cardano awareness and knowledge creation in Africa is the main goal of the 'Grow Africa, Grow Cardano' challenge. This proposal aims to host an awareness campaign to promote Cardano's intended use cases to people of Entebbe City through workshops and advertising. The campaign will take place in a sandbox environment and will be developed to run on the Cardano blockchain. The proposal's impact will be to inform and educate locals about the Cardano blockchain's smart city project and use cases, which include DID integration, utility payment platforms, savings and loan products, land registries, and property rights. This will spread the word about Cardano and the smart city's future applications. Raising Cardano awareness helps people learn about the blockchain and contributes to the objective of making Cardano a preferred block chain. This proposal adequately addresses the challenge.", "q0r": 5, "q1": " The proposer has demonstrated his knowledge and competence in block chain, especially Cardano, over time and has the essential skills to carry out the idea. The proposer also states team members required to carry out the plan, and  creates a budget that is broken down and understandable in order to fulfil the goals. A realistic schedule for finishing the work is also included in the proposal, as well as a clear and actionable implementation plan that indicates what is being done and how it is being done. The proposer has considered the challenges that may occur during implementation and has proposed solutions to these challenges. Hence, problem solution listed has a high chance being implemented successfully.", "q1r": 5, "q2": "The proposal offers enough information to audit and evaluate the project's progress toward its stated goals, since it elaborates the implementation techniques and success measurement criteria, thanks to the well-developed material from the effect and feasibility categories.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 3429, "q0": "Proposal has released  some information related to the project such as the impact of the project on Cardano or the residents of Entebbe. Proposer has also provided additional KPIs to the project so that everyone understands the value the project is about. In addition, risks and ways to deal with it have also been given, thus, limiting risks in the future. However, this information is not really specific when the characteristics of the solution and how it works have not been mentioned. Proposer should add that information so that people have a better overview of the system.", "q0r": 4, "q1": "The information in the Feasibility section is quite complete. First, the proposer provided a pretty good detailed plan, broken down into weeks, and each week had tasks that needed to be completed. Such a specific roadmap will help voters better understand the project. Next, the 'detailed budget breakdown' is shared quite thoroughly. Spending plans are recorded on a weekly basis, and each week's activities have a clear projected cost. This specificity will be a plus for the proposal. However, the information of the group members is not very detailed. Members should have more general information such as working position, education and work experience as well as achievements (even if there is a linkedin link).", "q1r": 5, "q2": "The goal of the development or success of the project is clearly stated. Specifying a goal of '1000 people participating in the project impressed me because the proposer provided a metric that could define the success of the project. Moreover, the objectives also have fairly clear evaluation criteria.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 3671, "q0": "The first thing that needs to be said is to evaluate the overall content of this project. This is a project to enlighten and educate people about Cardano and smart cities in the future. And just like the proposer said, I admit this is a simple project, and it's just like a side one to support the Smart City development project (in my opinion).\nNext, I would like to make a few comments on the specific content of the Impact part. Proposer introduces the purpose of this project and gives an overview of the applications available on the Cardano blockchain. You also directly mention two KPIs of the challenge this project will address, local impact and local partnership formation. And while you claim this is a simple project, you still present a significant challenge and problem-solving approach.\nFinally, and the reason for my score of 4, I would like to offer advice on the shortcomings of this proposal. First, before directly mentioning the audience that the project wants to target and introducing the project, write a few lines to clarify the actual context or motivation for your team to want to build this project. Second, I wonder if the two mentioned KPIs could be solved by THIS EDUCATIONAL PROJECT or THAT SMART CITY PROJECT. Because, in the first place, I still don't understand why you have to build a smart city awareness project separately when you can combine it with the main project. So, please analyze this more so that readers don't have the same problem as me", "q0r": 4, "q1": "Because this is just a simple propaganda and education project, your team's plan is precisely the same as a regular event plan, and I wonder what exactly you will teach in this workshop? As for the budget, it's really detailed, to the point where even the free categories of activities to enter. Or can I say you are copying and pasting from the plan above? If that's the case, I don't appreciate it. And please provide DETAILS of your team members, not just list names and years of experience so briefly. Moreover, Fanna Park is the venue for the conference, or is a representative required to complete this project? Please clarify more about it", "q1r": 3, "q2": "To be honest, there are many flaws in your Auditability part. I feel that your team is not really serious about it because this is just a support project for smart city development. Take a simple example like the goal of \"Educate 1000 people about Cardano and the upcoming Entebbe Smart City Project\" how they have been educated? How do you know you have successfully disseminated information to them? Your team only set a target of 1000 participants but did not develop any worthy educational goals. This omission makes me wonder if you were serious when writing this proposal. Again, this challenge needs a project that promotes Africa and Cardano development, not a project designed to hold a regular workshop.", "q2r": 2, "assessor": "z_assessor_1666", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4236, "q0": "The proposer appears to have done a thorough preparation for this project. I believe the project's primary target audience is the citizens of Entebbe, Uganda, which is located on the northern beaches of Lake Victoria, Africa's biggest lake. This is an area that attracts a big number of visitors each year due to its distinct cultures and landscapes, therefore it is evident that raising awareness among the locals makes sense. Furthermore, the functioning of Entebbe smart city on the Cardano blockchain would dramatically boost the number of users, both residents, and visitors, who wish to come and learn about this location. If this initiative is successful, it will be a massive benefit to the Cardano community in the future. In addition, I want to praise the proposer for engaging with the municipal administration in order to make it simpler to contact the people and spread information more broadly. This is a significant benefit that not every project gets. Concerning the risk, I am pleased with the proposer's problem-solution. However, as the proposer stated, they cannot look for other obstacles in the future, but I believe that if they conduct additional studies, they will find them. How, for example, can you ensure that the number of individuals taking part in the discussions meets the initial expectations? This additional learning will avoid needless risks that might threaten the project's success.", "q0r": 5, "q1": "The budget breakdown and detailed plan parts contain identical characteristics and data. This demonstrates that the proposer spent a significant amount of time thoroughly thinking and testing this suggestion before making it. In general, I feel the required sum to be pretty appropriate for beginning a promotional endeavor, reducing all superfluous expenses. There are two aspects, though, that I hope the proposer would explain and add. They stated completing the content in the third week but did not define how the information would be structured, or which sections would be included. This is critical for a promotional project to ensure that everyone on the team is on track and understands what they need to do. Also, it appears that two team members are too few for this project. Overall, there is a lot of work to be done, therefore they should recruit some more individuals to help, such as a joint manager or accountant.", "q1r": 4, "q2": "This section may appear short, but it nevertheless fits the majority of the project's criteria. The fact that they refer to a precise number of individuals to teach about Cardano and the smart city of Entebbe, in particular, demonstrates that they have a defined aim and are determined to achieve it. Furthermore, stating that the project development is always on schedule and will be completed entirely demonstrates that they are completely confident in the project's success, which is a highly positive mentality. Overall, I am extremely delighted with this project and have no complaints.", "q2r": 5, "assessor": "z_assessor_1713", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 9014, "q0": "The proposal’s problem described here touches the critical issues of the challenge, hence there is a good alignment with the challenge.\nAwareness raising is one of the effective weapons of getting people informed about an idea, subject, course etc and if the idea of this proposal is to raise the awareness of the people of Entebbe city about Cardano blockchain, I think this is a proposal worth funding considering how it addresses the seeding and growing of Cardano in Africa (Grow Africa, Grow Cardano Challenge). The proposal when funded, I believe it would reach out to many Entebbe city people.\nGiven all these information, I can say that the proposal effectively addresses the challenge.", "q0r": 5, "q1": "The details of the team and their relevant experience provided, makes me confident that they well equipped to implement the project. The budget well or and comprehensive and I think the amount is sufficient to achieve the desired outcome of the project. However, the proposer has stated that no one will be paid for their time but that they are only seeking for compensation for the project expenses, well it would have been good you provided a measure on how that will be possible from the start to the end of the project so that the budget amount would not be cut for such issues and leaving the project unfinished. The plan presented gives understanding of how the project would be carried. The timeline provided is detailed. It’s good effort that the proposer has factored in the challenges or risks that may arise during the implementation of the project.", "q1r": 4, "q2": "The roadmap presented here is well prepared with milestones and time horizon that make auditing easier.\nWhat success looks like for this project is educating a 1000 people about Cardano and the upcoming Entebbe Smart City Project and I believe the KPIs or metrics are good indicators or measures of achieving the success.\nThere targeted problem is clear with a proposed solution I believe is strong enough to tackle the problem.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10637, "q0": "The stated problem is completely aligned with the Challenge as it aims to educate regular citizens in Entebbe, Uganda, about Cardano and the ongoing Entebbe Smart City project. It is a highly relevant issue as it will help this Smart City project, built on Cardano ecosystem, achieve its success, potentially becoming a model for other cities as well as other countries in Africa.\nI live in Brazil, and my experience living in this developing nation shows that the average person is usually averse or afraid to learn about innovative technology because they think it's not for them. Therefore, the effort to help them understand the benefits such project can bring them, and that it can empower their city, their nation and themselves, is a noble one.\nThis proposal will cause a strong impact on the Cardano Ecosystem, because it is aimed not only to people who are already interested in blockchain, but to every resident of Entebbe.", "q0r": 5, "q1": "The 3 team members combined experience should allow them for a very successful implementation on this idea. Fanna Park's business management experience and his venture on blockchain at Bora Finance certainly gives him a high comprehension on the potentials of this technology. I wish I had more information about Micheal Ochailap and Robert Kabega, but the fact that they teamed up volunteering their time tells me that they are highly motivated towards their goal.\nThey are asking for only 0.5% of the Challenge's budget and clearly outlined how it will be spent. In case they achieve the goal to have 1000 people attend the workshop, it represents roughly $1 cost per educated resident.\nTheir plan is simple and broken down into actionable tasks. The timeline makes sense, it will give them enough time to prepare a good quality workshop.  They understand the risk of not having enough attendees and designed various strategies to spread the word about the workshop. Robert Kabega promoting experience might help achieving this goal.", "q1r": 5, "q2": "The proposal has a roadmap with a four weeks time horizon, filled with some milestones in each week, which makes it easy for the community to track progress.\nTheir goal to have 1000 people attend the workshops is very relevant to the Challenge and can be easily measured. This proposal has a high potential to cause local impact and form local partnerships.", "q2r": 5, "assessor": "z_assessor_951", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Host an awareness campaign through workshops and advertising. Promote Cardano's goals use cases to residents (potential future users).", "experience": "Fanna Park - 15 years of business management experience. Stanford MBA. Founder of Bora Finance.\nMicheal Ochailap -  5 years cryptocurrency industry. Promotor and educator of Cryptocurrency in Uganda.\nRobert Kabega - 20 years of experience promoting artists in London, UK."}