{"id": 399813, "author": "nzola8", "title": "Lokole/Cardano community Networks", "url": "https://cardano.ideascale.com/a/dtd/399813-48088", "category": 26442, "amount": 45000, "description": "The best way to continue and to seed grow Africa is to tap onto the existing proven technologies which enables digital networking connection", "f6_no_assessments": 5, "f6_rating": 4.4, "videos": [], "media": [], "f6_assessments": [{"q0": "The idea is quite  good, the founder also mentioned the challenge of the project and how this project will solve it. Besides, the founder also has a section to guide users to use this software. This is a plus point when introducing your product as well as its features or features so that voters can see the product more clearly. In addition, the risks or challenges are also clearly stated by the founder in part 3 along with solutions. Recognizing risks and coming up with such a way to deal with them shows that the founder is clear about the project's challenges and potential.", "q0r": 5, "q1": "In the 'Feasibility' section, the sections presented are a bit sketchy, not detailed enough. As in the 'a detailed plan/timeline' section, only major tasks are given, but the founder cannot detail the order in which to do it, for example in Q3/2022, 'To' build 100 Lokole box with Cardado information' will be divided and how it will be implemented should also be stated. In addition, the section 'a detailed budget breakdown', only states the value of 1 box and production quantity, but does not state the detailed production cost for 1 box. The plus point for this part of the proposal is that the members' information is given quite clearly.", "q1r": 3, "q2": "The 'Auditability' section is clearly made, providing a lot of information for the voter to be able to follow the project. The founder gives people many options to follow the project, which is a big plus for the transparency of the project after calling for votes. In addition, the proposer clearly defines the target audience to be able to exploit the project's resources well. However, the founder should also give figures or numbers that the publisher expects to achieve after implementing the project, so that the goal of the project will be clearer.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "\"Great\". I have to say so after reading your proposal. Not only in terms of ideas but also in terms of presentation and content, all are very good.\nFirst, let's talk about how you introduced this potential project. You clearly describe the main benefits that users will receive when connecting to Lokole community Networks and how to use this network as well. I appreciate your wording, it is easy to understand and can summarize the main content. The presentation on using the Lokole device is also detailed and complete step by step.\nNext, I see the tremendous motivation behind your team's desire to develop Lokole in Africa. This project is not only meaningful but also very humane. And you also prove that Lokole is fully capable of helping developing countries integrate with the outside world through concrete evidence of Lokole's ease of use and installation. The attributes of the OPWEN system and ASCODERU can help minimize user costs and give them peace of mind about using Lokole in challenging environments like Africa.\nIn the end, with such a detailed and convincing presentation of the project’s technical risks like this, I have nothing to discuss. I still want to commend your team for the seriousness of this project. And I believe investors will be immediately attracted to a well-rounded Impact part like yours.", "q0r": 5, "q1": "Unlike the excellent Impact part above, your Feasibility part still has many shortcomings. Please tell more about the milestones in your plan, because it isn't enough to be called a detailed plan. Specifically, how will you make 100 Lokole boxes with Cardano information, and how you will market and sell them. Moreover, to develop a network in a continent as risky as Africa, I think you will need other extra costs, not just the crafting fee for 100 Lokole boxes, right? But I will still give you 4 points on this part because I was very impressed with the members' introductions. With a professional team and experience in international organizations like this, I understand why you would be interested in African countries. Your heart is too big, right?", "q1r": 4, "q2": "We all know that nothing can win people's trust more than showing them concrete evidence. And this proposal has wholly done that. Usually, I ask for quantitative numbers for the goals set by other projects, but with a high community project like yours, I feel your presentation is enough already. Your team knows what you are doing and what you want because you have so much experience in this field. From how you let people know the way the community will monitor the project's progress to how serious you are about controlling Lokole's impact on people's lives, these all things help me see the extreme seriousness of your team. The future has been seen through concrete evidence. And there will be no reason for this project to slip away from the hands of visionary investors. Once again, I appreciate your project and respect a great team like yours.", "q2r": 5, "assessor": "z_assessor_1666", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The product's purpose and function are plainly explained, along with precise instructions for each step. It is clear that there is no shortage of necessary steps for the project. Obviously, Lokole will undoubtedly assist Africans in using the Internet more simply in the future. In addition, for the risks mentioned in many fields, accompanied by effective solutions, also the proposal has an overview of the current situation, grasps the problems and shortcomings in order to propose solutions appropriate direction. However, there are two points that the plan should address. For starters, it is unclear who the target audience is, what their age or gender is, what their occupation is, and how it impacts consumers. This makes determining if the clients are suitable for the project or whether anything has to be altered difficult. Next, the proposer should explain how the product would impact the Cardano ecosystem or users. For example, it will aid in the promotion of the ecosystem to African customers, therefore expanding the developed market and gaining a greater reputation.", "q0r": 4, "q1": "The project will be completed in the latter two quarters of 2022, but the content is still too cloudy and doesn't illustrate how the proposer will perform it. More details about how they sell goods, advertise them and promote them in order to sell all 100 sets of those products. In terms of the budget, it is typically a safe bet, but it is also vital to clearly identify the components that must be paid for, such as money for packaging, raw materials, or labor. With vast experience and education from numerous major and reputable organizations, the team members have promise in the field of electronics. However, it appears that such a workforce is insufficient. They should hire more advisors or specialists to analyze the product based on an objective point of view before selling, or assemble a team to devise strategies for promoting the product to customers swiftly and effectively.", "q1r": 3, "q2": "Both the development process and the successful prognosis are exceedingly extensive and careful. There are even some non-governmental organizations in the DCR interested in purchasing their items, demonstrating that the product's characteristics are quite effective and will likely be recognized to more people in the future. They also offer proof from prominent organizations' statements that highlight the product's features and advantages. They even give a complete step-by-step approach for managing the product's progress, but adding time to make the process more transparent is my advice", "q2r": 5, "assessor": "z_assessor_1713", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "This is an excellent idea to bring all the people connected under internet with minimal cost. The proposed device wont be using much bandwidth , since bandwidth is very costly in countries of Africa, and the device can even connect up to a range of 30 mts wifi radius , by this technology, with just one good connection whole community people can get connected with internet and block chain data.\nSince most of the data will be added offline there wont much repetition of tasks , even if band width issue is seen , by this people get to know new age technologies that will help their country in moving forward. hence This proposal effectively addresses the challenge", "q0r": 5, "q1": "Since the proposer himself has shared his experience , he definitely knows what are the major barriers people are facing while get connected he was done ground work on this model.\nThe model can be implemented easily, designing with help of Raspberry model wont be much difficult, and setting up website of lokole will not also be major issue , since it is a simple web, where people will get connected to real world ideas, the main issue that might cause are attack from hackers, damage of device  and maintenance of the server, hence no much risk is seen in implementing the project ,many issue can be seen after implementation hence with  given experience and plan presented it is highly likely this proposal will be implemented successfully", "q1r": 5, "q2": "The proposer has excellently presented the idea of providing all the data in offline mode, connecting device with 30 mts distance of wifi, and experience of the team with whom he'll be working with.\nThe proposed idea contains all the pro's and con's  in very detailed manner , but the proposer has failed to explain what are the measures that will be taken during unexpected times (ex: if the device gets damaged due to any reason , will there be any services that will be provided to help the user to fix it or user must again buy a new device ), the proposer has even failed to tell his marketing strategies that will attract user to buy his device .Other than that proposer has shown his clear vision and proper budget breakdown of the proposal. hence the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "It is necessary to sow the seeds for the development of the people of Africa so that they accept technology to connect to the internet using technologies. The author has proven that the digital network is very necessary for the people here and helps them access education in the best way. I find the idea here to be brilliant and well-suited to the challenge. This proposal is in line with the challenge of posing a clear problem related to the criteria of the challenge. It offers a solution to help people connect to the telecommunications network. The solutions and risks in this challenge have mostly been planned by the author so that players can see the potential problems that need to be solved. They also mentioned a lot of possible risk reduction strategies and regarding this challenge I found this to be a good recommendation.", "q0r": 5, "q1": "In the roadmap here I see the author divided into 2 quarters: quarter 3 and quarter 4 must create and sell 100 boxes of Lokale. The progress of this project is easy to track. Very clear KPIs have been included along with the implementation roadmap. The success indicators will be easily measured due to the statistical nature as well as the analytical process. The group has 4 key members who have a lot of experience related to different industries. Especially among them are Nzolantima Swasisa (Nzola) because of his passion for technology since he was a child so he has pursued and learned for the past 19 years, Laura Barluzzi a self-taught developer who has devoted 10 years to supporting organizations NGOs at home and abroad. With the above elite members, I firmly believe that if the project is funded by the fund, the project will be successful.", "q1r": 4, "q2": "To measure the team's growth, the team detailed the plan to reach out to people and indicated the criteria for implementation: one is through the GitHub page, the other is through the statistics of the Lokole web application users. , three is an email survey to see if people are currently using the Lokole application, and four is in regular contact with people who are using Lokele web. Teams provide clear and logical metrics that can accurately measure progress in tackling the challenge. Based on the evidence the author has outlined and has changed for the people here, I agree that this proposal provides me with enough information to gauge progress toward the stated goals. The project that used to be funded at fund 7 is $9,420 and has a total of 4 points and is currently applying for more capital to continue implementing the project.", "q2r": 5, "assessor": "z_assessor_649", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Lokole/Cardano Community Networks solution is a shared system which aim to connect any unconnected individual into modern telecommunications", "experience": " I was born and raised in Africa, lived and worked in many African countries. I have now been living in North America. I am a professional electronics technician. I conducted many radio communications projects in different countries. I now work for the Canadian Defense Dep (Navy)"}