{"id": 399818, "author": "paodolores20", "title": "Bridging the Food Security gap", "url": "https://cardano.ideascale.com/a/dtd/399818-48088", "category": 26442, "amount": 75000, "description": "Africa must become self-sufficient in agriculture. But the financing shortfall re agriculture is staggering at USD 65 billion p.a. [1]", "f6_no_assessments": 12, "f6_rating": 4.027777777777778, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal is very good and smart, addressing exactly what the challenge is looking for. It is a platform that, using Cardano technologies, will connect small farmers and businesspeople with creditors. This is important because many times micro entrepreneurs cannot earn enough profit to keep their business active and they need external financial investment, this is difficult to achieve anywhere in the world, especially in Africa, where the economy is still developing and I believe that the range of investors should not be so vast and accessible to ordinary people. This platform would include several things, the most interesting thing I found here was the process of preparing the person who will benefit (they will invest in it in some way). This person would be educated about entrepreneurship and blockchain, and would also go through a sort of filtering, which would indicate what type of lender would be best suited for them. I found it very useful and necessary on the part of the proponents to include this type of guidance, as they go beyond establishing the bridge between the entrepreneur and his financier. This project would certainly benefit the African continent, as it would help a fundamental part of its economy, agriculture, to develop, boosting small businesses. It would also help the local population (at first, this project would be developed in Kenya - another positive point in the proposal is that we are located in the country that would be the pioneer in this project, otherwise we would get a little lost in the giant dimensions of the continent). This would be done based on the instruction that would be passed, as the proponents speak, the teachings about entrepreneurship and also about what Cardano is, how our blockchain can be a gateway to different opportunities, either through direct funding on Catalyst or through education. (if people are interested in studying some of our applications, which could generate employment and income in the future). Therefore, I think it is a proposal that aligns very well with the objectives of the challenge, mutually benefiting the African continent and the Cardano ecosystem, through its dissemination and possible adoption by new people (perhaps the investors themselves too, other than agricultural professionals). With that, I will give a maximum score for impact, because I believe that with the correct orientation this project can generate great results. \n", "q0r": 5, "q1": "Unfortunately that part of the proposal left a lot to be desired compared to the impact. We know in a very basic way what is necessary to carry out the project, whether through information about the roadmap, team or budget. Starting with the script, there's actually no timeline here. What is revealed are all the activities to be done, and they are only mentioned, not explained individually. As a result, we were unable to solidly visualize the process. The total time interval required for the development of the project is also stated, but it is not possible to understand how long each part would last. To make the script better, it would be necessary for the proponents to change two things. First, detail each of the activities in greater detail. And then, situate them in the total space of time. How long each would last, in a matter of weeks, for example. Most proposals split the roadmap monthly, this is the minimum necessary to have a better understanding of the process. Regarding the budget, your explanation is also quite superficial. 75k USD is requested, quite a high amount. This money is divided into several parts, and even with many divisions, I did not find it possible to justify the amount requested. For example, 3k USD are requested to create content about cryptocurrencies. Who would raise them? What kind of content would it be, in video, text, pictures, a mixture of all these? Why does website creation cost 2k USD? And finally in relation to the team, the same thing happens: lack of detail. The names and positions of those involved are said, but many things need to be improved. At first, it should be established what relationship these people have with the Cardano ecosystem. Would they be experts, would they be active members of our community, how did they discover our blockchain and the type of work they currently do on it? What has been your journey so far at Cardano? Other than that, we would need to know what each one would do in the project, the previous job positions are told but not what roles they would perform in the present. It would be important that we also have some sort of proof of your CV, for example your linkedin profiles. From the way the project's feasibility is presented to us, I couldn't quite understand the process; justify the need for the 75k USD requested in the quotes; feel that the professionals that make up the team are technically prepared to successfully execute the project. \n", "q1r": 2, "q2": "Proponents indicate some ways to audit their project, in addition to some more humanitarian objectives that dialogue with their project (such as the fight against hunger, decent work, economic growth, etc.). I think the information present in the proposal about your audit is good but not enough to track the progress of the project in a total way, because the proposers focus more on results than on the process. As a result, the following metrics would be used: “creating a platform that adds tangible value to its stakeholders” + “creating a considerable and vibrant community of followers who read our posts and debate them”, in addition to the launch of the agribusiness financing platform, amount of blog posts about blockchain and the amount of followers they would acquire over time. I think they think very well about how to analyze the results both quantitatively (although I missed the following statistic - number of financing closed from the platform created); also in a qualitative way, as they seek to interfere with the way the population knows and relates to blockchain, which could generate a change in how Cardano is seen and people could start to get more involved with our ecosystem, whether by simply investing in Ada , or maybe studying our programming languages, participating in Catalyst and etc. I think there are many ways to measure the final impact of the project and proponents exploit them well. But they also need to think of ways to audit the process, that is, ways that would allow the community to monitor the execution of activities, partial results, and so on. I think this could be done, first of all, by establishing a detailed roadmap, a budget that involves dates and deadlines. In the background meetings could be held between team members and some active participants from the Cardano community, it would be even better if they were natives of Kenya itself. Through these meetings, the Cardano community would be aware of the progress of phases. In this way, auditability would cover all the fundamental parts of the project, in addition to the final results. So I'll give it 4 stars because I think the team covers the results very well but forgets about ways to measure progress. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 9, "ne": 7, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "With the aim of increasing knowledge about finance for small agro-entrepreneurs in Africa and remedying the lack of access to finance and quality content for them, we see that the proposal fits the current challenge well. The concepts of this proposal are explained in a clear and cohesive way, and the importance of using Cardano technology in the project is also evident.\n\nOne of the problems to be solved is the bureaucracy and the lapse in scope that traditional means of financing have when it comes to serving small entrepreneurs, and understanding their needs. The proposal in question is innovative, because, among other achievements, it will develop an algorithm that seeks to classify the needs of these entrepreneurs through a questionnaire, to then generate information on how to help them. The success of this initiative brings good visibility to Cardano in Africa and one of the project's goals is also to spread knowledge about cryptocurrencies. With this, a great path can be opened for future uses of Cardano's ecosystem on the continent.", "q0r": 5, "q1": "One of the most interesting points in the feasibility plan is the understanding that this historical problem on the African continent is too complex for a solution to be unequivocally presented. In this context, we realized that the feasibility plan was quite strategic in acting on different fronts that aim to 'shape' the project's operating environment so that, in the future, the problem can be truly remedied.\n\nWe thus perceive an adequate budget distribution, in which capital is being allocated both for the agrifinancing.com platform, for marketing and also for the generation of NFT's that aim to increase engagement in relation to the project. It is interesting to mention here that the use of NFT's may seem a little outside the main scope of the idea. But in the feasibility plan itself, it is mentioned that this is a source of extra income, and will not be a main 'engine' to leverage the project. Materials will also be prepared to intuitively teach the population about concepts that the project aims to use in the future. This also seems like a correct approach, as directly introducing ideas such as smart contracts to solve the difficulty of generating credit for the target audience could hinder more than help the cause at first.\n\nDue to the quality of the materials presented in the proposal, the organization of ideas and also the team involved, the asking value of $75,000 seems reasonable. In the team, there are professionals specialized not only in computing areas, but also people specialized in finance, social media and NFT's. One of the great differentials of the project is that the team behind the proposal belongs to a company, Moving Frontiers, specialized in finance in the field of agriculture. Even one of the professionals involved in the project, Maarten Susan, has a high degree of experience. Through a quick search, it was possible to find your linkedin:\n\nhttps://ke.linkedin.com/in/maartensusan.\n\nWe see that at this stage of the project, one of the main objectives is the construction of the Malengo algorithm, which will help to identify the needs of farmers. And accordingly, the largest portion of capital at this first moment, $34,000, is devoted to its development. It remains to be noted that it would be interesting if the CVs of the professionals involved in the project could be more easily located in the proposal.", "q1r": 5, "q2": "In terms of auditability, three main metrics were established that really address the lines of action indicated in the feasibility stage. The main focus of this first phase of the project was the development of the Malengo algorithm, and there is a forecast of the launch of the platform with the algorithm working.\n\nRegarding marketing, a number of posts were established to be published as well as a number of followers to be reached. These parameters for measuring engagement are very much in line with the project proposal in this first phase of “preparing the ground” for future deeper changes in Africa's agriculture.\n\nAdditionally, it would be interesting to include, as one of the ways to measure the results, the follow-up, at the end of this first phase of the project, of a Cardano member who would help to validate whether the moment for the use of tools such as smart contracts has been reached.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 14, "ne": 4, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "Access to reasonable financing options is a huge problem in Africa, as it affects access to the most basic human needs. Farmers in any part of the world need access to financing to scale and sustain food growing operations. This proposal wants to get right into this gap, and start connecting African farmers with lenders, providing a trust and security layer that helps more lenders work with more people who need those services. They are working with high-impact partners and have the ability to raise awareness about Cardano while building critical financial services infrastructure that Cardano builders will be able to build on as more DApps projects come online.", "q0r": 5, "q1": "There is a small discrepancy in the budget, which totals 76K, and the funding ask, which is 75K. This is a minor miss, and inconsequential overall for this proposal.\nI am favorably impressed by the attached business plan and the bridging the gap flyer. I would absolutely like to see this group get the chance to work toward this important and impactful vision. \nIn terms of judging Feasibility, I would prefer to see a little more evidence about who this team is and what they do. We have a link of 5 names and titles - no linkedin profiles, no website links. It seems like a lot of \"Taking their word for it\". A little more evidence of their work and capability would go a long way.", "q1r": 4, "q2": "Some of the outcomes are clear and measurable: Social Media following of 100k+, 50-75 Blog posts. (I'd personally rather see a committed number, even if it's the lower number, as opposed to a range.)\nOther deliverables are a little more nebulous - the \"Launch of agrifinancing as a platform\"  -- I'm not totally sure what constitutes a successful \"Launch\". Does it include onboarded lenders? How many? Does it include a trial run with a few end users - because that would be great! \nBlog posts and social media are great, but this big investment here is in the Agrifinancing platform, so I'd like to see a little more focus on results and auditability there.", "q2r": 3, "assessor": "z_assessor_1180", "no_vca": 9, "ne": 2, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Impact Assessment:\n\nI believe the proposal addresses the challenge, nevertheless I would entreat the team to affiliate with the \"Landano Land Registry System\" to better assure themselves of their various farmers not complaining of land registry and litigation issues when funded. The Landano Land Registry DApp is a catalyst fund 7 project. Even though the proposal is set to solve a problem, I clearly see, given the proposal the extent to which the team is set to add value to the Cardano ecosystem in the short-run as they are set to prepare the grounds for future crypto based finance solutions. However, I will suggest a detailedbreakdown of activities in the short-run is spelt out. The proposal recognizes some risks which are very paramount to the success of the proposal when funded. \n", "q0r": 4, "q1": "Feasibility Assessment:\n\nThe proposal fails to register resourceful references and links of team members to aid verifiability and assurance. Aside no links given names and positions of some members have provided but I am unable to satisfy myself as to the responsiveness of the people behind the project as this proposal is not just any proposal but will demand economical support. For projects of this nature to be funded, I recommend the team goes back and put a new budget to include forecast analysis and recovery plans.", "q1r": 2, "q2": "Auditability Assessment:\n\nThe draft workplan by the team in the excel attachment appears to be incomplete. I do not confirm that this proposal is easily auditable.", "q2r": 2, "assessor": "z_assessor_1458", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "This proposal will solve the challenge that the team is aiming for. Ideas are presented in a clear and concise manner. Proposer provided detailed information related to the project, provided a background for people to see the problem better, then suggested the solution and explained how it works with the Cardano exchange, here a huge plus. In addition, the founder has an overview of the risks that the project may face and offers practical solutions.", "q0r": 5, "q1": "the 'feasibility' part is written in a rather sketchy way. First, for the 'a detailed timeline/plan' section, the founder only provided an outline, ie the tasks to be completed, but did not give a specific time for those tasks. Next, in the 'a detailed budget breakdown' section, the team just came up with the total budget without showing everyone what the money will be used for in detail. The whole team should adjust and make more details about the work plan or spending plan. In addition, for the member of the team, the proposer should provide more information about the members such as education level, work experience instead of just such positions.", "q1r": 3, "q2": "The 'Auditability' section is clearly made, providing a lot of information for the voter to be able to follow the project. The team give the standard to measure the success quite good, it shows the goal and direction of the project. However, in my opinion, the team can add more KPIs section so that everyone has a clearer view based on the data.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The idea of creating an algorithm to connect lenders and entrepreneurs is very bold but is has the potential of having a big impact when it comes to food security. \nHowever, the challenges mentioned are very relevant and could impact the feasibility of the project, specially when it comes the internet coverage and smartphone usage as mentioned by the proposal. These are not issues that are easy to solve, but at least the proposal seems to recognize it.\nI do think it has the potential of having a big impact, especially because it focuses on a long-term solution.", "q0r": 4, "q1": "The work plan is very detailed and reasonable. The budget could be more detailed, specially when it comes to marketing, which can include many different things. Because of the lack of deatil, it is difficult to assess if the budget makes the project feasible. \nWhile the team seems capable and with a relevant background, the could be some links to check their credentials and more detail on their previous work.", "q1r": 3, "q2": "I like how the KPIs have defined targets that can be measured by the end of the project. However, they don't necessarily relate to the ultimate goal, which is to reduce food insecurity in Africa. I see them as the means to an end, and while I undertand that reducing food insecurity is not an easy task, I would like some KPI that specifically approaches this challenge. I think the proposal could also benefit from some \"checkpoints\", allowing the project to be assessed while it is happening.", "q2r": 2, "assessor": "z_assessor_1659", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "An Impact part that is easily understood and provides sufficient information always attracts the attention of investors right from the moment they start reading the proposal. And I think you've done it well.\nStarting with a brief introduction to Agrifinancing.com, you've already targeted the primary audience for your project and even found a pioneer country. I appreciate how you lead your readers from the hugely fragmented landscape of financiers to how you can help them learn more about finance and agribusiness through your website. And I commend you for this because anything starts with a fixed reason, and you coherently string all of those things together.\nContinuing with the presentation of the link between this project and Cardano, as I said above, you fully understand how to attract readers to your proposal, when you have first presented the current shortcomings in Africa for the growth of the Cardano ecosystem, and then address issues that can be fixed now through agrifinancing.com. This intelligent arrangement has helped your proposal not have to go the old way and still clearly present the fit between the project and the KPIs that the challenge has proposed.\nConcluding with the main risks and challenges, the proposal does a great job of highlighting potential risks and also a very sensible way to deal with them. All of them show the seriousness of your team and the results after two years of incubation. Thank you for letting me read a piece of Impact part with such excellent expression.", "q0r": 5, "q1": "Compared to the Impact part presented very well above, this part is a bit too brief. And I feel that many proposers often focus only on developing the introduction but forget this important Feasibility part. As we can see, the proposer sets out a roadmap with fairly specific items of work to be done and the expected timeframe, but that is still not enough. Because a good proposal needs to clearly define the positions and the number of people required to carry out the project, as well as show how the team will complete the work items, within what detailed timeline and what support will be needed. Moreover, the introduction of the team members still does not fully describe their qualifications and experience. Just the title name is not enough for investors to see your team’s talent. However, the proposed budget is presented quite well and detailed, with the list divided into different segments and spending categories.", "q1r": 4, "q2": "With a carefully invested project like this, it's understandable that your team can deliver a clear future development track. The quantitative numbers and 12-month timeline in this section should reassure investors of a prosperous future for Agrifinancing.com. In particular, I appreciate that the proposal still remembers to affirm the noble mission that the challenge has set, which is to develop Cardano in Africa.", "q2r": 5, "assessor": "z_assessor_1666", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "According to the proposal team, Africa is facing the problem of lack of finance for agriculture. The idea that was proposed to solve this problem was to create a platform that connects agribusinesses with lenders by directing these agribusinesses to financiers that fit their business. I strongly support the idea of the group and see that the project has great potential for development.\nThe proposal clearly states that the target audience of the project is armers and Agri-SMEs across pilot agridultural value chains in Kenya. The proposal team clearly presented the features that the project will bring as well as described the impact on potential audiences. For more detail, it would be great if the proposers included a more in-depth explanation of the technical aspects or used case studies as examples of the project's functionalities.\nThe proposal stated that the development orientation of the project is based on\n1. Sensitization\n2. NFT to raise additional funds\nThe content referring to the results that the project will produce is very specific and completely consistent with the Key metrics of the challenge. These promising results are detailed and easy to visualize when viewing the proposal. Based on that, it can be seen the positive impact of the project on the Cardano ecosystem and the development situation of Africa.\nThe team has calculated the challenging aspects during the project implementation and extracted 4 risks that the project is likely to face. But at the same time, the team also proposed solutions to solve the predefined difficulties. You can trust that the team will be able to solve problems well.", "q0r": 5, "q1": "The roadmap  proposed by the proposal team is still not as specific as expected. It is necessary to clearly state each milestone in the project. Each milestone sets a realistic timeline for completing the work items. A reasonable plan should set out the requirements for each item when it is completed.\nThe budget plan is properly allocated for the investment items of the project. The total cost is also very consistent with the proposed plan. The budget is presented in a broken down and bulleted way that is clear and easy to follow up. Readers can immediately grasp the source of capital and investment costs. However, I have a question that the budget plan has not mentioned the positions and the number of people needed to implement the proposed project and the budget should be added to the expenditure to pay staff salaries.\nThe project management and operation team seems to have a pretty good background and is suitable for the field the project is aimed at. However, in order to increase the persuasiveness of the proposal, the proposers should tell more about the knowledge and experience of the managers in order to build trust among investors.", "q1r": 4, "q2": "The project has highlighted quantitative indicators in great detail. So the community can easily monitor and check during the project implementation.\nProposal team defines success as completing a project with benefits as planned as well as contributing to the development of the Cardano ecosystem community. This proves that the team is seriously implementing the set goals and promises to increase its influence on the Cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_1709", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposer has mentioned the targeted audience of the project. They have also provided information about what is the AGRIFINANCING.COM which is a product that the team will need to create. According to them, it is a platform created to guide agri-entrepreneurs to relevant lenders, while educating them on emerging Cardano solutions. In the part of describing how their proposed solution will address the challenge, the writer has explained the link to Cardano. The proposer has talked about how they would do to help building the brand and I saw that there were local partnershíp formed which is one of the challenge's key metrics. However, if they could include more numbers to show more specific key metrics, it would be better. The team have also thought about risks in the future such as lenders do not want to sign up, the target audience, the NFT platform will not generate additional funds and longer term sustainability. Beside giving readers their point of view about the risks or the general situation in the future, they have also mentioned how they would solve the problem, which is a plus in this part. ", "q0r": 4, "q1": "The proposal has included plan and timeline and budget breakdown of the team's project. The writer has showed us some activities that will be done in their project, they are Agrifinancing, Malengo, AfricanFarmerZ, Legal, Marketing, Content, FSP Mobilization, the time for the project was also mentioned in the proposal. However, for me personally, it would be a bit better if they could include just short basic sentence about main information of each activity, so that readers can have a clearer view about what they are going to do. About the team members, the proposal has showed needed information.", "q1r": 5, "q2": "The team has said that their project's progress would be measured through 3 key performance indicators in which they have mentioned some specific numbers as targets. This shows that they have set the goals clearly. They have also explained what the success looks like to them. They have clarified that the ultimate success would be to scale the concept of Agrifinancing to other African countries. It would be great if they could declare clearly for me that this is an entirely new project or it belongs to a funded one before.", "q2r": 4, "assessor": "z_assessor_1714", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The scope of the proposal is to build a website with a “matchmaking” engine between Kenyan farmers in need of financing and lenders, ranging from a wide selection from banks, to funds, crowds etc. The website will not only help farmers get in touch with lenders, but at the same time it will educate them on the topic of blockchain, and most importantly, Cardano.\nI find the proposal very well written and with the main goal in mind, the impact it could have on the Cardano ecosystem and the Kenyan communities at large could be substantial.", "q0r": 5, "q1": "The plan is well detailed, the budget is also well broken-down on each topic and seems sensible in terms of numbers. The team has provided a brief description of their skills, sadly no links available, but from the description they seem to be highly qualified for the implementation of this proposal. ", "q1r": 5, "q2": "The facts presented in the progress measurement section are comprehensive and easy to follow. The numbers are reasonable and achievable in the timeframe presented. The success of the project in the team’s terms is also well presented, is layered into several objectives, each greater than the other, and all with a good possibility for a favourable outcome.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposer identifies the problem of the financing gap for agriculture in Africa and presents as a solution the creation of \"agrifinancing.com\" to guide agro-entrepreneurs while educating them on Cardano's existing solutions. This project has the potential to increase knowledge about Cardano in Africa and is therefore in line with the challenge. The proposer declares that this is a project that will be financially sustainable in the future. ", "q0r": 5, "q1": "The proposer considered the relevant risks for the successful implementation of the proposal and presented a way to manage these risks. The proposal presented a plan with what will be done, but I think this plan could be better detailed and with each stage better divided. The budget has been detailed and seems reasonable. The proposer identified the team members but did not present any evidence of their experiences. ", "q1r": 3, "q2": "The proposer clearly presented the target problem and its solution. The proposal does not contain a roadmap with milestones. The proposal presents a deadline for achieving its goals. The proposal presents metrics for monitoring the success of the project.", "q2r": 3, "assessor": "z_assessor_429", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The problem statement here has inadequate information in addressing the challenge because the proposal seems to be leaning on one side of two simultaneous activities, agrifinancing more than Cardano itself. The information under description of the proposed solution still leans more on farmers and Agri-SMEs financing, so I find it difficult to ascertain the clear value on Cardano. However, there is an indication at the “summarize your solution to the problem” that agri-entrepreneurs will be educated about emerging Cardano solutions , however I find that side of the proposal not spoken much of. Assessing the impact is difficult considering this uncertainty.\nHowever, I believe the idea is a good one that can be funded when clarity is provided next time.", "q0r": 3, "q1": "The information about the team and their relevant experience described gives me the confidence that the team is well equipped to implement the project. The budget provided is well explained with clear sub items. Talking about the agrifinancing aspect of the proposal, I believe the budget is reasonable to achieve the set goals. The plan provided here is detailed together with a clear and definite timeline. The proposer has, foreseen some critical challenges and risks that may arise during the project implementation, and for me it’s an excellent effort.", "q1r": 4, "q2": "The roadmap is very detailed with clear milestones/deliverables and time horizon. I can see that scaling the concept of agrifinancing is a desired outcome of what success looks like for the project.\nThe metrics/KPIs chosen are good because they are good indicators for evaluating the success of the proposal.\nThe proposed solution (agrifinancing) here is a good weapon for tackling the food in security issues", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Create the “agrifinancing.com” platform to guide agri-entrepreneurs to relevant lenders, while educating them on emerging Cardano solutions.", "experience": "The team behind the Ideascale proposal is Moving Frontiers (Kenya) Ltd, a leading advisory firm that specializes in agricultural finance.  Originally coming from the Netherlands, Maarten Susan (MD) has over 25 yrs experience as Bank CEO, entrepreneur, investor and SME consultant."}