{"id": 400070, "author": "alexp7", "title": "Mentoring Africa to Success", "url": "https://cardano.ideascale.com/a/dtd/400070-48088", "category": 26442, "amount": 9860, "description": "There are many proposers in Africa that encounter difficulties to navigate the Catalyst process and to submit quality proposals.", "f6_no_assessments": 11, "f6_rating": 4.636363636363636, "videos": [], "media": [], "f6_assessments": [{"id": 792, "q0": "There are a lot of good ideas from members of the Cardano community, but not everyone can do it. On the other hand, the lack of experience in presenting projects to increase the chances of community approval is quite a problem for newbies. This will prevent them from coming to the Cardano community. Mentoring Africa to Success is a great proposition that can solve these problems. Newbies can be guided and mentored by people with prior skills and experience. This will give newbies more confidence and courage to start taking steps in the Cardano ecosystem. This will help the Cardano community attract more talents to join the network.", "q0r": 5, "q1": "Alex, Phil, Yoram all have a lot of experience and have also had success with suggestions in previous Fun. I believe that with this proposal, you will also do a great job. I greatly appreciate giving you complete and detailed information about your work experience and skills. I believe the community will also agree with you. You have also foreseen the possible risks of this proposal and offered solutions. I greatly appreciate this.", "q1r": 5, "q2": "You have been very detailed and transparent about the use of the $9,860. I think the community will appreciate this as well. In addition, the route you have given to implement this proposal is also very reasonable. I believe that you can completely achieve what you have given. The KPIs you give to the community are also very easy to measure with specific numbers. This is very necessary for the community to appreciate you more.", "q2r": 5, "assessor": "z_assessor_1213", "no_vca": 12, "ne": 1, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 910, "q0": "Très bon projet, j'ai mis un 5 pour son financement. Ce projet répond très bien au défi car l'Afrique et les africains ont toujours eu le problème d'avoir l'information, de trouver l'information, de se former. Cette plate forme va facilité en quelque sorte l'accès à l'information et surtout un encadrement  qui permet de réaliser des projets.", "q0r": 5, "q1": "Ce projet a déja débuté et donc doit se poursuivre et évoluer. la proposition est claire, la feuille de route aussi. L'impact prévisionnel est grand. je donne une notation de 5 pour que ce projet soit financer. ", "q1r": 5, "q2": "Les informations necessaires, objectifs long terme, court terme et impact sont donnés et sont mesurable dans le temps. L'équipe qui la compose est très compétente et ont une expérience dans ce domaine. je donne un 5 pour la réalisation de ce projet très intéressant.", "q2r": 5, "assessor": "z_assessor_1235", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1, "reply": "Thanks so much for your score and for your comments and advise. Loved to receive them in French!! thanks"}, {"id": 2190, "q0": "Impact Assessment: Rating of 4\n\n\nWith reference to the performance demonstrated by the project when funded in Fund 6, and its phase two , Fund 7, there is no doubt about its continual performance in helping proposers to put up solid proposals from the African sub region. The proposals identifies a problem within the challenge which need to be solved which is to see to the new birth of African projects seeded in 2022.\nThe proposal seeks to make the Cardano ecosystem more attractive, interesting and onboarding African Mentors and Proposers to produce rapid adoption and value in fulfillment of their vision to reach 1 Billion people using Cardano blockchain. The proposed solution seeks to develop a structured way to multiply capabilities and value added projects that are more likely to be funded pending the actions of voters. The KPIs and metrics demonstrate a great positive potential effect on the Cardano ecosystem.", "q0r": 4, "q1": "Feasibility Assessment: \n\n\"To start with, PMM was first funded in F6 and with several milestone completed through to fund 7, it indicates a trusted, reliable and productive team.\" The experience provided by each member is detailed and work already undertaken indicates a plus. Resourceful links have been provided foe evidence sake and the proposer knows the type and number of team members needed for implementation. A budget of USD9860 is proposed but i think the budget should be re-looked at to incorporate the Russia-Ukraine war crises.", "q1r": 4, "q2": "Auditability Assessment: \n\nThe team has established direct KPI that would help in monitoring the project success. The information given by the team on the internal KPIs to me, will be of great use by the audit team.  There are deliverables that make auditing the proposal easy.\n", "q2r": 4, "assessor": "z_assessor_1458", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2431, "q0": "Grow Africa, Grow Cardano' challenge is looking at increasing Cardano awareness and knowledge in Africa. This proposal suggests that many African proposers have difficulty navigating the Catalyst process and submitting high-quality ideas. As a result, the proposal aims to reach out to African Catalyst trained Mentors in order to onboard them into PMM's platform in order to assist African proposers in delivering strong proposals. This proposal is intended to promote, recruit, and onboard African Mentors and Proposers in order to achieve rapid adoption and value where it is most needed, as well as to position Africa as a strategic region in the world where Cardano can have a greater impact and help us achieve our goal of making Cardano the blockchain of choice in Africa by 2023. So, onboarding African Mentors, who will assist African proposers via the PMM platform, will result in an organized method of multiplying capabilities and value-added initiatives. This proposal attempts to use mentors who are familiar with Catalyst and Africa, and who are willing to assist African proposers in developing stronger ideas that have more effect, value, and growth, and are more likely to be supported by voters. Hence, the proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer is one who has shown over the period his knowledge in the Cardano block chain and can carry out the plan. He also knows the kind and number of team members needed to carry out the plan gives a budget that is broken down into pieces, and acceptable in order to meet the established objectives. The proposal also includes an achievable timeframe for completing the work, as well as a clear and actionable implementation strategy that demonstrates what is being done and how it is being done. The proposer has taken into account the challenges that may arise during implementation and provides possible solutions to these challenges. Hence, problem solution listed has a high chance being implemented successfully.", "q1r": 5, "q2": "The proposal offers enough information to audit and evaluate the project's progress toward its stated goals, since it elaborates the implementation techniques and success measurement criteria, thanks to the well-developed material from the effect and feasibility categories.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"id": 2920, "q0": "Well, I  must say, going through the proposer's brief of tackling the challenge, I have been well educated on how this gap has hindered some proposers from Africa.  \n\nThankfully PMM has come up with a proposal which I think effectively addresses the problem. \n\nI give the proposal a rating of 5 because of the depth of information and knowledge the proposer has with respect to the challenge. ", "q0r": 5, "q1": "It is highly likely that this proposal will be implemented successfully due to the extensive work that the proposer has done over the years in a bid to address the challenge. \n\nThis proposal is a build up to a previously funded proposal in Fund 6 and 7. \n\nThe proposer is clearly following a road map as as such determined to achieve succes. \n\nI therefore give it a rating of 5", "q1r": 5, "q2": "The proposer has given a detailed breakdown of how the proposal will be executed. \n\nThis includes some foreseeable challenges and how they will be tackled. The proposer has clearly shown how success looks like for this proposal. \n\nI give it a 4 star rating in this regard. ", "q2r": 4, "assessor": "z_assessor_1590", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 3505, "q0": "The impact of this proposal has been articulated very clearly. As a continuation of a larger project in progress, this proposal lays out the logical next steps in building towards the ultimate goals of the original idea and the vision that Cardano has for tapping the potential of Africa. The key metrics described are reasonable and achievable and clearly demonstrate the value to the Cardano ecosystem.", "q0r": 5, "q1": "I agree that this proposal is feasible as the timeline and budget are realistic while also taking advantage of the value of knowing when to move fast. This is exemplified by the use of a 10-day sprint methodology to recognize and solve potential issues quickly in the early stages of production. The concern that I see that is not addressed is how to mitigate the potential of language barriers. Africa is very large and has many different languages. What areas of Africa will the project focus on? Will the mentors be linguistically diverse enough to handle the possible language issues that can arise? The concept of the project is solid yet I would suggest that the proposer articulate more details of how they intend to manage cross-cultural issues of articulating ideas across multiple languages and diverse cultures.\n", "q1r": 4, "q2": "The KPIs are clearly laid out in this proposal, though it may be beneficial for the team to simplify the metrics within the timeframe to accommodate for potential cross-cultural adjustment. I have worked on projects in diverse cultures before and it cannot be underestimated that there must be time allotted for cross-cultural adjustment as it pertains to time and information management systems. This requires time to observe and make the needed adjustments to create a holistic system that can produce the outcomes originally intended.\n", "q2r": 4, "assessor": "z_assessor_1658", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 7674, "q0": "This is as the proposer mention is part of their Fund 6 and 7 Proposals Mentor Marketplace. What it seeks to achieve is to onboard qualified mentors onto the PMM platform. These qualified mentors will then assist proposers from Africa to submit a high quality proposal. I mention this in another assessment, the passion of people from Africa to submit a proposal is there. What they only need is people to help them with creating a structured proposal that coincides with the Project Catalyst standards, which is ever changing. Hence, the need of continually available mentors. I can not stress further the need of mentors in Project Catalyst, paid mentors too. Mentors are gatekeepers of 2 (two) things; upholding quality and negating scamming tendencies. Workshops can only do so much, the key to quality is mentorship. Personally I have done mentorship sessions and first hand I can guarantee it helps.", "q0r": 5, "q1": "The people behind this proposal are seasoned Catalyst funded proposers. Who understands the ins and outs of the processes involved in Project Catalyst therefore most likely understand the pain points of submitting a proposal. These pain points most likely are used by the proposer together with their developer skills to develop this PMM even further. All of their experiences and solutions interconnect. This includes their detailed action plan. The only thing that confuses me is where is the MVP? From their Fund 6 and Fund 7 proposal, they mentioned there will be a running MVP in both proposals but (correct me if I am wrong), I can not seem to find any links to it. Perhaps the MVP should be ironed out first?", "q1r": 3, "q2": "As the proposes suggested, they will be using a mix of GitHub and YouTube to track their progress. This is due to the majority of their deliverables are mentorship workshops. A critique to the team, for some reason I can not access their GitHub. Perhaps in the future to make sure all links are correct. Looking forward to how to trying out their MVP.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9016, "q0": "The description of the problem here appears to have alignment with the challenge.\nProposers are a very important role in Project Catalyst, as they bring on table ideas that have the potential of driving positive change in Cardano/catalyst. Having a mentorship in Africa for proposers will help give birth to solid/good proposals (actually a goal of this proposal) and this will not just be a win for Africa but Cardano ecosystem as a whole. It’s impact in the future is that, it would increase the number of proposers in catalyst and help give birth to good proposals, that’s so impressive.", "q0r": 5, "q1": "The team’s information and their relevant experience described gives me the confidence that they are well equipped to implement the project. \nThe budget is well presented and broken down into identifiable items easily understood. With the clarity in the budget in connection with the nature of the proposal, I believe the amount is reasonable to achieve the set goals. The plan presented here is quite detailed with a clear and definite timeline.\nI can also see the challenges and risks that may arise during the implementation of the proposal.", "q1r": 4, "q2": "There is a detailed roadmap, with comprehensive milestones/deliverables and time horizon. Introducing PMM is a good indicator of the desired outcome. I believe the KPIs/metrics were well chosen as they tell the number of mentors to be onboarded over the period, they are good for evaluating the success of the proposal. There is clarity in the targeted problem described and the solution, and I believe is this proposed solution is adopted or employed, it addresses the problem.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 9082, "q0": "The proposal is meeting the challenge demands. The problem identified and the solution provided are both real time issues in submitting successful proposal for funding. Many Africans have great ideas and proposals that could revolutionize the Africa's blockchain adoption and providing proposal mentorship and guide will make the cardano ecosystem to receive high impact proposals", "q0r": 5, "q1": "The team have been funded before and that give them the advantage to equally ensure the deliverables are achieved. The budget is within the range of funding and well detailed to show how that can be applied for success. \n\nThe timelines are clear to take off and very much planned for results. ", "q1r": 5, "q2": "The proposers are much concerned with the evaluation process and have provided interesting and achievable metrics to ease the evaluation process. The auditability projections are well structured, making it easy for everyone to monitor progress and growth.  \n\nThe proposer should also consider a sustainability plan to keep this mentorship program alive ", "q2r": 5, "assessor": "z_assessor_719", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 10177, "q0": "This is the next step of the Proposals Mentor Marketplace project funded in Fund 6. In fund 8, the project wants to be funded to expand to attract proponents in Africa. From there, it will contribute to an increase in the number of new African projects, the number of African developers participating in 2022... The project has an indirect impact on the connection of proponents, developers Africa into Catalyst. The project has an impact, affecting the proposer community in Africa, consistent with the goal of the Challenge.", "q0r": 4, "q1": "Regarding the plan, the proposed team seems to have experience in planning. The team has given a 1-week preparation period for planning, setting up the team and tools, and a 2-month implementation period. In 2 months, the roadmap is divided into 3 phases, clearly stating the work to be done. The proposal delivers on its intended goal of referring 15 mentors and 40 proponents by the end of 3 months from inception. The goal is not too high, showing that the proposed group is quite cautious in setting goals.\nRegarding the budget, there is a detailed list of costs for each specific job content. The budget accounts for about 4% of the total budget of this Challenge.\nRegarding the project development team, members have a lot of experience in both engineering and project consulting. There are experienced CA members who propose the project. There are 3 members working together to build Cardano AIM's community support tool. The experience and skills, the positive spirit of the members are the keys to deciding the feasibility of the project.", "q1r": 5, "q2": "The community and Catalyst can check the progress of the project through the KPIs specified in the proposal. The proposed group provides specific target indicators to measure the actual activities and results of the project. Everything is clear and easy to follow. Progress reports will also be sent monthly to Catalyst by the team.", "q2r": 5, "assessor": "z_assessor_823", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 10480, "q0": "I am so happy about mentorship because this is one of the successful ways to achieve mass education of Cardano. This project is therefore a very timely one. Thus, the project, \"Mentoring Africa to Success\". is a very great one and the proposers seem to have the right solutions to address the problems they stated. \n\nI love the quotation the proposers stated in their proposal to back their submission.  Greg Bell; (originator of the Grow Cardano series) said, \"Focussing on Africa is a key strategy that has often been promoted and is openly pursued by IOG and Charles Hoskinson. The ROI is likely to be high because community sponsored projects are better run in young and developing economies.\" \nIt is clear this proposal effectively addresses the challenge and when given the right support will never disappoint.", "q0r": 5, "q1": "The proposers have made a great work in their proposal with a clear vision in mind.\n\nThey have outlined a very clear milestones and deliverables. The experiences of the proposers are also convincing. They have diverse experiences that when it comes to the table will be able to help execute the project. The budget allocations were also specific and achievable.\n", "q1r": 4, "q2": "There is sufficient information provided to help audit the progress and success of the proposal. They have helped provide more information under the Key Performance Index . It is well laid out. The team has also collaborated with other organisations in the past and hence has the credibility and sustainability ability. They will be able to account for this project when given the support.", "q2r": 5, "assessor": "z_assessor_925", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Reach out to African Catalyst skilled Mentors, to onboard them into PMM's platform to help African proposers to deliver solid proposals.", "experience": "Alex, Yoram & Phil are active community members, CAs, vCAs, Plutus Pioneer, Atala Prism Pioneer & successful proposers, participating in several initiatives and communities to make Catalyst better for all."}