{"id": 400354, "author": "gilvania", "title": "Cardano to Portuguese-speak Africa", "url": "https://cardano.ideascale.com/a/dtd/400354-48088", "category": 26442, "amount": 9000, "description": "Portuguese is a popular language in Africa, even so there is a lack of educational content on Blockchain and Cardano in Portuguese.", "f6_no_assessments": 12, "f6_rating": 4.194444444444445, "videos": [], "media": [], "f6_assessments": [{"q0": "The 'Grow Africa, Grow Cardano' challenge basically aims at increasing Cardano awareness and knowledge across the African continent. Indigenes of Africa speak more languages that English which is poplar in the cardano community. However, many materials are only available in English, which inherently eliminates non-English speaking population. To raise awareness and make Cardano the blockchain of choice in Africa by 2023, education and resources must be available in most of Africa's major languages, including Portuguese. This project aims to work with a catalyst school to translate and educate people about Cardano and other catalyst materials in Portuguese. The proposal intends to make the Cardano community more accessible to students and tech enthusiasts in Cape Verde, Equatorial Guinea, Guinea-Bissau, Sao Tome & Principe, Angola, and Mozambique by giving a free online course on Blockchain and Cardano in Portuguese. Hence, this proposal effectively addresses the challenge", "q0r": 5, "q1": "The proposer provides evidence of relevant skills and experience needed to implement the proposal. The proposer has indicated the team required to implement the proposal and has outlined a budget that is quite reasonable to achieve the set goals. However, the budget could be broken down further. The proposal offers a realistic timetable to complete the work considers challenges and risks relevant to a successful implementation although it states that that is minimal. However, this proposal is highly likely to be implemented.", "q1r": 5, "q2": "The proposal provides sufficient information to audit and evaluate the project's progress toward its stated goals, given on the well-developed material from the impact and feasibility categories, as well as the metrics and KPIs the proposers will use to measure the project's success. This proposal can be audited successfully.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 14, "ne": 1, "ng": 9, "nfo": 4, "vca_o": 1}, {"q0": "The submitter wants to provide educational content in Portuguese about blockchain and Cardano. The advantage is that the poor population can also participate because it is free. This project appeals to a target group of 232 million Portuguese-speaking people. This project can therefore add value to Cardano. The goal is to put 10 hours of content about Cardano and blockchain technology on an online platform (Translated into Portuguese). The online courses can make students want to continue working with Cardano. No risks are included in the proposal. This project offers a collective engagement with Cardano and blockchain. The future of this project is to involve the Portuguese speaking people from Africa in future activities in the blockchain.", "q0r": 5, "q1": "Gilvania Vilela is a senior lecturer at a Brazilian engineering college. She has experience drafting STEM courses. The submitter is in contact with other professors to collaborate on this project. The names are not disclosed in the proposal. The advantage is also that this project has already been approved in Fund7, but with Brazilian students as the target group. There is a plan of 3 months to complete everything. It's good that the course content is already displayed. I would still add the NFTs section to the syllabus. Each month there are clear objectives that must be achieved with corresponding budgets. The plan offers a realistic time schedule in which the activities that must be completed per month are stated. It is good that at the end of the project a report is drawn up on the proposed project with analysis of the results to open clear future perspectives. The submitter assumes that there are few risks to successful implementation of the project.", "q1r": 4, "q2": "A roadmap has been included in which clear KPIs have been drawn up per month for the interim evaluation of the project. The development of the project is also measured by well-chosen KPIs (number of students, website activity, number of visualisations, video lessons,..). By including these KPIs, it can be determined whether this project is successful. The project will be successful if it can offer 10 hours of video lessons in Portuguese about Cardano and blockchain. There will be a report at the end of the project that will reflect the impact of the video lessons. This allows them to see if there is more involvement with the Cardano community. This proposal certainly offers a solution to the language problem for the Portuguese-speaking population in Africa. By offering the video lessons in their own language, the step to get to know the cardno network will be much smaller.", "q2r": 5, "assessor": "z_assessor_1606", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Proposer made it clear that the inclusion of Portuguese materials would help solve the problem of Cardano access in Africa. The founder also showed everyone the direction of the project, how the project solves its problems and characteristics or knowledge that the project wants to share with Portuguese speaking Africans. Dental. Recognizing the risk/challange that the project will face has also been mentioned in the proposal and the founder has also solved this problem.", "q0r": 5, "q1": "Combining the information provided in the 'a detailed plan and timeline' section, we can see the roadmap provided is quite good, has a deadline and specific tasks to do. However, for the 'a detailed budget breakdown' section, instead of just listing the activities that need to be spent and then giving the subtotal amount, the proposer can include an additional fee for each of those activities, or a way to calculate the remuneration for each of those activities. each activity. Thus, the expenditure report will be more specific. Information about project members is also provided in full, easy for everyone to track and check.", "q1r": 5, "q2": "The team had pretty clear goals for what the team wanted to achieve through this project. Besides, the proposer has shown the criteria that the team uses to measure the development of this project, however, it has not provided information related to the tools used to measure those indicators. This necessary information should be added to help voters better understand the project.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "It has the potential of having an important impact in said countries, but I would like more details in the proposals to undertands the maturity of the project. For example, is it considering that each country can have its own \"version\" of Portuguese? As a Brazilian, I know Brazilians do not usually access content from Portugal, so maybe these differences exists among Portuguese-speaking African countries too. Is there a study to understand exatcly how many Portuguese speaking people there are in Africa? Is it taking into account that each country has its own dialects, and that not everyone is fluent in the country's official language?\nI am genuinely interested in understanding if those question were answered while writing this proposal.\nMoreover, I think that, for a bigger impact, marketing should have a bigger focus on the project.", "q0r": 3, "q1": "I like how the course content is ready and it seems very complete. \nI don't think 1 month before the classes start is enough, mostly because there needs to be time to promote the course, engage students. Blockchain is not an easy subject, so it might take some time to make people interested in the subject and engage them to enroll in the courses. The budget could be more detailed, with the specific planned expenses of each activity.\nThe team member seems very capable and has a strong background, but the project could benefit from more team members from the countries that it intends to reach.\nThe fact that this project is an adaptation of a previous project executed in Brazil improves its chance to succeed.", "q1r": 3, "q2": "I think there could be more detail in how the feedback would be collected and what the ideal result is. There should also be an estimate of how many students they plan on reaching.", "q2r": 3, "assessor": "z_assessor_1659", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "Cardano should not be limited to one language, by translating Cardano into different regional languages would help it gain more popularity and more reach to the users. The proposer has identified the problem effectively and has addressed the solution to it. In order to effectively market or spread the knowledge on Cardano to all the people of the country, translation of the content of Cardona to local language is required and is the most effective way to reach a larger group of people. In this case, the local language would be Portuguese, which is very huge community and they are very proud of the language. Hence translating the contents of Cardano in Portuguese would reach a lot more people than expected and also be appreciated for translating into Portuguese. Most of the people are educated in their local language and might face difficulties in English, by translating the content to Portuguese it would benefit a lot of people in getting familiar with Cardano and also the advancements of it. The proposer has effectively addressed the challenge and I strongly believe this application will be a success to Cardano as it will be reach more people and more people will be knowledgeable through this with the comfort of learning in their own language. By doing this it would add a lot of value to the cardona system as it will reach worldwide. The goals of the project are aligned with the challenge. It is also a scalable project and could go global benefiting Cardona on a large scale.", "q0r": 5, "q1": "The proposer has a roadmap on how to implement the project as they have mentioned contents of the lecture and the timeline to deliver the lectures in Portuguese language and hence by providing lectures of the Cardona content in the Portuguese language on a regular interval of time would attract more learners and more people will come to know about Cardona increasing its reach and popularity. The proposer has also provided links and their team has the relevant skills and experience to implement the proposal. It would also be helping a lot of people educate about Cardano in a better way. The budget is also clearly mentioned and they have shown the broken down budget and its use cases. This whole together will be indeed bringing a new community to the Cardona, once someone sees the content in Portuguese they will be more likely to promote the videos on their own to friends and family to watch them and it will be of a better reach. The proposer has a proper plan and will achieve the goal in the projected time and also has pointed out the necessary resources required to complete the project. The experience of proposer and his team seems to be very impressive and the proposal is likely to be implemented successfully. The proposer has foreseen the challenges/risks they might face and also has alternative solutions to solve them.", "q1r": 4, "q2": "The proposer has requested 9000 USD as funds to implement this project and he has also provided the breakup cost that will be spent on each individual requirement which seems fair. The proposer has also projected the funds for next 3 months and the money requested will be sufficient to audit the progress. The proposal is most likely to succeed as it going to reach over a large community of Portuguese speaking individuals in Africa. It will be very useful in reaching Cardona into the market by translating the content into regional languages and the reach will be more than expected in the future days. The proposer has also foreseen the difficulties they might face while implementation and also has alternative solutions for the same. The proposer has understood the problems of the locals clearly and has proposed the suitable solution which will benefit all.", "q2r": 4, "assessor": "z_assessor_1668", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "This proposal addresses the catalyst funding challenge by providing a tool (a course in a new language) to enhance blockchain education (Cardano) in a young market (Africa). In my opinion, this solution would very much meet the challenge, especially since a rough estimate has it that there are about 14 million people who use Portuguese as their sole mother tongue across Africa, but depending on the criteria applied, the number might be considerably higher, since many Africans speak Portuguese as a second language. With Africa has become a very potential market, having a course in Portuguese definitely is a huge push for Cardano to get closer to Africans. The proposer has presented and articulated their idea very forward. We can all see what they are aiming for and it’s 100% doable. If the goal of this proposal is met, it will allow a lot of Portuguese speakers have more opportunities to learn about Cardano and also it will help boosting the Cardano blockchain’s influence in African market. Overall, I believe that this proposal will address the questions posed in this fund 8 challenge and improve upon the catalyst funding mechanism. ", "q0r": 5, "q1": "Based on the information provided, I have no doubt about the proposer’s abilities to successfully implement this proposal by having the necessary experience and knowledge. The team has outlined all the tasks and milestone quite detailed. However, the roadmap has not been presented very clearly here. I think all the milestones should be assigned with specific deadline that spans in the 3 month plan. Alongside with that, the budget breakdown should follow the roadmap closely to justify the requested funding amount. But overall, all the works are listed fairly and if they are done properly, this project will certainly be a success. ", "q1r": 4, "q2": "The proposal presents a reasonable amount of audibility that the public can measure performance against. The team has provided a list of key metrics, including number of students attending the course, website activity, student’s feedbacks and so on. There are very clear and measurable deliverables. I would have preferred if the team had made a KPI by timeframe so that we can see the development of the project and we would know where the project aims to be and what would be needed for it to be there. In this way, we would be able to follow the intended progress step by step under any circumstances. One more thing that, this type of project will rely a lot on the feedback they get from the students and the community, which implies the motive of having high levels of transparency. Overall, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals", "q2r": 4, "assessor": "z_assessor_1703", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is aimed at developing Blockchain and Cardano in the African market by offering a free course in Portuguese, the most widely used language in Africa. I think it's also a good idea and has potential for growth.\nProposal should state more clearly the main features or components as the core of the solution proposed by the project. Proposers can also elaborate on how the project will work. At the same time, the proposal should also mention the impact of the project on the potential target audience. To clarify the impact of the project further, the proposed solution also needs to be explained in more detail in terms of technical aspects or functions should be taken from case studies.\nProposal pointed out that the audience the project benefits from is African students who are encouraged to learn and learn about the electronics industry. The outcome proposed by the project is to attract these objects to participate collectively in the Cardano and Blockchain communities. The results are completely consistent with the key metrics of the challenge. At the same time, the project's KPIs are also explained in detail and presented in an easy-to-understand manner.\nThe proposers consider the challenge for this project to be insignificant. They are confident that with a project development team with full knowledge and professional skills, the project implementation process will bring the lowest risk. This is a bit risky. If possible, delve deeper and plan all possible challenges to find the right direction.", "q0r": 5, "q1": "Roadmap of the basic project showed the general concept of the project. However, to increase the persuasion, the roadmap should divide the work items according to each milestone. Each milestone determines the completion time of the tasks. While the deliverables to be delivered during project development are clearly stated, it should also be more descriptive of the requirements for those categories such as a more detailed technical and technological explanation. during project implementation.\nRoadmap of the basic project showed the general concept of the project. However, to increase the persuasion, the roadmap should divide the work items according to each milestone. Each milestone determines the completion time of the tasks. While the deliverables to be delivered during project development are clearly stated, it should also be more descriptive of the requirements for those categories such as a more detailed technical and technological explanation. during project implementation.\nThe project has not provided information of the management and operation team. Proposal has just announced the project collaborator. With a knowledge background and extensive experience, she is also believed to have enough professional knowledge and skills to collaborate on projects. However, the information of the management team is still the core of building trust for the development of the project.\n", "q1r": 4, "q2": "In this section, proposal has defined success by evaluation criteria of goal completion. This will show that the team has taken the goals seriously.\nIt would be better for the proposers to envision what specific quantitative indicators will be when the project is successful. Please provide specific numbers to estimate the level of success for the project. This will make it easier for the community to track the progress of the project and evaluate the potential of the project through the indicators provided in the proposal.", "q2r": 4, "assessor": "z_assessor_1709", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The information of the project was mentioned in the first section of the proposal. The team made it clearly that to grow the Cardano community across Africa, the local people need to be taught about blockchain technology and how Cardano's research projects align academic incentives with the cryptocurrency industry's expectations. The team has talked about the result of their project, however, it would be better if they could provide more specific numbers to make sure that their proposal aligned with the challenge's key metrics.They have declared that they saw the minimal risk in their project and showed what they would do about it. ", "q0r": 4, "q1": "The whole project was explained as the different activities of the teachers, in which the proposer has listed out 8 specific activities and they would be implemented in 3 months. They have explained particularly each month's KPIs and how much budget for each month. This is a good thing. The team has also mentioned the member to take part in the project. However they have just provided detailed information of one member, I'm not sure if one person can complete the project or they need to have more people to work together but forget to mention them in the proposal. This still makes me confused. ", "q1r": 4, "q2": "The team has talked about the way they would measure the project's progress. The success of the proposal would be quantified by 5 particular factors in which they have mentioned that they need numbers to quantify. The proposer has explained what the success would look like to the team. The only one thing I wasn't sure is if the project is a whole new one or it belongs to a funded project before because I didn't see they clarified this aspect in the proposal.", "q2r": 3, "assessor": "z_assessor_1714", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Amazing proposal. Bringing the blockchain world to Portuguese speakers in Africa is the same as to bring it to, roughly, 14M people. \nHowever, there are some points that I should add in the risk management:\n1)\tMarketing: Since this is a new world and probably there are lots of people who are unaware of it (and therefore the search engine never shows this kind of content), it must be allocated here. That said, it’s mandatory a strong marketing strategy. And since you’re looking for people who are strong in maths, maybe consider to contact some universities or some student group (like in Brazil we have the ‘diretorios academicos).\n2)\tInternet: I’ve read a lot in the Catalyst proposals that there are several areas in Africa which the internet is very poor. Therefore, taking it into account when sharing the content might be interesting, providing more than one media (video, PDF, etc). Creating more than one access method to allow as many people as possible.\n", "q0r": 4, "q1": "Everything seems to be prepared and appear to have been thought a lot about.\n\nOne thing that I noticed is that you are planing to have 10hour content having 19 contents (not easy ones). Maybe adding more time in the proposal would allow you to have more time to enter in these subjects.\n\nSince the team appear to have only you, maybe you’ll have some troubles interacting with the students, since it can scale a lot. Maybe creating a Q&A in which everyone can answer and, therefore, you can stimulate every attendee.\n\nAnother aspect that might be more explored is the filming and editing. Maybe hiring a professional would be the right choice (they can create editions which will engage your public and film the best way possible)\n", "q1r": 4, "q2": "Everything well written and easy to follow. A thing that could be added is creating an email list to verify if the students are participating in ADA community, Catalyst, continued to study and are enrolled in solve real world problems using Blockchain/ADA technology.,", "q2r": 4, "assessor": "z_assessor_25", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "The idea is good and aligned with challenge, potentially addressing challenges kpis as \"Number of new African projects seeded in 2022\", \"Number of African developers onboarded in 2022\" and \"Local impact (measurable through user activity and reach)\".\nI liked the syllabus is already pre-defined and clearly demonstrated here and it seems very complete. It also good to know that Q&A is taken into account. If well done, this will help the engagement of the community.\n\nIt would be imporant, however, to have stated in the proposal an aproximate number of how many people in Africa speak portuguese. It is mentioned the countries who does but some numbers could be provided to fully assess proposal potential impact. Another imporant data would be the percentage of these population with internet access in Africa, as it is the continent with most limited access to it and the course will be online. For instance, according to statisctics from the World Bank (IBRD), only 36% of people in Angola use internet (source: shorturl.at/crEG2), which could limit the goal of this proposal.\nIn addition, I wonder if uploading content in an existing course platform was considered. I know it could raise costs a bit, but using an existing platform could save proposers time and help people finding the course, as these platform already have subscribers.\n\nMoreover, countries in Africa have different cultures and, as I understood, proposers are brazillian. Even though the language is the same, it would be imporant to know how overcome distance and culture barries to better communicate with people there and make them engage. This would be a risk that is essential to mitigate. In the same sense, the communication/advertise plan could be better ellaborated here, also including who is really their target audience (STEM students? people who work in tech companies? recenty graduated people?).\n\nLast, I'd also include here in the proposal how this course would differentiate from other courses already available in portuguese in this subject. Maybe having one specially developed for Africa helps, but it would be imporant to know what is included in this special developement that others dont have. This would help to make the value proposition more appealing. If nothing changes, maybe it could be considered to take an already existing course and just advertise in Africa.\n\n\n\n\n", "q0r": 3, "q1": "There's a clear timeline with a sensible time-frame, I'd only include here how and when feedbacks will be collected to make the course improves as it goes.\n\nThere's a budget brokendown by month and acitvities developed in it but maybe it could be mentioned how many hours each activity would take. imporant to mention also that proposal is not expensive considering challenge overall budget (3,6%). one extra observation here, in the budget breakdown it is mentioned \"month kpis\" in the title but what is described is not kpis (they are acitvities and milestones, at most).\n\nRegarding the team, there's one person committed. Proposer has experience in teach and in STEM area but is not clear what her knowledge or experience with Cardano or blackchain is. it could be mention what projects or funded proposals have already been developed in this area. Having a solid knowdge in the topic that will be taugh is as essential as knowing how to teach. I liked though that there's a linkedin link to verify information.", "q1r": 3, "q2": "The kpis and final deliverables are good, all measurable and sensible. There could be some targets on the kpis though, saying for instance how many attendees they intend to have, how many visits in the website is expected and so on.\nI also liked the students feedback is considered as a kpi - it could just be explored better how this will be quintified (if it will be just the total number of feedbacks or if a a NPS score would be created, for instance)\nIt is possible also to extract some milestones from the plan/timeline in the feasilibty section.", "q2r": 4, "assessor": "z_assessor_298", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "The proposer presented the problem of the lack of educational materials on blockchain and Cardano in Portuguese, a popular language in several regions of Africa. As a solution, he presented an online free course on blockchain and Cardano in Portuguese. This proposal is in line with the challenge as it has the potential to increase the engagement of Africans in Cardano by expanding Cardano's ecosystem on the African continent. The proposer does not clarify whether this proposal will need future funding or whether it will remain financially sustainable.", "q0r": 5, "q1": "The proposer presents evidence of his experiences relevant to the implementation of the proposal. The proposer does not mention who are the other people involved in the project, it was not clear if it will be just him, but I believe there are more people involved. The budget has been detailed and seems reasonable. The deadline set for completion of the work is realistic. The proposer presents a plan showing what will be done at each stage. The proposal does not seem to have any major risks for the success of its implementation.", "q1r": 5, "q2": "The proposer clearly presents the target problem and its solution. The proposer presents a roadmap with milestones and a deadline for project completion. The proposal contains KPIs for monitoring the success of the project. This information is necessary for evaluating the auditability of the proposal.", "q2r": 5, "assessor": "z_assessor_429", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "Considering the problem described in this proposal, I am very sure that matching it with challenge setting, it fits because it’s part of pain issues of the challenge. One goal of this proposal is to create an African website with education contents about blockchain and Cardano in Portoguese, is one which aligns with seeding and growing Cardano in Africa. If funded, I believe the proposal can reach out to more Portuguese in the long term or future.", "q0r": 4, "q1": "The information given about the team and their relevant experience described, I believe the team is capable of executing the task.\nI have an issue with the budget, amounts are still somewhat whole, there is no further breakdown of the sub total although individual items have been stated. The budget has three sub totals i.e 1st month KPIs ($3000), 2nd month KPIs($3000) and 3rd month KPIs($3000) however the individual items under each of these sections do not have their own specific amounts. I was expecting that every item has a specific amount so that there can be a full audit. I advise that budget amount be broken down from whole amounts to unit items that can easily be recognized. Nevertheless, the requested amount here is still reasonable for achieving the set goals.\nThe plan provided is a good one with a clear and definite timeline.\nIt’s good effort of the proposer to factor in challenges/risks.", "q1r": 4, "q2": "The roadmap provided in the proposal is comprehensive however the milestones are not clear but the time horizon is clear and definite.\nI believe that the metrics/KPIs were effectively picked because they are strong indicators for success evaluation as they measure the number of students attending the course within the stipulated period. The targeted problem described here is clear and I am of the assurance that the proposed solution is effective to address the problem.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "To grow Cardano in Africa, we will offer an online free course on Blockchain and Cardano in Portuguese for students and tech enthusiasts.", "experience": "Ph.D. in Physics. Associate Physics professor in Brazilian Institution. Collaborator researcher at MIT, USA. Portuguese fluent speaker. Creator of online Physics content with many African followers."}