{"id": 400888, "author": "oussama.laayati", "title": "African P2P Energy Sharing Dapp", "url": "https://cardano.ideascale.com/a/dtd/400888-48088", "category": 26442, "amount": 20000, "description": "How can Africans produce, consume, share, sell and buy P2P Renewable Energy in a micro grid using Cardano tokens and Smart contracts ?", "f6_no_assessments": 8, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The African P2P Energy sharing Dapp addresses Grow Africa Grow Cardano Challenge by designing a pilot of blockchained enabled microgrid (smart meter, smart contract, and peer to peer energy market). They target 10-20 houses with this fund. The microgrid and smart meter (tech solution for this proposal) will enable the villager to produce and share energy, and create a source of income. They have provided no reference on their tech solutions. If this project is a work in progress, they should at least show the ongoing work or project solution in draft. Also the impact of project as they claim is local and limit to 10-20 houses. The team has not provided enough information or reference that enables me to evaluate if the microgrid and smart meter will work and if so, what would be the impact towards growing Cardano in Africa. ", "q0r": 2, "q1": "The team provides the timeline and milestone with the target for every 3 months. The project will take 12 months to complete.  The budget breakdown: in the smart contract development and audit, they could mention how many hours they are working on this project. Without the number of working hours, it is difficult to calculate if the budget is reasonable. Also when considering the project period of 12 months, $20000 with 5 team members. The proposal looks likely to be underestimated not to mention the fact that the implementation across 10 houses will definitely cost more. The project doesn't look very feasible considering the timeline and the budget presented. The team should provide information on how far they have worked on the project to substantiate the claim that the budget is reasonable as the ground up work will likely take them to above the requested budget of $20,000", "q1r": 2, "q2": "They will share project development on github and solutions are open source. The metrics are consistent with the plan they mentioned in the feasibility section. They provide the target of installing 10 prototypes in a real African microgrid with different energy sources. It is clear enough to measure at the end of project that they will have to install their microgrid. Although the other items in how they view the project success, it could go more in detail to suggest figures of prosumers adoption. If more information is supplied, it would help in auditing for this project success and completion.", "q2r": 4, "assessor": "z_assessor_1351", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal wants to implement a Blockchain-based green energy plan. Facilitating Africa to produce, consume, develop green energy and buy and sell through Cardano wallet. The proposal has also considered and disarmed for the risks that may occur in the project when implementing. The proposal is a new development turning point in Africa and the ecosystem.", "q0r": 5, "q1": "Proposal provide a clear roadmap with each timeline, telling the reader what to do in different time periods. The budget is allocated transparently for each work performed in the project. In addition, the team has the right skills and techniques to carry out the project. Shows strong sustainability of the proposal", "q1r": 5, "q2": "Goal shows Africa's development progress from Blockchain energy smart meter. Connecting a Cardano wallet can buy and sell green energy across the Africa network, co-developing Africa and Cardano. This is a new proposal, new achievement in smart grid and energy management.", "q2r": 5, "assessor": "z_assessor_1409", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "This proposal pretty well  addresses the issues that need to be addressed in the impact section. Proposer provided a background on the problem to showcase their solution. Providing this information also helps voters have a better view of this project. In addition, information related to the features of the project and how the project affects Cardano is also clearly stated. However, regarding the challenges faced by the project, the proposer should provide additional solutions for those situations so that the voter can see that the risk has been reduced as much as possible.", "q0r": 5, "q1": "Proposer has provided a general outline for this project, the work to be done and its deadlines are all shared, however, the proposal could have been better by having more information about the work to be done. Besides, the section 'a detailed budget breakdown' should also be written in more detail than just giving the amount to spend for each phrase. Proposer needs to clearly list the expenses to be spent in each phrase. The information provided by the members is not very good. Instead of stating general information and then following a series of linkedin links, it is possible to summarize the information of each member and then attach each related link separately.", "q1r": 4, "q2": "Proposer provides pretty good standards for project development and clearly has metrics to support the standards. However, the proposer should provide additional tools for measuring the success or development of the project. In addition, the team should also provide more information in part 2 instead of just giving such a common goal.", "q2r": 3, "assessor": "z_assessor_1652", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The issue that the proposal team is interested in is promoting African people to use and buy and sell renewable energy P2P by using Cardano tokens and Smart contracts. The solution proposed by the proposers is to create a grid model consisting of a smart meter, smart contract, and peer-to-peer Energy Market. I think the proposal overall meets the challenge requirement and I also support the idea.\nProposers outlined the project's functions and benefits, as well as the impact the project would have on potential audiences. The team specifically explains what the project functions for and also clearly show the project's impact on the Cardano ecosystem. Technically, the solution is well explained and easy to understand.\nThe project promises to provide opportunities to improve the quality of life in remote villages. The team clearly identified the potential audience that the project will impact will be local people in Africa. The plan is set out to facilitate the development of the blockchain market. The solution completely matches the key metrics of the challenge.\nProposers also oriented the vision and discovered the difficulties that will be encountered during the implementation of this project. Proposal will convince that the team has carefully planned to face the challenges if there is a suggestion of how to solve them.\n", "q0r": 5, "q1": "The team leading and developing the project consists of experts in the field with extensive experience and solid background knowledge. Their profile also clearly notes their ability. The project promises to be successful thanks to the leadership of the management team.\nThe 6-month project development plan is divided into milestones. Each milestone is a short-term plan with an actual timeline to produce results according to the project roadmap. Proposers should still state the key positions and the number of personnel required for the project to be implemented. The proposed implementation plan is reasonable and describes in detail the tasks to be completed.\nThe budget plan is presented in great detail. It is divided into seven phases and each funding round with the appropriate funding level according to the detailed plan. Each cost category states what percentage of the budget is in it. This is great for the community to be able to monitor and check regularly throughout the project implementation.", "q1r": 5, "q2": "The goals of the project also state specific numbers. They are quantitative indicators to easily track project progress. The team clearly orients the expectations to be achieved when the project is completed according to each milestone and each task. The products will be shared by the team on Github.\nThe defining criteria for the success of the project are presented very specifically with the goal of attracting users and developing the market in Africa.\nIt can be seen that the proposal team was serious and clear about the set goals and at the same time showed the community the potential that the project brought.", "q2r": 5, "assessor": "z_assessor_1709", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The proposal addresses the challenge very effectively and provide a thorough roadmap to enable a blockchain based energy peer to peer market where Africans can produce clean energy and share it through a micro grid with different consumers.\nThe team vision is to develop a smart energy meters based on blockchain where it is behaving like a node in the micro grid that not only calculate the energy production and the energy consumption, but also share data with different grid prosumers, providing a secure solution, smart contract and decentralized application which will be connected to a secured cardano wallet where prosumers can buy, sell energy using cardano.\nThe impact of this proposal is to also provide a platform for peer to peer energy market in an African micro grid which will help and encourage people to produce and consume green energy typically solar and wind energy that will create a cleaner environment and free markets without utilities companies.\nThe team will want to promote cardano in Africa by providing tech use solution for African problems, the developed framework will enable the villagers to produce and share energy which will in turn create source of income.", "q0r": 5, "q1": "The team has proven to have enough skills and experience members in the subject area to bring the project to live. \nThe team experience members are made up of Research and development engineers, PhD researchers working on smart grid, energy management systems, Electrict vehicles, Electronics and many more. \nThe experience team members also have a start up that develops smart sensors, using AI to solve problems in microgrids.\nThe team foresee four main challenges that may disrupt the smooth execution of the project thus; Technical, Operation, Socio- economics and legal. ", "q1r": 5, "q2": "There is clarity in the description of the problem, the solution and how the proposal is aligned with them. \nIn line with the above the team is determine to implement the project within 12 months calendar period, there is a breakdown of how the activities will be carry out.\nAfter the 12 month period of the project implementation, the team will carry out post project survey to study the behavior of prosumers in order to improve the prototype.\nThe budget is outline clear and broken down into identifiable items, the budget is very reasonable to complete the project.\nThe team has provided websites, links for the project deliverables to be shared in like the github.  ", "q2r": 4, "assessor": "z_assessor_1755", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "This is an absolutely brilliant proposal! The proposal has identified one of the biggest challenges in Africa, i.e rural electrification. The development of small-scale solar energy conversion systems such as photovoltaic systems for the provision of electricity in a rural area will certainly aid in improved electricity access, also leading to job creation and skill development. It would certainly make a great impact if it is implemented. Additionally, it will certainly bring cardano in the hands of many more people in Africa. ", "q0r": 5, "q1": "I think the team put together is very capable of a susseccful implementation . However, i would recommend they consider the following:\n\n-Most villagers in Africa use simple phones which are not smart. This challenge has not been addressed in the proposal. Or is it that, smart phones will be provided for the use of the smart meter and access to their cardano funds? Or are you targeting a central household with a smart phone to be a central P2P node?\n\n-In a typical African village, access to the internet is a big problem? This has to be addressed as it will be central to the gaining of access to the smart meter and even their cardano funds.\n\n", "q1r": 4, "q2": "I think a bit more clarity on the following issues would be helpful:\n-Team should include funding allocation for community sensitization. This is especially important since the village systems and traditions are very different from the towns and cities.  Community leaders will have to be deeply involved for your programme to be successful.\n\n-There is a high degree of illiteracy and limited or no internet service in the rural areas, but you have indicated a webinar as one of the means to inform and market your product. You should rather focus more on the field campaigns or propose an additional means of marketing.\n\nI think if these are addressed, the degree of success of this proposal will be high. its a very impactful proposal and should be funded.\n\n-Kindly check your budget outline. It exceeds the requested funds by 15% in your percentage calculations and $2000 in your summary calculations.\n", "q2r": 4, "assessor": "z_assessor_1886", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal’s end objective is to build a peer to peer, blockchain based, energy market by developing a smart energy meter that will act as a node in the micro grid and be secured to a wallet, all being built on top of the Cardano blockchain. By implementing this solution it will persuade people to consume and produce green energy, be able to construct micro grids where there are no solutions at the moment and thus, in time, eliminating the need for utility companies in places in Africa where it’s most needed.\nThe impact this proposal can have is remarkable, not just for the Cardano Blockchain and ecosystem at large, but for people in need of electricity from parts of Africa.", "q0r": 5, "q1": "The plan and timeline needed for the delivery of the proposal are detailed and very easy to follow. Since the team seems to be very skilled in the domain, according to their expertise description and LinkedIn profiles, I trust the timeline estimation to be as accurate as possible.\nThe budget is divided according to each step of the progress and seems to be sensible in terms of numbers.\nConsidering the information provided, I have no doubt the team will be able to successfully implement the project.", "q1r": 5, "q2": "The progress measurement is linked to the deliverables from the feasibility section, that will be updated on GitHub, especially since all solutions will be open source, and as such, the community is provided with an open, independent source for verifying the progress of the project.\nThe success definition is very detailed, not only is it related to the deliverables of the project, but it also has additions, like “Publishing a peer reviewed research paper” and “Studying the behaviors of prosumers in order to improve the prototype”, which show that the team is looking to not only deliver the best results, but they want to keep improving, even after the prototype is being successfully launched.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This is an amazing idea. The usage of renewable energy is accelerating every year and the concern about climate change around the world is growing bigger (https://www.un.org/sustainabledevelopment/energy/). The energy market is growing fast, as well, therefore this idea addresses right in the spot of some of the biggest concerns nowadays.\nThe African countries have a big share of renewable energy in their energy plant (https://trackingsdg7.esmap.org/), that said, I think that this idea could facilitate the market and empower the users, making a difference for them and introducing them to the ADA world.\n", "q0r": 5, "q1": "Seeing the team curriculum makes me more relieved since the budget is quite low to release everything. Although, since you’re developing everything, I believe that this could be managed. \nI’ve some doubts. To manufacture the meters’ first batch, you have a factory? Do you have an average selling price? How much this cost reduces if you increase the quantity? – I am asking these questions because I imagine that several countries in Africa does not have money to invest 500 USD (I’m not counting here your profit) besides the solar system. Since this might be an issue, it would be good for the proposal if it includes the meters ROI.\nAnother point that should be added here is the average price of distribution and installation of this meter (I imagine that this is different from the field implementation and testing, I’m more curious about when you start running) – These costs could add a considerable value to the final price.\n\nYou should include the cost to develop a selling platform as well, with all the information needed.", "q1r": 4, "q2": "The published paper and the security audition is good.\nI’m missing some metric and KPIs. \nYou said that you’re aiming a small village at first (10 to 20 houses), however, if all the tests and implementations run nicely, how many houses are you expecting to attend (this should be timely informed (6 months : +10 houses))?\nOne important metric is the ADA volume and #of transactions expected due to your project.\n", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Our goal is designing a pilote of blockchain enbaled microgrid including: smart meter, smart contract and peer to peer Energy Market", "experience": "Team Background: Research and Development Engineers, PhD researchers working on Smart Grid, Energy Management Systems, Electric Vehicles, Electronics and IoT.\n\nWe have a Startup that develops Smart Sensors, using AI to solve problems in Microgrids."}