{"id": 401078, "author": "ja10", "title": "Inc. Train the Trainer Africa MVP", "url": "https://cardano.ideascale.com/a/dtd/401078-48088", "category": 26442, "amount": 24200, "description": "There is a lack of support infrastructure for SPOs in Africa to create sustainable and scalable business models. ", "f6_no_assessments": 3, "f6_rating": 4.888888888888889, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=25312"], "media": [], "f6_assessments": [{"id": 1347, "q0": "The proposal tries to build an incubator program in Africa and also helps the development and growth of SPO in Africa. The proposal states the potential risk the project has and the team tries to mitigate it by partnering with WADA.", "q0r": 5, "q1": "The team provides a detailed and reasonable breakdown of how they will use the proposed budget. However, freelance support budget can be stated more precisely, for example, VA 200$ or marketing 300$. The proposal gives a hyperlink for a detailed timeline with what they will do in each period. The proposal articulates the relevant skills and experience of the member to implement the project.", "q1r": 5, "q2": "The team provides a detailed and reasonable breakdown of how they will use the proposed budget. However, freelance support budget can be stated more precisely, for example, VA 200$ or marketing 300$. The proposal gives a hyperlink for a detailed timeline with what they will do in each period. The proposal articulates the relevant skills and experience of the member to implement the project.", "q2r": 5, "assessor": "z_assessor_1342", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2921, "q0": "The proposer has in depth knowledge about the challenge  and as a result has given a systematic breakdown on how the challenge will be effectively handled through the proposal. Again, considering the fact that this proposal is a buildup of a previously funded proposal in fund 7 which has afforded the proposer to gain the requisite experience to handle this challenge. \n\nI give this proposal a 5 star rating because I strongly agree that it addresses the challenge. ", "q0r": 5, "q1": "Looking at the detailed plan presented in the proposal which includes metrics to measure both short term and long term, it is no doubt that this proposal will be implemented successfully. Additionally, considering the wealth of experience of the team behind this proposal as well as the partnership they intend to have with WADA, I strongly agree that this proposal will be implemented successfully. A five star rating is what I give this proposal ", "q1r": 5, "q2": "I give it a rating of 4. This is because the information provided by the proposer is very detailed and pragmatic. The budget provided is very reasonable. There are step by step parameters given by the proposer to measure progress of the proposal. Possible hiccups have all been dealt with in the proposal. Both short and long term successes have all been spelt out with timelines thereby making it possible to easily track the success of the proposal.", "q2r": 4, "assessor": "z_assessor_1590", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8070, "q0": "The team wants to form & scale their SPO incubator program to other developing regions for helping SPOs in Africa to create sustainable and scalable business models. As their solution explanation, I think they have a clear vision and mission about what they will do to help the community. The plan is divided into two important groups that impact the SPOs and Catalyst project community. The proposer showed us the detailed activities, components that their programs will help and impact these communities. Moreover, the proposer also provides some key KPIs that I believe they're really aligned with the challenge settings. One of them is the number of African projects seeded in 2022, this will impact the Cardano ecosystem in 2022. In addition, some numbers of interactions in the social media channel are also their focus key KPIs. Lastly, the challenges mentioned in the proposal were mitigated by their strategy very clearly and in detail that I believe that they will make it successful. ", "q0r": 5, "q1": "The proposer gives a clear roadmap, including the link with the whiteboard can help visualize their milestone and timeline easier. From my experiences, their activities in each time frame of their roadmap are suitable with what they want to make in the solution session. With these outlines, I think this roadmap is detailed enough to measure and audit. It also helps us assess the budget is reasonable. But for assessing easier to people who have no experience in these types of projects, the proposer should explain more the detail of position they need in each scope of development in the roadmap that relates to. For this, the proposer explains which position is needed for implementing the plan of this project with some of their key person that I believe they can help this project to be successful. ", "q1r": 5, "q2": "I hope that the proposer can provide some tools to help us track their key metrics in the future. The key metric and the successful image that they provide are fully for the community to audit their progress and they're all very easy to understand how they're connected to the main plan. Moreover, this proposal is the next phase of their old proposal in the fund7. So I think we can believe in their ability to develop it. ", "q2r": 5, "assessor": "z_assessor_651", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": " Adapt our proven SPO incubator into a ‘Train the Trainer’ model for African NGOs, as a blueprint for other developing regions. ", "experience": "As Impact focused experts we run high growth coaching & mentoring programmes from tech startups, thru to Global businesses & Universities. \n\nOur funded \"Small SPO Impact Business Programme\" produced an MVP product in F7 suitable to be adapted to a Train the Trainer model.\n "}