{"id": 401072, "author": "proofspace.nick", "title": "Translate no-code SSI to Swahili", "url": "https://cardano.ideascale.com/a/dtd/401072-48088", "category": 26442, "amount": 27680, "description": "Ability to grow Cardano is constrained by lack of translated documentation and products for scaling local ecosystem", "funded": 0, "upvotes": 17910082, "downvotes": 4474868, "votes_result": 13435214, "votes_cast": 84, "f6_no_assessments": 5, "f6_rating": 3.999999999999999, "videos": [], "media": [], "f6_assessments": [{"id": 3091, "q0": "The petitioner wants to offer a solution to the language problem for the people who speak Swahili. The solution would be to build a platform where the products and documentation about the Cardano ecosystem are translated. This project could help approximately 50 million Swahili speakers. So this would have a positive impact on the Cardano ecosystem. It has only been taken into account that if a translator is ill, he can be replaced.", "q0r": 4, "q1": "Some of the team are described. There are no links with the proposal. The submitter can then write whatever he wants. There is currently no translator in the team. It will not be easy to find a good translator in this language with knowledge about the Cardano ecosystem. A budget is included in the proposal. There is nothing in this budget about working hours. The product translation costs $5443. How is this price calculated? The documentation costs $ 8164. There is no indication of how long this will take. The translation of the documentation would take 1 month. I find this rather unrealistic to do all this in one month. In my view, there is no clear implementation plan included. It is always stated in 1 sentence how everything will be carried out. The plan does not explain exactly what resources are needed.", "q1r": 2, "q2": "A very limited roadmap is included where very general milestones are described. No clear KPIs have been included, so that it will be possible to follow the development. Statistics such as the number of participants, read documentation,… could be included. The proposal addresses the lack of documentation in Swahili. Unfortunately, this proposal has not been worked out in detail. It is not clear where the money from the financing will go.", "q2r": 2, "assessor": "z_assessor_1606", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 3453, "q0": "This proposal has solved  the problems posed in the Impact section quite well, the information is arranged quite logically. Proposer provides voters with information about their project such as what it will do, who they are targeting, and how the project will impact the Cardano exchange. In addition, KPIs/Key metrics are also provided with explanations for it, which makes it easier for voters to understand the aspects that the project wants to progress. However, proposal will be better if the team can give some examples for translated materials team want to introduce to Swahili speakers. The risk section and its solutions are also stated quite clearly showing how well the founders have understood their project.", "q0r": 5, "q1": "Proposer presents the tasks that need to be completed and the timeline for the activities to do those things, however, the proposer should give more information related to the activities instead of just giving such outlines. In addition, in the 'a detailed budget' section, the team should also provide more information instead of just spending items, for example, in the 'Translator fees' section there should be more information about how fees are calculated. How (fee based on the translation or the number of words) this part will be more detailed and easier for the voters to follow. The members' information is well written, full of information for voters to know who the founding team is.", "q1r": 3, "q2": "Proposer has given the goal for the project but it is not really clear. For example, for the 'measure the development of the project' section, the team should provide more information that the public report is referring to, such as the figures in the report, or what the report is about instead of just There will be reports on community channels. In addition, the founder should also make predictions based on the above published KPIs/Key metrics for voters to easily track and compare for the development or success of the project. .", "q2r": 3, "assessor": "z_assessor_1652", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 4029, "q0": "For me,this proposal shows specific objectives, operations, and target audiences. The proposal aims to help Swahili can approach more documents, products, or services in English by translating them into Swahili and help Cardano develop in this community. They will update Swahili frequently when new items publish and evolve. Their target objects are businesses and people who are speaking Swahili. I think this proposal is necessary because it has positive impacts, it both helps people speaking Swahili can more the produce and service choice in for their work and life and also helps the number of people joining in Cardano ecosystem and they people use ADA more increasing. They provide detailed key metrics and also align with the challenge, but the key metric is not supplied the number to measure. they also predict the risks they have to handle and the plan to solves this very clearly therefore it may be suitable for a long time.", "q0r": 5, "q1": "About the feasibility, the tasks they stated pretty clear and for each task, they have a time mark to finish the task, but I think they should provide more the process to complete each stage, such as how many the translation they will translate and what are the fields that they will deal? or how are the testing and fixing done?. Moreover, they mentioned running localization UI fixes, but they don't bring them into the roadmap and there is no explanation for this task.  The budget that they have to pay is compatible with the task into the roadmap but I think it is better than if they supply the quantity members that they have to perform each task and who will the people, Who will check and correct the translations?. And they don't bring up the pay they have to run localization UI fixes. The staffs of the proposal are own a lot of experience in IT, UI / UX, Software Development which will help a lot for running this proposal and you can examine their experience.", "q1r": 5, "q2": "How the progress of the project will be measured will be communicated to the Catalyst community through the existing community channels, and the measurement criteria outlined correspond to how the project is being carried out however I think, the author provides specific numbers, it is better to measure progress, such as how many translated documents can be shared. And with the way to measure the success of the project also does not provide a criterion with a specific number but is described quite clearly.\n", "q2r": 5, "assessor": "z_assessor_1701", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"id": 7422, "q0": "When I see the proposals for this challenge, as well as the challenges focused on other geographic regions such as India, I realize that most of the proposals are aimed at translating basic content that explains Cardano to a more lay audience. This is undoubtedly important, but proposals that focus on a more technical audience from these geographic regions are rarer, as is what happens in this one. We are told that the project is about the translation of “an SSI SaaS platform without code (ProofSpace), including products and open documentation, from English to Swahili”. In this way, a technological tool that addresses the Cardano ecosystem will become accessible to this African audience, which will certainly open doors in terms of job opportunities. We know that the language barrier is the biggest impediment for Cardano to be disseminated in all regions of the world in a more democratic way. With this, when producing the translation of this content, we will be working exactly on this problem. The Swahili language is very important for the African people, having many speakers, I know this because I have already evaluated another proposal that also addressed the production of content for speakers of this language. Therefore, I think the proposal is advantageous and meets very well the objective of the challenge of spreading the Cardano ecosystem across Africa, thus increasing the general investment in our blockchain, either by facilitating the creation of Dapps, new members entering our community, purchasing and betrayal of Ada and so on. And, obviously, the other pillar of this proposal, which is the improvement of the African continent, would be fully achieved, since the aforementioned technological platform, if translated into the local language, would make it much easier for Africans to work with this tool, which would generate more employment opportunities and a more stable income. Besides of course, this type of service is very well paid, and one of the main objectives of our blockchain is to fight the social inequality present between continents, and we know that poverty rates in Africa are some of the highest in the world. For all these reasons, I agree that the proposal is in line with the challenge and that it will probably be a sure way to achieve what we aim for here. \n", "q0r": 5, "q1": "Regarding the roadmap, the main tasks to be completed in the total project development period are listed, and then these are divided according to the months. However, I think this explanation is still very superficial, for example in April and May two tasks are mentioned: receiving funds and recruiting a translator (preferably someone from the Catalyst community). In this case, would the entire month of April be used to receive funds? And in May, all that would be done would be the recruitment of the translator? How would they make this selection? How do they plan to get in touch with Swahili-speaking Africans who participate in our community? What criteria would be used to make the final choice? As in the example of the first two months, the activities of the following months could and should be more detailed, in order for us to have a deeper understanding of the project development process. Now, evaluating the other aspects of feasibility, in relation to the budget, this part gets a little confusing. The translator fee is 907 dollars, would that be paid in one lump sum, or would that be the monthly salary? How does this relate to the amount of USD 6300, which would be considered the full translation of the document? Several other parts related to translation are reported, however I believe that each of them should have been better explained. As described, the use of funding is still quite confusing for me and I cannot be sure if the amount requested is fair and compatible with the complexity and size of the project. And in relation to the team, finally, we have some information we need and some we don't. We know who those involved are, their names and what roles they previously played in their professional lives. However, it is not defined what each one would do in the project, nor do we have links to any of their social networks (linkedin profiles, for example), where we could see practical evidence of everything that was said. Also, it would be more interesting if they already had potential Swahili translators to present in the proposal description. Therefore, the feasibility is not bad, but there is also a lot to be improved so that full confidence is passed in the team, in the process and budget requested. \n", "q1r": 4, "q2": "According to the bidder, “all deliverables will be communicated openly to the Catalyst community through existing community channels such as the monthly reporting process.” How will this be done? What are the existing community channels? Will these deliveries take place at the end of each month? Several information about this sentence could have been provided to make the understanding of it more complete. I agree that this is the best way to promote a good follow-up of the process, as it is necessary for the Cardano community to follow from the budget release to the final delivery of the project. Therefore, it would be essential for the proponent to specify how this bridge would take place, whether it would be through online tools such as Notion, Google Docs, etc., or reports sent directly to community communication channels such as Telegram and Discord. One positive point I've identified here is that we're told it's expected to be delivered each month, so while we're not so clear on where these partial results would be made available, we know very well what to monitor. Regarding the final results, it can be summarized that they would be the “availability of an easy-to-use codeless SSI platform for the Swahili Cardano community” and the “consequential growth in the use of Atala PRISM”. We know what needs to be achieved, but as in the previous case regarding the process, how can the community verify that these goals have been achieved? It is necessary that the proposer and the rest of his team make such information necessary, that we know how to measure this progress, that they are summarized directly in infographics, for example, or through a video presentation with the sources of what is being It is spoken. Finally, that the community can have a simple and direct way to audit the final results and be sure of the veracity of the said information. So what I can suggest here as improvements would be, in general, to strengthen the bridge between the community and Cardano and the data on partial and final results. In this way, the bidder's suggestions on auditability would be more complete. \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 9, "ne": 3, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 9902, "q0": "Warning to VCa: this proposal being very similar to several other proposals by the same team, my assessment may include similarities.\nThis proposal offers to translate to Swahili the app and the documentation of an existing product funded in Fund 7 that fosters adoption of SSI by the support of ATALA Prism (https://cardano.ideascale.com/c/idea/385204).\nImpact of this proposal is related to the accelerated adoption by Swahili-speaking users of the no-code platform. Swahili is spoken by about 100 million people originated from East Africa (Tanzania, Kenya and RDC), therefore this proposal is aligned with the “Grow Africa, Grow Cardano“ challenge brief.\nThe proposer mentions several metrics listed in the challenge brief, like the number of African developers onboarded in 2022. But while I do not deny that this proposal goes into the right direction, the proposer could have explained more why this language has been chosen among other languages spoken in Africa. African French for example is spoken by about 50% more people than Swahili.\n", "q0r": 4, "q1": "One risk is listed about maintaining the translation while the products would continue to evolve. To mitigate this risk a part of the budget of this proposal is retained for future work, which I consider is a good practice. \nTasks for completing the proposal are well listed. The translation will be supported by a dedicated translator that remains to be recruited. The budget breakdown details how much translation work will be required, between translator recruitment, documentation translation and product translation itself. Some items could have been more explained in this breakdown, like why is there a generic “translator fees” not related to a specific part of the work?\nThe team shows evidence of having enough project management and computer science skills to complete what looks like a simpler project than what it has accomplished so far.\n", "q1r": 4, "q2": "Success is defined as the availability of the translated documentation and product, and as a real growth in the Swahili community in use of Atala Prism. \nSeveral milestones are listed to enable the community to monitor this 3-month project, including beta versions of the translated material.\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Translate a no-code SSI SaaS platform (ProofSpace), including products and open documentation, from English to Swahili.", "experience": "ProofSpace is a no-code platform for building & deploying SSI. ProofSpace Dash and ProofSpace App are localisation-ready. We’re experienced, multilingual team, >80yrs full stack dev, distributed systems research & translation experience (e.g. Portuguese, German, Arabic)."}