{"id": 401105, "author": "afia", "title": "The Africa Catalyst School", "url": "https://cardano.ideascale.com/a/dtd/401105-48088", "category": 26442, "amount": 10680, "description": "Africa is not actively engaged in Cardano programs/activities of the Catalyst School. Africa oriented platform will drive up participation.", "f6_no_assessments": 33, "f6_rating": 4.616161616161617, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal is positive for the African continent, as it boils down to bringing the Catalyst School to the context there. This new people objective project should insert me in a well-oriented way in the Catalyst process, help as CAs, vCAs, ponents, the initiative has already been voters and etc. a series of activities such as workshops, follow-ups, in short, the group is made up of experienced non-complex people, who help to structure new Catalyst concepts, instructing them on the concepts that should be blockchain, what is the difference between Cardano and other blockchains , what are CNFTs and etc. In short, it is literally a source of catalyst for new members. And if this is adapted to the specifics of Africa, it will certainly be a great gain for its natives. As stated here by the proponents, it answers some difficulties regarding membership in Catalyst. Starting with the fact that most are totally unaware of what Cardano and Catalyst are. Then we have a language barrier, which makes it difficult for everyone who does not have English to attend community meetings (Town Hall, for example), even the mother tongue to follow community meetings (Town Hall, for example), up to the participants' accent account. Africa deserves a special one, it is necessary that the knowledge passed on to these students is so important to our blockchain. Now that he explains that I also think the project will have a positive impact on the continent, he will say that the expansion of our blockchain is perfect for our community. As new participants join Catalyst, the numbers of Ada holders will be added; new digital wallets will be created; more people transacting on our blockchain; with this, we can increase investments in our Dapps; young people in the technology area will be motivated to learn about our technologies, who will become Plutus pioneers, will know if developed with the workforce produced; In short, the gains are many. \n", "q0r": 5, "q1": "The proposal script is perfect. We know what will be developed in the first 3-month cycle, and in addition, it is detailed which activities will take place per week. In this way, we have a full understanding of what will develop next, what we will build over time so that this project goes from theory to practice. The degree of specificity found here is so high that it will also be useful in the part of auditing the proposal, as I will comment below. Therefore, no criticism to make for this part of the proposal, in my opinion everything is in order. Talking about the budget, the amount asked in my opinion is totally fair and very worth investing in compared to how this project will be beneficial for Africa and Cardano. The total amount is divided into parts, so we understand exactly how it will be used. The level of detail is so good that we even know the hourly value of some things, like the “Delivery of 11 live sessions in English and French”. I don't have any criticisms to make about it either. Finally, analyzing the team, I think there is a lot of security in this team, because we know their names, previous professional experiences and how they relate to the Cardano ecosystem. However, I think it would be interesting if the level of detail provided by them was more egalitarian, we have people who spoke little about themselves, such as Afia Owusu, for example, while others, such as Daniel D. Lezu, provide extensive information. about your resume. It would also be interesting for all team members to attach their linkedin profiles, because with that we would have a practical way to prove the information that was said. However, I'm going to give the maximum score for feasibility, because we have enough information to know in depth who we are dealing with, what they will do in each passing week and how much all this would cost. \n", "q1r": 5, "q2": "The auditability of this proposal is very good, with only a few things to improve. We know very well how to audit the process, the bidders would provide very detailed information on how this monitoring can be done as the months go by. I found the way they explained this auditability really differentiated, it's as if they had left everything as unraveled as possible so that the Cardano community has enough grounding when it comes to monitoring activities and processes. My only suggestion is that they make it clearer how we could have access to this information, otherwise it's perfect. Now talking about the success scenario, we have many numerical indicators to understand if the project achieved what was expected. I believe it would also be interesting if we had direct feedback from the students involved, from the people who were trained through the School's activities. It would be really cool to see the result in practice, new members joining, people getting an extra income working for Catalyst, tech students specializing in our most used programming languages, developers learning about smart contracts and so on. And it would also be perfect if it was made very clear how this could be directly perceived by the Cardano community. Therefore, I believe the auditability is good, but it could still be a little more detailed and diversified (qualitatively, in this case). \n", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 10, "ne": 6, "ng": 4, "nfo": 0, "vca_o": 2}, {"q0": "Theres is a detail presentation of the plan and timeline for the project to be carried out. The proposer also seems to break down the number of peole who would be needed for the project. Also paying attention to the proposal the team is made up on qualified people who have experience in such events. Careful consideration was also given to the challenge of internet connection", "q0r": 5, "q1": "Theres is a detail presentation of the plan and timeline for the project to be carried out. The proposer also seems to break down the number of peole who would be needed for the project. Also paying attention to the proposal the team is made up on qualified people who have experience in such events. Careful consideration was also given to the challenge of internet connection", "q1r": 5, "q2": "The success metrics are well laid out and hence making it easy to track. Also the KPIs are also well stated that tracking of the progress would be easy. Everything is clear and simple to understand. Simplicity is key in the proposal", "q2r": 5, "assessor": "z_assessor_1169", "no_vca": 11, "ne": 0, "ng": 7, "nfo": 4, "vca_o": 1}, {"q0": "The proposal addresses the challenge Grow Africa, Grow Cardano because it aims at establishing a catalyst school in Africa and the aim of Grow Africa , Grow Cardano is to increase the number of people in Africa onto Cardano and Catalyst so establishing a Catalyst school will help introduce Cardano to a great number of Africans who do not have any idea about Cardano and even with those who already have a fear idea of Cardano will have the opportunity to get to gain more knowledge on it .", "q0r": 5, "q1": "First of all very good idea but I think the one class lesson a week is less and studying one topic in just a day will be too much pressure on the people studying so if maybe twice a week would be better and effective. And starting with English before adding or translating into other languages that is a very good idea. With the presented  members they are all well experienced and well educated as well. The presented budget is also reasonable.", "q1r": 4, "q2": "Recording the number of participants per session helps know whether the project is progressing or not example in the first session 10 participants then the next session we get 17 participants we get to know we make progress. I think more can be done to keep track of the progress and success of of the proposal than to just the attendance over the class sessions.", "q2r": 4, "assessor": "z_assessor_1787", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "It is definitely an interesting proposal to address the objective. It is true that the African continent is home to a large number of young people who may be unaware of this field, and introducing them to it through specialized training would be a big step for Cardano.", "q0r": 5, "q1": "The interest of the promoters shows that they are willing to work every day with the aim of reaching more people around the world who join the initiative. In addition, they have a great team of professionals who will surely carry out the proposal.\nI think that, with such a good project and with specialists in the field, it is very likely that it will go ahead.", "q1r": 4, "q2": "The project has a good background, but perhaps more information is needed on how specialized monitors will be located in the necessary languages so that the African trainees correctly understand the sessions and find the field really interesting.", "q2r": 3, "assessor": "z_assessor_829", "no_vca": 4, "ne": 1, "ng": 2, "nfo": 1, "vca_o": 1}, {"q0": "The proposal is specific to address the gaps in using the cardano ecosystem interface and the inability to synchronize ideas into blockchain to solve related problems. In many instances, many Jonny-come-late find it difficult to navigate through the Cardano ideascale platform and commit petty mistakes that derails their reputations.\n\nOther too and because they are find it difficult to surf the platform for opportunities, they lose interest and abandon any plans or proposals that could have added to the growth of the catalyst community. Building interest is among the youth to be part of the community is key growth of the cardano community.\n\nWith this, the active youth across borders will equally eliminate language barrier and help other countries to board the ideascal train. I think the proposal will add value to the cardano blockchain community.", "q0r": 5, "q1": "The budget is a smart one and seems realistic help achieve the objective. Looking at the team, there are project leads, vCAs, CAs and experienced individuals who much familiar with all the Cardano platfoms. These experience are enough for the project success. \n\nThe modules to be developed for the outreach program are of specific needs and in stages for better understanding make the ideascale platform user friendly for participants.\n\n", "q1r": 4, "q2": "The performance variables are clear and measurable. The proposal is also giving the number of sessions per school including number of participants. The localization of the project in terms of language is important to break the barriers to access to information and can been seen in the modules for auditing.\n\nHowever, it will be important to have a monthly report on activities of the project. It could be called a progress report. This will be easier to track progress from one stage of the project to another. If this proposal wins funding, it is important to consider monthly reports and final report after project ends.  ", "q2r": 4, "assessor": "z_assessor_719", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement is well explained and falls within the challenge setting. Catalyst school is one of the critical platforms of Cardano that disseminates information about the blockchain, having one in Africa is a big win for the continent and Cardano as a whole. The metrics and goals address the critical issues in this particular. I believe catalyst can onboard many Africans to Cardano and catalyst.", "q0r": 4, "q1": "Given the details about the team and the relevant experience described, proves that the team is well equipped to complete the task. The budget provided here is well explained and hence I believe that it’s reasonable to achieve the set goals. The plan provided is detailed and the timetable is also clear and definite. I like the fact that, the proposer has factored in the challenges and risks that may arise during the implementation of the project.", "q1r": 5, "q2": "The roadmap provided is very well described with clear milestones and time horizon. 20 school sessions and workshops is a good indicator of the desired outcome and what success looks like.  There is clarity in the description of the targeted problem and the solution proposed is effective to address the problem.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "In my opinion, the idea is great, which aims to create a Catalyst shool for Afican community, it addresses well the objectives laid out in the challenge, “continue to seed and grow Cardano in Africa in 2022”. I strongly agree the proposal is impactful because the proposal would:\n- onboard new members from Africa for Project Catalyst and Cardano community\n- help new members improve their skills while engaging in Project Catalyst as proposers, CAs, vCAs (or without any specific roles)\nAs we see The Catalyst School is enhancing the impact of Catalyst completely by improving the contribution of all its players and roles. In colaboration with the main Catalyst School, Wada and Cardano community members, this proposal’s success will be a big contribution to the growth of Cardano ecosystem in Africa. \nI found interesting with the analysis about the reality of the African community in Cardano engagement and the solutions that the proposal will bring to the community and benefit the Cardano ecosystem in generally, it helps readers easy to understand how difficult they are to participate, what the reasons are, and what’s the content of the School. I think it would be more interesting if the reference in which the analysis based on, is included in the proposal (for example, as the authors speak “Africa’s participation in the Catalyst School’s activities is quite low”, so how low? based on which reference?) This suggestion is just a small detail to make more clear about the reality of Africa’s participation in Cardano and Catalyst project, it is not an essential detail. I still strong agree that the proposal is impactful.\n", "q0r": 5, "q1": "The plan in 3 first months is very detailed, allows readers see clearly not only what will be executed but also how to do in each week of each month as well as the elaborate preparation for the next month in the timetable.\nAbout the team that makes up the proposal, they are certainly capable, committed to Cardano system and Catalyst project with full experience and skills relevant to the successful executing of the proposal, as they are Catalyst Swarm co-founder, co-creator of the Community Tools, Catalyst Swarm core member, Challenge Team Members, developer, Blockchain/Crypto educator, CAs, vCAs, and more. As my reading, there is a missing thing in the description of team member: the last information about Mr. Daniel D.Lezu, the authors said: “Reach him on the following platforms:”. But no link after that. \nAbout the financial amount, I think the budget is fair and reasonable, broken down very clear into items. I would like to know more about the cost of marketing? And how to do it? I want to know it better because, in my opinion, the marketing strategy for attracting people in Africa to join the School is one of the important things in deciding the success of the project.\nI hope my suggestion make the feasibility is greater. I still strongly agree the proposal is feasible.", "q1r": 5, "q2": "Roadmap with milestone and time horizon are set clearly, make the proposal easy to be tracked the progress of the implementation. The targeted problem and solution are articulated clear understandable. KPIs and success metrics are completely in detailed. All of them are provided with a good level of detail, which helps us to understand what the result would be expected in general. Therefore, I strong agree the proposal is auditable.\n \n", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "I think this should be a priority when we initially wanted to develop Africa. Time after time there are very active individuals that either are already promoting Cardano or are experience in having large group workshops that want to teach on Cardano. Some I believe either target the wrong group/individuals, does not yet understand fully Project Catalyst, does not yet understand how to and what to look for in a proposal or a mix of all those scenarios.\n\nThis all can be potentially addressed by having The Africa Catalyst School. I reckon those individuals submitted disjointed proposals most likely because they have not been mentored and this is proven. There is one proposal that through mentoring by Emelia Sarfo, it's quality grew leaps and bounds. I do not understand why this wasn't setup earlier. Too match the wave of African proposals, that perhaps due to not being funded, become discouraged, and again this is a fact. Attention to Africa I believe continues to grow, I have seen numerous high-quality start-ups showing huge interest in developing Africa. We need to balance that with more education, education and education. At the very education on how to submit a strong proposal.", "q0r": 5, "q1": "There is one name that caught my attention, which I have previously mentioned. Emelia Sarfo, her mentoring of at the very least one proposal transformed that proposals quality into high. Although the content of the proposal was adjusted from (to my recollection) an older proposal, its core solutions were still the same, but explained in a systematic and detailed manner. In my a view, a manner that resembles the teachings of Catalyst School.\n\nAdd to this there is Felix and Victor, not to mention the other team members, The Africa Catalyst School will succeed. In regards with their action plan, it is almost identical to that of the Catalyst School, a tried and proven system. Though I did find some adjustments from the original that seems to be an effort to iterate into a more refined and improve syllabus. Perhaps the findings The Africa Catalyst School will be used to also update the teachings/syllabus of Catalyst School.\n\nThe 3 (three) month budget also correlates well with the detail plan. One can make a connection between each other. The number are not random metrics which will eventually help with the auditability.", "q1r": 5, "q2": "In regards with what they want to achieve, it is also accompanied with clear numeric targets. Unfortunately they do not mention the method they will use to track and report these targets. Although not specifically mention one can make an educated guess that since there is a mentioning of recordings, that YouTube will be their main source of reporting. Especially since the team also cross pollinates with the WADA team, who also uses YouTube as a form to track their KPI's.", "q2r": 4, "assessor": "z_assessor_635", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "The Catalyst school will be effective in Africa only if communication will be adapted for the local communities, so this proposal effectively addresses the challenge as it aims to onboard new African users by adapting content especially for non English speakers.", "q0r": 5, "q1": "The team can count on members who actively joined Catalyst since Fund 1, and other members who are well familiar with WADA, the organization helping African to submit proposal in Catalyst. \nAs the team already stated one key issue could be the lack of internet availability, but as well outlined in the budget, a part of the fund requested will be to provide some internet connection where needed", "q1r": 4, "q2": "The budget breakdown is detailed and the amount of about 11k USD is realistic for the activities proposed. \nThe time required to accomplish the whole translation of onboarding lessons and providing sessions for new users is 3 months, which seems also feasible. \nI find the number of target users quite low, as it would take 300 usd to get a new user onboarded.\nI would raise the target number of new users onboarded to at least 100, to justify the investment. ", "q2r": 5, "assessor": "z_assessor_530", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "The Africa catalyst school having looked at the proposal is a great initiative that will bring much impact to the whole Africa continent, since it intends to broaden the horizon of newcomers who join the catalyst platform and also to onboard more localities. I personally faced some difficulties my first time until I got Intouch with some experts from the main catalyst which has been awesome for my journey so far.\nAs elaborated in this proposal millions of francophone and Arabic communities are not enrolled in the catalyst platform and even the few there find it quite difficult to relate/understand training seminars to empower them therefore the Africa catalyst school seeks to communicate with them through their local languages which is laudable and will expand the territory of the cardano ecosystem.", "q0r": 5, "q1": "The collaborative approach that is provided in this proposal with team of competence/experts with the same aim to improve the catalyst,cardano,blockchain technology etc will deliver a successful implementation.\nThe first 3months of post funding will organize series if sessions in English,French and other important languages to get work done properly and the budget plan is well laid out to ensure funds are managed well by implementers.", "q1r": 5, "q2": "There are measures provided in this proposal to track and keep records of success by determining the number of CAs,VCAs,new voters,new refrees etc who gets involved in every workshops programs organized by the catalyst school. \nAlso 1 to 1 support given to new comers by the community members.", "q2r": 5, "assessor": "z_assessor_497", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The proposal will try to provide Africa with a Catalyst school thanks to which to train the people of the continent, so that they know all this community and are encouraged to transform into proposals possible ideas thus promoting the continent thanks to the potential of Cardano.", "q0r": 5, "q1": "I was surprised by the team that makes up this proposal. They have many people from different projects united by a common goal like this. They have a lot of experience in Cardano and Catalyst behind them and all of them have technical or entrepreneurial qualities. In addition the plan is very well detailed and following it you can achieve the desired result.", "q1r": 5, "q2": "From key performance indicators to the objective of the proposal through the metrics to be used to determine success, the auditability section is exactly what is sought for a good score. Congratulations to the team for the work on the proposal and thanks to this you will surely be able to keep track of your progress without problem.", "q2r": 5, "assessor": "z_assessor_372", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": " I strongly agree that this proposal effectively addresses the challenge of growing Africa and Cardano.\nThe solution given by the proposer is to establish an Africa Catalyst School that will give the opportunity to introduce the entire structure of Cardano and Catalyst. \nBy providing the possibility of simplified onboarding by the team, it will be much easier to involve many more people who have been turned away from the project due to difficulty in understanding the lessons in English.\nA local team leading such a large potential of people will be great for the African community for the Cardano community and the Catalyst project.\n", "q0r": 5, "q1": "I agree that it is very likely that this proposal will be successfully implemented.\nFrom the attached site we can find the linkedin/twitter profiles of the team members and do a check on the veracity of the experience.\nThe proposer has provided information accurately about each person's role/experience.\nThe budget the proposer asks for is appropriate for the challenge and gives detailed information on what it will take to get us to the goal.\nHe offers a realistic timeline and explains how he will implement the translations and lessons. \nThe first live lessons will be a sort of \"test\" and will be in English and then the following lessons will be published on youtube in English and French.\nThe proposer doesn't give detailed information on how he will use the 500$ to do networking and advertising and I think it is an important piece to be able to implement this proposal successfully. \nThe administrative costs are also not explained in detail.\nOtherwise I agree that with the information given it is very likely that the proposal will be successfully implemented.", "q1r": 4, "q2": "After successful funding, I firmly believe that this proposal provides me with enough information to assess progress in achieving its stated goals.\n\nIt will be easy to be able to measure the success of this proposal from the incoming data of new CA members, vCAs, referees, voters etc because the proposer will keep track of this and we could do the check without problems. \nThe roadmap is clear, in three months they expect a minimum of participants and a stated total of live and recorded sessions.", "q2r": 5, "assessor": "z_assessor_361", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal perfectly addresses the challenge setting by targeting the younger population in Africa (under 35 years old) and onboarding them into the cardano catalyst ecosystem. The youth are incredibly important to target because they are the future of this community and ecosystem. The school will provide content and sessions led by Africans in English and French so that native Africans will be able to better understand accents so there is less of a communication barrier. The school will also reach out to institutions, workers, and business owners to promote cardano and catalyst to raise awareness. The catalyst school in Africa will also have new sessions in addition to older sessions, such as using the ideascale website, turning an idea into an effective proposal, and launchpad sessions where people can share ideas so that people in Africa can collaborate and create new innovative solutions to problems. This proposal will onboard new catalyst proposers, result in the creation of new catalyst projects, and impact local communities via the proposals that are created. (score given: 5)", "q0r": 5, "q1": "Given the information provided, this proposal is highly likely to be successful. The proposers all have experience with cardano catalyst in some capacity, whether it be through proposing, being a CA/vCA, or being an elected representative to a catalyst circle. These credentials give more validation to the proposers because they all know the ins and outs of the catalyst process, so they will be able to teach more effectively. With regards to the timeline, there is a very good roadmap included in the proposal that lays out exactly what will be done throughout the proposal’s execution. The first month will be used to conduct pilot teaching sessions, which will inform the lessons taught in French as well as the future English-taught sessions. I think that this method is very well thought-out because the proposers have the opportunity to try new methods and see what works and what doesn’t. This way, they can create a program that will be more successful. With regards to the budget, the proposers have listed out what the funds will be going towards. The funds are broken down by hours of content and are easy to follow. There are costs for internet, translation, and networking included as well. I do not have experience working on a project like this one, but all of the funds seem sufficient given the scope of the proposal. (score given: 5)", "q1r": 5, "q2": "Given the information in the proposal, I believe that it is highly auditable. The proposers have listed out many important KPIs, such as the number of participants, the number of sessions created and recorded, the number of 1-on-1 support meetings provided to community members, and many more numerical performance indicators of success. There are also the time-specific goals of 3-4 live sessions in both French and English per month. The final end goal is to have 20 school sessions/workshops hosted. From all of the information I just listed, the cardano community can easily keep up with this proposal’s progress to see if it is meeting its goals and successfully onboarding new cardano catalyst proposers, voters, and CAs/vCAs. If reported in an easily digestible manner, there should be no problem with auditing the proposal. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The proposal generally addresses the challenge of not having enough Africans being involved in  the expansion and adoption of Cardano and Catalyst. However there are no details of how participants will be recruited in the communities, schools and workplaces", "q0r": 4, "q1": "The proposal will be executed by seasoned professionals and this increases the chances of success if implemented. The plan also gives a step-wise description of how the project would unfold and it is quite feasible. However the plan shows that the first month of the training would be used more as a trial month. Because  one of the anticipated challenges of the project is high cost of internet, some young people would not be able to afford spending money on the training for an entire month of trial sessions. It is advised that the evaluations, corrections etc be done within the first two weeks of starting the project in order to make it more affordable for young people.", "q1r": 4, "q2": "Details of how participants will be recruited should be included in the proposal. As the success indicators of the project include the number of people who join the Catalyst School and sessions, it is important that a description of a reliable and ethically acceptable way of engaging participants into the project be included in the proposal", "q2r": 3, "assessor": "z_assessor_1923", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposers would like to provide Africa with a catalyst school to onboard local communities and enhance the impact of Catalyst in the continent. This proposal is applicable since African is not actively engaged in Cardano programs/activities of the Catalyst School. The school is organized in collaboration with the main Catalyst School, Wada/Cardano Ambassadors, seasoned CAs, funded proposers and mentors. If it is successful, the model can be applied in various countries in Africa, the Cardano brand can be more popular in Africa. Hence, for the criteria of effectively addressing the challenge, I give mark 5 for this proposal.", "q0r": 5, "q1": "This proposal is expected to last in 3 months, they conduct live session in English and French. The budget described in common (i.e. what is the basis to calculate the translation cost is 3500 USD, the internet cost is 1500 USD, etc.). The progress is repeated month by month, not much different in the process of 4 weeks. In addition, the clear proof to consider for supporting the proposal is not mentioned. The people participated into the plan may be appropriate to the plan. They have experiences not only in Cardano but other field as well (such as competence in web developer, HR practioner, tutor, event strategic planning...). \nThe proposer considers the challenge for this proposal is the internet connectivity. The target group, the youth, may find the cost of internet data expensive and may not fully participate as expected. I think he should show the solution for the challenge, have clear analysis on the risk the proposal may face and method to solve the problem. When the proposer has thorough solution method, the proposal could be more successful. In conclusion, I actually have no evidence to consider whether the plan can be successfully implemented at this time. For this criteria, I give mark 3.", "q1r": 3, "q2": "As for the writer, the success of the proposal is measured by: Total number of community members who get involved with the Catalyst School, Number of proposers joining the sessions and workshops, Number of CAs joining the sessions and workshops, Number of vCAs joining the sessions and workshops, Number of 1-to-1 supports provided to community member, Number of new referees, Number of new voters. The described metric of success is clear. This proposal has main schedule to follow and expected to be completed after 3 months. However, the solution method as for me is rather vague, the proposers should firstly apply in a small community before mentioning the huge project for whole Africa. I evaluate mark 4 for this criteria.", "q2r": 4, "assessor": "z_assessor_1870", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "This proposal provides Africa with a catalyst school to onboard local communities and enhance the impact of Catalyst in the continent. As follows:\nThe Catalyst School has been very active in onboarding new people onto Cardano and Catalyst however, Africa’s participation in the Catalyst School’s activities is quite low for a couple of reasons including:\n- Many people in Africa have absolutely no knowledge of Cardano and Catalyst\n- A large francophone community (141 million people and growing) and Arabic speaking community (140 million people) which is significantly not engaged\n- People struggle to understand some live and recorded sessions because they are unfamiliar with the spoken accent of presenters\nAs a solution to these challenges, the Africa Catalyst School will provide the following:\n- Outreach to the youth in tertiary institutions, workers and business owners to promote and raise awareness of Cardano and Catalyst;\n- Provide onboarding to new entities through:\n+ Live and recorded localized sessions facilitated by Africans in English and French for a start and eventually in Arabic. The emphasis is on having Africans facilitate the sessions to eliminate the challenge of poor understanding due to differences in spoken accent.\n+ Prepared courses on all the topics currently handled by the main Catalyst School ie. Introduction to Cardano Blockchain and Catalyst, How to be a Community Advisor, How to be a Veteran Community Advisor, How to be a Voter etc.\nThe Africa Catalyst School will provide additional courses as follows:\n(a) How to navigate the Cardano.ideascale.com website\n(b) Brainstorming and Q&A sessions – These sessions will aim at gathering and sharing ideas on challenges peculiar to Africa so participants can use them as a launchpad for writing future proposals.\n(c) How to turn an idea into an effective proposal on ideascale\nGiven the huge potential for the growth and expansion of Cardano and Catalyst in Africa, an Africa oriented Catalyst school will yield tremendous results.\nThe proposal has positive impacts on the development of Africa in particular and the Cardano community in general. This is a large market with a lot of potential, if Cardano can be exploited, it will become a big step in increasing the scale of Cardano in Africa.", "q0r": 5, "q1": "Given the scope of work to be done we anticipate that the Africa Catalyst School may extend beyond one funding cycle. For the first 3-month cycle however, we will focus on the following:\nMonth 1: Conduct live sessions in English once a week\nMonth 2:Conduct live sessions once a week, with breakout rooms in English and French\nMonth 3: Conduct the following live sessions once a week in English\nThe courses will go through a similar fine tuning process to improve on them and translate them into French for delivery in the next funding cycle.\nWe anticipate that a minimum of 25 people will participate in every session with numbers growing as the sessions progress.\n", "q1r": 5, "q2": "The key indicators for measuring the progress of the project will be the number of courses\nlocalized and/or developed, the number of live sessions held as per the proposal and the number\nof participants recorded for every session.\nIn month 1, we expect that three courses will be localised and/or prepared, 3 live sessions will be\nconducted with a minimum of 20 participants in attendance at each session.\nIn month 2, we anticipate that four live sessions will be conducted with English and French\nbreakout rooms and with a minimum of 25 candidates in attendance. Also, 3 additional courses\nwill be localized in English\nIn month 3 we expect to have four live sessions, all in English with a minimum of 30 participants.\nWe will track the success of this project by measuring the:\n\n•\tTotal number of community members who get involved with the Catalyst School.\n•\tNumber of proposers joining the sessions and workshops.\n•\tNumber of CAs joining the sessions and workshops.\n•\tNumber of vCAs joining the sessions and workshops.\n•\tNumber of 1-to-1 supports provided to community members.\n•\tNumber of new referees\n•\tNumber of new voters\n", "q2r": 5, "assessor": "z_assessor_1863", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "This proposal effectively addresses the challenge as it identifies difficulty of newcomers in navigating their way through the Project Catalyst as a problem and establishes the extent of impact to the Cardano community if such challenge is dealt with.", "q0r": 5, "q1": "Given experience and plan presented, it is highly likely this proposal will be implemented successfully. The proposer provides a very detailed presentation of the timeline, making it easier to identify each event they’ll be working on at any point in time. All needed team members together with their work experience have been adequately provided. The proposer should, however, recheck the mathematics computed in the budget allocation, there appears to be a mistake.", "q1r": 5, "q2": "The information provided is sufficient enough to audit the progress and success of the proposal. Convincing and reasonable key indicators for measuring the progress of the proposal have been included.", "q2r": 5, "assessor": "z_assessor_1744", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "Cardano has been devoting a lot of resources to community development in Africa, which is Cardano's key market in the near future. The establishment of The Africa Catalyst School is a very necessary thing at this time because it will give newcomers the opportunity to access to learn and participate in the Cardano community and they will see the opportunities to start a business with Catalyst. The Africa Catalyst School will be the incubator for Cardano's young talents in the Africa region. The successful proposal will help the Cardano community in Africa to expand, especially Cardano will be present in the French and Arabic speaking communities. This will be a solid foundation for Cardano in Africa in the future.", "q0r": 5, "q1": "With the experience and skills of Afia Owusu, Felix Weber, etc. and other team members, I believe that this proposal will also be successful. This is a strong team, including many veteran members, who have contributed a lot to the Cardano community in the past time. In addition to the internet connection that will affect the success of the project, I think you also need to prepare a plan for other risks for example: Power failure will also affect sharing sessions, too few people. interested or too few people know about this project, what will you do to attract them?", "q1r": 4, "q2": "The route you gave me is also very complete and clear. I completely believe in your ability to accomplish the goals you have set out. In addition, with the amount of $10,680, you were also very transparent and clear in the use of this money. I think you need to be more specific in terms of numbers so that it can be easily measured. Example: How many members will join Catalyst School, How many will become CA, vCA or how many new referees will be. I believe that if you can give specific and complete numbers, the community will appreciate it even more.", "q2r": 4, "assessor": "z_assessor_1213", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "The intentions of this proposal are communicated in a solid manner. To recreate the catalyst onboarding educational material in a manner that local people in certain African communities can understand and apply to stimulate the 100's of millions of young people on board and become active participants in the Cardano ecosystem is the crux of this proposal. I recognize that a risk involved in this project is one of internet connectivity and it would be helpful if the proposer would give some detailed insight as to how they intend on managing this risk. This is an important detail as it plays a significant role in this project's potential to scale in order to reach the majority of the under 35 years of age demographic that was referenced in the proposal.", "q0r": 4, "q1": "I strongly agree with the feasibility of this project. The timeline goals are solid as are the credentials of the team put forth. The budget request is reasonable. Perhaps the budget is a bit too tight but having the experience of this first cycle should reveal the realities of that concern.", "q1r": 5, "q2": "The auditability of this project is clear and reasonable. As long as the data gathered is transparent, reviewed, and analyzed for why the results are what they are, this project's potential to grow and be successful is likely.", "q2r": 5, "assessor": "z_assessor_1658", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": ": The challenge and the problem presented in this proposal are aligned. The proposal seeks to outreach to the youth in tertiary institutions, workers and even business owners to promote and raise awareness of cardano and catalyst especially in Africa where most people have low or no knowledge about blockchain. This will also provide new entrants with onboarding through live and recorded localized sessions guided by Africans in English and French at first, and thereafter in Arabic. The importance of having Africans facilitate the sessions in order to eliminate the problem of poor comprehension due to spoken accent.", "q0r": 5, "q1": ": Given the expertise and strategy offered, this proposal is extremely likely to be implemented effectively. From the deduced and budget breakdown, Africa will experience a great change positively if this is established.", "q1r": 5, "q2": ": From the impact and feasibility, the problem is clearly defined and addressed hence the solution aligned with the problems. The project's development and success can be monitored using the proposer's own metrics hence the information provided is enough to audit the success of this proposal.", "q2r": 4, "assessor": "z_assessor_1621", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"q0": "In Africa they are not involved in the Cardano program. The intention is to set up a Catalyst school where people from Africa can participate. By establishing local communities, people will be able to take the step more quickly to participate in this project. The project will have an impact on people who speak French, English and Arabic. By recording the live session in French, a community of 149 million people is addressed. The proposal includes challenges for which a solution has been found immediately. (language, outreach youth,…) This project can certainly have a major impact on Cardano if the community grows in the long term and perhaps the people who have had the training can also work more on the expansion of the project.", "q0r": 5, "q1": "Experienced team members are present in the proposal. A few people have been CA of the previous funds for a long time. The other people on the team have relevant experience with blockchain technology and community startup. A budget overview has been drawn up in which the costs such as translation costs and internet costs are clearly described. There is also a planning available stating what will happen in these 3 months. It is good that all the topics per week are already described in this planning. It is good that the people have the opportunity to get the session in English at the same time. It will certainly be enough to organize 1 session every week to get started. It might be useful to offer an extension session per session for people who want this. It has been taken into account that there will have to be good cooperation all over the world to make this project a success.", "q1r": 4, "q2": "A list of the contents of the sessions has been provided. The main indicators are specified in the proposal such as the number of courses, the number of participants. I think it would also be good to make some sort of test about the sessions that makes it clear that the content has been understood. In this way it can be seen whether certain sessions need to be done again or whether they need to be tackled differently. Success statistics are included in the proposal. I wonder what will happen if 15 people drop out during the projects. It might be better to keep a kind of reserve list from which other people can possibly join. The project aims at 20 school sessions and learning content that can be used in workshops. This project can be a good start to get local communities involved in the Cardano community. By offering these sessions in different languages with the target group Africa, this can be a stepping stone to later apply such learning platforms in more areas.", "q2r": 5, "assessor": "z_assessor_1606", "no_vca": 8, "ne": 1, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "Very good proposal , the content is clear and all has been very well explained.  Considering the plan on how the team looks at executing this course is just amazing and I think this really look promising for the cardano ecosystem in Africa , the strategy also involved in bringing the youth on board is very brillant and I commend this team for the good job done.  The fact that the team looks at handling this courses in other languages is a brilliant idea and I totally agree to this proposal, the proposal has the high potential of bearing fruits in the future , so I would say the proposal is very good . ", "q0r": 5, "q1": "Considering the team members with their experiences in this I believe that the team is well organized and prepared to execute this project , \nWith links also being provided it makes everything clear so that references can be made if there is any need , and also providing a time frame as to when and how to seek to achieve this project is very satisfying and am really confident in this proposal , the budget is very clear and also impressive on how the team has broken down the budget into indentifiable parts for everyone on understand how the amount would be used, there is nothing hidden in budget , is transparent and I commend the team very well for that, keep this up even for your next proposals. ", "q1r": 5, "q2": "With the provision of the key metrics on how this project would be a success when funded has not be left out by the team, and there is the high potential that when this proposal is funded it would be something big for the cardano ecosystem in Africa, all I can say is that the proposal is excellent and the team is well prepared for this, keep it up for your next proposals ", "q2r": 5, "assessor": "z_assessor_1603", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Yes, it did.\nOrganising outreach by local volunteers in our Tertiary Institutions will increase awareness &knowledge to new on-board members about Cardano/Catalyst in African. \nThis will eliminate the challenge of poor understanding which hinders active participation of African in Cardano blockchain as a result of differences in spoken accent. Assessing the Course outline with use of local Facilitators, training will be more interactive which will weigh Participants understanding level during & after the training .\nAgain, Participants' capabilities/abilities can be identified which will ensure efficiency in nominating roles or rankings in Cardano/Cstalyst system. \nCourses stated such as Navigating Cardano Ideascale,  Brainstorming, Ideas into Effective proposal etc, will impact hugely to the growth n expansion of Cardano/Catalyst in Africa Continents", "q0r": 5, "q1": "These observations made in the Challenge seem to me the possibility of the Ptoject;\nA well structured Course outline stared.\nParticipants feedbacks will be taken to weigh knowledge grained as well as their satisfaction and to rate Facilitators performance.\nVivid understanding asduredhere as Courses will be handled by Local Volunteers with familiar spoken accent \nFourthly,  3months Course duration stated, indicating how qualitative & intensive it will be in achieving the main goal of activeness of African in Cardano/Catalyst system. \nBudget is well detailed & sprkt out clearly to be monitored.\nLastly, notwithstanding,  the Profiles of supported Team Members, show how rich they are in knowledge & experience.  Hence, the Project can be implemented successfully. ", "q1r": 5, "q2": "Course outline details below;\nMth.1 -3 live sessions with minimum participants of 20 in English /French\nMth.2 -4 live sessions in English/French at breakout rooms with participants increased to 25, minimum & 3 additional sessions in English only.\nMth.3 -4 sessions,  all in English with participants increased to 30, minimum \nAnalysing the details of the 3mths course/training duration, indicates increases in participants. Hence, new on-board members will increase as a result of understanding the navigating of the Ideascale Cardano ecosystem which will also lead to increase & more quality Proposal,  causing efficiency in CA/VCA assessment,  making the Voters' more easier &time saving.\nAll these informations above show the sufficiency to audit the progress and the success of this Proposal.", "q2r": 5, "assessor": "z_assessor_1591", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Tapping into the youth of such a large populace could really take Cardano to exponential mass adoption in a matter of no time. Giving these kids the time, effort, and guidance they need could bring the entire continent out of poverty. This project is what this challenge, and catalyst itself, is all about!", "q0r": 5, "q1": "The team has amazing credentials that, if given the proper funding, I believe would serve to making the world a better place. I would go the extra step and hire a marketing direct that focuses specifically on the target audience as to help grow the awareness that this program exists. I would also like to see research into how other funding could be leveraged to grow this project even faster.", "q1r": 5, "q2": "The only note I could add to this amazing proposal is to reach out to the Cardano ecosystem through social media and/or videos showing the results of the team's hard work. I believe that with enough advertisement, more people would be willing to donate to bring better funding to your system. Kudos to the entire team, I look forward to seeing you guys help Africa become a land of free, happy, and healthy people!", "q2r": 5, "assessor": "z_assessor_1548", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "I personally think the idea in this proposal is an excellent and brilliant one. It clearly aligns with the challenge and I think funding this proposal will bring a tremendous impact on the cardano ecosystem. The solution to the problem stated in the proposal is a very good one, providing Africa with a catalyst school will go a long way to help seed and grow cardano in Africa since it will help onboard new members into cardano and having new members in catalyst means having people participating effectively in roles in catalyst like  community advicers, veteran community advicers,proposers and others. Establishing a catalyst school in Africa will help people get more insight about cardano and it's blockchain based on the topics the team stated to be taught,in the proposal. ", "q0r": 5, "q1": "With the kind of people presented  as the team in the proposal,I have no doubts that this project will be implemented if funded. From the proposal, I realized that, almost all the team are active members of the cardano community. some are community advicers, veteran community advicers, proposers and proposal mentors. Also,this project if funded is going to be implemented in collaboration with the main catalyst school. All these people are familiar with the cardano blockchain and I think this proposal is highly feasible.\nAgain the information provided in the proposal about the team is very detailed and to me,they are capable of handling the project.\nLastly,the time frame and budget is clearly laid out,and it makes a great deal of sense to me, considering the fact that,they will be working on establishing a catalyst school. Preparation of materials, delivery of live sessions, internet cost and publicity and networking and others are well catered for with reasonable amounts in the budget.", "q1r": 5, "q2": "The auditability of this proposal is very complete. There are KPls needed to understand  if the project is achieving what it intends to achieve. The team clearly describes in details what success will look like,so we have many live sessions to monitor if the Africa catalyst school is established.\nLastly,I think the community itself is involved in this project since we have a good number of CAs,VCAs,proposers and even the main catalyst school in collaboration with the team. I very much believe success will be auditable and well measured.", "q2r": 5, "assessor": "z_assessor_1537", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "The impact of the Africa Catalyst School is immense, as it precisely aligns with the\nGrow Africa, Grow Cardano initiative, in supporting young Africans, exploring the\nworld of blockchain. Out of the many proposals I have reviewed, this project, I\nbelieve, has the perfect implementation plan and vision to scale Cardano and Catalyst\nin the continent. It was a brilliant idea by the team to keep its focus on the intended\nvision of Cardona. Indeed the exposure of Cardona to Africans is minimal. Therefore,\nwhen trying to control the market in a new business environment, it is imperative to\nget the support of experienced experts in the Cardano and Catalyst ecosystem, and\nthis is where the Africa Catalyst School comes in with the win for Cardano. Detailed\nsolutions listed in the proposal provide a step-by-step guide to the project innovation and the risks run into on the main Cardona platform. The proposal answers these\nidentified challenges, factoring that into the solutions presented in the project. For\ninstance, the proposers identified that on the main Cardano platform, accent\ndifferences restrict understanding by many Africans, hence the proposed solution to\nlocalise courses and sessions. However, the proposal lacks the relevant key metrics\nthat are indicators of a company’s growth and impact in an ecosystem/ industry. It\ndoes not include any measure post project implementation.", "q0r": 4, "q1": "The team running this project are mostly experienced members in the Cardano/Catalyst ecosystem. I think this gives the project a head start over others, to precisely nail the implementation process. Aside from that, the team could have included additional information or links to profiles providing more information about\nthemselves, other than their affiliation with Cardano for transparency. In the\nimplementation phase, it's great that the team is not research centred in the 3 months\ntime frame stated, but rather goes full test implementation with the project. The\ndescriptions provided after the weekly and monthly plan breakdown captures additional information and that's a plus for the team. Also, it's very realistic of the team to limit its target audience to 20 - 25 new entrants (Africans) as it steadily scales up. What I\ndidn't quite understand was where the intended participants for the first month were from since there would be no uploads on social media. Perhaps a distinction in whether or not already existing African members on the Cardano platform will be used for a said test run. Again for the subsequent months, there is no mention of how the company plans to get these 25 new entrants from, i.e mode of entry into the African market. For the budget breakdown, I think it captured all the necessary costs well and the funding requested for phase one is very realistic.It includes costs for every initiative mentioned in the solutions. This team is definitely ready to help Cardano venture into the African digital marketplace.", "q1r": 4, "q2": "The team failed to include an open tracking system and that limits the auditability of\nthe project. No mention of progress reports or other public auditing tools to check\nmilestones and traction gathered by the team. Although, they did mention the\nnecessary KPIs to measure the growth in the scheduled time frame. There is a detailed system by the team to measure success; number of proposers joining sessions, number of new voters and referees amongst others. The team should however work on a separate method of communication between them the Cardano community not limited to who joins a session or not.", "q2r": 3, "assessor": "z_assessor_1508", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"q0": "Impact\nThis proposal seeks to educate the youth in Africa and bringing them onboard as a great way of expanding the Cardano Ecosystem and bringing fresh ideas onboard for the Catalyst. I believe this proposal has the ability to engage a large number of the youth in Africa to promote and raise awareness of Cardano and the Catalyst. It will provide a platform for the provision of great ideas and proposals for the subsequent catalyst funding cycles as well as veteran community and community adviser roles. I suggest the inclusion of incentives to get the youth in Africa to participate.", "q0r": 5, "q1": "Feasibility \nThe plan and the timeline for the deliverables have been clearly broken down. This proposal has a high likelihood of being implemented looking at the expertise, skills and experience of the team. They also presented a well detailed explanation of the budget. The challenges during the implementation of this proposal has also been clearly stated. ", "q1r": 5, "q2": "Auditability \nThere is clarity in measuring the success of this proposal and key indicators to make auditing easier. Enough information has been provided for the successful implementation of this project. ", "q2r": 5, "assessor": "z_assessor_1505", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"q0": "The 'Grow Africa, Grow Cardano' challenge aims to increase Cardano awareness in Africa, and this proposal clearly demonstrates that intention. Having an African school that includes locals has a significant local impact since it will reach a large number of Africans who will be involved because they understand what the outreach is about and will go a long way to ensure that Cardano is the blockchain of choice in Africa by 2023. This proposal might potentially be a long-term initiative in Africa, capturing a significant portion of a significant emerging market. As a result, I am convinced that this proposal effectively addresses the problem.", "q0r": 5, "q1": "The proposer is one who has shown over the period her knowledge and expertise in block chain specifically Cardano and has the necessary abilities to carry out the plan. The proposer also knows the kind and number of team members needed to carry out the plan especially with the addition of a bilingual member to her team and gives a budget that is broken down, and acceptable in order to meet the established objectives. The proposal also includes a realistic timeframe for completing the work, as well as a clear and actionable implementation strategy that demonstrates what is being done and how it is being done. The proposer has taken into account the challenges that may arise during implementation. Hence, problem solution listed has a high chance being implemented successfully.", "q1r": 5, "q2": "The key indicators for measuring the progress as well as the success metrics are clearly stated and are understandable and achievable. The proposal includes a time frame for completion and also includes a clear explanation of the targeted problem, as well as a solution that solves the problem in a comparable manner. Thus, the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 12, "ne": 0, "ng": 9, "nfo": 3, "vca_o": 1}, {"q0": "The challenge setting has been explicitly explained. The Proposal also explains how they plan to deal with the challenge with their aligned solutions.\nThe Proposal follows the campaign as there is the objective to increase the Cardano African community and the African community in general. This helps develop the ecosystem. The challenge setting has been well addressed.", "q0r": 4, "q1": "The challenges budget has been given in detail. it is comprised of items that are necessary for the proposal achievement. The is also the time frame of the proposal to be done which has given a detailed schedule in weeks what will be delivered and how. The experience of the team is good for carrying out this proposal. Given the information, the proposal can be implemented to success.", "q1r": 5, "q2": "There is much information in the proposal to track the proposal's process and the success. The key metrics have been well stated and can be looked at in the course of the project. With the schedule drawn also there is no doubt that the proposal can be tracked at any time in the process to know the progress of the proposal.", "q2r": 5, "assessor": "z_assessor_1478", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"q0": "Onboarding and engaging the youth (below the ages of 30 years) in Catalyst activities  to boost the adoption of Cardano in the African continent is indeed a problem in the challenge that needs to be solved. The initiative of the main Catalyst School was a great step in the direction of solving this problem and the community has already experienced the great impact it has made across. Expanding this initiatives to Africa is still a great solution that addresses the targeted problem and even scales to address future problems. The mentioned KPIs in this proposal directly align with the challenge the fund goals as well and therefore, I strongly agree to the impact level of this proposal.", "q0r": 5, "q1": "The budget of this proposal sounds reasonable and well broken down into deliverable items. However, it is identified in this proposal that the main challenge that could hinder a successful implementation is internet connectivity. It further explains that the target group which is the youth, may find the cost of internet data expensive and may not fully participate as expected. Unfortunately, an alternative solution to this potential challenge was not provided in this proposal and I find $1500 being allocated for internet cost in the budget breakdown not clear to me as to whether it is for the participants internet issues or the facilitators. I think it would have been helpful if the team had provided information on how they intend to tackle the potential challenge stated in this proposal.\nThe roadmap being described carefully adds to the feasibility of this proposal.\nAnyways, the experience of the team described in the proposal together with all I have said above makes me agree that this proposal can be implemented successful if funded.", "q1r": 4, "q2": "This proposal provides the community with clear indicators that could be used to measure the progress of it during the implementation stage. The proposal, as clearly as it is written, provides the community with clear timeline and milestones that can be measured to assess its progress towards the mentioned goals by anybody who chances on this proposal. But the only thing I feel to be excluded from this proposal is a link or a directive to the main platform (YouTube, website, discord, telegram, etc.) where the mentioned metrics can be measured. Therefore I only agree that this proposal provides me with sufficient information to assess the progress of it towards the said goals.", "q2r": 4, "assessor": "z_assessor_1462", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is an idea to build a Catalyst school in Africa, which can provide Catalyst knowledge as well as Cardano blockchain knowledge to university students, workers, business owners. Helping Catalyst get more proposals from the African community, helping the ecosystem grow as well as Africa. Language barriers, internet connection are the main reasons why there are not really many proposals from Africa. Therefore, the proposal is a perfect fit for the \"Grow Africa, Grow Cardano\" challenge.", "q0r": 4, "q1": "- The tasks that need to be done are listed here, presented in detail so that the CA can evaluate the feasibility. This is a plus for the feasibility of the project.\n- The budget division is clear for the cost of each stated job, it is possible to estimate whether the budget can be afforded or not. => good points\n- The members all have experience participating in Catalyst with many different roles, which will help bring Catalyst to the African community more => good point\n\nHowever, one point I would like to add to the proposal is how it is proposed to include plans for reaching out to business owners or workers. Because I consider these people difficult to reach, a detailed plan is needed.", "q1r": 4, "q2": "Milestones with metrics outlined in the proposal are appropriate for measuring success.\nOne point I would agree more with the proposer if it is possible to add the links to the individual profile pages of each member (linkedin, twitter, github, etc) for voting and advisors community can be easily track and evaluated", "q2r": 3, "assessor": "z_assessor_1394", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "Ce projet de créer une école africaine sur la blockchain cardano est très pertinent. Il permettra au continent de se familliariser avec le système et son fonctionnement. Les africains peuvent eux même aider à améliorer le système en soulevant des problèmes que cardano pourrait résoudre et améliorer considérablement la vie des aficains. Un des principaux problème en Afrique est la traçabilité et la corruption. Le système cardano peut véritablement aider à résoudre ces problèmes.", "q0r": 5, "q1": "Ce projet peut être mis rapidement en place vu le profil des membres de l'équipe qui la composent. Seulement ce projet peut être amélioré en essayant de toucher à terme les administrations qui sont les législateurs et les détenteurs de décision. la bonne compréhension de la puissance de cardano peut permettre une intégration au sein de l'économie.", "q1r": 5, "q2": "Ce projet ne peut pas échouer si le plan est suivi normalement, à mon avis ce projet dois être financé dans le long terme, car plus cardano sera connu et apprécié en Afrique, plus cardano pourrait être adopté et utilisé par tout un continent.", "q2r": 5, "assessor": "z_assessor_1235", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"q0": "The Africa Catalyst School project is an awesome and worth intriguing one that has really caught my attention. The proposed solution as outlined in the proposal is to facilitate and help educate so many Africans on the opportunities that project catalyst provides.\n\nIn the proposal, you will realize that the proposers laid the foundation that \"newcomers to Project Catalyst have experienced the challenge of understanding the entire Cardano and Catalyst framework and how it operates.\"\nTo solve this problem, they proposed that in order to participate effectively in any role whether CA, vCA, Proposer etc. newbies must adopt an intentional approach to navigate the various online platforms and channels of communication and integrate into the community. This I believe is commendable. It will help bring out the best to always assess and participate in the project's activities.\n\nOne aspect that also caught my attention was the fact that Africa’s participation in the Catalyst School’s activities is quite low for a couple of reasons including:\n\n-    Many people in Africa have absolutely no knowledge of Cardano and Catalyst\n\n-    A large francophone community (141 million people and growing) and Arabic speaking community (140 million people) which is largely not engaged\n\n-    People struggle to understand some live and recorded sessions because they are unfamiliar with the spoken accent of presenters (These were from the proposal)\n\nA comprehensive solution is therefore needed to be able to enhance education and empower so many people to do their best in the catalyst environment.", "q0r": 5, "q1": "This project is highly likely to be implemented successfully because there is clear and concrete information about the team in the proposal and it is well detailed. Also, the experiences shared in the proposal also shows the team is well capable to execute the project unto fruition. They have already executed similar projects and have been successful with so much evidence to show.", "q1r": 4, "q2": "Every project success largely depends on how the proposer's work can be audited. From this proposal, one can see that there is adequate information providedto fully audit the progress and success of the first the project when entrusted with the funds. There is also, the milestones provided to evaluate the success of the project which I think is commendable. ", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Provide Africa with a catalyst school to onboard local communities and enhance the impact of Catalyst in the continent.", "experience": "To be organized in collaboration with the main Catalyst School, Wada/Cardano Ambassadors, seasoned CAs, vCAs, funded proposers and mentors"}