{"id": 402528, "author": "shirogat", "title": "Empower 400 marginalized girls", "url": "https://cardano.ideascale.com/a/dtd/402528-48088", "category": 26442, "amount": 15000, "description": "These girls and young women have limited life chances due to forced early marriage, child labor and gender based violence", "f6_no_assessments": 8, "f6_rating": 3.5000000000000004, "videos": [], "media": [], "f6_assessments": [{"id": 405, "q0": "The project aims to assist in the educational development of young girls in regions of Africa where there is little technological infrastructure. Undoubtedly it is a very noble proposal, aiming to create opportunities for more people and also contributing to the development of the region and others around it. Regarding the budget of $15,000, we realized that it is feasible in relation to what we want to accomplish. However, the way the proposal is currently structured, it is not possible to say that the project will succeed in forming this basis so that in the future Cardano's knowledge and technologies can help Africa. Thus, the proposal may not have the expected impact.", "q0r": 3, "q1": "As it is a proposal that will possibly face many barriers, even structural ones, for its implementation, it would be expected that a little more detail would be evidenced in relation to its execution. From what has been said, it is quite evident that the actions to be taken are known, as well as the benefits that they will possibly bring. We realize that the beginning of the problem and where we want to go are well known. The problem seems to be in the middle of the road, exactly in the feasibility. Given the characteristic of being an innovative project and that will change the reality of a certain region, it was expected that there would be some prototypes of materials or of the teaching model that will be adopted. For example, what topics will be covered in digital literacy?\n\nAnother point that was quite confusing was when it was said that one of the goals is to make the project participants obtain functional programming skills. The focus of the project is to create a technology-oriented educational base, so why already target such advanced goals?\n\nBut we should mention that the stages of the feasibility plan are generally organized, as well as the allocation of capital to each of them makes sense. It was also indicated that a large number of professionals mobilized around the project, as well as finding CVs. As a suggestion, then, a possible partnership of this project with other educational projects present in this or in previous funds, which have Africa as their main focus. In this way, some of these problems can be solved, increasing the viability of the project. It would also be interesting to make it clearer that this is a project that aims to promote educational bases, so that in the future, with its implementation, a second stage can be imagined with a clearer introduction of Cardano concepts and technologies and how they can help to change reality in Africa.", "q1r": 2, "q2": "Regarding the ways to measure the success of the project, we were not able to find many details, we observed that the main action carried out each month was explained, but we did not find clear indications of how the proposal would be audited. Some questions to be answered based on the project results could have been raised, such as:\n\nWas it possible to measure student learning through an end-of-term assessment?\n\nWhat was the average grade in this assessment?\n\nHow many students started and how many completed the project?\n\nWe realized that the ideas defined in the project's perception of success are very clear and consistent with everything that was proposed, reaffirming that this is a very noble project with very important goals to impact the continent. The idea is then to try to contact other similar projects so that the points mentioned can perhaps be readjusted.", "q2r": 2, "assessor": "z_assessor_1146", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2598, "q0": "I really do not think this idea solves the problem in the challenge.It clearly does not align with the challenge,I found impact of this idea on cardano rather confusing,if I understood what the proposal aims at achieving,then it is to impact the lives of 400 marginalized girls that is by empowering them, training them, equipping them with skills to function in society.My question then is, how will all the above impact the cardano ecosystem? That answer is clearly not in the proposal. This proposal is more or less like looking for funding to train girls to become digital literates.Well,I have seen cases where training people to become digital literates helps them to discover cardano but in this proposal,I only saw that, gaining functional skills will help the girls increase coding capabilities for the cardano blockchain. What happens next after they increase coding capabilities for the cardano blockchain?, how will it impact the cardano blockchain?, how does it solve the problem in the challenge thus how does it grow cardano? All these answers were not clearly stated in the proposal,I therefore doubt if this proposal has an impact on cardano.", "q0r": 2, "q1": "The team provided us with an individualized description of each member so that we get to know them,but then I did not see previous works of these people, how do these people relate to the cardano ecosystem? Usually in projects,we get one or two people who have some knowledge about our blockchain technologies but I did not see that in the proposal.\nAlso,the funds requested was to me,too much for such a project and how monies were allocated for purposes were not appropriate.. For example, monthly internet connection for schools 1000 and wifi installation for schools 500,to me means the same thing. As such,I see this proposal not feasible enough.", "q1r": 2, "q2": "The delivery dates were not clearly stated and somehow confusing to me. There are also no KPls  stated in this proposal to measure it's success which means the community cannot audit the success of this project if funded. Also since there is no clarity in the solution of the problem and how it aligns to the challenge,I find this project not auditable.", "q2r": 2, "assessor": "z_assessor_1537", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3120, "q0": "The proposal’s objective is relevant to the grow-Africa portion of the challenge, however Cardano is only mentioned twice, and almost seems to be added as an afterthought.  \nCardano is mentioned in relation to teaching some programming skills.  Those skills are said to increase the student’s coding capabilities on Cardano.  \nThe second mention is in regards to making Cardano the blockchain of choice through grassroots Cardano projects like the one in the proposal.  This is confusing as the the proposal doesn’t appear to be a Cardano project.\n\nThere is no detail on how the Cardano block chain would be used to achieve objectives.  Instead it appears the proposal aims to simply use Cardano to finance a non-Cardano endeavour.  Essentially asking for a charitable donation.", "q0r": 2, "q1": "Linkedin urls are provided for all the team members, however none of the members list any Cardano expertise.  \nThere is no explanation of who would be training the students in Cardano-relevant programming.  Therefore, I do not have confidence the Cardano training portion of the proposal would be completed.\n\nThe teams does appear qualified in general information and communications technology, so it is plausible the necessary online platforms can be built, and the necessary technical training of the 20 teacher completed.\n\nThe proposal does not elaborate on what the digital outreach hub actually is.  A website?  A network of people communicating by email?  It is unclear what form this hub takes and therefore how much development it requires.  There is no clear timeline provided on the development of the outreach hub, therefore, it is difficult to guage its feasibility.  \n\nThe budget allocates only $1,000 in total to the 20 teachers as compensation.  This appears well out of balance with the remaining personnel costs of project manager, admin, MoE monitor and programmer totalling $5,000.  Clarification is needed on this point.\n\nNotably the proposal budget breakdown of the 15,000 USD applied for as 15,000 KES (Kenyan Shilling).  It is unclear if the proposal has been planned for in the correct currency.", "q1r": 2, "q2": "A 6 month timeline of activity has been provided under the proposal’s auditability section, but with incorrect dates starting March 2022.  This needs to be updated given we are currently mid March.\n\nIt is unclear whether there will be a final exam or test provided to confirm student’s learning.  This would be a critical metric on the success of the program.  It is mentioned a presentation will be given by the students at graduation, but not whether the presentation quality determines if they graduate.  \n\nThe proposal does not specifically mention the provision of student presentations as evidence, however if the presentations were recorded this would provide some audit evidence.\n\nLikewise the online outreach hub is not mentioned under auditability, but the ability to view this would provide some audit evidence.\n\nMany aspects of the project can only be confirmed by an auditor on the ground e.g. the new wifi installations, teachers involved etc. ", "q2r": 3, "assessor": "z_assessor_1614", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 3490, "q0": "The proposal described the intention of proposer to sow the seedlings of human resources to spread Cardano blockchain in the future. The solution is very detailed with explaining the progress of increasing numbers of users in the grassroot level in long-term. The proposer already mentioned clearly that beneficiaries will benefit from the project not only for their livelihoods but also, improvements of girls’ rights and development of community in future. \nThe project’s goals are aligned with addressing challenge clearly by increasing the coverage of Cardano Blockchain’s choice as well as adoption to rural and remote areas. After the project ends, it was clearly indicated that, Cardano community will be expanded.\nKey metric is breaken down in very detailed, which could be represented for the clear ending picture of the proposer. It will support all stakeholders having clear goals to achieve. \nRisk has not mentioned in detailed in the proposal except a general and brief information. It is better that proposer add more detailed to avoid uncertainties. ", "q0r": 5, "q1": "The project mentioned clearly about tentative necessary human resources for this project and knowledge, skills required to make it happen. Based on this human resource, a clear timeline was developed in the proposal. Milestone is confirmed well for each action and timing and connected to each others. However, timeline is narrowed in just one year, so, the proposer can add more information in long-term to be aligned with challenges. \nOne strong point of the proposal is the detailed breakdown of budget, where all readers can understand easily what proposer want to do, with exact amount of budget. In addition, the allocation of direct cost and indirect cost is quite appropriate, with the ratio of 80:20\n", "q1r": 5, "q2": "In this proposal, the indicators to measure the success of the project were breakdown carefully, to be suitable to each milestone and detailed plan. It showed clearly that the project will be succeed if the tentative indicators could be achieved.   One strong point of this proposal is the indicator is set even for quarter for people and community following up easily. \nThe proposer has not mentioned anything about whether this proposal is a continuation of a previously funded project in Catalyst or an entirely new one. Adding more information on this part will help the proposer more in reaching to different funding. ", "q2r": 4, "assessor": "z_assessor_1655", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 4034, "q0": "Many children and women are still unable to control their lives, they are forced into early marriage, labor exploitation and violence, because of this the proposal aims to create a center for accessing education Digital education for 400 girls in a marginalized Kenyan herder community. In my opinion, the proposal is presented clearly, the proposer specifically mentions the community they target, the main activity of the proposal is that women and children will be equipped with the necessary digital literacy in the next century. . This has brought positive collaborations in the community such as increasing future career opportunities, increasing the cryptographic capabilities of the Cardano blockchain...This also helps Cardano reach more disadvantaged people in the community and turn Cardano into the blockchain of choice in Africa. The proposal mentioned two challenges of the project, lack of electricity, and have been solved with equipment support, However, the challenge of school closures affecting the project's time has not yet been presented by the proposal team.", "q0r": 5, "q1": "The palnning part of this proposal specifies the specific number and target audience in each project plan, such as Laikipia West is the school selected as the pilot site and the number of teachers participating in the project who are trained and sensitized is 20, ... and many other activities have clearly stated the object and the work they will perform. This helps the reader easily visualize the model of the project and how to deploy it. However, I think this proposal should provide more time to make the project and how long each task in the project is implemented for example, the  400 girls and young women writing an animated series Ada and Naisula, how long will it take them to start writing the story and how long will it take them to finish it?. The budget for this project stated is also consistent with the activities carried out. I think the members of the proposal are all doing well in the necessary tasks. For example, the education consultant Anne can help come up with many ideas and content for the training programs to be implemented, or the Teachers who understand well about ICT integration will support people's knowledge. or Dr. Vitor in the field of ICT will help set up and fully configure devices to support learners.", "q1r": 5, "q2": "The project has provided a clear quantitative indicator to track the project's progress. I think if the roadmap section clearly provides the implementation time of each project, it will be easier in this section to determine the progress of the project more accurately, However, these measurement results all correspond to the activities implemented in the project's roadmap. In addition, it also provides the full time of each activity so this section is presented very clearly and intuitively, and easy to follow. As for the goals, the writer has also shown very well each of the goals that they aspire to ", "q2r": 5, "assessor": "z_assessor_1701", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5111, "q0": "Many communities in Africa are marginalized creating a huge gap for support to raise these communities in diverse ways as means of improving standards of living. However, the cultural and societal restrictions placed on women in the African context makes them more marginalized than their male counterparts. For this reason, I strongly agree that this proposal is closely aligned with the challenge. Africa has to grow, and the ability to provide digital education outreach hub for these marginalized girls through the cardona blockchain will not only empower these girls as stated in the proposal but provide the platform to grow Africa.", "q0r": 5, "q1": "The team and their experiences described in the proposal provides enough evidence of their capability to succeed. The plan is well outlined showing clearly how the timelines and how team will arrive at objective. However, it is very important to state that although the team has clearly identified that their major challenge in executing the  plan will be with electricity and connectivity they will also need to appreciate the fact that carrying out a project like these in a marginalized community might have other challenges with issues elating to the beliefs, culture and some societal norms of the people , especially since it involves the girl child.\n\n The budget is well elaborate and I believe the requested amounts is reasonable.", "q1r": 4, "q2": "Auditing the proposal will be very easy since the problem has been clearly stated and the roadmap to achieving objectives is also clearly outlined.", "q2r": 4, "assessor": "z_assessor_1856", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 6475, "q0": "The proposer presents the problem of limited life chances of young girls and women and offers as a solution to create a digital education outreach hub that supports 400 marginalized girls from Kenyan. I believe this is an excellent idea to help Kenyan girls and to expand the use of Cardano in Africa. The proposal is in line with the Grow Africa challenge.", "q0r": 5, "q1": "The proposer identified the members of his team and presented evidence of their experiences relevant to the implementation of the project. The budget was detailed and seems reasonable with the proposed work. The proposal contains a plan that shows what will be done at each stage. The proposer considered the relevant risks for project implementation and presented how he will manage these risks. The proposer offers a realistic timeframe for completion of the project.", "q1r": 5, "q2": "The proposer clearly presents the target problem and its solution. The proposal contains a roadmap with milestones that are important to track the progress of the project. What, in my opinion, was lacking were KPIs to monitor the success of the proposal.", "q2r": 4, "assessor": "z_assessor_429", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 9101, "q0": "Reaching 400 girls and young women is great.  At least there is a target group(students) and teachers. However, the age group of students is not stated. \n\nSecondly, Sustainability of the project is also important so it do not become an event but a continuous project to deepen digital skills. It is imperative to include include a sustainability plan. \n", "q0r": 3, "q1": "The three thematic area mentioned in the proposals are: Early Marriage, Child Labor and Gender Based Violence.\nThese three social/cultural issues, though interconnected are distinct from each other. Addressing these social/cultural challenges are often tackled one after the other. \n\nBoxing all and addressing the three issues at the same time look too ambitious. It is important to consider one out of the three and consciously address that with measured cardano expected outcomes.", "q1r": 2, "q2": "There are lots of activities to address the challenge. However, activities are structured and look promising. \n\nThe total budget is in USD and at budget break down it is in the local currency of Kenya.", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Create a digital education outreach hub that supports 400 marginalized girls from Kenyan pastoralist communities for digital empowerment", "experience": "Education advisor ICT for DFiD girl education challenge program, Kenya Government Ministry of Youth and ICT"}