{"id": 403160, "author": "noach", "title": "Community Driven Volunteering", "url": "https://cardano.ideascale.com/a/dtd/403160-48088", "category": 26442, "amount": 50000, "description": "A large Majority of Current Volunteer programs do not offer help where it is truly needed by locals, we want to change this. and for cheaper", "f6_no_assessments": 6, "f6_rating": 3.222222222222222, "videos": [], "media": [], "f6_assessments": [{"id": 3033, "q0": "This is a great start to a really good idea that's a perfect fit for Cardano. Funding local volunteers to essentially help those to help themselves can work but there needs to be clear ways to verify the volunteers are effective to ensure that a new avenue for corruption on a smaller level isn't created. The plans for how the Daap works is missing. We need more info on how it will all work from start to finish once a volunteer is requested to project completion.", "q0r": 3, "q1": "While it is feasible, more information on accountability and resource supply chain is needed. For a truly working product, good faith isn't enough.", "q1r": 3, "q2": "More than a one time press release is needed for accountability of project progress. Transaction records on chain would help transparency. Also, one pilot trip is not enough to spell success. Success for this project would look more like 6 months of reported exponential growth and positive use after launch.", "q2r": 2, "assessor": "z_assessor_1600", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 3461, "q0": "Proposal has outlined the  background and goals when implementing this project. In addition, the proposer also points out the bad things in those volunteer programs and how this project will deal with those bad problems. However, the proposer has not given much detailed information related to the project, so additional information should be added. The risks that the project may face are also properly stated and solutions are provided.", "q0r": 4, "q1": "The information for two part 'detailed timeline/plan and budget breakdown' is quite strecky. In the first part, proposer just give the outline and general time, but not detailed schedule. Addiational information should be provided such as particular activities in market research. And then, for the second part, proposer should narrow down more, for example, listing detailed spending on developing of app instead of just saying 'estimate around 20,000 USD for development of the app'. The information shown should be clear and exhaustive. In the last part, the profile of team member just give their position but not their educational level or working experience, these information have to be provided.", "q1r": 2, "q2": "Proposer provided a general goal of the project for the voters, but did not provide the standards by which to evaluate that 'product'. In addition, tools to measure the success of the project or the criteria for success are not mentioned in this proposal. Founders should review and supplement such information.", "q2r": 2, "assessor": "z_assessor_1652", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 4035, "q0": "I think any program should change to grow as soon as the old model doesn't work, volunteer programs should be changed soon.  the fact that the current volunteer programs cannot help the local people when they really need it, there is even a situation of corruption happening so this proposal offers a solution to the problem of building peer to peer system. The community they target is indigenous people in Africa with the desire to implement a peer-to-peer model to build relationships and connections with local people who are culturally knowledgeable. and find out who really needs help. It is also possible to rely on local villagers to organize volunteers, generating long-term income for themselves. The risks this proposal is facing are logistics, people who need help live in deplorable conditions, and in order to approach these communities, volunteers are forced to sacrifice their time and finances so not everyone willingly with this. In addition, it is also difficult to keep the number of volunteers at a stable level, if the number of volunteers is less than the real need or the Africans are not qualified to prepare the situation for the volunteers so this will be a huge loss... These are probably quite big reasons so the writer has not mentioned any solutions to the above risks.\n", "q0r": 5, "q1": "The proposer provides two main stages that they will perform: UX/UI development research, market research and logistics planning, phase 2 is choosing a collaboration and conducting advertising. However, I think they should elaborate a bit more about what is involved in each phase, such as providing more clarity on the logistics plan, what it includes, or How is advertising designed and in what form?...., clearly providing specific tasks will also make it easier to budget. About the budget will be spent on developing the application, using advertising, will develop for advertising, or making a scholarship for the pilot program, these are also issues that have been mentioned in the planning section. However, it would be better to be able to provide specific costs in each segment, for example, advertising, what work will be required for advertising, and for each advertising job what fees will have to pay. For the project team members, I think they are capable of completing the project according to the proposed plan because the positions have been clearly divided into each segment and each phase.\n", "q1r": 5, "q2": "In my view the way to measure progress should be more specific eg they claim at the end of the year there will be a fully developed \"Product\" with a set date for the Pilot Program, so what time of the end of the year is it specifically? Also, I haven't seen them mention advertising or finding volunteers. And to make it easier to judge whether a project's goals are feasible, I think they should list specific criteria to determine how a volunteer program meets the goals and standards.\n", "q2r": 5, "assessor": "z_assessor_1701", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 4251, "q0": "It is feasible to discover the proper answer today with a strong strategy and an understanding of the existing status of volunteers in Africa, such as corruption or poor financial management. With the core activity of engaging with native people to find out about regions in need of assistance, volunteer work will undoubtedly become more meaningful and practical. Meanwhile, the project's failure to place a genuine priority on the benefits it provides to Africans, volunteers, and the Cardano ecosystem prevents it from completely realizing its objectives. It is also commendable to highlight the problems that will be encountered, such as living circumstances and the initial amount of volunteers intended. The inclusion of effective and timely solutions, on the other hand, will make the project more persuasive, encouraging participants, especially volunteers and residents, to be willing to follow the plan.", "q0r": 3, "q1": "With the requested fund of $50,000, the budget is divided into bullet points with a reasonable and sufficient purpose. For me, there is nothing to complain about in this section. However, the implementation procedure is provided, but it is mostly comprised of fundamental phases and is rather vague. It would be preferable if the proposer provided explicit steps, such as how they would investigate and build UX/UI based on, or how they will promote a pilot proof of concept volunteer program to make it popular among individuals in this area. Providing a precise strategy not only helps investors envision the working process but also helps the project stay on track. Furthermore, with only two members on the team, the workload will be overburdened, potentially leading to quitting or skipping a step. As a result, my suggestion is that the proposer engages extra staff, such as marketing staff or someone with local language skills, to assist them in communicating and supporting the volunteers' living environment.", "q1r": 3, "q2": "Certain accomplishments highlighted in the plan are perfectly acceptable to me. Receiving comments from the pilot program will undoubtedly aid the project in gaining and improving for the next time. In addition, the global expansion partly helps many volunteers and volunteer receivers to find the most suitable candidates or volunteer locations. Besides, it promotes the Cardano ecosystem to a larger number of users in the future. However, the project's growth and development must be described in greater depth. The fact that only one part is stated makes it difficult for many individuals to agree on and approve the project.", "q2r": 4, "assessor": "z_assessor_1713", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 6476, "q0": "The proposer identified the problem that most of the current volunteer programs do not offer help where it is really needed and presents as a solution a peer-to-peer system plus the hiring of native Africans to manage volunteer programs. This project seems to me to be a great idea to improve voluntary actions in Africa, reaching more people with more needs. The proposer does not clarify if this project will be financially sustainable in the future or if it will depend on more funding from Catalyst. ", "q0r": 4, "q1": "The proposer considered the relevant risks for the successful implementation of the project but did not present how he will manage these risks. The proposer identifies his team members but does not provide evidence of their experiences. The budget has been detailed and seems reasonable. The proposal contains a plan stating what will be done at each stage, but I think this plan could be more detailed. The proposer offers a realistic time frame for completing the work. ", "q1r": 3, "q2": "The proposer clearly presents the target problem and its solution. The proposer presents a roadmap; however, I think it should be more detailed so that we can better understand what will be done at each stage. The proposal does not present KPIs that would be important for monitoring the success of the project. It's a great idea, but more information is needed to assess its auditability.", "q2r": 3, "assessor": "z_assessor_429", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 8859, "q0": "This proposal highlights the problem of the effectiveness of volunteer work in Africa in general when people need their help but the connection is extremely difficult, especially for those who do not. in the most remote and difficult locations. This is also understandable when the volunteer team is not indigenous, not clear about the culture, geography, and real needs of the local people. In addition to communication barriers, operating costs for the administrative apparatus and fund management are weak. This project has identified a part of the problem that needs to be solved for this challenge, but the scale of the impact of the project is large, we can extend it to areas with similar conditions in the world.\n\nThe solution the proposal provides is good, it identifies a few problems of the challenge, the author of the proposal argues logically and creatively. Alternative solution by peer-to-peer implementation, creativity is evident when hiring indigenous peoples to manage volunteers, as no one understands Africa better than the locals, operating costs will lower, efficiency will be higher when the needs of people in the most remote and difficult places are met on time. Also, this work brings long-term income for themselves, which is a sustainable solution. I hope the project is successfully implemented, it will serve as a model for other volunteer programs around the world to follow. I believe this solution will solve the existing problem well.\n\nThe project has mentioned some risks when implementing, that will help the community to manage the risks if it is Funded, it would be better if the author provides a solution to overcome those risks when it happens to arrive. It is very good to list as many risks and challenges that the project will face when implementing it, that will help the project to be implemented on the right schedule and plan. Besides, I have not seen the author suggest solutions for those risk listings, the author please provide some solutions to overcome those risks if it happens. The solution builds a system that provides logistics for volunteers, a solution to verify the conditions and rights as well as the presence of volunteers. The author can refer to the above solutions at https://www.iucn.org/ to see if they are suitable or not?!.", "q0r": 3, "q1": "The project provides unclear timelines for the implementation of the work, which will affect the audit process of the project. The implementation progress of the project needs to be divided into more specific timelines corresponding to the goals to be achieved, the author should divide the progress by week or at least by month, as information from the division project. Quarterly progress will be very general. I'd like to see it re-edited to be more specific if the project is funded.\n\nThe budget is less than 20% of the total budget for this challenge, compared to the information the scheme provides, some of the project expenditures need to be clarified if it is Funded. Authors, please provide more detail on budget details. First $ 20,000 for application development, so what is the name of the application? and on what platform? what data is this estimate based on? 2nd, will the advertising cost be advertised on traditional media or on what online platform? the detailed budget table will be an easy track for a better management community.\n\nThe implementing personnel have been assigned specific jobs, the listed experiences are suitable for the project, but the identity of the members is difficult to verify clearly. A description of the profiles of the team members is quite complete and detailed, but the community needs links to make it easier to identify such as LinkedIn, Twitter, Facebook, ... or any links that have any reputation to promote the transparency of the project higher.", "q1r": 3, "q2": "This project does not provide KPI, the author please provide this to make the project more and more complete. Based on work progress, the project will have to achieve its purpose as a measure of progress, which is a way of showing commitment to KPI from the author team, according to the description, the author has not provided grant these. That will help the transparency of the project be higher.\n\nThe scheme has clearly defined success, they have not been tested in practice, but it is a good idea. Although it has not been tested, the author has also envisioned some success points that the project will achieve such as the success of the trips of foreign volunteers, the happiness of the locals when receiving the rescue. aid. A completely new idea on the Cardano platform never received any funding from Catalyst. This is the first project on Ideascale, I hope to see more of it in the future with the tweaks mentioned.", "q2r": 1, "assessor": "z_assessor_709", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "We will use a peer to peer system and hire native Africans to \"manage\" volunteer programs to places needed most.", "experience": "Avi has started, led and implemented student coalitions of over 17,000 while working towards a degree in Behavior Psychology, with a focus in Human - Technology interaction. Noach comes from a technical background of Phyics and with a deep understanding of Cryptography"}