{"id": 403182, "author": "blueberry1172", "title": "Wildlife Conservation NFTs", "url": "https://cardano.ideascale.com/a/dtd/403182-48088", "category": 26442, "amount": 25000, "description": "Numbers of endangered species continue to rise and no easy way exists to use NFTs to support wildlife conservation in the Cardano ecosystem.", "f6_no_assessments": 17, "f6_rating": 4.2745098039215685, "videos": [], "media": [], "f6_assessments": [{"id": 7448, "q0": "I believe the purpose of this proposal is summed up well in the following excerpt: (create a) “decentralized platform to provide emerging market opportunities for organizations while providing users with a more rewarding and engaging experience to support conservation efforts” . The proposal is about creating a platform with several pools, where people can invest in weekly bets, and part of the profits and fees from each pool will go to non-profit organizations that seek to work for the conservation of the environment. I thought this idea was very smart, because: people wouldn't be betting on these pools just for the environmental cause, of course, once they know about this facet of the process, they can feel even more captivated to participate; however the ultimate goal is to profit. And that is sure to attract a large audience. Therefore, this proposal aims to fund a platform that can be beneficial to the Cardano ecosystem in a number of ways; first of all, once people become users of this platform, they will know about our blockchain, its possibilities and advantages, so the objective of expanding Cardano will be directly contemplated. In the background, this project will certainly have a very positive environmental impact (if everything is correct), because, as I have already explained, the purpose of the thing would still be to make a profit (on the part of the users) and indirectly the environmental organizations will benefit; with such improvement, it is as if they were receiving investments and will be able to develop their activities with more tranquility, fight for the protection of wild life and species at risk of extinction and so on. In other words, the proposal is a great idea and perfectly meets the two main objectives of this challenge, which are to benefit at the same time the Cardano ecosystem, attracting new people to our community, increasing the purchase of Ada, delegation in pools, as more people know Cardano the purchase of CNFTs would certainly grow as well; new digital wallets would be created and likely new people would participate in Catalyst, such as CA, vCA or bidders. And the second objective of the proposal would also be contemplated, which is the benefit of the African continent, whether in the social, economic or environmental sphere (as in this case). Therefore, I think that the proposal deserves maximum marks in terms of impact. \n", "q0r": 5, "q1": "The proposal roadmap is ok, we know which activities would be developed and approximately how long it would take. The problem I encounter here is the lack of specificity. In other words, information is passed on in a very abstract way. The time periods are very long, a bimester is a lot, I would like the activities to be separated at least in monthly intervals. Now talking about the activities themselves, I think they are just mentioned, when the ideal would be that each one explained in detail. For example: “build release team (8-12 people)”. How would this team be chosen? Would it be the people mentioned in the team part right here in the proposal? I counted less than 12 people mentioned, so if you are going to choose other professionals to embark on this project, what would be the selection process? The proponent mentions that they will seek to work in partnership with Wada, a well-established group in the Cardano ecosystem for having launched numerous proposals in the African challenge with the passage of funds. Could the other members be from there? Anyway, I would like each activity to be detailed more precisely. Now let's talk about the financial division, a total amount of 25 thousand dollars is requested, which is a high amount, but compatible with the complexity of the project. The explanation of the need for such an investment is quite rich in detail, as the total amount is divided into some parts (for example, 2500 dollars for legal and administrative part, another 2500 for development resources and so on). Each part of these has a small explanation of what would be done, in this way, it is possible to understand more accurately why such an amount of money is needed for the development of such activities. Therefore, I believe that the script part is very well covered, and the way it is presented to us, we have no doubts about the need for such an amount of investment. Regarding the team, I think this part of the proposal is very good too, we know who the people involved are, their names, areas of expertise and some information about previous experiences. It is very positive that it is such a multidisciplinary team, that is, we have people from different areas of knowledge involved here, and in this way both the technical parts and the design, marketing and etc will be well assured. My only two suggestions regarding this part of the proposal are: the detailing of previous experiences could be more in-depth; ideally, everyone would attach their linkedin profiles, not just a few people. Therefore, I think the feasibility of the project is great, with only a few small points to improve. \n", "q1r": 5, "q2": "Regarding the development of the process, we have some indicators that can say well about the progress of the proposal itself (TVL, total number of users, size of the award and total number of contributions provided) and also about how the project would be reflected in NGOs and on the environment directly (tracking statistics related to climate conservation and endangered species conservation, which will include statistics from the Black Rhino funds directly). This is generally what I advise you to do: a monthly survey of all variables, so that we can understand not only how the activities and work routines of the professionals involved are taking place, but also how partial results are being obtained. However, it is not very clear how this information will reach the members of the Cardano community. How will these reports be shared with everyone? Are they posted on google drive, or on telegram and community discord channels? Regarding the audit of the process, this was the only question that remained pending. Now talking about the final results, the success scenario is outlined with quite specificity, as we can see from the following excerpt: “having a large engaged online community, a fully functional protocol on our platform, several successful project launches in collaboration with our non-profit partners and be able to generate and provide significant funds each month to non-profit organizations. endangered species and climate conservation organizations around the world”. The proponent states that such information must be measured, but again, it is unclear how it will be shared with members of the Cardano community. He says that they would work in partnership with Wada, as I said, and also with the Cardano4Climate group. It would be interesting to establish a dialogue with these two teams in order to understand how they bring the results of their efforts to the community in a practical and direct way. There are several ways to do this, such as video calls in Town Hall, as I said, online sharing through google drive, telegram or discord, in short. I think that the proposal is very auditable, it just needs to be clarified with the community Cardano can actively participate in this auditability. \n", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 8, "ne": 6, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 2553, "q0": "This proposer is trying to solve a never ending cycle of human impact vs climate & animal conservation between the two by utilizing Cardano Non-fungible tokens to fund efforts with non-profit organizations starting in Africa. The solution to the problem can add significant value per volume of the NFT sales portion which would be Cardano based and educating the public on a more serious problem in the world we live in today. Cardano based NFTs are still just a year into their infancy, but the growth potential seen in 2021 really opened the possibilities to entrepreneurs and content creators/artists/businesses that could benefit in more real world applications through sales of NFTs found on the Cardano blockchain and other crypto platforms, and in this case non-profit organizations. The key metrics and goals proposed are that a team of individuals will take on the challenge of growing a community within the Cardano ecosystem that gears it's NFTs sales towards like-minded individuals in congruence with conservation efforts of wildlife, particularly African nations where their is a strong presence building off of the Cardano Africa initiative. The proposer does address the future challenges but not necessarily does the best job of outlining a plan to scale, i.e.: is there a targeted cost to the NFTs creation? What does a Wildlife Conservation NFT look like? and how much will the minting price (ADA holder cost) be for said NFTs? This information would be more helpful to include while also understanding the supply and demand from the community based audience that may or may not be interested in such an endeavor. ", "q0r": 3, "q1": "The proposer shares and provides some evidence to references via website for the project as well as team members with relevant skills and experience via LinkedIn profiles adding the amount of years within their applicable career fields of interest. Besides the members shared, it is not clearly defined what tasks these team members will be in charge of throughout the project's outline or what they're capable of in regards to the solution of the problem. The budget is rather vague in setting aside only $2,500 USD for Development Resources, which will ultimately manage the NFT collection. This number is perhaps too low but without further details to what the non-fungible tokens will consist of (animated or static images, tokens or coins) it's difficult to gauge this amount as (un)realistic. The legal and administrative costs do seem reasonable for ensuring Black Rhino will be a lawful project moving forward. Which brings the largest portion of funding being allocated to Marketing and Promotion (80% of funds requested). This portion dedicated to marketing and promotion is the most ambitious amount, focused on building a social and community presence within the Cardano ecosystem. The proposer states there are three experienced advisors working with the existing team; Having those advisor's experiences referenced within this proposal would allow more indication towards the overall success of the project. With conservation and climate partnerships outlined as part of the first months of progressing through the timeline, will these partnerships be using any of the available funds from this proposal or adding to it? What type of marketing and social media tactics will the funding be used for? The proposer may or may not be aware that building a community can take a massive amount of time and effort, not just funding promotions & marketing. Establishing an online community of this caliber (10k+) with members willing and able to afford or even interested in an NFT is extremely difficult for the most seasoned creators in the space. This may very well be the most challenging given the timeline that's outlined (accelerated?) as the ambitious number could take much longer to acquire. How the proposer plans on doing so is not clearly defined beyond a reasonable doubt.", "q1r": 2, "q2": "Measuring the success and auditability of the proposal, these factors will solely depend on the promotional aspects and the efforts of building a strong community, making partnerships and finding investors within the Cardano ecosystem and NFT communities. Launching of the NFT tokens is a great way to indicate the community interest. With that set to happen between May-June 2022, it may just be too optimistic given the current state of said community interest without a solid following via Twitter or discord, NFT sales are practically no where near a launch-able date. The roadmap could be altered and pushed back if funding was approved which could allow for the proper amount of time for the Marketing and Promotional portion to be used wisely in accordance to solving the problem proposed here, ultimately creating a strong online community for a non-profit NFT sale which will fund conservation of wildlife sanctuaries. A successful launch of Black Rhino project is detailed as continuous real-world impact and contributions towards non-profit endangered species and climate conservation organizations. The proposer has stated these impacts will be measured on the ground through monthly and annual reports tracking data. If the team can deliver a better social presence within the Cardano ecosystem, it could possibly deliver it's solution to the problem while simultaneously helping preserve nature and endangered species throughout utilizing blockchain technology and the ever growing non-fungible token community. ", "q2r": 3, "assessor": "z_assessor_1529", "no_vca": 7, "ne": 5, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 5999, "q0": "This proposal is definitely in line with the challenge setting. The proposers are partnering with African non-profit wildlife conservation groups in order to make an impact on the wildlife conservation crisis. This proposal represents a key cardano use case because the blockchain meets the sustainability goals of the proposers as well as provides a blockchain to host their NFT-related fundraising system. There will be numerous partnerships with different organizations, sanctuaries, parks, zoos, and local communities to help raise funds to benefit the African people. Cardano has the capability to provide a mechanism that can raise funds to not only protect African wildlife, but also help fund communities as well. Creating partnerships with African organizations can also open the doors to onboarding African members into the cardano ecosystem. If they happen to hear about this project, they may become inspired to create their own cardano NFT collection and mechanism to raise funds for their own good causes. One thing to note is that I don’t believe there are currently any African developers on this proposal team, but one of the big components of the challenge setting is onboarding African developers. Would the proposers consider bringing on African developers who have better knowledge of their communities? Onboarding some African developers would make the proposal even more in line with the challenge setting. (score given: 4)", "q0r": 4, "q1": "Given the information provided, I believe that this proposal will be successfully implemented. The proposers all seem to have the necessary skills to successfully complete this proposal. For example, there are members who have multiple years of experience in business development, engineering, product management, and many other relevant fields. The proposers have laid out a well done roadmap. They have broken it up into 2-month chunks with specific goals and plans outlined for each of those periods. The second period seems especially ambitious, given that they hope to raise over $25,000 for wildlife conservation organizations as well as launch 2-3 NFT projects and start a community of over 25,000 people. However, if the proposers are able to work efficiently, they could pull this off in only two months. I would recommend for the proposers to make sure they can get all this work completed in time. With regards to the budget, the proposers have listed the main categories that they will be spending funds on. It is pretty clear where the money will be going. In the future, I would encourage the proposers to include a little more of a breakdown for the $20,000 to marketing and promotions section of the budget since it is such a huge sum of money. For example, providing some examples of campaigns or methods to be used for marketing would have been helpful. (score given: 4)", "q1r": 4, "q2": "Given the information provided, I believe that this proposal can be successfully audited. The proposers have listed easily trackable/reportable metrics that they will share with the cardano community to give updates on the progress of the proposal. For example, their monthly contributions to wildlife organizations, the number of African organization partnerships, and the local impact on wildlife habitat and wildlife populations are all metrics that can be recorded and reported. The proposers also mentioned that their end goal is to majorly impact endangered species, which is something that can definitely be tracked by organizations on the ground. Statistics will be reported in monthly and yearly amounts. Additionally, the metrics related to their NFT projects are a good indicator of success because the higher volume the NFT project has, the more revenue that can be sent to wildlife organizations. I would highly encourage the proposers to maintain good accounting records that can be reported to the cardano community. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 409, "q0": "With the objective of promoting the conservation of the environment and endangered species in Africa using Cardano technologies and being concerned with the impact of each of its steps, we believe that the proposal in question fits perfectly with the goals of the challenge. As we will see later, the project's action front is well defined and ample tools are used to achieve the conservation objective. In this way, it is easy to see the positive impact on Cardano's ecosystem that the success of this project would bring. According to what was mentioned in the proposal, we also see that the actions to be carried out would help to fulfill several SDGs. In relation to the amount requested, $25,000, we see that it is a viable amount given the steps that will be carried out and the professionals that make up the project team.", "q0r": 5, "q1": "A point that contributes considerably to our belief in the feasibility of the project is the constant proximity of the team to the value of the proposal. The explanation of all the steps makes it clear that the objective is to promote environmental conservation and protection of endangered species; but we can also notice that the strategies on how to accomplish this objective are well defined. For example, partnerships with other existing projects operating in Africa, such as WADA, were established, demonstrating that the team understands the magnitude of the problem, and that it is not possible to solve it alone, even with a very complete team. And on that, we can mention that the professionals have great attributes that increase the chances of success of the project, in this context we pay special attention to the fact that the team has a good experience with marketing, and also software development. Additionally, it is possible to find the resumes of the professionals involved through the LinkedIn addresses provided.\n\nRegarding the description of the actions to be carried out, we noticed a good temporal organization of these, with the stages being segmented into quarters throughout the year. It is even nice to note the concern, already in the first quarter, in forming communities on social networks to promote engagement. We also found well-defined targets on the expected value to be captured by the pools over time, which demonstrates a lot of organization. By the way, in relation to pools and protocols, we have that this is a central theme of the project to promote the raising of resources that will be destined to the assisted organizations, and in line with this, in the detailing of the budget, we can see that the greater capital expenditures will be focused on the project's treasury and DeFi product development.\n\nThe project's well-structured website also helps to convey trust and facilitates attracting investments. In it there are good explanations of the cause, including pertinent information about the choice of Cardano technology (among these, it is explained that the energy expenditure is much lower).", "q1r": 5, "q2": "There is great completeness regarding the ways chosen to validate the project, as well as measure the success of its actions. In the feasibility explanation, it is possible to note the establishment of quantitative targets on how much the fund is expected to allocate at different times, for example, in the fourth quarter of 2022, it is expected to raise $50,000 to support conservation organizations. Furthermore, an expected number of members in the online communities was also set, 50K. In addition, a clear understanding of the positive impact of these actions is demonstrated, through what was transmitted in the perception of success. In this regard, we can pay special attention to the fact that the team expects, within 2-3 years, to have contributed to an increase in the number of individuals in the endangered species. With this, we see that there are very well-defined paths to follow the progress of the project.", "q2r": 5, "assessor": "z_assessor_1146", "no_vca": 12, "ne": 4, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 4252, "q0": "With the specific actions outlined, I am rather satisfied with the project's major aims and purposes. When compared to existing conservation financing schemes, what contributors receive in return are virtually entirely souvenirs or spiritual gifts; this is not a bad thing, but it is obviously frequently used, so there is nothing new or interesting. On the opposite, the proposer's offer in this project is to assist bettors in obtaining some of their money back through the aid. It may be not a great deal of money, but it signifies two things: first, bettors are still formally sponsoring non-profit organizations, and second, they gain a different perspective on giving and receiving. Even the suggested solution to the problem has demonstrated to benefit many individuals, including organizations that have always turned their financing around and sponsors who have always had greater access to information via the Cardano ecosystem. Of sure, this will increase Cardano's popularity in the African market. Dealing with predicted risks also makes the project simpler to manage. Working with groups like Pleistocene Parks, Cardano4Climate, and Moss will assist them find the best answer to the carbon reduction challenge.", "q0r": 5, "q1": "The strategy will be put in place beginning in the second quarter, with exact data that convince me that the project's success is entirely conceivable. Starting with the establishment of relationships with several climate conservation organizations and additional endangered species, as well as the launch of Social Media Communities, the project will undoubtedly gain visibility and expand the relationship to support more conservation organizations. Furthermore, stating a figure such as Online Community of 10k+ would assist the entire team to have a clear direction and purpose. The members of the partnership demonstrate that this is a squad with many years of expertise in many professions but a particular connection. In particular, (Professor) — Advisor: Co-Chair & Director of the Sustainable Energy Initiative International Renewable Energy Academy, a prestigious and well-known position, is clearly helping the project's smooth running. What is more, the expense categories and quantities specified are fair. In my opinion, they should have spent a bit more money publicizing the project, but overall I want to commend the team for developing such a brilliant plan.", "q1r": 5, "q2": "Overall, I am pleased with the project's growth and development. By assessing performance in terms of the amount of money they pay in installments, both they and investors will have a more thorough picture of that success. However, it would be preferable if they provided precise data, such as how many partnerships were formed with local communities and organizations. Concerning the success criteria for this project, I appreciate the project's good benefits on the conservation of the living environment as well as endangered creatures. However, because the Cardano ecosystem is being used as a bridge, it is vital to explain the positive consequences on the ecosystem. I hope they can expand on this part.", "q2r": 4, "assessor": "z_assessor_1713", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 8182, "q0": "I can say that this is a great idea for wildlife conservation on the blockchain (specifically the Cardano ecosystem). The solution offered is Black Rhino to build an in-house platform, with NFT integration, allowing users to support wildlife conservation through the Defi Staking Pool protocol. An explicit solution was provided in response to the request of the proposal that specifically described the targeted problem. The NFTs will represent endangered species that are currently vulnerable or threatened under the IUCN. These NFTs will act as membership cards for Black Rhino's 'Early Adopters' and will represent a user's contribution to a specific real-world cause. Purchasing users will also have early access to the Black Rhino Defi protocols, and proceeds from each collection will go directly to non-profit partner organizations. The solution can be learned easily through the link provided by the author https://www.projectblackrhino.com/\nIf this proposal is successfully implemented, it will provide new opportunities for non-profit organizations, reserves, parks, zoos and local communities in Africa to generate alternative revenue streams. as well as support. The proposal also presented challenges and risks during the implementation of the project, and fortunately, he had a great solution to overcome that challenge.", "q0r": 5, "q1": "The required budget for this project is $25,000, which is 10% of the total challenge budget. The proposal carefully outlines what the costs will be used for in an easy-to-understand manner. In my subjective opinion, the requested funding is reasonable. The project team consists of 9 members described very clearly, we can see in detail who they are, where they were founded, previous work and even personal affiliation, for us. a solid basis on the capacity and qualifications of the team to implement the proposal.\nThe proponent provided a step-by-step roadmap as part of this proposal, so I fully agree that the progress and success of this proposal should be easily tracked by the community. References, organizations involved, team members, and knowledge of catalysts and Cardano all represent a high probability for a successful proposal. The proponent also has a foresight about future funding and building a growing community over time.", "q1r": 5, "q2": "The author is interested in plotting the definition of success over time, in a direct way to performing an audit. The success of this project is like having a large online community that can generate and provide significant funding each month to nonprofits and endangered species worldwide. . More importantly, it contributes significantly to increasing populations of endangered species worldwide, as well as to protected habitat ecosystems, reducing poaching, carbon emissions and reducing termites. threats to endangered species in Africa.\nKPIs are also clearly mentioned and we can easily track based on monthly/quarterly author supply. The measure of success will be based on the amount that can be contributed to fund the partner organizations. In other words, the project's progress can be tracked through the information provided in the proposal description, in addition to the aforementioned success metrics. Honestly, besides the feasibility of the project, I hope this proposal will be funded because of its humanitarian significance.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 5715, "q0": "The idea to developing solutions using ADA with environmental view is amazing. I’m from Brazil and I think that this idea could help a lot all the non-profit organizations that tries to help with Amazon. In this current government the Amazon rain forest is facing a massive destruction of its wild life.\n\nIt’s noticeable that the wild life conservation’s subject is highlighted now, creating several opportunities to entrepreneurs which aims to explore this field. Therefore I do think that this is a great project.\n\nIt’s also important to notice that, since these non-profit orgs have people focused in their work inside the institution, they’re dependent of donations, basically. Introducing another method of making some money will certainly help them.\n\nAnother extreme important point is the last topic of the ‘impact’. Showing to the world that using crypto can be a sustainable way of life is quite important when we think about usage and regulations.\n", "q0r": 5, "q1": "I do have some doubts about the feasibility. \n\nThem team seems solid, therefore I have no doubt that you could make it. However, I think the project would gain if there were some more explanations about:\n1)\tIt is not clear to me which type(s) of NFT you’re thinking to use. If you use art NFTs, e.g., it is not clear who are going to produce them, you (I’ve seen that one of you is a graphic designer, however since the volume rises it might not be enough) or the partners. Therefore I think it is important to add some information around this topic. And maybe think about adding several types of NFT, which would increase the amount of transactions (of course it would make necessary to have more partners, but might be good)\n2)\tI would really appreciate if you have added extra information about marketing strategies. Since the majority of the budget asked is to fund the marketing, I would be happy to know where are you planning to use this money (just hiring someone and using some platform, etc.)\n3)\tYou stated that during April and May you’re planning to have 2 partnerships with endangered species and with climate change org. I wonder if you’re already in touch with some or this is just a projection. \n4)\tIt would be good to consider doing a risk map here, such as the fact that maybe there are lots of organizations that are not prepared to establish this kind of partnership.\n5)\tHow are you going to choose the partners? Because, who is going to audit them? I imagine that will only be possible to support those institutions that you have partnership with.\n", "q1r": 3, "q2": "Great KPIs. You could also think in someway to find out if the active participation in the ADA and Catalyst community is growing because of your project. If it runs well, the volume of transactions using the NFTs running in Cardano environment would be huge, hopefully, which would increase the awareness about ADA community. Therefore, there is a chance of increasing the active participation in the community. Maybe adding some survey or compensation if they become active in the community.\n", "q2r": 4, "assessor": "z_assessor_25", "no_vca": 7, "ne": 3, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5165, "q0": "Look at the black rhinos that are being slaughtered for their horns, sold in markets all over the world, especially in Africa, causing them and many other animals to disappear from the face of the earth. Conserving wildlife through Escrow, the NFT is a valuable useful tool to raise awareness and support standard wildlife survival. The challenge here will be able to be solved by building a crypto fund. If it overcomes the problem that governments are asking about the legitimacy of cryptocurrencies, this will solve the part of raising capital in USD, British pound, euro... from other funding sources. at a time when the world is in a recession. This provides an opportunity for local conservation organizations to have an alternative source of revenue. Building the sustainability of the project will ensure a stable and long-term financial source. The Black Rhino solution is very relevant to today's reality.", "q0r": 5, "q1": "Today, wild species belong to an absolutized species, so humans are making efforts with many options to protect them and their habitats. The most difficult is the main account to finance this project. So believe the project will be done successfully. The plan is very detailed, full of information. With consultants with many different professions, a solid foundation for the project will be built.", "q1r": 5, "q2": "The detailed information of the project is enough to evaluate the success of the wildlife conservation project with cryptocurrency investment funds.", "q2r": 5, "assessor": "z_assessor_1872", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 4728, "q0": "The proposal addresses the challenge very effectively and delivers a thorough plan to add in building a platform which enables the user to support wildlife conservation through a Defi staking pool protocol.\nThe team in addressing the challenge is to work in collaboration with a partner organization NFT which will provide users with real world utilities and provide organizations with the opportunities to increase funding for crucial operations.\nThe problem described in this proposal is closely aligned with the challenge, the team solution is aim at using cardano blockchain to build multiple answers to enable users to contribute to NGOs as well as provide access for organizations.\nThe team will also be working with WADA to introduce opportunities in blockchain in order to improve infrastructure and also provide an additional source of income.\nThe proposer solution will provide new opportunities for NGOs, sanctuaries, parks, zoos and local communities in Africa to create alternative source of income. ", "q0r": 4, "q1": "The proposal team seems to be connected to the cardano community and has enough experience on wildlife conservation.\nThe team has collaboration with government organizations, Agencies,  wildlife protection and community relationship are dealt with on a daily basis. The proposer listed a number of challenges they are likely to face but not limited to, project sustainability and overcome the perception of the blockchain technology, maintaining an eco friendly and carbon-neutral experience on the cardano platform.\nThe criticism of the blockchain technology for its impact on the environment and team are working hard to change narrative. the proposer is working to overcome the challenge by building and operating on cardano which aligns with the sustainable goals. ", "q1r": 4, "q2": "The proposer outline successes will be measured through monthly and annual reports tracking statics related to climate conservation and endangers species conservation.\nThe key performance indicators will be measured on monthly and quarterly basis till the project is concluded.\nThe team members are made up of 8 to 12 skillful and experience members. there is a plan timetable for implementation of the project. Also the budget is outline and clearly broken down into identifiable items.", "q2r": 4, "assessor": "z_assessor_1755", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4128, "q0": "The proposal  is aimed at creating an in-house platform, with NFT integration, which enables users to support wildlife conservation. This is contributing to reducing the number of animals on the endangered list. Personally, I think this is a wonderful idea and has great potential to contribute to the development of the Cardano ecosystem in the African market.\nProposers showed the project features and explained very well how the project works. The solution that the project has proposed is also extremely detailed with a deep technical explanation. It will be more convincing if this solution is taken from case studies to explain the features available to the project. But I'm still a bit confused about the audience the project is targeting. Please add a section to specify who the potential audience is and how this project will impact them.\nThe project promises to give expected results in accordance with the key metrics of the challenge. The content clearly shows the results of each stage when the project is completed.\nThe proposal team also predicted that the main challenge faced when implementing the project is sustainability and conservation the perception of the blockchain industry among the community. The proposers have also established steps to solve the above problem. This proves that they have seriously considered the problem and have come up with a suitable solution.", "q0r": 5, "q1": "The management team consists of members with extensive knowledge and experience ready to serve and develop the project. With the skills and knowledge of the management team, the project is believed to grow rapidly and bring positive change to the Cardano community and ecosystem.\nThe project's roadmap is specific to each milestone divided by quarters. The proposers clearly define the positions and the number of people needed to carry out the proposed project. The project has a realistic timeline for completing the given tasks in a logical manner. This is great for the community to track the progress of the project. If possible, explaining in more detail the technical aspects and requirements for each work item when the project is completed will increase the persuasiveness of the project.\nThe project proposed a very detailed budget plan. Budget division among categories is reasonable. Clearly broken and bulleted budgets are used for project development activities. However, I think the proposers should add to the budget plan the part of the pay for the personnel. But in my opinion, this project has enough information needed to prove that the team will achieve the goals set out in the proposal.", "q1r": 5, "q2": "The proposed proposals define the success of the proposal when providing very clear project KPIs and these KPIs perfectly match the key metrics of the required challenge. However, I think there should be specific numbers to support the project's credibility. Investors also easily follow up the success of the project. Visualize specific metrics for each category assuming the project was successful and add it to the proposal.\nBy relying on descriptions of the success that the project promised to achieve, the team took the project very seriously and realistically about the goals of the project. This builds investor confidence and expectations and is likely to attract better investment.", "q2r": 4, "assessor": "z_assessor_1709", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 478, "q0": "The Black Rhino project integrates NFTs in its in-house platform which will make the system of recording safe because of the block chain technology behind NFTs.The integration of NFTs also has the potential to make markets more efficient. Another point worth mentioning is the use of the DeFi Staking Protocol which will allow multiple stakeholders combine measurable resources and this will serve as a good source of funding this project.\nThis project appropriately addresses their challenge of overcoming the perception of block chain industry amongst the conservation community by using Conservation organisations and Sustainability goals.\nFinally, the Black Rhino project seeks to create new opportunities for Non- profit organizations, sanctuaries, parks, zoos and local communities in Africa by helping them generate an alternative source of revenue. This initiative will go a long way to enhance Tourism in Africa.", "q0r": 5, "q1": "The profile, skills and experience of each member is adequately provided.The timeframe allocated to implement this project is reasonable and well defined. Money needed to implement the project was appropriately allocated. The fact that adherence to legal procedures and regulations are taken into consideration in the budget shows the teams willingness to fulfill their legal responsibility hence they can be described as Socially Responsible.\nThe above mentioned points show that the team has the capacity to implement this project. ", "q1r": 4, "q2": "The team provided how KPI’s and Key metrics will be measured.The fact that SDG’s are being embedded shows their continuous commitment toward Sustainability and creation of an Eco Friendly Environment using NFTs.The key metrics and KPI’s chosen are good performance indicators for evaluating the success of this project.", "q2r": 5, "assessor": "z_assessor_1169", "no_vca": 11, "ne": 0, "ng": 9, "nfo": 2, "vca_o": 1}, {"id": 3531, "q0": "This proposal fits the challenge perfectly: it uses blockchain to address a real problem, with the opportunity to act in a worldwide challenge. If successful, this initiative could even be replicated in other parts of the world, as it is easily scalable.\nI can see many benefits in this proposal: the local NGOs benefit with the extra funding, Cardano benefits from being seen as environment-friendly and, of course, the world benefits from having its wildlife protected. \nHowever I think a challenge worth mentioning is tthat it is very difficult to convince people to donate in general, and this would be enhanced by donating through NFTs. Fundraising is alreasy a challenge in itself, so I would like to know more on how the project plans to get the donations. Furthermore, how does this differentiate from normal donations? There is the fact there it would be a carbon-neutral experience, but would this be enough to convince people to donate through NFTs, and not through the usual way?\nThis is somehwat mentioned in the proposal, but I would like to know more about how they intend get around it.", "q0r": 5, "q1": "The fact that the team already has 3 organizations as partners is a good indicative that the project can be successful. The budget seems realistic, but could be a bit more detailed.I would like to know if they are considering a portion of the budget for unexpected expenses or any emergency. I do like how most of the budget is dedicated to marketing, as the project depends heavenly on getting donatios to the organizations.\nI also think that it should be mentioned if they are planning to start working in a specific region or country, as Africa is a very big continent. If not, this focus in one region could help in the beginning of the project.\nThe schedule is very realistic as well and I like how they included some estimates on how many people they want to reach and how much they intend to raise. This is very positive for auditability.\nThe team has a very diverse background and seems capable of executing the project. I do miss someone focused on fundraising, but overall it is a very strong team.", "q1r": 4, "q2": "The metrics chosen are aligned with its purpose and easily measurable. It is very positive that they included both recouring metrics and end-of-the-project metrics.\nI would like to see success from the Cardano perspective, for example, how will they measure how Cardano benefited from the project?", "q2r": 4, "assessor": "z_assessor_1659", "no_vca": 10, "ne": 4, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 3462, "q0": "This is a project related to environmental issues, which have received a lot of attention in recent years. Combining climate or environmental issues with the Cardano exchange is a pretty cool solution. The founder explained quite clearly how it works and the characteristics of the project through the Impact section. Besides, the proposer also mentioned how through this project, the problems will be solved. And risks and how to handle them have also been given.", "q0r": 5, "q1": "The whole team came up with a pretty good work plan, dividing the work into certain time periods to make it easier to track the work in the future. They provide quite complete information about the group members from their educational background and experience. In addition, for the 'a detailed budget breakdown' section, the proposer has also provided a spending table and an explanation for each item, which helps the voter easily imagine how the company solves the problems of spending a lot. than. This is a point worth learning, but the team should still make a more detailed spending plan, like showing how much 'hiring contractors' in the DeFi Product Development section will cost.", "q1r": 5, "q2": "proposer has clearly defined how they will report their work progress to the voters. In addition, providing KPIs/Key Metrics will help people better understand the metrics that the team has identified and plans to set in the future. In short, I feel the group has a pretty clear direction.\n", "q2r": 5, "assessor": "z_assessor_1652", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 3098, "q0": "To stop increasing the number of endangered species, they want to use NFTs to support conservation in the Cardano ecosystem. They want to build a platform that allows them to support conservation through a DeFi strike protocol. The solution will ensure that parks, zoos can create additional income. It's good that sustainability will be taken into account, but I'm still missing the part of how people are going to be convinced to buy an NFT. There are currently a lot of NFTs in circulation, making it difficult to see the trees for the woods.", "q0r": 2, "q1": "This project has already been submitted in fund 7. This team has further developed this project and has further expanded its team to include 3 experienced advisors. There is no one on the team who has a lot of experience. They do have the necessary diplomas to make the project a success. There is a budget allocation. Most of the money goes to marketing. It would be useful to indicate what the objectives are that must be achieved by the campaigns. How will it be checked whether the campaign is a success? The advantage in that project is that the team will be self-financed. The timetable states that there must be a community of more than 10,000 members. I think it's better to put a little more time into building this community. To have a community of more than 50000 in the end can be successful. The difficulty will be to have as many active members as possible. What will happen to the members who are not active. I think there needs to be a larger study of the risks and challenges to be considered first. If during the project there are not enough people in the community, the NFTs will not be successful either.", "q1r": 3, "q2": "A roadmap has been included with the objectives to be achieved in a time span of 4 months. Statistics are included in the proposal. I wonder how you can measure the local impact? How do you measure the endangered population? It would be better to include more targeted factors in the proposal such as number of people in the community. Working with NFTs would make it possible to raise money, but I think the competition between NFTs is too great to make this project a success.", "q2r": 5, "assessor": "z_assessor_1606", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2409, "q0": "As we all know, wildlife is an invaluable asset that nature bestows on humans. However, the number of species has decreased quite a lot, they are in danger of extinction, even some species have become extinct. With the idea of ​​​​the group is. Use NFT to support wildlife conservation in the Cardano ecosystem. I think this is a very good idea. In the proposal, I see the team has raised the issue, which is to build an internal platform, with NFT integration that allows users to support wildlife conservation wild through the Defi Staking Pool protocol. using NFT as a target to protect wildlife. I found the issues the group raised to be relevant to the challenge. It answered the questions in the challenge. I think this project should be scaled up to address future wildlife protection challenges. The solution that the group has outlined, is to protect wildlife by using NFT as a utility tool to raise people's awareness and bring new opportunities for non-profit organizations. , reserves, parks, zoos, and local communities in Africa. I found the solutions the group raised to solve the problems of the challenge. The proposed solutions are also very reasonable, in addition, the group has also raised certain risks that the project may encounter. It is the blockchain industry that is heavily criticized, because of its impact on the environment cause, it consumes so much electricity that as we know electricity is also very precious to humans. Communication constantly calls on people to save electricity, In addition, the group has also suggested a method to solve it reasonably. this increases the persuasiveness of the project to the community", "q0r": 4, "q1": "in the section providing plans and timelines. I see the group has given the expected timeline, which is about two years, and has been broken down into small subcategories, but not exactly, because it may be further than expected. I see with The timeline as stated is also quite reasonable to complete the set tasks, Here I see that the group has stated specific goals, and the results to be achieved, but the project is not easy. Tested, verified, and tracked by the community. With a budget of 10% of the full challenge budget and broken down for each phase I find the breakdowns as stated to be perfectly reasonable it needs to supplement the budget. Regarding the description of bile. However, I see that the group does not have backup plans in c team members, I see that the group has listed nine members, members have been assigned to each group. specific jobs, members all have many years of work experience, have graduated from prestigious universities, especially the members' identities are easily authenticated and easily tracked by the community.", "q1r": 4, "q2": "when asked about the project's measurement and development progress. The group has identified specific measurement indicators in which there are 5 main indicators. as the local effect of quantity. Endangered Species Population Partnership. and Environmental Quality Emissions & Climate Impact Report. besides, the team clearly describes the success of the project as within two or three years, the project will make a significant contribution to economic growth. increasing populations of endangered species worldwide I think this success has a lot to do with the challenges of the campaign, but this project has not yet been run in a field test. This is a project that has been researched and proposed from previous funding sources but has not yet been funded. I see in this fund that the development team is more complete. I hope the team receives a lot of support from the community for the project to be funded and put into practice.", "q2r": 3, "assessor": "z_assessor_1486", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 802, "q0": "Wildlife Conservation NFTs is a pretty good proposal to help the community better understand endangered wildlife species through owning NFTs about those animals. This will help the Cardano community become friendlier and closer to the world through this meaningful act. In addition, the proposal also gives wildlife enthusiasts and lovers the opportunity to do their part to protect these endangered species. The collection of NFTs on these high-risk animals is also very interesting. I am very excited about this.", "q0r": 4, "q1": "With 8 members and 3 experienced advisors, I think you will do a great job with this proposal. I appreciate that you make your personal information public so that the community can verify your experience and skills. This will help the community to understand you better. Also, I also have to say that your persistence in your goals from Fun 7 I appreciate a lot. You also need to address the more challenges and risks of this proposal. Generating NFTs of animals I think is not difficult. Most importantly, how can you inspire your community? In case the community does not know or care about your NFT collection, what will be your solution? I hope that next time you will do better than this.", "q1r": 3, "q2": "I noticed that with the amount of $25,000 you propose to spend a lot on communication and advertising. Need to give more details on how this $20,000 will be spent? The more detailed these expenses are, the more you will demonstrate to the community the transparency and rationality in using the money after being funded. You also need to give more specific numbers on KPIs for example: Through this NFT release, how many NFTs will be released? How many new people will come to the Cardano community through this? After 1 year, how many people will participate?... Concretizing the numbers will help the community better understand and monitor your progress more closely.", "q2r": 2, "assessor": "z_assessor_1213", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 10488, "q0": "The challenge for this proposal which emphasis that numbers of endangered species continue to rise and no easy way exists to use NFTs to support wildlife conservation in the Cardano ecosystem. It is very clear from the proposers that their proposal intends to address the challenge of nature using wildlife conservation NFTs. \n\nOne thing I like about their proposal is the flow of the events, ranging from the problem, their proposed solution, how efficient auditability and the budget they are expected to use.\n\nThe Solution of the proposers which says they will offer to use a Black Rhino approach is an interesting one.  It will afford a way for everyday users to democratically support endangered species and climate conservation efforts in Africa using NFTs. \n\nAlso, their goal effectively addresses the challenge because the use NFTs to provide opportunities in emerging markets for non-profit organizations in Africa is an issue that will go a long way to enlarge the gospel according to cardano and as well as prove users a more rewarding and engaging experience for supporting conservation efforts.\nI therefore think rate them by 5 because the proposal effectively addresses the challenge.\n\n", "q0r": 5, "q1": "One thing I see that runs through the entire proposal is the effectivity and coherent line of action and plans that are well laid out.\n\nIt does appear the team are well prepared from their proposal to execute a great project when given the chance.\nThe team knows, in a very reasonable manner, the type, qualified and required number of team members to execute this project.\n\nThe team from what I have read have a solid team. They have provided links that suggest they are made up of diverse members eg. Computer Science, business development, communications etc\n\nTheir plan to Establish two Partnerships with Endangered Species + Climate Conservation Organizations is also a commendable one since working on this project without the support of the relevant stakeholders will not be a good one or even a success.\n\nTheir timelines are also well on point except beyond 2022 as part off their goals they state, \"Successfully Establish an Online Community of 25k+\"\nIf they could give a clear picture of how they were going to do this it would have been nice so as to avoid ambiguity.\n\nThe team also provided a satisfying budget with detailed amounts for each of their activities within the timeline. This is well presented.\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "q1r": 4, "q2": "The proposers did a good job by submitting a clear cut proposal that indicates the timelines they intend to execute the proposal when given funding.\nThe inclusion of the backgrounds of the entire team members is also a good one since it will help to check the backgrounds of each of the members and their qualifications. The provisions of the linked addresses of the team members is also worth commending.\n\nI was however looking forward to read if the proposers have ever worked either together or individually on a similar project.\n\nThe KPIs provided were also solid and straight to the point since it will help in assessing the progress and success of the challenge. I therefore think that the proposers did a great job hence my decision to rate them 4.\n\n", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Build an in-house platform, with NFT integration, which enables users to support wildlife conservation through a DeFi Staking Pool protocol.", "experience": "Our core team is comprised of 8 members, and 3 advisors. We all share 2 passions: Conservation and Technology. Combined our team has 25+ years of programming experience, 5+ years of experience in Wildlife Conservation, and 8+ years of Marketing & Business Development experience."}