{"id": 403603, "author": "deanemru", "title": "Sustainable Energy For All Africa", "url": "https://cardano.ideascale.com/a/dtd/403603-48088", "category": 26442, "amount": 99000, "description": "There is an urgent need for clean energy; our new hydro power system will be an evolution for energy generation and prosperity for Africa", "f6_no_assessments": 6, "f6_rating": 2.611111111111111, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal’s objective to increase green electricity generation in AFrica is relevant to the grow-Africa portion of the challenge, however Cardano is never mentioned and is given no part to play in the proposal.  Therefore the proposal does not meet the Cardano requirement of the challenge - adding no value to Cardano.\n\nThe use of the name “Tesla” should also be clarified to avoid confusion.  The question should be answered plainly - Does this project have any relation with Elon Musk’s Tesla?", "q0r": 2, "q1": "I strongly disagree this project is feasible for the following reasons.\n\nThe proposal gives no information about the team, size,  nor provide any track record of expertise or accomplishments.  Detail needs to be provided about the team in order to evaluate their ability to meet their goals. \n\nThe video provided in relation to the proposal is a CGI portrayal of what an electricity generation structure on a river would look like, but provides no information on the basic principles of how they aim to generate electricity.  The video provides no assurance of the team’s knowledge on electricity generation. \n\nThe project’s website states “True Tesla Technologies will install the first pre-production hydropower generation system by mid-2020” in Mauritius, but provides no evidence of accomplishing this despite that being nearly 2 years ago.  There is no evidence provided of any work completed in Mauritious.\n\nThe appropriateness of spending cannot be evaluated given the proposal’s lack of budget information.\nThe proposal mentions that operational costs are 9000 USD per month, but provides no budget on how the funds would be spent.  It is important to provide a specific breakdown on spending e.g. wages, materials, compliance costs, surveying etc.  \n\nNote that the proposal says its technology costs a similar amount to comparable technologies but lasts 2-3x longer, but fails to provide evidence for such a considerable claim.", "q1r": 1, "q2": "The proposal does provide a basic roadmap including the implementation of a working electricity generation system online in Mauritius by May 2022, and a completed survey of a location for a similar plant in Madagascar by March 2023.  However, no detailed KPI’s are provided.  No information is provided on the stages of construction of the facility.  Insufficient information is provided to enable adequate assessment of the proposal’s progress.\n\nThe roadmap itself appears unreasonable.  It seems very unlikely the facility could be built and operational right at the beginning of the budgeted period (May 2022) given the size of the construction works required as evidenced in the CGI video in the proposal.  \nThe remainder of the budget period is filled with comparatively insignificant events “inauguration” of the facility July 2022, “Conference on Tesla's Technology for Africa” Dec 2022 and surveying a site in Madagascar March 2023.  ", "q2r": 2, "assessor": "z_assessor_1614", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Proposal has provided quite detailed information related to the project. First, the proposer also raised the problem that the people of Africa are facing and then introduced his solution. However, the proposer can clarify 'avert situations that are current on the River Nile' so that voters can better understand the problem. Proposer introduced the solution in quite detail when introducing the features, functions, and strengths of the solution. In addition, the publisher has clearly stated the positive effects of the solution on the lives of African people. Proposer also thought about the risk that the project might face and provided a solution for that. This will help reduce the risk to the project. ", "q0r": 5, "q1": "An outline for the project steps has been given, but voters want a specific and detailed plan. Proposer should add more specific steps to the proposal, for example sharing more steps to implement Mauritius system online and delivering energy. Providing a detailed plan helps people better visualize the project steps and thereby have more confidence in the project. The information for the budget section is too sketchy, the proposer should list additional monthly expenses for the expansion to Africa instead of just giving the cost without providing the name of the expense. Moreover, the information of the project members is not clear. Proposer should add additional information such as the members' names along with their education and work experience so that people can easily find out.", "q1r": 2, "q2": "Proposal just shows what the team will do but has not been able to specify that. For example, the team says it will provide specific data and results about potentials, but has not provided information on what the data is, the criteria to evaluate that data or the tools to do so. The information is still quite vague and not clear. Proposer may consider giving expected numbers when the project is successful so that voters can better understand the destination of the project.", "q2r": 2, "assessor": "z_assessor_1652", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "First of all, I want to give my thoughts on the overall content of this proposal. The idea of developing the Hydro Power Plant (HPP) and expanding the river network in Africa is a big idea and makes a lot of sense, to be honest. And your project has fit in the GROW AFRICA side of the challenge, but what about the GROW CARDANO side? What I received after reading this proposal was just a desire to promote the development of Africa, but I did not see any explanation regarding how this project will have an impact on the Cardano ecosystem. As for the part Impact introduced to the project, I have nothing to comment on. The proposal is made very well because of the wording and providing information. I can feel your big dream for Africa's prosperity. But keep in mind that this project needs to be linked to the challenge, and it's a shame that I haven't seen that yet. I regret to give this part 3 points.", "q0r": 3, "q1": "At this point, I will not consider whether your project aligns with the challenge anymore but only evaluates the content and presentation. But unfortunately, you cannot convince me. There are many vague things in the plan, budget, and the team members' introduction of your proposal. You only mentioned the system in Mauritius once in the Impact part and didn't even say what it was like but put it right in the detailed plan with a specific timeline. Furthermore, what activities does the $9000 you suggest for the project budget be spent on? And most importantly, how can investors believe in the success of a project where the names of the two scientists involved are unknown? Please consider adding more information to this part to clarify the project’s feasibility.", "q1r": 3, "q2": "There are no KPIs, no specific metrics, no clear goals, and no detailed roadmap to track. This last part does not seem to provide any necessary information. Besides the word \"will\" that you use, is there anything else that can build investor confidence? Do you want success to be encapsulated in the word \"understanding\"? You say you will provide a valuable overview of the way forward, but even if this project can make it to that step, I don't dare believe it anymore.", "q2r": 2, "assessor": "z_assessor_1666", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Undoubtedly, Africa today, no matter how developed, continues to exist apart from the rest of the globe, with very slow and dismal development. As a result, generating power from the river in Africa is a rather safe choice. It can be observed that, in addition to supplying power to consumers, the project also helps residents in the surrounding area with their agriculture. This is fantastic news for the inhabitants of this area. Unfortunately, I couldn't uncover any connection between the project with the Cardano community. As a result, it is difficult to demonstrate how it would affect the Cardano ecosystem, which might easily lead to the project being rejected. Furthermore, the proposer stated that the relationship with Mauritius would fix the problem but did not specify how. The project has a very nice goal and function, but without such essential ideas, I will give the proposal a 3 out of 5.", "q0r": 3, "q1": "Overall, I'm with the approach and schedule outlined in the proposal. They provide explicit deadlines for fulfilling each minor objective, which is likewise fairly feasible. However, in the case of the aforementioned budget, the reverse is true. Instead of just mentioning $9,000, they should produce a list of what needs to be spent and how much it should cost. Failure to identify such will make it difficult for investors and proposers to evaluate the project's success and determine whether such monies are appropriate for operations. Furthermore, they have Pr2 scientists on staff but do not identify them or provide information about their name, experience, certifications, or qualifications in the project. This can easily lead to difficulties recognizing the persons participating in the project, how much work they put in, and they will miss out on the opportunity to be commended if the initiative is successful in the future.", "q1r": 3, "q2": "My suggestions for this part will assist the proposer in noting some things and adding more. To begin with, there is no set time limit for completing each project task. It's simple to miss the deadline, it's possible to get overburdened with work if it's completed ahead of schedule, and it's easy to fall behind since it's not completed on time; these are the major hazards of not having this exact timescale. Further, the proposer should offer detailed information on the persons or households that will be able to utilize it when the first hydroelectric dam is constructed. This will demonstrate the team's resolve while also assisting investors in keeping a close check on it. Specifically, I have yet to discover the possibilities that it will offer to the Cardano ecosystem in the near or far future. This is a major flaw in this project.", "q2r": 2, "assessor": "z_assessor_1713", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "There is the growing demand for a sustainable hydro power system in the entire African continent. The proposal entirely meets the challenge as it intends to provide the solutions to Africa electricity challenges. The proposed project when successfully implemented will bring more relief to most African rural communities and the cardano ecosystem  will be spread through blockchains across numerous Africa country.", "q0r": 4, "q1": "There is a detailed plan by the team to implement the project within one calendar year from may 2022 to march 2023. however the team is unable to present enough materials facts about how the project will be implement, the team did not mention their names and their technical experiences to implement the work. The team has also failed to provide references, links and web sites where work progress can be trucked and access.  It would have been very important and good if the team has provided detailed information of the above points listed.", "q1r": 3, "q2": "There are some information provided by the team about auditability however the information is not rich enough. The budget proposed is too voluminous and need to be broken down and itemize.\ni believe the proposer can help by given a break down on the budget and provide other relevant information on the project.", "q2r": 3, "assessor": "z_assessor_1755", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The problem statement is clear and realistic. However, the solution to the problem is not well defined. The development of hydro systems whether large scale or small scale requires a larger period for analysis and development, which the proposal did not capture. Of course, energy generation for regions without electricity is a good initiative, but there is no utilization of Cardano tech and no correlation to how the Cardano Ecosystem is going to be further developed. Again, the risks assessed by the proposal are not well defined; energy generation from hydropower entails greater risk than that identified.", "q0r": 3, "q1": "To begin with, I believe as an energy engineer myself, for the construction of hydropower systems, a variety of engineers ranging from mechanical through to civil engineers are required for the construction of hydropower systems. However, from the team members provided from the proposal, there were no such engineers needed to bring the proposal to fruition. The link provided to shed more light on the ability of the project to actualize did not provide any of such information. The poor budget allocation fails to illustrate clearly how the amount is going to spend for the proposal: the absence of a stated time frame for the completion of the project makes the proposal unfeasible.", "q1r": 2, "q2": "Although the problem statement has been clearly outlined, the steps and procedures that are to be enacted to bring the project into fulfillment were not well defined. The proposal began by identifying the poor energy situation of the continent and went further to state that the construction of hydropower systems will be able to curb the issue. However, the detailed processes to be taken to bring the project to light were not outlined. There was no actual key performance indicator and the stated metrics to define the success of the proposal are not stated clearly.", "q2r": 2, "assessor": "z_assessor_1989", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Our new technology can be quickly deployed in the field and constructed by local communities overseen by our mobile support team.", "experience": "We have technology, a team and the wisdom to deliver energy solutions. Our pilot project in Mauritius will be the launch pad for commercialisation in Indian Ocean and Africa. We're ready to share the technology with others in Africa to achieve these goals via PPP."}