{"id": 404103, "author": "natnael", "title": "Cardano University Seminar", "url": "https://cardano.ideascale.com/a/dtd/404103-48088", "category": 26442, "amount": 9000, "description": "The young Ethiopian community is missing out on the early introduction of Cardano Blockchain System and its opportunities.", "f6_no_assessments": 7, "f6_rating": 3.7142857142857144, "videos": [], "media": [], "f6_assessments": [{"id": 806, "q0": "The organization of Cardano University Seminar at 6 leading Ethiopian universities such as AAiT, AASTU, MU, DBU, DDU, HU is a proposal that makes a lot of sense. If this proposal succeeds, it will help to spread blockchain knowledge to the students of these universities faster. In particular, it also helps students of these schools have a deeper understanding of the Cardano ecosystem, thereby seeding the talents who can participate to develop the Cardano ecosystem in the near future. It can be said that this is a very good proposal and completely suitable for the challenge posed.", "q0r": 4, "q1": "I believe that with the experience of organizing similar seminars at universities for big brands like Coca-cola, Unilever, etc., you will do well in this proposal. However, unfortunately the community did not find any other information about you or your team to be able to prove what you have given is true. I think it will be better next time you can give links to your and your team members' experiences and skills through giving to the Linkedin community, Twitter, Facebook, Telegram,… or Anything that helps the community get to know you and your team better. In addition, you also need to include the possible risks that make this proposal unsuccessful. For example: If for some reason you cannot organize outdoor sessions, do you plan to organize online sessions to bring knowledge about blockchain, Cardano to students of these universities? What is your solution in this case? In case there are too few students interested, what will you do? There are too many people involved, how would you handle this? I believe that if you come up with a solution to these problems, it will help the community appreciate you more.", "q1r": 2, "q2": "You also need to come up with more specific, easy-to-measure numbers about the goals you'll achieve. Example: How many schools will agree to participate in your proposal? How many students will participate in each specific session at each school? How many students are needed to join the Cardano ecosystem? How many people will develop their careers on Catalyst?... The numbers you put out will help the community be more willing to support you. I hope that next time you will do better.", "q2r": 2, "assessor": "z_assessor_1213", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 2442, "q0": "Increasing Cardano knowledge and awareness across Africa is the basic goal of the ‘Grow Africa, Grow Cardano challenge’. This proposal asserts that the young Ethiopian community is missing out on the early introduction of the Cardano Blockchain System and its opportunities, so the proposer proposes to hold seminars and workshops on university campuses that will allow blockchain to be adopted as part of the university curriculum. The workshops and seminars are intended to give an introduction to blockchain technology as well as a guide on how project catalyst works, with the goal of forging partnerships among attendees in order to address real-world problems that are encountered in our daily lives. This leads to considerable growth in Ethiopia, as the educated population learns about the relevance of blockchain and what they can accomplish with Cardano blockchain, increasing Cardano awareness and contributing to the objective of making Cardano a preferred blockchain.", "q0r": 5, "q1": "The proposer provides evidence of relevant skills and experience needed to implement the proposal. The proposer failed to indicate the type and number of team members but however indicated their relevant skills required to implement the proposal. The proposer has outlined a budget that is broken down and quite reasonable to achieve the set goals. The proposal offers a realistic timetable to complete the work, considers challenges and risks relevant to a successful implementation and provides possible solution to them.", "q1r": 5, "q2": "Given the well-developed content from the impact and feasibility categories, the proposal provides me with adequate information to audit and evaluate the project's progress toward its stated goals, as it elaborates the implementation methods and success measurement metrics.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 12, "ne": 0, "ng": 7, "nfo": 5, "vca_o": 1}, {"id": 2690, "q0": "The proposal if implemented will expose a lot of African students to the various blockchain opportunities on cardano \nThe targeted group will be very effective in learning and transferring knowledge to other youth groups, this will make cardano blockchain  ", "q0r": 4, "q1": "The proposal  may receive a lot of set back due to accreditation and certification of Cardano blockchain by academic board of Ethiopia hence may not be allowed to be introduced as course in the curriculum of public university. \nResources personnel's may not be expert of cardano hence will need further training.  ", "q1r": 3, "q2": "I agree that attendance list from both students and interested institutions, compared to students joining the local cardano community is enough evidence for auditing the growing interest for cardano in Africa.", "q2r": 4, "assessor": "z_assessor_1554", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 3054, "q0": "The proposal aligns with the challenge and finds possible solutions how to create the awareness of people about cardano and I find that brilliant, the plan this proposal seeks to employ in worth commending, this proposal seeks to organize Programmes or workshops targeting university students in Ethiopia. This proposal actually fits in the challenge and would of course bring value to the cardano ecosystem in the sense that this proposal seeks to bring onboard a mass number of people through workshops and if this proposal is able to achieve this then we would be talking about a large number of people coming to be in the know of what cardano is and hence adds value to cardano. \nI will like the commend the team for stating the challenges that they would be confronted with, it prepares the team to take necessary steps to find solutions to these challenges. The proposal is good and has higher hope in the future to the cardano ecosystem. ", "q0r": 4, "q1": "I am not satisfied with the fact that the team has not provided their names in the proposal atleast a very good proposal should not be lacking this, I don’t also see any link about the team since this is also seen as a feature for a good proposal, the team should take note of this for their next proposals. \nExperience stated show that the team would be up to the task and well prepared to execute the project . \nThe budget is well explained and broken down into smaller parts for understanding and I really appreciate that, this is what shouldn’t be lacking in a good proposal and I appreciate the fact that this team has been able to include this . So this budget is reasonable . ", "q1r": 4, "q2": "The roadmap , milestone and time horizon are well stated and I appreciate that. \nThe inclusion of the key metrics that defines success in this proposal has also been well stated and that makes this laudable. \nI have the believe and hope that if this proposal is funded it would bring value to the cardano ecosystem, this project would be executed successfully with the background information provided. ", "q2r": 4, "assessor": "z_assessor_1603", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5951, "q0": "The proposer has identified a problem and a solution to the problem, and it seems to fit well in the Challenge brief and also to add some value to the Cardano ecosystem. However it is unclear who is the primary target audience (the curriculum in the Universities covers a lot of domains) and if the topic will be about blockchain technology, generally, or/and about Cardano ecosystem in particularly. The proposer should define the topics which will be discussed at the seminars thus making it more clear (how about Decentralized Identity, cryptocurrency or any other related topics?) to the audience.", "q0r": 4, "q1": "The proposer should provide relevant traits about the needed experience for implementing the project (social media link, past successfully implemented project etc.). Also it is unclear what is the speakers' status (are they from academic corpus or do they have something in common with Cardano and/or blockchain technology?).\n\nThe budget is broken down into identifiable items and seems reasonable to achieve the project goals, but some of them are not well presented (what is the meaning of \"Contingency\"?) There is a timeline with achievable milestones presented but probably it needs rephrasing as the first seminar will be held in June just before the exam session and/or summer break and, thus meaning the next one has to be postponed in September (probably) or later.", "q1r": 3, "q2": "The proposer should define relevant KPI/metrics to measure the success of the project. It is necessary to attract people to join the seminar but is relevant how many of them will be retained. As it is, the proposal needs some fine tuning to stand a chance for getting funded.", "q2r": 3, "assessor": "z_assessor_309", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 8961, "q0": "In my opinin, this is a good idea, it’s about to host workshops and seminars on university campuses in order to bring knowledge about Cardano blockchain system to students in Ethiopia. The proposal’s problem is clearly within the challenge “continue to seed and grow Cardano in Africa country in 2022”. The proposal also clearly articulates how it will add value to the Cardano system: Bring knowledge about Cardano to the youth is the key to create a human resource potential for the growth of Cardano ecosystem. I found interesting with the proposer’s vision: he/she seizes the opportunity to propose this idea when seeing the changing rapidly of the academic curriculum in Ethiopia universities to catch up the growth rate of education in the world, and the available of workshops in campuses recently. I also agree that students who are in university are always the best choice for the seminars because they have basic academic knowledge and the “hunger for new technology” spirit to be interested in Cardano blockchain system. Additionally, the proposal is able to scale to address future challenge: if success it will be a good foundation for projects in future.", "q0r": 5, "q1": "The author describes pretty detailed about experience and skills relevant to conducting the proposal. The plan and timeline are understandable clear with the fair budget which broken down quite detailed, helps us easy to see what the fund is asking for. In addition, the author have a good vision about the challenge/risks he/she will face when executing the proposal, and I believe the author can deliver the solution to solve it. Moreover, the team that is required to complete the project is also explained about their experience and skills needed and suitable for the work in plan. However, it would be greater if the author could make two things more clear: the content of seminars in details and the information of the team. I believe what we bring to students now, will inspire them to join Cardano community later, and raise the meaningful participation into Cardano ecosystem and Catalyst project in future, it is one of the key to the success of the project. Additionally, it’s always benefical to know about the information of each member of the proposal’s team: who they are, their names, their fields of work, examples of previous work, ect. I believe making all of  them clear will raise the trust from readers.", "q1r": 4, "q2": "In my opinion, the aubitability of the project is pretty simple. The proposer describes what success look like in details, that give us the necessary content to establish tracking. We can audit the proposal based on the information provided in the detailed plan. About the results, it is possible to monitor them through the section \" What does success for this project look like? \". Or I can say, the proposer provides us with enough material to understand what would happen, how it would happen, in which order and what final products.", "q2r": 5, "assessor": "z_assessor_714", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9110, "q0": "The proposal is addressing the gap in digital education and the potential of reaching active and academic youths who are looking for alternatives and innovation to diversify and scale up. It is important to some extent, measure how many of these students would demonstrate understanding and application of knowledge of cardano blockchain to solve problems.\n\nI see the proposal is interested in introducing cardano and blockchain to students for the first time and such education is done in a mammoth gathering and seems this can be achieved ", "q0r": 4, "q1": "\nThe project is purpose driven but looking at the experience and the number and kind of campus events to organize in 6 universities across Ethiopia, one person may not be able to handle this. The experience shared is also not enough in details to ascertain what exactly you intend to do. Past experiences with links of carrying out similar projects could have been more appropriate and at least a demonstration of having knowledge in blochchain as the campaign leader should have been detailed.  \n\nThe budget amount is quite realistic but should have included media coverage for wider reach. This will allow many others to read success stories online.\n\nThe could be 2 to 4 team members playing specific roles for success of the project.", "q1r": 2, "q2": "The proposal has simple indicators to measure success as seen in previous proposals as well. A monthly report after each event is important and media coverages are key in this regard.\n\nThere could be a written monthly plan for each event on how to go about it. This will guide for auditing of each monthly event. I do not see this proposal has the characteristics for auditability.  ", "q2r": 2, "assessor": "z_assessor_719", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Seminars and workshops held on university campuses will open the chance for blockchain to be adopted as part of the university curriculum", "experience": "I have run projects with major brands (like Coca-Cola, Unilever, etc.) in different universities.I have organized panel discussions, seminars, and workshops.I work as a community manager.I have worked in a youth lead organization for the past five years."}