{"id": 404268, "author": "babaelliot", "title": "CATALYST RESOURCE IN SWAHILI", "url": "https://cardano.ideascale.com/a/dtd/404268-48088", "category": 26442, "amount": 5000, "description": "150 million Swahili speakers in the East Africa region don't have access to education and resources which will lift their standard of living", "f6_no_assessments": 12, "f6_rating": 4.138888888888889, "videos": [], "media": [], "f6_assessments": [{"id": 513, "q0": "This is a proposal to translate about some Cardano and Catalyst Resources into Swahili. In terms of meeting Challenge metrics, providing more resources in an important African languages is a good fit. What is missing from this proposal is more clarity about WHAT resources they will be translating --they give some examples, but not even a definite plan about how many of what kinds of resource, just that the overall all number of Swahili \"things\" will total 50. These might be articles \"such as those at Cardano.org\", Videos, Podcasts (which they say they will publish on youTube, so I'm not sure if the videos and podcasts are the same thing, or what the plan is for them. \nI am able to see some evidence of their work at educhainment.com , which looks interesting, but the other links shared are broken or blocked.\nI would not expect to see a comprehensive list of every resource they plan to translate, but a little more detail would give me hope that they have a solid direction, vision, and plan. Just pointing to a primary Cardano website and saying \"Stuff like that\" doesn't inspire me that they have a plan for maximum impact for their work.\nI wish to see more work being doing with Swahili translation, so I hope this team has the opportunity to do the work they want to do. If applying again in future funds, I would like to see more plan and vision for what materials you will be providing, who will be creating them, and what are your overall goals as a team.", "q0r": 3, "q1": "Their budget is either 5k or 6k. Either way, this seems like a reasonable budget for translating 50 \"Things\", given what I know about cost of living in east Africa. But -- which is it? The proposal requests 5K, but the budget is for 6K. I have no wish to penalize anyone for a typo, but since asking for money is at the heart of what we are doing here, it's definitely a problem that the budget and the funding request are off by 20%. Furthermore, and unfortunately, I don't think the budget accounts for everything. They mention creating a website \"with articles covering current Cardano-related news, .....\" but there is no clear budget for creating or hosting such a website. Futhermore, it remains unclear exactly what all these resources are -- if they are just farmed from different websites around the ecosystem, then ok, but even researching and identifying WHAT news and resources to translate is a certain type of work, and I don't see this in the budget. \nTo improve this proposal, I would like to see more details of what you are going to translate, where the original content is being sourced from, a budget that accounts for everything that needs to be done, and accurate alignment of the budget and the funding request.", "q1r": 2, "q2": "Generally speaking, this proposal aims to translate 50 \"Things\" -- articles, videos, podcasts, and/or \"resources\". They have left it pretty open-ended what those things will be, but at the end of the day, if they can point to 50 \"things\", this project would be pretty auditable.\nI would prefer to see some inclusion of metrics around marketing and reception of these materials. Content is only worth something if actual humans see it. Ideas for improving auditability could include website views, SEO efforts, YouTube Subscribers, etc.", "q2r": 4, "assessor": "z_assessor_1180", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2444, "q0": "The 'Grow Africa, Grow Cardano' challenge seeks to expand Cardano awareness and knowledge into Africa. Indigenes of Africa speak more languages that English which is poplar in the cardano community. However, many resources are available in English, which automatically excludes the other communities who do not speak English. Expanding awareness to make Cardano the blockchain of choice in Africa by 2023 requires that there is access to education and resources in most of the notable languages in Afriaca including Swahili. This proposal seeks to Collaborate with catalyst school to translate and provide education on Cardano and catalyst resources in Swahili language. The proposal aims to work towards making Cardano Community much more available and approachable by creating diversity of Swahili Language Catalyst and Cardano resources and building a communication channel for all of Non-English speakers who are available in the East African Region and are speaking Swahili Language. This proposal adequately addresses the challenge.", "q0r": 5, "q1": "The proposer is an Active participant and contributor to catalyst community and has the necessary abilities to carry out the plan. The proposer has indicated the team members needed to carry out the plan. The proposal also includes a realistic timeframe for completing the work, as well as a clear and actionable implementation strategy that demonstrates what is being done and how it is being done. The proposer indicated that there were currently no challenges because the team had started implementing the plan and that the team was ready to continue. I believe there could be some challenges regardless of the current situations especially when a lot of Swahili speakers do not have the needed education.  However, problem solution listed has a high chance being implemented successfully.", "q1r": 5, "q2": "The proposal has a roadmap with milestones and a time horizon for achievement as well as Metrics/KPIs that define the success of the proposal however the proposer could further discuss how progress will be measured and the development of the project: not just about creating the resources but measuring interactions as well. The proposal includes a clear explanation of the targeted problem, as well as specific solutions that solves the problem in a comparable manner. This proposal can be audited successfully.\n", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 11, "ne": 0, "ng": 8, "nfo": 3, "vca_o": 1}, {"id": 3330, "q0": "The proposal indicates and addresses a problem in the challenge that it seeks to resolve. Trying to provide materials in Swahili is great because of the number of people that could benefit from theses resources, It breaks the language barrier in these areas.", "q0r": 5, "q1": "Since this is pretty much a continuation of an already existing project, it is fair to say that implementation  would be quite smooth because major steps have already been taken. The people involved already have experience from the existing proposal which is another advantage for the implementation of this proposal.", "q1r": 5, "q2": "The financial information provided is quite straightforward making auditability in the regard pretty simple but there are not enough and comprehensive KSIs that can be used as standards to measure the progress of the proposal if implemented other than the normal translation of material. There should be some standards that indicates how theses translated materials are improving the awareness and knowledge of cardano in these regions.", "q2r": 3, "assessor": "z_assessor_1644", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3465, "q0": "Proposer provided inforation regarding the solution's functions and also provided illustrative examples as two Swahili translations. This will help the voter have more confidence in the proposer's ability. Besides, the proposer also provides information related to the document to be translated such as articles covering current Cardano-related news, basic blockchain educational pieces, etc. How this project will affect Cardano is also clearly stated, and the proposal also has information related to the partners working on the project for voters to refer to. Proposer says the project is now risk-free as the team has already started implementing and delivering the project as planned.", "q0r": 4, "q1": "Information about the detailed plan and timeline is still quite vague. Proposer should clarify the issues to be solved for each month, can provide information related to selected documents so that voters have a better view of the project's operational direction. Likewise, the 'detailed budget breakdown' section can further elaborate a specific spending plan by providing more of its activities and costs in the content marketing or podcast creation section. The information related to project members is quite complete and easy to follow.", "q1r": 3, "q2": "The information section of the Auditability section is provided quite well. Proposer mentioned the explicit goal of translating 50 selected documents into Swahili. This will be a public point because the voter will better understand the values that the proposer pursues. However, the proposer can provide more specific information regarding the progress and development of the project, such as KPIs for translations.", "q2r": 4, "assessor": "z_assessor_1652", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3681, "q0": "Neither too fancy nor deep in meaning, this team project is merely a program of creating a diversity of Swahili Language Catalyst and Cardano resources to all of the Non-English speakers. However, not just because this is a small-scale project with only the Swahili-speaking community, it does not directly impact the development of Cardano in Africa. Through your team’s experiences in previous projects, we can see the importance of \"language\" in imparting knowledge. And an East African region will bring more extensive projects once people here can access and understand the Cardano ecosystem in their language. The idea and content of this proposal are good, and I won’t argue with that. But to ask if this proposal can convince investors, I'm afraid it's not enough. I think you need to add the total Swahili-speaking population in East Africa for investors to get a figure of this project’s impact. Moreover, the two links for the finished translation do not need to be repeated twice. Instead, add a few lines to describe the comments of the natives on your translation so that the investors can see the quality of your team's work.", "q0r": 5, "q1": "If this project were solely focused on translating Cardano-related resources, I wouldn't be able to demand a detailed plan with lots of activities and clear timelines. But in fact, you mentioned many other activities besides translation in the Impact part, like publishing podcasts, building communication channels, and building websites. So why is your detailed plan so simple? Furthermore, I see content marketing spending in your budget, but you don't mention this activity in the plan either. Whether the project is small or large, it is the heart of a team with many talented members, so try to show all your seriousness.", "q1r": 3, "q2": "Like the Feasibility part, you almost forgot about the other goals and only focused on translating important Cardano documents and the Cardano forum. Not to mention the lack of success goals for other activities, measuring by 50 Swahili resources is still not enough for investors to be interested in this project and for the community to track its progress and development. How do you know if the 50 resources you translate are excellent? How to define that East Africans read and absorb successfully knowledge? “Increase awareness of the Cardano ecosystem in East Africa Region” is not simply those 50 translations, and I hope you can show your all seriousness to make this Auditability even better.", "q2r": 3, "assessor": "z_assessor_1666", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 4597, "q0": "When people of Swahili understands the cardano project in their native language it will boost them to invest in the block chain at least in the future generation .\nBy getting these kind of education it also helps them to raise their standard of living and get to know the new age technologies of the world which can improve all the aspects of the swahilian people", "q0r": 5, "q1": "The task mentioned wont be much difficult where translation can be done using internet services, Communication channel can be created by setting up service number, presenting  yt videos will also not be a challenging task.\nMarketing might concern a bit other than that the proposal can be successfully be implemented without any barriers.", "q1r": 5, "q2": "Other than how the proposer manages to market among swahili people and roadmap of the project ,all the other aspects such as budget break down is clearly mentioned in the proposal.\nThe proposer has even mentioned about the partners with whom he wants to work ,and how he has 3 different set og goal i.e building translation service, communication service and establishing pod cast via youtube. hence,The information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 4, "assessor": "z_assessor_1747", "no_vca": 7, "ne": 0, "ng": 5, "nfo": 2, "vca_o": 1}, {"id": 5434, "q0": "The proposal targets the poor standard of living in East Africa. the described method to curb this problem is through the growth of a catalyst community in the region and bridging the language barrier through the use of the native Swahili language in communication. The proposal is going to boost the Cardano economy as Cardano tech is going to be used in implementing solutions. The proposal aligns with the challenge and is also fully capable of addressing future challenges.", "q0r": 5, "q1": "The given six-month period seems like a realistic period, given the fact that the proposer has stated that the development has already begun and they are looking to expand. The plan provided did describe the goals of the project, but the processes to complete to bring the proposal to realization were not clearly outlined. \nAgain, the budget allocation stated is reasonable, however, I'll suggest that more detail can be added to the allocation system. Given the fact that the proposal is already in implementation, there are no relevant t risks to hinder the success of the project. With the required skills needed to implement the proposal and other pertinent factors taken into consideration, I agree that this project is feasible\n", "q1r": 4, "q2": "The proposal provided a well-defined problem statement and also the solution given to address the problem was concise and understandable. The plan for the completion of the project, coupled with given time horizons for the achievement of the project is clear. Lastly, the stated means of assessing the development of the project are well defined and feasible to ensure the project functions as expected.", "q2r": 4, "assessor": "z_assessor_1989", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5717, "q0": "This is a very nice action. Creating content in another language allowing several people to be part of this community is amazing. Congrats.\n\nHowever, I have some points of discussion:\n1)\tIn the risk management you said that there is none. However, the impact here is totally correlated with the number of people reached. Assuming that they don’t speak english, maybe, until today, there are none or few content suggestions about ADA (because just a few or none of content are in Swahili). Therefore a strong marketing strategy is needed here.\n2)\tThe content: Since the proposal is to translate lots of things, how the selection is made has a huge impact in the final result. Therefore, there is a risk associated with this selection. Probably tracing the needs and preferences prior of translating lots of things would be good for this proposal.\n3)\tMonetization: In order to scale this up and not stopping when the fund grows short, probably creating a strategy to monetize and continue with this project.\n", "q0r": 4, "q1": "The project is quite feasible for the proposers. However would be good if there was a more detailed budget such: 1) breaking down a little bit the marketing (which platforms, strategy, etc); 2) Content translators (they who will choose the content to translate).\n\nAnother point that should be added is a more reliable roadmap and milestones. Informations like in which frequency can we expect to see a podcast, a translation, etc. You have a 6 months panorama with some expectations but it need to be broken down and have some deadlines and help with the deliverables such as the podcast and the texts, articles translated. \n", "q1r": 3, "q2": "Sharing translated content and having a podcast are two things that is easily seen and auditable. However we don’t have a roadmap with milestones allowing us to follow the deliverables. \n\nIt lacks KPIs as well, such as # of views (podcast), # of downloads, # of Q&A (if there is a forum), # of comments (podcast), etc. Therefore, these types of key performance indicators are good to verify the effectiveness of your proposal, control it and adjust if it is needed.\n", "q2r": 3, "assessor": "z_assessor_25", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 5871, "q0": "This proposal explains how in the Cardano community, more African indigenous languages are spoken than English, and how many materials, on the other hand, are only available in English, eliminating persons who do not speak the language. This proposal seeks to provide education and resources in the majority of the continent's major languages, including Swahili, will be required to boost awareness and make Cardano the blockchain of choice in Africa. The goal of this project is to collaborate with a catalyst school to translate Cardano and other catalyst resources into Swahili and provide education on them.", "q0r": 5, "q1": "The proposer is a member of the catalyst community who has demonstrated that he has the necessary skills to carry out the idea. The proposer has identified the team members who will be needed to carry out the project. The proposal also includes a realistic timeframe for completing the work, as well as a clear and concrete implementation strategy that outlines what will be done and how it will be done.", "q1r": 5, "q2": "The information given by the proposer is sufficient to audit the progress and success of the proposal since the proposer states that the progress and the development of the project will be measured by the 50 translated Swahili resource in forms of documents, videos and audios delivered within 6 months, smooth on boarding and contribution of East Africa Swahili speaking community in the catalyst community and increase in awareness of the Cardano eco- system in East Africa Region.", "q2r": 5, "assessor": "z_assessor_292", "no_vca": 10, "ne": 0, "ng": 7, "nfo": 3, "vca_o": 1}, {"id": 6482, "q0": "The proposal clearly identifies the problem of lack of access to education for Swahili speakers in East Africa. It presents as a solution to translate and create educational resources about Cardano. This proposal is in line with the challenge because it has the potential to increase Cardano's expansion in Africa. The proposal presents key metrics aligned with the challenge. The proposer does not clarify whether this project will be financially sustainable in the future.", "q0r": 5, "q1": "The proposer presents evidence of the relevant experiences of the team for the implementation of the work. The budget was well detailed and seems to be reasonable with the proposed work. The proposal presents a realistic deadline for completion of the project. The proposer provided some links with the work plan, but the access was blocked, so I could not read them to assess whether the necessary information was provided and what was planned. ", "q1r": 3, "q2": "The proposal presented a clear explanation of the target problem and its solution. Links with what I imagine to be the work plan were attached but they were blocked so I will consider that a roadmap with milestones was not presented. What would be important for evaluating the success and evolution of the work. Metrics were presented to monitor the success of the proposal.", "q2r": 2, "assessor": "z_assessor_429", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6865, "q0": "Developing resources, documents, videos, podcast on the Cardano ecosystem in different languages facilitate access to those, and more people may join by learning in their native languages.\nThe idea shared through this proposal align with the challenge objective as it allows attracting the Swahili speakers to the Catalyst project. And for those who may not know, the Swahili is spoken in many Central and East African countries 9Tanzania, Kenya, Uganda, Burundi, democratic republic of Congo) mainly and some pocket of Swahili speakers in South Somalia, Rwanda. As you would represent, it's a big community that would have access to this information through this proposal.\nThe impact would be tangible as documents, podcasts, video would be produced and posted online.\n", "q0r": 5, "q1": "The proposers are part of the project catalyst on different capacities (CA/VCA...) but also have expertise in the blockchain, and they have developed an experience as their previous proposal was already funded around the same topic of translation (Plutus Translation in Swahili).\nThis may be a gage of success for this proposal. It would have been great to have more details about proposers experience on their LinkIn profiles, but also provide a link to the Google Drive in the proposal that's accessible.\n10 documents to be produced per month is reasonable for a total of 50 for the duration of the project. But I I'm questioning the cost of translation service: $200 seems little as that service has always been expensive. I wouldn't mind seeing that budget line increased.", "q1r": 5, "q2": "For follow-up they're already platforms where the community would follow the progress of the project activities, but one link is not accessible.\nKPI are defined and indicators of the numbers of documents produced already set to 50. \nNo risk has been mentioned by Proposers, but the increase of the service cost  would be one, especially the translation cost (service fee for an individual or company ) hired to offer the service.", "q2r": 5, "assessor": "z_assessor_478", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 9028, "q0": "I am confident that the problem aligns with the challenge objectives. Catalyst resources is one of the effective ways of educating people about Cardano, in this case having the resources translated in Swahili language is very good in incorporating the Swahili people into the ecosystem, that’s a very big mark for Cardano. The goals and metrics are in alignment with the challenge setting.", "q0r": 5, "q1": "Per the information and expertise of each team member and the relevant experience described, I am confident that the team possesses the required skills and knowledge to execute the project. The budget is well prepared and I believe it’s reasonable to achieve the set goals. Well the plan is understandable however, it is not so detailed for full grasping of the implementation. The timeline is also kind of insufficiently described although it’s expected to last for 6 months. The proposer has stated that there are no any foreseen risks/challenges, well I hope that is the case because per adventure some challenges spring up it would curtail the project implementation if funded.", "q1r": 4, "q2": "There is a roadmap and timeline which in my view are understandable but so not so detailed however, they are good for achievement. I can’t navigate to the milestones of the proposal, that’s really lacking.\nNevertheless, I believe the metrics/KPIs were excellently chosen as they tell the number of translated Swahili resource in form of documents, video and audio within the 6 month period, they are good indicators of what success looks like.\nThere is clarity in the problem targeted and I believe the proposed solution is effective to address the problem.\n", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Collaborating with catalyst school to translate and provide education on Cardano and catalyst resources in Swahili language.", "experience": "Active participants and contributors to catalyst community. Catalyst C A and VCA. Fund 7 proposers\nTrainer on Financial Market and Blockchain Technology at RFFXTZ Company Limited. Speaker \nContent Creator and Marketing Expert."}