{"id": 404682, "author": "humanbeing", "title": "Boosting Cardano In South Africa", "url": "https://cardano.ideascale.com/a/dtd/404682-48088", "category": 26442, "amount": 10200, "description": "The Cardano ecosystem and Project Catalyst are gradually evolving in Africa. However, the adoption rate in South Africa is very minimal.", "f6_no_assessments": 20, "f6_rating": 4.416666666666666, "videos": [], "media": [], "f6_assessments": [{"id": 811, "q0": "Promoting Cardano in South Africa is a much-needed proposition at the moment. The popularization of Blockchain in general and Cardano in particular in South Africa is a job that needs continuity and long-term. The proposal is completely suitable for the challenge given because it can help many South Africans, especially the school community, students and intellectuals know about Cardano and they will most likely choose to start a business with the ecosystem. Thai Cardano. This will help the Cardano community in South Africa in particular and the Cardano community in the world in general to grow more and more.", "q0r": 5, "q1": "I believe that with my experience, the Wada team and other members will do well in this proposal. In addition to the risks that you put forward that may hinder the success of the proposal, I think you also need to be more clear about the current situation of the Covid-19 epidemic in South Africa? The epidemic will make it difficult for you to organize large gatherings. If this happens, how will you handle it to complete your work progress and goals? You need to be more specific about this issue so that the community can understand more.", "q1r": 4, "q2": "With the route plan you have given, I believe you can do well. My little suggestion for you is that you need to be more detailed and specific in terms of numbers with indicators such as: How many specific wallets are opened? How many actual attendees do you need to reach? …The more specific the numbers, the more the community will appreciate you. Also, I think this proposal should be replicated to the worldwide Cardano community. I think you can make process videos or stream your shows through video streaming apps so the international community can learn.", "q2r": 4, "assessor": "z_assessor_1213", "no_vca": 11, "ne": 0, "ng": 10, "nfo": 1, "vca_o": 1}, {"id": 1213, "q0": "According to the proposal the adoption rate of Cardano in South Africa is minimal and this proposal is trying to have outreach events for University students, developers and business people towards Cardano adoption. \nThe impact of this proposal is that the outreach events will help introduce blockchain and Cardano to the participants, and introduction of Project Catalystt among others.\nThe solution will increase the number South Africans interestedin the growth of Cardano community. \nThe main challenges stated in the proposal are internet issues and attendance issues which the proposal provided solutions to. These reasons above made me give 4 .", "q0r": 4, "q1": "I have given 4 rating because of the following reasons: the plan i detailed in the proposal, some of which are that during the first and second months preparation ill be done towards implementation, 3 months post funding with various activities, and after 3 months activities.\nThe budget is broken down well showing different activities as marketing, administration and advert costs clearly stated in the proposal. \nThe team is made up of Wada experts ho are capable of delivering successfully. The Catalyst School being part of the team is laudable and makes the proposal a good one for successful implementation. ", "q1r": 4, "q2": "After 3 months at least 100 individuals (university students, developers and business people) will become aware of blockchain and catalyst. The success is measured by the number of actual attendees, the number of attendees onboarded, the number of new wallets, among others are mentioned in the proposal. \nIt is a new proposal but I believe the Wada experts will be able to deliver. \nThe details provided will make the implementation successful. ", "q2r": 4, "assessor": "z_assessor_1315", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 9660, "q0": "Cardano is a public blockchain platform with open_source and centralized.  Also from the information given adoption rate of Cardano in south Africa is minimal. A grand outreach event organized for university students, developers and business personnel  will have a great impact and thereby create awareness.  The proposal also identified a problem within the challenge which needs to be solved and it's clearly aligned how it will add value to the cardano ecosystem by trying to reach out to those who have no knowledge about cardano thereby creating awareness.  With this I believe is able to scale to address future challenges. ", "q0r": 5, "q1": "With the information and experience given the team is an active member of the cardano community and have the experience necessary to carry out the project. The team also provided links , references, and images of relevant skills needed for the implementation  of the proposal. The budget provided is reasonable and broken down.  The implementation plan is comprehensible  and the team to handle the project are mentioned with their roles stated. With all this informations mentioned is highly likely  that the proposal will be improved successfully. ", "q1r": 4, "q2": "The team provided a step by step plan for the implementation with clear milestones and a defined time horizon.  There is also several metrics that measures the success of the proposal. The challenges and the means to handle them is stated. In summary I think the information provided is sufficient to audit the progress and the success of the proposal.", "q2r": 5, "assessor": "z_assessor_744", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 9030, "q0": "The problem statement described here is in alignment with the challenge. From the proposal, one effective way the team seeks to use to boost Cardano adoption in South Africa is outreach events for university students, developers and business personnel, I see that this approach addresses the critical issues of the challenge, hence the metrics and goals are in alignment. The proposal in the long term can reach out to so many people which is a big win for the ecosystem.", "q0r": 5, "q1": "Running through the team members expertise and their relevant experience, I believe they are capable of delivering the task. The budget is well explained, however I think that a more breakdown of miscellaneous cost ($500) would have been great unless of course it’s considered as contingency. Nevertheless, the budget is reasonable for this kind of a project (achieving the goal). The plan presented here is well explained together with a definite timeline. Challenges and risks are considered, however, it’s indicated that internet devices would be made available to solve the internet or connection issues but it has not been stated the kind of devices they may be. I will advise that these information is included next time so that we can if they are effective enough to solve connection issues.\n", "q1r": 4, "q2": "The roadmap provided in the proposal is quite detailed and clear milestones and time horizon are stated. There are a number of definitions for what success looks like one of which is a good number of the attendees signing up for project catalyst community is a desired outcome of the proposal. The metrics/KPIs I believe were excellently picked because they indicate the number of individuals that would have attended the events.\nFrom my understanding of this proposal, I can see that the target problem is clearly explained with a proposed solution I believe is effective to tackle the problem.", "q2r": 4, "assessor": "z_assessor_717", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8189, "q0": "The proposal aligns very well with the goals of the challenge, as it seeks to create widely accessible events for college students, developers, and business people about Cardano and Catalyst. If successful, this project will definitely benefit South Africa and the Cardano ecosystem, as for the continent it will boost the economy through project finance and for our blockchain, it will bring new users to use our technology and thus broaden Cardano's horizons. The solution is described as perfect, matching the criteria of the challenge, increasing the number of South Africans interested in the development of the Cardano Community. The proposal also outlines the three biggest challenges and risks that may be encountered during the project implementation, namely internet problems, appraisal problems and in the long run may arise legal issues. . Fortunately, the proposal offers clear directions for overcoming these challenges.", "q0r": 5, "q1": "This proposal is very detailed on time frame with all stages, with actions taken, a plan was presented very well, community can track their action step by step as well as understand Learn how the event will be organized, who will participate, what content will be presented during the event, and strategies to engage participants. The $10,200 request budget was allocated straight to the point, clearly explaining specific items to help the community fully audit what the requested funds were being used for. About the team: This project is supported by a collaborative effort from a group with cultural and technical experience in the Cardano community as well as in Africa such as Wada, Catalyst School and Kaelo Lentsoe (Education Network Ambassadors) Blockchain in South Africa). With this team, I think without a doubt about their ability, they understand a lot about the Cardano ecosystem and especially about the Catalyst project and have a certain place in the Cardano community. With all the above reasons, I strongly believe that this proposal is very likely to succeed.", "q1r": 5, "q2": "As said this proposal has been very well thought out. Undoubtedly, the group of people who self-identify with the right skills, are highly motivated and strongly committed to the Cardano ecosystem. It is recommended to provide easy-to-follow KPIs along with a shortlist of future project successes after the first 3-month period increasing transparency of the project and the proposal. Finally, I would like to say that the ability to test this proposal is easy through what the author team has provided. I hope that this proposal will be funded as it is a great initiative to help raise awareness about Cardano for South Africa.", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 8, "ne": 0, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 8031, "q0": "This proposal effectively addresses the challenge, promoting the development of the Cardano ecosystem in South Africa is an issue that needs to be addressed in this challenge. The author's solution is to organize an outreach event for students in South Africa, where sales staff and developers will be specifically guided to learn what they need to know about Cardano and Catalyst at a grassroots level. then the community will grow stronger and stronger. This proposal marks the big box in South Africa. Big events will be held at the end of March if the project is funded. The possible risks have been clearly listed by the author and there are other ways to overcome the risks.", "q0r": 5, "q1": "The proposal provides a clear, detailed action plan that provides the team with much-needed community trust. Milestones are listed in detail by the author of the things that need to be done through the months. With a strong team with a lot of experience and a strong background, the members all have many different fields but things related to Blockchain, cultural and technical in the Cardano community. The proposed team also provides a link to their repository website https://wada.org , where we can clearly see all the activities of the group. The team has a large amount of evidence of their expertise with a reasonable budget, this project is very doable. The team has planned the preparation quite well, the allocation of the roadmap budget is almost specific. The risks are well prepared by the team.", "q1r": 4, "q2": "Proponents have provided metrics that match their intended metrics, making it easy for the community to track the project's progress. Proponents refer to their desired outcomes through their respective success metric milestones. With what the author has provided I believe this proposal will be done well if funded. This project is a completely new project and is waiting for funding.", "q2r": 4, "assessor": "z_assessor_649", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 6933, "q0": "The general overview of this proposal really addresses the subject such that it has an outreach event to be held in south africa purposely to provide basic education about cardano and catalyst and aside that, empower its target audiences(students,business personnel and governments officials) to interact with catalyst tutors and other experienced fellows to delve into the introduction of blockchain,cardano,catalyst,CA,VCAs,Yoroi wallets etc. and all other relevant information to broaden their horizon and the entire community at large.", "q0r": 5, "q1": "Implementation plans/process stated shows that the work will commence from the first 3months by hosting a grand cardano and catalyst event to get not less than 100 university students,developers,government officials and business personnel to adopt cardano and catalyst in south Africa. It also has proper  plans of how funds would be disbursed during implementation and what exactly each funds would be used for in the budget. Excerpts has also been provided by the successful experienced team who are willing and ready to deliver.", "q1r": 5, "q2": "Per the much information provided this proposal will Empower much individuals in various fields to become key players in roles such as CAs,VCAs,owning cardano wallets with their stake pools and generally to boost the cardano ecosystem.", "q2r": 5, "assessor": "z_assessor_497", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 5164, "q0": "The proposers realize that the Cardano ecosystem and Project Catalyst are gradually evolving in Africa but the adoption rate in South Africa is very minimal. Therefore, they propose to organize grand outreach events for university students, developers, and business personnel to diversify Cardano and Project Catalyst adoption. The proposers have clear topics to present in the event, those are the introduction of Blockchain, Cardano anf Project Catalyst. Besides, the brief proposal structure stated in the plan helps the reader understand the particular steps the authors would like to implement. We have an overall picture of the proposers' idea. The value contributed to the Cardano community is clear and this model can be broadened in scale. I totally agree that this proposal addresses effectively the challenge and evaluate this criteria at mark 5.", "q0r": 5, "q1": "First of all, the budget mentioned in this proposal is described in detail with logical items, including costs for organization, presenter incentive, marketing, admin and miscellaneous. The team members have experiences in blockchain but I wonder what skills the catalyst school is having to help the new members improve. There is one telegram link to consider the competence of all team members. I think the proposers can provide more sources for reference. For the challenges, the proposers have thorough evaluation when they see both short-term and long-term matters to solve, including the internet issues, the attendance and legal matter. For each item they have good solution for handle. In conclusion, this proposal has good brief for the overall plan, the challenges and key factors to evaluate the success. It can be applicable. If the proposal has more reference source information, it could be perfect. I give mark 4 for this criteria.", "q1r": 4, "q2": "For the success evaluation, I am really impressed by the core target the proposers show. According to the plan, after 3 months, at least 100 individuals (university students, developers, business personnel, government officials) in South Africa have attended our event and are aware of Cardano and Project Catalyst; a good percentage of the total attendance has signed up to become part of the Cardano and Project Catalyst community; individuals approach the core team with their innovative ideas to be fine-tuned into project catalyst proposals for submission. This is a good proposal, clearly briefing the process, the KPI for evaluation, the challenges in short and long term. The problem solution is easy to understand. I evaluate mark 5 for this criteria.", "q2r": 5, "assessor": "z_assessor_1870", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5133, "q0": "The Cardano ecosystem and Project Catalyst are evolving in Africa. However, the adoption rate in South Africa is very minimal.Diversify Cardano and Project Catalyst adoption through a grand outreach event for university students, developers, and business personnel. The solution is to host an appropriate outreach event where South African students, business personnel, and developers will feel welcome and learn about all they would need to know about Cardano and Catalyst on the basic level. Aside from education, participants will have the opportunity to interact and communicate with the tutors and among themselves. With this initiative, we are focused on members on the following topics:\n• Introduction to Blockchain\n• Introduction to Cardano\n• Introduction to Project Catalyst\nVarious Catalyst roles (CA, vCA, Proposer, Referral, Challenge Team member, etc.)\n• Introduction to Stake Pools\n• Introduction to the Cardano Dev tools\n• Introduction to Cardano Wallets (Yoroi, Nami, CC Vault, Daedalus, etc)\nThe solution will increase the number of South Africans interested in the growth of the Cardano Community. At the end of a successful implementation, there will be an increase in the number of catalyst participation, quality of Project Catalyst projects coming through from the South African region, increase in the number of Cardano Dev participation, and increase in the number of individual interest print blockchain.\n\nThe main aim is to ensure that South Africans especially, University students, business personnel, developers, and government officials are exposed to the accuracy of information revolving around blockchain, its capabilities, and most importantly the opportunities it has for everyone.\nThe impact on a large scale will help not only South Africa but the Cardano community to grow stronger.", "q0r": 5, "q1": "This would obviously not be the only outreach event team seeks to host in South Africa. Remember, the goal is to boost Cardano and Project Catalyst's adoption rate in South Africa through diversification. This means that they’ll surely host more outreach events, workshops, hackathons, etc in iteration to ensure that the adoption rate of Cardano and Project Catalyst in South Africa is being uplifted. With this being said, we plan to attain at least a 10% boost in the adoption rate per event.\nThis project is backed by a collaborative effort from a team with a wealth of cultural and technical experience in the Cardano community as well as in Africa. All team members are very active in Catalyst, and community groups across our ecosystem. They are a diverse bunch united by the Promise of Cardano, like: Wada and The Catalyst School.\nWith the support of large organizations, along with a detailed plan in the process of project implementation, I believe the project is completely feasible and brings lasting success to the development of the South Africa and the Cardano Community here.", "q1r": 5, "q2": "It is proposed to introduce a number of indicators to measure the progress and development of the project, including the following key indicators:\nThe number of potential attendees.\nThe number of actual attendees.\nThe number of attendees onboarded to the Cardano Development community.\n\nThe number of attendees onboarded to Project Catalyst to contribute to various roles.\nThe number of new Cardano wallets created (Yoroi, Nami, CC Vault)\n\nThe number of viewership to our YouTube uploaded version of the event.\nThe number of follow-up calls, emails, and messages that come through seeking guidance and inquiries from the core team.\n\nHaving a strong network of University Students, developers, business personnel, and government officials from South Africa where ideas are explored. While teaching them about Project Catalyst and helping them to engage with the Cardano ecosystem by becoming Community Advisors and submitting highly reviewed Catalyst Proposals.\nThe proposal provides specific grounds, ensuring impact, feasibility and transparency, helping readers see the successful future of the project in the chain of great impacts from the Cardano community in the South Africa.\n", "q2r": 5, "assessor": "z_assessor_1863", "no_vca": 9, "ne": 0, "ng": 5, "nfo": 4, "vca_o": 1}, {"id": 4731, "q0": "The proposer seeks to address the challenge by diversifying cardano and project catalyst adoption through a grand outreach for university students, developer and business personnel.\nThe team propose solution is to orginze outreach events as provided in the images where students, business personnel and developers will learn about cardano and catalyst on the basic level.\nOpportunities will be provided for participants to interact and communicate with the facilitators, various discussion on blockchain, cardano and project catalyst will be discuss as well.\nThe team intend to start the implementation in three month after funding, the proposer solution will increase the number of south Africans interested in the number of catalyst participation, quality of project catalyst projects coming through the south African community.", "q0r": 4, "q1": "The proposer seems to be well connected to the cardano community which is quite remarkable, the project will be supported and mentored by the catalyst school and WADA with the goal to boost the cardano adoption rate in south Africa. The team has not provided their personality profile with, the number of team member and many more information will have do them a lot of good.", "q1r": 3, "q2": "The proposer will be using the first two months after funding for preparation to start the main project, three months after funding to conduct online survey. \nThe proposed budget is clearly stared.\nthe auditability of this project is quite not clear, i expected more clearer information that stated. ", "q2r": 3, "assessor": "z_assessor_1755", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 3952, "q0": "I admire the proposal's goal of bringing knowledge to South Africa and strengthening relationships between the Cardano community and African societies. These meetups and seminars, hosted by experienced Cardano community teams, will be critical in raising knowledge of Cardano in particular and blockchain in general across numerous African classes, including students, developers, and business employees. \n\nWith the involvement of extremely active Catalyst teams and community groups from throughout the Cardano ecosystem, such as Catalyst School and Wada, I believe the project will have a significant influence on the African community.", "q0r": 5, "q1": "The proposal includes a detailed schedule for actions that will take place for the first 3 months. The money utilization is clearly defined in terms of how it will be spent. Teams backgrounds are well-known and credible. In addition, proposers listed some challenges that might occur along with solutions to mitigate them. \n\nOverall, the plan is really feasible given all the information.", "q1r": 5, "q2": "The plan establishes a clear path to success and outlines a precise method for controlling progress. I would add one more measure to keep track of, which is the ratio of good to negative comments after the event; this might be a trustworthy source to better determine if the audience is interested in and understands the themes.", "q2r": 4, "assessor": "z_assessor_1693", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 3232, "q0": "The proposal is well aligned to the challenge. It demonstrates a real need of promoting and educating targeted groups on Blockchain, Cardano, Cardano Catalyst aimed at growing the Cardano ecosystem, participation in Catalyst project, leadership roles and facilitating and or demonstrating Cardano tech use-case solutions. The objectives and outcome of the project are clear and measurable. The project is focused on creating a local impact. It also has potential for scalability. Grow Cardano, Grow Africa; seed in Cardano awareness in local communities of Africa for mass adaptation.", "q0r": 5, "q1": "The team’s role is clearly defined.  The team experience is aligned with the project objective. The proposed approaches, strategies and activities are reasonable and outcome oriented. The timeframe of the plan is defined. The budget is explained and risks are taken into consideration. The potential outcome of this project is surpassed the probable risks. ", "q1r": 5, "q2": "The KPIs, roadmap, milestones and delivery dates are defined. The information provided in this proposal is in alignment with key metrics of the challenge and sufficient to audit the progress and success of the proposal. ", "q2r": 4, "assessor": "z_assessor_1629", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 3102, "q0": "In this project, they aim to gain greater adoption of South Africa by organizing an outreach event for university students, developers and business personnel. This project can ensure that interest is aroused among these people. It would be interesting to add which universities will be collaborating with and how they are looking for developers. The project can make sure that people get the information about the basics of Cardano. This project could have an impact on the Cardano ecosystem as it can target approximately 50 million people and, in the long term, a larger area in Africa. The main topics are included in the proposal such as introduction of blockchain and what is Cardano,…. To solve this problem, they first want to start a Cardano community in order to find the right people. Challenges such as internet issues, presence issues have been taken into account. In the long run, problems related to the law can also arise and they can learn from this.", "q0r": 4, "q1": "The team members are listed on the website www.wada.org with a link to their experiences. There are certain members I cannot trace the relevant experience of. The topics are divided in such a way that someone without any experience can participate in this project. There is a budget overview available where the costs per component are described. It would be useful to better divide the point of various costs. The proposal states that all members are active in catalyst and community groups. I can't fully verify this information because links don't work. There is a timetable stating what will happen in these months. Three months after the funding, the aim is to show that there is greater adoption. It does not say how these statistics will be measured. It says on the website that hubs have already been established. This link doesn't work for me to check this. The risks and challenges have been taken into account to make this project a success. There should be slightly more measurable statistics and better research into how to tackle these challenges.", "q1r": 3, "q2": "A few KPIs have been included to measure the progress of this project. Statistics such as the number of potential participants and actual participants could be displayed on the website. It states that the objective is to inform 100 people about the possibilities that Cardano offers. To do this, I would integrate some sort of evaluation to see if everyone understands everything. The roadmap does not include any milestones to be achieved during this period. It does not say how the problem can be solved if too few people are registered. By getting the right people involved in this project, new ideas can be developed from a different angle. This proposal offers a solution to the integration problems in Africa.", "q2r": 3, "assessor": "z_assessor_1606", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2929, "q0": "Yes, it did .\nProposal scope such as ;\nTarget audience/ number of audience is clearly defined:-100 people made up of University students,  businessmen & women & Govt. Officials\nTopics to be treated at the Event as listed in the Proposal covers fully all about Cardano Ecosystem. \nActivities/channels (all social media) is stated.\nEvent location, also mentioned as  ,City Capital of S/A.\nI think more south African of the target audience can be reached if the event is extended to remote part of the County & other Institutions/Individuals.\nI also think, with the knowledge to be impacted to the Audience, they will be encouraged to take up self roles such as CA, VCA, VOTERS etc easily to demonstrate their talents   abilities & capabilities for the betterment of Cardano Ecosystem. \n\n\n", "q0r": 5, "q1": "Yes, the likelihood of successful implementation is so high looking at how well the Event plan & timelines, well disgusted within the 3 months period. 1st &2nd month & the 3rd month and after.\nAfter the 3rd mth survey to get audience suggestions to improve upon their subsequent events really shows what they want to achieve in boosting Cardano in S/A. \nAdditionally, the Survey will again help in where the right target audience was chosen. \nProject Fund is broken down per every expense that will go into the event for easy analysis. \nHigh wealth experience supporting Team identified here.", "q1r": 5, "q2": "The  potential attendee/actual attendee  & on boarders to Cardano Development Community will easily measure the target audience of 100 people & 10% increasment in every event the Proposer intend to achieve makes the Proposal highly measurable and auditable.", "q2r": 5, "assessor": "z_assessor_1591", "no_vca": 8, "ne": 0, "ng": 8, "nfo": 0, "vca_o": 1}, {"id": 2600, "q0": "Using outreach programs to draw people's attention to cardano in south Africa  is a great idea,the proposal clearly aligns with the challenge.when these programs are organised, people will be educated about the cardano ecosystem,they will be curious to know what it is all about,they will also have the zeal to be part of the community and being part of the community means new member onboarding,new member onboarding also means having new people creating accounts in projects catalyst and becoming new community advicers, veteran community advicers and proposers.we will have new people with good ideas turning them into proposals seeking for funding to solve societal problems and issues relating to the cardano ecosystem.\nAlso,the team not only wants to educate people on cardano but actually wants to help them to be part of the community, helping them write good proposals, become good community advicers.they also stated in the proposal,the topics to be covered during the outreach programmes.\nTo me, this idea will go a long way to help grow cardano in Africa.", "q0r": 4, "q1": "The team seems to have well laid plans for this project if funded.I think with the kind of team presented in the proposal,the team is capable of handling this project.\nWada,which is part of the team  is a cardano based community network of 25+ professionals focused on connecting the world to Africa using blockchain.they have strong partnerships with the ecosystem and I think this is a trusted member of the cardano blockchain and as such are capable of handling the project.\nAlso,the catalyst school which also helps  new members improve their skills on catalyst is also a trusted member of the community and can also be up to the task.\nThe budget has been clearly defined and is reasonable to me. Every activity to be taken has its allocated funds. I have no doubt that this project will be implemented if funded.", "q1r": 4, "q2": "The key metrics in the proposal are well laid out for us to know what the team intends achieving.\nThe KPIs are also clearly defined in the proposal for us to know how success looks like if the proposal is implemented and as such this proposal is auditable. The team has already shown us pictures of outreach programmes they have undertaken before and I have no doubts they will be able to implement this project successfully if funded.", "q2r": 4, "assessor": "z_assessor_1537", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 2445, "q0": "The core aims of the 'Grow Africa' Grow Cardano' initiative is to increase Cardano awareness and understanding on the African continent. According to the proposal, the Cardano ecosystem and Project Catalyst adoption rate in South Africa is very low, so the goal is to diversify Cardano and Project Catalyst adoption through a large outreach event for university students, developers, and business personnel, allowing participants to interact and communicate with tutors and among themselves, thereby increasing the number of South Africans interested in the Cardano community's growth. By 2023, this will have gone a long way toward making Cardano the blockchain of choice in Africa. THIS proposal effectively addresses the challenge.", "q0r": 5, "q1": "The team at Wada have demonstrated their knowledge and competence in block chain, notably Cardano, over the period and have the requisite skills to carry out the strategy with the Catalyst School. The proposer has clearly outlined the team members required to carry out the plan, as well as a budget that is broken down into manageable pieces and acceptable in order to meet established objectives. A realistic schedule for finishing the work is also included in the proposal, as well as a clear and actionable implementation plan that indicates what is being done and how it is being done. The proposer has examined the difficulties that may occur during implementation and has proposed solutions. As a result, the issue solution suggested has a good possibility of being implemented sucessfully.", "q1r": 5, "q2": "A timeframe and milestones are included in the proposal, as well as metrics and key performance indicators (KPIs) that define the proposal's success. The concept comprises a clear description of the issue as well as a solution that tackles it in the same way.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 14, "ne": 0, "ng": 8, "nfo": 6, "vca_o": 1}, {"id": 2371, "q0": "This proposal has addressed the challenge. The challenge is set to put measures in place to increase the number of active participants in the community. South Africa will see more CAs, VCAs, team members, and others. This is in line with the campaign setting and the technologies put in place to see this impact has been mentioned. \nThere is a clear outline of the objective of the proposal as well as the key metrics of impact.\nThe proposal has outlined various challenges that may be faced in a long run after funding the project and the necessary solutions has been put in place to deal with them. The proposal has the necessary elements to case impact in South Africa.", "q0r": 4, "q1": "This proposal has the necessary experience and elements for the proposal's success. The is a detailed even schedule of the events to take place on a monthly bases. \nThere is a detailed budget. All elements have been estimated and it doesn't look like there is an understatement to case the proposal not to be successful. \ngiven this and the experience stated above, there is the likely hood that the proposal will be implemented successfully. ", "q1r": 4, "q2": "This proposal has the information necessary to track the progress and the success of the proposal. If taken by anyone, the key metrics of the proposal can be matched against the proposal the check if they are doing what they are doing is what they intended to. \nThere is an outline of the information that will be taken in course of this proposal to aid the measuring of the KPIs of this proposal.", "q2r": 4, "assessor": "z_assessor_1478", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 2237, "q0": "I strongly agree that this proposal addresses the challenge because both the metrics (proposal and challenge) align with each other. This proposal clearly identifies a problem in the challenge that needs to be solved. i.e., seeding Cardano in South Africa. The solution is to host a grand event to engage and educate business personnel, university students, and developers on Cardano and Catalyst. This is a phenomenal idea that addresses the targeted problem and is evident from the success stories that have been achieved by Wada, who's a co-proposer of this proposal. \nThe fact that this proposal lays out the various topics that would be delivered during the event gives the community a clear indication of what impact is to be expected at the end of a successful implementation.", "q0r": 5, "q1": "Looking at the roadmap provided in this proposal, it is clear what the timelines and milestones are. The main deliverable, which is to boost the Cardano/Catalyst adoption rate in South Africa by a 10% margin per event, gives the community a clear picture of what to expect if this proposal is funded. \nThe team behind this proposal (Wada, the Catalyst School, and Kaelo Lentsoe), as expressed in this proposal, has the requisite experience needed for a successful implementation of the project. Wada and the Catalyst School are two great entities well-known in the community when it comes to hosting events and delivering quality on educational topics as mentioned in this proposal.\nThe budget for this proposal looks very feasible, with a detailed breakdown of how the requested funds would be utilized for successful implementation. Therefore, I strongly agree that this proposal will be implemented successfully if funded.", "q1r": 5, "q2": "This proposal has a clear roadmap with key metrics needed for full scale auditing by the community. The information provided under the roadmap and key metrics of this project gives the community a clear indication of what should be expected as far as auditing is concerned. I strongly agree that this proposal provides sufficient information needed to access it's progress.", "q2r": 5, "assessor": "z_assessor_1462", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2191, "q0": "Impact Assessment: Rating of 4\n\"The problem identified and described in this proposal is highly in the same direction of the challenge. Indeed, for a good  product to reach out to large audience, there is a positive need to market it well to be patronized. Even though Cardano may be known, as clearly identified by this proposal, there is a clear need to better push Cardano and its related parties to the door step of South African students, developers and politicians. The proposal seeks to register additional value to the Cardano community with the hope that there will an increase in the quality of project catalyst coming through from South Africa, increase in the number of Cardano development participation and an increase in the number of individual interest in Blockchain with Cardano as the choice. I am satisfied with the impact session as the proposal has noticed that there might be challenges with legal regulations and as such will devise a platform for consulting Lawyers and building relationship with Law students as this will be an advantage to introduce them to Cardano ecosystem as they guide the team  to better position the project properly within the South African Law\".", "q0r": 4, "q1": "Feasibility Assessment: Rating of 4\n\"With reference to the attached pictures and the introduction of Wada, Catalyst School and Kaelo Lentsoe, I believe, given the necessary guidance and resources, it is likely that the proposal will be implemented in a grand style. However, I think aside the team stating broad blocks as a team, they could have at least stated clearly some personalities with their individual skills, experience and potentials in order to reassure voters of how the program, when funded will look like. Also videos as a prof of topics earlier discussed as a a team should have provided in addition to the pictures neatly attached. The proposal outlines a realistic timetable to execute the project when funded just that, waiting for a whole three months after receiving funding to put up the program will be too long and will create a space for relaxation on the side of the organizers and will also affect budget. The budget provided appears to be a summarized one and fit for purpose but a breakdown should be provided for \"organizing team incentivization cost\" and \"administrative cost\".  ", "q1r": 4, "q2": "Auditability Assessment: Rating of 4\n\n\"The proposal has established clear and measurable KPIs which would help to monitor the project success when funded. More so, roadmap to the project itself has been carefully outlined as to what will happen in the first and second month post-funding (preparations towards the event). it should be noted that I have indicated in my feasibility assessment, a space which will be created if the team should wait till three month post funding before hosting the program. The team should consider shortening some processes in order to at least have the project executed within two months. There is straightforward understanding in the description of the problem and the proposed solution\".", "q2r": 4, "assessor": "z_assessor_1458", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 10492, "q0": "There is the need for Cardano to become more vibrant within African countries and South Africa is not an exception. The outreach events where South Africans can appropriate outreach events where South African students, business personnel, and developers will feel welcome and learn about all they would need to know about Cardano and Catalyst on the basic level. According to the proposers,  aside from education, participants will have the opportunity to interact and communicate with the tutors and among themselves. With this initiative, we are focused on educating members on the following topics:\n\nIntroduction to Blockchain\nIntroduction to Cardano\nIntroduction to Project Catalyst\nVarious Catalyst roles (CA, vCA, Proposer, Referral, Challenge Team member, etc.)\n\nIntroduction to Stake Pools\nIntroduction to the Cardano Dev tools\nIntroduction to Cardano Wallets (Yoroi, Nami, CC Vault, Daedalus, etc)\n\nThis is commendable and worth emulation as it will help many other people to learn about the ecosystem. This is why I think this proposal effectively addresses the challenge herewith talked about.", "q0r": 4, "q1": "The roadmap and plans submitted in this proposal is well articulated and designed. The proposers were able to outline that they have worked on similar projects and hence have what it takes to undertake this project when given the opportunity by the release of funds. The experiences of the team is also one that speaks a lot regarding the success of the project. They were able to also show clarity with regards to how the budget will be spent.", "q1r": 4, "q2": "There is enough and sufficient information to audit the progress and success of the proposal. The Key Performance Indicators shown here is also clear and comes with do much specification. I think the proposers will do a lot of work when trusted with the mandate of executing the project.", "q2r": 4, "assessor": "z_assessor_925", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}], "solution": "Diversify Cardano and Project Catalyst adoption through a grand outreach event for university students, developers, and business personnel.", "experience": "The project will be supported and mentored by Catalyst School and Wada with the goal to boost the Cardano adoption rate in South Africa.\nThe beautiful images in the attachment section of the proposal confirms our experience and past successes in terms of events and outreaches."}