{"id": 404841, "author": "ebutech", "title": "Hackathon and Internship Program", "url": "https://cardano.ideascale.com/a/dtd/404841-48088", "category": 26442, "amount": 28000, "description": "Over 90% of African businesses are SMEs and cannot afford traditional business protection through a lawyer. This factor puts them at risk.", "f6_no_assessments": 9, "f6_rating": 4.333333333333333, "videos": [], "media": [], "f6_assessments": [{"id": 2692, "q0": "I agree because the proposal identified a motivative factor which is `employment creation` that will motivate African youth and institution to adopt and join the cardano block chain in Africa within the shortest possible time, since unemployment is a major problem in Africa.\nThe expected future constrains and their challenges are well explained.  ", "q0r": 4, "q1": "I am not certain on the successfully implementation of the proposal because, there is no clear time frame either in number of days, weeks, or months needed to carry out each activity on the milestone except the internship which is three months per the budget, time play a key role in influencing people interest on programs hence it successful implantation.\nHowever, the set of expertise available can assist in the successful implementation of the proposal", "q1r": 3, "q2": "I disagree that the proposal can be audited properly because there is no provision for comprehensive report or portal that will be made available for the cardo community to review either on monthly or quarterly bases.\nAlso, know provision is made to create platform that will allow the community get feedback from cooperate institutions where students will be doing internship,  'feedback' on projects points out clearly the success or otherwise of the project.  ", "q2r": 2, "assessor": "z_assessor_1554", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 3469, "q0": "This proposal is well written, providing most of the information needed by the voters. First, they presented the problem, outlined the background for the solution, and from there came up with the function and how the project should work. Next, the proposer outlines how the solution will positively impact Cardano. Besides, the proposer also gave a visual example for the voters to better understand the project. The information related to the risks that the project will face has also been specifically indicated along with the solutions. This proves that the whole team has prepared quite carefully to minimize risks for the project.", "q0r": 5, "q1": "The information in the roadmap is quite clear, the jobs are recorded in detail in each stage. However, if possible, the proposer should add more predictable times to the pieces of work. Regarding the content of the 'detailed budget' section, the proposer has provided an outline for the speding plan, but the content is still not specific, for example adding the content of running the program each period. The information section of team members has also been updated in detail via linkedin, which will help readers easily grasp information and compare.", "q1r": 4, "q2": "The fact that the proposer can provide such clear KPIs is a plus because it will help the voters better understand the criteria for evaluating the success of the project. However, the proposer should also provide a place where the above information is published so that the proposal will be more coherent.", "q2r": 5, "assessor": "z_assessor_1652", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3683, "q0": "No project is likely to succeed if it is not based on actual circumstances. And 85% of African students studying at EUB is enough to describe the reality that Africans are very talented, and there is no reason we should not invest in that talent. Your idea is not only creative but also meaningful, I appreciate it. Your project does not require large-scale works or great investments but aims at knowledge - the core to build a future. Moreover, you create job opportunities for your students and indirectly sow potential seeds into the Cardano ecosystem through their solution proposals. You have an organization to ensure the quality of the course, have experienced instructors and have a reasonable risk reduction strategy. Therefore, I believe that investors interested in the education sector will keep an eye on your project", "q0r": 5, "q1": "This part of the proposal is presented quite well, with enough essential information to answer each request. You have a roadmap with 2 key milestones and activities to complete. You have a detailed budget with a list of reasonable expenses and stick to the roadmap. You have good members with high positions in the EUB. However, all you have is just enough and does not show the deeper aspects of the project. For example, has your team targeted EBU with any corporations or businesses? No need to be sure, give a few names so that your investors and students can see the feasibility of this partnership proposal. How will the judges evaluate the projects participating in the hackathon? And finally, briefly introduce the capabilities and experience of team members, don't just leave LinkedIn like that", "q1r": 4, "q2": "Concerning the roadmap in the Feasibility part, your team has set KPIs corresponding to each milestone and set goals for the community to rely on to monitor the development of the project. But unfortunately, you can only give the word \"number\" instead of a specific quantitative number. How much is enough to target the number of students incubated as interns and the number of students offered job opportunities? How many EBU centers will create the project’s initial success? And one more thing, where will the community track your team's task if funded? Please help me answer these questions and add them to the conclusion of the proposal", "q2r": 4, "assessor": "z_assessor_1666", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 4260, "q0": "This project not only helps large and small companies have the opportunity to own their own potential lawyers but also supports EBU students to have the opportunity to experience internships at different companies. In addition, students also have a high probability of not experiencing unemployment in the future. All actions involving the creation of smart contracts, in particular, are carried out on the Cardano ecosystem, which is a significant advantage to the community. It not only broadens the African market but also allows more individuals in Europe to learn about and participate in this diverse ecosystem. . Even in the face of future obstacles, the proposer presents timely answers that, in my judgment, will adequately address such challenges. It would be preferable, though, if they detailed the answer to the task, guaranteeing that students finish the Plutus/Haskell course. It's still a little hazy and doesn't appear to address the issue at hand.", "q0r": 5, "q1": "I want to applaud the efforts of the entire team in the detailed and specific planning of this project. They establish two distinct milestones for each action, with the second milestone requiring an output. This is a unique feature and an advantage of this project. Other initiatives normally just provide a single result, which in this case is multiplied by 4, a highly impressive quantity. Perhaps it would be better if they assigned a time frame to each of the milestones they established. To make it simpler to track the progress of the project, it can be based on the length of the course or by months. Furthermore, the funding is spent judiciously for each individual spending item, including rewards for student groups. The team members, in particular, is made up of well-known professors from the European Business University - Luxembourg who have a thorough grasp of both their students and this initiative. This will ensure, among other things, that the plan achieves the required goals.", "q1r": 4, "q2": "In terms of the project's ultimate title, everything appears to have been quite neat and thorough. The proposal depicts the majority of the accomplishments that the project will achieve. If the initiative is successful in the future, it will, in my opinion, benefit not just students or businesses, but also the Cardano ecosystem, which plays a vital part in this project. It not only increases the number of individuals who participate in the community, but it also has a significant impact on the next generation. It would be ideal if the proposer could add a specified number of pupils. But, in my opinion, what is exhibited in this project is well deserved of a 5/5 rating.", "q2r": 5, "assessor": "z_assessor_1713", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 4526, "q0": "The proposal effectively addresses the challenge. The proposer aims at helping in building the blockchain and encouraging more development and adoption of the Cardano blockchain in Africa through an already existing program and organized hackathons which indeed is an innovative idea.\nThe proposal includes probable problems that may hinder the progress of the project, but he does to provide solution to them as well.", "q0r": 5, "q1": " Given experience and plan presented it is highly likely this proposal will be implemented successfully. The current plan is comprehensible. He did a good job with the timeline for the milestone 1, however failed to  expand on the time frame for the milestone 2. The provided budget is also reasonable and appropriate.", "q1r": 4, "q2": "The proposer provides enough information to audit the progress and success of the proposal. Relevant metrics are utilized, however the proposer I would be glad if he could elaborate on what he meant by \"Hackathon length = 1 week every term (14 weeks)\"", "q2r": 4, "assessor": "z_assessor_1744", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 6003, "q0": "This proposal is in line with the challenge setting, but I do have some questions with regards to its relation with the challenge setting. The proposers from the European Business University (EBU) plan to continue teaching their haskell/plutus course that is taught over 13 weeks. At the end of the course, the students are given a real-world problem and are tasked with solving it using their acquired knowledge. By providing this course with the challenge at the end, the proposers are teaching students how to code for cardano smart contracts. Additionally, the proposers partner with businesses to provide graduated students with internship opportunities. Up until the very last sentence of the proposal, I was very confused about how the proposers were going to onboard African developers because they made no mention of the fact that they were targeting African students to take their program. However, in the very last sentence of the proposal, they say that the majority of their students are from Kenya. In the future, I would encourage the proposers to build this information into the proposal earlier because it seemed to me that this proposal was just to teach a course, and not to teach a course to majority African students. I would also encourage the proposers to mention how they would get more students from Africa to participate in this program. This way, the cardano community can know that this proposal will directly impact the people of Africa, and therefore, address the challenge setting. (score given: 4)", "q0r": 4, "q1": "Based on the information provided, I think that this proposal will be successfully implemented. The proposers all have the necessary skills to effectively teach this course to students. Some of their qualifications include haskell instructor, technical administrator, and dean of the EBU. Thus, I have confidence in the proposer team. The proposers have listed out all of the tasks they hope to complete in an easy-to-read manner. I can see that they have two key milestones: organizing the hackathon and setting up the internship program. There are also sub-milestones, such as the creation of EBU hubs. However, it would have been nice to have this information in a roadmap with dates so that I would be able to follow along with how much time each part will take. With regards to the budget, it has been broken down well by the proposers. There are prizes for the hackathon, costs per student taught, and other administrative costs. I have not taught a course in haskell, but I think that, given the scope of the proposal and the number of proposers involved, the funding requested is sufficient. (score given: 4)", "q1r": 4, "q2": "Given the information provided, this proposal is very auditable. The proposers listed many good metrics of success that can be used to track the progress of this proposal. For example, the projects developed during the hackathon, the number of students who get internships through the incubator program, and the number of EBU hubs created are all concrete metrics that can be tracked by the cardano community. I am wondering, how exactly will these metrics be shared with the community? I don’t currently see a webpage or a specific format that will be used to share the success metrics. I also have one suggestion for the proposers. It would be very interesting to include a KPI on successful projects created and implemented by graduates of this program. Something like a success story page where people can see people just like themselves who took this course and changed the world for the better using the skills they gained. While this metric may take many years to achieve, I think that it could show long-term success of this proposal. (score given: 4)", "q2r": 4, "assessor": "z_assessor_310", "no_vca": 4, "ne": 1, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 7215, "q0": "According to the information provided, the proponents are a European university institution recognized for their educational mission to provide university level education to students from developing countries.  Africa, Asia and Latin America have been their geographies of work.  Under the tutelage of the IOG itself, they teach one of the most important topics for Cardano as an ecosystem: Haskell and Plutus. \n\nBeing a business school, they seek to take students from the acquisition of theoretical knowledge to direct interaction with the real world: finding employment, developing their own projects, getting involved with the growth of their communities, seems to be the bet that the proponents make, with a track record that seems to support their experience in the area.    \n\nIn my opinion, if an educational institution functions as a knowledge platform that dynamically seeks to involve young people and students in general with the economy of their communities (either through other companies or through their own projects), is an organization that not only can provide its students with the legitimate right that every human being has to make their life a better life, it can mean the creation of a gateway to more activity in our ecosystem, to a more widespread use of our technology, and in the end, an important boost to the price of our sometimes unfairly beaten native token ADA.", "q0r": 5, "q1": "-It is noteworthy that the proponents are a University with a respected track record of teaching in developing countries that has an educational partnership with IOG to teach Haskell and Plutus. Those who have taken a class with Lars (Brunjes) in the Plutus Pioneers program know that they don't just hand that task to anyone.   In addition, when I visit https://ebu.lu/partnerships/, I see a large number of alliances and partnerships of no doubt great importance, evidence of how other organizations put their prestige on the line by supporting the work of the proponents as an educational institution.  \n\n-The information in the implementation plan allows a clear understanding of the purpose of connecting students with an experience that connects them to the marketplace and gives them the possibility of getting a job or developing a life project that contributes to their own lives and the growth of their communities.\n\n-The destination of the budget is clear and corresponds to the reality of the development of Hackathons and Internship programs.  The most interesting thing is that the great majority of the requested budget will remain in the hands of the students' future.\n\n-The proposal presents enough information to verify the knowledge and experience of the team in charge of the implementation of the proposal.  I believe that the team has sufficient knowledge and experience to execute the proposal, while at the same time demonstrating the high profile of the proponents as an educational institution.   ", "q1r": 5, "q2": "In my opinion, the KPIs and the definitions of project success correspond to a measurable scenario.  Both aspects describe an achievable scope, whose success or failure would be easily identifiable.  Also, the reputation of the proponents as an educational institution (with serious alliances and prestige at stake, with IOG breathing down their necks) is a variable that adds certainty to the funding exercise, both at the level of implementation and at the level of access to the information needed in the audit process.  Honestly, these types of audit subjects are the auditor's dream: they have so much skin in the game that they facilitate any control process that needs to be executed. They cannot be hidden.", "q2r": 5, "assessor": "z_assessor_541", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 7696, "q0": "This kind of proposal is what Cardano currently needs. Full stop.\n\nEducation, education, education and then practical implementation add to that an internship is the trifecta Cardano needs. I have first hand experience of this, not once but 5 times I had to turn down businesses who are interested in building Cardano due to the lack of developers. What this proposal has been doing and is trying to continue to do so, should be a template to be copied throughout Cardano's educational/academic ecosystem partners. When we have an army of Cardano developers, that is when will have mass adoption. This proposal not only answers this Challenge key metrics in spades, but it also answers a universal situation that Cardano faces and needs to solve, which is the lack of developers. This is put up front and center when the start-up 3air from Africa publicly stated they will not being using Cardano due to the lack of developers.", "q0r": 5, "q1": "These individuals comes from a reputable university and vetted directly by IOG to conduct these educational programs. The proposer himself is a Dean of European Business University - Luxembourg who has years of experience teaching blockchain development and has implemented several smart contracts. EBU is an active partnership with IOG to teach Plutus/Haskell course in a structured and guided form. That itself should convince anybody that this proposal should be voted through.\n\nThe action plan is simple and clear. Create a hackathon the engage the participants and winners of the hackathon into the blockchain industry either by internships or employment in companies.\n\nThe bulk of the budget goes to providing compensation to the individuals that are involved in the internship. The other bulk goes to having this hackathon each term and to also market it. \n\nThere is no doubt on the benefit, the impact and the success of the implementation of this proposal. Although there is a possibility the number of internships might not each the quota, I am more than willing to let this issue be handled/addressed in this proposals future iteration.\n\nWhat supremely confuses me is that they already have a partnership with IOG to develop educational materials. Why not make things simple just by providing the proposer the funds they ask. Rather than going through the process of Project Catalyst. I do understand the need to be decentralized, but there are things that just make sense and not need be complicated. 28K in comparison to the amount IOG holds is nothing. To those who want to know how much ADA IOG holds, one just need to Google; Catalyst Genesis.", "q1r": 5, "q2": "As much as I love this proposal. Although the KPI's are clear the overall arch of this proposal is also clear, what is not provided specifically is the method they will provide the information of their progress to the community. I can deduct by myself what are the platforms they use for all their reporting's since they have shared them as attachments. From GitHub, Youtube to a website are platforms that the proposer has been using. In the spirit of assessing, I suggest to convey to the community the methods of how will we learn, audit, track and evaluate the effectiveness of this proposal.", "q2r": 3, "assessor": "z_assessor_635", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9032, "q0": "The problem statement described here is very aligned with the challenge. There are strategic goals at each of the four stages, (one of which is having student developers build smart contracts) and considering them all they touch the critical issues of the challenge and hence I believe the goals together with the metrics align. Smart contract developers are needed by every blockchain technology and Cardano blockchain is not an exception, so hence I believe this proposal is a big win for Cardano. At this point, I can boldly say that the proposal addresses the challenge effectively.", "q0r": 5, "q1": "The team appears so equipped to execute the project considering the relevant experience and their various expertise provided. The budget is well explained and broken down, it’s reasonable to achieve the set goals. The plan provided is detailed with a clear and definite timeline. Considering the challenges/risks described, I think the team have well foreseen them with respect to the nature of the project.", "q1r": 4, "q2": "The roadmap presented here is well described with clear milestones and time horizon, that’s a good effort. \nI am so much impressed for the strategic and detailed KPIs provided. The metrics/KPIs chosen are good indicators of evaluating the success of the project as they measure the number of projects developed during the hackathon, number of students incubated as interns for the development and implementation of smart contract solutions etc. I believe quite some excellent effort was employed in choosing the KPIs, bravo for that. The targeted has been made made clear and I believe the proposed solution can tackle the problem.", "q2r": 5, "assessor": "z_assessor_717", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}], "solution": "Expose Cardano more to the market through the hackathon and have our student developers build smart contracts for some of these businesses.", "experience": "Dr. James Mulli, Academic Dean of European Business University - Luxembourg has years of experience teaching blockchain development and has implemented several smart contracts. EBU has an active partnership with IOG to teach Plutus/Haskell course in a structured and guided form."}