{"id": 405342, "author": "mischkin", "title": "Connect the unconnected through art", "url": "https://cardano.ideascale.com/a/dtd/405342-48088", "category": 26442, "amount": 30000, "description": "The creative work done by orphaned kids in the SOS-villages of Botswana normally leaves the community through one transaction. ", "f6_no_assessments": 5, "f6_rating": 2.8666666666666663, "videos": ["https://www.youtube.com/watch?v=SVfq8CDmQak&start=1050"], "media": [], "f6_assessments": [{"id": 3507, "q0": "As I understand the project, the idea is to take the artwork of young people in SOS children's villages in Botswana and monetize them as CNFTs. The benefit of this is that it will bring these young people into the Cardano ecosystem while creating an opportunity for the artists to support themselves and their communities from their artwork. I would like to know how many artists stand to be impacted by this project and what plan is in place to extend beyond the SOS villages. It would be advisable that the proposer provides data regarding the technical possibilities of the artists as it pertains to engaging with the Cardano ecosystem. I am uncertain of the potential impact due to a lack of information regarding the initial impact and the potential to scale and reach more artists. It may also be more beneficial to include an intention of education for the children as you mentioned setting up wallets for the children, yet I see no data or plans to confirm that the children will know what to do with those wallets and the potential earnings they receive. ", "q0r": 3, "q1": "There was a lack of information regarding the team in place to execute this project. There was mention of one other person named Matt. Most NFT projects have a team of around 5-6 people to position themselves to be successful. I am not certain that a two-person team is adequate enough to launch and manage an NFT project involving multiple artists. I see no supporting evidence that the team has the experience to complete and execute the tasks involved in setting up, maintaining, and scaling a project of this sort. The budget is also quite large and appears to be concentrated on internal matters such as visas, travel, accommodations, and equipment. I would encourage the proposer to put together a suitable team of individuals that can function in specific roles as well as develop a clearer vision of what the potential risks are for this project idea. ", "q1r": 2, "q2": "I cannot agree that there is sufficient information to audit the progress of this project. My experience leads me to conclude that the scope of an idea of this sort is much more involved than what has been documented in this proposal. The timeline and KPIs are quite vague or not there at all, for example, Measuring the floor price of the final output does not allow the community to audit the progress of the project as it develops. \n\nI would encourage the proposer to reimagine the structure and scope of this project to position it for success in the future.", "q2r": 1, "assessor": "z_assessor_1658", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5108, "q0": "The proposer is trying to support orphaned children in Bostwana through Cardano ecosystem. It is a good value for the community in Africa become decentralized and indepedent, get royalties paid directly for them as well as adding value to the adoption of Cardano through the exploration and idea of the community. The problem and challenge is identified clearly by the proposer.\n", "q0r": 4, "q1": "This is a new project and the proposer has relevant experience to do this. The budget is broken down clearly, as well as the timeline.However, it will be a much stronger proposal if they also included more links to their credentials to further backed up their credibility.\n", "q1r": 3, "q2": "The proposal has a realistic and manageable timeline. The metrics are clear with the floor price of the final NFTs and tracking progress through social media is helpful to trace the progress the project. It could be nice if the proposer add website/github. It will be better if it’s included the data of how many NFT or children in the community is targeted.\n", "q2r": 4, "assessor": "z_assessor_1852", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 7472, "q0": "The proposal was very well summarized in the following topics: “To carry out a creative workshop within SOS-childvillages in Botswana”. This is the initial idea, the proponent intends to bring the art produced by a community of African children into the Cardano ecosystem. He would do this by transforming these arts into CNFTs, building a community on twitter and discord, and configuring the “wallets on the Cardano network. Create smart contracts that give a percentage to community creators in Botswana.” CNFTs would be launched on the market. I found the idea interesting, but this part of only a percentage of the profit going to the artists worried me, who would get the rest of the profit? I think it's a very interesting way to introduce this community to our blockchain technologies, which aligns with the goals of the challenge from the moment that both Africans would benefit (they would learn a new way of profiting from their art and could also get involved in the community in other ways); and Cardano, from the moment that new active members would be added to the community, which would generate popularization and greater investment in our blockchain. So I think the idea is good, it just needed a little more clarity on the part of the distribution of funds so that we understand the real impact for the African community in question. \n", "q0r": 4, "q1": "Unfortunately, the project's viability is somewhat low. The information that has been given is superficial. For example, we have a roadmap, which lists the activities that would need to be developed for the project to become a reality. However, the temporal notion is a little strange, for example, what would be done until December 2022? I don't think so much clarity is given regarding the temporal part of the script. Regarding the budget, the total amount is divided into some parts, but I think it would be more interesting if there were more details regarding each of the expenses. For example the vectorization of the arts would cost 4 thousand dollars, but how many arts would be vectorized? And for how long would the professional involved perform this activity? It's not very clear. Finally, speaking of the team, it's actually just the proponent, which worries me, because in general projects with this level of complexity would be better developed with a multidisciplinary team, that is, with different people involved performing different functions. The details on the proponent are also not very extensive, we do not know, for example, how they relate to the Cardano ecosystem, so there is not so much confidence in their preparation to deal with our blockchain technologies. Therefore, I believe that this part of the proposal leaves a lot to be desired and needs to be revised. \n", "q1r": 2, "q2": "I found that the ways in which the author suggests that the process be audited are quite satisfactory, he makes a brief qualitative analysis of what the partial results would be. I also think that it would be better to follow the development of the activities if the script were better organized in time, and if each of the activities was better detailed. The proponent does not make it clear how the information said here would reach the Cardano community, and this point is really very necessary to think about. Finally looking at the final results, I really found the information provided here to be too abstract. It is necessary that we think of more accurate ways of measuring success. This should be done both quantitatively - such as the number of CNFTs sold, how many artists remained involved with the project, how many people were added to the Cardano ecosystem - and qualitatively - how are these people getting involved in the community's activities? How was the target audience, that is, the children's community benefited? How can we ascertain the consequences of this idea both for Cardano and for Africa? I think, once again, that there is a lot to be improved in this part of the proposal. You should outline exactly how the community will have access to all the audited information and you should also think more objectively about how to see if the intended success has been achieved. \n", "q2r": 2, "assessor": "z_assessor_57", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9662, "q0": "From the information  given. This proposal is a great idea and with  Botswana  being the  world's highest percentages of orphan children among its population, I think this idea will bring a lot of hope and opportunities to those children. NFT being a unique token on the blockchain and its feature  of  its having a proof of authenticity into the digital realm, making ownership of digital asset provable and secured, it means that if successfully implemented , the children and community will have a lot to benefit. I will recommend  that the proposer team should mention the number of people that will be handling the project and the role each person will play with their experience to further prove that you can handle the project. There is a link provided (https://www.instagram.com/robotswearenot).  With this I think the proposal  is able to scale to address the future challenges for that I therefore rate with a score of 5.", "q0r": 5, "q1": "The proposer provided an evidence e.g link https://www.instagram.com/robotswearenot, of relevant skills and experience needed to implement the proposal but the proposer did not give a well detailed information on the number of team members required to implement the proposal.  The budget of 30,000 is reasonable but there is no room for additional funding and the funding needs a clearer breakdown  like  the type of camera you are aquiring and how many do you need for the project etc. I will recomend the proposer should further breakdown the timeline like how many months will the budget cover, and what you intend to achieve within that period of time,  when is the project starting etc. Also the challenges because I believe that every project has its challenges, so I will advise you state them and how to overcome them. If the described aspects are improved, then this proposal has a better chance of it being implemented successfully. ", "q1r": 4, "q2": "The proposer provided a clear statement of the problem with clear understandable solution that addresses the problem.  I will advise the proposer to add a more detailed roadmap with milestone.  Metrics/KPIs that defines the success of the proposal should also be stated for better auditing", "q2r": 4, "assessor": "z_assessor_744", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 9960, "q0": "I believe the primary goal of this challenge - Grow Africa, Grow Cardano - is to scale up the adoption of Cardano in this continent. The campaign brief has stated: \"Cardano holders win when there is an encouraging environment for mass adoption anywhere.\". However, although this proposal presents a highly humane project, its target is limited to children in a village in Botswana; therefore, mass adoption is not achieved. ", "q0r": 2, "q1": "The presenter does not show any experience doing humane activities in Africa or building a CNFT interface that allows Cardano transactions. I am concerned that such a lack of experience in these vital aspects for the project's success might set many barriers when this proposal comes to implementation.\nMoreover, I would love the presenter to prove that there would be a demand for these children's works. Since besides the philanthropists who are interested in investing in Africa, I do not see the picture of mass demand for these artworks, which is highly challenging for this project.", "q1r": 1, "q2": "I need more information on technical aspects, marketing plan, customer education, and examples of the work the children from Bostwana have made. The presenter can write a more informative and in-detailed proposal if they focus more on the above aspects in Fund 9.", "q2r": 2, "assessor": "z_assessor_780", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "We mean to take the childrens art being made in different SOS-villages in Botswana into Cardano by making it live in the CNFT-space.", "experience": "My name is Teodor.\nI run a creative project utilizing only recycled materials for promoting growth in mindset concerning the the young generation's awareness of  our planet's limited resources. The project is called We Are Not Robots which is both a hommage to human rights.\n\n\n\n"}