{"id": 405450, "author": "robbale41", "title": "Grow Ethiopian cardano community", "url": "https://cardano.ideascale.com/a/dtd/405450-48088", "category": 26442, "amount": 15000, "description": "low media coverage about cardano, no bootcamps or coding challenges, or other developer on-boarding platforms in Africa.", "f6_no_assessments": 6, "f6_rating": 3.277777777777778, "videos": [], "media": [], "f6_assessments": [{"id": 816, "q0": "Developing the Cardano community in Africa's second most populous country, Ethiopia through Coding bootcamps is a very interesting idea. It fits the challenge perfectly. I see that Ethiopia is a country with a very young and dynamic population. Creating training courses for young people so that they have the opportunity to participate in the Blockchain field and especially participate in the Cardano ecosystem is a great thing. This can help them quickly have the right start-up direction and be able to take advantage of high-paying job opportunities in the Blockchain field. This also helps the Cardano community in Africa in general and in Ethiopia in particular to develop faster and with better quality.", "q0r": 4, "q1": "I think being Huawei ambassador at AASTU will help Robel to develop the community well and complete this proposal brilliantly. However, I have a small suggestion for you that you need to give more evidence of you being a Huawei ambassador so that the community can trust it more. In addition, Robel needs to share more about his experience of doing similar things with the proposal, if any, so that the community can trust you more. The one thing that is missing is that you also need to add what are the possible risks of this proposal? Example: How can you attract an audience in Ethiopia interested in Coding Bootcamps? In case there are too few people interested or too few people participating, what will you do? I believe that if you give out this information, the community will support you more.", "q1r": 4, "q2": "I believe that with his capacity and relevant experience, Robel can completely complete the route you have given. There is a small suggestion for you that you need to give more details about the plan to use $ 15000 if you receive it. For example: $3000 to organize reunions and warm-ups, specifically how many will you organize? How much does each session cost? I believe that the more detailed you are about your finances, the more the community will trust you.", "q2r": 3, "assessor": "z_assessor_1213", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 2451, "q0": "The 'Grow Africa, Grow Cardano' project aims to raise Cardano awareness and knowledge throughout Africa. According to this suggestion, cardano receives little media attention in Africa, and there are no bootcamps, coding contests, or other developer onboarding venues. As a result, this proposal aims to promote Cardano and its ecosystem to developers via coding bootcamps, community Meetups, and social media marketing, hence increasing Cardano awareness and assisting in the achievement of the objective of making Cardano a preferred blockchain in Africa. This proposal effectively addresses the challenge.", "q0r": 5, "q1": "The proposer provides evidence of relevant skills and experience needed to implement the proposal. The proposer has outlined the team required to implement the proposal as well as a budget that is quite clear, broken down and reasonable to achieve the set goals. The proposal offers a realistic timetable to complete the work considers challenges and risks relevant to a successful implementation. However, the proposal would have been more complete with further possible solution to the possible challenges provided. The proposal can be implemented successfully anyway.", "q1r": 5, "q2": "The proposal offers me with sufficient information to audit and evaluate the project's progress toward its stated goals, since it elaborates the implementation techniques and success measurement criteria, thanks to the well-developed material from the impact and feasibility categories.", "q2r": 5, "assessor": "z_assessor_1501", "no_vca": 12, "ne": 0, "ng": 8, "nfo": 4, "vca_o": 1}, {"id": 5256, "q0": "A great idea that needs more evidence! I'm very enthusiastic about this project making a real difference in the lives of Ethiopians by putting technical jobs into the economy. I would be all for this proposal if we had more evidence in a lot of different areas, other than just the one link to a Github profile that has 3 contributions associated with it. First, I want to know how many people would be impacted. What is the goal for how many participants is the goal for these bootcamps? What universities are you targeting to draw your participation from? Is there an established partnership with these universities? Is there any guaranteed or expressed participation from the target audience? What makes this proposal different from IOHKs partnership with the Ethiopian government to overhaul education using blockchain technology? I think answering questions like these could put the perception of this proposal at a MUCH different place. I think establishing some kind of relationship with reputable actors in the Cardano space could add some trust to the endeavor. ", "q0r": 3, "q1": "I appreciate that the timeline is a 12-month timeframe but I feel like I need more detail. One goal/event per month is good but I know that's not ALL that will be done in those timeframes. I'd like to see a more detailed layout of all the things that will be done in each of those months. There's gotta be prep-work for presentations in these online meetups, preparation for developing a curriculum for these boot camps, and I assume those \"coffee chats\" in month 9 is not the only thing that's going to be done in the whole month. I also feel like I need a more detailed budget breakdown. Identifying how much money is going into different categories is a little to vague. I would like to know how much is being allocated to different sub-categories within these specific areas. Why does it cost $3k to organize boot camps? What is the boot camp completion program and why does it cost $5k? These are some questions I have that could be answered with greater detail. ", "q1r": 2, "q2": "I think these success metrics are solid, but could use some improvement IF another attempt is needed to get Catalyst approval. I think the proposed metrics could use some more time-based milestones, as opposed to total overall. It provides a good metric based roadmap that shows that there is active attention into what metrics are being hit when AND that there is a mechanism in place for corrective action to be made if those metrics aren't achieved. 100 developers sound great! 100k social media followers sounds ambitious but I don't know what the interest looks like from Cardano developers in Ethiopia (this could be good statistics to provide in the impact section to clarify this as a possibility). Hackathons were never mentioned previously in the proposal but it sounds VERY interesting. Tell us more. Overall, I think this has the potential to be a very impactful proposal but I need much more detail, development, and thought put into the plan before I can give my approval. ", "q2r": 4, "assessor": "z_assessor_1896", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 5957, "q0": "The proposer has identified a problem and a solution to the problem, but they are presented in a vague manner as is not very clear who is the target audience as \"developers\" being a generic category of people. Maybe addressing this topic to the computer science students or any other related groups will have a better chance to be implemented. If the solution provided is addressing people with no or poor programming skills it is necessary to rephrase the proposal as hackathons could be an unusual experience for such people.", "q0r": 3, "q1": "There are no relevant traits of the team (or the proposer) experience. The GitHub profile is not giving any relevant info about some working/in development viable projects thus making unclear what is the area of expertize that could make this proposal a working project. It is necessary to assemble a team of people with various domains experience. A person with teaching skills is mandatory for this kind of activity, virtual or in person. The proposer should identify the other human resources necessary for this project (marketing, administration etc.)\n\nThe proposer should give relevant info about the other necessary resources that are to be used to successfully implement the project (i.e.: promoting materials - stationery, flyers, tv spots - other means of communication than social media etc.; interconnecting services - mobile, data etc.; computers, space ranting etc.). Having a clear image about the necessary resources to be used gives a good chance for the project to be in the spotlight of getting funded.\n\nThe project is broken down into identifiable items but they are presented in a succint way and it seems that is not covering all the expenses that are to be made (see above).\n\nA timetable with achievable milestones is provided but is somehow unclear what is the output of those stages (what are the results of the coding bootcamp - users satisfaction, users retain for future programs etc.).\n\nCould be better for this project to start at a small scale (locally) and expand to the national (or East Africa) level after acquiring the necessary experience to make the project feasible.\n", "q1r": 2, "q2": "The proposal lacks in providing necessary info to audit its progress and the success.\nIt is necessary to provide KPI/metrics and a risk awareness for the implementation of the project (the output of each project stages should be identified and measured if possible or required). The proposal, as it is presented, looks more like a concept than as a working project.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 9129, "q0": "The proposal identified a unique problem and offered a good summary of solution. The blockchain ecosystem need African developers and a huge media sensitization model to educate many and get them onboard.  This two are immediate needs for Africans. \n\nThe proposal therefore is aligned and have the potential to create impact to scale up Africa's involvement in the blockchain revolution ", "q0r": 4, "q1": "The proposal has a year long deliverables with well aligned timelines.\nUnfortunately, there exist  no single information of the team and and the budget has no details. There are no items and corresponding cost, showing how the funds would used for the intended purpose.\n\nThis denote the proposal may not be able to be implemented with success", "q1r": 2, "q2": "The proposal's KPI are reasonable except the fact that, 100 developers signing up to innovate using the blockchain is too ambitious. The metric variables are in line to allow for auditing by the community. \n\nShould this proposal be funded, a progress report will enhance auditing so project implementation challenges could be identified and dressed along the 12 months duration ", "q2r": 3, "assessor": "z_assessor_719", "no_vca": 4, "ne": 0, "ng": 3, "nfo": 1, "vca_o": 1}, {"id": 10497, "q0": "The spread of blockchain and it's related activities is a good one for the development of Africa. Blockchain as a tool can help develop Africa. That is why I got excited about this challenge when I first saw it. From the proposers, the youth must be a priority to ensure mass adoption of cardano and it's ecosystem. The lack of efforts within Africa  countries and for that matter Ethiopian draws the point for the problem. I think their problem is actually a challenge that needs attention. I was however looking forward to understand how this proposal can specifically address the problem. As we know, cardano is one of the leading blockchain system in the world, it has a bigger role to play therefore i would have loved to see how this in the proposal how they intended to help businesses, students and technology enthusiasts to solve this challenge.", "q0r": 3, "q1": "I am not really convinced about the inputs of the proposers as far as the their plan and experiences presented are concerned. There could have still been more vital information provided. The proposers 12 months period for this project to me is too long a period. Some of the activities could have been done within a month with some of them merged. They could achieve so much within a shorter period of time than the planned 12 months period.\n\nI also think the budget allocation could have been better. Budgetary aspect of every proposal is very important, hence the proposers could look at how to be specific with their price quotations. To me it was too scanty.", "q1r": 3, "q2": "Information needed to audit the progress and the success of this progress was not sufficient. There could have been more than one KPI than the two presented. With the two, I don't really see how they connect with each other and the project. I think they can look at it again to ensure they have a linkage with the challenge they seek funding to address.", "q2r": 2, "assessor": "z_assessor_925", "no_vca": 4, "ne": 0, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "promote Cardano and it's ecosystem to developers through Coding bootcamps, community Meetups and social media promotion.", "experience": "Hello, I am Robel from Addis Ababa, Ethiopia. I'm computer engineer. i work on web3 project in NFT and permission blockchain. I'm currently working as Huawei ambassador to AASTU, where i introduce students to huawei developer tools. i have founded a logistics company before."}