{"id": 381130, "author": "visionguild", "title": "completMusic streaming/NFT Defi DEX", "url": "https://cardano.ideascale.com/a/dtd/381130-48088", "category": 26243, "amount": 20000, "description": "A quase inesgotável capacidade de ganho da música é desperdiçada como um recurso devido à economia atual da indústria musical.", "funded": 0, "upvotes": 24330477, "downvotes": 24271325, "votes_result": 59152, "votes_cast": 133, "f6_no_assessments": 7, "f6_rating": 2.619047619047619, "videos": [], "media": [], "f6_assessments": [{"q0": "I love this project idea and think it is really exciting to think about positive disruption in the music industry with these types of ideas and technologies. The reason for my reduction of a star is because of the fit into the challenge. The proposer says himself that he considered it going into the dapp challenge instead of grassroots DeFi. I'm still giving it high stars though because ultimately the idea of using NFT's as a financial vehicle for recurring earnings and even building a portfolio of them is quite stunning. That is the out-of-the-box thinking that the DeFi space is really in need of. I think the proposal could be improved if that aspect was more narrowly focused and detailed. ", "q0r": 4, "q1": "It's clear from the way the proposal is written that the proposer is passionate and that goes a long way with me. There is a Linkedin profile for the COO but not of the proposer, which I wish there was. The website, beta app (although not provided), and whitepaper clearly show competence. The timeline is solid and the likelihood of implementation very high. My only reservation is again related to the DeFi component since that is the challenge this is in. The proposal says the currency will be available in Q4 but what about any other marketplace options? I think the proposal cold be improved if there was more detail on the timeline for the actual DeFi components.", "q1r": 4, "q2": "The roadmap has clear features that can be audited as per the challenge settings whether or the dapp is live on the mainnet can be measured as well as users and financial activity.", "q2r": 5, "assessor": "z_assessor_295", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "This proposal addresses a widespread problem in the fair & transparent distribution of income generated from any artistic endeavor. \r\n*The proposal identifies a problem that has the potential to impact the challenge. Unfortunately, the proposal has not specified how it will add value to the Cardano ecosystem. Including this information in a clear & direct fashion will greatly improve the next iteration of your proposal. Welcome to the experiment! \r\n*The key metrics and goals of the proposal do not align with the outlined challenge settings. The Challenge brief indicates that success is the formation of \"new teams deploying DeFi D'Apps on Cardano in 2022 + Managing to form a community in order to gain competitiveness/sustainability.\" Finding & connecting to the artist community within Catalyst will not only improve your proposal, it will take it to a whole new level through the collective wisdom & passion of a community. \r\n*The proposal has the potential to scale to address future challenges with further consideration & development of the details through collaboration as mentioned. \r\n***(2) I disagree that this proposal effectively addresses the challenge. Further work in finding a verifiable, experienced team, learning what is expected in a Project Catalyst Fund proposal, and continuing to follow your dream of fair compensation for artistic work will help make this an awesome proposal. Although I am giving you a low rating, what matters at this point is that you took the first steps towards becoming a contributor to the solutions to the challenges we are facing today. Well done, for your first iteration. Your future self will be proud.\r\n", "q0r": 2, "q1": "The widespread need for the fair compensation of artists confirms the proposal is on the right track. \r\n\r\n*The proposer does not provide evidence (references, links, etc.) of relevant skills and experience needed to implement the proposal. \r\n\r\nGranted, \"30 years in the music and recording industry both as an engineer and as a international touring and recording artist\" indicates a deep level of understanding the issue of compensation. Unfortunately, it will require actual expertise in the technology required to accomplish this proposal. By being a \"tech geek at birth,\" you have the right foundation to combine these 2 passions. \r\n\r\n*The proposer has not identified the type and number of team members required to implement the proposal.\r\n\r\nThe proposer appears to have the off-chain knowledge to onboard new projects and people into Cardano. The technical component of this proposal is boldly missing. \"It's not immediately clear to me how a dapp gets launched on Cardano, but I doubt it's free.\"  As mentioned before, finding the team to create a proposal will be key for future success. \r\n\r\n*The budget is not outlined clearly and broken down into identifiable items.\r\n\r\n\"I'm was hoping to raise a minimum of 20k, The main use of these funds would go to hiring the dev talent to actually integrate my mvp/beta with the cardano blockchain.  I attended the catalyst town hall today and saw that there is a bootcamp and accelerator phase for projects that get funded.  My request for 20k was to hire much of what it looks like the bootcamp might help cover.  If this is correct then my amount needed might be far less\" indicates a team member with financial expertise would help clarify this crucial component.\r\n\r\n*The budget is not reasonable to achieve the goals as indicated by the proposal. \r\n\r\nThe amount and the target is too vague. Working through a mini workshop proposal with Tevo from the Catalyst School will help clarify the intentions behind this proposal.\r\n\r\n*The proposal does not offer a realistic timetable to complete the work.\r\n\r\nThis is another component that will improve the proposal.\r\n\r\n* The proposal does not provide a logical and conductible plan for implementation that shows what is being done and how it will be completed.\r\n\r\nUnfortunately, there is no verifiable accomplishment of work done that would give me confidence that here is a plan for implementing this proposal nor how it will be completed. \"I have a Beta web app version of the complete platform that should be done and live in Q1 2022.  It will ...\" is indicated with no link included in the proposal. If this work has been done and you are proud of it, please announce it from the mountain tops and include the link :) With wind instruments, the strength comes from your abdomen. If your \"gut\" is not engaged, the notes fall flat. The website is more undeveloped, then indicated by the proposer. It is advisable not to exaggerate qualifications & accomplishments, rather face the voids & find the pieces needed to fill them. When asking for 20K these need to be polished & professional. Please include these in your next proposal. Again, well done for starting the process!\r\n\r\n*The plan does not describe the resources necessary to implement the proposal.\r\n\r\nIn general, these components are lacking & need to be addressed in future iterations.\r\n\r\n*The proposal does not explain technical aspects like architecture, language and technologies as these are crucial for implementation.\r\n\r\nCollaborating with a musical person with experience in blockchain technology and programming will help finetune & bring harmony to this proposal.\r\n\r\n*The proposer has not considered challenges and risks relevant to a successful implementation.\r\n\r\nWe face many unknown challenges... what happens if I write a proposal and it doesn't meet the grade? Will the effort be worth it? Will I be ridiculed for trying? We are reminded every single week at the Project Catalyst townhall that the goal is to \"provide a safe and lively environment for you to explore the highest potential of human collaboration.\"\r\n\r\n***(1) I strongly disagree that the current iteration is highly likely that this proposal will be implemented successfully.\r\n\r\nI look forward to assessing future compositions from the composer/proposer.", "q1r": 1, "q2": "This is an excellent first iteration of a problem needing to be solved. Clarifying both the problem and the solution in future collaborative efforts will improve this rating.\r\n\r\n*This proposal does not have a roadmap. Clarifying and stating milestones and a time horizon for achievement is needed to improve this proposal.\r\n\r\nScrolling through ideascale, proposers have the opportunity to view and emulate what a clear and well defined roadmap/milestones looks like. Referencing a cryptic treasure map is bound to end in more work then necessary to reach the final goal. \r\n\r\n*The metrics/KPIs for the success of the proposal are missing.\r\n\r\nThe \"what or how-to\" is vague in response to the very high level \"Why\" statement: \"Basically, I want to launch this app on Cardano more than any other blockchain by far so however I get the expertise I need, I will endeavour to do it,\" There is SO much potential lurking beneath it. Please dig deeper and articulate, \"Why Cardano\" and above all else, find the \"why\" that gets you up every morning to keep working away at your dreams. How to accomplish this will grow organically from this driving force.\r\n\r\n*This proposal does not have a clear understandable description of the targeted problem.\r\n\r\nThe problem statement, \"The nearly inexhaustible earning ability of music is wasted as a resource due to the current economics of the music industry.\" is further described by one example: \"Music is mispriced currently at almost zero to most consumers due to streaming giants.  .003 cents a stream per average from Spotify.\" Broadening the research and data to validate the problem is actually a problem worth addressing is crucial.\r\n\r\n*This proposal does not have a clear understandable solution to address the problem as indicated.\r\n\r\nThe solution: \"Using a blockchain to remove the middleman, connecting fans directly to artist and then letting artist set their own streaming rates  (letting the market decide), artist income could increase significantly without costing the consumer anymore than they currently pay\" is roughly defined as \"My solution resolves around two key factors:\" 1) Spotify example & 2) the use of NFTs. Again...connection to the experts making NFTs and team work to co-create the solutions.\r\n\r\n*** (1) I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals. I can hear notes and partial riffs of a song yet to be created. Keep playing.", "q2r": 1, "assessor": "z_assessor_500", "no_vca": 20, "ne": 10, "ng": 7, "nfo": 3, "vca_o": 1}, {"q0": "This proposal addresses the main objectives of the challenge, by proposing to Build a marketplace and exchange where artists/fans mint music NFT's representing song earnings. I agree with the problem statement about inefficiency of music industry which cause large portion of earning ability of music wasted as a resource due to the current economics of the music industry. In my opinion the team's idea has potential to solve the issue and democratizing the music industry. The proposed music NFT marketplace is not a new idea and many project has tried to do the same. I would like to see more value differentiation from the project founders in order to ensure the project could survive in the crowded NFT projects.\r\n", "q0r": 3, "q1": "The team does mention relevant experience in the proposal, but it lacks the evidence to back up the claim. The project founder provides details about how to execute the project by providing milestones and detailed roadmap for three, six, and twelve months and breakdown of budget. Even though the proposal mentioned the required total budget, it does not have the detailed breakdown of its budget. My suggestion for the team is to add budget breakdown as well as team member profile that can be verified and pass basic online due diligent.", "q1r": 3, "q2": "The team does provide deliverables, roadmap, and detailed plan on how to execute the project but there are no clear success metrics or KPI in the proposal. There is no budget breakdown in the proposal and team does not mention where they will publish the progress of project execution making it difficult to trace, monitor, or audit the project. My suggestion for the team is to update the proposal with more information and details including budget breakdown. Also, I would like to suggest the team to provide monthly report on the progress as well as budget spending in their website or cardano forum so it can be more accessible and transparent.", "q2r": 2, "assessor": "z_assessor_643", "no_vca": 19, "ne": 3, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "The proposal explains how it could add value to the Cardano ecosystem. However, the propblem statement does not explicitly identify a problem within the challenge which needs to be solved. I would also hope to see a couple of numbers that could represent the potential market size of the music content creators  on blockchain. It is also unclear from the proposal that it's able to scale to address future challenges. Given the asking budget of a maximum amount (50k), I expect more details in the proposal.", "q0r": 3, "q1": "It is helpful to know that the proposer has 30 years in the music and recording industry, both as an engineer and artist. If there is some link to profile pages or recordings that could help me better understand the relevancy of the proposer's experience for this project, it'd be great. In terms of the implementation plan, the proposal provides a high-level timeline and KPIs of features to release but does not specify how he/she would do it from the technicals aspects. The proposer linked the WIP website (https://omlab.io/) which contains the whitepaer, tokenomics information and other very useful information.  Budget-wise, it is indicated from the proposal that most of the asking budget will be used to hire developer, and I'd suggest the proper to further break it down into man-hour for each phase/component of work to help the voters assess the feasibility better.", "q1r": 3, "q2": "The proposer provided a clear roadmap with milestones and a time horizon for achievement. The success is qualitatively defined and would be better to have some quantitative metrics (e.g. number of users) as well. I appreciate that the proposer has a clear understanding of the targeted problem with supported numbers and presented a thoughtful, understandable solution that addresses the problem.", "q2r": 4, "assessor": "z_assessor_684", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "This project is peer-to-peer, yes, but not of a financial nature, this is a project that is digital rights and access activity, and therefore does not meet the exchange threshold of transferring ownership or owned-options.", "q0r": 2, "q1": "This proposal contains many many steps inside of the stages mentioned. Anyone of them could prove fatal for this project, eg per-transaction costs when not using ADA as currency.\r\nThe proposal does not include a plan to meet and overcome each of the significant hurdles. ", "q1r": 2, "q2": "The proposal does not lay out the technical progression and since the technical requirements are large with this project, it does not provide the community with a sense of if it is on track or ill-starred.", "q2r": 2, "assessor": "z_assessor_701", "no_vca": 18, "ne": 0, "ng": 11, "nfo": 7, "vca_o": 1}, {"q0": "The problem statement is instead an ocean of posibility for the NFT entertainment industry in Cardano blockchain. Instead thiking about the solution is Audio/ or Spotify on the Cardano blockchain. The solution aiming at builidng a marketplace for these solution", "q0r": 4, "q1": "The team leader is well-published and they show the expereince in the Music Economy. ALso, their is WIP demo of omlab.io The tokenomics and ranking of the NFT is not clearly proposed yet should be  an improved points to see how they implement this project. The proposer adamant that they will continue the project whether got funded or not is a plus point", "q1r": 4, "q2": "The project stated that now it is 60% on the demo web, however plan is full year 2022 with the launch plan is end of 2022. The justification for the budget mentioned 20k should be a great deal of help for voters.", "q2r": 3, "assessor": "z_assessor_782", "no_vca": 16, "ne": 1, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "NFT trading is very developed now and decentralized exchanges for NFT trading will be a great idea and have a big impact on the community. However, I don't quite understand why the proponent suggested this challenge. According to the description, the proponent is only working on creating NFTs of music products and intends to create an NFT DEX. But it doesn't give any solution as to how the protocol works. At least we should waiting for a proof of concept from proposal to assess the impact of proposal", "q0r": 1, "q1": "Proposer did not provide any information to check they \r\n experience. I checked proposal's website and there is nothing also.\r\n I only saw the proponent raise the idea of an NFT DEX but did not see any mention of a technical solution, how the protocol works. Building an NFT DEX will be completely different from a regular DEX. I consider the proposal to just stop at the idea stage. So I don't think this is feasible because this challenge is for explicit Defi suggestions.", "q1r": 1, "q2": "As i mentioned in feasibility section that \r\n proposal can not be funded. So i suggest we\r\n no need audit this proposal. In addition, Proposal\r\n also doesn't has KPI and funding breakdown.", "q2r": 1, "assessor": "z_assessor_783", "no_vca": 21, "ne": 1, "ng": 14, "nfo": 6, "vca_o": 1}], "solution": "Construir um mercado e intercâmbio onde os artistas/ fãs de música de hortelã NFT's representam os ganhos da música. O custo do streaming é definido pelo artista/mercado.", "experience": "Trinta anos na indústria da música e da gravação, tanto como engenheiro quanto como artista de turnês e gravações internacionais. Técnico geek ao nascer"}