{"id": 381787, "author": "rodrigopacini", "title": "Distributed Decision Making", "url": "https://cardano.ideascale.com/a/dtd/381787-48088", "category": 26257, "amount": 300000, "description": "2022年に向けて、Catalystコミュニティが分散型の意思決定を行うためにはどうすればよいでしょうか？", "funded": 1, "upvotes": 58062308, "downvotes": 16572991, "votes_result": 41489317, "votes_cast": 270, "f6_no_assessments": 4, "f6_rating": 4.416666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis proposal supports the strategic goal  Fund8 strategic goals to make Cardano into open-source project, for which a well-functioning governance model is required.\r\n\r\nAt the same time, the proposal does not provide a detailed overview of the current issues with Catalyst/Cardano governance and their estimated impact on the community. \r\n\r\nI have made the following deductions:\r\n- 1 point because this initiaitve supports only one of three strategic goals of Fund 8.\r\n- 1 point for the lack of a clear analysis of the problem.\r\nMy rating is 3.", "q0r": 3, "q1": "The Catalyst community is experienced in distributed decision making because the community itself is run using these principles.\r\n\r\nAt the same time, the proposal does not provide an analysis of the specific problems with Catalyst governance (just some implied complaints about IdeaScale) or present a vision for areas where improvements can bring the most impact. For example, such as scalability to more participants, etc.\r\n\r\nIn addition, the proposal does not discuss recent success stories, helping to understand the impact and the necessary funds to make a noticeable impact.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific problem cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposal sets metrics (the participation in voting, etc.) that can track some progress towards a better governance system.\r\n\r\nAt the same time, the proposal does not provide a definition of the objective of well-functioning governance (such progression at the maximum speed allowed by available resources towards the cardano mission) nor presents smetrics to measure the progress towards that goal.\r\n\r\nThis proposal could be stronger if it considered some of the following metrics or ideas:\r\n1) the % of global population that uses Cardano for social and financial use cases.\r\n2) the acceleration in the adoption due to improvements in governance.\r\n3) The community satisfaction with its governance processes vs that of competing projects.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.\r\n", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 25, "ne": 4, "ng": 14, "nfo": 7, "vca_o": 1}, {"q0": "Distributed decision making is the heart of Cardano's mission but it only meets 1 strategic goal. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The budget is moderate and Catalyst community is clamoring for a better decision making process so I strongly agree the community has the capacity to address the challenge.", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 21, "ne": 1, "ng": 14, "nfo": 6, "vca_o": 1}, {"q0": "I completely agree that this proposal is important and urgent as decentralized and high-quality decision-making will increase the ROI of the treasury and thereby improve decentralized governance, ensure transparency, accuracy in improving issues and common aspects.\r\nTherefore, I strongly agree with this proposal's alignment.", "q0r": 5, "q1": "This challenge has been run in F5 and F6 with many proposals approved by the community. Therefore, the community is now ready in many ways to accept this challenge.\r\nI strongly agree with this proposal's feasibility\r\n", "q1r": 5, "q2": "Success criteria are related to challenging goals. I think the \"re-election rate\" should be reconsidered because of the potential for increased centralization and conservatism.\r\nAfter all, I strongly agree that success criteria and suggested metrics are set correctly to measure progress in addressing the challenge", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "Improving decision making is essential to Cardano's mission as the number of Catalyst Proposals increase. For example, with F7 it becomes hardly possible to any member to read through all proposals, CA or voters could be discouraged, resulting in a poor quality decision making process.", "q0r": 5, "q1": "Decentralised decision making is the heart of a decentralized governance, so this challenge will probably receive many proposals. This challenge has been set in previous funds, leading to tools that are widely used todays (CA or VCA tools, Voter helper tool).\r\nThe guiding questions and directions for proposers are relevant and inspiring, which should ensure good quality proposals.\r\n", "q1r": 5, "q2": "The challenge team as defined specific rules for budget distribution, which is new for a challenge definition, in order to reach a greater divertsity in projects. \r\nAll suggested key metrics for proposals aim at measuring if -and how much- proposals will improve decision making. They are precise and can be estimated. This will help proposers offering good quality key metrics for their projects.\r\n", "q2r": 5, "assessor": "z_assessor_78", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}], "importance": "質の高い分散型の意思決定は、財務のROIを高め、分散型のガバナンスを正当化します。", "success": "このコミュニティは、意思決定プロセスを意識的に改善しながら、献身的で協力的なリーダーたちを育てています。"}