{"id": 382642, "author": "cautiousfox", "title": "The Great Migration (from Ethereum)", "url": "https://cardano.ideascale.com/a/dtd/382642-48088", "category": 26257, "amount": 500000, "description": "dAppsやその他のプロジェクトがEthereumからCardanoに移行する際に、どのようにして簡単かつ迅速に拡張したり、完全に移行したりすることができるでしょうか？", "funded": 2, "upvotes": 91910012, "downvotes": 7241397, "votes_result": 84668615, "votes_cast": 366, "f6_no_assessments": 4, "f6_rating": 3.75, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThis proposal aims to increase the number of Dapps in the Cardano ecosystem, which supports the strategic goal of Fund 8 to grow the app ecosystem\r\n\r\nAt the same time, this proposal does not explain why constraining the focus to only one alternative ecosystem, will provide a higher ROI to the community in comparison with an uncosntrained evalution of proposals for new apps and integrations.\r\n\r\nThis proposal can be improved if it clearly explained why focusing now just on Ethereum developers has a higher ROI to the community that any other group of developers. \r\n\r\nI have made the following deductions:\r\n- 1 point for supporting only one out of three strategic goals of Fund 8.\r\n- 1 point for not providing the rationale for constraining the focus.\r\nMy rating is 3.", "q0r": 3, "q1": "While in principle the technical migration shall be possible and the Cardano community possesses the neccessary skills, the proposal does not describe in details which specific technological problems need to be solved, making it hard to judge if all the necessary skills and resources are there and if a noticeable progress can be made.\r\n\r\nThe proposal would be stronger if it took time to analyze the major technical blockers for Cardano adoption and showing which impact can be expected from solving each.\r\n\r\nI have made the following deductions:\r\n- 1 point for insufficiently clear definition of the blocking issues.\r\n- 1 point for the lack of clear overview of the resources necessary to solve each of the blocking issues.\r\n- 1 point for the lack of discussion of the progress that can be made with the requested resources.\r\nMy rating is 2.", "q1r": 2, "q2": "The proposal defines two metrics (the number of projects that migrated and their number of users) which do help to track some activites.\r\n\r\nHowever, given the presented problem (quicker Cardano adoption), the proposal can be improved if it considered the following metrics:\r\n1) The % of Cardano users relying on apps migrated within this initiative.\r\n2) The share of the transaction volume created by the apps migrated wihtin this initiaitve.\r\n3) The developer satisfaction of the migration process in comparison to competing ecosystems.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics tracking the impact on the cardano ecosystem.\r\n- 1 point for the lack of metrics analysing developer satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 25, "ne": 3, "ng": 13, "nfo": 9, "vca_o": 1}, {"q0": "The challenge provides space for interoperability between Ethereum and Cardano ecosystems. Creating easy onboarding for projects to move from EVM-based blockchains to Cardano's eUTXO models is one of the most important goals for Cardano ecosystem.\r\n", "q0r": 5, "q1": "Challenge brief states that many efforts are currently underway, like ERC20 Converter, these projects are reaching point of maturity. There is big demand for new tools needed for successful migration, so it is time to start inviting new projects to Cardano.\r\nI strongly agree with this statement.", "q1r": 5, "q2": "As a key metric I suggest to take the wording from \"What does success look like?\", and make it the primary key metric. The final stage, to identify the success as complete, the integration of an EVM project to the Cardano blockchain.\r\nThe first key metric in the challenge is more for a metric of the challenge itself, instead of being a metric for the future proposals. As to not create any confusion, there should be some editing done. Other metrics mentioned are acceptable.", "q2r": 4, "assessor": "z_assessor_276", "no_vca": 19, "ne": 3, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "Facilitating Ethereum users to migrate to Cardano would be a significant contribution to the ecosystem and as such aligns with Cardano's mission and 1 strategic goal. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "The challenge lists a number of initiatives nearing completion that make this challenge more feasible although the fact that these projects are still not live does pose some risk. The budget amount is moderate compared to the total budget and in line with the scope and potential benefits of the challenge.", "q1r": 4, "q2": "As indicated in the challenge itself the metrics can be improved upon however as defined they do provide minimal progress measurement.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}, {"q0": "Yes and no. What makes a proposal like this interesting is that it's a question of strategy. I think it's fair to say that a migration of this sort is something that could easily take place without a targeted challenge like this ever being posed. Competing with blockchains, and especially Ethereum, which have flaws that Cardano does not share, is critical. But is targeting Ethereum and its flaws for competition specifically through our project funding mechanism critical? I think this is debatable! And it's a good question for the community to weigh in on. ", "q0r": 4, "q1": "With smart contracts in full swing, one could posit that this sort of project is something Catalyst is well-suited to do in a way no other existing blockchain governance system is. It's such an outwardly competitive idea, it would be interesting to see just how much a challenge like this would indeed animate the community into action. One could even think of it as a test of our existing structures and community.", "q1r": 5, "q2": "There's something of a gap here in the proposal as-written. OK, we want a head count of people who migrate? Sure. But not all development projects are equal. We want successful projects, not just any old project, right? How do we measure quality here? Here's another fun angle to consider as a measure of success: What if through targeted efforts like this, we gave ole Ethereum a kick in the pants and motivated them to make key approvements to their own blockchain? Then their success would also be our success, wouldn't it? What I'm saying is, there's a lot of room for setting targets here, and it couldn't hurt to be broadminded about it.", "q2r": 2, "assessor": "z_assessor_853", "no_vca": 16, "ne": 3, "ng": 12, "nfo": 1, "vca_o": 1}], "importance": "多くのプロジェクトがEthereumのようなEVMベースのブロックチェーンに行き詰まっており、逃げ場を探しています。Cardanoは、より速く、より安く使用することができます。", "success": "EVMベースのブロックチェーンで立ち上げることを計画していた、または立ち上げたプロジェクトは、Cardanoのエコシステムで展開し、それを簡単に行うことができます。"}