{"id": 367075, "author": "", "title": "Automated Phishing/Scam Detection", "url": "https://cardano.ideascale.com/a/dtd/367075-48088", "category": 26110, "amount": 10000, "description": "Cardano giveaway scams are on the rise, with of users losing millions of USD via these scams. We need scalable ways of defending users.", "f6_no_assessments": 5, "f6_rating": 4.866666666666667, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=14510"], "media": [], "f6_assessments": [{"q0": "Awesome proposal by a team that has already built a PoC and detected 300 scams. ", "q0r": 5, "q1": "The proposers obviously have the experience and have already built an operating PoC system. They have a clear plan with timelines and deliverables.  This seems like a slam dunk to fund the expansion of this system to help protect ADA users and the reparation of Cardano worldwide.", "q1r": 5, "q2": "The proposers have clear plan to expand their current system, thus should be easy to audit progress. They have set clear goals for success based on both number of scams found and adoption by stakeholders. Though it should be noted clear success in this project would hopefully drop the number of scan attempted thus a fall at some point in detected scam may not be a sign of failure. ", "q2r": 5, "assessor": "z_assessor_11", "no_vca": 13, "ne": 4, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "Scams really are something in the spotlight today, especially in the crypto world, as mentioned in the proposal. Cardano, as one of the blockchains with the highest standards of quality, and the community also should come up with ways to avoid scams and other negative aspects of the ecosystem. This proposal is very well aligned with the challenge and it also has a very high potential impact, especially if it gets integrated with other platforms. Some ideas for spreading the word about it have already been presented, and there is also another proposal submitted in the same challenge that aims at creating a browser add-on to alert users about scams, which could be a possible partner. If all goes all, this proposal will have a huge impact on the Cardano ecosystem as a whole. Score: 5", "q0r": 5, "q1": "The feasibility of this project is very good, starting by the already made Proof of Concept. The proposers already have a dedicated Twitter account serving as the front-end for a PoC of this phishing/scam detection project, so it really lowers any risk of not being able to deliver the project. Also, the proposing team has an extremely relevant and related background regarding the project's objectives. The roadmap is clear, month by month updates. It would only be good to add partial milestones, if possible, and a bit more explanation about the cost of the development. But based on the overall aspects, my score is still 5.", "q1r": 5, "q2": "The roadmap is well explained and defined, with dates for each of the developments. Although, some partial deliverables could improve the proposal's auditability. Some metrics regarding the success could also be included, such as a goal for number of followers/users in a period of time, number of partnerships for marketing, number of suspicious projects that were later on confirmed to be scams/phishing, etc. Also, some more details about the budget would be necessary to keep track of the project general expenditures and remaining budget along the way. Score: 4", "q2r": 4, "assessor": "z_assessor_31", "no_vca": 10, "ne": 5, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is completely in line with the challenge, and provides clear descriptions of how the tool will reduce incidence of scams. The proposal also provides examples of past successes, which is encouraging for the future. I wish a little more would be said about how fast Youtube and ISPs can react, however, as reaction time is key to mitigating these scams. It is also good that the proposal already identifies potential users (ISPs, wallets, etc...) which makes complete sense.", "q0r": 5, "q1": "The current progress of the project and the commitment of the authors makes me confident that it will be implemented, or rather improved, successfully. The plan for the next steps is laid out clearly and makes sense.", "q1r": 5, "q2": "The absence of open source, while completely justified, makes it harder to monitor day to day progress. The use of twitter as a mean of communicating results is a good start, however, and the availability of an API will make it possible to monitor how many scams the bot identifies.", "q2r": 5, "assessor": "z_assessor_318", "no_vca": 11, "ne": 1, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "This challenge asks how we can proactively identify systemic threats before they become a significant problem. This proposal addresses this challenge by using software to detect scams and notify the community of these scams proactively. \r\n\r\nThe solution statement of this problem is clear regarding the rise of scams in the ecosystem and needing a scalable way of addressing them. The solution statement clearly states that the team wants to build a scalable way of monitoring, detecting, and reporting scams as they arise in realtime.\r\n\r\nThe team behind this proposal has already built out this solution and clearly demonstrated the scalable outcomes. They currently have a software which scans registered websites for giveaway scam terms and then reports these websites using twitter. The current results speak for themselves and the impact and scalability is undeniable. \r\n\r\nThe future roadmap significantly extends the functionality of this project making it more resilient and robust while also extending functionality.\r\n\r\nI give this proposal a rating of 5 for impact. The results so far are incredible and more funding/resources for this project will have extremely high ROI for the community.", "q0r": 5, "q1": "The current state of the project clearly demonstrates the feasibility of the future work for the project. The hardest part of any product is getting off the ground and that has already been completed. \r\n\r\nThe team behind this proposal have great credentials with decades of software experience and graduate degrees. \r\n\r\nThe month by month breakdown of the future goals of the system are very systematized and well thought out. The team is going for resilience and robustness before features which is a very sustainable approach to the problem given the adversarial nature of scam detection.\r\n\r\nI give this proposal a score of 5 for feasibility considering the nature of the team, the current success and the well thought out roadmap.\r\n\r\nIn the future I would like to see a link to the github profile of the main software author even if this specific project is closed source.", "q1r": 5, "q2": "The highly technical nature of this proposal makes it hard to audit the completion of the monthly goals, especially if the code/infrastructure is closed source. \r\n\r\nThe lack of github repository makes it hard to audit code improvements in a public way. However, given the nature of the problem the code can't be made public. It's a weird catch-22 type situation.\r\n\r\nThat being said, the metric that matters the most is the number of scams this tool catches and that is easy to audit and will grow as the capabilities of the tool grows. \r\n\r\nIt would be great if there was more of a cost breakdown for how the funds will be used. However, given that so few funds are required for such a high impact project I don't weigh this factor heavily.\r\n\r\nI give this a score of 4 for auditability because the closed source code is suboptimal (though required) but the output metrics (scams detected) can be made very public and visible.\r\n\r\n", "q2r": 4, "assessor": "z_assessor_531", "no_vca": 8, "ne": 5, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "A targeted, technical and passive approach to addressing a well known-problem for Cardano as well as the broader crypto industry is presented to a high standard by this proposal.\r\nCompared to other proposals in this challenge which are attempting to address the same problem, technical approach stands out, as it presents a passive approach, offering the community a sentinel that is keeping a watchful eye for scams only moments after the websites used by the scammers have been launched. Requesting only 20% of the challenges total funds, I see this as an effective use of treasury funds.\r\n", "q0r": 5, "q1": "The proposal already has a working prototype, which validates the idea and the reported metrics referenced in the proposal. The team members have the necessary experience, and the YouTube video appearance on the Learn Cardano podcast provides the in-depth background while also providing the necessary \"proof-of-life\" to validate their expertise.", "q1r": 5, "q2": "Roadmap items and deliverables are realistic and attached to timelines that allow the auditability of this proposal if funded. The proposal does a good job of referencing potential risks and challenges, such as anti-evasion mechanisms before they become an issue", "q2r": 5, "assessor": "z_assessor_590", "no_vca": 9, "ne": 1, "ng": 8, "nfo": 0, "vca_o": 1}], "solution": "We propose a scalable system for the automated monitoring, detection, and reporting of new Cardano giveaway scams, as they arise.", "experience": "PI: Cybersecurity researcher, experience in identifying/tackling malicious content.\n\nCo-PI: Stake-pool operator, Cardano Podcaster, Web dev."}