{"id": 367015, "author": "", "title": "Scam Alert", "url": "https://cardano.ideascale.com/a/dtd/367015-48088", "category": 26110, "amount": 9884, "description": "New people in the crypto space fall for scams all the time. Organizations, and individuals within the community receive threats of violence.", "f6_no_assessments": 6, "f6_rating": 2.388888888888889, "videos": [], "media": [], "f6_assessments": [{"q0": "Great idea. Unfortunately the proposal is lacking in details. How is this to be hosted for instance?", "q0r": 3, "q1": "As no detailed plan on what will be delivered when has been provided high likelihood of success cannot be given. A placeholder GitHub is linked which merely has a 1 line readme file in it.", "q1r": 1, "q2": "As there are no deliverables or timelines progress of this proposal cannot be audited. What would define success? How many scams alerted? How would you deal with false alerts? ", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 21, "ne": 4, "ng": 10, "nfo": 7, "vca_o": 1, "reply": "Where the project is hosted is irrelevant. It might be okay to host on Heroku, it may need be better to host it on AWS or GCP. How is this relevant? The \"great idea\" is so simple that it does not need a detailed plan. As for auditability, this is where the almost empty (cause not funded) GitHub repository comes into play."}, {"q0": "the proposal fits well into the challenge, but with the experience available, the solution should be described in more detail so that everyone can understand it. an example image of a \"scam alert\" would additionally clarify the description. the final product cannot be clearly determined with the information available and offers room for individual interpretation.", "q0r": 3, "q1": "the funding is very general. for better comprehensibility it should be described in more detail. especially the lagest part \"labor costs\". additionally it should be described how the monthly costs of 182 dollars can be earned after successful implementation. ", "q1r": 2, "q2": "\r\na roadmap and milestones have not been described, but are necessary to monitor the success of the project and should be included in the next proposal. \r\n\r\nin addition, you could describe how many users you want to reach to define an approximate measure for the success of the project. probably many newcomers to the cryptoscene fall for scams. one objective could be: how can you effectively reach \"newcomers\"?", "q2r": 3, "assessor": "z_assessor_260", "no_vca": 10, "ne": 3, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "The risk of losing money to scams is really something that holds back many people that are willing to enter the blockchain world, and also people who already are a part of the ecosystem. Cardano, as it's being built with the highest standards in many aspects, should have a way to verify and alert it's users when a project is possibly a scam. This project, if delivered, could impact millions of users in a very positive way. Although, the project lacks details regarding how this would be implemented and what kind of warnings it would give to users. Also, criteria for defining the risk of a specific project would be something nice to add, besides only categorizing them as scam or not. A very good idea, but these mentioned information are lacking and it would be great to see this proposal re-submitted with more information if it doesn't get Funded in Fund6. Score: 4", "q0r": 4, "q1": "The proposer has very relevant experience, since he's an experienced developer, Cardano Ambassador, Plutus Pioneers, besides also being a very active Catalyst community member. This makes me believe that he can deliver a project in this area without much trouble. Unfortunately, the proposal lacks information regarding the plan of development. It doesn't explain the technical details about how it would be implemented, who would be the mentioned 3rd parties, The budget is not so detailed as well, since only lump sums of each aspect are presented. Since the proposer doesn't discuss the technical aspect of it, which would be interesting to know more about especially because I'm also a developer, it's difficult to know if the proposed budget is appropriate or not. Some information about possible risks could also be discussed here. Much information is missing regarding the feasibility, as mentioned, and it would be good to have them included in a future re-submission. Score: 2", "q1r": 2, "q2": "This proposal lacks information about it's auditability. It would be good to add, in a future re-submission, a roadmap with the development plan, milestones and partial deliverables with specific dates. Also, some KPIs and success metrics after 3, 6 and 12 months could be included. All of this could improve a lot the proposal's auditability, since currently there is not information provided to help the community in following up the progress of this proposal when funded. Score: 1", "q2r": 1, "assessor": "z_assessor_31", "no_vca": 15, "ne": 4, "ng": 7, "nfo": 4, "vca_o": 1, "reply": "Development of the project (if funded) would appear on the provided GitHub repo. Thus, I perceive the auditability score of 1 as unfair."}, {"q0": "My feeling is that this proposal would have benefited from more preparation and in-depth analysis of anti-scam tools if they exist and/or information about why has this not been resolved yet. It is a pervasive problem for sure, but if it were simple to resolve it - it probably would have been tackled successfully. So, a presentation of the main difficulties/challenges could have been good (categories of scam, identifying scam attempts, platforms that are used, methods that re used, why big tech is failing, etc...). I like the proposed approach of setting up a community-moderated scam database, open API, a web interface and browser extension that warns users of scams. But - it would be good to present examples of how effective has this approach been in other fields/IT circles or markets ... or even other blockchain communities. More questions emerge as soon as one proposes a solution. How easy will it be to use it? Will the community be compensated for populating the database? Will scammers be able to subvert the database by reporting genuine users? How will someone remove their name from a blacklist? How will this be maintained longer term? Furthermore, the problem statement does mention that \"New people in the crypto space fall for scams all the time\" - it would be good to focus on this group of new users - who are much less technically minded than the first and second wave of adopters. Many have lower IT skills, may not speak English and/or may not even be able to use browser extensions. A build-it and they-will-come approach may not end up resolving the problem.. This text you are reading has around 300 words and proposal around 130, which may be one of the problems – it is too brief to give a good picture of its proposed effectiveness. So, the proposal - narrowly speaking addresses the challenge - but I disagree that it \"effectively addresses the challenge\" and I would suggest a more comprehensive approach that might even be broken down in stages if the proposal is not voted in this time. This could be a valuable tool, but it would benefit from a long-term nurturing vision. ", "q0r": 3, "q1": "The proposer has listed relevant technical references for building the proposed tool and has a budget. However, will the budget be reasonable to achieve the set goals? Namely, a scam alert that goes online and is not maintained regularly and in real-time may be as good as an antivrus without definition updates. What is missing in my view is a vision for how to ensure a long-term viability of this scam alert mechanism - and a budget and a plan for that. If the proposer has a solution or possible ideas/paths, this proposal would have benefited enormously from some planning for the mid- and long-term. The CA guidleines indicated that the proposer should provide a \"sensible and conductible plan for implementation that shows not only what is being done but also how\". So, effectively this proposal does explain what is being done ... but I am not sure about how will this tool survive. I am not convinced the proposer has considered challenges and risks relevant to a successful implementation, apart from the narrowest technical implementation. For example, building a blockchain is easy today - technically one can clone it, but building a community around and maintaining it is difficult. Here, I see a similar problem. ", "q1r": 2, "q2": "The proposal does have a roadmap with milestones and a time horizon for achievement, as well as Metrics/KPIs that define the success of the proposal. What I do not agree fully with is that the proposal provides a clear understandable description of the targeted problem - meaning that its success may be limited. I think the proposed approach is limited by the narrow scope of building a tool. The issue of whether this tool (without plans for future maintenance) will suffice to address this large challenge (a functioning scam alert in the future) ... is glossed over. This in my view means that the proposal does not provide a clear understandable solution that addresses the problem. Rather it provides a partial solution - in the form of a tool. Let's make no mistake, this can be part of a wider attempt to resolve the issue of scams in crypto space - but then the proposal should indicate how it views its own role as part of the wider picture and what will be the outcome of its implementation. Even some minor details that could be explained in more detail - have not been explained. For example, the proposed browser extension that warns users of scams. Which browser will be targetted, how will the add-on be maintained as the browser platform evolves, which types of scams will be in its crosshairs specifically? With a proposal this brief on detail and implementation vision, the sky is the limit ... but in reality, with no meaningful future targets in terms of scam alerts, or ways to motivate the community to participate and metrics in terms of desired scam detection rates - it may have minimal impact. I would suggest to the proposer - if the proposal is not approved in this fund - to think hard about not only the technical aspects, but also about the hurdles that such scam detection systems face today ... and to layout a longer-term vision for the success of this project - by building on models that are already successful or tying it in with Cardano's smart contracts for rewarding the participating community. ", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 8, "ne": 4, "ng": 3, "nfo": 1, "vca_o": 1}, {"q0": "The Proposal sufficiently addresses the Challenge Topic with a clear problem statement on a currently important issue.", "q0r": 3, "q1": "In Contrast to the clear problem statement, the proposer lacks a clear and understandable description of how the addressed problem might be solved. The presented solution does not present sufficient information or details about the solution execution even if the relevant experience of the proposer does indicate enough experience to solve the addressed problem. The feasibility to successfully implement this proposal is insufficiently explained.", "q1r": 2, "q2": "The proposal does not provide any roadmap or clear goals which allows the community to verify if the proposer achieved his milestones through the described execution of 1 year. The github link does not contain any detailed information which makes it difficult to hold the proposal accountable on its execution when receiving funds.", "q2r": 1, "assessor": "z_assessor_362", "no_vca": 11, "ne": 1, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "Development of the project (if funded) would appear on the provided GitHub repo. Thus, I perceive the auditability score of 1 as unfair."}, {"q0": "The proposed idea is a direct response to half of the challenge.  The scam and threat portion.  How would this protect individuals receiving threats of violence?\r\n\r\nGiven the requirement for the database to be populated by the community someone will likely learn the hard way before this is effective.  Is there a means to get in front of this happening?    ", "q0r": 3, "q1": "Listed experience is applicable to the implementation of stated plan.  Budget is precise and reasonable. ", "q1r": 4, "q2": "Is there a timeline?  What line items of progress could be listed to gauge progress?  ", "q2r": 2, "assessor": "z_assessor_521", "no_vca": 10, "ne": 0, "ng": 8, "nfo": 2, "vca_o": 1}], "solution": "A community-moderated scam database, open API, a web interface and browser extension that warns users of scams.", "experience": "20 years professional software/web development experience, Cardamo Ambassador (moderator of Stack Exchange), Plutus Pioneer, Fund5 CA"}