{"id": 369227, "author": "", "title": "CARDANO DLT-360 RISK RADAR", "url": "https://cardano.ideascale.com/a/dtd/369227-48088", "category": 26110, "amount": 30000, "description": "CARDANO and the DLT-space are still very new to the world, with expected and unexpected risks and opportunities arising along the road.", "f6_no_assessments": 4, "f6_rating": 4.25, "videos": [], "media": [{"url": "https://drive.google.com/file/d/1kelOpbAGz7zTJrLATHXDjy_yhyRuhzMS/view?usp=sharing", "title": "CARDANO DLT-360 RISK RADAR - Video"}], "f6_assessments": [{"q0": "Impact? Hell (pardon my French),  my opinion is that this is an amazing proposal. It fully encompasses the spirit of the challenge - which is to create a tool, a mechanism, a system that can alert the Cardano ecosystm and all of its moving and evolving parts of impending threats. But the thing that makes it exceptional is that this is a proposal tailored for the benefit of everyone - from Fortune 500 companies to the savvy personal investor. Everyone wants risk to be quantified and well presented. The problem with an up and coming new segment of the economy is that not everyone can do risk management on the fly. We need tools [surveys, databases, presentation layer], we need systems [DLT-360 RISK RADAR], we need reports [quarterly reports to the community], we need communication platforms a foundation for stability. I think this proposal does it.  Furthermore, the proposer does not reinvent the wheel - but helps Cardano to benefit from the existing ISO 31000 compliant risk management framework. Who the hell cares about ISO31000? Well big business and institutions do. ISO 31000 is an international standard that provides principles and guidelines for effective risk management. Win-win for Cardano and major players in e.g. industry, finance, education, healthcare or government who want to utilize a public blockchain and be able to assess risks. The proposer has been careful not to focus on a narrow slice of possible threats and has taken the hardest, but potentially the most rewarding (for the ecosystem) approach - by not prejudging outcomes and categories.  The Cardano blockchain itself is a very ambitious and exponentially growing techological platform, so it does need an equally ambitious risk alert system and the proposer also envisage a future path for the radar by proposing to develop terms & conditions for making this to a ongoing quarterly format. This is why I think this proposal effectively addresses the challenge.", "q0r": 5, "q1": "Let me sum it up first in one sentence. For me this is a five-star proposal for a novel, surprise challenge that was voted in by the community. A complex proposal such as this - for a system-wide challenge such as Cardano Emerging Threat Alarm - requires a special big-picture vantage point and an experienced team leader. The proposer seems to have these traits (the proposal's comprehensive approach is a big GREEN flag) and the fact that he is a prominent figure in industry makes the proposer a welcome addition to Catalyst. Specifically, the proposer is Heinz Gassner, the current Global Director Tech Supply / Digital Transformation Supply Operations at Anheuser-Busch InBev the world's largest brewer.. The information is available on the proposer's Linkedin profile. Mr Gassner  has more than 30 years of experience in leadership positions. I see a firm and promising structure such as a sensible implementation plan and a well-thought roadmap for emerging challenges, including securing a certain degree of independence, but balancing it out with maintainance of ties to the Cardano Community and/or Cardano Foundation. I especially like the fact that the proposer has provided a summary for community advisors (and voters) addressing (1) Impact / Return of Intention (2) Feasibility and likelihood to succeed and (3) Auditability. For voters what matters is that this is NOT a solo moonshot attempt by an individual as the proposal envisages the setting up of a diverse team of inter-disciplinary contributors from industry-, university, regulatory partners and specific subject-matter-experts. Two alternative revenue streams are proposed for the sustainable operations of CARDANO DLT-360 RISK RADAR. Communication channels are to be provided, a roadmap and a MVP-version of the services to the Cardano community. The output will be two live examples (in FEB/MAR 2022 and then in MAY/JUN 2022) of a quarterly report to the community with proposals on the further path ahead. Definitions of success were provided. I can't wait to see the product. One final note, the proposer is offering to co-finance part of the implementation by absorbing certain costs (specifically for Team formation, Delivery of draft- and MVP version of the reporting service, Summary and terms & conditions for making this to a ongoing quarterly format). I say power up the engines & full steam ahead. \r\n", "q1r": 5, "q2": "If this is about clarity and auditability (spoiler alert: it is) - well good, good and great for the proposer, Mr Gassner  - as I would want this guy writing my project proposal for anything in life. Be it a job application, a proposal to build a new school gym or ... drumroll create and implement a Cardano Emerging Threat Alarm. Is it auditable? It clearly is with 3, 6 and 12-month mileposts and deliverables. There is a public launch date for Q1 2022 with a complete MVP service presentation live in Q2 2022... Is the proposal unclear about something essential? No. Is it auditable? Yes. The deliverables and stepping stones are all there: formation of a frontend core-team of high-reputation experts, formation of the required backend team, development of basic strategies, structures and processes, implementation of ISO 31000 compliant risk management framework, establishing the basic tool environment (surveys, databases, presentation layer)... and so on.. until the product is set up for development, slapped into shape and set free for the community to benefit. We have to be aware that what is being proposed for development here is a unique product/structure - not a DApp, not a smart contract, not a developer tool or an SDK. It's not a \"hire-me-a-programmer\" type of problem and solution. It is a step-by-step approach to to address all the 'complex technological, economic and social components' that accompany blockchain-related risk specific to Cardano. For the benefit of the small guy and the big players. And the proposer wants to do this by implementing a professional risk assessment process following the ISO 31000 industry-standard. It's time to release the beast of a proposal that this seems to be, put popcorn in the microwave and make Cardano even greater again. ", "q2r": 5, "assessor": "z_assessor_35", "no_vca": 7, "ne": 7, "ng": 0, "nfo": 0, "vca_o": 2}, {"q0": "The proposal adresses the challenge in an excellent way and seems a very good solution to detecting emergimg threats.", "q0r": 5, "q1": "The plan is very well structured, reflected and comprehensible. The proposer is transparent about his qualifications and seems up to the challenge. Slso Kusos to the fact that he is to cover some of the costs by himself.", "q1r": 5, "q2": "The key metrics and success kriteria are comprehensive and clearly written. The product in itself is supposed to adhere to concrete industrial norms. It should really possible to audit the progress and success of this proposal", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal has presented a valid identified problem  and seeks to address the issue with a unique visual radar powered by a recognised risk assessment framework. This is a really good idea and has merit. However, the proposal contains a number of gaps that could have been tackled prior to submission of the proposal that would have greatly improved its assessment status from a value to the community perspective. The most pressing for me is that a team to produce the MVP has yet to be formed. \r\n", "q0r": 4, "q1": "The proposer appears well experienced in business and business solutions. The skillset presented suggest qualities that would be useful to the project are present and this adds potential to the proposal. . being suggested. No examples of previous work were included which would have strengthen the submission considerably. I would have liked to have seen further discussion through example of the proposers understanding of risk measurement via graphical interface. With the team has not yet been identified there appears to be some work yet before the actual MVP could be produced. ", "q1r": 3, "q2": "The idea is sound and shows good understanding of an instrument that may add value to the community. The budget has gaps that need refinement and without a team the entire project is itself at risk of not being successfully implemented. The proposer would have mitigated this somewhat if work could be seen to have been commenced. This could be achieved either through collaboration with community members or greater detail of the brief that would be provided to the IT team for MVP being discussed. ", "q2r": 2, "assessor": "z_assessor_53", "no_vca": 11, "ne": 0, "ng": 6, "nfo": 5, "vca_o": 1, "reply": "In my opinion, this CA has not sufficiently understood this Challenge Setting and/or the scope and content of this proposal. \n1) Quoting the CA: 'I would have liked to have seen further discussion through example of the proposers understanding of risk measurement via graphical interface'. \n--> I come from more than 30 years in industry leadership positions, with wide experience in major Risk Management Frameworks. I think that there is a fundamental misunderstanding about what is actually proposed here. This proposal is NOT at all about any risk measurement via graphical interface (???). \n2) Quoting the CA: 'The budget has gaps that need refinement and without a team the entire project is itself at risk of not being successfully implemented. The proposer would have mitigated this somewhat if work could be seen to have been commenced. This could be achieved either through collaboration with community members or greater detail of the brief that would be provided to the IT team for MVP being discussed. \n--> Well, the proposal is about bringing state-of-the-art industry approaches & established expertise into this community. I have stated that any currently uncalculable costs will be carried by me personaly.  I have no idea what this CA means by:  'greater detail of the brief that would be provided to the IT team for MVP being discussed' (which IT Team ???, the MVP is a service-format that will be created as exactly described in this proposal, I don't think that this CA fully understood what this proposal is all about). "}, {"q0": "Whereas most other proposals in this challenge have targeted specific threats, the Risk Radar attempts to create a general purpose tool to track all threats. As ambitious as this is, the proposal steps through each part of the challenge brief and thoroughly addresses each element. Taking the reader through the vision and then a Business Model Canvas, the impression of a serious, comprehensive plan is a natural conclusion.", "q0r": 4, "q1": "The most impressive part about this proposal is the genuine desire to reach out and collaborate with others. Heinz reached out to all other relevant proposers in the challenge, and engaged them in the comments section. Collaboration with the Cardano Risk Profile Audit seems like it could be very promising, however with the amount of funds requested, it looks like only one of them (or neither) will get funded. \r\nDespite a serious and detailed plan, and an impressive background, the proposal has a dependency on as-yet unidentified \"highly capable experts\" which places some doubt on whether a team with the necessary credentials could be stood up within the timeline specified and the broad agenda of the proposal achieved.", "q1r": 4, "q2": "The proposal has an extremely clear set of deliverables with roadmap, timeline and details which metrics can be used to audit the proposal. In this regard, the proposal has provided sufficient info the validate success of the project. It would have been nice if the referenced MIRO board in the proposal had been linked, as that would be a step which could prove that words are beginning to translate into action, even without funding.\r\n", "q2r": 4, "assessor": "z_assessor_590", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "With our powerful RADAR, we are capturing, analyzing, visualizing and periodically reporting technical, economic, legal & social challenges", "experience": "More than 30 years of experience in leadership positions within industry. This provides access to a strong network of highly capable experts"}