{"id": 370006, "author": "", "title": "Crypto Regulation Surveillance", "url": "https://cardano.ideascale.com/a/dtd/370006-48088", "category": 26110, "amount": 9000, "description": "Government regulation can have a major effect on the effectiveness, innovation, value and even viability of cryptocurrency business models", "f6_no_assessments": 4, "f6_rating": 3.25, "videos": [], "media": [], "f6_assessments": [{"q0": "This is a good idea, and if executed well could be valuable to the community. However as it stands the proposal is just asking for $9000 to compensate for their time in reaching out to community members and then developing a proposal. It would probably be better to do a small effort on this reaching out to these people and come up with a plan for moving forward and present that as a proposal.", "q0r": 2, "q1": "Whilst he proposer appears to have the experience to deliver on this idea, there is not firm plan at the moment other than community outreach and to then develop a plan. ", "q1r": 2, "q2": "As the proposal is more a proposal to develop a proposal, it is not really possible to audit the success. What are the end goals if successful. Would we have a system that posted summaries on new regulations around the world and their impact? Could we not scrape most of that from exiting news services?", "q2r": 1, "assessor": "z_assessor_11", "no_vca": 11, "ne": 1, "ng": 9, "nfo": 1, "vca_o": 1}, {"q0": "This challenge addresses the challenge of solving threats to the Cardano ecosystem via tracking and engaging with regulations to help ease the transition to regulatory clarity.", "q0r": 5, "q1": "Maury Shenk is ideally qualified to head such a project based on the experience listed above.", "q1r": 5, "q2": "The project is auditable and has provided a set a deliverables and timeframes so progress can be monitored.", "q2r": 5, "assessor": "z_assessor_327", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "So, this proposal targets a subset of the possible threats for Cardano - regulatory threats, but around the world. So, with its limited scope, I would expect a laser-sharp mechanism for  identifying serious emerging systemic threats. The proposal aims to look at how global regulation may pose a threat to cryptocurrency business models - by harnessing a future network of expertise that would \" identify and respond to emerging regulatory threats\". This is the proposed solution. I would have liked to see at least a worked out structure or possible options for this future network of expertise. I would have liked to see more on the \"respond\" part. What are the responses that could be available? Further on, the proposer does identify specific sources of regulatory threats and lists them. However, while the idea aspect of the proposal seems valuable ... for me the expected impact seems elusive. The proposal does address a subset of problems for blockchain, yet I am not sure how it will add specific value to the  Cardano ecosystem - when compared to other existing publicly available and expert sources of information on global regulation. Information is information. But the value of information is in its quality, timeliness and reliability. Although the proposer suggests to identify members of the Cardano community in key jurisdictions around the world (e.g. US, EU, China, Japan, Switzerland, etc) who could act as sensors and report on regulatory developments.. for some real impact I would have liked to see specific and clear criteria for these \"sensors\" and a reasoning on how to select \"key jurisdictions around the world\" for Cardano - apart from listing five jurisdictions that first come to mind. As the proposal does not specify even a structure and competencies and activities for future organization (will it have or engage the services of legal experts on securities) - its impact remains vague. Will it channel expertise from other blockchain systems and how - thus maximizing the resources? To me the proposal still reads as not sufficiently baked. What I would suggest is more focus - especially as the proposal has already narrowed down the field of threats to one subdomain. If regulation is the theme, then impact can be gauged if there are some innovative action strategies and innovative approaches for this network. What happens if new regulation is reported by the sensory network? Maybe we can read about it also in the cyrpto media? What is the value proposition, precisely? I do not see an original value that will make me believe that this proposal will have impact. It may be implemented, it may set up \"an operational regulatory sensing network\" - but how will this disparate network of sensors bring true value that is actionable - is a question that the proposer might want to explore in more detail. ", "q0r": 3, "q1": "The proposal will probably identify members of the Cardano community in key jurisdictions around the world (e.g. US, EU, China, Japan, Switzerland, etc) who could act as sensors and report on regulatory developments. But that may be too low of a bar to hop over. My worry relates to the feasibility of providing the proposed solution (\" identify and respond to emerging regulatory threats to cryptocurrencies\"). Will this network be sufficiently competent? Identifying people willing to act as sensors and report for monetary compensation is one thing, but finding experts who are able to understand very intricate legal niceties that often require years and years of legal, taxation, anti-money laundering, law enforcement requirements, KYC issues,  or securities law expertise may be a completely different ball game. It seems that this network in this current rudimentary form - with no criteria - will not achieve a successful implementation, as we need a solution to the problem, not just a network that is set up. What do voters get here as the end result - is a question that is at the forefront for me and which might  need more consideration from the proposer. The criteria for identifying these people and the wide range of competencies that are needed - is for me a critical component for success and making the proposal feasible. The network will not be successful if the proposed solution (\" identify and respond to emerging regulatory threats to cryptocurrencies\") is not implemented. I would want to see proven legal experts, tax experts, domain experts and even other institutions involved in some way. We need some yardsticks to measure success here - not only setting up a network of sensors. The proposer does mention that he has \"good contacts on technology regulation around the world\", however blockchain regulatory issues often have very little to do with technology regulation - and more to do with taxation, securities laws, monetary law, economic policy, general wide-ranging pro-blockchain or anti-blockchain legal and political decisions. I am not convinced about the feasibility of even properly identifying the real regulatory threats in these jurisdictions based on the current proposal and I am also much more curious about the second part of the solution - how to \"respond to these threats\". One of the three deliverables will be a proposed approach to incentivizing participation in the network - although it seems to be too small of a deliverable to be included as a definition of success. Another deliverable is the \"proposed structure for future organization of this effort\" - which has no metrics for success, so the proposed structure might be delivered in a sentence or two: \"a loose network of sensors has been established and it will meet for one hour per month\". The proposal seems too loose to be able to deliver on the solution: to successfully \" identify and respond to emerging regulatory threats to cryptocurrencies\" around the world. As for the budget, there is subjectivity in this segment. The proposer specifies \"The proposed budget of USD 9000 (USD 1500 / month) is intended to be modest compensation for the time required on this effort over the first six months\" . I would advise the proposer to provide an explanation for the budget - as there is no allocated time in the proposal, a compensation rate, nor can we use a universal definition of \"modest compensation\" - when voters allocate funds from the budget. ", "q1r": 2, "q2": "If we look at the proposer's solution - \"identify and respond to emerging regulatory threats to cryptocurrencies\" - then I would disagree that there will be sufficient information to audit the progress of the proposal and its success. We may be able to determine whether the proposer identified candidates for deliverable #1 in 3 months, whether a structure for future organization of this effort has been proposed in 6 months and whether the \"operational regulatory sensing network\" has been set up in 12 months. But that's about it. These are all preconditions for the solution - but the targeted problem is essentially not been addressed. A structure is being built and put in place - and that the real grind - is then to start. However, as we cannot see who will be in the network (their core competencies, their core experience) - we might end up with a body that is there in name only, the checkboxes have been checked - but the value is not there. So, my suggestion to the proposer would be to be more rigorous with the concept - convince voters that they will get a first-class network of expertise and how will they get it. What are the ideas for operating this new sensor network? Finally, I have some serious reservations about the possible success of the proposal because the proposer included this sentence: \"Because I have many other commitments, a key goal of this project would be to find a broader team that can take it forward operationally.\" ", "q2r": 3, "assessor": "z_assessor_35", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "As was recently seen in the US senate debacle on blockchain governance, this is a clear and present threat to Cardano, and blockchain technologies in general. The proposal references recent videos by Charles Hoskinson on the topic, so alignment to the challenge brief looks clear to me. The details of the proposal seem to be to build up an outreach structure to build up a knowledge base of legal issues relevant to the Cardano ecosystem. Given the relatively small funding request of 18% of the budget and the potential impact I agree that this proposal would effectively address the challenge.", "q0r": 4, "q1": "The proposer has provided a linkedin reference, and in addition, the communication with the community via the comment section of the proposal is laudable and establishes a proposer who is committed to the project and collaboration with the community. The deliverables of the project amount to convening a committee on crypto regulation through outreach. The amount requested may seem a large amount given the deliverables, but the proposal clearly states that some of this funding will go to incentivise participation.", "q1r": 4, "q2": "A clear timeline and set of deliverables is provided, and the rationale for how the proposal could be assessed is elaborated through the comment section. I would have liked to see some commentary on potential risk (what happens if this doesn't get funded?) and challenges (how easy have other projects requiring collaboration been able to find resources?)", "q2r": 3, "assessor": "z_assessor_590", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Build network of experts around the world to identify and respond to emerging regulatory threats to cryptocurrencies", "experience": "30 years technology policy experience; strong connections to regulatory experts around the world"}