{"id": 381705, "author": "filip12", "title": "Cross-Chain Collaboration", "url": "https://cardano.ideascale.com/a/dtd/381705-48088", "category": 26257, "amount": 400000, "description": "Como poderemos criar conexões e colaboração entre Cardano e outras correntes de bloqueio nos próximos seis meses?", "funded": 2, "upvotes": 159383147, "downvotes": 7069246, "votes_result": 152313901, "votes_cast": 710, "f6_no_assessments": 6, "f6_rating": 4.611111111111112, "videos": [], "media": [], "f6_assessments": [{"q0": "A interoperabilidade entre cadeias, a construção e a colaboração serão fundamentais para um crescimento sustentável e um futuro produtivo do ecossistema Cardano e da indústria de cadeias de bloqueio como um todo. Projetos de silagem, código, comunidades têm o potencial de levar à estagnação e maximalismo, conforme apontado pelos proponentes. Esta é uma oportunidade para colocar de lado as diferenças, combinar bases de conhecimento e criar em benefício não de uma, mas de múltiplas comunidades. Comunidades que abracem estas técnicas e oportunidades serão mais capazes, maleáveis, progressivas e preparadas quando confrontadas com os desafios inevitáveis. Manter o desafio como aberto e contínuo é igualmente significativo e impactante, permitindo um desenvolvimento contínuo nesta área.", "q0r": 5, "q1": "As comunidades e equipes envolvidas precisarão ir além de suas personas maximalistas, fan-boy e influenciadoras para trabalharem juntas. Profissionalismo, confiança e respeito serão exigidos e esperados, todos alcançáveis, para adoção entre as comunidades envolvidas na cadeia de bloqueio. O desejo de integração deve ser explicado juntamente com a intenção de forma transparente e comunicativa. Embora a equipe tenha vasta experiência, acredito que o orçamento estabelecido é mínimo e tratado de acordo. Isto tem o potencial de levar a muitos pequenos e insignificantes esforços de colaboração entre cadeias, que podem/ podem não oferecer valor. A equipe também não tem a previsão de recomendar futuros ajustes no orçamento e não deve ser responsabilizada por isso, entretanto, a comunidade deve continuar a fornecer contribuições relacionadas a aumentos ou reduções no orçamento, conforme proposto antes de cada fundo.", "q1r": 5, "q2": "A adoção será uma métrica relativamente fácil de visualizar em todo o Fundo 8 pelo respectivo número de propostas. A comunidade pode monitorar continuamente este desafio particular também no caso do Catalyst. Embora o cenário de desafios para o Fundo 7 explique os requisitos das Equipes de Desafio, gostaria de ter visto os planos da equipe para atualizar a comunidade com relação à adoção, número de propostas, propostas financiadas e outras métricas comuns. Fornecer informações desta natureza permite à equipe ganhar reputação e à comunidade aprender mais sobre os diversos aspectos dos projetos Catalisadores e de cadeias cruzadas.\r\n", "q2r": 4, "assessor": "z_assessor_591", "no_vca": 14, "ne": 8, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe challenge's aim of collaborating with other ecosystems to bring new ideas and solutions to Cardano can support the objective of growing the dev and app ecosystem.\r\n\r\nAt the same time, the proposal would be stronger if it:\r\n1) provided an explanation why this challenge can provide a higher ROI to the community compared to broader challenges, such as as DApps and Integrations.\r\n2) discussion of popular use cases blocked because of the lack of collaboration or tech foundations within Cardano.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of a clear analysis of alternative approaches to prove that focus on this segment can bring high ROI to the community.\r\n- 1 point for the lack of a clearer analysis of the problem (name popular struggling use cases in additional to missing technologies).\r\nMy rating is 3.", "q0r": 3, "q1": "The Catalyst community definitely has the skills and capacity to address this challenge: the academic and engineering talent to review the alternative ideas and create implementations.\r\n\r\nAt the same time, without a clearer discussion of users problems unlocking which the adoption of Cardano can be accelerated, it is not clear how much impact can be achieved from the funds requested.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a detailed discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.", "q1r": 3, "q2": "The proposal defines some metrics (the transaction growth, etc.) that can help track the activities resulting from this initiative.\r\n\r\nAt the same time, the proposal can be stronger if it included measures to track progress towards implied objectives (missed opportunities in adoption). For example, some of the following metrics can worth the consideration:\r\n1) the share of transactions resulting from cross-chain activity brought by this initiative.\r\n2) the % of Cardano users using apps with cross-chain support brought by this initiative.\r\n3) the developer satisfaction with Cardano tech stack in comparison vs that in alternative ecosystems.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.\r\n", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 26, "ne": 5, "ng": 11, "nfo": 10, "vca_o": 1}, {"q0": "Interoperability is one of Cardano's core missions thus proposals promoting bridges to other chains are key to the achieving this mission.", "q0r": 5, "q1": "The community member who proposed this chose a modest amount to assign to this challenge specifically for the community to be able to efficiently address this challenge, and scale it in the future as required.", "q1r": 5, "q2": "Success criteria and metrics as they are defined by the proposing team are set correctly to measure progress in addressing the cross-chain challenge.", "q2r": 5, "assessor": "z_assessor_1017", "no_vca": 29, "ne": 2, "ng": 15, "nfo": 12, "vca_o": 1}, {"q0": "The challenge makes a good case for how it matches all 3 of the Fund 8 strategic goals to achieve Cardano's mission.", "q0r": 5, "q1": "The challenge budget is moderate and there is little overlap with other potential challenges so the community has the capacity to address the challenge.", "q1r": 5, "q2": "The success criteria and metrics are measurable and exceptionally well defined.", "q2r": 5, "assessor": "z_assessor_344", "no_vca": 19, "ne": 1, "ng": 10, "nfo": 8, "vca_o": 1}, {"q0": "The important of this project is explained really well in the challenge setting. Good initiatives for interoperability will put Cardano more then ever in the focus of Blockchain enthusiasts and will provide a space for many valuable projects. A collaborative blockchain environment will also have a huge societal impact.", "q0r": 5, "q1": "While only a limited part of the Catalyst Community has the capabilities to adress this challenge, some actors have already shown now that they are up for this challenge, so I am positive a sufficient amount of proposals will be provided for this challenge. The challenge has a credible challenge team and it is credible to achieve results in the set milestone times.", "q1r": 5, "q2": "The metrics are set up right matching the topics and make it quite possible to plan matching, auditable proposals.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 17, "ne": 1, "ng": 13, "nfo": 3, "vca_o": 1}, {"q0": "Entering the Basho era which emphasized scalability and interoperability, I couldn't agree more that we need to have this topic in Fund 8 and on. I believe Cardano can reap the benefit from other blockchain users and vice versa. With this Cardano will have a better image not only in the crypto space but also further with more mainstream audience going on when crypto adoption is getting more popular. The target blockchain partners are also well-selected and we can learn much through their perspectives.", "q0r": 5, "q1": "I believe the community have enough member with decent knowledge of other blockchains in general and knowledge of interoperability topic in particular. The proposers can be a good starter in guiding this topic while familiarizing the community through Townhall, 360, etc. We can see a large enough number of proposals coming in when the Fund8 is launched and having it now when we are in the early stage of Basho will be a very precise timing.", "q1r": 5, "q2": "The elaborated metrics are accurate and on point. Perhaps we can also add some metrics like Cardano's public image score measuring the number of positive and negative mentions related to Cardano in platforms such Twitter and Reddit. It will also be nice to see some numbers in the metrics such as target numbers of proposal, cross-chain projects emerging next year, co-hosted events, etc. Still, this will be the key initiatives we need for Cardano going into 2022 and I am very excited to see the implementation and resulting growth.", "q2r": 5, "assessor": "z_assessor_943", "no_vca": 15, "ne": 5, "ng": 9, "nfo": 1, "vca_o": 1}], "importance": "A interoperabilidade das cadeias de bloqueios e a consciência de múltiplas cadeias garantem o sucesso compartilhado da criptoeconomia como um todo.", "success": "Criação de valor colaborativo entre o Projeto Catalisador e outras comunidades. Tanto as iniciativas técnicas quanto as não técnicas são bem-vindas."}