{"id": 381894, "author": "pace", "title": "Cardano Contributors League", "url": "https://cardano.ideascale.com/a/dtd/381894-48088", "category": 26257, "amount": 800000, "description": "Como podemos ter mais pessoas trabalhando em tempo integral dentro da Cardano?", "funded": 1, "upvotes": 37992266, "downvotes": 14825360, "votes_result": 23166906, "votes_cast": 216, "f6_no_assessments": 5, "f6_rating": 3.733333333333333, "videos": ["https://www.youtube.com/watch?v=TFLUfVgveBw&start=25101"], "media": [], "f6_assessments": [{"q0": "Este desafio está cheio de objetivos e mecanismos conflitantes. 1). O resumo do desafio pede aos avaliadores que abordem o Impacto. As instruções para esta seção são rotuladas \"Alinhamento\" (não Impacto) e estabelecem uma barra muito alta. Pede-se aos avaliadores que concordem ou discordem que o desafio é \"crítico para alcançar a missão de Cardano\". Como uma experiência, é interessante. Mas sem exigir \"objetivos críticos da missão\" como base para a premiação, o resumo do desafio não atende a este critério. Se considerarmos Impact, (deixando de lado o alinhamento), o mecanismo geral (financiamento do emprego em tempo integral por 6 meses no espaço Catalyst/Cardano, embora atraente, o provável impacto de 16 pessoas na comunidade que busca objetivos muito geralmente definidos pode não ser significativo. Há outros aspectos conflitantes, mas estes são suficientes para eu descrever para justificar a mais alta classificação que posso conceder, 3 estrelas - não posso concordar ou discordar.", "q0r": 3, "q1": "Mais uma vez, o resumo do desafio parece conflitante. Os critérios de seleção (a votação pela comunidade para aprovar um pedido de financiamento é uma ponte muito distante. Os compromissos não são claros. A expectativa de que alguém ou algum grupo \"atribua tarefas\" a curto prazo sugere (assim como outros aspectos deste Resumo do Desafio) alguma autoridade que possa orientar uma pessoa financiada a mudar o que ela está fazendo para trabalhar em algum problema anteriormente desconhecido. Se a pessoa financiada tem as habilidades corretas para atacar e tentar resolver esse problema ou não. Whoo decide? Seria a Equipe do Desafio? E de que bem nasce esse comitê de cerca de 5 pessoas que derivam sua autoridade para redirecionar uma pessoa financiada para uma nova tarefa. Em todo este Desafio tenta incluir tudo de uma só vez. Morder demais. Eu posso ver se aprovado, como apresentado, o desafio muito rapidamente fica paralisado na implementação. Enquanto 16 pessoas recolhem 50 mil dólares. Ou será que seu financiamento será cortado se não fizerem o que lhes é indicado? (do resumo: 'Flexível - Contribuintes serão mais impactantes se forem capazes de ser flexíveis em um ambiente de rápida movimentação e se moverem para onde possam ter um alto impacto\".", "q1r": 3, "q2": "Mais uma vez, o resumo do desafio é conflitante. Os relatórios semanais sobre o progresso podem ser inúteis, mesmo quando uma pessoa financiada está fazendo algo útil. Muitas das métricas parecem descrever as pessoas financiadas como sendo simplesmente úteis. Veja com atenção o resumo na seção intitulada \"O que se espera dos candidatos bem-sucedidos?\r\n\r\nApoiar o ecossistema - Os colaboradores devem se concentrar em devolver o maior valor ao ecossistema e procurar resolver os maiores problemas que a comunidade está enfrentando no momento. [Quem decide quais são esses problemas?]\r\nApoiar a comunidade - Os contribuintes devem entender o ecossistema e ser capazes de ajudar a comunidade onde ele é necessário. Isso poderia ser responder a perguntas, apontar as pessoas para os recursos certos ou trazer mais consciência para diferentes áreas do ecossistema que precisam de apoio.\r\n\r\nAlta colaboração - Os colaboradores têm o poder de ser a cola que une a comunidade e identifica a sobreposição e a duplicação de esforços. A comunidade se beneficia ao gastar tempo compreendendo diferentes projetos relacionados e reunindo aqueles onde isso é um benefício para eles e para o ecossistema.\r\n\r\nAlta participação - Para serem contribuidores altamente eficazes, precisarão entender o que está acontecendo em todo o ecossistema da melhor forma possível. Os colaboradores podem se concentrar sensatamente em uma ou algumas áreas dentro do ecossistema onde eles garantam estar atualizados e conscientes dos problemas, projetos, equipes e roteiros.\r\n\r\nFlexível - Os colaboradores serão mais impactantes se forem capazes de ser flexíveis em um ambiente de rápida movimentação e se deslocarem para onde possam ter um alto impacto\".\r\n\r\nO programa similar mais famoso é a doação da Fundação MacArthur (sem compromisso) de $250 por 12 meses. Não muito maior do que US$50/6 meses. Eles exigem relatórios ZERO. Mas eles selecionam pessoas excepcionalmente talentosas. E ninguém pode se candidatar. A partir de seu site.\r\n\r\n\"Concedendo bolsas irrestritas a indivíduos talentosos que demonstraram uma extraordinária originalidade e dedicação em suas buscas criativas e uma marcada capacidade de auto-direcionamento.\r\n\r\nSOBRE O PROGRAMA\r\nO MacArthur Fellowship é um prêmio de US$ 625.000, sem compromisso, para indivíduos extraordinariamente talentosos e criativos como um investimento em seu potencial.\r\n\r\nHá três critérios para a seleção dos Fellows:\r\nCriatividade excepcional\r\nPromessa de importantes avanços futuros com base em um histórico de realizações significativas\r\nPotencial para a Irmandade para facilitar o trabalho criativo subseqüente.\r\nO Programa MacArthur Fellows destina-se a incentivar pessoas de talento excepcional a buscar suas próprias inclinações criativas, intelectuais e profissionais. De acordo com este propósito, a Fundação concede bolsas de estudo diretamente a indivíduos e não através de instituições. Os beneficiários podem ser escritores, cientistas, artistas, cientistas sociais, humanistas, professores, empresários, ou aqueles em outros campos, com ou sem afiliações institucionais. Eles podem usar suas bolsas de estudo para avançar sua experiência, engajar-se em novos trabalhos ousados ou, se desejarem, mudar de campo ou alterar a direção de suas carreiras.\r\n\r\nEmbora os indicados sejam avaliados por suas realizações, a bolsa não é um prêmio de realização vitalícia, mas sim um investimento na originalidade, no discernimento e no potencial de uma pessoa. De fato, o objetivo do Programa MacArthur Fellows é permitir que os bolsistas exerçam seus próprios instintos criativos em benefício da sociedade humana.\r\n\r\nA Fundação não exige ou espera produtos ou relatórios específicos dos bolsistas MacArthur e não avalia a criatividade dos beneficiários durante o período de duração da bolsa. O MacArthur Fellowship é um prêmio \"sem compromisso\" em apoio às pessoas, não aos projetos. Cada bolsa vem com uma bolsa de US$ 625.000 ao beneficiário, paga em parcelas trimestrais iguais ao longo de cinco anos\".", "q2r": 3, "assessor": "z_assessor_251", "no_vca": 17, "ne": 9, "ng": 7, "nfo": 1, "vca_o": 2}, {"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe underlying problem of incentivizing high-contributing members is important and supports one of Fund8 objectives - grow the number of contributors.\r\n\r\nAt the same time, I believe that the specific solution of introducing full-time roles is not aligned with the strategic objectives of Fund 8 because spending a chunk of budget of full-time positions, minimizes the chance of part-time involvement of new contributers and new contributors provide a higher chances for spreading word of mouth (due to uniqueness of each individual's private networks).\r\n\r\nIn my opinion, the current project-based model is already flexible enough to fund individuals (they just need to propose problem areas they plan to work on + KPIs) for 6+ months. Furthermore, the project-based model makes it much easier to deliver the return-on-intention for the funds allocated (a clearer connection between funding and outcomes).\r\n\r\nTo make this proposal stronger, I would suggest a much more thorough analysis of how and in which-cacses full-time positions can bring more return on intention! The arguments about tax benefits, etc are not sufficient since solving the right problems orders of magnitude more impactful than saving 20-30% on taxes.\r\n\r\nI have made the following deductions:\r\n- 2 points for not directly supporting any of Fund 8 strategic goals.\r\n- 1 point for suggesting a solution instead of clearly articulating problem by providing relevant analysis and the eveidence of impact.\r\nMy rating is 2.", "q0r": 2, "q1": "The proposal is feasible and simple to implement, since all it requires is for contributors to submit proposals for funding, which is already a widespread practice in the community.\r\n\r\nAt the same time, I have reasons to believe that proving full-time positions would solve all the community problems with regards to incentivizing more members for contributions since it is likley to affect only a small fraction of them due to the limited funding.\r\n\r\nI have made the following deductions:\r\n- 1 point for the limited influence on the behavior of all the contributors in the community.\r\nMy rating is 4.", "q1r": 4, "q2": "While some of the metrics (the number of contributions, events, etc.) help track the activity, the proposed metrics don't provide insights into the efficiency of the full-time model as compared to the project based funding - which is the key assumption behind the proposal.\r\n\r\nThe proposal can be stronger if it considered comparative metrics as well: the number of contributions(commits, events,etc.) from from full-time community vs the project-based comminuty and the satisfaction of the community with the incentives scheme.\r\n\r\nI have made the following deductions:\r\n- 1 point for not tracking the impact on the underlying objectives (more contributions from the community).\r\n- 1 point for not considering competitiveness and community satisfaction.\r\nMy rating is 3.", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 23, "ne": 6, "ng": 12, "nfo": 5, "vca_o": 1}, {"q0": "This challenge pays a small group of contributors which at least partially aligns with Cardano's mission.  To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "This challenge heavily overlaps with the Catalyst Circle and potentially the proposed Catalyst Technical Council. The deliverables of participate, collaborate, support and report seem rather light for a self-defined 6 month contract, especially given the large budget request. I doubt the Catalyst community has the capacity to address this challenge given the large budget request.", "q1r": 3, "q2": "The key metrics and success criteria are adequate but a little light in measuring progress in addressing the challenge.", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 18, "ne": 1, "ng": 11, "nfo": 6, "vca_o": 1}, {"q0": "This challenge is critical to achieving Cardano's mission, since human resources are required to upgrade this ecosystem, therefore, full-time community members, especially full-time CA and vCA play a very important role. Therefore, based on the given information, I strongly agree with this proposal's alignment, I can rate the alignment of this proposal only with a score of 5.", "q0r": 5, "q1": "Undoubtedly, the Catalyst community has the capacity to address this challenge. Based on the given information, I strongly agree with this proposal's feasibility, I can rate the feasibility of this proposal only with a score of 5.", "q1r": 5, "q2": "Suggested metrics are logical and measurable to measure progress in addressing the challenge. Therefore, based on the given information, I strongly agree with this proposal's verifiability, I can rate the verifiability of this proposal only with a score of 5", "q2r": 5, "assessor": "z_assessor_679", "no_vca": 18, "ne": 1, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Of course having more people working full time as their main job will help the Cardano Catalyst community to become more stable and grow faster, at least in the early stages. However, Cardano appeals to participants because of its transparency and freedom, which, with a more focused and specific group of people, can create a bureaucratic system. Moreover, there are now many people working full time for the benefits of the community and I believe that just increasing the benefits will increase this number of people.", "q0r": 3, "q1": "The Catalyst community can assess which candidates are suitable for the challenge. The number of people participating in the challenge is also promising because the challenge creates new serious jobs and will attract existing people who already have an interest in the activities of the Cardano community. However, there is a risk that the number of people who want to work full-time is small, people only participate in the community as a hobby or part-time job.", "q1r": 4, "q2": "The challenge is very well defined with key metrics, what should be included in the proposal, what is expected from successful candidates, what should contributors report, what sort of candidates are most suitable, what candidates may be less suitable etc", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 12, "nfo": 2, "vca_o": 1}], "importance": "Cardano precisa de mais da comunidade trabalhando em tempo integral no ecossistema para que possa atingir seu potencial", "success": "Os membros da comunidade que resolvem problemas importantes em Cardano são financiados para que possam trabalhar em tempo integral no ecossistema"}