{"id": 383619, "author": "psuzzi", "title": "Open Standards & Interoperability", "url": "https://cardano.ideascale.com/a/dtd/383619-48088", "category": 26257, "amount": 500000, "description": "Podemos construir um Ecossistema Aberto para impulsionar o crescimento, dar oportunidades iguais a todos e aumentar as sinergias entre os projetos Cardano?", "funded": 2, "upvotes": 89536156, "downvotes": 10309318, "votes_result": 79226838, "votes_cast": 403, "f6_no_assessments": 3, "f6_rating": 4.444444444444445, "videos": [], "media": [], "f6_assessments": [{"q0": "Standards based on openness, transparency, and consensus lay the groundwork for innovation, progress, and fair competition. Taking into consideration the strategic direction communicated by the community and IOG, this seems to be an ideal challenge for the next fund. I 'm convinced that this challenge is crucial to achieving Cardano's purpose.\r\n", "q0r": 5, "q1": "There is a budget of 500,000 requested for this challenge, which while I believe is a bit high for the first time, I also believe sends the correct message to key parties inside and outside of the community. I agree that the community is capable of addressing this challenge.\r\n", "q1r": 5, "q2": "The success criteria are appropriate and relevant for the next round of funding; however, I find the suggested metrics difficult to measure. In order to avoid confusion among future proposers, I recommend reviewing the metrics prior to the launch, if possible. I agree that the success criteria and suggested metrics are set correctly to measure progress in addressing the challenge.\r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 23, "ne": 3, "ng": 19, "nfo": 1, "vca_o": 1}, {"q0": "This challenge supports Cardano goals to accelerate growth and evolution of developer & app ecosystem. It emphasizes on open standards, built on principles of openness, transparency and consensus. Laying foundation for innovation, growth and fair competition.", "q0r": 5, "q1": "The guiding motivation in the challenge brief is well documented, enough to successfully merge new ideas and more collaboration within this challenge.\r\n I strongly agree that this challenge will support healthy development in transparency and collaboration.\r\n", "q1r": 5, "q2": "Key metrics are well described for proposers to easily create good framework in 4 major categories: observable improvements, project synergies, open-source contributions and reputability.\r\n", "q2r": 5, "assessor": "z_assessor_276", "no_vca": 20, "ne": 2, "ng": 13, "nfo": 5, "vca_o": 1}, {"q0": "The challenge seeks to bring groups together to collaborate towards improving the Cardano ecosystem which aligns with the mission statement. To make the challenge excellent: better articulate how the challenge aligns with more than one of the Fund 8 Strategic Goals.", "q0r": 4, "q1": "There have been some conversations about standards in the community and the budget is moderate compared to the total budget therefore the community has the capacity to address the challenge. To make the challenge excellent: better articulate the demonstrated demand for the proposed budget (most easily done based upon excess total proposal budgets in previous funding rounds). ", "q1r": 4, "q2": "The key metrics are not measurable for the most part however the success criteria is adequate. To improve challenge: better articulate how the success criteria address the challenge and how the metrics can measure progress towards the success criteria.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 18, "ne": 2, "ng": 12, "nfo": 4, "vca_o": 1}], "importance": "Fornecer software complexo, impulsionando a colaboração e acelerando a inovação através do compartilhamento de identidade, práticas e componentes/serviços sw.", "success": "Um ecossistema neutro do ponto de vista do fornecedor para\n- impulsionar o crescimento, a consciência, a capacidade de descoberta\n- aumentar a adoção comercial\n- fornecer as infra-estruturas necessárias"}