{"id": 383886, "author": "rin9s", "title": "👑 Alternatives to Plutocracy 💸", "url": "https://cardano.ideascale.com/a/dtd/383886-48088", "category": 26257, "amount": 125000, "description": "Como podemos descobrir e experimentar novos tipos de governança para ir além de \"1 moeda = 1 voto\"?\nComo podemos evoluir nossa governança?", "funded": 0, "upvotes": 18207275, "downvotes": 23934354, "votes_result": 5727079, "votes_cast": 189, "f6_no_assessments": 4, "f6_rating": 3.0, "videos": [], "media": [], "f6_assessments": [{"q0": "Disclaimer: my view points are shaped by my multi-year experience in product management and software development.\r\n\r\nThe underlying problem that the challenge aims to solve (decentralized governance) is critical for one of the Fund 8 objectives:  make Cardano an open-source (a self-governed) project.\r\n\r\nAt the same time, the proposal would be stronger if it:\r\n1) included a more detailed challenge Brief than \"TBD\".\r\n2) included an analysis of issues with the current voting system, and speficic damages/lost opportunities created for the community.\r\n3) shared a list of use cases particularly hurt/struggling from the current voting approach.\r\n4) included a vision/requirements for the projects. are we inviting for research/planning projects or for implementations of existing systems?\r\n\r\nI have made the following deductions:\r\n- 1 point because this initiaitve supports only one of three strategic goals of Fund 8.\r\n- 1 point for the TBD brief.\r\n- 1 point for the lack of a clear analysis of the problem.\r\n- 1 point for the lack of a detailed discusion about high-value use cases.\r\nMy rating is 1.\r\n", "q0r": 1, "q1": "The Catalyst community is built from enthusiasts of decentralized governance, so it is well positioned to identify and innovate in this space.\r\n\r\nAt the same time, out of my experience in product manager, I know that a precise definition of a problem is critical to the success of initiatives. Without specificly defined use cases struggling the most from the current model of voting, it is hard to say which specific skills, resources, or research can be needed. Moreover, it is not clear if those problems can be solved in the near future at all.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of specific use cases.\r\n- 1 point for the lack of a discussion about the sufficiency of the requested funds to achieve a noticeable impact.\r\nMy rating is 3.\r\n", "q1r": 3, "q2": "The proposed metrics (proposals, frameworks, research) can help track some activity within the initiative. However, they are insufficient to track progress towards the underlying objective (community progressing towards its mission at its maximum speed).\r\n\r\nTo make the proposal stronger, I'd suggest to consider metrics helping to evaluate the progress of Cardano towards the desired outcome - the fulfillment of the mission of Cardano. For example, assuming the definition of Carano's mission as to \"provide a financial and social operating system to the world\", the following metrics could be valuable to consider:\r\n1) the % of the world's population that relies on cardano for financial use cases (need a list of use cases).\r\n2) the % of the world's population that relies on cardano for social use cases (need a list of use cases).\r\n3) the use satisfaction (by use case) of with Cardano's solution vs those of competitors/alternatives.\r\n\r\nI have made the following deductions:\r\n- 1 point for the lack of metrics evaluating the relative impact on the Cardano ecosystem.\r\n- 1 point for the lack of metrics evaluating user satisfaction and the competitiveness of the solutions.\r\nMy rating is 3.\r\n", "q2r": 3, "assessor": "z_assessor_1011", "no_vca": 22, "ne": 5, "ng": 9, "nfo": 8, "vca_o": 1}, {"q0": "Unfortunately this challenge looks to be incomplete with its \"TBC\" in the challenge brief. As written, the challenge only tangentially aligns with the strategic goals defined for Fund 8 although it would be easy to alter the phrasing to better align. To improve challenge: better articulate how the challenge aligns with 1 or more of the Fund 8 Strategic Goals.", "q0r": 3, "q1": "The budget is small compared to the total budget and the Catalyst community is full of conversations about finding alternatives to plutocracy so the capacity to address the challenge is there. Unfortunately the challenge brief needs to be clarified with more information.", "q1r": 4, "q2": "The metrics are not measurable and the success criteria should be better defined. To improve challenge: better articulate how the success criteria address the challenge and how the metrics can measure progress towards the success criteria.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 20, "ne": 2, "ng": 15, "nfo": 3, "vca_o": 1}, {"q0": "Plutocracy is indeed criticized, in many Blockchains discussion. Most blockchain governance model are based on plutocracy. Algorand first decision about governors incentives, has been criticized because the decision has been actually made by very few big holders.\r\nResearch for alternatives for some specific use cases could bring to Cardano a competitive advantage over other blockchains.\r\n", "q0r": 5, "q1": "The challenge question is clear, so this challenge if voted should receive a reasonable quantity of proposals. \r\nI regret that the challenge brief is missing details and examples.\r\nTo ensure good quality proposals, the challenge team should consider providing guiding questions, directions.\r\n", "q1r": 3, "q2": "The challenge team highlights that as this is a research challenge, proposals should be whitepapers/debates/pilots. I agree that this helps focusing proposals, but the actual impact on Cardano's mission will be difficult to measure. \r\nLike for most challenge proposals, key metrics are based on the number of successfully voted proposals, which should be an acceptable auditability for this challenge.\r\n", "q2r": 3, "assessor": "z_assessor_78", "no_vca": 17, "ne": 1, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This is a question I hear about often, and I believe has even been reported as a fairly consistent concern in the Catalyst survey. I think it's appropriate to suggest a challenge category for this.", "q0r": 5, "q1": "This would be such a fundamental undertaking, with so many philosophical and practical questions underpinning it, I think it would be more appropriate to start small and focused. Perhaps what's needed is a means to propose alternatives to how voting in Catalyst functions, and let Catalyst test alternative voting systems within its own structure. Another possibility is to fund research on how one-person-one-vote works under Catalyst, so we can identify patterns in the inequal influence that can then be targeted.", "q1r": 2, "q2": "Unfortunately, the proposal for this particular challenge appears underdeveloped. An idea like this has promise, but it really needs to be more fleshed so that proposers will have a clear direction. More is needed for both the criteria and metrics.", "q2r": 1, "assessor": "z_assessor_853", "no_vca": 16, "ne": 1, "ng": 13, "nfo": 2, "vca_o": 1}], "importance": "A governança descentralizada é um enorme desafio. Precisamos investigar e testar novos sistemas para encontrar maneiras de ir além da centralização do poder.", "success": "Desenvolvimento substancial e testes de novos sistemas de governança -\nPlataformas, estruturas, pesquisas, etc."}