{"id": 366806, "author": "", "title": "DID Solutions for Local Governments", "url": "https://cardano.ideascale.com/a/dtd/366806-48088", "category": 26116, "amount": 10000, "description": "日本では、日本の国民IDを使った社会や産業でのソリューションはまだ普及していません。", "f6_no_assessments": 2, "f6_rating": 4.5, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=29589"], "media": [], "f6_assessments": [{"q0": "Japan is where it all began for Cardano and I would wish that all voters and community advisors were aware of the early enthusiasm of Cardano's initial cohort of investors and believers. I like the approach that the proposing team has taken. They are trying to work in partnership with a Japanese prefecture to introduce an ID management solution for cattle, as a stepping stone to put a foot in the market. This idea of using the proposal for the PoC stage in a very regulated and developed market, such as Japan makes sense. The rationale makes sense to me \"If we can build a blockchain infrastructure in the government with this use cases, we can then expand it to various dApps solutions within the government.\" I am aware that partnering with government (as it is in the case of IOG) is a longer-term endevour and a steep slope to climb. It is difficult to pin down and governments  are sensitive about negative press so the proposers probably had reservations about naming the prefecture in the proposal. The ultimate goal is to lead towards the introduction of a national ID solution, by frog-leaping from an DID management solution for cattle, which is a special product of the prefecture in question.", "q0r": 4, "q1": "I have translated the attached google document in Japanese and noticed that the team consists of  KUNI ( @leon_stake_pool)・ Cardano Ambassador Yuta ( @yuta_cryptox)・Blockchain entrepreneur Yama ( @yamamoto_junya )・ and IOG Toshiaki Miyatake ( @IOHK_miyatake) as a Support advisor. The latter member in the role of support advisor is a boon. Mr Miyatake is Japan Campaign Manager at Input Output (IOHK) and a former Meetup advisor at Emurgo and Japan Community manager at Cardano Foundation. The team's references speak highly of their interest and committment to the Cardano project and I think that the plan to propose a solution to the Livestock business Association as the next step, and conduct hearings, followed by developing a concrete solution to solve the problem and connect it to the demonstration experiment - is a great plan. The team states that as soon as the prefecture's budget is available, they intend to switch from the demonstration experiment version to the full-scale implementation version. The KPI is a demonstration experiment for the prefecture and industry. The team has already established preliminary contacts,  started the introduction and intend to conduct a demonstration experiment of the design requirements for social use of ATALA Prism in Japan.\r\n", "q1r": 4, "q2": "The team proposes to establish a strong relationship with members of the prefectural assembly. It would be good if they could document this progress in some way, although it is hard to measure the success of interpersonal communication in early stages of complex business ventures. Taking into account the potential size of the Japanese market and the possibilities for growth, attempting to gain a foothold in Japan via a dedicated team of Cardano afficionados makes so much sense to me personally. For a project of this type I think the metrics cannot be as clear cut as in the case of a project that aims to deliver a dapp, a series of Youtube videos or some instructive material. This is a proposal for an early lobbying/consensus building effort with Japanese local government and it needs to be approached as such. This is not about building infrastructure, but about building relationships with local government and industry ... potentially leading to government investment in the implementation stages. Hence, I think the lack of detailed budget breakdown and deliverables in the form of \"code\" or APIs or some other product - is to be expected and not to be taken as a negative ... in this specific proposal. ", "q2r": 4, "assessor": "z_assessor_35", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "This great initiative for Mass adoption of Cardano reach and smart contract capabilities. The team appears to be very knowledgeable in the industry and the solution is solid. If the technology is proven this could lead to other aspect of the industry to build from its success.", "q0r": 5, "q1": "There is experience exhibited in the links and materials provided as well as the steps needed to build the technology and the presentqtions to the relevant bodies in Japan.", "q1r": 5, "q2": "The team has presented good KPIs, a reasonable timeline to audit the progress as well as how the fubds are used in the project. Pretty solid job presenting it to the department.", "q2r": 5, "assessor": "z_assessor_594", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}], "solution": "ナショナルIDソリューションの前段階として、＊＊＊県の特産品である牛のID管理ソリューションを推進していきます。", "experience": "カルダノSPO\n医療機器ベンダー（製品企画、DX企画、マーケティング） ・Cardano SPO\nカルダノアンバサダー\nブロックチェーンアントレプレナー"}