{"id": 367101, "author": "", "title": "Decentralized eLearning & DIDs", "url": "https://cardano.ideascale.com/a/dtd/367101-48088", "category": 26116, "amount": 50000, "description": "ラテンアメリカのデジタル教育は、効率が悪く、コストがかかり、より多くの人に届けることができません。", "f6_no_assessments": 5, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should be more closely aligned with the challenge and the solution should be detailed more, especially how DIDs are being utilized in the application.\r\nDespite the occassional mention of DID integration in the proposal the goals of the project do not align with the challenge objective. The funding request is for 6 months to develop a proof of concept that does not list DID integration as a feature. DID integration is listed as a long term success factor \"for those who wish to use it.\"\r\nThe proposal will not to scale to drawing in millions of DID users based upon this funding round. The funding will not draw in a single DID user until further funding in the long term.\r\nBased upon my experience, I disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "The proposer provides sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team of has been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is not reasonable to achieve the challenge goals of mass-scale adoption of DID  however the budget is reasonable to achieve the proposal goals and is broken down into identifiable items. Operational costs should be broken down into more detail.\r\nThe timetable is realistic to complete the work but does not show what is being done when. The entire project is simply a one shot deliverable in 6 months.\r\nThe plan describes the resources necessary to implement the proposal.\r\nThe proposal does not identify risks and challenges to a successful implementation. The risk factors identified are for education in Latin America.\r\nBased upon my experience, I agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 4, "q2": "The proposal does not provide a roadmap with auditable milestones and a defined timeline instead it has a short term success factor if the Proof of Concept being funded is completed in 6 months which is not ideal. \r\nIdeally, the proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. Given that the project does not onboard any DID users for the funding period, it should at least project a time beyond this phase when the community could expect to see DID users being recruited. \r\nThe proposal does provide KPIs that define success for the project.\r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is very well developed, however I do not think it is the most appropriate challenge, it seems to be an educational platform, I do not see where the digital representation comes in.", "q0r": 3, "q1": "I believe they have an excellent team prepared to successfully develop the proposal.", "q1r": 5, "q2": "I think the metrics and information provided is very clear to measure the progress and success of the proposal. However I don't give them 5 stars for the same reason that I don't see how this fits with the challenge.", "q2r": 4, "assessor": "z_assessor_372", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"q0": "Digital education in Latin America has low efficiency, is costly, and is not able to reach a larger audience.  I believe this project is able to solve these problems and bring great benefit to the people of Latin America.", "q0r": 5, "q1": "I love the vision presented and I am impressed with the experience and credentials of the people working on this project.  I am also pleased to see that they have someone who already has experience teaching blockchain and Cardano technologies in Latin American communities.", "q1r": 5, "q2": "The only other thing I would like to see is more information on how they plan to collaborate and work with industries and businesses.  I have confidence it will, given the urgent need for a well-trained workforce.", "q2r": 4, "assessor": "z_assessor_385", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "Latin America is a high potential region for Blockchain. Since inefficiencies are plenty in many aspects of governments, businesses and systems. Education represents a major gap for each of the countries in the region and is predominated by socio- economic groups. ", "q0r": 5, "q1": "A stong team with the required skill set to address the first phase of the project detailed. I see potential to enrich future proposal with a more defined business case on how the platform is providing its full potential considering content creation, management, target segment approach, revenue stream, etc.", "q1r": 4, "q2": "Metrics are clear defined, budget is detailed.", "q2r": 5, "assessor": "z_assessor_433", "no_vca": 10, "ne": 2, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "With the rapid growth of technology in the world, it is very important every one is equipped with the necessary knowledge in Technology. Digital Education is an initiative that has grown rapidly and having positive effects on the world, so addressing the challenge in Latin America will be of good use to the General population.", "q0r": 5, "q1": "Given the years of experience in software Engineering of the members of the board and plans put in place to tackle this problem, I am convinced quality will come out of this proposal and will go a long way to help millions of people,", "q1r": 5, "q2": "All information provided is adequate for auditing anytime.", "q2r": 5, "assessor": "z_assessor_485", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}], "solution": "参加者に社会経済的なインセンティブを与える分散型のeラーニング・プラットフォームで、DIDを使用することで正統性を提供する", "experience": "Plutus Pioneer、20年以上のソフトウェアエンジニアリングの経験、15年以上のDEVOPSの専門知識、ビジネスとマーケティングのアドバイザーによるカウンセリングを受けています。"}