{"id": 367219, "author": "", "title": "BIT - Basic Income Token", "url": "https://cardano.ideascale.com/a/dtd/367219-48088", "category": 26116, "amount": 6000, "description": "Atalaの**ユーザー**は、DIDプロバイダによって搭載されており、Cardano**エコシステム**を探索する**インセンティブ**がありません。\n\nプロバイダーには協力するインセンティブがない。", "f6_no_assessments": 3, "f6_rating": 3.2222222222222228, "videos": ["https://www.youtube.com/watch?v=AftfAbJMxQE&start=7460"], "media": [], "f6_assessments": [{"q0": "Very good Proposal, which could bring real value to the System.\r\n However  as a Software Engineer with more than 20 years of experience I see this much more than a task to a dedicated team of people, rather than a private developer en-devour. So may be you could consider reevaluating your proposition in this lite and give more long term view over the project along with real Use Case examples, as the proposition details are quite abstract.     ", "q0r": 4, "q1": " This idea could bring real value to the Cardano community and specifically to Atala Prism, but the task is complex, the similar solutions seems like much more deep (including some economical calculation and better marketing).  So it seem more like a task to a team of players with expertise in different areas than to a single developer. The asked budget is low so you have a change to grow the asked amount and include a longer term vision to the project, but keeping the MVP (Minimal Valuable Product) as the first focus for the proposition. I'm positive that this community could help you to bring this project to fruition.", "q1r": 3, "q2": "Please see the above notes.", "q2r": 3, "assessor": "z_assessor_195", "no_vca": 8, "ne": 2, "ng": 4, "nfo": 2, "vca_o": 1}, {"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem and solution statements are clear and reasonable.\r\nThe goal of incentivizing users to explore the Cardano ecosystem using Basic Income Tokens that are tied to DIDs strongly aligns with the challenge objective.\r\nThe proposal is able to scale to drawing in millions of DID users. To grow significantly would require Babel fee support, to give the token real value.\r\nBased upon my experience, I strongly agree that this proposal effectively addresses the challenge.\r\n", "q0r": 5, "q1": "The proposer has provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team of one developer has been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is reasonable to achieve the goals but is not broken down into identifiable items.\r\nThe proposer is hesitant about committing to his timetable and it does not show what is being done and when.\r\nThe plan does not describe the resources necessary to implement the proposal but none are apparent.\r\nThe proposal does not identify risks and challenges to a successful implementation however it does note the requirement for Babel fees and SPO support.\r\nA development team of one also poses a risk from unforeseen circumstances.\r\nBased upon my experience, I neither agree nor disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 3, "q2": "The proposal provides a roadmap with auditable milestones and a defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. \r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "Basic Income for everybody is a noble goal, however I feel this proposal should have been entered in the \"DApps and Integrations\" category - as the proposal currently reads the BIT will be an incentive for existing DID holders to further explore the blockchain - I do not see the new tech or marketure that will onboard more users. ", "q0r": 2, "q1": "Although the team provided a link to LindedIn and other websites, I feel the proposal requires further development to ensure successful implementation. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 3, "q2": "The team provided a minimal roadmap and budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond single line entries and broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline . As the project stand at the moment, I feel the project will be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 11, "ne": 1, "ng": 5, "nfo": 5, "vca_o": 1, "reply": "This proposal is for a simple 'infrastructure' token, that works only with a DID solution. I don't think it'd fit into the general Dapps/Integrations category. Nor that standard KPI metrics are applicable before the Atala ecosystem is fully released. "}], "solution": "また、DID提供者には、ユニークなオンライン・アイデンティティの提供に協力してもらう。", "experience": "https://www.linkedin.com/in/martin-vavrovic-9617514a/\n10年以上のソフトウェア開発経験を持ち、最近5年間はフロントエンドに注力しています。"}