{"id": 368523, "author": "", "title": "DID as a bridge to Microsoft", "url": "https://cardano.ideascale.com/a/dtd/368523-48088", "category": 26116, "amount": 5000, "description": "DID規格を活用しているのはAtala Prismだけではありません。パートナーとのコラボレーションにより、製品が改善され、より多くの人に採用されるようになるでしょう。", "f6_no_assessments": 2, "f6_rating": 2.333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem and solution statements are clear and reasonable.\r\nThe goal of forming a partnership with Microsoft around the DID space aligns with the challenge objective.\r\nThe solution may indirectly scale to drawing in millions of DID users. The proposal requires future funding before any significant DID usage however the proposal provides two very large plausible use cases (Xbox gaming & LinkedIn) either of which could scale to millions quickly if implemented.\r\nBased upon my experience, I agree that this proposal effectively addresses the challenge.\r\n", "q0r": 4, "q1": "The proposer has evidence of the technical skills however there is no indication in the proposal or his LinkedIn profile that the proposer has any established relationship with Microsoft therefore this proposal would essentially be a cold call sales attempt which traditionally have a low success rate. The proposer also has no apparent special relationship with Cardano/IOHK/Emurgo beyond the Catalyst Community either.  \r\nThe budget is reasonable to achieve the goals but is not broken down into identifiable items and is simply time and materials. The hourly labor rate should be specified.\r\nThere is no timetable.\r\nThe plan does not describe the resources necessary to implement the proposal instead being on a time and materials basis.\r\nThe proposal does not identify risks and challenges to a successful implementation.\r\nIt is not clear to me what value the proposer adds to trying to establish a relationship between Microsoft and Cardano/IOHK/Emurgo other than getting the ball going. If Cardano wants to pursue this idea they should just do make the call on their own. \r\nIf the Catalyst community wants to see this done then a proposer should pick one of the partnership ideas and approach Microsoft in advance of a proposal (ideally they could find someone within the Catalyst community with inside ties at Microsoft).\r\nBased upon my experience, I disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 2, "q2": "The proposal does not provide a roadmap with auditable milestones and a defined timeline.\r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 2, "assessor": "z_assessor_344", "no_vca": 5, "ne": 3, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The proposal (if realized) would answer the challenge.\r\nHowever, there are no metrics provided to allow any assessment of the scope. It is assumed that collaborating with Microsoft would mean large numbers, but we do not see those numbers identified in the proposal.\r\n\r\nIt is difficult to understand how a $5,000 project could provide mass adoption.  (more on this in the other assessment sections)", "q0r": 3, "q1": "There were comments asking about how the proposer would engage with Microsoft, and this comment went unanswered.\r\nWe see no team identified outside of the proposer, who has MS credentials, but no obvious ties into MS or Cardano DID decision makers.\r\nMuch information is provided to support the fact that MS and Cardano have aligned desires with respect to DID usage and adoption, but no plan of action is presented as to how the collaboration might be accomplished.\r\n\r\nTo ensure successful funding round, this proposal would do well to lay out the plan of execution, and find a way to place that front and center. Leaving the resources that prove there is synergy between Cardano and MS to the deeper resources section of the proposal.", "q1r": 2, "q2": "The lack of a definitive plan of action makes it difficult to audit activity.\r\n\r\nThe proposal indicates that they have identified 3 potential pilot programs, however there are no plans defined in how to accomplish these pilots.\r\n\r\nThe effort put into amassing these links and reinforcing documents in support of there being synergies between Cardano and MS DID initiatives is incredible here.\r\n\r\nOne wishes as much effort were placed into defining how the project would be approached and what sort of timelines would be involved.", "q2r": 1, "assessor": "z_assessor_593", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "MSとの協力関係の構築\n\nMS社のインフラとユーザーベースとのコラボレーション\n\n実際の使用例：ブログ、ブログ、デモ", "experience": "9年以上のプリセールス、サポート、プロダクト、プログラムマンの経験。\n\nデジタルカレンシーの修士号\n\nhttps://www.linkedin.com/in/john-greene-60b9022b/"}