{"id": 369138, "author": "", "title": "Your DID for climate impact", "url": "https://cardano.ideascale.com/a/dtd/369138-48088", "category": 26116, "amount": 40500, "description": "誰もが気候の緊急事態に対処する役割を果たすべき？しかし、私の影響はどのようなもので、どのようにしてそれを軽減することができるのでしょうか？", "f6_no_assessments": 5, "f6_rating": 3.866666666666667, "videos": ["https://www.youtube.com/watch?v=mMRxVLBUtHY&start=11127"], "media": [], "f6_assessments": [{"q0": "Climate change is a huge problem. Motivating and getting people to contribute by making changes to their everyday lives will have a huge impact in the long run. There is a massive community ready for something like this. People would like to share their carbon footprint accomplishments therefore encouraging other people to do the same. Involving corporate companies and social platforms will help this project to scale. Therefore getting lots of people using the Atala PRISM DID.", "q0r": 5, "q1": "Already committed team that is established in relevant fields and has worked with potential partners in the past. The budget breakdown seems sensible with identifiable items. The timeline to complete the project also seems doable. Potential risks and challenges have been considered. Another way to make this project scale and resilient to future risks is to turn it into a DAO. Especially being such a huge project.", "q1r": 4, "q2": "Great detail has been provided in what needs to be created to assist in fighting climate change. A clear roadmap with milestones has been provided alongside valid key performance indicators.  Making the tracking of the success of this project viable.", "q2r": 5, "assessor": "z_assessor_140", "no_vca": 9, "ne": 3, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "As a climate conscientious person  I do value the proposal aim and goal, we definitely have the power to address climate change at individual level and produce huge impact by our day to day activities and choices, and I do think MyCarbonZero is doing it the right way.\r\nI think though that the proposal fails to underpins why a DID is needed for this project and thinking about the usability I don't see how current users of the platform will migrate to a DID, in order to use the site, I think the process could be cumbersome and disengage people rather than add to the goal and reach of the site. A Basic password is doing the job right now perfectly well.\r\nIf what the proposal seeks is funding to continue their noble efforts I don't think this is the way to get it from Cardano's Treasury. Neither a good use for these resources.\r\nI'd rather go towards generate a certificate of personal emissions stored in our blockchain or a SMARTCONTRACT of some sort that states personal commitments that if you don't comply you can pay to net your emissions (same as companies) or even an NFT of your achievements and efforts to help with climate change, but not a DID.\r\nThe project seems to aim at continuing developing the existing site rather than contributing to the challenge goal of making great use cases for DID and enhance and grow the ATALA PRISM ecosystem and the Cardano's Blockchain.\r\nThe team experience and acumen is impressive and I bet they will find other appropriate ways to fund this or change the proposal and apply for next fund with a better and more related use case.\r\nThe funds requested seem right for the level of effort, but not a good ROÍ (Return on Intention) for the Cardano's community.", "q0r": 2, "q1": "Yes the timeline is totally viable, even though I think is too long (6-9 months).\r\nThe plan is detailed and provide specific milestones to understand what will be delivered in each step.\r\nThe part of the plan that is not clear is why and how the DID will be implemented, so I found it difficult to assess if the intention will succeed, as I foresee several issues with the users as requiring a DID could potentially generate an unnecessary hassle for users.", "q1r": 3, "q2": "The metrics provided are detailed and smart, but they are not well aligned with the overall purpose of the site being developed. If a simple and seamless experience is the goal so many more users adopt the platform and take action on climate care and emission reduction activities, then I think the proposed solution fails to give the funded reasons to understand how this will be achieved by adding a DID to the project.\r\n\r\nAgain I am totally supportive of the intention and great cause, but I do think we shall do it right and I cannot foresee this path will lead to success, at least not by adding DID.\r\nTherefore I don't think this proposal will help to achieve the goals of this challenge.\r\nIf you can regroup and review how the blockchain and Cardano's way of doing things and its community can add to the cause I think you will have a winner proposal and worth the use of our Treasury Funds. Please persist on the purpose, ask for help from our community and I am sure you will be able to secure these and more funds from Cardano.", "q2r": 4, "assessor": "z_assessor_288", "no_vca": 11, "ne": 4, "ng": 3, "nfo": 4, "vca_o": 1, "reply": "1. One main concern raised by the CA is why we need a DID - the CA even mentioned as a solution to have a carbon certificate or NFT. The CA might not fully understand the model which is explained under the solution section, as the DID footprint is a dynamic measure and being calculated ongoing. It is not a one time process, it is the current climate impact ID each one of us has. I even answered about it in one of the comments. This is a key guiding point in the review and it repeated several times and in each section (Impact, Feasibility, Auditability). The CA might not fully understand the proposal and the importance of the DID for it - i.e. to connect with travel sites and get incentives. \n\n\n2. From the CAMPAIGN Brief \"While we prefer to support Atala PRISM's instantiation of DID, this is more about building ideas and concepts that require DID to draw users to the Cardano platform. And since PRISM is building to the open standards, those are available for anyone to imagine possibilities and offer proposals.\" \n\nSo any comment that miss this point when looking at the DID climate proposal should be flagged. Although the proposal do mention:  Integration with Atala Prism for decentralized identity\n \n\nAnd more for the CAMPAIGN brief: \"Propose a means or way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem (preferably Atala PRISM when released). This can include any method that will offer users or entities a decentralized ID to start defining their digital self-sovereignty. \"  \n\nSo the fact that we started a web based platform with a password does not mean that it does not fit the challenge. Moreover, when the objective is to create the DID which is a fundamental element in the solution. The proposal can include any method offering users a DID to start defining their digital self-sovereignty...which the DID proposal is about!  \n\n\n3. Regarding the technical details and process of how to implement the DID, there is some good feedback as well as some other good feedback provided. We appreciate the CA time and feedback but wanted to signal this issue for the VCA consideration as the main issue in the proposal might not be well understood.\n"}, {"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge however the problem and solution statements are clear and reasonable.\r\nThe goal of mass-scale adoption of a carbon footprint calculator integrated to a DID aligns very well with the challenge objective.\r\nThe proposal is able to scale to drawing in millions of DID users and specifically lists partnerships that are likely to achieve that goal.\r\nBased upon my experience, I strongly agree that this proposal effectively addresses the challenge.\r\n", "q0r": 5, "q1": "The proposer has provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links. The existing functional website is a strong feasibility indicator.\r\nThe team of has been sufficiently identified in terms of skills and number required to implement the proposal except for the development team. The weakest feasibility factor is that the developer team may not have the required Atala Prism integration skills.\r\nThe budget is reasonable to achieve the goals and is broken down but not into identifiable items in several instances.\r\nThe timetable is realistic to complete the work but could more clearly show what is being done and how, specifically around the marketing campaign.\r\nThe plan describes the resources necessary to implement the proposal but could use more detail in terms of marketing materials.\r\nThe proposal identifies risks and challenges to a successful implementation.\r\nBased upon my experience, I agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 4, "q2": "The proposal provides a basic roadmap with a vaguely defined timeline but it does not have easily auditable milestones.\r\nThe proposal includes metrics that correspond to the challenge objective although it does not project what those numbers would be in defining success.\r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "Reducing ones carbon foorprint to zero is a noble and good cause. This wil be a great tool for existing Atala Prism users, however I fail to understand how measuring my DID carbon foot print will attract more users to adopt Atala Prism and how the proposal will grow Atala Prism user numbers - thus I dont agree that the proposal effectively adresses the challenge.", "q0r": 2, "q1": "The team provided links to LinkedIN and various websites, the team also created a good risk assessment via identifying upcoming challenges. I would like the team to further expand on the type and number of team members required to fully implement the proposal, what are the responsibilities and deliverables of each member. Lastly, I would like the team to provide a deeper explanation of the architecture and language for the implementation of the back end of the product.", "q1r": 3, "q2": "The proposal has a high levell roadmap and budget. I would like to see the team develop Key Performance Indicators (KPI's) (have 200 DID carbon footprints by month 2, have 350 DID carbon footprints by month 3, etc - create measurables) for the project based on a monthly timetable and connect the KPIs to milestones on the project roadmap (timeline) . I would like to see the team create a thorough roadmap -  develop and add milestones to provide deeper detail, set technical development milestones for creating the product. I would like to see the budget developed beyond single line entries and broken down into monthly spending, and I would like the team to connect the KPI's and roadmap milestones to the spending, what are the specific tasks and deliverables that the developers must provide and when must they deliver the tasks – this breakdown will give a clearer indication about the implementation workload feasibility and match the deliverables to the spending - thus the team can track performance and spending over a timeline. As the project stands at the moment, I feel the project will be challenging to audit. ", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1, "reply": "\n1.        Some good feedback by the CA for Auditability and Feasibility. However in the Impact section (which was short) the key feedback was: \"This will be a great tool for existing Atala Prism users, however I fail to understand how measuring my DID carbon foot print will attract more users to adopt Atala Prism and how the proposal will grow Atala Prism user numbers - thus I dont agree that the proposal effectively adresses the challenge.\" \n\nIn the proposal, we had a section about scale (i.e. through partnership with travel websites) which is directly cover this issue, so I do not understand this feedback. For example we mention in the proposal: “One strong partnership we are already evaluating is with https://www.goodwall.io/ with access to 1.7 million young members. The idea is to involve their community with climate action activities.”\n\n2.        In addition, the proposal the CAMPAIGN Brief clearly say \"While we prefer to support Atala PRISM's instantiation of DID, this is more about building ideas and concepts that require DID to draw users to the Cardano platform. And since PRISM is building to the open standards, those are available for anyone to imagine possibilities and offer proposals.\" \n\nSo any comment that miss this point and focus only about Atala Prism when looking at the DID climate proposal should be flagged \n\nAlthough the proposal do mention:  Integration with Atala Prism for decentralized identity\n"}, {"q0": "I found this proposal very innovative and useful for environmental well-being, since it calculates through DID what the impact of each one of us, in terms of carbon, and guides us on how we can take positive attitudes about it, offering rewards when work is shared. It is extremely positive how the author of the proposal argues about the importance of his project through the attached statistics, and also how it demonstrates that the work has already started to be done through the attached website (which I found very beautiful, by the way) and the link which gives more information about phase 1 of \"My Carbon Zero\". Another positive point I found here regarding impact is the fact that this project can (and already is) relating to several other projects/people, such as social networks and brands. Or even with other projects in our ecosystem, as the author cites.", "q0r": 5, "q1": "Regarding the team present in this proposal, it is certainly well qualified to do so. This is quite clear for two reasons, first considering the detailed explanations of 1) the problem 2) what we can do 3) how we can do it 4) what it would do as a result. Also due to the fact that there is already a lot of theory put into practice here, for example, the attached website, the statistics, the examples of projects with which they have already been involved. In addition, part of the proposal is dedicated to explaining who each team member is, what they do and a social network in which we can get to know them more intimately. In this way, there is complete confidence in the team's ability. Regarding the roadmap and financial division, everything is very well explained and what is not lacking is detailing, as I will explain better in the comment below; that way, we have a solid vision of what's to come, how and when.", "q1r": 5, "q2": "The project is divided into stages (each of which is situated in a period of time). They are very well detailed in small actions that together would add up and result in a whole. There is also a defined success metric for each step, so that the community can follow the progress of things more accurately. In addition to the metrics established for each phase, at the end of their explanation there is the establishment of broader goals for the whole. About the financial division, it is also perfectly detailed, we can understand how the financial amount will be used and how each little part happens. On top of that, there are the establishment of challenges that will be faced throughout the project, which means that the team has a realistic view of how things are going and is preparing for possible setbacks.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 8, "ne": 7, "ng": 1, "nfo": 0, "vca_o": 2}], "solution": "数分でDIDのカーボンフットプリントを計算し、削減のための簡単な行動をとるためのガイダンスを受け、共有し、インセンティブを得ることができるプラットフォームです。", "experience": "これまでに数百万ヘクタールの森林に影響を与えたScott Poynton氏のライフ・ミッションです。NGOや起業家としての経験が豊富なチーム。"}