{"id": 369122, "author": "", "title": "BingoChain - User Authentication", "url": "https://cardano.ideascale.com/a/dtd/369122-48088", "category": 26116, "amount": 20000, "description": "Atala Prisimのユーザーは、様々なサイトにログインするためのシンプルな方法を求めており、それによって自分のプライバシーをコントロールすることができます。", "f6_no_assessments": 4, "f6_rating": 2.5833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal highlighted a problem and proposed a solution but this another classic example of a proposal solution depending on another proposal solution in the same funding round ( https://cardano.ideascale.com/a/dtd/BingoToken-Play-To-Earn/366726-48088). \r\nIt will be preferable to execute the depending proposal and when completed then apply with this proposal .\r\n\r\nI strongly disagree.", "q0r": 1, "q1": "The proposal did not provide verifiable link to given experience and provided a very vague implementation plan with no cost implication breakdown.\r\n\r\nI disagree.", "q1r": 2, "q2": "The proposal did not provide sufficient information to audit the progress and success of the proposed solution.\r\n\r\nI disagree.", "q2r": 2, "assessor": "z_assessor_331", "no_vca": 7, "ne": 0, "ng": 4, "nfo": 3, "vca_o": 1}, {"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge however the solution is clear and reasonable.\r\nThe goal of integrating the existing BingoChain.io site with Atala Prism partially aligns with the challenge objective. The challenge is \"to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem\" and this proposal is reversing down the \"onramp\" in that it recruits existing Cardano users (BingoChain players must already have an Ada wallet to play) to get DIDs. \r\nAn argument could be made that BingoChain itself is an onramp to the Cardano ecosystem and by integrating DID it is encouraging adoption of DID but even then the proposal states that Atala Prism will be an \"alternate authentication provider\" therefore the majority of DID users would likely already be using DID instead of new recruits.\r\nThe proposal could potentially scale to millions of DID users although it is not clear if this proposal would facilitate the recruitment or simply benefit from existing DID users. The optional nature of the DID login combined with the fact that DID is not integral in any way other than to login is the issue. Add some additional features that take advantage of DIDs to entice people toward the DID option. \r\nBased upon my experience, I neither agree nor disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 3, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links although this is offset somewhat by the operational website.\r\nThe team has not been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is reasonable to achieve the goals but is not broken down into identifiable items.\r\nThe timetable is realistic to complete the work and does not show what is being done and when however the implementation is very short.\r\nThe plan does not describe the resources necessary to implement the proposal but there likely are none.\r\nThe proposal does not identify risks and challenges to a successful implementation however the scope is very limited so there are no apparent significant risks.\r\nBased upon my experience, I agree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 4, "q2": "The proposal provides a roadmap with auditable milestones and a defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. \r\nThe proposal details specifically how progress will be reported back to the Catalyst community at regular intervals (GitHub repository).\r\nBased upon my experience, I agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 4, "assessor": "z_assessor_344", "no_vca": 9, "ne": 4, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "A can see how requiring people to have Atala Prism DID to enter the game will \"onboard\" more users to Atala Prism DID - will the Atala Prism DID be mandatory to play the game or is it just optional login functionality?  ", "q0r": 3, "q1": "Although the team provided a link to a the website, I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 3, "q2": "The team provided a minimal roadmap and single line budget. I would like to see the team further develop and define Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. Lastly  connect the KPI's and roadmap milestones to the developer budget, in this way you can track performance and spending over a timeline . As the project stand at the moment, I feel the project will be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "Incorporating Atala PRISM solution for user authentication in BingoChain follows the primary goal of DID mass adoption in the Cardano ecosystem. This is positive and within the current challenge. However, the fact of keeping the existing authentication methods increases highly the chance of using Google or Facebook accounts as the preferred option to authenticate instead of using Atala PRISM. Additionally, the problem statement of \"simple way to log in\" is undefined without describing an actual problem. It should focus on the missing decentralized identification (DID) instead. \r\nI am neutral that this proposal effectively addresses the challenge.\r\n", "q0r": 3, "q1": "The team and its experience to develop and deploy the solution in BingoChain is not mentioned anywhere in this proposal neither in the main proposal of the Bingo token.  The technical solution is also poorly written without providing details on how Atala PRISM will be integrated in BingoChain. The proposal lacks details on how the budget has derived and on which tasks it will be consumed. Other than the provided 3 month timeline for concluding the solution there is not any detailed planning on the development and testing activities and the respective resources required. With the current amount of information I disagree that this proposal will be implemented successfully.", "q1r": 2, "q2": "Although there is a section describing the metrics of success, it misses a concrete roadmap with milestones and time plan to deliver the solution. No KPIs are defined other than the total time of implementation. The feedback to be collected by running weekly games looks a good idea but it requires some well described test cases and the criteria to be met for a successful user experience using Atala PRISM. Considering the fact of missing details and clarity I disagree that it is possible to assess the progress and success of this project.", "q2r": 2, "assessor": "z_assessor_614", "no_vca": 8, "ne": 4, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "Atala PrismをBingoChain.ioの代替認証プロバイダとして統合し、ユーザーが簡単にログインできるようにします。", "experience": "私たちのメインのBingoChain.ioサイトは運用されており、今回の提案はAtala Prismを統合するものです。Axnosisと協力して、Atalaの開発者と連絡を取っています。"}