{"id": 369540, "author": "", "title": "Maternity Medical data in Ethiopia", "url": "https://cardano.ideascale.com/a/dtd/369540-48088", "category": 26116, "amount": 55000, "description": "エチオピアには一元化された医療データシステムがないため、母親たちは重複した医療検査によって多くの費用を失っています。", "f6_no_assessments": 4, "f6_rating": 1.3333333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "The proposal highlighted a problem and offered a solution with a potential but lacks in details. \r\nThe solution will need more details to support the execution of the proposal to success.\r\nI disagree.", "q0r": 2, "q1": "A verifiable experience with links was provided but the proposal lack an implementation plan, cost breakdown, timelines or milestones .\r\nI strongly disagree.", "q1r": 1, "q2": "Sufficient information to help audit was not provided .\r\nI strongly disagree.", "q2r": 1, "assessor": "z_assessor_331", "no_vca": 8, "ne": 0, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge and the solution should be more detailed.\r\nThe goal of a secure medical ID system could align with the challenge objective however there is no details on the solution or if it would use DIDs so the proposal does not align.\r\nThe proposal does not scale to drawing in millions of DID users.The proposal should provide more details on its technical scalability and its go-to-market plan to determine if it would drive mass-scale adoption.\r\nI recommend the proposers review similar successful proposals for the level of detail expected in submissions or team up with a proposal writer.\r\nBased upon my experience, I strongly disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 1, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links. The propser's profile shows that he is a doctor which is relevant to the medical data itself but there is no evidence of the technical skills required to build the system proposed. \r\nThe team has not been sufficiently identified in terms of skills and number required to implement the proposal. An experienced development team should be added to this proposal.\r\nThe budget is a large lump sum and is not broken down into identifiable items to determine if it is reasonable or not.\r\nNo timetable is provided.\r\nThe plan does not describe the resources necessary to implement the proposal.\r\nThe proposal does not identify risks and challenges to a successful implementation.\r\nBased upon my experience, I strongly disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 1, "q2": "The proposal does not provide a roadmap with auditable milestones and a defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. \r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 1, "assessor": "z_assessor_344", "no_vca": 7, "ne": 2, "ng": 4, "nfo": 1, "vca_o": 1}, {"q0": "There is no clarity in the problem description.\r\nDraft proposal. There is not enough information to assess impact. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q0r": 1, "q1": "Draft proposal. There is not enough information to assess feasibility. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q1r": 1, "q2": "Draft proposal. There is not enough information to assess auditability. I would recommend checking the Catalyst documentation for reference to create a new proposal and search for an appropriate challenge to submit the proposal.", "q2r": 1, "assessor": "z_assessor_43", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}, {"q0": "The proposal addresses the challenge but with not enough detail. ", "q0r": 3, "q1": "I do not think it is likely that this proposal is carried out as the Linked in profile is questionable and they do not have a profile picture.", "q1r": 2, "q2": "There is insufficient information provided which will make this proposal impossible to track and audit.", "q2r": 1, "assessor": "z_assessor_542", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "安全なMedical IDシステムは、医療費を削減し、ヒューマンエラーを減少させ、研究所からの結果の共有を確保します。", "experience": "エチオピアの複数の医療施設で働く医療セールスのエキスパート。"}