{"id": 369638, "author": "", "title": "Distributed Health Records", "url": "https://cardano.ideascale.com/a/dtd/369638-48088", "category": 26116, "amount": 195000, "description": "ヘルスケアアプリケーションを開発するためのオープンソースの高品質ソフトウェアソリューションが存在しないため、発展途上国での利用が制限されています。", "f6_no_assessments": 4, "f6_rating": 2.75, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement should more closely align with the challenge and the solution should be more detailed.\r\nThe goal of providing an open source software infrastructure for companies to develop interoperable healthcare applications using DIDs and HL7 Standards aligns with the challenge objective.\r\nThe proposal might be able to scale to drawing in millions of DID users, although the proposal is for \"thousands of new patient records will be successfully tracked on the Cardano blockchain.\" The proposal should provide more details on its technical scalability and its go-to-market plan to determine if it would drive mass-scale adoption.\r\nI recommend the proposers review similar successful proposals for the level of detail expected in submissions.\r\nBased upon my experience, I disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "The proposer has not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links.\r\nThe team has not been sufficiently identified in terms of skills and number required to implement the proposal.\r\nThe budget is a very large lump sum and is not broken down into identifiable items to determine if it is reasonable or not.\r\nNo timetable is provided.\r\nThe plan does not describe the resources necessary to implement the proposal.\r\nThe proposal does not identify risks and challenges to a successful implementation.\r\nBased upon my experience, I strongly disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 1, "q2": "The proposal does not provide a roadmap with auditable milestones and a defined timeline.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user. \r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I strongly disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.\r\n", "q2r": 1, "assessor": "z_assessor_344", "no_vca": 6, "ne": 4, "ng": 1, "nfo": 1, "vca_o": 2}, {"q0": "The proposal intends to create open-source software so anybody can build health care records into Atala Prism. In my opinion, the proposal meets the challenge of creating tech and marketure to onboard more users to the ecosystem. I would like the team to expand on the backend and language to clearly describe the solution.", "q0r": 3, "q1": "Creating a platform with DID to track medical records is a great Idea, however I feel the proposal requires further development to ensure successful implementation. I would like to see links to LinkedIn or similar to provide additional detail/evidence about the team work history, education and past experiences. I would like the team to expand on the responsibilities and deliverables of each member of the team, this allows insight on whether there is a work overload in one area. I advise the team to develop a risk assessment considering the challenges and risks relevant to a successful implementation, the team needs to think: \"what needs to be true for this project to succeed\". ", "q1r": 2, "q2": "The team provided a minimal roadmap and budget. I would like to see the team further develop and define monthly Key Performance Indicators (KPI's) for the project– set measurables for performance and use it as a KPI, then connect the KPI to the milestones on the project roadmap. I would like to see the budget developed beyond single line entries and broken down into monthly spending and connected to the monthly deliverables. By connecting the KPI's and roadmap milestones to the developer budget, the team can track performance and spending over a timeline . As the project stand at the moment, I feel the project will be challenging to audit.", "q2r": 2, "assessor": "z_assessor_358", "no_vca": 7, "ne": 1, "ng": 5, "nfo": 1, "vca_o": 1}, {"q0": "The team has done a good job by clearly presenting in their proposal how they are going to address this challenge.", "q0r": 5, "q1": "Taking into consideration the background of the team with respect to the challenge they seek to solve , they have the requisite experience for their challenge. However the team has not clearly stated their timeline on the project execution which is very key when proposing for funding opportunities.", "q1r": 4, "q2": "The team has done a great job by specifically defining how they are going to solve the challenge. However, the team has not provided detailed information on how they are are going to execute this critical system that will revolutionize healthcare. Another point worth noting is that, the budget should have been a little elaborative on how they are allocating this funds in the various stages of their system development. This prevents me from giving them a 5 star. ", "q2r": 4, "assessor": "z_assessor_420", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "It is a very good idea on a technical level, however, I believe it should be tied with a plan for driving adoption. I believe the idea is that the blockchain simply tracks all the potential data providers, which should be contacted to obtain the data, however, this is not clearly explained.", "q0r": 4, "q1": "No evidence is provided about the proposers' background. Considering that no plan is included for driving adoption, and it seems that the blockchain would only track external data providers, the budget seems excessive for what would be produced.", "q1r": 2, "q2": "As mentioned in the other parts, the exact nature of the proposed system is somewhat unclear with respect to the role of the blockchain. Moreover, some milestones could be provided. Nevertheless, an end product will be delivered that allows for a partial judgement of success.", "q2r": 3, "assessor": "z_assessor_603", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}], "solution": "企業がDIDやHL7規格を使用した相互運用可能なヘルスケアアプリケーションを開発するためのオープンソースソフトウェアインフラを提供する。", "experience": "私たちは、20年以上の経験を持つSWエンジニアのチームであり、より良い医療記録システムの必要性を身をもって感じていました。"}