{"id": 369808, "author": "", "title": "DIDs for Animal Records", "url": "https://cardano.ideascale.com/a/dtd/369808-48088", "category": 26116, "amount": 36700, "description": "動物の記録にアタラプリズムの大量導入を促すには？", "f6_no_assessments": 6, "f6_rating": 3.5000000000000004, "videos": [], "media": [], "f6_assessments": [{"q0": "This can be a great use case in many countries across the globe. Which will create mass adoption for Atala Prism. If implemented correctly this could solve a lot of problems in various fields. This idea has the ability to scale on a global level. There should be a way for the community using this to vote on how certain challenges and risks be addressed.", "q0r": 4, "q1": "A committed team behind the project, but no real proof of their experience. Adding links to profiles or any evidence of skills or experience will boost CA and voter confidence. The budget allocation and plan isn't very reasonable for what is achieved at the end of the day. ", "q1r": 2, "q2": "Roadmap with milestones provided. Defined success is a website with tutorial videos and a schematic model that is used in the adoption of Atala prism. The funds requested and the defined success doesn't ad up. Maybe if you sit down with your developer team and try to come up with better ways to solve the problems you are facing, you could come up with a more robust, efficient and achievable plan.", "q2r": 2, "assessor": "z_assessor_140", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}, {"q0": "The proposal has an interesting idea, keeping records for animals with IDs, and it fits the challenge settings. The proposal has the potential to grow a good relation between a community and the Cardano ecosystem. If it will succed is a big step ahead in adoption of blockchain technology.\r\n\r\nThe proposals lucks in presenting metrics/KPIs to measure the success. (measurable outcome of the each stage of the proposal).\r\n\r\nThe proposal may be able to address future challenges.\r\n", "q0r": 4, "q1": "The proposer provides evidence (references, links, etc.) of skills and experience needed to implement (a part of )the proposal. However is unclear the experience/skills necessary for implementing the website and the other IT related tasks. Maybe is wiser to hire specialists in these fields for a better output.\r\n\r\nThe proposer knows, in an identifiable manner, the number of team members required to implement the proposal. Unfortunately these members don't have a role assigned, for better accountability and to stay organized. (who is going to do what, as part of the team?\r\n\r\nThe budget is outlined and broken down into identifiable items. However some of them are presented in an unclear manner (Workshops, Project direction), and because of this is difficult to decide if it's reasonable (or not) to achieve the set goals. These items should be rephrased for better understanding.\r\n\r\nThe proposal offers a timetable to complete the work and seems to be realistic.\r\n\r\nUnfortunately the plan doesn't describe all resources necessary to implement the proposal. (besides human resources what else is to be used: meeting location rental, stationary, marketing/promotional materials etc.).\r\n\r\nThe proposal doesn't clearly explain technical aspects like architecture, language and technologies if they are crucial for implementation.\r\n\r\nThe proposer has not considered challenges and risks relevant to a successful implementation. (what are the constrains that can interfere with the path of success (legislation, data protection etc.)?", "q1r": 2, "q2": "There are no given metrics to measure what the proposer wants to do, and the success of each step is not defined. The working plan should be presented in a clear and understandable manner for any outsider.\r\n\r\nPossible challenges are not considered. In conclusion, the progress of this proposal is difficult to assess.", "q2r": 2, "assessor": "z_assessor_309", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"q0": "The Challenge is about finding ways to incorporate DIDs into the Cardano System. I feel this is a very good project and may introduce a new community of people to the Cardano ecosystem. \r\n\r\nHow you define success with Atala Prism ID system as a focus is in line with this challenge. \r\n\r\nDoes this proposal address the challenge... I 'Strongly Agree'", "q0r": 5, "q1": "Having over 25 years as an IT Manager, Project Manager I have reviewed your proposal. \r\n\r\nYour team members have experience with this community of animal owners and that is good especially for the workshops and videos. \r\n\r\nI like that you have someone who can look at this project from a legal perspective. \r\n\r\nYour four month schedule and programming budget may be a bit of a challenge for your programmer, especially as you receive feedback from your workshops and the objectives fluctuate.  You may wish to consider this in your plan.  \r\n\r\nGiven this I assess your ability to implement this proposal as 'I Agree'", "q1r": 4, "q2": "It's good that you have you own internal Audit Committee. Your website development / integration with Atala-Prism should give the Voters opportunity to Audit your progress so 'I Strongly Agree'", "q2r": 5, "assessor": "z_assessor_320", "no_vca": 8, "ne": 1, "ng": 5, "nfo": 2, "vca_o": 1}, {"q0": "The challenge is asking for a way to drive mass-scale adoption of DID usage as an easy-to-use onramp to the Cardano ecosystem.\r\nThe problem statement is clear and reasonable. The solution of an outreach program of focus groups, workshops, webpage development and the development of a schema does not solve the problem statement in that by the end of the funding period there are no DID users and no prospect of future DID users without further funding.\r\nConceptually, the goals of the proposal align with the challenge objective.\r\nThe proposal does not scale to drawing in millions of DID users. The process described will take years to attract significant numbers of DID users with multiple rounds of funding and a recruitment cost per DID user which compares poorly to other proposals.\r\nBased upon my experience, I disagree that this proposal effectively addresses the challenge.\r\n", "q0r": 2, "q1": "The proposers have not provided sufficient evidence of relevant skills and experience needed to implement the proposal in the form of references or links. The only link is to the Kepler SCS company which is acting as a Board of Advisors.\r\nThe team of has not been sufficiently identified in terms of skills and number required to implement the proposal. Specifically who are the developers planning, developing and testing the system and what relevant experience do they have.\r\nThe budget is not reasonable to achieve the goals and is not broken down into identifiable items. \r\nMy personal advice for resubmitting this proposal to later funding rounds (which I recommend as conceptually the idea is good), project management costs should be under 10% (~24% in this proposal) of the total costs. The focus group, workshops and general brainstorming should be volunteer work or funded from other sources as the expectation is that you are submitting an idea that is past that stage. Proposals should request funding in a single funding round up to at least the Minimum Viable Product or Proof of Concept stage. Reasonable marketing costs for a developed MVP can be included if they help meet the challenge objective.\r\nAdditional funding is required complete the DID dApp and record system, the proposer has not provided a plan on obtaining these funds.\r\nThe timetable is realistic to complete the work and shows what is being done and when, with the exception of the development work which is very unclear as to what is being done and when. \r\nSuccess is defined as the \"Creation of a schematic model that use in the adoption of Atala Prism ID system\" which seems to correlate to \"Developer costs to plan and outline DID animal system\" in the timline. The \"Development and testing of a system for adoption of secure digital IDs for horses and pets\" seems to be work with no clear deliverable since Phase 2 has \"next steps in the development of DID dApp and record system\". The deliverables on the timetable should be clarified.\r\nThe plan describes the resources necessary to implement the proposal however the deliverable for the \"legal work on NFTs for animal records\" should be described in detail and whether it will be made public to the Catalyst community since they would be funding the work.\r\nThe proposal does not identify risks and challenges to a successful implementation.\r\nBased upon my experience, I disagree that it is highly likely that this proposal will be implemented successfully.\r\n", "q1r": 2, "q2": "The proposal provides a roadmap with a defined timeline however the milestones are not readily auditable.\r\nThe proposal should include projected metrics that correspond to the challenge objective such as the number of DID users projected to be onboarded at specific time intervals and the recruitment cost per DID user.\r\nThe proposal should detail specifically how progress will be reported back to the Catalyst community at regular intervals.\r\nBased upon my experience, I neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals.", "q2r": 3, "assessor": "z_assessor_344", "no_vca": 5, "ne": 4, "ng": 1, "nfo": 0, "vca_o": 2}, {"q0": "Interesting proposal that addresses the challenge of driving mass human adoption of Atala Prism by using animal records as a test case. The animal application is of value in itself, and would clearly benefit breeders and trainers – but it would also be a model for DID as an idea, and could win people over to it by demonstrating its effectiveness and its potential for integration with health records. (I do wonder slightly though – is there a danger, if this usage attracted a lot of attention, that it might accidentally have a negative impact and put people off DID for humans? Often things that are popularly seen as \"for animals\" – whether drugs, foods, or anything else - are seen as  not trustworthy or well-regulated, and attempts to apply them to humans are viewed negatively.) That said, though, the proposal does clearly address the challenge.", "q0r": 4, "q1": "The proposal team have a good, diverse range of relevant skills and knowledge, and there is also oversight from a Board. The timeline is clear and achievable, and it's good that it allows time for the consultation with focus groups to actually be used and integrated into project planning. The budget is well thought out. I would like to see the inclusion of some assessment of key risks and how they will be mitigated; but apart from that, the project looks feasible.", "q1r": 4, "q2": "It's useful here that the project Board will have ongoing evaluation and audit functions; and, as there is a clear month-by-month timeline, it will be easy to see if the project is progressing to plan. It would be nice to see the inclusion of some qualitative audit metrics that address the community consultation element of the project – if one of the measures of success is citizens \"[learning] about the opportunities to create and take ownership of a secure digital ID\", how will we assess whether they have learnt this? But otherwise, the project is very auditable.", "q2r": 4, "assessor": "z_assessor_540", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"q0": "The proposal presents a novel use of decentralised identities. This aligns with the mass adoption goal of the challenge in that it applies to two extremely large and relevant industries (Horse and Dog registrations / breeding). It isn't a stretch to see these industries being stepping stones to increase the number of consumers who see great utility in DIDs.\r\nGenerally speaking, the proposal comes across as well presented, serious and professional.", "q0r": 5, "q1": "The proposal members collectively represent an impressive cohort with the necessary technical and subject matter expertise to make this project a success. The professionally created YouTube video which showcases the proposal acts as a great piece of additional information while confirming proof-of-life. The detailed plan and reasonable budget ( just under 15% of challenge funds) are a good use of treasury funds given the potential market of the idea.\r\nWith multiple funded proposal requests, one potential obstacle to success would be juggling multiple projects at one. This is somewhat remediated by the proposers forming an incubator, however without any delivered projects, there is a question mark over the ability to deliver.", "q1r": 4, "q2": "The proposal timeline has captured specific deliverables allowing for auditability of the idea should it be funded. The focus group which is the lead deliverable helps to reduce the potential risk and challenges by focusing on the end user. Including proposal members with strong ties to the industries in which the proposal will operate highlights the quality of this proposal over others in the fund. The definition of success aligns perfectly with the intention of the challenge.", "q2r": 5, "assessor": "z_assessor_590", "no_vca": 6, "ne": 3, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "健康記録、繁殖記録、栄養記録を含む、動物の所有者のためのAP DIDシステムの概略モデルを開発し、テストする。", "experience": "畜産家、馬の調教師、全米馬協会の州代表、AKC会員、ITコンサルタント、開発者、JD、IT。"}