{"id": 380987, "author": "karlgandhi360", "title": "DAOForge Easily Create cardanoDOA's", "url": "https://cardano.ideascale.com/a/dtd/380987-48088", "category": 26237, "amount": 15000, "description": "En raison de la complexité de Plutus (le langage de script de Cardano), la création de DOA sur Cardano est un processus difficile et technique.", "funded": 0, "upvotes": 15939741, "downvotes": 19028094, "votes_result": 3088353, "votes_cast": 188, "f6_no_assessments": 5, "f6_rating": 2.1999999999999997, "videos": [], "media": [], "f6_assessments": [{"q0": "This proposal problem statement and solution are unclear and confusing. What is DOA? Explain briefly what is DOA. Also, the key metrics and goals of this proposal are not clearly presented. Please provide explanation on the goals of the project that is easy for the voters to understand.", "q0r": 2, "q1": "The proposer did not provide evidence of relevant skills and experience needed to implement the project. \r\nThe proposer also did not provide information on the required manpower and resources to successfully implement the project. Moreover,\r\nthere are no budget breakdown presented therefore it is hard to assess whether the budget requested is reasonable to achieve the set goals. Furthermore, this proposal provides confusing and unclear plan.", "q1r": 1, "q2": "This proposal did not provide a roadmap with milestones and a time horizon for achievement. Moreover, the proposer did not provide any key metrics and KPI that define the success of the proposal. \r\nFurthermore, the proposer did not provide any information for the voters to keep track of their work progress. Therefore, the information provided is not sufficient to audit the progress and the success of the proposal", "q2r": 1, "assessor": "z_assessor_357", "no_vca": 24, "ne": 1, "ng": 14, "nfo": 9, "vca_o": 1}, {"q0": " Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities and governance processes are for democratic and economic empowerment. DAOs are a powerful tool in this respect. I want to bring in my personal knowledge and experience on various governance models into action by assessing proposals in this challenge. This proposal explains the plan of providing a tool to create DAOs, however it only explains a rough setup of a workflow how within it, DAOs are supposed to vote on things and roughly that they are created themselves by a similar mechanism. The proposer fails to explain in detail how this is related to the cardano ecosystem and does not present concrete metrics/ goals so it can't be told whether the proposal will align with the challenge if implemented.\r\nThe scalability of the proposal cannot be assessed as it lacks any detailed technical description of how the solution works.", "q0r": 2, "q1": "The proposer does not provide sufficient information about themselves and does not provide proof of their alleged qualifications.  Feedback: For future proposals, maybe consider linking some verifiable personal information about yourself or some of the work you have already done. The proposer does not seem to have a clear idea about the type and number of team members required to implement the proposal. This is difficult to determine for this proposal anyways, as the solution to the targeted problem is not described in a clear manner. Especially the technical details are missing. Feedback: Try to define more clearly what you want to achieve and how you want to do it in future proposals. The budget set for this proposal does not have any justification or diversified items. Hence, it is also impossible to define whether the budget is rationable. Feedback: For future proposals, try to draft an accurate plan on what each item of your proposal will cost and rationable calculations on how you justify those costs. You need to consider that a lot of projects and teams want those funds so you should show them how exactly you are going to use them.\r\nNo timetable or milestones are provided for the proposal. This indicates the proposer has not properly thought about the different steps of enacting the proposal. Feedback: Create a detailed plan on what each aspect of the proposal needs work and time-wise and try to create milestones from it. Overall, no in-depth planning has been done for the proposal and no challenges, risks, solutions or anything similar have been presented and this proposal does not present enough to make a feasible project.", "q1r": 2, "q2": "No roadmap, milestones, metrics or KPIs are presented and the proposal is not broken down into identifyable items. The solution is only described by a plan of features the DAO is supposed to have. This makes it very difficult to properly audit the proposal. Feedback: Try formulating identifiable and auditable items in your proposal.", "q2r": 2, "assessor": "z_assessor_52", "no_vca": 18, "ne": 6, "ng": 11, "nfo": 1, "vca_o": 1}, {"q0": "The proposal by DAOForge is a simple enough premise - create a new web based interface to address the complexity in creating DAO's on Cardano. Projects on ethereum most similar to DAOForge would be colony.io and aragon.org, both provide a great entry point for poeple that don't have a coding background to create DAO's. This project has a global impact, in terms of scalability the project itself is about creating opportunities for others to scale, and entry points to create DAO's on Cardano.", "q0r": 4, "q1": "Success of this idea would rest on the skills of the project team, which in this proposal are very light and unsubstantiated/unclear. Would be great to have some transparency around the team involved. \r\n\r\nThe plan is clear in terms of what the proposer wants to acheive, but the timeframe, budget and risks involved aren't considered. This, along with a light on background for who will carry out this project is really difficult to say if the project will be successful, despite it being quite a relevant project. ", "q1r": 2, "q2": "Unfortunately outside of the creation of the page itself, there's no suggestion as to how the community will audit the progress, what success looks like along the way - what a potential workflow would be for a project of this nature. There are no KPI's. ", "q2r": 1, "assessor": "z_assessor_699", "no_vca": 14, "ne": 1, "ng": 12, "nfo": 1, "vca_o": 1}, {"q0": "The proposal addresses the challenge by way of being able to create a DAO and implement a governance structure using a web app. ", "q0r": 4, "q1": "The proposer has given an idea of how an instance of a DAO gets created and governance tokens get distributed. The propser has given examples of how the DAO is useful when an employment role or contract can be put up for voting. This is generally how most DAOs vote on any proposal in general. However there seems to be little detail on how DAOforge gets built, the roadmap to its development and how a one-stop-shop for creating DAO's remains resilient and decentralized (an idea could be ipfs hosted), or how the DAO contract owner, custodian etc gets control of the DAO contract.", "q1r": 2, "q2": "A more detailed plan with KPI and auditability on the projects development needs to be shown in my opinion. How is the team of DAOforge going to measure their success and at what rate.", "q2r": 2, "assessor": "z_assessor_750", "no_vca": 15, "ne": 0, "ng": 11, "nfo": 4, "vca_o": 1}, {"q0": "The vision that the proposal intends to achieve is very vibrant. A web application that simplifies the process of creating and integrating DAOs on Cardano could do wonders. This could give the ultimate edge Cardano needs to pioneer over the other chains. This could certainly provide more contributions to the community and boost its adoption globally.\r\n", "q0r": 4, "q1": "The proposer provides a detailed explanation of how the intended application would function. Apart from that, there is a deficiency in a lot of other sections. The proper misses out on providing the milestones and step-wise implementation plan. Furthermore, the experience of the proposer is very brief, no other member's expertise is showcased who might contribute to this proposal. The budget however small makes no justice until and unless a detailed breakup is tagged along with it. Hence, I am not entirely happy with the amount of info available to estimate the success rate of the proposal.", "q1r": 3, "q2": "The idea regardless of how unique and interesting it is, there are no proper metrics that might define its success. Also, the proposer does not provide any qualitative metrics that might align the proposal with the campaign's requirements. The missing section which outlines the risks and challenges makes it more difficult to track the progress and its cost of quality. With no information to assume how the success would look like and what this proposal might achieve at the end of its journey, the auditing would end up being less\r\n prolific.", "q2r": 1, "assessor": "z_assessor_751", "no_vca": 15, "ne": 5, "ng": 10, "nfo": 0, "vca_o": 1}], "solution": "DOAForge vise à réduire la complexité de la création de DAO sur Cardano en permettant aux utilisateurs d'utiliser une application web pour lancer des DAO.", "experience": "Travailler dans l'équipe d'ingénierie d'un DEX Cardano bien connu.  \nFormation universitaire formelle en mathématiques et en informatique.  \nExpérience des applications Web."}