{"id": 382630, "author": "jeffrey.downard", "title": "Spaceship Earth DAO", "url": "https://cardano.ideascale.com/a/dtd/382630-48088", "category": 26237, "amount": 28000, "description": "Nous n'avons qu'une seule terre. Nous devons la traiter avec respect. Comment utiliser les DAO pour soutenir la durabilité sociale et environnementale ?", "funded": 0, "upvotes": 16529585, "downvotes": 15239889, "votes_result": 1289696, "votes_cast": 179, "f6_no_assessments": 4, "f6_rating": 2.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "This team aims to build a DAO to buy carbon credits and promote social justice. Of course, I support this idea and I like the approach in general. Comparing this proposal with the goal of this challenge I don't see the alignment between the two. Furthermore, the presented proposal is more an idea than an executable plan. ", "q0r": 3, "q1": "The presented plan roughly describes the roadmap for the next month. However, the given information doesn't show the scope of this proposal nor the underlying mechanism or processes in detail. The budget is broken down and linked to related activates. The presented team seems to be capable of starting this project. However, more proof-of-life or references would help to see how likely this proposal will be implemented successfully.", "q1r": 3, "q2": "In my opinion the team doesn't provide enough information to audit this proposal properly. There are no real KPIs and metrics and success is only roughly described. To further improve auditability I suggest to add a documentation source so the community can track the progress of this proposal.\r\nI miss in this area that the proposer has not mentioned possible difficulties and how to overcome them.\r\n", "q2r": 2, "assessor": "z_assessor_484", "no_vca": 19, "ne": 1, "ng": 12, "nfo": 6, "vca_o": 1}, {"q0": "It is an enormous impact on C.A. time to read and forensic each of your team projects and vCA time reading these comments more than 10 times again and over again.\r\nTotal fund requested $320100 of 12 proposals (inc two shell proposals, proposal number 11 and 12 listed in Feasibility). \r\nI could sum up three main areas that all of your 10 submitted projects as follow: 1) introduce PRISM + Cardano by using Youtube, website and workshops as delivery channels 2) developing PRISM at gathering data rather than an essential tool in Phase I (6 months) and 3) some intangible legal involving.\r\n\r\nMost proposals paraphrased each other with minimal change. Here is one example. \r\n\r\nFor example, Defining Success of 1) and 2) below are only difference \"roadmap that small cities\" vs \r\n\"schematic model that\" and the rest are IDENTICAL—the same fashion for the rest of the 12 proposals.\r\n \r\n1) DIDs for Cities https://cardano.ideascale.com/a/dtd/DIDs-for-Cities/382636-48088\r\n\"Creation of a schematic model that use in the adoption of Atala Prism ID system. \r\nDevelopment of webpage on the Kepler SCS website with videos presenting a narrative of the community conversation as citizens learn about the opportunities to create and take ownership of a secure digital I.D.\"\r\n\r\n2) DIDs for Health Records https://cardano.ideascale.com/a/dtd/DIDs-for-Health-Records/382633-48088\r\n\"Creation of a roadmap that small cities can use in the adoption of Atala Prism ID system. Development of webpage on the Kepler SCS website with videos presenting a narrative of the community conversation as citizens learn about the opportunities to create and take ownership of a secure digital I.D.\"\r\n", "q0r": 1, "q1": "With 12 proposals for six months to do similar outcomes such as data gathering, workshops and legal advice, I do not believe these projects would address and expand Cardano and PRISM aggressively and can be deliverable with the listed team members. Here is the list of 12 similar proposals submitted by the same team.\r\n\r\n1) F7: Accelerate Decentralized Identity \r\nDIDs for Cities ($26,000) DID\r\nhttps://cardano.ideascale.com/a/dtd/DIDs-for-Cities/382636-48088\r\n2) F7: Accelerate Decentralized Identity \r\nDIDs for Health Records ($21,400)\r\nhttps://cardano.ideascale.com/a/dtd/DIDs-for-Health-Records/382633-48088\r\n3) F7: Boosting Cardano's DeFi \r\nModel Contracts for DeFi Loans ($25400)\r\nhttps://cardano.ideascale.com/a/dtd/Model-Contracts-for-DeFi-Loans/382635-48088\r\n4) F7: Lobbying for favorable legislation \r\nNetwork of policy advocates ($9700)\r\nhttps://cardano.ideascale.com/a/dtd/Network-of-policy-advocates/383251-48088\r\n5) F7: A.I. & SingularityNet a $5T market \r\nEthical A.I. for Singularity/Cardano ($31300)\r\nhttps://cardano.ideascale.com/a/dtd/Ethical-AI-for-Singularity-Cardano/382631-48088\r\n6) F7: A.I. & SingularityNet a $5T market \r\nHypotheses for A.I./Singularity Net ($26800)\r\nhttps://cardano.ideascale.com/a/dtd/Hypotheses-for-AI-Singularity-Net/382632-48088 \r\n7) F7: DAOs ❤ Cardano \r\nSpaceship Earth DAO ($28000)\r\nhttps://cardano.ideascale.com/a/dtd/Spaceship-Earth-DAO/382630-48088\r\n8) F7: DAOs ❤ Cardano \r\nCardano Climate DAO ($31500)\r\nhttps://cardano.ideascale.com/a/dtd/Cardano-Climate-DAO/382637-48088\r\n9) F7: Nation Building Dapps\r\nCreating a Level Playing Field ($28000) \r\nhttps://cardano.ideascale.com/a/dtd/Creating-a-Level-Playing-Field/384242-48088\r\n10) F7: Nation Building Dapps\r\nSmart Contracts and the Law ($32000) \r\nhttps://cardano.ideascale.com/a/dtd/Smart-Contracts-and-the-Law/383250-48088\r\n11: Redeploy Catalyst  ($30000) for 31 words proposal\r\nhttps://cardano.ideascale.com/a/dtd/Redeploy-Catalyst/383247-48088\r\n12: F7: Nation Building Dapps\r\nEducation Records ($30000) for 38 words proposal - \r\nhttps://cardano.ideascale.com/a/dtd/Education-Records/382634-48088\r\n", "q1r": 1, "q2": "Time and budget are close to identical pattern (copied/pasted)  with no detail and slightly differ in Dollar and not support-base and expected outcomes. There is no precise mechanism for Project Catalyst and the challenge team to follow and monitor your 10 proposals (minus 2 shell proposals).\r\n\r\nHere is a summary \"Time and Budget\" pattens used in 10 submitted projects with the listed team member, Law Professor.\r\n\r\nPhase I (6 months)\r\n\r\nMonth 1: some type of \"outreach\" (vary $$)\r\nMonth 1-2: \"Workshops\" (vary $$)\r\nMonth 2: Webpage development and and Youtube channel related (vary $$)\r\nMonths 2-3: identify the issue (vary $$)\r\nProject direction:  (vary $$)\r\nProject oversight and evaluation by members of Board of Advisors months 1-5: (vary $$)\r\nLegal work on guidelines for the roadmap (vary $$)\r\nTotal: (vary $$)\r\n\r\nPhase II (6-9)\r\nPhase III (10-12)\r\n", "q2r": 1, "assessor": "z_assessor_726", "no_vca": 16, "ne": 2, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "First off wow. This proposal exemplifies the true nature of the Challenge and Cardano writ-large. The DAO concept is a new and innovative way for social organization in a way that is participatory and incentivized by and for the many, not just the few. By creating a model DAO that will be used to support environmental and humanitarian groups recruit and fund their projects, this proposal has massive potential to bring positive change. The proposers also have laid out a simple template for how such a DAO would operate upon interest from participants, which to me shows they have thought about how such a structure could function and deliver results. ", "q0r": 5, "q1": "Yes, with the plan and experience presented it is extremely likely that the proposal would be implemented successfully. The best part about this plan is that the DAO structure is not simply for one project or another but creates an opportunity for a variety of organizations and individuals to work together towards their mutual goals. By maximizing on the knowledge of the crowds, and integrating players such as (Sierra Club, Habitat for Humanity, The Nature Conservancy) this project could grow beyond what is initially ideated. There is also significant technical expertise on the team and board of directors that will oversee the development and implementation of the DAO. Not only do they have the technical expertise on the Cardano/blockchain side, they also have several members who specialize in challenging areas such as environmental law, ethics, and policy. Given these exciting pieces of information I highly confident that the plan would be implemented successfully. ", "q1r": 5, "q2": "Based on the information provided it is likely that the project could be audited. The addition of a board of advisors provides an additional layer of oversight not common across the blockchain space. I also appreciate that the proposers explicitly state that all workshops will be recorded and uploaded to youtube while all templates will be made publicly available to the Cardano Community. Why I'm giving 4/5 and not fully marks is because I do not see opportunities for the Cardano Community itself having any participation in the oversight or auditing of the steps. Given the potential impact that this project could have, I'd like to see more community involvement. One suggestion which could help in this instance would be to select a number of Cardano Community representatives/experts to sit on the board of directors. Overall great work and looking forward to the results. ", "q2r": 4, "assessor": "z_assessor_66", "no_vca": 20, "ne": 4, "ng": 15, "nfo": 1, "vca_o": 1}, {"q0": "This proposal could incorporate/merge with another one by the same team in the same challenge (Cardano Climate DAO) since they have similar goals (buy carbon credits) and very similar approaches to achieving their objectives (create a DAO, website for it, workshops for volunteers, video tutorials). Otherwise, the core idea behind this proposal is interesting and has the potential to develop into something with great potential, but I find that for such a grand project the plan is not very detailed and I need to fill some of the gaps with my own imagination and as such I find it hard to conclude how well it addresses the challenge.", "q0r": 3, "q1": "The team’s experience and skills is provided through an external link, proving their capability to implement this proposal. However, the proposal itself is missing information that would prove the plan written is sufficiently well thought through. One important question that arises is: How will the DAO financially support itself in the future? If it wants to sustain projects on its own, a well defined source of income is the most important aspect that needs to be addressed.", "q1r": 2, "q2": "The budget is not very clear, the KPIs are missing, and there is no section for risk management. For an endeavour of such magnitude, these aspects are very important to enable the community in the evaluation of the project’s development, success and needs that will arise. For a future re-submission, I highly suggest including these.", "q2r": 2, "assessor": "z_assessor_20", "no_vca": 18, "ne": 3, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "Créer un modèle de DAO à but non lucratif qui soutient des projets d'achat de crédits carbone, de conservation de l'habitat de la forêt tropicale et de promotion de la justice sociale.", "experience": "Recherche et enseignement en matière d'éthique environnementale et sociale, droit de l'environnement, droit des affaires, consultant en systèmes d'entreprise, développeur full stack."}