{"id": 383146, "author": "secretdecks", "title": "Enhance Automated Self Reporting", "url": "https://cardano.ideascale.com/a/dtd/383146-48088", "category": 26237, "amount": 2987, "description": "L'auto-évaluation est difficile, bien que très importante dans les organisations distribuées. Les outils actuels rendent fastidieuse la réalisation d'un auto-audit correct.", "funded": 2, "upvotes": 220657053, "downvotes": 2080890, "votes_result": 218576163, "votes_cast": 1128, "f6_no_assessments": 4, "f6_rating": 5.0, "videos": [], "media": [], "f6_assessments": [{"q0": "This great proposal is within the challenge goal, because I think this implementation will be a need for the Cardano governace and it will help many people to reach Cardano playground and growth in the future.\r\nThis proposal is celar and concrete (https://www.secretdecks.com/), guarantees solidity in deliverables, support transparency and accountability for all Cardano community.  This is an important proposal to integrate new distributed cooperative (DisCo) concept and connect them.\r\nThe proposal clearly articulates the contest, the problem, the challenge and how it will add value to the Cardano ecosystem and for all of the stakeholders..", "q0r": 5, "q1": "The proposer's team is very well skilled about the whole context and, knows the contento creation very well, and github developer with 5 years skill on blockchain, .\r\nThe scope of the solution is well explained (e.g. how the funds will be spent, what features will be implemented, and so on…).\r\nWell done that the proposers team worked on the solutions and continues to propose and improve services for users.", "q1r": 5, "q2": "The proposer provides a step-by-step plan for the implementation with clear milestones, coherent KPI metrics and a defined time horizon. The only thing I miss in this area is that the proposer has not mentioned possible difficulties and how to deal with them (e.g. difficulties in adoption of the tools/API…) The proposal offers a realistic timetable to complete the work and coherent budget with this challenge. Very good proposal.", "q2r": 5, "assessor": "z_assessor_114", "no_vca": 29, "ne": 3, "ng": 18, "nfo": 8, "vca_o": 1}, {"q0": "To begin with: This proposal is very well written and shows that you can communicate even complex topics in an understandable way. Well done! With the approach to facilitate self reporting, this project could be seen within the challenge setting. Setting this proposal in relation to the requested amount I see a big improvement for our ecosystem. Therefore I rate impact with 5 stars. ", "q0r": 5, "q1": "The plan presented is easy to follow, and although a complex subject is covered, the way the technical details are presented makes it very easy to understand the scope of the project. This should serve as a model for many other projects. The team has already proven his skills and experience many times (also in the Community) and the presented plan shows that he knows what he is talking about. The budget is small and compared to the potential impact absolutely fair from my perspective. I expect this project to be successfully implemented.", "q1r": 5, "q2": "The objective and timeline are clearly defined. Also this team provides a documentation source to track the progress of this proposal (GitHub). Also the success could be defined more accurately. This proposal has everything that the community needs to audit the progress and success of this project.", "q2r": 5, "assessor": "z_assessor_484", "no_vca": 19, "ne": 3, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Relation to personal qualifications: As a year-long activist in both party-politics and non-party related political (grassroots) groups I know how important decentralised communities and governance processes are for democratic and economic empowerment. DAOs are a powerful tool in this respect. I want to bring in my personal knowledge and experience on various governance models into action by assessing proposals in this challenge. The proposal adresses a clear problem, the lack of DAO auditing tools. Providing such tools will be very beneficial for the Cardano ecosystem and all DAOs that struggle with such issues. The key metrics and goals of the proposal align excellently with the outlined challenge settings.This is one of the proposals that will participate a lot in increasing DAO scalability.", "q0r": 5, "q1": "The proposers are very transparent about themselves and have no trouble showing they are competent and up for the challenge. The proposers know the type and number of team members required to implement the proposal and present them transparently. \r\nThe budget is outlined clearly and broken down into identifiable items and is reasonable to achieve the set goals.\r\nThe proposal offers a realistic timetable and roadmap to complete the work and a very detailed, rationable and transparent implementation plan. It describes the resources used and every imaginable detail is shown. This is a great example of a good, feasible proposal.", "q1r": 5, "q2": "Well-defined, detailed metrics and an auditable roadmap are presented that define the success of the proposal. A clear, understandable problem description is accompanied by a very detailed, auditable description of a solution.", "q2r": 5, "assessor": "z_assessor_52", "no_vca": 20, "ne": 5, "ng": 9, "nfo": 6, "vca_o": 1}, {"q0": "The project team have proposed to develop a tool to automate self auditing of work carried out in Git repositories. Tracking time invested and projects executed will assist the development of reputation and documentation of outputs from individuals. \r\n\r\nOther DAO's and DisCos can use this templae and the GitHub actions, and it will bring about an increase in understanding individual contributions to projects and indeed allow people to demonstrate what they are working on currently, share that informaiton with others and lead to more fluid and less silo'd interactions pertaining to the work being carried out. ", "q0r": 5, "q1": "The team have a very clear and concise plan and have demonstrated prior work exerience as a team. They have built a distributed cooperative which was funded in f6 and it enhances the mechanism being built.\r\n\r\nThe team are engaged in Cardano, they have provided a detailed plan with the project launch positioned in Jan to be followed by testing and redevelopment, leading to completion in May. \r\n\r\nThe budget is very modest and achievable given the potential bredth of the outcome. The team are upfront about the need for experimentation and testing through this however. ", "q1r": 5, "q2": "The community will be engaged throughout the process as the team will be requesting feedback and providing documentation throughout the development. The team have committed to publishing documentation throughout on each milestone. The delivery roll out and dates are clearly marked. ", "q2r": 5, "assessor": "z_assessor_699", "no_vca": 16, "ne": 4, "ng": 11, "nfo": 1, "vca_o": 1}], "solution": "Une enquête sur les contributions est automatiquement générée et remplie avec les contributions effectuées dans tous les dépôts Git et le temps suivi dans clockify.", "experience": "La construction d'une coopérative distribuée, précédemment financée dans le cadre de f6, améliore le mécanisme en cours de construction, qui fait partie de la communauté des constructeurs de Cardano."}