{"id": 396617, "author": "orbis", "title": "Orbis: Layer 2 ZK Rollup", "url": "https://cardano.ideascale.com/a/dtd/396617-48088", "category": 26437, "amount": 1000000, "description": "Cardano can't scale to support millions of users and currently proposed scaling solutions make compromises on security and decentralization.", "f6_no_assessments": 17, "f6_rating": 3.7254901960784315, "videos": [], "media": [], "f6_assessments": [{"id": 2086, "q0": "Key takeaway: Orbis addresses the fundamental problem of scaling Cardano and is very closely aligned with the challenge. The team seems strong, but there are signs of poor / lax management and weak governance. Orbis also asks for the entire funding in the challenge. Voting for it translates into uniquely supporting it vs. any other funding request for a scaling solution, at least during this funding round.     \n\nThe problem. Like any permissionless blockchain, Cardano will face formidable challenges when striving to achieve the transaction capacity necessary to sustain all up-coming real world applications (payment processors, games, NFTs, oracles, etc.). \n\nThe solution. Orbis’ value proposition is to position itself as a fundamental infrastructure, bringing to Cardano a scaling solution (layer 2) through a ZK rollup (a mechanism to bunch up multiple transactions into one piece of data in order to save space and computing power on the blockchain). Strategically, an ecosystem of strong layer 2 solutions would allow Cardano layer 1 to remain focused on decentralization and security. \n\nScalability. Orbis would function as a stand-alone solution and would have the potential to be built upon, including in non-Haskel languages (layer 3 solutions), allegedly with a very high potential scalability. However, since other Cardano scaling solutions are already in development (think Hydra), a few additions would have been extremely valuable in terms of describing how Orbis fits into the wider strategic picture of Cardano’s future:\n\nComing up with indicators of how scalable Cardano will be with Orbis vs. without it. For instance, through quantifying throughput or transaction finality, in easy to digest figures or comparisons with other scaling solutions.  \nPerforming beforehand and disclosing within the proposal simulations of envisaged performance under a variety of load and network scenarios - stress testing the solution a priori.", "q0r": 4, "q1": "Orbis should be ready by the end of 2022 - beginning of 2023, with a full open source solution right from the start. \n\nRyan, the project leader, is an extremely well articulated leader in the current blockchain industry, and he has a unique capacity to explain complicated topics in very simple terms. The team behind him is very solid, with a wide array of competencies necessary for such a complex project, including mathematicians, cryptographers, engineers and software developers. They are also backed by a solid track record. For instance they are behind the Ardana project, a future Cardano stablecoin ecosystem. \n\nUnfortunately, the budget aspects of the project have not been offered the same level of detail as the technical aspects. The budget is not broken down at all, and at this stage there is little to go through and analyze. Such a massive mistake for a proposal asking for a 1 million USD is thus a major red flag not due to the budget not being detailed (I would offer the team the benefit of the doubt that perhaps a regrettable error was behind the mistake, and budget breakdowns actually exist) but rather that this blunder offers a clear view into the team’s practices and QA controls in place, and maybe the overall governance mechanisms are not that strong. \n\nA consolation comes from the fact that the project has been live for a few months, self-funded so far, but we do not have a lot of details with regards to the progress made. It would have been very useful as well for the team to shed light on whether the project would continue in the case of not being funded during this round. Also, the project went for a high risk / high reward approach and asked for the entire funding in the challenge. So any other better positioned proposal would render it unfundable. A more humble approach and perhaps showing consideration to the community would have been to identify solutions that split the budget along discrete milestones and ask for more modest funding during several rounds. \n\nFrom a technical perspective I highlight two points for reflection:\n \nWhile personally understanding the choice of selecting elliptic curve zkSNARKs (not quantum computing safe) due to current blockchain size limitations, it would have been beneficial for the proposers to offer comfort whether the Orbis solution can be easily and effectively “quantum proofed” into the future if the need arises. \nIn the beginning Orbis will be launched using only one single validating node, run internally by Orbis Labs. It is not very clear how Orbis intends to maintain “liveliness” in case of the node being taken off-line, and also the proposal does not offer any insight into what disaster recovery plans shall be put in place in order to minimize the likelihood of this happening. This risk of course would diminish during phase 2, when up to 100 nodes are planned to be introduced, and phase 3 with permissionless nodes would of course bring an end to this risk. ", "q1r": 3, "q2": "A strength of the proposal is that several of the individual system components are already under development. I would have been extremely glad to see those details complemented by easy to understand metrics, like percentages of completion added right next to the items. It was also extremely interesting to hear a very recent podcast with Ryan discussing Orbis in a very articulate manner - a good sign that the community can expect future updates in the future from the project heavyweights.  \n\nIt is rather disappointing that other auditability key aspects are not thoroughly detailed. For example the risks section has not been touched-upon at all, which is another strong red flag into the lax management culture within the team. Similarly, there are no proposed metrics and KPIs, or other visible communication channels with the community.  Proposing for instance a dedicated communications person to liaison with the Cardano community would have been an indication that the team truly stands behind its promise to deliver timely and useful information regarding the development of Orbis in the coming months. ", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 8, "ne": 5, "ng": 2, "nfo": 1, "vca_o": 2}, {"id": 8644, "q0": "Scaling solutions based on ZK Roll up will be a trend in the near future. This technology racing started 3 years ago and has seen many projects born, the most prominent to date are probably Loopring, Stark-ware, Zk-sync. However, Just Loopring is widely known, while Stark-ware or Zk-sync is less well known and these two projects are focusing on develope in the form of a Beta framework. A famous platform also participating in the ZK roll up technology race is Polygon, in 2021 Polygon spent nearly 1 billion USD to buy 2 projects. This shows the \"hot\" of the ZK roll up scaling solution. Back to the proposal, the Zk roll up project is called Orbis. Scaling solution based on ZK-rollup technology is the only flawed solution that Cardano has not yet implemented. State channel has Hydra, Sidechain has Mikomeda or recently HyperCycle, ZK-roll up still not available (Sharding may take longer). Appearing of a proposal like Orbis, this will be the first complete piece for Cardano scaling solutions at layer 2 (off-chain). The proposed orbis model is similar to the Zk-roll up projects that have been developed in the past 3 years. One point worth noting in Orbis' solution is that they do not have a \"trusted setup commitment\". Usually Zk-rollup projects will implement the following steps: rules -> circuit -> polynominal -> trusted setup. Orbis intends to use prover on a centralized server, which reminds me of a project called ZKswap. A solution for a centralized processing server like prover will help speed up transaction encapsulation, reduce costs, but it will be very dangerous if it is hacked. I think the proposer should make this point more clear in proposer’s solution. However, from my point of view and understanding, the most difficult thing in implementing Zk-rollup on Carano is synchronizing the state of accounts from the ledger. With Ethereum or EVM based on EVM blockchains, it's not difficult to just sync the \"world state\" from the EVM, but with Cardano it will be different. In this case, I suggest that proposer refer to Mikomeda or research about Zendoo sidechain (a sidechain based on ZK proof researched by IOHK and Horizen). Although there are still some solution problems as I mentioned above, I still highly recommend this proposal because it fits the criteria of this challenge.", "q0r": 4, "q1": "Scaling solutions based on ZK Roll up will be a trend in the near future. This technology race started 3 years ago and has seen many projects born, the most prominent to date are probably Loopring, Stark-ware, Zk-sync... However, Just Loopring is widely known, while Stark-ware or Zk-sync is less well known and these two projects are focusing on develope in the form of a Beta framework. A famous platform also participating in the ZK roll up technology race is Polygon, in 2021 Polygon spent nearly 1 billion USD to buy 2 projects. This shows the hotness of the ZK roll up expansion solution. Back to the proposal, the Zk roll up project is called Orbis. Scaling solution based on ZK-rollup technology is the only flawed solution that Cardano has not yet implemented. State channel has Hydra, Sidechain has Mikomeda or recently HyperCycle, ZK-roll up still not available (Sharding may take longer). Appearing of a proposal like Orbis, this will be the first complete piece for Cardano scaling solutions at layer 2 (off-chain). The proposed orbis model is similar to the Zk-roll up projects that have been developed in the past 3 years. One point worth noting in Orbis' solution is that they do not have a \"trusted setup commitment\". Usually Zk-rollup projects will implement the following steps: rules -> circuit -> polynominal -> trusted setup. Orbis intends to use prover on a centralized server, which reminds me of a project called ZKswap. A solution for a centralized processing server like prover will help speed up transaction encapsulation, reduce costs, but it will be very dangerous if it is hacked. I think the proposer should make this point more clear in proposer’s solution. However, from my point of view and understanding, the most difficult thing in implementing Zk-rollup on Carano is synchronizing the state of accounts from the ledger. With Ethereum or EVM based on EVM blockchains, it's not difficult to just sync the \"world state\" from the EVM, but with Cardano it will be different. In this case, I suggest that proposer refer to Mikomeda or research about Zendoo sidechain (a sidechain based on ZK proof researched by IOHK and Horizen). Although there are still some solution problems as I mentioned above, I still highly recommend this suggestion because it fits the criteria of this challenge.\n\nThe detailed project implementation plan made me a little disappointed when the proposer did not give specific timelines even though the work items listed were quite detailed. Full implementation of this project would take years, so providing detailed timelines would increase the feasibility of the proposal. And the proposer also has plans to prevent risks during the research and implementation of the proposal. Why do you need detailed timelines, I can take an example of 1 items that can be considered as suggestions for the proponent (just 1 suggestion because in terms of technical level of programming I am not equal to proposer for sure)\n1. circuit research, after the circuit will be a polynomial proof study, then program it into a program for the prover and receiver to use together. This is the initial hard work for which the proposal must have a detailed plan. Because it will not be possible to use studies of existing solutions, current solutions build rules according to the model of Ethereum (Accounting ledger or merkle tree structure).\nThe team that made the proposal is a team of many experienced programmers, including Ryan Matovu, the founder of the famous project on Cardano: Ardana. This team I think is fully qualified to carry out the project.\nrequested budget: 1mil USD. However the most interesting part perhaps is the detailed budget breakdown: nothing? The criterion of the challenge is to not limit the budget if it is possible to come up with a clear plan and demonstrate it. It is a pity that the proposer was missing the details of the allocation of funds.\nA proposal that lacks detailed fund breakdown and implementation plan without a specific timeline makes it difficult to assess its feasibility.\n", "q1r": 2, "q2": "Measuring or tracking project progress on scaling solutions project with very high technical difficulty like ZK roll up solution requires a very detailed implement plan, a detailed budget breakdown, and a source for checking coding activities, planning to make monthly technical reports. It is very unfortunate that the proposer did not complete this detail. However, in the case of funding, the proposer can completely add to this section. If this proposal can be completed, I can see a breakthrough in solving the problem of transaction speed, reducing transaction fees for many Defi projects or NFT projects. That is essential for the Cardano ecosystem this year.", "q2r": 3, "assessor": "z_assessor_683", "no_vca": 7, "ne": 4, "ng": 3, "nfo": 0, "vca_o": 2}, {"id": 6687, "q0": "I strongly agree that this proposal fits in very well with the challenge goals and settings. We all know how layer 2 such as Polygon on Ethereum exploded the growth and improved usability of Ethereum. We also have seen that this year is primarily devoted to bringing different scalability improvements (such as pipelining, Hydra) to Cardano. Nevertheless, layer 2 solutions on Cardano will have at least as strong potential as the likes of Polygon had on Ethereum. \n\nCardano is a better designed system built with mathematically verified theorems and state of the art software engineering principles. As a senior developer myself, I know how important this is in terms of scalability. The ZK roll ups (based on ZK Snarks) that Orbis is proposing is an attempt to bring in the zero knowledge proof- based layer 2 solution to Cardano. They want to do this via having on-chain smart contracts that utilize one way zero-knowledge proofs that  don't require any knowledge to validate if a statement is true. These proofs already validate that transaction have already occurred on Layer 2 and only needs validation via smart contracts on Layer 1 which is Cardano. Therefore, bringing similar security (and many other similar benefits) to layer 2.\n\nThis is clearly a huge step forward and in addition to Hydra head, that IOHK is working upon, it must have to make Cardano a billions of users operating system. Good luck to the team, and amazing work been done already.\n", "q0r": 5, "q1": "Firstly, I would like to say that the team that is working on Orbis and hence this proposal, is very very well experienced. The team members' profiles are public (with also Github links with active commit history) and the founder of this project is also the founder of Ardana, which is already very popular (a stable coin eco system built on Cardano) in the Cardano community. So from the perspective of team abilities, the full point from my side.\n\nAdditionally, the detailed plan presented is very technical. The different components that are required for this proposal to be successfully implemented are under development and work in progress. I believe that whoever wrote this proposal came from a technical background or under heavy workload. The reason I mention this is that at times this proposal just seems too complicated in different areas. For example, the breakdown of the plan is very difficult to understand for a non technical voter (which is indeed a big proportion among all voters out there). Another issue I see is that budget details were not provided and left as - to be filled - but were never filled (which they forgot, even after providing hints on the comments section, if it is possible to split this budget). \n\nWith such a big project and big team, I would also expect a lot of professionalism in their approach to project management. To me it feels like this project is driven by technologists (nothing wrong with it) but it is also the responsibility of the proposer to fulfill the Catalyst requirements in every dimension. E.g. Risk section is left as NA, I do not agree that such a complex project will not have any complications that might push back the deadlines ?\n\nThe total budget asked is 1 million in Ada and there are no details provided on how this number was reached. The voters should also understand that if this proposal is funded then none of the other proposals might get funded from this challenge. Overall, I feel that this project will be implemented successfully (as I am a developer myself), however, with this much budget requirements I expected better writeup from the team. Therefore, I can not strongly agree.\n", "q1r": 4, "q2": "The proposal has provided a lot of technical details on how they will track the progress of this proposal. Additionally the success metrics provided by the team gives an in-depth insight from the usability perspective. The full decentralized layer 2 solution built up on Cardano, encapsulating away the nitty gritty technical marvel of roll ups and zero knowledge proofs and hence allowing similar security to users which Cardano offers at layer one.\n\nNevertheless, i think the auditability section could have provided additional details complimenting the technical details such as writing Plutus core to C compiler, in my opinion for non technical voters it would have been a great help to understand things in layman terms. Regardless, since i am an experienced developer myself and the overall writeup and currently in progress work, in addition to the team sharing progress/knowledge on Twitter open spaces, i feel that the proposal team is working tirelessly and regularly sharing their progress/current state with the community. Therefore, I strongly agree that this proposal is auditable and the community can easily track its progress. \n", "q2r": 5, "assessor": "z_assessor_454", "no_vca": 6, "ne": 4, "ng": 2, "nfo": 0, "vca_o": 2}, {"id": 138, "q0": "The challenge asks for proposals that will help Cardano scale, to secure Cardano main chain is not overloaded as new protocols in DeFi, NFTs and gaming are being released. \n\nChallenge encourages proposals within the following scalability topic areas:\n- Rollups (e.g. zero knowledge rollups, optimistic rollups)\n- Sharding\n- Sidechains\n- State channels\n\nThe proposal description is a very thorough and well written description of the Orbis platform and capabilities. The platform is promising to be the exact thing the challenge is asking for and fits into several of the topics encouraged by the challenge. If this platform is voted, I am confident it will have a huge and positive impact for Cardano. Would have loved the Prover to be decentralized already from the start, but as this is part of the platform roadmap, I am not degrading the impact rating. \nI strongly agree that this proposal effectively addresses the challenge and rate Impact to 5", "q0r": 5, "q1": "The proposer team consists of professionals from a wide range of relevant areas of expertise and should be well prepared for successful completion if funded. The proposal has no budget...only states the need for all of the challenge funds. There is also no time horizon for when the platform can be expected to be delivered to the Cardano community. The proposer has answered N/A when asked about risks. Because of the missing budget, risks and time horizon, it is difficult to give this proposal full Feasibility rating as it is unclear what will be delivered, and when.\n\nI neither agree nor disagree that it is highly likely that this proposal will be implemented successfully and rate feasibility to 3", "q1r": 3, "q2": "The proposal does not contain clear milestones and time horizon for achievement. There are no KPIs to measure progress, but the proposal contains current status for the different components of the platform. Unfortunately no indication of when delivery might be expected, as mentioned in Feasibility scoring. If this proposal is sent in a future fund, I would suggest adding more measurable milestones, prioritizations of components and how important the different components are for the total delivery. Which of the components are mandatory, and which are optional or less important from day 1. The proposal scores well according to Clarity as the mentioned components that comprise the total solution clearly address the solution of the problem the challenge want fixed.\n\nI neither agree nor disagree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals and rate Clarity/Auditability to 3", "q2r": 3, "assessor": "z_assessor_1075", "no_vca": 15, "ne": 5, "ng": 10, "nfo": 0, "vca_o": 1}, {"id": 6585, "q0": "Orbis aims to be the layer 2 scaling solution of the cardano blockchain. As you may already know, blockchains have to solve the trilemma of scalability, security and decentralization. Cardano is at the stage of scalability which Orbis is trying to solve with the zk rollup technology. The goal here is be able to scale to millions of users without sacrificing the decentralization of the blockchain. If you have used cardano lately, you may experience delays on your transaction as the network can be pretty congested. zk rollups allows the transactions to be done off chain and be sent on chain on bundles. So instead of having for instance 10 transactions on cardano, those 10 transactions will be done off chain and be sent once on the cardano network. It means that instead of 10 transactions on the cardano network, we will have only one transaction. This will allow the network to accommodate millions of users without suffering the congestion. This is a great project for the cardano ecosystem and I hope the proposer can pull this off.", "q0r": 5, "q1": "The founder of this project is the founder of Ardana which is part of the defi alliance. Personally I expect great things from Ardana as it should be one of the cardano defi. That said, I have high confidence in the successful implementation of this project. Furthermore, they have provided the necessary information to complete work. The team is composed of high profile members who have the links of their linkedin profiles included in the proposal. This is a huge project and for that reason, they have requested the entire fund for this challenge. Although I like the project, I feel like that maybe they could spread the funding between many funding rounds. I think that other projects should also have some chances to get funded too. Other than that, I believe in the success of this project if funded.", "q1r": 5, "q2": "The project should be auditable because they have a roadmap but since this is a huge project, I assume the giving dates may be difficult. I suggest to the proposers to provide milestones and time horizons for achievement. I think that the greatest guarantee for this project is its founder who is the leader of the ardana project. I think that many are expecting great things from ardana. At the same time, we can expect the same from orbis as both projects have the same leader. Altogether, I think that this proposal is great for cardano and that it succeeds together with june hard fork, to offer a truly great scaling solution for the cardano network.", "q2r": 5, "assessor": "z_assessor_439", "no_vca": 9, "ne": 0, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 9987, "q0": "The scaling of the cardano network is important to reach the millions and billions of users. The proposal is to offer a secure offchain 2nd layer based on zsnark hashes. This will allow the cardano network to remain secure without compromise and the Orbis layer will handle the high output. The team is made of highly focused cryptographers and programers. Improving the scaling with new layer 2 options such as hydra will enable more users to utilise the network without backlog or slowdown while keeping the secure layer 1 as the base blockchain.", "q0r": 4, "q1": "The team is well detailed and very knowledgeable. In addition the project and idea is a feasable project that was even referred to by CH. \nHowever the budget and timeline a missing completly. A total of 1M$ was requested which amount to the whole budget for this challenge section. without any breakdown of roadmap or deliverables over time. \nThe breakdown of the project scope is well detailed and the idea is well presented. I feel this project needs to mature a little more and provide a justification for the budget requested in detail along with a suitable timeline. ", "q1r": 2, "q2": "Having no budget breakdown and timeline roadmap on the progress it will be difficult to audit and review the progress against any commitment. the team albeit very capable of assuring a succesful project will need to provide an auditable channel or progress report breakdown with specific KPIs", "q2r": 1, "assessor": "z_assessor_785", "no_vca": 8, "ne": 1, "ng": 6, "nfo": 1, "vca_o": 1}, {"id": 9971, "q0": "This is a very interesting problem statement and proposed solution for the future roadmap of Cardano development. The Orbis project utilizes zkSNARKs (Succinct, Non-interactive, ARgument of Knowledge), and proposes main components: the Prover and the Verifier. This is very potential to be synced with current Hydra solution of cardano and utilized ZK proofs, and has potential for Layer 2 Layer 3 for any specific use cases such as DeFi, NFTs, supply chains and micropayments. The team makes a bold statement that “Hydra will not solve every scaling problem.” All in all the team is a bit overestimating their own proposal and not foreseeing any risk such as the Risk of decentralization and the synchronization between the layers. The team should take account to comments of the community to have the full holistic points of view for the total proposal", "q0r": 5, "q1": "The outstanding point of the proposal is the well rounded team member which rich experience in varieties of blockchain industry. The team experience can be well verified with linkedin and github trajectory. What could have been done better is the milestones for each of the  statuses of individual system components: including Arithmetic circuits, TinyRAM LLVM backend, Untyped Plutus Core to C compiler, Pluto, Plutarch, Prover node, Verifier contract, Halo 2 verifier primitive for Plutus, TinyRAM emulator and assembler. There is also a huge concern on the budget requested 1,000,000$ which is maximum of the total F8: Cardano scaling solutions. ", "q1r": 3, "q2": "This is also very not clearly identified and thus makes this proposal hard to be audited. It is encouraged that the team defined what is success looks like for the securities and decentralization of the root Cardano blockchain’s traits with the mass scaling application. The concept of the best in class next generation modular blockchain is very ambiguous and has no milestones to be tracked, the proposal is also brand new and thus making the deliverables are a bit challenged for the team with an ambitious desire to solve the complex puzzle.", "q2r": 3, "assessor": "z_assessor_782", "no_vca": 5, "ne": 0, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 8439, "q0": "After thorough reading, I think this proposal is quite practical as it concerns about layer 2 solutions on Cardano as the ecosystem and applications are thriving. As far as I'm concerned, there are not many experienced team capable of doing this.  I hope this proposal receive great support. However, I would like to see more explanation of how the Orbis works.", "q0r": 4, "q1": "The team behind this proposal is very qualified and experienced with clear profile. I would like to see more detailed draft and more information on their website and github. I hope this proposal will be soon completed as it is still in the first stage. Also, a clearer timeline for each job is recommended. ", "q1r": 4, "q2": "It is possible to check the progress of this proposal from their website and github. They shows their seriousness and willingness in executing this proposal and other dapps to the community. Also with the talented team and clear profile, I could expect the feasibility of this proposal. ", "q2r": 4, "assessor": "z_assessor_678", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 7570, "q0": "Cardano can't scale to support millions of users and currently proposed scaling solutions make compromises on security and decentralization. Orbis is a ZK(zero-knowledge) rollup layer 2 protocol for Cardano. Moving computation off-chain scales Cardano's throughput significant. The project also has very clear development plans, but the issues affect the expansion need constructive studies like this to help clarify the problem as well as build long-term solutions. Orbis has two main components: Proven and Verifier. Cardano needs a minimal scaling solution for maximum results, and Hydra is not going to solve all the scaling issues. Orbis proposes the best possible scaling solution as it maintains all the core design principles of the Cardano blockchain while being able to scale the network to where it can host RealFi applications. and DeFi secure at scale. The proponent has not stated the risks of the project as well as the solution. \"", "q0r": 5, "q1": "The proponent has not mentioned the risks of the project as well as the solution. This requires many sessions of analysis and exchange to jointly anticipate the risks encountered. The proposed cost is too great to be equivalent to 100% of the cost of this challenge, and the proponent also does not specify how the funds will be used, which will not guarantee the project's completion. completed on schedule. Information about the identity of project members is complete, including social networking sites, professional skills.", "q1r": 4, "q2": "This is a research project, so the metrics are difficult to measure. . The success of the project identified Orbis as a decentralized layer 2 protocol that inherits the benefits of Cardano in terms of security and decentralization while expanding the network in terms of throughput to a level that can support global finance. and other large-scale applications such as DID, DeFi, social graph, NFT, and micropayments. This is a new proposal that has not been funded by any funds yet.", "q2r": 4, "assessor": "z_assessor_610", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"id": 6203, "q0": "Fund 8 is a watershed fund for Catalyst and Cardano. After some stuttering in earlier funds, this time the Cardano community decided to fund some major Cardano scaling solution projects - by dedicating a challenge to this. Let's be frank. This is a playground in which a limited number of players can participate (due to the high-level cryptographic nature of the beast and the amazing cost of developing these solutions). It is encouraging to see that many proposals applied - including this one. Scalability is the ability to improve the chain's usability to allow tens of thousands, millions and tens of millions of users to use it - without degraded performance. There isa general consensus that rollups and alternative solutions are needed and the Orbis team is proposing a comprehensive solution that would result in a delivered product in the form of a decentralized layer 2 protocol which inherits Cardano’s benefits of security and decentralization while scaling the network in terms of throughput to a level which is able to support global finance and other mass-scale applications. This proposed solution will initially use fees in ADA. One word: Excited about the amazing potential! OK....Excited! However, one of the key components of the Impact field has unexplainedly been left empty: \"What main challenges or risks do you foresee to deliver this project successfully?\" WIth a novel proposal of this type the lack of foresight concerning risks and risk mitigation is an omission. If the proposer resubmits this proposal in the next fund, I would advise the team to use the space to expound on the challenges and risks. \n", "q0r": 4, "q1": "Yes, I know. Everyone can write up a million dollar proposal, but can they deliver? Of course, that is the question that was sitting in the back of my mind. Everyone these days can call their group of co-workers \"an experienced team of mathematicians, logicians, cryptographers, network engineers, software developers and DeFi natives\" - but what is behind those words? A boys club from the neighborhood or a real team that can devise and deliver a  ZK(zero-knowledge) rollup layer 2 protocol for Cardano? Well, these are uncharted grounds and no one has yet delivered a fully-functional layer 2 protocol on Cardano, so what we have to do is to assess the proposal on its merit. It seems technically competent and the team has provided links to their Linkedin profiles. The team leader is also the founder of the Ardana (Cardano Stablecoin DeFi Project) project, which is a project currently in development. However, I have questions about the feasibility of the project as the team has seemingly not had enough time to provide two important components - especially for a project that is gunning for a $1 million budget. The proposal lacks a detailed budget breakdown. The team stated \"To be added soon\". In the comments below the proposal, the team leader was alerted to the lack of a budget breakdown and added \"Our cost breakdown will be coming soon and updated here which will breakdown what these funds will be used for.\". THis comment was made on 25 February - but the budget breakdown did not appear. For a proposal of this funding size - it is a big missing piece and the team was aware. Additionally, I am not aware of a clear timeline for the project with stages, deliverables linked to certain dates and risks of problems", "q1r": 2, "q2": "Let me start with the positives, the team clearly does seem to have a clear and understandable description of the problem and the proposed solution [Orbis: Layer 2 ZK Rollup] sounds amazing. However, to ensure that a project can be delivered it needs to continuously receive funding. Funding is contigent on deliverying certain components by certain deadlines. However, I do not see a clear and detailed timetable in the proposal. Hence, the solution may be understandable - but the development of the solution seems hazy, especially as the budget is given as a lump sum with no breakdown. The proposers would do their proposal a favour if they included KPIs for their solution and especially detailed milestones that would allow for the tracking of the proposals progress. As it stands now, a $1,000,000 proposal without a timeline and budget breakdown will be very difficult to audit. ", "q2r": 2, "assessor": "z_assessor_35", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}, {"id": 606, "q0": "Chances are you are well aware of the impact this L2 ZKsnark rollup can have:  Charles has talked about ZK proofs, IOG is busy developing and rolling out Hydra, which is a similar off-chain protocol for scaling TPS, and ever since Orbis was announced, insiders across the Cardano ecosystem have been pretty excited to see this complementary tech come out of nowhere.  The project lead indicates that Orbis will be introducing features beyond what Hydra is expected to introduce, but has not said specifically what those will be.  There is also the potential for horizontal scalability here as well, since Orbis will decentralize just like Hydra is supposed to, and the two protocols can leverage eachother if needed.  Like most decentralized protocols, Orbis will be starting as a centralized node, and the funding from this proposal is not intended to drive the decentralizing of the network, however this is a subject that the Ardana development team has spoken often about (the team behind Orbis).  In their own ISPO they focused on fair and decentralized, and they have said they are committed to Orbis reaching full decentralization in order to improve to the protocol.  One issue is that this proposal effectively takes the entire funding pool for scaling solutions during this fund, so voters would do well to consider whether it outweighs all other considerations in the scaling challenge.", "q0r": 5, "q1": "Across the board the team looks to be some of the best, and the budget definitely reflects that!  For example, they wanted to work in  plutarch, so they pulled the top plutarch contributor from Github over to their team. There is an excellent breakdown of the architecture involved and where the workflows will be applied.  Understanding little about the actual protocol I was still able to bounce back and forth between the repositories and the descriptions of the architecture to piece together how the they add up to a scaling solution.  The team has not indicated that there are any known risks to this rollout...have to admire their confidence.  But a huge issue crops up:  the have no budget breakdown at all.  $1m and no idea how they intend to spend it.", "q1r": 3, "q2": "Their Github is public and already it is showing progress made on several aspects of the project:  TinyRAM LLVM backend, Untyped Plutus Core to C compiler, Pluto language development, and Halo 2 verifier primitive for Plutus.  The milestones listed are not included under any specific timeframe, which is a concern for the project.  The team has indicated that a 2022 MVP is expected, but they have also indicated that it will \"be ready when its ready.\"  As much as I respect that project management cannot be as emergent as it needs to be for dynamic systems like Cardano, the team is still requesting a million dollars from the treasury.  A timeline would have been a good indicator to at least allow voters to weigh the cost of a complete takeover of a funding challenge vs waiting for Hydra and maybe seeing multiple scaling solutions emerge from that funding category...", "q2r": 4, "assessor": "z_assessor_1193", "no_vca": 15, "ne": 4, "ng": 11, "nfo": 0, "vca_o": 1}, {"id": 5750, "q0": "Very good proposal which explores an additional way that the Cardano protocol can scale as an L2 solution. Contrary to what the team thinks however, I do not believe that this solution is without risk. I therefore urge the team to do a more comprehensive risk assessment and how to mitigate for this project. ", "q0r": 3, "q1": "Although this team seem to be very qualified, without a budget, it is quite difficult to assess the feasibility or otherwise of this proposal. In the absence of the team coming together to determine beforehand how to allocate $1M, the feasibility of this project  could suffer the fate of other projects that get significant funding and is unable to allocate properly for project implementation. The number one rule of project financing: have at least a high-level spending plan Before funding comes in because it becomes orders of magnitude harder to do so after. \n", "q1r": 3, "q2": "Metrics and visualization of success provided. This proposal would have done even better if it had also shown what needs to be done for project completion instead of showing only what has already been achieved", "q2r": 4, "assessor": "z_assessor_266", "no_vca": 5, "ne": 0, "ng": 3, "nfo": 2, "vca_o": 1}, {"id": 4263, "q0": "The proposal has provided information of the project to the readers. By reading this, people can know that Orbis is the first ZK (zero-knowledge) rollup layer 2 solution for Cardano, it's built to support decentralized finance (DeFi) applications and a thriving blockchain ecosystem. The team has explained pretty clearly about 2 main components of Orbis which are the Prover and the Verifier, helping people understand more about the solution. The team has proposed Orbis as the best possible scaling solution and explained the reason why. This shows that they have confidence about their product. However, they didn't mention anything related to the key metrics of the challenge so it's pretty hard to tell if their proposed solution would address the challenge or not. Talking about the possible risks or challenges in the future is another thing I wish they had done.", "q0r": 3, "q1": "They have presented a pretty detailed plan or as they wrote in the proposal: Statuses of individual system components. About the team members who will take charge of different tasks to complete the project, we can see that the proposal has covered their names and even attached links to their profiles so that if we want to know more about them and their works, just click on the link and we will find out. This is a plus in this part, showing the reliability of the proposal. However, just as the part of Impact, they didn't show any numbers or targets of novel ideas for the scaling solutions so I doubt if they could address the challenge or not. Also, if they could include a budget breakdown, it would be better, the proposal will look more detailed.", "q1r": 3, "q2": "About how the team will measure the project's progress, I see that they have repeated the plan that they have mentioned before in the part of Feasibility, this makes me feel unsure that if this is just a mistake or they did it on purpose. Even if they did it on their purpose, it's still unclear to see the measuring method like that. At least, they should give the specific time or targets so that readers know what they will make or achieve and when they will move to the next stage. They have talked about what the success looks like to them, this part is good. One more thing I think they should've done is specifying if this is a whole new project or it belongs to a previously funded one.", "q2r": 3, "assessor": "z_assessor_1714", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 2709, "q0": "Cardano's inability to scale to support users will cause compromises in security and decentralization affecting millions of users is an issue that needs to be addressed and is related to this challenge. To find a possible solution, we need to define the problem clearly and relate it coherently to the need of the challenge. A strategy is needed to mitigate the risks associated with communicating outside of the Cardano community and competing with existing applications.", "q0r": 4, "q1": "There should be a budget sheet that explains the team's salary and the timeline for several months, which is tied to the data that measures the success metrics for the required work of the project. The challenge asks for $1,000,000 and your project is also asking for 1.000,000 but here I haven't seen you explain the amounts you need to spend. This proposal has proven to have a strong team we can check their profiles on LinkedIn, GitHub but here I have not seen mentioned individual relevant experiences.", "q1r": 3, "q2": "You must show everyone how you plan to execute this project on a timetable and provide KPIs so that your project can be easily tracked by the community. The author explained the success if Orbis can prove to be a blockchain then the project will be successful.", "q2r": 3, "assessor": "z_assessor_1559", "no_vca": 6, "ne": 0, "ng": 4, "nfo": 2, "vca_o": 1}, {"id": 1297, "q0": "I have added this cut and paste disclosure to some of the more technical proposals so the voters and proposers have a basic understanding of what my assessment is based on. I am assessing the merits of the proposal - not the technology! While I started carding IBM mainframes in the 70's and had some understanding of basic, fortran, linux, c, c++ and am currently in the Prisim Pioneer class and did a stint as an IT tech I am not an engineer, programmer or developer. I have done reading on the tech stuff being proposed where I could find stuff, cause of my geeky curiosity, BUT I am only assessing the proposal. Please DYOR on the tech due to the potential ramifications to the Cardano network if we adopt one of these technologies.\n___________________________________________________\nThis proposal effectively addresses the Challenge, the Campaign brief and several of the topic areas and highlights.\n__________________________________________________\nPREDIGEST: ZK = Zero Knowledge; SNARK = Succinct, Non-Interactive ARgument of Knowledge; zkSnark= Zero Knowledge Snark; Recursive SNARKS = purpose - to allow proof generation to be split into pieces, which can be farmed to different computers to permit limitless linearly scaling; Prover= off chain system with purpose of constructing zkSNARK; Verifyer= on chain smart contract, purpose to settle transactions happening on-rollup on Cardano;( Pluto=programming language - easy to learn; Plutarch= Programing language - Haskell embedded domain specific - both are alts to Plutus Tx - purpose writing on chain scripts); Halo 2 = proving system developed by Electric Coin Co/Zcash; Orbis = built using Halo2 ZK.\n__________________________________________________\nThe Proposal states success is Orbis as a decent layer 2 protocol..... to support global finance and other mass scale apps such as DIDS, Defi, social graphs, NFTs and micropayments. There is more but their vision, as proposed addresses the bulwark of the challenge for blockchain scalability by using Novel; Research; Borrowing; Niche Defi Markets; Novel scaling solutions, etc.\n__________________________________________________\nIn short Orbis is proposed to be a ZK rollup layer 2 to Cardano to support DeFi apps. TXs are bundled off chain (L2) into single zk proof using Plutus smart contracts and submitted to Cardano (L1) for verification. Orbis will use zkSNARKS which do not require two way (State Channel) between Prover & Verifier so it allows off chain proofs. Additionally, Orbis uses Recursive SNARKS for scaling. The Prover is off-chain while the verifier is on chain smart contract. Orbis will enable PlutusTx smart contracts to be ported over. The Orbis system using Halo2 ZK proving system is trustless and supports recursive proofs. The proposal states that this will be a more decentralized system; though in the beginning there will only be one verifier - Orbis Labs.\n\nAdditionally, Orbis will support L3 using Recursive ZK proofs for specific rollups. These specific use cases are stated as Defi, NFTs, supply chains and micropayments.\n_________________________________________________\nThe objectives and key metrics in this proposal and it's vision of success meets the Challenge by addressing: scalability of blockchain activity, novel scaling solutions, niche Defi market, research into alt solutions and it has market specific scalability solutions in at least NFTs and Micropayments.", "q0r": 5, "q1": "The team in the proposal would appear to be qualified with the required skills and experience. The Tech was very well explained and I believe it could be one methodology to solve the issue(s) in the Challenge and Campaign Brief.\n__________________________________________________\nUnfortunately, in my opinion and assessment the proposal is incomplete and without the missing segments, I do not agree (I disagree) that the proposal would be successfully implemented.\n__________________________________________________\nFirst reason, is the budget clarity. This proposal requests the entire amount of this Challenge category of $1,000,000. In the proposals' section for providing a detailed budget breakdown the response is- \"To be added soon\".   My advice to the Proposal team, for this to be considered by the voters and other assessors as a valid proposal, is to provide a very detailed budget for the project (and perhaps  justification of why this proposal should be awarded the entire Challenge budget).\nSecond, is in the Risk Management section. This is a large proposal with many different pieces to it with several different solutions across L1, L2, & L3. To the question of : What main challenges or risks do you foresee to deliver this project successfully?, The proposals response is : \"N/A\".  My advice for this project to make voters comfortable is to provide a very detailed SWOT analysis and a comprehensive Risk Management Assessment to the Cardano network as well as to budget. Third, is the question of a 'Realistic Timetable'. There are what appear to be stages or milestones of different segments for this project, yet there are no timeframes or accountability metrics provided. My suggestion, especially for the size and technical aspect of this proposal is to provide a comprehensive Roadmap with dates (by quarter or month or year) as your plan schedules out, towards completion and success. ", "q1r": 2, "q2": "The Proposal has a number of milestones for it's development which is why I rated it as four stars. The proposal highlights a number of the key segments for the development process. However, due to the size of the budget request, the ambitious solutions I suggest the  milestones have a more quantifiable nature for voter consideration. One specific example is in the section of the proposal about the initial Prover that states: \"Initially, Orbis will launch with a single prover operated by Orbis Labs. Orbis will transition into a fully decentralized, distributed stack whereby network participants will exist in an open, permissionless network\". \nMy advice would be to have a metric of when this would be completed. I think the voters may be more comfortable knowing when the project will be at full decentralization. Though, the tech is not in my scope of review I would suggest you might look at a potential colab with Atala Prisim.\n__________________________________________________\nOne section that many advisors and voters look for are KPIs. Though this has evolved over Catalyst iterations and does not seem to be a requirement some voters appreciate these. Again, due to the size of the budget request and the complexity of the Proposal I would suggest that a developed KPI metric system be included in the proposal. ", "q2r": 4, "assessor": "z_assessor_1339", "no_vca": 9, "ne": 4, "ng": 5, "nfo": 0, "vca_o": 1}, {"id": 1106, "q0": "A layer3 zK Rollup solution will definintely have a major impact on Cardano and improve system throughput by managing transactions off the L1 and handling transaction calculations via zK proof off-chain speed and making things cheaper and easier to use for all users of the rollup.", "q0r": 5, "q1": "The team has a lot of experience in the crypto, Cardano, and academic space.  They plan a huge undertaking requesting all the funding that is available for this challenge.  For this reason there is some doubt about the actual feasibility of the solution being done by the team if a full Catalyst challenge fund amount is required.", "q1r": 4, "q2": "There is a list of milestones/deliverables that will be delivered, but no major KPIs/metrics that will show progress beyond that.  The project is auditable under those circumstances, but more transparency into the development process would be helpful to understand how the solution is progressing.", "q2r": 4, "assessor": "z_assessor_13", "no_vca": 13, "ne": 0, "ng": 7, "nfo": 6, "vca_o": 1}, {"id": 10528, "q0": "It's not possible to overstate the impact of this proposal. zkSNARKS are the most powerful scaling solution on any chain, and would put Cardano as the leader on this respect, being the first smart contract platform with this technology (zcash does not have smart contracts, and had a trusted setup ceremony, while \"halo 2\", this project's zkSNARK implementation, is trustless). ", "q0r": 5, "q1": "This project is breaking new ground, so there's always a risk of an unforeseen difficulty. However, the team seem to have a clear idea of the challenge ahead, and to be ready to tackle it. However, I'd say they are still missing some more experienced team members, and I don't see the cryptography expertise I'd expect. That's why I'm deducting one star.", "q1r": 4, "q2": "There are quite a few milestones and deliverables to keep track of the progress. The team is already pushing code to their GitHub repository, something that is quite uncommon in Catalyst projects, regrettably.", "q2r": 5, "assessor": "z_assessor_941", "no_vca": 5, "ne": 0, "ng": 4, "nfo": 1, "vca_o": 1}], "solution": "Orbis is a ZK(zero-knowledge) rollup layer 2 protocol for Cardano. Moving computation off-chain scales Cardano's throughput significantly.", "experience": "An experienced team of mathematicians, logicians, cryptographers, network engineers, software developers and DeFi natives."}