{"id": 398933, "author": "konmaorg", "title": "KONMA Chain : L2 ZK Roll up for ADA", "url": "https://cardano.ideascale.com/a/dtd/398933-48088", "category": 26437, "amount": 800000, "description": "Konma's web3 products and other projects being deployed on the Cardano chain will inevitably crowd the network and compromise scalability.", "f6_no_assessments": 4, "f6_rating": 1.6666666666666667, "videos": ["https://www.youtube.com/watch?v=1n9ftsoCLas&start=12774"], "media": [{"title": "Konma Chain Ideafest Video", "url": "https://www.canva.com/design/DAE8tsAK-Wc/yugjvW3iu1j1buEG1CEOcg/view?utm_content=DAE8tsAK-Wc&utm_campaign=designshare&utm_medium=link&utm_source=recording_view"}, {"title": "Konma Chain Lite Paper", "url": "https://docs.google.com/document/d/1FA3wp1f03TpWWdX8OqgZ8HAl8BnFv57m5Y_oUGWolmo/edit?usp=sharing"}], "f6_assessments": [{"id": 8655, "q0": "Side chain or parallel chain are the Layer 2 solutions that Cardano needed in the early Basho era. The structure of each mainchain (L1) is always built according to the original purposes, for example Cardano is the foundation for large value financial transactions and needs security, Solana is for small value transactions and needs high speed. However, due to the need to settle all kinds of transactions, it is not possible to do it all on the mainchain, so sidechains are built to solve different purposes. I will shorten the name of the solution as Konma chain. Konma chain will be designed based on ZK roll up technology (validity proof) that will solve the problem of transaction speed, cheap transaction costs while still ensuring the safety of your assets. users will be locked in the on-chain smart contract. This will be a very necessary side chain to serve Defi projects on Cardano, Konma chain will help projects that are having problems with the throughput, concurrency... of the Cardano mainnet. The overall solution of the proposal is very good, but detailed technical solutions are needed because the design of the validity proof is very complex and risky. The proposer should provide a research direction and a way to design a side chain based on ZK-proof. Eg:\n1. How to solve the \"data availability issues\" . Where will the main data be stored, how will the encrypted data transferred to the main chain be,\n2. Solution to create trusted program between prover and verifier. Example: trusted setup commitment type (Groth 16,Plonk, Redshift or Snork)\n3. Basic workflow of Roll up process in Konma chain and synchronized ledger state between Cardano mainchain and Konma chain.\nI think a proposal to create a ZK roll up side chain is great, but a clearer technical solution is needed to assess the impact of the proposal on reality.", "q0r": 3, "q1": "The proposer gives a detailed plan that includes 5 stages of Design, Development, Audit, Deployment and post-deployment. This detailed plan of propôsal has not outlined specific timelines. For example, how many months or weeks each phase will last. This is a proposal that requires very high technical work, so for the proposal to be feasible, each stage also need to list in detail specific jobs with specific timelines. If indeed the proposer has an idea for developing a ZK roll up side chain, there must also be detailed technical implementation steps of this solution. Because this solution is not easy to implement, especially now that the side chains applying ZK roll up are mostly side-chains designed to compatible with blockchains based on EVM, accounting ledgers. Perhaps at the concept stage, it is very difficult to come up with a detailed plan, but with a few suggestions of my technical solutions, the proposer can make a basic part of the research  and implementation detailed plan\nThe required budget of 800000 is really a small number compared to the potential of the project if the research is successful. Example: In 2021 Polygon blockchain merged these 2 ZK roll up projects into its development department (Hermez network 200mil $ and Mir protocol 400 mil $ https://blog.polygon.technology/polygon- takes-a-major-lead-in-zk-rollups-welcomes-mir-a-groundbreaking-zk-startup-in-a-400m-deal/ ). The amount required criteria set by the challenge that is also not limited to the amount if the proposal can provide a detailed plan. However, both the detailed plan and the funding breadown for the proposal are still sketchy and have not yet detailed each research work. If someone has ever researched the side chain projects using Validity proof, they will find that there is a lot of difficult technical work to do in addition to the work as the proposer listed in proposal's plan. Taking a closer look at the funding breakdown, I give an example of the irrationality:\nDevelopers - 12 months - $600,000 : This section is not clear how many developers are and the roadmap does not specify how many months the developer's work is done.\nThe project implementation team is experienced scientists and programmers from Chennai Mathematical Institute. Maybe proposal's team ability and experience are enough to implement the above proposal if there is a better preparation of technical solutions to build a side chain using ZK roll up (validity proof) technology.", "q1r": 2, "q2": "The proposer has outlined a method to measure and track project progress that is be in close talks and meetings with IOG, EMURGO so that the two sides can discuss about the progress of the project together. During project implementation, the proposer provides source codes for testing. Actually, this is not the way to track the progress of the project. I suggest a way to check the progress of the project to make it easier to measure and track the proposal progress.\n1. Make a detailed plan with a specific timeline.\n2. The detailed works are listed and corresponded to the milestones in monthly units (Because this is a highly technical project proposal, many works will take months to complete).\n3. Prepare monthly technical reports or in case the proposer can contact and get help from IOG, EMURGO or from developers in the community, proposer can save the meetings between the parties as a way to provide evidence to track the progress of the proposal.\nTo evaluate how successful the project will be. A ZK roll up side chain is a necessity for Cardano right now, the presence of a side chain like Konma will have a huge impact and help Cardano's scaling solutions. However, to accurately assess the level of success, I still wonder because the proposal does not provide basic technical solutions for the development of a side chain zk roll up.", "q2r": 3, "assessor": "z_assessor_683", "no_vca": 7, "ne": 6, "ng": 1, "nfo": 0, "vca_o": 2}, {"id": 188, "q0": "The proposal is to build a layer 2 solution for Cardano called Konma Chain. which is in alignment with the challenge category. The proposed solution is described as required since Konma plans to provide blockchain as a service in 15 different sectors and that they are confident that they themselve will use up most of the resources on Cardano. At the same time this has been presented without any data points or details of the said blockchain as a service. The details of the proposal convey that it will use ZK rollups for a layer 2 solution which by definition is relevant for most  blockchains . However, lack of details on how their solution will be implemented makes it difficult to assess that it will add value to the Cardano ecosystem or that the solution itself is scalable to address future challenges.", "q0r": 2, "q1": "The technical team from Konma Labz and Professors are indicated as the team to work on this solution. It says the team “will sit together to vet out and design the entire process using research from peer-reviewed papers from IOG and EMURGO.” I would have liked to see more concrete design or implementation details besides this.\n\nThe proposal indicates that the development will include a scanner, a block explorer, wallet integration to shelly era wallets, a testnet , the mainnet, node specifications. While these are components of the blockchain I think the voters need to be provided more details in terms of how the solution will work and how it will be developed. \n\n\nFeasibility is a further concern as the following aspects are scanty in the proposal. Budget breakdown, especially since the amounts asked are quite large , resources necessary to implement the proposal are not detailed, technologies and architectural aspects and a clear plan for implementation are missing.", "q1r": 1, "q2": "I rate this proposal low on auditability given that it has not provided a roadmap or milestones, timelines for development or KPIs. Overall I would rate this proposal as lacking clarity of the plan, design and implementation. Such details could have helped to improve the auditability of the proposal which in its present form is poor.", "q2r": 1, "assessor": "z_assessor_1080", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 5693, "q0": "While ZK Rollups and other L2 solutions are in the scope of the challenge, the proposer fails to describe in enough detail how the solution works to gauge its potential impact. Instead, the language used in the proposal suggests that the Cardano community is not the primary beneficiary. Auditing and deployment is also seemingly left to the community. The language is too vague to actually envision a functioning and usable solution to handle hundreds of millions of users as outlined in the challenge setting.\n\n1 star or duplicate proposal - see https://cardano.ideascale.com/c/idea/404518", "q0r": 1, "q1": "1 star or duplicate proposal - see https://cardano.ideascale.com/c/idea/404518\n\nAdding more easily verifiable information would have been appreciated. It is unclear from the proposal itself that the team would be capable of delivering. Because the proposal sets expectations that further funding will be needed but at the same time asks for funds to do six months of promotions, it is unclear what the deliverable actually is and therefore difficult to assess whether this team can deliver a sufficient implementation of whatever it is they are proposing.", "q1r": 1, "q2": "No KPIs, milestones, general roadmap, timeline, or other metrics are provided. Furthermore, Fund7 had many adjacent proposals, so I would argue that this is a false claim. The only part that's clear is that a ZK rollup L2 solution would help Cardano to scale, but due to the glaring deficiencies in conveying auditability, the minimum score for this category is given.", "q2r": 1, "assessor": "z_assessor_22", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 8295, "q0": "The proposal requests $800,000 over 1 million in this “Cardano scaling solutions” challenge or 80% of the entire approved budget. Now, this challenge currently has 16 proposals in the assessment phase, with an average of $235,000 fund requests over 16 proposals.\nhttps://t.me/ProjectCatalystChat/65171. \n\nThe proposal is listed as new, is layer 2 and is based on Cardano layer one blockchain. The proposal will be built by, extracted from proposal “veteran Haskell professors and developers, mathematicians, blockchain enthusiasts and web3 developers”.\n\nFrom the proposal “Konma plans to provide blockchain as a service in 15 different sectors”, I believe this would be the primary skeleton element for requesting 80% of entirely challenge allocated fund. With this proposal scale, the initial information should provide for the community or the assessor to investigate these main sectors. Your team, such as professors, developers, mathematicians and blockchain enthusiasts, should at least give us one or two hints about these 15 different sectors to be served and why they are essential for scaling and growing of Cardano ecosystem.\n\nI’m curious why it can’t be 5 or 500 sectors but had to be 15 sectors to be served?\n\nAssumable these 15 different sectors listed is the proposal’s commercial secret, but at least need to provide at least one, so we (and IOG, EMURGO and Cardano foundation) know whether it’s likely to have any impact with $800,000 requested over $1,000,000 proposal over 12 months delivery. For the above reasons, I rate the impact of this proposal to two out of five.\n", "q0r": 2, "q1": "In the feasibility, the proposal has provided a design that tends to use the research from peer-reviewed from IOG, EMURGO papers and not others. Should explain why so we can understand and which paper?\n\nI hope those papers are possible, not like Ray Network, MELD, Min swap, SundaeSwap etc., are Layer 2 and running on Cardano blockchain.\n\nIn addition to the feasibility information, possibly the proposers need to find out to function as well as to the capacity of IOG, EMURGO and how much they can involve in your proposal. Therefore, I do not believe these two entities will involve directly in the audit as you’re hoping.\n\nThus, I believe the proposal needs to provide further concrete information so we can see it is possible to even get funded and with current information is not sufficient.  For that, I rate two out of five for the feasibility.\n", "q1r": 2, "q2": "There is not much detail of how the challenge team or community will audit the project lasting over 12 months or at least the first few months. Apart from what was mentioned, they will talk to IOG, EMURGO and Cardano foundation. What about us? We are Cardano users, this proposal assessor, supporter, voter, and we’re not part of your design and only IOG, EMURGO and Cardano foundation? What about your 15 sectors to be served? Should express further and be easier to follow.\n\nIf the proposal, fortunately, gains enough votes and get funded with 12 months of development phases and assumable the IOG will release the first month around US$66,666 + initial payment saw the first sum not less than US$100,000 with the amount there is not much information that the challenge team or Project Catalyst would see the report from the first month apart from engaging and talking. \n\nI rate one out of five for this project for those reasons since it is not ready for implementation. I enclose the proposal guide if your team needs to work on it further for future funds.\nhttps://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit?disco=AAAAG42-Ypk&usp_dm=true\n", "q2r": 1, "assessor": "z_assessor_661", "no_vca": 6, "ne": 1, "ng": 5, "nfo": 0, "vca_o": 1}], "solution": "Konma proposes a layer 2 solution that will act as a support layer to Cardano and other projects, it will also host Konmas web3 projects.", "experience": "Konma Labz consists of veteran Haskell professors and developers, mathematicians, blockchain enthusiasts and web3 developers to take this forward.\nWe are in good understanding with mathematical institutes around India for their guidance and support in research and development."}