{"id": 400079, "author": "mpn", "title": "Perun Channels for Cardano", "url": "https://cardano.ideascale.com/a/dtd/400079-48088", "category": 26437, "amount": 300000, "description": "Cardano does not have a deployed state channel framework, yet. The Hydra protocol is still WIP.", "f6_no_assessments": 12, "f6_rating": 4.166666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge asks for proposals that will help Cardano scale, to secure Cardano main chain is not overloaded as new protocols in DeFi, NFTs and gaming are being released. \n\nChallege encourages proposals within the following scalability topic areas:\n- Rollups (e.g. zero knowledge rollups, optimistic rollups)\n- Sharding\n- Sidechains\n- State channels\n\nThe proposal description promises to deliver an alternative state channel and if it is developed it will be of great help to Cardano's main chain as it will involve off-chain transactions.\nI strongly agree that this proposal effectively addresses the challenge and rate Impact to 5", "q0r": 5, "q1": "The proposal description provides good references to relevant background from other blockchains and previous implementations. The proposal could with advantage have included a resource with previous deep knowledge of Cardano, which will lower the need for training the team in new technology.\n\nThe budget for the project is a bit high when taking the number of resources into account, but the project has a safety buffer in case training takes longer than usual, or other difficulties arise. The team has knowledge of account based, but are beginners when it comes to the eUTXO model, and so estimates time and budget with an extra buffer.\n\nThe timetable looks realistic. The team seems to have good practice from similar projects in the past on other blockchains, so it gives confidence that the schedule will hold to a successful delivery. A bit uncertain if project has estimated enough time to account for the new transaction model.\n\nI agree that it is highly likely that this proposal will be implemented successfully, and rate the Feasibility to 4", "q1r": 4, "q2": "The proposal contains a clear roadmap and description of expected delivery. The project will provide full insight into how the development is going on in a public repository.\nThe proposal is a clear description of a solution that will be positive for Cardano and which is completely in line with the challenge description\n\nI strongly agree that this proposal provides me with sufficient information to assess the progress in attaining its stated goals and rate Auditability to 5", "q2r": 5, "assessor": "z_assessor_1075", "no_vca": 16, "ne": 4, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The proposal is aligned with the challenge as it intends to build a state channel for Cardano.\nState channels enable low latency transactions. The proposal also calls out that it will potentially enable cross-chain transactions in the future.\n", "q0r": 4, "q1": "The proposer has provided references to show relevant skills and experience. \nThe proposer has indicated the type and number of team members required to implement the proposal. Requisites and challenges have been listed down.\n\nThe budget is presented without a breakdown as an average rate of 30K /month for a team of 4 people, which to me is a downside.", "q1r": 4, "q2": "The proposal says that progress can be tracked in its public repository. Work-in-progress code will be visible in the commits of merge requests. The proposal indicates good understanding about the problem and solution. At the same time lack of break up of deliverables and milestones can hamper auditability.", "q2r": 4, "assessor": "z_assessor_1080", "no_vca": 12, "ne": 0, "ng": 10, "nfo": 2, "vca_o": 1}, {"q0": "State channels are definitely useful for Cardano app development.\n\nAs a community advisor I would also appreciate exposing this technology to wider CA audience.", "q0r": 5, "q1": "The proposal team seems quite brilliant.\nHowever, the details are thin, and budget is not broken down into manageable pieces.\n\nWhat is the plan to test this implementation?\nHow would it be used?\nDoes the team plan making tutorials?\nWould integration with Plutus core libraries be desired?\n\nIt would be most useful to see breakdown of the costs, and breakdown of the efforts for the involved project members.", "q1r": 5, "q2": "The source code repository, and clear vision of Perun implementation should make it easy to audit that the project is interoperable with the other implementations.\n\nHowever, it would be nice to see actual reports in terms of functionality derived, and demo applications shown.", "q2r": 4, "assessor": "z_assessor_1168", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The Perun team brings a lot of experience to this proposal that will look at building state channels in the Cardano ecosystem.  This will help to create p2p interactions and massively scale things on the proposed state channel which would be very impactful for users of the channel.", "q0r": 5, "q1": "The team and the concept has a proven track record for delivering on other blockchains a state channel solution.  The only major challenge with this proposal is doing this in an eUTXO model compared to previously executed account-based models. Although solutions for account-based models to eUTXO have been worked through, this is still a challenge to ensure a working product can be developed and built with the resources requested.", "q1r": 4, "q2": "The only major lacking in this proposal is details on how the project will be executed and milestones they will be planning to report out on.  They are planning on making their work/findings public through public repositories, but no details as to how and what the structure of the information that will be made available are given.", "q2r": 3, "assessor": "z_assessor_13", "no_vca": 13, "ne": 0, "ng": 8, "nfo": 5, "vca_o": 1}, {"q0": "I have added this cut and paste disclosure to some of the more technical proposals so the voters and proposers have a basic understanding of where my assessment is based. I am assessing the merits of the proposal - not the technology! While I started carding IBM mainframes in the 70's and had some understanding of basic, fortran, linux, c, c++ and am currently in the Prisim Pioneer class and did a stint as an IT tech I am not an engineer, programmer or developer. I have done reading on the tech stuff being proposed where I could find stuff, cause of my geeky curiosity, BUT I am only assessing the proposal. Please DYOR on the tech due to the potential ramifications to the Cardano network if we adopt one of these technologies.\n__________________________________________________\nPre-digest: State Channel - a) general form of payment channel; b) process of Tx's with one another, off chain; c) channels off chain and private.  PERUN.network = off chain framework that supports real-time payments, claiming unlimited scalability and provable security.  ERDSTALL.dev = L2 blockchain allows massive scaling on Ethereum. GO = aka Golang is an open source programing language designed by Google.  GO CLIENT = graphical interface to GO servers and Go programs.\n_________________________________________________\nThis proposal is extremely well written and in my opinion meets the Challenge objectives. The objectives it meets include: Hydra add ons; State Channels; Borrowing from other blockchains; Novel scaling solutions and Research.\n_________________________________________________\nPerun has already implemented channels for Ethereum, Cosmos and Polkadot. It proposes to implement Perun Channels for Cardano which would enable P2P TX's with unlimited scalability and cross chain potential. This will require research in part due to:  Perun account based protocol translation to eUTXO; Perun library is written in Go however, a Go Client is not available on Cardano; potential need to build an adaptor between Go and Cardano; availability into libraries to verify signatures in Cardano smart contracts and information encoding in off chain client and then how to encode it in smart contract logic. These are all areas of topic and objectives in the Challenge.\n___________________________________________________\nSuccess and key metrics according to the proposal is to demonstrate (at a minimum) the feasibility of Perun channels on Cardano. This would open space for APPS that need scalable and low fees e.g. games and micropayments. In a balance of transparency to efficiency the team proposes to push progress to a public repository.", "q0r": 5, "q1": "The proposal team has depth, experience, training and education and previous successes with Perun channels implemented for Ethereum, Cosmos and Polkadot. The team appears to be headed up by Professor Doctor Sebastian Faust founder of Polycrypt and co-inventor of Perun protocols.\n__________________________________________________\nThe Budget needs more clarity. It requests a budget of \"roughly $30K USD/month\", with no breakdown. My other concern is they have had apparently discussions with Hydra team about using some components of Hydra, but were \"made aware that we might have underestimated the required effort and therefore adjusted our timeline and budget accordingly\". My assessment is this was a good catch - prior to funding and project genesis. My advice would be for the team to do a more comprehensive budget with salary and time breakdowns. Many voters appreciate the analytics that accompany a Projects proposal budget.\n__________________________________________________\nThe implementation plan and risk management is an area of concern. The proposal acknowledges a \"Steep learning curve\". This is based on the technology challenges of Account based model to eUTEXO. Also the need for Go Client adaptor. The biggest challenge to the successful implementation  seems to be the availability of external libraries for smart contract logic. In what I understand as full transparency the proposal states (re: libraries for Cardano smart contract signature verification) \"if none of it is readily available, this may in fact put the whole project at risk\". \n__________________________________________________ \nThe timeline is in my assessment a good timeline. According to the proposal team it and the budget was adjusted after receiving advice. The current timeline estimate is for 9 months and is broken into 3  - three month segments of what should be accomplished.\n____________________________________________________\nThe proposal does include a Disclaimer about a dual proposal they have submitted for Erdstall, a different scaling solution. They indicate they would prioritize one project over the other depending on Community Interest. I appreciate the teams Transparency. ", "q1r": 4, "q2": "I rated this section as 5 - Strongly Agree, even though the proposal does not provide the traditional KPIs some Advisors and Voters expect. The team has demonstrated a principled level of Transparency in their proposal and has demonstrated success on at least three other chains. \n___________________________________________________\nIn the Proposal they have included: a) Roadmap ; b) Plan with Timeline; and, c) a pledge to push their progress to a public repository, track major features and issues ( keeping a balance between efficiency and transparency); and, that WIP code will be visible in the commits of merge requests.\n___________________________________________________\nTherefore based on the above rationale I assess that this proposal and ensuing project will be assessable ", "q2r": 5, "assessor": "z_assessor_1339", "no_vca": 10, "ne": 2, "ng": 8, "nfo": 0, "vca_o": 1}, {"q0": "Proposal wants to implement Perun channel for Cardano. Cross-trading helps Cardano increase scalability. Proposal is an easy-to-understand description and has a detailed solution to the challenge. Besides, the team also needed to remind some risks and have solutions for those risks when the project is implemented. However, from the proposal's schedule sheet, I am not confident that the proposal will succeed at all.", "q0r": 4, "q1": "The team has shown that it has the technical expertise and years of experience needed to execute the proposal. The roadmap is briefly analyzed against what will be done, lacking information in the milestones. It will be difficult to successfully execute a project on schedule when the roadmap does not have a detailed timetable. The budget is divided at $30,000/month and is estimated for 9 months. There is an irrationality in your budget, when the total budget in your proposal is $300,000. Can you elaborate more on how many members work in a month and how long and how much funding is allocated to them?", "q1r": 2, "q2": "I don't understand how the proposal will evolve over time. It would be great if you suggested having a few more KPIs and budgets broken down over time. Investors, the community will be able to easily test and measure the development and success of the proposal. Increase project transparency. That will be a tough turning point for your new project.", "q2r": 2, "assessor": "z_assessor_1409", "no_vca": 10, "ne": 0, "ng": 6, "nfo": 4, "vca_o": 1}, {"q0": "I strongly agree with this proposal. The development of the Perun channel for Carnado is necessary. Perun's influence will grow. Because now what people need when transacting money is a fast, safe, no-fee and high-security transfer mechanism. Especially when trading cryptocurrencies, fast transaction speed is absolutely essential. And Perun meets that. Besides, Perun also eliminates the third party when transacting, so it will save time and cost for the parties. I really appreciate this project. Because it allows P2P transactions with unlimited scalability and cross-chain potential. ", "q0r": 5, "q1": "I found that the team had an overview plan but needed more specifics about the short time and expected amounts to complete each specific work package. About the detailed information about the members to complete the project is divided very detailed and specific. This will help the work progress faster and achieve high efficiency. The selection of experienced members to hold key positions will increase the probability of success. The project promises to be implemented well in the future thanks to the members with long experience.", "q1r": 5, "q2": "The goals listed are pretty clear. But not really specific details. I think it is necessary to indicate the minimum KPI to be able to take the next steps in the plan. The project offers openness and transparency of its development progress and has a mechanism to track key features in issues to maintain efficiency and transparency. I very much agree with this. Because when there is such a public mechanism, it will help people easily track and capture information. And this helps to increase people's trust when using Perun Channels.", "q2r": 4, "assessor": "z_assessor_1844", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"q0": "This proposal solves the challenge relatively effectively. The authors implement Perun Channels for Cardano and thus enable P2P (peer - to - peer) transactions at unlimited scalability and with cross-chain potential. This provides a lasting foundation for Cardano's growth. This also contributes to forming one of the effective solutions for the “Cardano scaling solutions” challenge. In this proposal, we see the presence of Perun protocol - an instance of a state channel protocol that results from a series of renowned research papers (EUROCRYPT, CCS, S&P).\nI will talk about some impacts of the proposal to Cardano as below:\nFeatures of Cardano: Cardano helps solve the three big problems of Blockchain, including:\n• Scalability (scalability).\n• Interoperability (interoperability).\n• Sustainability (sustainability).\nCardano's scalability consists of three elements:\n• Transaction Per Second (TPS): Cardano uses Ouroboros consensus algorithm, belongs to the Proof of Stake group.\n• Network: To increase the bandwidth of the network, Cardano uses RINA (Recursive Inter-Network Architecture) technology to divide the network into many subnetworks, and these subnetworks can interact with each other if needed.\n• Data Scaling: To reduce the data size of each transaction, Cardano is paying attention to two solutions: Subscriptions and Sidechains.\nProposing the statement “If the project is successful, there will be a state-channel-based scaling solution available for Cardano. State channels are particularly viable for use cases that require low latency transactions as, for example, in gaming or micropayment solutions. Moreover, Perun channels will potentially enable cross-chain transactions in the future.”\nThis has positive effects on Cardano's building and scaling in the long term. Therefore, the proposed solution is effective and solves this challenge.\n", "q0r": 5, "q1": "The authors have already implemented Perun channels for Ethereum, Cosmos, and Polkadot. They have experiences in implementing critical solutions. \nThe proposal outlines some challenges faced when implementing the “Cardano scaling solution” project, including:\n- Steep learning curve and technological challenges on the way to bring Perun channels to Cardano.\n- Availability of Go client, however, such a client does not seem to be available for Cardano so far.\n- In principle, they know that smart contracts on Cardano are powerful enough to provide the required functionality. However, if none of it is readily available, this may in fact put the whole project at risk.\nWe see a total proposal implementation time of 9 months, a budget of $30,000/month, who can participate in the implementation of this proposal, and an overview of the steps to implement the proposal. From there, it can be evaluated that the proposal will be implemented successfully. However, the effectiveness of the proposal should still be added in more detail to make the proposal more complete.", "q1r": 4, "q2": "Information is provided in an overview, not specific and detailed for different categories. Therefore, in the process of finalization and cooperation between Cardano and the author of the proposal, it is necessary to clarify to create transparency in the cooperation process between the two parties. Implementing the above suggestion will help Cardano to open up the space for applications that require scalable and low-fee peer-to-peer transactions. This brings the success of the project as well as the sustainable development of Cardano.", "q2r": 4, "assessor": "z_assessor_1863", "no_vca": 9, "ne": 1, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "Cardano does not have a deployed state channel framework, yet. The Hydra protocol is still WIP. We implement Perun Channels for Cardano and thus enable P2P transactions at unlimited scalability and with cross-chain potential. Built-in protocols are better when. . Build execution solution (Perun Protocol / Custom transaction logic / Cross-chain transactions / Implementation) and synergies with Hydra team. The proponent mentioned 3 challenges with solutions (Challenge 1: Steep learning curve / Challenge 2: Availability of Go client / Challenge 3: Availability of external libraries).", "q0r": 5, "q1": "The roadmap for implementation is 9 months (Familiarize with Cardano smart contract framework and create a detailed concept for porting the Perun protocol to Cardano and integrating it within the Perun Framework. (3 months). Total suggested budget, but no details on how to be used for what to build, nor provided unit price. 5 personnel are provided with information and identified.", "q1r": 4, "q2": "The success of this project was being able to demonstrate the feasibility of Perun channels on Cardano, thus opening up the space for applications that require low-fee peer-to-peer transactions, such as games. or micropayment solution. The success of this project was being able to demonstrate the feasibility of Perun channels on Cardano, thus opening up the space for applications that require low-fee peer-to-peer transactions, such as games. or micropayment solution. This is a new project.", "q2r": 3, "assessor": "z_assessor_610", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "Creating a common channel for Cardano is a problem that needs to be solved and it is directly related to this challenge. Deploying the Perun channel for Cardano that allows P2P transactions is a necessity. It effectively solves the challenge if this project is funded it can provide a good impact on the community and help Cardano grow more. Deploying the Perun channel for Cardano that allows P2P transactions is a necessity. It effectively solves the challenge if this project is funded it can provide a good impact on the community and help Cardano grow more.", "q0r": 4, "q1": "The estimated roadmap is that in 9 months, the author lists each small milestone as 3 months, and in every 3 months, there are clear and detailed things to do. \"The estimated budget here is $30,000, but I find the author's list is not very clear about how much to spend on parts.\n( For example:\n. Project management needs $ 15,000 in detail: planning, organizing, arranging, bridging.... how much will it cost to list the things that need to be spent at each stage of the manager.\n. The researcher will need $15,000 in details: identifying the topic, research area, conducting research, testing, performing analysis, research results... how much will it cost.)\" The group of 5 members is listed in detail what they are currently doing and their achievements are also clearly stated, but here I think the group should still include more information about social networking sites and channels. like LinkedIn, FB, telegram... the followers will understand more deeply about the team and trust the team more I know that the team is still developing well according to the roadmap however, we need more specific information about each person.", "q1r": 4, "q2": "It's a great idea to push my progress publicly to the archive so that everyone can track the author's progress. This proposal has a very distinct KPI I agree with what they recommend, which makes tracking the proposal after successful funding pretty easy. With their team's roadmap proven possible via the Perun channel on Cardano and they also integrated development components directly in the Perun Framework I see great potential in their future. This will provide us with complete documentation and a complete focus on audibility, we will know exactly what the results are from the project. I believe that if this project is funded, they will soon succeed. This project is brand new and unfunded.", "q2r": 4, "assessor": "z_assessor_649", "no_vca": 8, "ne": 0, "ng": 5, "nfo": 3, "vca_o": 1}, {"q0": "State channels or state channel solutions are what Cardano is in dire need of right now. Due to the complexity of handling the state of the Eutxo ledger, creating a perfect state channel for Cardano will take a long time. It can be seen as Hydra, in order to create a state channel that is not only fast, but also has to be synchronized with the entire Eutxo ledger state from all hydra heads, Hydra must be designed as an isomorphic state channel, not an common state channel like state channel that running on blockchains using the Accounting ledger model. Therefore, more solutions are needed to create new state channels running on Cardano before a perfect Hydra is launched on the mainnet. Perun channel has been developed based on the design of state channels running on blockchains using the Accounting ledger model. In the solution described by the proponent, Perun researched and deployed on Cardano will be a cross-chain state channel. This is a very cool idea although difficult to implement like the synchronization of account states of the Accounting and Eutxo ledgers, the difference between Full turing programming language (Solidity) and Non-Turing programming language (Plutus). But that's the plan for the future, and for now building a basic state channel is a pretty cool solution. And it also suitable for the challenges set by the \"scaling solution\" challenge.", "q0r": 5, "q1": "The proposer provides a roadmap with a 9-month implementation and timelines for each 3 months to implement 3 major work items. Indeed, with the qualifications and experience of the proposal's team, perhaps they can provide a roadmap with more detailed timelines. With the difficulties that the proposal will face if Perun is implemented on Cardano like the Plutus smart contract, the different between Eutxo and Accounting  ledger model. It is more feasible for the project if the timelines are divided into month units. I can't suggest such a detailed roadmap because I'm a non-tech CA, but from the perspective of a regular user (voter), a road map of a proposal is very technical. This should be a detailed roadmap in weekly or monthly timelines. Thus, those who are less knowledgeable about technology like me will partly accurately assess the feasibility of the project.\nThe proposal's fund requirement is $300,000 and the purpose of payment is the monthly salary of the proposal's team for a specific amount of $30,000/month. With a potential project like Perun, I think this number is reasonable. However, like the roadmap, I suggest that the proponent should allocate funds according to work items.\nAbout the proposal's team, although the proposer only provided information about the proposal's team without providing sources for verification such as website, linkedin. But I also did a google search and was able to find the website and team information of the proposal. The public and verifiable information is completely consistent with the information provided by the proposer. The proposal's team is a very experienced team in \"state channel\" projects. The content I read in the Perun whitepaper also shows that the proposer knows what to do. However, to make the project more feasible, I think the proposer should have a partnership with teams specializing in scaling solutions that are knowledgeable about Cardano very deeply. In my experience, DcSpark is one of the best team in this field.\nPeruvian website: https://perun.network/\nCore-team profile: https://de.linkedin.com/company/polycrypt\nPolycrypt Website: https://polycry.pt/", "q1r": 4, "q2": "The proposer provides a github source to test the programming and build of Perun. I can understand that will track commits that will be pushed to this github source. However, there is still the issue to track the commits pulling activities according to the timeline. Reporting of funded proposals to Catalyst is monthly. So, In order for the tracking process to be really effective and help both Catalyst and the proposer, every detailed plan in the roadmap should be presented in a monthly or weekly timeline. This is also the reason why I suggest the proposer provide a more detailed roadmap. I hoped that the proposer can do this in the case the proposal will be funded.\nHow successful was the project? Although the proposer has not described it thoroughly, in my opinion if the Perun state channel in the basic version is completed according to the proponent's commitment, this will be a great success. In the context of metaverse and Nft projects exploding on the Cardano ecosystem, the presence of a state channel will greatly increase the expansion of Cardano.", "q2r": 4, "assessor": "z_assessor_683", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "This is a potential project, it implements Perun Channels for Cardano and thus enables P2P transactions at unlimited scalability and with cross-chain potential. If the project is successful, there will be a state-channel-based scaling solution available for Cardano. State channels are particularly viable for use cases that require low latency transactions as, for example, in gaming or micropayment solutions.", "q0r": 5, "q1": "You have provided information about your team, your team has enough experience and skills to carry out the project. However, it would be great to have more links to their profiles (linkedin, telegram,...). That makes it easy for people to trust the information about the team that you have provided.\nThe roadmap (9 months) and tasks are presented in a fairly detailed manner. The budget allocation section should be more explicit. You ask for $300,000 for the route (9 months), however, the monthly budget is about $30,000, 9 months will be about $270,000, the remaining $30,000 will be used for what? Also, more clarification is needed on the amount of $30,000 per month. Specifically, in 1 month, how many working hours? What is the amount per hour?", "q1r": 3, "q2": "To evaluate the success of this project, I think you need to add the information that I mentioned in the previous section (team profile, clear budget allocation).\nI also appreciate that you have identified the risks and challenges that will be encountered during the implementation of the project, as well as how to solve it. It is a solid foundation that helps your project to work for a long time.\nI have looked at all attachments and visited the github link you provided, really this is a very potential project, I hope in the future this project will be accepted. If implemented successfully, it will certainly bring great value to the Cardano ecosystem.", "q2r": 4, "assessor": "z_assessor_862", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}], "solution": "We implement Perun Channels for Cardano and thereby enable P2P transactions at unlimited scalability and with cross-chain potential.", "experience": "We have already implemented Perun channels for Ethereum, Cosmos, and Polkadot. In addition, we have the co-inventor of state channel networks, Prof. Sebastian Faust, as our co-founder and research lead."}