{"id": 400431, "author": "rmbrt", "title": "Erdstall: instant TXs, L2 NFT mints", "url": "https://cardano.ideascale.com/a/dtd/400431-48088", "category": 26437, "amount": 450000, "description": "Cardano's TX throughput is insufficient for mass adoption and it has no instant transaction mechanism for responsive, non-custodial DEXes.", "f6_no_assessments": 5, "f6_rating": 3.3333333333333335, "videos": [], "media": [], "f6_assessments": [{"id": 1120, "q0": "The Erdstall team is proposing building an L2 sidechain that will help scale both throughputs and drastically reduce costs of services that are held on the sidechain.  The L2 proposed will have a drastic effect on scaling that will leverage technology originally developed for Ethereum and implemented in Cardano.  This will scale to all users and make certain services such as NFT minting nearly free for the minters.", "q0r": 5, "q1": "This plan is requesting a lot of resources, but they have already implemented a similar solution on the Ethereum blockchain.  The challenges with this implementation will be to account for the eUTXO-based model compared to the account-based model that is used in Ethereum to make the L2 sidechain function as desired.  The framework for research, development, and implementation listed above are sound.  An additional challenge is that many of the same team members are on a similar project (Perun) and managing time dedicated to each project could be challenging.", "q1r": 3, "q2": "Little to no information is provided about specifics that can be audited in this project.  They note that information will be made public through social media and public forums, although more detail can be listed to detail how they would measure the progress of the project.  The rough roadmap is nice, but is very high level.", "q2r": 2, "assessor": "z_assessor_13", "no_vca": 13, "ne": 0, "ng": 11, "nfo": 2, "vca_o": 1}, {"id": 1739, "q0": "The proposal is described in an easy to understand manner and the detailed solution is clear. The team wants to extend the team's L2 Erdstall from Ethereum to Cardano. The solution is laid out in a very detailed and professional manner. The group has measured the risks and has a solution for their project, minimizing the risks that may occur when implementing the proposal.", "q0r": 4, "q1": "The plan is laid out with a clear and specific roadmap for each job and the completion time of the work to be implemented in the proposal. The total budget required by the proposal is $450,000 for a total of 12 months. Almost 50% of the total challenge budget. But there is a lack of in-depth explanation for what to allocate in the budget sheet. For example: $37,500/month salary, how many people will work on this project, time and work allotted to them, and project implementation costs. However, one strength of the proposal is to have a team full of experience and skills to carry out the project in a feasible way.", "q1r": 4, "q2": "The detailed roadmap can measure the progress of the proposal. However, budgets that are not thoroughly explained are difficult to transparently audit. The success of the project was a big challenge for the team. With a brand new proposal.", "q2r": 3, "assessor": "z_assessor_1409", "no_vca": 9, "ne": 0, "ng": 6, "nfo": 3, "vca_o": 1}, {"id": 2659, "q0": "The implications of creating something like this on Cardano could be huge... However, I am not a fan of the centralization no matter how \"secure\" it is touted to be. You guys are spot on in the ideas of a strong layer 2. Asking for half a million dollars is a little on the extreme side for a project that has not built yet on Cardano.", "q0r": 4, "q1": "No matter how many accolades or how experienced the team is, the fact that you haven't built any projects with eUTXO worries me immensely. For the amount of funds requested, I would expect at least some testing and proof of concept building before coming to Catalyst asking for this kind of funding.", "q1r": 2, "q2": "Something like this would be hard to audit until a working product was in place. I believe that this team and their ideas could take Cardano far. I would like to see more self-funding and building before coming to Cardano's Catalyst asking for such a large amount of funding. I do wish you guys the best, and hope to see a future proposal that is a little more tried and tested.", "q2r": 3, "assessor": "z_assessor_1548", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}, {"id": 3240, "q0": "This is one of my favorite recommendations in the \"Cardano scaling solutions\" challenge. The proponent has identified a challenging concern with a relatively large impact scale. Cardano's TX throughput is not enough for mass adoption, and it doesn't have an instant transaction mechanism for responsive, non-custodial DEXs. From the outstanding advantages of the Erdstall solution, the proposed group wants to extend L2 Erdstall from Ethereum to Cardano: lower fees, higher throughput, instant transactions, Off-chain NFT minting, DEX intrinsics, and SDK.\nReading the solution description of this proposal, I am delighted with the team. The solution they came up with identified most of the problems of the challenge and logical argument. Arguing through the analysis of Erdstall's properties and mechanisms of action has made it easier for readers to visualize. Besides, to successfully implement this project, they have foreseen the risks they may encounter. From there, propose solutions to reduce that risk. They haven't worked with Cardano and haven't fully grasped the developer framework yet. Primarily never built a smart contract under the eUTXO model. So they spent enough time researching and planning the development steps before starting to develop Erdstall.", "q0r": 4, "q1": "This is a detailed plan project with a clear timeline and specific goals. The project's budget accounted for 45% of the challenge's total budget. This funding is only for paying members' salaries for 12 months. This budget analysis is not detailed and has no reasonable explanation. I want to know the specific developer salary, how much for researchers, and how much for managers. Does that salary include other expenses related to their work? As far as I understand it, the monthly wage means that this is the cost of hiring staff daily, not a package hire. Then other necessary expenses related to the project's roadmap include smart testing contracts, marketing, product development costs, costs of building protesters, etc...then how will it be distributed? I want a more detailed explanation.\nThe proposer gave the experiences and achievements of the team members, each with their own advantages and different job positions. This demonstrates their ability to match the proposal's goals. However, I have no basis to be able to identify them. Therefore, I think the team should update the link to Facebook, Twitter, Linkedin, ... so that viewers can get more information.", "q1r": 3, "q2": "With the audit part, the team did not provide metrics and KPIs to measure the project's progress and development. Instead, they will update progress on Twitter/Disco/Blog, can also check in their SDK and Cardano operator repositories through issues and merge requests. However, when looking at those updates, I would like to know what metrics I should pay attention to and the minimum number of communities participating in the experience to achieve the project goal.\nThis is a brand new project, it has not been tested, but many advantages can determine the success of a project. The team has been working on off-chain solutions since the beginning of 2019. Erdstall has been in development since late 2020 and started as a project in the ETHOnline 2020 hackathon. They were deployed online to test the Goerli of Ethereum and built an NFT market outside the sample string using Erdstall. Along with the capacity and experience of the team members, I think the project's success is feasible.", "q2r": 2, "assessor": "z_assessor_1631", "no_vca": 8, "ne": 3, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 5695, "q0": "Erdstall promises the throughput of centralized systems without compromising on decentralization. The team acknowledges that their implemented proposal would not include a mainnet release, as their implementation would lack key requirements for production use. A risk factor is also that the team has not worked with Cardano yet. They have no experience working on smart contracts with the eUTXO model. While they have worked on Erdstall for Ethereum since 2020, it has not been deployed there on mainnet as well. For requesting nearly half of the challenge's funds, the impact of funding this proposal is medium at best.", "q0r": 3, "q1": "The plan itself appears feasible. While I think the timeline may be overly optimistic, no point is taken away for that.\nHowever, detailed and verifiable information on the committed team members would be beneficial. A minimal demonstrator should be part of the project closeout report anyway (to receive the final payment - something that IOG recently changed). The expectation for Project Catalyst proposals is generally that they get done. Original timelines are often not met, but it's up to the team to deliver. The language of the proposal suggests that this is primarily a community-funded (salaried) learning opportunity and the team delivers what they can in the amount of time. I wanted to offer the perspective that this is not how Catalyst has been viewed by previous funded proposers.\n\nThe one-star-deduction comes from a detailed breakdown of the salaries, and the lack of verifiable information.", "q1r": 4, "q2": "Regular updates and public repositories should suffice to audit the progress. Success should probably be defined by other Cardano projects using the implemented proposal. The mainnet version of this proposal should easily achieve that.", "q2r": 4, "assessor": "z_assessor_22", "no_vca": 6, "ne": 0, "ng": 5, "nfo": 1, "vca_o": 1}], "solution": "Extend our L2 Erdstall from Ethereum to Cardano: low-fee, high-throughput, instant transactions and NFT mints, DEX intrinsics, and SDK.", "experience": "We at PolyCrypt have been working on off-chain solutions since early 2019.\n\nIn addition to our experience as blockchain developers, we have the co-inventor of state channels and the CommiTEE protocol, Prof. Sebastian Faust as our co-founder and research lead."}