{"id": 400687, "author": "nicoarqueros", "title": "Layer 3 scalability using zkRollups", "url": "https://cardano.ideascale.com/a/dtd/400687-48088", "category": 26437, "amount": 75000, "description": "zk-rollups using validity proofs are currently the most likely solutions that will help scale up blockchains. Cardano is missing this so far", "f6_no_assessments": 4, "f6_rating": 3.0833333333333335, "videos": [], "media": [], "f6_assessments": [{"q0": "The challenge asks for proposals that will help Cardano scale, to secure Cardano main chain is not overloaded as new protocols in DeFi, NFTs and gaming are being released. \n\nChallenge encourages proposals within the following scalability topic areas:\n- Rollups (e.g. zero knowledge rollups, optimistic rollups)\n- Sharding\n- Sidechains\n- State channels\n\nThe proposal is a short and to the point request for funds for doing research on how to implement zkRollups and to write a proposal for a future Catalyst fund for implementing it. The plan is to research SNARKs and STARKs for 1 month, 1 month iterate about a proposal and 1 month to write detailed plan on how to implement zkRollups for Cardano using Milkomeda.\nEven though the challenge description articulates that proposals in this challenge may take time to implement and may cost lots in order to do so, I must say I had wished for more than a proposal asking for funds to look into how they would have implemented the zkrollups in a future proposal. I am confident, that dcSpark can deliver a good solution with the track record they have and technical background, but this proposal will only deliver a plan, and the community can expect a new proposal for implementing the plan.\nAs the challenge also says, Cardano potentially will face problems already in 2022, and we have already seen congestion on the main chain. It is therefore a bit surprising that this proposal is asking for funds to have a 3 month research project only. It would have been much easier to see potential and higher rating for this proposal if it set forward a roadmap containg both the research phase and the implementation phase. What if the research phase shows the need for 2 years of implementation? At this point not even dcSpark indicates a ballpark estimate for the implementation. Research does not impact Cardano scaling needs, so I would have wanted the proposal to be larger so that it could contain some work to impact scaling needs.\n\nIf resubmitting this proposal in a later fund, I would recommend reworking the proposal to be a full implementation project where the design phases of the current proposal is the first couple of months is detail planning and research / proof of concepts for potential solutions and then some months for implementing the design. The new proposal would then ask for a way larger budget than now, but the proposal as a whole will deliver something that will impact the challenge goals positively, not only deliver a blueprint design. Blueprints are usually what one would expect the proposal to contain when first being submitted to Catalyst. A larger proposal that delivers something concrete, like a POC at least, gives clearer insight into what is being delivered and when. ", "q0r": 2, "q1": "dcSpark has a great track record and I have full confidence in them delivering this design and future proposal with the funds they ask for. It would have been good to see some more details about what the individual team members will do in the project. For one thing...who has the knowledge about zkRollups?\nProposal is asking for $75000 to be split equally between 3 resources for 3 months. This sums up to $8333 per month for each resource. This amount feels too high in relation to what is being delivered. I think the plan needs some work as I am surprised it takes 3 full-time resources a full month (totally $25000) to iterate about a future proposal, the same amount of time needed for research...In a future resubmit of this proposal, I would recommend reworking the plan so it looks more realistic. ", "q1r": 3, "q2": "Proposal provides a short description of what is being delivered. The end result will be easy to review by the community when it is delivered as this is said to be \"a detailed plan on how to implement zk-rollups using Milkomeda in Cardano\". There is no roadmap or KPIs for measuring the progress of the proposal, but the work is divided into three months with a short description of what is being worked on in each month.\nTo get higher rating please provide information about how the project progress can be measured and a roadmap for what can be expected in the future with some mentions of time for implementation. As this proposal is only asking for funds for doing research, it is important to know something about when implementation of the research can be expected.", "q2r": 3, "assessor": "z_assessor_1075", "no_vca": 15, "ne": 6, "ng": 8, "nfo": 1, "vca_o": 1}, {"q0": "The proposal clearly meets several of the objectives in the Challenge. It is a) a Research Project, b) seeking to provide a solution for Cardano's blockchain to be scalable using zkRollups and, c) it is looking to borrow a technique from Ethereum.  These three items are all components in the Campaign brief, so in my assessment it effectively meets objectives.\n__________________________________________________\nThe proposals success statement is \"A clear path to implement zk-rollups\". I would suggest to the Proposers that for voter confidence in a Research to written plan proposal, a success statement with more clarity as to your deliverable might be better received.\n__________________________________________________\nThe key metric(s) in the proposal are: a) a clear blueprint on how to implement ZKrollups on top of Milkomeda as L3\", b) \"as well as a roadmap for wallet implementation\". I understand the wallet is a bonus as it was not mentioned in the challenge or solution. I would advise to the proposers that the Key Metrics should be fashioned to demonstrate in a quantitative manner what the proposed solution will do for the Cardano Blockchain e.g. zkRollups will permit Cardano to scale to 100,000tps, etc. Some Voters and other Assessors look for details like that to provide a confidence level in Proposals, especially a research project.", "q0r": 4, "q1": "The strength of the proposal team is the primary reason I rated this project a 4 (agree) for likely to succeed. The three founders of dcSpark ( web page states dcSpark 'builds high quality crypto products that unify the users experience within blockchain ecosystems' ; with Milkomeda listed as their product and that Cardano is a user of MIlkomeda). It would appear the team has a proven track record. The proposal does not list any other team required. The Tech was lightly touched on without any explanation. I would advise the proposal team to explain your tech ELI5 and provide bios and explanation of what dcSpark and Milkomeda is and does. Not all readers of your proposal or all of the voters understand the tech or recognize the names. You want to attract every vote you can to your proposal, by making it understandable and as attractive as possible.\n___________________________________________________\nAs well as the tech, the Risk Management/SWOT was very lightly addressed. The question about the  main challenges (Risk Management/SWOT - Strengths, weaknesses, opportunities and threat) to the project was answered \"Like any technical research and blueprint there is a chance that may not workout, but we are sure it is highly feasible\". A SWOT and a Risk Management assessment of a project should be more than an opinion or feeling. It should be backed by quantitative data and analysis. For your statement - what is the percent of a chance that it will not work out, and based on what data. And, \"but we are sure it will work out\" - who is we? and what makes you certain? If that certainty is industry based - quote the source. My advice would be to rework your SWOT and Risk Management analysis to provide the voters a confidence level to invest the $75,000 you are requesting in your project.\n__________________________________________________\nThe budget could have been better explained or provided with a more quantitative basis of how the funds will be allocated. The budget statement of \"The funding will be split in three equal parts to fund the research and the engineering work to describe.....\", leaves a confusion over if the one third is for each team member or to each of the three months for the project timetable. I would advise the proposal be edited to provide an established hourly rate for each type of work, how many hours are projected to be allocated for each stage.  This will provide a basis for clarity of budget request and auditability.", "q1r": 4, "q2": "There are three interim milestones, not well defined, with a final deliverable of ' a detailed plan'. The proposal does not provide KPIs or a methodology to measure or audit the projects progress. Since this is a, research to plan, project my suggestion to the proposers would be to consider editing the proposal to implement an Agile type methodology with Team meetings and perhaps Discord or Github activity on your progress.  This would provide a low effort system that provides transparency, auditability and voter confidence.", "q2r": 2, "assessor": "z_assessor_1339", "no_vca": 7, "ne": 2, "ng": 5, "nfo": 0, "vca_o": 1}, {"q0": "The proposer finds a problem within our ecosystem and proposes an honest solution, in fact accepting the risk that \"there is a chance that may not work out\". And this honesty with the community is important when building projects.\n \nIt is also true that if successful, this project would add a lot of value to our community. And that the project is framed in a good way in the requirements of the challenge.\n \nBut the problem with the proposal is that it is too short. It does not give enough information to the community so that it understands in more detail what it is financing. I understand that proposers are professionals in the field, and highly respected people in our community, but that should not exempt them from writing a detailed proposal that helps the rest of the community (technical specialists and not) understand why they are asking for 75 thousand dollars.\n \nAt no time does it explain what the zk-rollup is, nor what are the necessary steps to try to carry out this blueprint. They take too much information for granted and answer two lines rushed to each question.", "q0r": 3, "q1": "Something similar happens in this field. Being recognized in our community does not imply bypassing the requirements and formalities of Catalyst. At no time are links attached that certify the suitability of the proposers to carry out this project.\n \nThe budget is brief and does not detail the price of each of the activities that must be carried out to achieve them. It only gives us a summary of where the bulk of the money will ultimately go. And that's not the way to write a serious budget.\n \nThe same happens with the timetable. Brief and without details that make the community understand what the necessary tasks are to build the zk-rollup in Milkomeda.\n", "q1r": 2, "q2": "There is not much to add in this category. The proposers once again write less than one line to each question in this category. They don't take the time to write milestones and kpis that would help the community audit their project.\n \nWithout these two requirements the task of auditing for the community becomes completely impossible. And that is intolerable in this type of project where the possibility of failure is greater, as the proponents themselves acknowledge when they write: \"there is a chance that may not work out\".\n", "q2r": 2, "assessor": "z_assessor_32", "no_vca": 6, "ne": 0, "ng": 6, "nfo": 0, "vca_o": 1}, {"q0": "It is interesting to discover the possibility of additional scaling solution adopted from neighboring chain such as Ethereum implemented on top of Cardano's L1 and L2 as a L3. Congestion is currently one of the main issues everyone in Cardano is facing, either occasionally for casuals or almost every time for power users. Congestion is also a common and (honestly) quite effective point-of-attack issue for malicious anti-Cardanos. Ultimately, this has been giving off a false impression that Cardano is a less-performant chain. While IOG is already working on multipleson- & off-chain scaling solutions on their own, I think it is important that we as a community start to consider further technological advancement so for once, we might be step(s) ahead compared to competing chains or protocols. ZK-Rollups have also seen success in Ethereum and this proposed L3 built on top of existing and growing Milkomeda sidechain should also increase Cardano's adoption and interoperability, particularly with other EVM-based L1 blockchains. One thing lingering on my mind is how beneficial a L3 at present time, not only in Cardano but also whole cryptoverse in general.  Still, this proposal could be a great investment for the Cardano community and ecosystem while being in line with the theme of current Basho era, which is scalability and interoperability.", "q0r": 5, "q1": "\nWe know dcSpark from delivering Flint and Milkomeda to Cardano audience. dcSpark itself is one of the most prominent developer team in our community. Though this might not be interacting with the core topic of proposal itself, the founding members had already been involved in Cardano from their Emurgo days developing Yoroi. The accumulated skill and experience of the founding members who will be directly responsible executing this proposal is convincing enough. To me, the timeframe to deliver the blueprint and a further detailed plan in 3 months before leading to proof of concept is realistic and achievable enough. Still, I hope we can see a more detailed breakdown of the fund requested in terms of more detailed engineering/man hours and technical specifications. Lastly, tech-wise we have seen zk-SNARKS implemented both in a UTXO-chain such as zCash and account model-chain such as Ethereum so we can intuitively see some feasibility and synchronization. With above rationale, I believe that community will gradually enjoy something actual from this proposal progressing well into the next Funds as well.\n", "q1r": 4, "q2": "I must be honest that after reviewing few other proposals from different developers, this one is quite weak in this particular aspect of auditability/clarity. As a sort of layman myself, it would nice to see if dcSpark team/proposer can share with CA or voter the expected product of this proposal from their previous works in form of attachment or git URL inside the proposal brief. Furthermore, this might be too soon for the scope of this proposal and I am not a fan of vanity metrics-flexing such as TPS boasting without substance (which most of the time is more of a marketing stunt), but still maybe proposer can educate CA or voter a bit on this topic while simultaneously set an expectation on the blockchain metrics (which might as well be TPS, since this is a scaling solution) but in a more substantial and useful manner.", "q2r": 3, "assessor": "z_assessor_943", "no_vca": 5, "ne": 2, "ng": 3, "nfo": 0, "vca_o": 1}], "solution": "Research and clear blueprint on how to implement zk-rollups on top of Milkomeda as a L3 as well as a roadmap for wallet implementation", "experience": "Besides understanding Cardano quite well, dcSpark is one of the core developer of the Milkomeda protocol. This puts dcSpark in a key position to work on blueprint for this."}