{"id": 400815, "author": "rg.admin", "title": "Research Guild: Scalability Report", "url": "https://cardano.ideascale.com/a/dtd/400815-48088", "category": 26437, "amount": 134538, "description": "Cardano values academic rigor; however, the Catalyst community lacks coordinated and skilled research that focuses on scalability.\n", "f6_no_assessments": 5, "f6_rating": 4.333333333333334, "videos": [], "media": [], "f6_assessments": [{"id": 223, "q0": "The proposal does state in great detail, what will be done and how it will impact the Campaign goal of scaling Cardano. Even though, there is no direct scaling effect when accepting the proposal, the outcomes of the research might pave the way for further improvements long term. Two things could especially have a long term effect, this is one, the research done in terms of current weaknesses of Cardano and the comparison to other chains and two and much more important the buildup of an independent research group within Cardano that is community driven. Even though currently IOHK is doing a supreme job in doing these kinds of research, an independent group outside of IOHK also diving deep into the Cardano research tunnel may provide not only benefits but also a second opinion.", "q0r": 5, "q1": "The proposers seem to be capable of providing what is described in the proposal. The described plan sounds doable and especially their academic background should make it possible to motivate other people with a similar background to get on board mid term. The only downside could be, that they are at the beginning of their career and not very well known at the moment.", "q1r": 4, "q2": "In general the provided is sufficient for auditing even though there are no hard goals stated in the proposal meaning that the quality of the result is not really measurable. With quality is not measurable I mean, what was provided is a checklist of goals without a definition of success.", "q2r": 4, "assessor": "z_assessor_1091", "no_vca": 13, "ne": 1, "ng": 12, "nfo": 0, "vca_o": 1}, {"id": 1306, "q0": "The objectives in the challenge include Research and Novel Ideas and this proposal is for the developing of a Guild to effect Research into Scalability so it meets the objective. \n\nThe Proposal views success in a three fold process as it forms and moves through successive Catalyst Challenges of: 1.Supporting skilled researchers. 2.Using a research driven approach to support Cardano, and 3.Delivering Research documents with clear and actionable recommendations. \n\nMy viewpoint is the proposal meets the success statement of the challenge of: Solutions Introduced.\n\nThe key metric of Novel Idea(s) is also met by the scalability approach of research on different projects by utilizing various academia researchers.", "q0r": 5, "q1": "The Proposal for a Research Guild formation appears sound and highly likely to be implemented by the proposing team. The proposal takes an 20/80 approach to the expensing of the development of this multi-fund Guild of Researchers, which appears well thought out. 20% of funds are targeted to Infrastructure and Administration and 80% towards the research project(s) actual work.\n__________________________________________________\nThe three lead proposers appear to have the education and experience needed in forming this Research Guild. The proposal has a realistic timetable and implementation plan. Though this does appear that it will need to become a Legacy Challenge Proposal across several Catalyst funds to reach full viability.\n__________________________________________________\nThe research budget is well researched and documented which is stated to be 80% of expenditures. The Administration budget as stated is on the weak side and I would suggest the Proposers go into more detail on the envisioned expenditures for the Admin/Infrastructure 20%.", "q1r": 4, "q2": "This proposal has put forth a success measurement system using two streams of measurements with distinct KPIs. The Guild will use Fixed KPIs for their Research campaign specific reports which keeps with the 20/80 budget structure proposed of Infrastructure vs. Research.\n___________________________________________________\nThe 20% Infrastructure side would utilize variable KPIs which will evolve over successive iterations of the Guilds formation. I find this approach as logical and commonsense in nature. I would suggest the Guild establish more formal Monitoring Criteria as they develop and focus, due to the large number of audit metrics proposed.", "q2r": 5, "assessor": "z_assessor_1339", "no_vca": 10, "ne": 1, "ng": 9, "nfo": 0, "vca_o": 1}, {"id": 2148, "q0": "NOTE for VCAs and voters: The Research Guild is a network that has launched 6 proposals during this funding round. This proposal is judged partly through its individual merits, and partly through the way it fits into the wider Research Guild framework. My assessment takes into account aspects common across all proposals (the network’s organizational aspects, competency, research approach, workload, or similar reporting mechanisms and budget logic). You shall therefore find common parts across these proposals and parts specific to each proposal.\n\nKey takeaway: spot on problem identification, perfect alignment with the challenge, tremendous potential for added value for Cardano if the report is shared with the community and thoroughly digested by future proposers before designing scalability solutions. With a research-oriented background myself, I can only applaud the overall quality and level of detail of the proposal. \n\nThis proposal aims to deliver a customized scalability report that will review scaling solutions across blockchains and share them with the wider Cardano community. Such a report can be  an extremely helpful tool to future Catalyst proposals when designing and proposing scalability solutions. This proposal not only aligns, but matches perfectly with the challenge and I think it is of utmost importance that the ecosystem finances similar research undertakings well before costly scaling solutions.\n\nHaving in mind Cardano’s research-driven ethos, there are incredibly valuable insights that such a community-driven research would bring for future projects, for instance (1) removing guesswork, (2) identifying knowledge gaps, (3) challenging false assumptions or (4) offering off the shelf SWOT material. The added value for the community stems from the fact that such a report can be an instrumental tool for future proposers that aim to introduce layer 2 solutions or other projects that increase Cardano’s scalability / efficiency if used in the early stages of product development / selecting implementations solutions. ", "q0r": 5, "q1": "Key takeaway: A solid academic-oriented team behind the proposal, a clear plan and recruitment process for the actual researchers and an understandably long but reasonable timeline for completion. Good value for money overall. A big risk is over-promising, since this is by far the most complex Guild’s proposal, with the highest budget and longest timeline. \n\nThe plan. The core team consists of 3 PhD / PhD candidates from Auckland University, Renmin University respectively University of Osnabrück, all currently undergoing blockchain-oriented activities. They would NOT conduct the research themselves, but instead they would extend invitations to their networks of academic and professional colleagues to participate in the actual research. Perhaps the standout of the team is the wide-net that they can cast within their own respective networks when searching for viable research candidates. They would subsequently undergo a recruitment / selection process based on received resumes / review of academic work published / blockchain experience. The actual work itself would be undertaken by this collective of independent researchers onboarded as above. \n\nThe team correctly pin-points a significant risk facing the project, that being the sheer number of hours required to complete such a large research project given their team size. To address this they promise to dedicate time to on-board additional team members within the next months, which of course will be highly dependent on whether the project will be funded or not. \n\nBudget talk. 20% of the budget would go towards building the research network (research identification, outreach, project management, support, designing reporting templates, etc.). 80% of the budget would go to creating tailored research projects following a loosely based pathway which makes sense considering the knowledge-building capacity of the project. Payment for individual researchers would follow a determined base hourly rate, based on the average of online surveys already undertaken. There are extensive figures offered in the proposal, but the key figure to remember is the overall base pay of USD 32/hour and US 60/hour for highly specialized work.\n\nThe team estimates that a research report of this scale and complexity will take nine months to complete: from May 2022 until January 2023. There is a detailed project roadmap outlined in the proposal, with great granularity down to weeks necessary for each intermediary step.", "q1r": 4, "q2": "Key takeaway: very clear roadmap and extensive KPI list, great verification potential and clear communication channels for work undertaken.\n\nThis work will be delivered in the form of a public report with key research insights and recommendations that can be implemented by the community immediately, or pursued through future Project Catalyst funding proposals.\n\nThe project team will approach auditability in three ways: (1) establishing a set of project indicators, (2) engaging in internal peer review processes for each deliverable and (3) engaging in Project Catalyst community advisor review processes. \n\nSuccess would be measured 20% through the success of establishing a research network and 80% on the report itself. The KPI list for both items above is extensive and quite possibly very challenging to implement in practice, but they are definitely an excellent starting point. ", "q2r": 5, "assessor": "z_assessor_1454", "no_vca": 11, "ne": 5, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 5128, "q0": "This proposal features in-depth research and scaling implementations to help Cardano increase scalability. This creates a text with in-depth research that helps focus on finding the root causes of the problem. From there, find solutions and implement those solutions to create a solid foundation for Cardano's long-term development.\nWhat are the implications for Cardano of implementing this proposal?\nWith strong foundations in the proposal to carry out a professional research project towards the community and drafting a document with an extended deployment scope on the blockchain space, this project promises to directly solve the challenge of the problem posed. From here, the community benefits from the successful implementation of the project. And Cardano can handle its scaling requirements as well. The matter is solved in a basic and deep way, so it will take a lot of resources, especially time, human resources and financial attached. However, high hopes can be expected in this proposal.\n", "q0r": 4, "q1": "The authors are doctoral studies on various topics, especially research on the application of blockchain in land management, which is an important foundation to research problems in this challenge. If the author has experience in research activities, background knowledge will bring a positive factor for faster and more effective implementation of the proposal.\nFeasibility of this project?\nThe proposal outlines ways to implement “Cardano scaling solutions”. In-depth research of the project contributes a large proportion of the project implementation time and cost. The author has detailed planning on specific time and stages of project implementation, which shows the feasibility of this proposal. The feasibility of the project is demonstrated through:\n- Proposals are implemented in two phases, including building the research organization into a network of skilled researchers and tailoring research reports to campaign summaries, or related proposals. Both stages have specific goals to be achieved (KPIs) to promote and create efficiency, avoiding wasting time, money and effort.\n- This proposal requires high quality personnel to meet in-depth specialized research to find out the causes, solutions, and the effectiveness of those solutions. From there publishes a report on Cardano scaling solutions.\n- However, in the proposal, it is necessary to show more clearly the effectiveness of implementing and solving the challenge. What tools are used to measure the effectiveness of the team in implementing the proposal? If the effect is not as expected, does the team have solutions to fulfill the original goal?\n", "q1r": 4, "q2": "The author provides a full and detailed budget for the implementation of each proposed item, based on which the transparency and success of this proposal can be seen.\nIt is proposed to develop a KPI to measure the effectiveness of the project, with 20% of the budget to set up research funds and the remaining 80% to fund Cardano scalability reporting.\nThe project is assessed as a success based on criteria such as: supporting skilled researchers to bring them income, in return, Cardano and Project Catalyst will know the problems that need to be faced to increase the scale of Cardano; support the Cardano and Catalyst communities to solve key issues in order to fulfill the set goals; provides a solid research background with in-depth analysis to address the core problem.\nThe project information is complete, detailed and clear, so that readers can quickly assess the issues raised. Feasibility and probability of success should be more clearly stated in the feasibility of the proposed project. Overall, I think this is a proposal made based on in-depth research on the issue, so it has practicality, efficiency, feasibility and transparency that will bring certain successes to the project.\n", "q2r": 5, "assessor": "z_assessor_1863", "no_vca": 8, "ne": 1, "ng": 4, "nfo": 3, "vca_o": 1}, {"id": 10024, "q0": "The teammembers have properly selected the proposal to match the challenge of scaling cardano. The background and team description focus heavily on blockchain and cryptogrophy. The proposal is essentially to fund a research group to focus their time and effort on solving complex scaling problems.", "q0r": 4, "q1": "The proposers have a impressive academic background and have indepth knowledge on the challenge the is proposed. However I see  that they are mentioning the goal of this proposal is to hire 2 new researchers to focus their efforts on the problems that will be resolved for scaling cardano. It might be difficult or a hurdle to find such niche group of likeminded backgrounds. Although they do state that they will share and request EOI from anyone within their circle of contacts. \nSecond issue is the extensive list of challenges to resolve or delve into. This is interesting for growing the research group but may impeded any significant progress or tangible deliverables. \nOverall the proposal highlights that this is purely academic and research oriented and we should treat it as such. ", "q1r": 3, "q2": "The budget and timeline aspect follow a rigorous academic (post-graduate) type research grant. I have seen these and normally are easiy auditable to an extent. The outcome of the research is the wildcard and since there are a various list of topics there might not be a single deliverable to audit at the end of the project. I would imagine that a certain number of paper publications might be a good KPI to ammend in the proposal.", "q2r": 4, "assessor": "z_assessor_785", "no_vca": 7, "ne": 0, "ng": 6, "nfo": 1, "vca_o": 1}], "solution": "The Research Guild will deliver a Scalability Report that scopes scaling solutions across blockchains to inform future Catalyst proposals.", "experience": "Three PhD candidates studying blockchain applications in land management, intellectual property and peer production; a PhD in Law and International Relations; expertise in research, project management, community development, governance, teaching, license compliance and auditing."}