{"id": 401827, "author": "abehazbunjr", "title": "A Scalable Service For NFT Utility", "url": "https://cardano.ideascale.com/a/dtd/401827-48088", "category": 26437, "amount": 40000, "description": "Creators and merchants alike face a high tech barrier to adding utility to native tokens, and much code is reinvented by each project.", "f6_no_assessments": 5, "f6_rating": 3.9333333333333327, "videos": [], "media": [], "f6_assessments": [{"id": 1309, "q0": "This proposal addresses more than one of the challenge parameters. First the proposal is niche market focused. Second it it proposing the use of Side Channels/State  Machine for scaling. These are two of the five topics of concern in the Challenge brief which is why I rated it a five for effectively addresses the challenge\n___________________________________________________\nThe proposal lists several metrics for determining success. The first and most important is \"All milestone deliveralbles completed on time as described\". The other metrics will be covered in the feasibility section. ", "q0r": 5, "q1": "The proposer has experience in e-commerce is a Plutus Pioneer student and is self taught in Javascript and Python. One area of concern is team strength, depth and availability. The proposal recognizes two areas of outsourcing for a Shopify Apps Developer and AWS Consultant. Depending on ready availability, delays may occur in the timeline, which otherwise appears to be reasonable.\n______________________________________________________\nOther than team issues mentioned above the project is likely to be implemented and it solves the problem as asked and in the Challenge brief for niche scaling. The Implementation plan along with the metrics make sense.\n___________________________________________________\nThe budget looks well reasoned with clarity and detail. The tech behind the project is reasonably explained and fairly understandable at many levels.\n____________________________________________________\nThe proposer addresses the Risk Management issues and has mitigation suggestions that appear reasonable. The proposed use of Naptcha with limited downside risk does seem reasonable.  \n___________________________________________________\nMy suggestion to the proposer is,  provide a higher level of voter comfort by consulting with the needed talent for this project and ascertain availability and provide an update in the proposal.", "q1r": 4, "q2": "The proposal has a detailed implementation plan and timeline. The budget is detailed and has clarity with a date for delivering the product. The measurement of progress and development of the project will be accomplished via Asana, a project management app. Info at asana.com . The project will also use Discord to keep the community up to date on progress.\n____________________________________________________\nThere are KPIs included and the milestones appear to be solid. My assessment is this project is auditable and was well written and presented.", "q2r": 5, "assessor": "z_assessor_1339", "no_vca": 10, "ne": 1, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 2156, "q0": "The proposal aims to create a service that integrates a B2B ecommerce solution into NFT project websites without coding skills. Practical applications would be for instance (1) token gating - the ability to block access to specific pages and content dependent on token ownership, (2) an alternative login mechanism without usernames / passwords / captchas, (3) storing game data and (4) discount codes for e-commerce. Huge added value for Cardano if only half of these ideas turn into practical applications!\n\nI have mixed feelings whether the proposal fits into the scaling challenge. It’s a tough call since the proposal fits very well for instance within the Dapps and integration or even the Developer ecosystem challenges. This is however a very strong indication that if implemented successfully this project can have a powerful impact in more than one key areas.  \n\nA difficult point for me is honestly to assess the scalability potential of this proposal. Hopefully other reviewers will shed more light into this topic. ", "q0r": 4, "q1": "The bulk of the project (60%) would be implemented by the proposer, a Plutus Pioneer student with 12 years of experience in e-commerce and web analytics and self-taught in Javascript and Python. For future projects it would be a good practice to include a Linkedin reference, which immediately takes the trust level one notch higher. \n\nHe would be complemented by a yet to be identified / appointed (1) a specialized Shopify Apps Developer (20%) that has published an app to the Shopify plugin store in the past and (2) similarly an AWS Cloud Architect Consultant (10%), either an agency or individual to ensure the security and scalability of the cloud architecture aspects. The remaining budget would go towards server architecture (10%). Percentages represent budget break-downs. \n\nOn a technical note, the proposal is complemented by a detailed addendum including a brief mentioning of risks involved and revenue models, which is a welcomed aspect when considering the long term financial sustainability of the project. There are as well a few logical schemes outlining how the built modules would interact with one another. It is worth mentioning that such an implementation would represent a pseudonymous account access mechanism and it is not intended to be a new version of KYC or an alternative to individual identity solutions (Atala Prism).", "q1r": 4, "q2": "The proposal offers to keep track of the project through the Asana project management software, with milestones and deliverables being publicly visible. The public can also be notified of overdue project milestones. The proposer also offers to initiate a Discord Community with code updates, interactive show-and-tells sessions and modded discussions on prototype feedback. \n\nThe project’s roadmap is fairly detailed, with milestones set-out for deliverables following months one, three and six. It was not very clear what the estimated overall timeline is. \n\nSuccess metrics proposed are number of paid users, average subscription length or business user activity measurements. ", "q2r": 4, "assessor": "z_assessor_1454", "no_vca": 9, "ne": 1, "ng": 7, "nfo": 1, "vca_o": 1}, {"id": 2711, "q0": "This idea is very interesting and fits very well with the goals of the challenge. Facing technological barriers for creators and sellers is an issue in this challenge. Given the above challenge, I think this will improve community engagement and simplify the issues the author has raised. It's great that the team came up with the idea above to create a state machine and bring in a middleman to integrate e-commerce solutions between businesses and wholesalers and retailers through web pages in code identification. With this convenience, I think this will improve community engagement and simplify the problems that need to be solved at the challenge. With an in-depth look at the project's hidden risks and strategies that the author has raised and consulted with the developers, I believe that the project will develop successfully if funded.", "q0r": 5, "q1": "The plan is very clear with a roadmap divided into 1, 3, 6 months explaining what they will do in each month and a quarter of the plan year listed clearly and in detail. The total budget is given as $40,000 they are explained and estimated for each item with reasonable expenses. With the amounts listed for each item, the roadmap and budget are sufficient to audit the progress of the proposal. About the team, we don't see clear information, only general information about what the team members need to do, but not the name of a member of the group. Although we list each part separately, we do not know who they are, what are their names? In my opinion, the group should list the name and role experience of each person separately and must have a profile linked to social networking sites such as LinkedIn, GitHub....then the trust of the group is for the group. for the community will be more.", "q1r": 4, "q2": "The team has listed milestones and high-level tasks that will be publicly visible through which I find the author excellent description of the relevant sections to assess the testability of the proposal. It provides the necessary information for the followers to better understand the progress of the project. The provided roadmap is very detailed and with general results indicated for each given milestone and duration, the key indicators for success are also clearly listed by the author by the current context.", "q2r": 4, "assessor": "z_assessor_1559", "no_vca": 9, "ne": 0, "ng": 8, "nfo": 1, "vca_o": 1}, {"id": 10031, "q0": "The proposal present a novel way to utilize NFT for logins/onboarding or special access to websites. This definitely fits within the area of scaling utility in the cardano ecosystem. The proposal if implemented will grant exposure to wider clienbase and may help scale the usage of cardano on a wider range of applications.", "q0r": 4, "q1": "The description of the proposal relies heavily on the technical skills of the main teammember. Based on the description of the team it seems that the main driver is the same person placing this proposal. I have good faith on the technical skills and deliverable around the technical aspect seem clear and well detailed. It even folllow a typical Project Management path as for many programming projects. \nHowever the challenge seems for the deployment and onboarding of many big names such as Discord/Spotify/etc... the main website or social platforms that will utilize this. I would recommend for the teammmembers to discuss presenting their background or target strategy to onboard those big deliverable. \nMy second suggestion would be to split the technical delierables form the commercial onboarding and keep the second proposal for a future FUND 9 maybe. At that point a suitable candidate or teammember might bring the needed skillset for a great success.", "q1r": 3, "q2": "The Project Mangement part of the source code and coding generation is TOP Shelf, ie perfect and well auditable for the deliverables. \nHowever the second part of onboarding big companies such a Shopify and Discord and number of paid user are very general and not specific target have been identified for auditing the success of the project. ", "q2r": 3, "assessor": "z_assessor_785", "no_vca": 6, "ne": 1, "ng": 4, "nfo": 1, "vca_o": 1}, {"id": 10282, "q0": "This is a very interesting proposal. It creates a state machine and API service that integrates B2B ecommerce solutions into NFT project websites without coding skills. Specifically here is Napcha, it works as a scalable B2B solution that can attract non-crypto business users directly to Cardano.", "q0r": 4, "q1": "Based on the information you provided, I see that you are a person with full experience and skills in the fields of: e-commerce and web analytics. However, to implement a project, the team plays a very important role. I don't think you can do many things well by yourself: Javascript, Python, HTML, CSS, marketing, analytics, data automation. Recruit more members to the team, that will help share the workload, making the project easier to grow in the long run. The addition of linkedin, instagram, ... links of Shopify Apps Developer, AWS Cloud Architect Consultant will also contribute to increasing the persuasion, making it easy for CAs to track and evaluate.\nThe roadmap (6 months) is provided in detail, clearly defining specific tasks in each phase. Budget allocation is not really specific, I think it is necessary to break it down further, for example: number of working hours, amount per hour,...", "q1r": 3, "q2": "As mentioned in the previous section, I think this project needs a few more partners, splitting the budget so that it's easier for everyone to see how the $40000 will be spent. The addition of specific metrics to measure success is also essential. For example, how many specific paying users?,...\nBesides, I appreciate that you have found the challenge, the risk, as well as how to solve it.\nThis is a potential project, however, the information provided at present is not enough basis to evaluate the success of the project. I hope you will update it in the following funds, don't give up, we will help the Cardano ecosystem grow together.", "q2r": 3, "assessor": "z_assessor_862", "no_vca": 9, "ne": 1, "ng": 6, "nfo": 2, "vca_o": 1}], "solution": "Create a state machine and API service that integrates B2B ecommerce solutions into NFT project websites without coding skills.", "experience": "I am a Plutus Pioneer student with about 12 years of experience in e-commerce and web analytics. I am self-taught in Javascript and Python."}