{"id": 404556, "author": "alfred.pham", "title": "DEFI SHOULD BE MORE FUN ON SCALING", "url": "https://cardano.ideascale.com/a/dtd/404556-48088", "category": 26437, "amount": 47250, "description": "The ecosystem needs new DeFi models to \"play\" ", "funded": 2, "upvotes": 32734099, "downvotes": 22978953, "votes_result": 9755146, "votes_cast": 184, "f6_no_assessments": 6, "f6_rating": 3.0, "videos": ["https://www.youtube.com/watch?v=wpm7uZ1b40E ", "https://www.youtube.com/watch?v=9xhCe6eaT6o ", "https://www.youtube.com/watch?v=ojOanrFLqqY ", "https://www.youtube.com/watch?v=RIjBlnbxNKQ", "https://www.youtube.com/watch?v=DxKtSamw_GI ", "https://www.youtube.com/watch?v=c7qKtaDt7q0 "], "media": [{"title": "Proposal summary page", "url": "https://miverse.io/one-page-proposal-catalyst-fund-8/"}, {"title": "Comic Art Samples", "url": "https://drive.google.com/drive/folders/1-soQoajXLKO5cQn1mKk-UFnbdjOqsssD?usp=sharing"}, {"title": "Project summary in one page (Japanese)", "url": "https://miverse.io/one-page-proposal-catalyst-fund-8-jp/"}, {"title": "Infinitive benefit loop for gamers in Miverse multiverse", "url": "https://cardano.ideascale.com/userimages/accounts/93/936143/panel_upload_48088/Be-Gamers-28ede2.png"}, {"title": "Infinitive benefit loop for content creators in Miverse multiverse", "url": "https://cardano.ideascale.com/userimages/accounts/93/936143/panel_upload_48088/Be-Creators-fb3a86.png"}, {"title": "Main activities in Miverse", "url": "https://cardano.ideascale.com/userimages/accounts/93/936143/panel_upload_48088/Activities-483084.png"}, {"title": "Infinitive benefit loop for developers/game makers in Miverse multiverse", "url": "https://cardano.ideascale.com/userimages/accounts/93/936143/panel_upload_48088/Be-dev-f90525.png"}, {"title": "Infinitive benefit loop for investors in Miverse multiverse ", "url": "https://cardano.ideascale.com/userimages/accounts/93/936143/panel_upload_48088/Be-Investors-289a3f.png"}], "f6_assessments": [{"id": 155, "q0": "The challenge asks for proposals that will help Cardano scale, to secure Cardano main chain is not overloaded as new protocols in DeFi, NFTs and gaming are being released. \n\nChallege encourages proposals within the following scalability topic areas:\n- Rollups (e.g. zero knowledge rollups, optimistic rollups)\n- Sharding\n- Sidechains\n- State channels\n\nFirst things first, big kudos to the proposal team for a thoughly documented proposal. The idea for your proposed platform looks very exciting. You clearly have a vision for it and I wish you the best of luck in developing it.\nThat being said, the amount of documentaion is also overwhelming and a lot of time is used simply to grasp the concepts of it all, and to also see how the finished proposal would impact the Cardano community in regards to the challenge areas.\nI would have loved to see this proposal in the Gamers On - Chained or Miscellanious challenge instead as the proposal Project objectives states the develivery of a Comic content / game platform. The challenge is encouraging proposals that will help the Cardano main chain to scale, but I unfortunatly miss to find any relevant functionality in this proposal that will ease the load for the Cardano main chain.\n\nI hope you will resubmit this proposal in a later fund in a relevant challenge for defi platform development or game development. Before resubmitting, I would recommend removing some of the description to keep the proposal as easy as possible to understand. The first time I looked at this proposal, I decided to not review it as it was simply too large. After some concideration, I still wanted to give you this advice for a future fund. Please make the proposal shorter and more to the point. And importantly; submit it in a suitable challenge. I think this will make it more easy for CA reviews and also a successful vote.\n\nThis time around, the proposal is how I see it, simply submitted to the wrong challenge and will not impact the challenge areas in any positive way. The proposal therefore will get a low rating.\n\nBest of luck.", "q0r": 1, "q1": "The proposal lists the required team for developing the platform. I would have liked to see clearer correlation between the project deliverables and what the funds are said to be used for. \n\nThe proposal description says development of a defi platform, while the feasibility section say that development is in the budget of another proposal. The current proposal funds will be used to develop comics. Please in future submit, make sure to align the proposal objectives and budget breakdown. As it stands now, I was confused. I thought the proposal was asking for developing a platform, but then the budget was for comics.\nWhen proposal deliveries and budget is not aligned, it will be difficult to see if the proposal delivered as promised", "q1r": 2, "q2": "The proposal scores good when considering the roadmap. You clearly have a vision for this platform. KPIs are not alligned with challenge KPIs. As commented in other parts of this review, there is a lacking of clarity in this proposal. The proposal contains a lot of description about the platform vision, but it is difficult to grasp. What is funded by this proposal, and what is funded by other related proposals is difficult to follow. Please work with the alignment of proposal deliveries and budget breakdown before resubmitting.", "q2r": 2, "assessor": "z_assessor_1075", "no_vca": 12, "ne": 5, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 1251, "q0": "This proposal assumes that any ecosystem growth is good growth, and suggests that GameFi - Game Finance like play-to-earn, gamified DeFi and financialized games, are a good place to scale Cardano. Here, scaling means to grow - like in the context of \"Scaling a start-up (from 100 to 10,000 users)\". The \"Scaling\" meant in the challenge setting is the scaling of the blockchain to handle more transactions. The setting explicitly mentions rollups, sharding, sidechains and state channels. \nBy attracting more GameFi and making DeFi \"more fun\" I am worried that the unsavory side of blockchain like triple digit yields, surging in-game item and NFT prices and loud and mass-market calls for \"killer apps\" is appealed to. In my opinion, this might not be \"the Cardano Way\" - but this speculation aside, which I did not include to come to my assessment, the proposal completely misunderstands the meaning of \"scaling\" and fails to address the challenge setting at all.", "q0r": 1, "q1": "The proposers demonstrated low understanding of basic blockchain concepts by misunderstanding the \"scaling\" in the challenge setting mentioned (and separately assessed) there. This does not bode well for the overall likelihood of success. Their ability to code and develop on a relatively technical and hard-to-get-your-head around blockchain like Cardano is not demonstrated well by the resumes provided and no experience with Plutus scripts or vulnerabilities of GameFi and DeFi DApps is mentioned. While I trust that the proposers and their team are able to provide engaging narratives and stylish graphic assets, it is not believable that the user experience they promise can be realized in the timeframe or on the budget proposed.", "q1r": 3, "q2": "The proposal has a working link to a Google sheet that demonstrates that some thought has gone into the roadmap and auditing. The granularity and scope of the project are way bigger than the proposal. It is not clear how audit of funds across two Catalyst proposals and requirements for external funding can be aligned or how the project is going to hit KPIs if any of these funding rounds are missed. All the goals refer to the comic side of the marketing, and none to the SPO/GameFi side of connecting the narrative of the game to the blockchain. I assume that the development of the necessary code will be impossible to audit and progress can only be tracked for creating the \"hype\" (in a positive sense - \"wow factor\") /marketing but not the substance of the project.", "q2r": 3, "assessor": "z_assessor_1329", "no_vca": 8, "ne": 2, "ng": 6, "nfo": 0, "vca_o": 1}, {"id": 1947, "q0": "The proposers have clearly identified that the problem is that the ecosystem needs new DeFi models to play.  As a solution to this problem, the proposers are suggesting a new distinct model other than UX design.  This distinct model is expected to have a positive impact on cardano ecosystem because it takes technology one step further and its is very promising.  The KPIs of the project are aligned with the KPIs of the challenge in that it provides a novel idea as a scale up solution.     ", "q0r": 5, "q1": "The team involved in the project has the knowledge skills to implement the project.  This is a technical proposal related to scalability. The proposers are referring to specific people with specific qualifications and expertise that meet the criteria to complete the job. Links to the profiles of the team has been provided.  In regards to timetable and budget, already some milestones have been completed, some are underway and some have not been completed yet. The timeline seems realistic as well as deliverables. The proposers have identified challenges and have set a plan to solve them when needed. I have read the proposal a few times, not to figure out what it said, but mainly because it is a very interesting proposal and because I enjoyed the way everything is spelled out well and gives a feeling of reassurance that the team knows what they are doing.   ", "q1r": 5, "q2": "The proposers provided a clear roadmap and timeline for the whole project they intend to implement. Metrics are aligned with the challenge as well as the roadmap and the budget. The community can easily track the progress of the project as the deliverables are clear and traceable.  There is enough clarity in the proposal that assures successful completion of the project.", "q2r": 5, "assessor": "z_assessor_1434", "no_vca": 7, "ne": 0, "ng": 7, "nfo": 0, "vca_o": 1}, {"id": 8128, "q0": "The \"DeFi should be more fun on scaling\" solution proposal addresses the Cardano scaling solutions with comic that goes along with their Miverse (their 3D metaverse game) and creative hub. While the Scaling solutions goal is seeking scaling solutions (in addition  to Hydra) to increase Cardano's scalability. The proposer might understand the challenge brief wrong as the solution supposes to be very technical with scalability topics like Rollups, Sharding, Side Chains, State Channels. Despite the challenge fund is 1 million but if the scale of the solution needs a very big budget but a valid one, it could be consider. However, this proposal does not contain the technicality as required by the challenge. Hence, the goal of proposal is not aligned well with the challenge. ", "q0r": 2, "q1": "The proposer team consists of editor, artists and gaming experts (they are gaming professionals who has sufficient skillset to bring their comic production and creative content platform to reality). The score for feasibility will improve if they would have submitted this proposal under the correct challenge. The proposal should sit in Gamer-on-chain challenge. They would have to provide sufficient reason why they decide to place this proposal under this scaling solution challenge.  Although the budget, timeline and the profile of proposer team are reasonable to carry out the tasks, the score reflects this dilemma of placing the proposal under the right challenge.", "q1r": 3, "q2": "The \"scaling solutions\"term is defined literally by the proposer as any solutions that can scale Cardano. However, this proposal is aiming at technicality that can improve and scale the chain. The proposer has defined challenge brief in different direction and offer the solution that is quite unique and not matched with what the challenge is looking for. Number of creative projects, tokens and games made in miverse has limited impact only to the niche group who adopted the miverse game which wouldn't satisfy what the challenge requires. The proposer team should spend time to read the challenge brief carefully and if unsure reach out to the challenge team who would be a very good contacting point who can define what the challenge entails very well. ", "q2r": 3, "assessor": "z_assessor_653", "no_vca": 5, "ne": 1, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8664, "q0": "Proposal has given a Gamefi model across the Metaverse world with the name Miverse. I tried to read carefully the content of the proposal as well as read the 2 proposals of the proposer in 2 other challenges. And I realized that the proposed solution is not suitable for the challenges (cardano scaling solution). In my opinion, this proposal is probably very very suitable for challenge game on-chained or challenge Dapp. Back to the issue that the solutions need to match this challenge. Scalability solutions are defined as solutions that help to improve the issues of transactions speed, transactions fee or main-chain capacity. My suggestion for the proposer to help match the proposer's proposal to the challenge is that making a proposal on research and development of a \"state channel\" to exclusively serve the Metaverse platform that the proposer is developing. Regarding scaling solutions, state channel is the scaling solution with the fastest transaction processing speed and the cheapest fee for microtransactions and micropayments. It is very suitable for transactions on NFT marketplace or a on-chain games. ", "q0r": 2, "q1": "My assessment might be filtered out or flagged because it is not related to the evaluation criteria of the challenge. But to help proposer can be better and voters can get clearly understand about value of this proposal, I will continue to assess the feasibility of the proposal.Regarding the feasibility of this proposal, perhaps I will assess the feasibility in the case this proposal is submitted in game on-chain challenge or dapps challenge. If this proposal is submitted in the above 2 challenges, the proposal is completely feasible with the details and timelines given in the roadmap. I have not found any errors in the roadmap and \"requested funds\" of the proposal. The project team, proposers are all experienced programmers and those who can write detailed plans like this then are fully qualified to carry out the project or they can control its risks.  ", "q1r": 2, "q2": "Tracking project progress in case of funding. With KPIs and work items have outlined with great details in the excel that provided by the proposer, tracking the project progress is not difficult. Tracking sources can be project website, technical reports. To track the development progress realate with on-chain, blockchain, the proposer can provide a github source for testing.\nAssess what the success of the proposal looks like. It is very difficult because as I have mentioned some reasons above , the proposal does not match the criteria set by the challenge. However, if the proposer can build a solution of a separate payment channel for his platform then the whole project will be very successful and solve the problems set by this challenge.", "q2r": 3, "assessor": "z_assessor_683", "no_vca": 6, "ne": 2, "ng": 4, "nfo": 0, "vca_o": 1}, {"id": 8713, "q0": "With this project, the proposers want to come up with a new Defi model & GameFi ecosystem to create more fun. \nThe new model they will create is expected to have features such as availability for permanent scaling, sustain economic environment, attract more stakeholders to join. They will use Miverse model which has all these features They will use Miverse which is a world of multiple star systems in spacewhere each star system is an independent world with different graphics, different characters and different economy. \nThe main purpose of this proposal in this whole phase is to attract play to entertain players on Miverse. Miverse can inspire, share and connect. This will encourage the audience with some gamification programs to convert them to be adopters to Cardano ecosystem, and this will increase comic lovers, increase the creator in the future, increase the number of investors. The details are very comprehensive and has addressed the challenge effectively. I rated 4 star for this effort.", "q0r": 4, "q1": "Plan presented is detailed and depicts quarterly timelines: In Quarter 1, the 2022 there will be a business model, Miverse is done and brand and strategic vision in 5 to 10 years also done. Quarter 2 to 4 all have detailed roles to be executed. \nThe total budget requested is USD 47250 which is reasonable for the work to be done. The breakdown is detailed with costs of various activities like writer and editor salary cost, publishing and communication cost and production cost. \nThe team of 3 experts are Dat Pharm, Andy Nguyen and Christian Ho, who are all skilled in writing and editing, art, graphics etc. and they can successfully implement the proposal.  My rating is 4.\n", "q1r": 4, "q2": "The road map is clear to track and trace performance. There is executive road map which is based on the team's actual situation. It will help the community to monitor their ability to achieve their goals. The progress is to measure the comic platform, users, release information and guidelines for developers.\nSuccess can be measured in 3 months to produce 12 episodes, attract 5000 views, attract and build community with 300 members. The information provided is sufficient for successful auditing.", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 7, "ne": 1, "ng": 6, "nfo": 0, "vca_o": 1}], "solution": "Instead of following the boring UX design like most of the current DEXs, Miverse will give a distinct model to DeFi & GameFi ecosystem. ", "experience": "Our core members are all entrepreneurs with more than 10 years in the marketing, gaming industry. We also have a development team of 20 developers, and marketing agency with 10 core members to cover this project on the first phases"}