{"id": 381165, "author": "danbonfil", "title": "Latam Community DID Research", "url": "https://cardano.ideascale.com/a/dtd/381165-48088", "category": 26242, "amount": 30300, "description": "El SSI/DID apenas se conoce en LATAM, y mucho menos sus beneficios. Si no hay un empoderamiento de la comunidad o un sentido de pertenencia, la adopción no se producirá.", "funded": 1, "upvotes": 41329002, "downvotes": 18054775, "votes_result": 23274227, "votes_cast": 129, "f6_no_assessments": 3, "f6_rating": 4.111111111111112, "videos": [], "media": [], "f6_assessments": [{"q0": "El problema a resolver aquí se aclara en las primeras líneas: de hecho, en América Latina, la adopción de las identidades descentralizadas es todavía muy baja y es necesario abordar este problema. Lo que se propone aquí es hacer una especie de investigación, para entender las especificaciones del público e impulsar la adopción de DIDs. Creo que es una muy buena manera de promover el uso de esta tecnología, porque no tiene sentido querer \"forzar\" a un determinado grupo a empezar a adoptar dicha tecnología sin que se adapte a sus necesidades. Es muy positivo como el autor de la propuesta define algunos acrónimos que adopta en esta propuesta, de esta manera hay una especie de nivelación entre todos los lectores y los AC y ACV pueden entender mejor lo que se dice. También es un punto positivo ya que el autor especifica qué metodologías de investigación utilizaría (en total, 3), esto nos permite tener una visión más sólida del tipo de actividades que se llevarían a cabo a partir de aquí, y no sólo una comprensión abstracta de la investigación de público. En resumen, creo que sí, es una propuesta que generaría un impacto positivo y relevante en caso de ser financiada, cumpliendo bien los objetivos del reto, beneficiando tanto a los habitantes de América Latina (al crear tecnologías más necesarias para sus necesidades) y aumentaría la adopción de tecnologías del ecosistema Cardano.", "q0r": 5, "q1": "El autor de la propuesta tiene pocos detalles sobre sí mismo. Hubiera sido mejor que incluyera algo de información sobre su formación (sabemos que es del área de economía y política, pero sería importante entender si tiene algún trabajo relacionado con Cardano, cómo conoció el ecosistema, etc.). Sin embargo, es posible resolver estas dudas accediendo a su perfil de linkedin. Sin embargo, en mi opinión, lo ideal es siempre incluir una breve descripción sobre el proponente, una breve historia y centrarse en la relación de esta persona con Cardano + el perfil de linkedin. Está muy bien que tenga varias colaboraciones, el networking es fuerte, se mencionan 4 organizaciones que sin duda aportan mucho valor y confianza al equipo general. Sin embargo, también creo que sería importante saber un poco más sobre las personas involucradas aquí, individualmente. ¿Quién de d-EdTech estaría involucrado, por ejemplo? En cuanto al guión, el autor no proporciona un guión cronológico tradicional, sino que divide el trabajo en 3 partes de aproximadamente 3 meses cada una. Podemos entender lo que se haría en cada una de ellas, lo que constituye una hoja de ruta, en cierto modo, aunque dichas actividades podrían haber sido aún más detalladas. El desglose del presupuesto está disponible según estas partes, y se puede entender de forma clara y directa cómo se debería el dinero solicitado, en qué se utilizaría cada parte y qué porcentaje de cada parte respectiva representa el conjunto. Por último, me gustaría decir que en términos de viabilidad, tenemos una información excelente, aunque no perfecta, que transmite mucha confianza en el equipo, en el proceso y en la financiación solicitada.", "q1r": 4, "q2": "La propuesta es extremadamente auditable. Creo que esto se debe a que el autor divide el trabajo en partes y enumera algunas actividades desarrolladas en cada una de ellas, dándonos la posibilidad de monitorear con precisión el proceso. También dedica dos temas especialmente a la auditabilidad: cómo es el éxito y las métricas y objetivos clave. Hay suficiente material para monitorear este proyecto, tanto el proceso como los resultados. Pero una cosa que pensé aquí: ¿cómo tendremos acceso a los resultados finales de la investigación? El autor afirma en el extracto de métricas/objetivos \"Compartir los conocimientos con los socios y la comunidad para integrar y adaptar los resultados a sus propias necesidades\". ¿A través de qué plataforma? Creo que sería interesante definir mejor esta pregunta. Es súper importante que la comunidad, especialmente los miembros de América Latina, puedan tener acceso a esa información para validarla, así como otros desarrolladores de la tecnología Atala Prism. Además, esta es una pregunta personal, porque el autor nos proporciona, como dije, todo y un poco más de lo que se necesita para auditar este proyecto muy específicamente.", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 26, "ne": 14, "ng": 12, "nfo": 0, "vca_o": 2}, {"q0": "Distributed Identity solutions like Atala are new and the use cases are not clearly understood or appreciated around the world. The project aims to carry out a research project to identify and analyze the requirements for DID from a LATAM perspective. I feel the situation can be extrapolated to any part of the world. Research in any form can produce material that will help in taking better business decisions, therefore this is a viable and a required project. ", "q0r": 4, "q1": "The proper has more than ten years of experience with excellent management education. The idea presented also has a sound rationale, and the proposal will likely be implemented in earnest. ", "q1r": 5, "q2": "Research projects are inherently difficult to audit and measure the quantum of success. The methodology suggested is viable and the team behind it has experience and qualification. The budget also looks reasonable and justified. ", "q2r": 4, "assessor": "z_assessor_46", "no_vca": 18, "ne": 3, "ng": 11, "nfo": 4, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment.\n\nBest,\nDaniel Bonfil"}, {"q0": "This proposal will have a great positive impact on the LATAM community. But, in what language these reports will be delivered is not mentioned. The objective is everyone in LATAM can access and understand these reports clearly.  ", "q0r": 4, "q1": "The budget plan's elements are not described in detail in each post. Is the proposer going to hire team staff? How's the hiring process? Who will be the experiment's target? How many users are needed in those experiments? From how many countries? The proposer doesn't have any blockchain-related background and is not active in the Cardano community. The time frame plan makes sense, but it needs to coordinate several people at once to deliver the project.  And this research can't be one time only, but a continuous project as the DID technology itself will keep developing.", "q1r": 3, "q2": "The reporting period is only every three months. But, to give LATAM communities better insights, it should have other channels to show the progress in detail. Not to mention, the proposer should be active in the Cardano communities to better communicate his works. In that case, the proposer can gain respectful insights from other community members to polish the research even better. ", "q2r": 3, "assessor": "z_assessor_647", "no_vca": 18, "ne": 3, "ng": 10, "nfo": 5, "vca_o": 1, "reply": "Dear CA,\n\nThank you for your honest and clear assessment, with respect to the language, it will be all based in English. The final insights reports available for the community will also be available in Spanish and Portuguese. With respect to the reporting, there is a report update every two months aligned to the key metrics and goals, schedule and budget.\n\nThe research project will be carried by the proposer in its entirety, however I will receive support from one Research Assistant (RA) in Brazil and one in Mexico, along with the feedback and/or suggestions of Atala Prism Pioneers partnerships and mentors.\n\nSince this will be a web-based research carried out in the Crowdsourcing platform Amazon Mechanical Turk, we can access most of the countries in Latin America. However, using the Scientific Method; in order to select the countries and segments properly we need to identify the at least the specialized literature in the region and then start with an initial batch for example with the capital cities in the most populated countries or a general approach for raw findings in all 30+ countries. The experiment is intentionally divided in 2 batches to consider the exploratory analysis first and then continue with the larger research should the results prove to be worthy of further study.\n\nFinally, with respect to the sharing and reporting channels, I am recently starting to become more active in Cardano Community and Discord channels. Along with sharing the insights in Cardano Forums and our Partnerships, we will be feeding the Cardano DID Community which is proposed as a joint effort in our Latam Community DID  proposal where we will display current campaigns, insights and an invitation for others to join and use our standardized approach. https://cardano.ideascale.com/a/dtd/Latam-Community-DID/381158-48088\n\nThank you for your consideration.\nBest,\nDaniel Bonfil"}], "solution": "Comprender las necesidades y los valores con una base estadística para alinear la solución con los intereses y requisitos de la comunidad", "experience": "Msc Economics centrado en Finanzas Cuantitativas, Incentivos y Blockchain\nEnero de 2022: Doctorado en Gestión centrado en Política Comunitaria"}