{"id": 383175, "author": "matifalcone", "title": "Grow ALDEA, Grow Latin America", "url": "https://cardano.ideascale.com/a/dtd/383175-48088", "category": 26242, "amount": 24780, "description": "A pesar de haber creado una comunidad para impulsar la adopción de Cardano en América Latina, el crecimiento masivo y el alcance es aún muy difícil de lograr", "funded": 2, "upvotes": 53148830, "downvotes": 4471579, "votes_result": 48677251, "votes_cast": 200, "f6_no_assessments": 5, "f6_rating": 4.2, "videos": [], "media": [], "f6_assessments": [{"q0": "La idea de esta manera un poco que se prometen y las propuestas de propuestas para aumentar el grupo de actividades llamadas en paralelo, todas las propuestas diseñadas en grandes grupos de actividades, el número de estudiantes con diversidades. El equipo ejemplifica algunos de sus logros hasta el momento y argumenta que necesita financiación para seguir realizando actividades y desarrollando nuevos proyectos. Dan un poco de historia de lo que ha pasado hasta ahora y explican lo que se haría en cada parte del ecosistema (twitter, telegram, instagram y etc). Realmente no puedo definir mi opinión, creo que el impacto será positivo, porque una vez que se creen nuevos proyectos y se perpetúen y mejoren los existentes, el ecosistema de Cardano ciertamente se verá beneficiado. Sin embargo, en relación con América Latina, específicamente, esta relación es un poco abstracta. Es cierto que es un DAO de América Latina, pero no me queda muy claro qué países se trabajan aquí, quiénes son los involucrados, cómo, exactamente, se benefician... No digo que esta propuesta no esté en línea con los objetivos del reto, porque es un grupo latinoamericano que realiza varias actividades que promoverían a Cardano en ese lugar. El problema es precisamente que hay muchas actividades, muchas cosas diferentes que suceden en diferentes plataformas, por lo que no es tan posible entender profundamente cada una de ellas. No puedo visualizar exactamente las ganancias que se obtendrían. Quizás el impacto sería más claro si, además de enumerar las actividades que se llevan a cabo en cada plataforma, los proponentes explicaran qué grupos de personas participarían y cómo se beneficiarían individualmente. En general, hay mucha información que es confusa, en mi opinión, y no genera una comprensión completa del impacto que se generaría para el continente y para Cardano.", "q0r": 3, "q1": "Sobre el equipo, creo que durante la descripción de la propuesta no queda muy claro quiénes son y qué actividades desarrollan. Sin embargo, al final, adjuntan perfiles de linkedin, pero la mejor manera de conocer y entender a cada miembro fue a través de la página web proporcionada (https://www.aldea-dao.org/about-eng.html). Allí tenemos información individualizada, fotos y una breve descripción de cada miembro del equipo, que junto con los perfiles de linkedin, generan un gran y profundo conocimiento del equipo, asegurando así la confianza en su trabajo. Sin embargo, sería importante, en mi opinión, entender quién haría exactamente qué. Como mencioné en Impacto, es una propuesta que engloba varias cosas: actividades variadas y diversificadas. ¿Qué haría cada uno de estos miembros? Por ejemplo, en la parte de Youtube, prometen lo siguiente \"crear sencillos vídeos educativos animados que expliquen los principales conceptos de blockchain y Cardano\". ¿Quién lo haría? Como en el ejemplo citado, podrían haber informado de quiénes estarían pendientes de cada una de las otras tareas. De esta manera, tendríamos un conocimiento completo de quién haría qué, lo que generaría una percepción más organizada del proceso. Y hablando de proceso, no se nos proporciona una hoja de ruta detallada. De nuevo, digo: como son tantas actividades y tan diferentes, sería importante organizar algunas etapas a realizar. Por ejemplo, fase 1: centrada en youtube y linkedin (hipotéticamente). La persona \"X\" haría la actividad \"Y\" para obtener el resultado \"Z\". Lo que tenemos son los resultados esperados para 3, 6 y 12 meses (hablaré más de esto en auditabilidad), pero eso no es una explicación del proceso. Esa parte deja que desear, por desgracia. Siempre es fundamental entender las partes que componen el todo, sobre todo cuando este todo es tan complejo, como es el caso. Y por último, hablando de la financiación, creo que esta parte fue muy buena, comparten cómo se utilizaría el dinero según las plataformas. Por ejemplo, sabemos cuánto se necesitará para promover las actividades de \"Twitter, Instagram y Telegram\", y por qué se requiere esa cantidad. Del mismo modo, se entiende cómo se utilizarían las otras parcelas. En definitiva, creo que en este tema lo que más se necesitaba era la presencia de un guión muy detallado. Por lo demás, tenemos mucha confianza en el equipo (aunque se podría dirigir mejor quién haría qué) y un gran conocimiento del presupuesto.", "q1r": 4, "q2": "Creo que es un proyecto muy auditable. Como dicen los propios proponentes: \"la métrica clave aquí es cuánto crece la DAO y la participación de la comunidad en sus futuras iteraciones\". Hay que monitorear cómo se involucra el público en las distintas redes sociales y si, como resultado, nuevos miembros latinoamericanos entran y permanecen activos en el ecosistema de Cardano. Mi sugerencia es que sea el propio equipo el que se encargue de recopilar y analizar dichos datos; por supuesto, estos datos deben ser difundidos de forma sencilla y directa al resto de la comunidad Cardano. Se podría hacer alguna infografía, alguna presentación visual que recogiera los datos de un determinado periodo de tiempo (mensualmente estaría muy bien, creo), y dichos gráficos deberían ser enviados a la comunidad, bien a través de la participación en un Ayuntamiento o bien se podría seleccionar a algunos miembros de la comunidad para promover dicho seguimiento. Sería interesante que los proponentes crearan una hoja de ruta detallada con las fases a completar, orientada en el tiempo, para que pudiéramos analizar el proceso y no sólo los resultados. Como ya es un grupo muy activo y experimentado, creo que son capaces de recoger la información prometida (datos de los medios de comunicación), crear nuevas facetas cualitativas que aumenten la calidad de este seguimiento y establecer un puente entre ellos y la comunidad, para difundir los resultados.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 25, "ne": 14, "ng": 10, "nfo": 1, "vca_o": 2}, {"q0": "The proposal is within the objectives of the challenge. It is important to have financial resources to make ourselves known as a community. The problem that ALDEA has not yet defined is what it wants to do as DAO. If you are going to advertise something, you must have that something.\r\nI can contribute an idea, maybe you could produce and finance a documentary about blockchain and CARDANO or its history or something similar, or a short film. It would be excellent publicity.", "q0r": 4, "q1": "The experience is proven and we can meet the people behind the proposal. I believe that creating broadcast content would help us to make our niche bigger and bigger in LatAm. Clearly, if the objectives are achieved, it would generate an impact in the community in general, attracting new participants.\r\nThe project is reasonable, but it is important that we know the productions, perhaps in their next \"Iteration\" they will decide to create a specific site for \"grow aldea\" where we can know the progress of their productions.", "q1r": 5, "q2": "The project is perfectly auditable, both during and at the end of the projected term. The team members are well-known people in the community and participated in Fund 5.\r\nThey have a website and a community, which we must take care of and make it grow.\r\nI could see that on your website they only mention Fund5 ....., this interesting proposal must have a place in ALDEA.\r\nGreetings", "q2r": 5, "assessor": "z_assessor_743", "no_vca": 15, "ne": 2, "ng": 11, "nfo": 2, "vca_o": 1}, {"q0": "The proposal addresses correctly the challenge, given though ALDEA's growth in social media will potentially make Cardano's latin american community grow as well, especially if they generate quality content about Cardano's ecosystem in practically all social medias, as they're planning to do.\r\nALDEA's marketing onboarding proposal could potentially grow extraordinarily the Cardano's hispanic community in social medias, and attract a lof of newcomers to its ecosystem, which is lacking of good-quality content through various social media platforms for the time being, and \r\nI think there's a demand of such content.\r\n", "q0r": 5, "q1": "Regarding team experience, ALDEA's core team have a wide range of IT and business expertise, and has shown a long-term community commitment with Cardano's project. However, it's not completely clear to me how each participant mentioned in the proposal will get involved in each role, and what are the professionals that they'll onboard for these marketing campaigns across various social medias aside from the CORE team (but I imagine they'll reach out to community members once the project get funded).\r\nApart from that, the plan details are well described and there's a clear road to follow for how approach each social media.", "q1r": 4, "q2": "Budget breakdown is well detailed, and success for the project is described through a 3-6-12 months period. KPIs are also displayed by the team, and it'll be clear if they succeed or not, given that all the platforms in which they'll promote the DAO have built-in metrics and analytics to measure its growth. So the auditability part is in place in my opinion.", "q2r": 5, "assessor": "z_assessor_833", "no_vca": 16, "ne": 5, "ng": 10, "nfo": 1, "vca_o": 1}, {"q0": "While the general idea behind this proposal is well aligned with the challenge metrics and the plan is well described, I feel like this entire project is a bit too broad and tries to cover too many areas without going in-depth into any of its branches. I cannot find an exact suggestion at the moment, but I do commend this proposal, and I hope the team will be able to find the core that will make their project unique.", "q0r": 4, "q1": "The team have taken the time and care to craft this proposal. From the details of the plan, one can tell that this is indeed a long-term project that has already come a long way. This, coupled with the team’s prior experience and skills lead me to conclude that this proposal can be successfully implemented.", "q1r": 5, "q2": "The proposal has carefully included all the required self-assessment checkmarks and detailed each sufficiently. The budget is sensible and comprehensive. While the metrics are clear and easy to track, as the proposers mentioned, more important is the quality, not quantity of their metrics and that will be harder to assess, but not impossible.\nAs such, I can safely presume that the project can be easily and successfully tracked by the community.", "q2r": 4, "assessor": "z_assessor_20", "no_vca": 24, "ne": 2, "ng": 21, "nfo": 1, "vca_o": 1}, {"q0": "The concept of using a DAO to drive cardano adoption in Latin America might seem like a great Idea and if implemented well can Impact the ecosystem. The Team is already collaborating with other SPO and Developers in Latin America which shows their passion towards building a vibrant community hub for that region. I could see how their effort can be used to  onboard new users to the cardano ecosystem. In my opinion , I believe the problem statement and the solution can be improved  to capture and articulate  the Idea very well.  The problem statement recognises that there is an ongoing effort in solving the problem , one would expect the proposed solution to bring in a different approach to solve the same problem. I believe the concept of DAO is that different approach ,  I am Assessing the Idea itself and not how it is structured .", "q0r": 4, "q1": "The Team plans  a 12-months Communications and Inbound Marketing across major social networks with great details in each of the networks. What is lacking is an actionable step by step roadmap to achieve this plan. How many weekly posts to expect in each of the social media? How many Youtube videos and medium blog posts?\nThere is identifying information about the members of the team and experience , I have checked the team website as well for other information , I believe the Team has what it takes to complete this project.\nThe expected public launch date is defined. In general , it's a good Idea and the plan could be improved to increase the feasibility.\n", "q1r": 4, "q2": "The definition of success is defined for 3 ,6 and 12 months. Using quantitative metrics like specific number of followers & subscribers  in 3 months would have greatly improved auditability.\nit is not clear which deliverables will be delivered in the 3, 6 and 12 month periods.\nI like the strategy and the 12 month marketing plan and would also love to see risk evaluation.\n\n", "q2r": 3, "assessor": "z_assessor_430", "no_vca": 20, "ne": 1, "ng": 18, "nfo": 1, "vca_o": 1}], "solution": "Con un agresivo plan de comunicación para llegar a las plataformas de los medios de comunicación, ALDEA atraerá a los principales actores del ecosistema y estará preparada para el futuro.", "experience": "Equipo central de ALDEA, FALCO SPO y Comunidad ALDEA"}