{"id": 384181, "author": "gonzalocamps", "title": "Test DAO at Latam Public Spaces", "url": "https://cardano.ideascale.com/a/dtd/384181-48088", "category": 26242, "amount": 24000, "description": "La adopción de Cardano en LATAM evoluciona lentamente dado el escaso conocimiento y la insuficiente tangibilidad de sus usos para el ciudadano medio.", "funded": 1, "upvotes": 28370420, "downvotes": 22929252, "votes_result": 5441168, "votes_cast": 120, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "La idea es muy interesante y está muy en línea con los objetivos del desafío, ya que busca instalar monitores digitales en lugares de amplia circulación (ubicados en Latinoamérica), a través de los cuales se difundirían contenidos relevantes para el ecosistema Cardano. Es muy bueno que el equipo ya haya lanzado la idea en f6 y haya recibido financiamiento, esto transmite confianza en su capacidad de ejecutarla con éxito y también en el proceso mismo, es decir, la idea ha sido previamente evaluada y aprobada por la comunidad, por lo que no veo por qué su calidad de contenido y sus necesidades han decaído. También es muy positivo cómo el equipo proporcionó el enlace a la propuesta en los antecedentes anteriores. Creo que esta forma de publicidad es muy eficiente para llegar a las personas que no tienen contacto con el ecosistema de Cardano, porque es difícil llamar la atención de la gente y convencerla de que busque más información así de primeras. Creo que vale más la pena dirigirse a ellos que promover campañas que quizás puedan persuadir a la gente y hacer encuestas y orientarse hacia nuestra blockchain. Además, hay personas que no tienen conocidos que ya participan en el mundo criptográfico; para llegar a este público, en particular, es más eficiente promover este tipo de publicidad \"a la antigua\" que planificar eventos, dApp que buscan atraer, etc. que probablemente ni siquiera conocerían. Así que creo que es una idea que puede beneficiar mucho a la población local de América Latina, ya que conocerían las tecnologías relevantes para el ecosistema Cardano, y obviamente el propio blockchain ya que se sumaría gente nueva.", "q0r": 5, "q1": "El guión es muy rico, desglosan las actividades en base a los trimestres, aunque siempre pienso que es mejor que los autores hagan una división temporal más pequeña (por ejemplo, mensual), no creo que la división trimestral fuera un problema aquí. Creo que esto se debe a que hay muchos detalles en cada uno de los trimestres, se enumeran muchas actividades, de modo que tenemos una rica comprensión de lo que se está haciendo. Sin embargo, en cuanto al desglose financiero, creo que podría haber sido más detallado. El equipo informa de la cantidad de dinero que se necesitaría cada trimestre para llevar a cabo las actividades, pero sería más interesante que este dinero se explicara individualmente de cada actividad. De esta manera, entenderíamos al 100% cómo se utilizaría la financiación solicitada. No es tan malo, pero podría ser aún mejor en mi opinión. Y por último, en cuanto al equipo, creo que el nivel de detalle es bastante satisfactorio, conocemos los nombres de cada miembro del equipo, sus principales funciones profesionales y los enlaces a sus perfiles de linkedin, lo que nos da la posibilidad de conocerlos. más profundamente. Es fundamental contar con un miembro (Gon) especializado en blockchain, para garantizar la seguridad técnica en tecnologías relevantes para el ecosistema Cardano. La única parte que creo que debería mejorarse es la explicación financiera.", "q1r": 4, "q2": "Lamentablemente, el equipo no reserva un espacio en la propuesta específicamente para medir los KPI y establecer los riesgos del proyecto. Esto nos daría un material totalmente enfocado a la auditabilidad, ya que sabríamos exactamente qué resultados se esperan en conjunto para el proyecto, en la fase en la que se encuentra. Sin embargo, al aportar muchos detalles en el guión, es posible verificar si las actividades propuestas se llevan a cabo realmente; esta es la forma que tenemos de controlar la propuesta, haciéndola auditable. Sería interesante seleccionar algunos participantes del ecosistema Cardano para acompañar el proyecto, preferiblemente de los países seleccionados para recibir a los monitores. Podrían tener un contacto directo más constante con el equipo y comprobar que las actividades se están llevando a cabo según lo previsto. Esta retroalimentación tendría que ser transmitida al resto de la comunidad, esto podría ser hecho por el propio equipo o por las personas que monitorean el proceso, a través de informes escritos o a través de la participación de un Town Hall. Creo que sí, que este tema está cubierto aunque no se haya hecho tanto hincapié en él durante el detalle de la propuesta.", "q2r": 4, "assessor": "z_assessor_57", "no_vca": 15, "ne": 11, "ng": 3, "nfo": 1, "vca_o": 2}, {"q0": "First of all, i note that this proposal brief is quite long and voters will struggle to read through all of it when there's hundreds of proposals to chose from. So this would benefit from a more succinct brief. The specific problem this proposal is tackling is the lack of access by local entities to advertising platforms, which is identified further down the proposal but is not well reflected in the \"Problem Statement\", again making it difficult for voters to quickly grasp the purpose of this proposal. This proposal fits well within the challenge and even though it's focused in Chile the proposers demonstrate the ambition to expand further. As a local activity with small budget, this is off course will initially only have a small impact, but testing the approach at smaller scale first makes sense and sets a good starting.", "q0r": 3, "q1": "The proposal seems to be backed by an experienced and motivated team. The experience evidence is available for most users, except for Ian (engineer) and Matias (UX/UI desing). Given that a lot of the project is reliant on design/manufacturing and UI/UX design it would have been relevant to demonstrate experience of these two members. A timetable for implementation is presented, with the objectives at each step well explained and with realistic timings. The only worry i have from the plan is the requirement to design and manufacture your own OOH displays, which seems like a lengthy process, a bit more details in this area would be re-assuring. The budget breakdown is a bit lacking, with only estimates for each quarter presented, rather then costs by activity and man hours required. The proposal is also lacking in description of technical details in some parts e.g. you mention that you will provide a \"easy to use platform\", but what will this platform be based on ?", "q1r": 4, "q2": "A number of relevant and measurable milestones for each quarter are presented as well as relevant KPI's such as number of users added and OOH displays activated. These will allow the community to audit the progress and success of the proposal. ", "q2r": 5, "assessor": "z_assessor_125", "no_vca": 24, "ne": 5, "ng": 17, "nfo": 2, "vca_o": 1}, {"q0": "I'm giving this project a 5 star rating because I feel this project fits perfectly with growing (testing) DAOs in Latam places. Having a digital display in public areas is a great way to create public awareness, and by adopting a DOA structure, local advertising could be more accessible to smaller, mid-sized businesses where it's needed to most...    ", "q0r": 5, "q1": "I've giving this area a 4 star rating, while the team has grown from fund 6, I would've liked to have scene a little more variety in the designs to help appeal for a wider audience. I believe the talent and motivation already exist within the team, but the appeal seems to be directed more towards an underground crowd, for mass adoption, there needs to be appeal for a wide variety of people...    ", "q1r": 4, "q2": "In the category I strongly believe their roadmap will be easy to follow to be able to see their progress of success. I think their expectations and what they hope to achieve are very detailed, I would've liked to have seen a timeline when different quotes would be available for displays, but other than that, this project should be esy to follow... ", "q2r": 5, "assessor": "z_assessor_418", "no_vca": 17, "ne": 2, "ng": 13, "nfo": 2, "vca_o": 1}, {"q0": "Proposers have already received funding in F6 and going around the web and documents I would say that this proposal addresses the challenge but I would hesitate if really effectively. \r\nMy point is that the word in the title 'Test...' brings no responsibility for the result. I would rather expect a shorter project but showing as a result vivid community-integrated around Cardano. \r\nThis 'Test' might be indefinite in time with a very vague final result.\r\nI really appreciate the high-caliber individuals involved but this makes me, even more, expecting a revolutionary project.\r\n", "q0r": 3, "q1": "In short words - Yes. These Team members guarantee that the proposal will be implemented successfully.", "q1r": 4, "q2": "The information provided is barely sufficient to audit the progress and the success of the proposal. \r\nThe problem is that it looks like proposers at the moment of submitting the proposal had no detailed plan to achieve the result shown as a measure of success. \r\nIt would be very interesting to see the realistic plan and the measures of success for each three-month period.", "q2r": 3, "assessor": "z_assessor_527", "no_vca": 15, "ne": 1, "ng": 11, "nfo": 3, "vca_o": 1}], "solution": "Los ciudadanos, las comunidades y las empresas locales pueden mostrar sus contenidos e iniciativas a los espacios públicos a través de las pantallas digitales DAO-OOH.", "experience": "Somos latinos que hemos explorado y probado este modelo durante dos años, en Chile.\nF6 Catalyst Community nos financió para las pruebas iniciales."}