{"id": 384295, "author": "joseiadicicco", "title": "Platform for Cardano Solar Farms", "url": "https://cardano.ideascale.com/a/dtd/384295-48088", "category": 26242, "amount": 14400, "description": "San Juan es una de las zonas más pobres de Argentina LATAM, con la mayor exposición al sol, la falta de agua y energía conducen a las malas condiciones de vida.", "funded": 2, "upvotes": 102884538, "downvotes": 2645246, "votes_result": 100239292, "votes_cast": 310, "f6_no_assessments": 6, "f6_rating": 4.555555555555555, "videos": [], "media": [], "f6_assessments": [{"q0": "Creo que esta propuesta es de gran valor y está muy bien alineada con los objetivos del reto. La idea es crear una granja de energía solar, a través de la cual los inversores puedan utilizar tokens para invertir en el proyecto, a través de la blockchain de Cardano. Con esto, se beneficiaría tanto el continente, ya que el proyecto trabajaría con energía limpia y renovable, y utilizando características ya presentes en la ciudad elegida, que tiene una alta proyección de luz solar; y también el ecosistema de Cardano, ya que el enfoque sería invertir a través de tokens, lo que aumentaría el número de nativos digitales en circulación y promovería una mayor adopción de Cardano. Es un poco preocupante que la financiación que se pide aquí sólo cubra la primera fase de este proyecto, pero es comprensible, ya que la generación de energía siempre es muy cara. Así que creo que a pesar de este detalle, la comunidad debería analizar cuidadosamente esta propuesta y considerar el voto, creo que invertir en energías ecológicamente correctas también dialoga con los objetivos generales de Cardano, en términos de promover un futuro mejor para todos.", "q0r": 5, "q1": "El equipo elabora un guión dividiendo el tiempo total de 12 semanas en mitades; en la primera mitad, detallan exactamente cuáles serían sus objetivos y qué actividades serían necesarias para alcanzarlos, cronológicamente. A esta información le sigue el número de horas trabajadas (240 horas) y la remuneración de las mismas. También afirman que dos personas trabajarían en este primer paso: sería interesante presentar quiénes eran. Lo mismo ocurre en el tiempo restante de la semana 6 a la 12; sabemos qué pasaría, cuántas personas trabajarían y su remuneración. Esta forma de organizar el proyecto me pareció muy sencilla y eficaz, entendemos exactamente lo que se espera, lo que nos da la posibilidad de visualizar el proceso con mucha precisión. Además, los autores también hablan de lo que ocurriría más adelante, demostrando que tienen una visión completa del proyecto, aunque la financiación solicitada aquí sólo corresponde a la primera fase. Por último, en cuanto al equipo, detallan muy bien quiénes son, sus nombres, funciones en el proyecto, incluyen una breve pero suficiente descripción de lo que han hecho hasta ahora. Es muy positivo que, además de sus profesiones tradicionales, tengan un sólido contacto con el ecosistema Cardano, a través del desarrollo de pools y demás. De este modo, se transmite mucha confianza en el equipo y en su capacidad para ejecutar con éxito el proyecto.", "q1r": 5, "q2": "La auditabilidad aquí es buena, pero no tanto como los puntos analizados anteriormente. El equipo nos muestra cuáles serían los resultados esperados en los períodos de 3, 6 y 12 meses. Pero, al tratarse de un proyecto algo complejo, sería importante tener más detalles. Cada una de estas métricas es bastante simple, corta. Sería más interesante que hicieran un seguimiento semanal, es decir, que elaboraran 12 temas demostrando cuáles serían los objetivos específicos de cada semana de trabajo. Podrían realizar reuniones mensuales con la comunidad de Cardano, para discutir cómo se está llevando a cabo el proyecto, en dichas reuniones se podrían mostrar informes con datos organizados sobre los resultados de ese mes. Como es un proyecto muy específico y diferente, creo que sería más apropiado que el propio equipo trajera este feedback que eligiéramos a alguien de la comunidad para acompañar este proyecto... A no ser que fuera una persona con experiencia en energías renovables, ¡eso sería bastante interesante! De todos modos, creo que sí, el equipo nos proporciona medios para supervisar el progreso del proyecto, pero son insuficientes para realizar una auditoría de calidad.", "q2r": 3, "assessor": "z_assessor_57", "no_vca": 18, "ne": 12, "ng": 5, "nfo": 1, "vca_o": 2}, {"q0": "I see this proposal as having a lot of potential in bringing value, not only to the local residents of San Juan, Argentina, but also to other places around the world in need of the invaluable resource that is electricity, and as such it will bring value to the entire Cardano ecosystem.\r\nAdding a successful tokenomics system to the building and usage of solar panels is a great idea and a high likelihood of bridging the gap between blockchain investors and residents of the small communities where these investments will be made.", "q0r": 5, "q1": "The team already has experience in the solar energy domain, local knowledge, from being residents of Argentina and as stake pool operators they have knowledge and investment in the Cardano blockchain. All these aspects give a high chance of success to the proposal, not just from the knowledge and skills they possess but also from their financial and personal investment into the well being of the Argentinian and Cardano community. ", "q1r": 5, "q2": "Their timeline, KPIs and budget are sensible. They present the knowledge they have, but also the one they do not. The budget for this first phase of the project is to set up a reliable foundation for a project that could be used all around the world. Research into the necessary roadmap for setting up a solar farm and research for a tokenomics system, that will be the one incentivising investors from all over the world to participate in this endeavour on the Cardano blockchain.\r\nThe project should be easy to evaluate for progress.", "q2r": 5, "assessor": "z_assessor_20", "no_vca": 19, "ne": 6, "ng": 13, "nfo": 0, "vca_o": 1}, {"q0": "The proposal effectively addresses the challenge by onboarding new cardano users in latin america through a green energy program. The proposers will develop a platform for worldwide investment in green energy in latin america. I believe that this model can be incredibly effective because it encourages latin american citizens to get into green energy and blockchain (specifically cardano), while also providing an investment opportunity for individuals abroad. Thus, this project has the potential to greatly benefit people living in latin america by providing more income to small solar farm owners and also decrease pollution by generating electricity through renewable means. (score given: 5)", "q0r": 5, "q1": "The proposers both have lots of experience with cardano and the energy sector, both of which will hugely important when implementing this project. Given the experience information they provided, I believe that they will successfully implement the project.\r\n\r\nThe proposers' plan to visit energy farms in the San Juan region and then develop their business model and tokenomics seems achievable in the given timeframe. They listed a lot of good detail that indicates that the proposers will be dedicated to making this project a reality. Additionally, they have listed a good budget with strong reasoning for the exact amount requested. Overall, I believe that this first phase of the project will be successful. (score given: 5)", "q1r": 5, "q2": "The proposers provided sufficient information to audit the progress and success of the proposal. They have listed the key milestones for each period of the project (roughly 3 month chunks). The final report from the first phase can also be a good way for the cardano community to check on the progress of the proposal. I would, however, have appreciated some more details on other key performance indicators that the proposers can keep the community updated with, such as number of solar farms potentially involved with the project and number of investors. These are metrics that can potentially be added in the future as the project develops. Also, the proposers should clarify how they will keep the cardano community updated (what means of communication) and how frequently they will submit reports to inform the community. These are minor concerns, but addressing them would take the proposal from great to amazing. (score given: 5)", "q2r": 5, "assessor": "z_assessor_310", "no_vca": 20, "ne": 10, "ng": 10, "nfo": 0, "vca_o": 1}, {"q0": "The problem statement being San Juan which is considered one the poorest areas in Argentina which has highest sunlight exposure but lacks good living conditions. In the proposal the proposer will be developing a Platform which allows investor to participate in the project by offering a GREEN token. This GREEN token represents watts of energy. By utilizing the local weather condition to produce electric energy which would help improve local living conditions and also helps to stop climate change. The proposal addresses the problem", "q0r": 5, "q1": "The proposer have provided a complete detailed plan each with timelines and also targets to achieve them within a time period. The proposer and their team based on details provided has required experience enough to implement the proposal successfully. Therefore it's very much possible this proposal will executed successfully  ", "q1r": 5, "q2": "The proposer has provided a detailed phases that they will be carrying out and each with a timeline this will be very helpful to track the progress and they have given a detailed budget breakdown required to carryout each of the phases hence the information given should be enough to audit the development and success of the proposal.", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 19, "ne": 3, "ng": 14, "nfo": 2, "vca_o": 1}, {"q0": "The proposal is laudable aiming to solve the weather challenges in San Juan (Argentina) through the creation of a platform that will allow investors to participate in the project through GREEN network. The proposal mentioned that SanJuan has the longest sunshine hours and the best solar production, although there are already some solar farm in place, they are not available for small investors to participate via blockchain. Their aim is to setup a model called Cardano blockchain solar farm . The challenge is addressed effectively.", "q0r": 4, "q1": "The team is made up of 2 experts who have SPO (ADA ONE Pool), more than 20 years experience, telecommunication projects, both of them organized Cardano Summit 2021, and they have the capability to implement the project successfully. The plan mentioned 3 phases of work schedule for the project.", "q1r": 4, "q2": "The road map is 12 months timeline for the project and the budget breakdown is comprehensive for effective auditing .", "q2r": 4, "assessor": "z_assessor_688", "no_vca": 17, "ne": 1, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "I believe this proposal can answer the need of energy for the residents in Argentina LATAM. However, I would think that the proposal should spell out the responsibility of operating and maintaining the solar farm. ", "q0r": 4, "q1": "The proposal lays out their detailed plans of actions for the first phase and it also lists out the pointers for the second and third phases.  I have confidence that with the team members experience and expertise, the proposal can be implemented with success. However I failed to see their plan as to how to reach out the investors.\r\n", "q1r": 4, "q2": "I believe there should be also a measure of success as to the amount of investment gathered for to meet the budget of setting up a solar farm.  That I did not find it in the proposal. ", "q2r": 4, "assessor": "z_assessor_968", "no_vca": 26, "ne": 2, "ng": 12, "nfo": 12, "vca_o": 1}], "solution": "Crear una plataforma que permita a los inversores participar en el proyecto a través del token VERDE (representa X vatios de energía) en la red Cardano", "experience": "Especialista en informática, SPO, telecomunicaciones, energía solar, infraestructuras, ingeniería y sistemas de gestión de redes."}