{"id": 381342, "author": "shirogat", "title": "Empower 400 Marginalized Girls", "url": "https://cardano.ideascale.com/a/dtd/381342-48088", "category": 26244, "amount": 30000, "description": "Essas meninas e mulheres jovens têm chances de vida limitadas devido ao casamento forçado precoce, trabalho infantil e violência baseada em gênero, entre outras questões", "funded": 0, "upvotes": 18139651, "downvotes": 19006811, "votes_result": 867160, "votes_cast": 108, "f6_no_assessments": 7, "f6_rating": 2.9047619047619047, "videos": [], "media": [], "f6_assessments": [{"q0": "Esta proposta visa criar um centro de divulgação da educação digital, focalizando 400 meninas marginalizadas na África para serem educadas em programação funcional e serem expostas à cadeia Cardano Blockchain, a fim de mudar sua situação de vida. Os objetivos e o produto final deste projeto têm uma profunda base humanitária, visando criar oportunidades iguais para pessoas ao redor do mundo que não têm os mesmos privilégios que muitas outras. Um conceito que está (na minha experiência da Comunidade Cardano) muito alinhado com os valores centrais do Cardano. A declaração do problema se concentra claramente em um conjunto de 400 indivíduos marginalizados e visa dar-lhes educação, potencialmente proporcionando-lhes um futuro melhor. O que isso implica é um pouco obscuro na descrição da proposta, apesar de algumas partes serem muito tangíveis. Por exemplo, fornecendo internet, material educacional, professores, a criação de um centro digital é cristalina. Mas o currículo e o que esta educação inclui poderia ser mais bem especificado. Como professor, eu adoraria ter visto um exemplo de currículo incluído na descrição. No momento, não tenho certeza se os objetivos da educação são ensinar aos participantes como aprender programação funcional, ou como escrever uma série de desenhos animados. Isto seria descrito de maneira ideal no plano detalhado, a fim de aumentar a compreensibilidade da proposta e do projeto. Em geral, não concordo nem discordo que esta proposta aborde efetivamente o desafio.", "q0r": 3, "q1": "Seria muito benéfico para a proposta ter algumas informações sobre a equipe central dentro da proposta. Se o ministério da juventude do governo do Quênia estiver envolvido (junto com o assessor de educação em TIC para o programa de desafio da educação de meninas), ele fala de credibilidade e competência substanciais no acompanhamento do projeto até a sua conclusão, como pretendido. Infelizmente, não há evidências que possam verificar ainda mais essas afirmações na proposta. Pelo menos em relação aos membros da equipe principal, seria bom ver alguns links fornecidos (perfis LinkedIn, projetos afiliados anteriores, etc.) que poderiam verificar a competência da equipe. Incluído nos anexos está uma excelente tabela da alocação orçamentária, que é uma das melhores que eu vi até agora nos dois últimos fundos como Conselheiro Comunitário. É razoável e detalhado. Explicar os detalhes do currículo e a educação propriamente dita também proporcionaria a clareza necessária (para que possamos entender melhor o projeto) na proposta (como mencionado em \"impacto\"). Eu não concordo nem discordo que esta proposta será implementada com sucesso.", "q1r": 3, "q2": "A proposta inclui um roteiro claro na forma de uma excelente folha (fornecida nos anexos) e mesmo que eu tivesse gostado de um pouco mais de detalhes nos diferentes marcos, ela diz ao leitor o que pretende alcançar durante que período de tempo. Há vários KPIs apresentados de forma estruturada e cronológica, mas aqui também seria benéfico fornecer mais detalhes sobre cada KPI. Ao acrescentar alguns números, possivelmente aumentaria a clareza da proposta. Por exemplo, o projeto está visando as mesmas 400 pessoas? Nesse caso, seria mais claro apresentar cada medida de sucesso como parte dos marcos do roteiro, em vez de sob os KPIs. Posso estar interpretando mal as informações, mas para mim não está claro se o projeto visa encontrar 400 novos participantes após cada marco do KPI. Se a proposta também incluísse um pequeno texto sobre alguns desafios potenciais que poderiam surgir durante o desenvolvimento deste projeto, aumentaria a confiança que eu, como Conselheiro Comunitário, tenho na credibilidade e competência das equipes para levar este projeto adiante. Além disso, poderia haver alguns links para canais sociais incluídos para que a comunidade pudesse acompanhar o progresso do projeto. Devido à falta de informações fornecidas, discordo que a proposta me forneça informações suficientes para avaliar o progresso na realização de seus objetivos declarados.", "q2r": 2, "assessor": "z_assessor_349", "no_vca": 16, "ne": 10, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "Many girls in the world today can't follow their dreams and are forced into early marriage, child labor, or suffer from gender-based violence. In order to address this problem, the team intends to establish model schools in marginalized areas of Kenya to provide functional programming training. The proposed goal and success metrics seem loosely aligned with this challenge, as the proposal is focused on increasing the odds of this group of girls achieving blockchain-related employment.\r\n", "q0r": 4, "q1": "The proposal provides details on how the program would work, as well as some key aspects to understand its objectives. However, the information required to make a full assessment of the feasibility aspect of the project is still lacking. The proposal leader is described briefly in terms of his or her skills and experience, but no references are provided to verify these statements. The team has attached the budget, and after evaluating the items included, I must admit that I believe most of them to be appropriate except perhaps for the Plutus programmer. It is stated that $2600 will be allocated, but I am not sure what the role of the person will be. Is the person responsible for training the girls directly? If so, how much does each hour of training cost? Another aspect that I have missed here is the description of the risks that may threaten the successful implementation of this proposal. For instance, what is the expected dropout rate? And what measures is the team contemplating to reduce this risk?\r\n", "q1r": 3, "q2": "The success metrics provided seem appropriate to the team's expectations (even though they are not conforming to the criteria for the challenge as noted in the impact section). In addition, the team has attached a document providing the necessary details for the implementation of this proposal, however, it appears to be an estimate from a previous proposal or project since they suggest a date between May and October 2021 for implementation. Based on the assumptions that the same logic of timing is followed from the date of the allocation of funds, the actions and times assigned seem appropriate. \r\n", "q2r": 4, "assessor": "z_assessor_130", "no_vca": 22, "ne": 10, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "The proposal clearly addresses the problem being young women in Kenya having limited life due to forced early marriage and other issues. The proposal is trying to resolve the issue by creating a digital education outreach hub that would support 400 marginalized girls in Kenya by providing training. The proposal does address the issue.\r\n", "q0r": 5, "q1": "The proposer appears to be well versed with the requirements and has the essential expertise to make this proposal happen.\r\nThe proposal consists of a rough plan and benefits of this proposal but a detailed plan with a roadmap would have helped to increase the chances of successful implementation of this proposal.", "q1r": 4, "q2": "The proposal does come up with the possible KPIs that auditors can use to track the progress of the proposal but without a complete roadmap with a timeline and without a definition of success. It would be hard to track the development and the success of the proposal. Even a detailed fund allocation would have helped the auditors.", "q2r": 2, "assessor": "z_assessor_317", "no_vca": 14, "ne": 0, "ng": 11, "nfo": 3, "vca_o": 1}, {"q0": "Even though the proposal is coping with a relevant problem, it is not placed in the right challenge. Therefore, it does not address the issues within the challenge.", "q0r": 1, "q1": "The budget has no clarity and the proposer has given not enough info about relevant experience. Please consider detailing it accordingly to the proposer's guidelines: https://docs.google.com/document/d/1oE_cnP0gksdAanXV4w5DYaDNp_tbYEvyHhTUG4HYZ3Q/edit ", "q1r": 1, "q2": "There are KPIs, but no roadmaps or any other means to audit the project execution. It's advisable bringing them in the proposal.", "q2r": 1, "assessor": "z_assessor_386", "no_vca": 19, "ne": 0, "ng": 12, "nfo": 7, "vca_o": 1}, {"q0": "The idea of ​​the challenge is very good, to train young women from pastoral communities in Kenya with classes on technology issues, in order to generate a better insertion in the job market and so on. What worries me a little is that the theory is perfect, but I don't really understand how that would be done in practice. It is not detailed in the proposal things like: what content of these workshops; in which schools (or universities, but I believe schools - which would also be a problem, because this type of teaching is a little difficult and advanced for those in elementary and high school. who are already dependent on the world of technologies, at least ); who would give these classes, how would the training of professionals be carried out; how often these classes would take place; how success would be measured, that is, how common taught women get inserted into the Cardano ecosystem, so as to measure the proposed benefits for the blockchain... Too many details. I'm also a little worried because it's such an ambitious idea to introduce the blockchain into a community that, unfortunately, gives so few opportunities to study and work for women. Maybe it would be more important to guarantee primary education to then invest in something more specific, you know? It worries me if this idea, despite being wonderful in theory, in practice is viable for the current situation in which these women find themselves. It is indisputable how we need to invest in their education, but I don't know if that would be the way at the moment.", "q0r": 2, "q1": "Unfortunately, we have almost no information on this research topic. Starting with the team, we don't know who they are, what they do, what their relationship is with the Cardano ecosystem, a small curriculum of what they did before, because they would be qualified to execute this project, in particular. It would be important to present them individually, to say their names, maybe their social media profiles and all that information I mentioned. Nor is anything said about how the financing money would be used. Why 30k? It would be necessary to understand what kind of expenses this would cover: teachers' salaries, their qualifications? Space rental? Transport and food for students? A monetary incentive to take the course? Disclosure costs...? There is no way for us to understand the need for such financing if nothing is explained to us. And about the script, we also don't have any kind of division of stages, phases that together would result in the project completed and the objectives achieved. It would be important that we were informed which activities would be carried out, in which order, by whom and why (and that each one was properly detailed). Unfortunately, the author of the proposal spends a lot of time explaining why the project would be important and what the expected results are, but does not explain at any point the process that would lead to this. We have a very superficial notion of what would happen based on the expected results: the organization of classes, teacher training, contact with students and so on. But without the exhibition of activities, there is no way to visualize the development of all this.", "q1r": 1, "q2": "This is without a doubt the most complete part of the proposal. Many KPIs are enumerated so we have plenty of information to understand what is being expected and details of possible outcomes. This makes the proposal easily auditable because there is content to be monitored. It would be even better if there were a detailed roadmap here (that way we could analyze the process, not just the end) and also a budget breakdown so that we could monitor whether the money was being used as promised. I believe it would be essential for the team to partially present the results to the community. I think this is because there are numerous KPIs, so it would not be advisable to measure everything at once. Here we do not have a temporal notion of how long this project would take to develop as a whole, but we could think, for example, of a monthly follow-up from the community to the project, together with the team. It would also be interesting if, for example, the results of these teachings in the lives of young women were evaluated. Did they get opportunities from the project? How was the impact? This information could be organized and reported to the rest of the community, through Town Hall, for example. If successful, this project would be achieving many of the Cardano ecosystem's objectives: it would bring people together around the subject (forming a hub), bring new members to the community (which relates to the challenge of f6 \"value on boarding\") and also would benefit Africa (meeting the challenge of f5 and f6 \"grow Africa, grow Cardano).", "q2r": 5, "assessor": "z_assessor_57", "no_vca": 16, "ne": 6, "ng": 8, "nfo": 2, "vca_o": 1}, {"q0": "This seems to be a meaningful idea to the world community in general, and the blockchain community in particular. However, I suggest you go ahead and provide more information on how you would promote cardano blockchain education. any? you add the accompanying teaching materials will be better.", "q0r": 4, "q1": "in terms of the meaning of this proposal it is very good. but i see that the presentation team has not produced any authentic documents, i have a few questions and questions for the group. like the documents go what about included? about the stated experience statements of the group I think I should add more solid evidence to prove the experience of the proposed group. You have not specified who the number of group members includes?. What is the route you need to take? I suggest that the budget should be broken down into sections to make it easier to audit. I regret that the impact of the project is quite high, but the presentation of the proposal lacks a lot of content, I hope the proposal team will take a look. review and finalize the proposal next time", "q1r": 2, "q2": "This proposal is missing a lot of important information, such as a roadmap, important milestones such as time to achieve results. What steps do you plan to take to move towards your success? .with the capital raising amount of 30000 USD, how will it be used? I am quite sorry that the proposed team has not provided enough transparent information. I hope that next time the team will add more so that the community appreciates the transparency of the proposal.", "q2r": 2, "assessor": "z_assessor_644", "no_vca": 16, "ne": 0, "ng": 10, "nfo": 6, "vca_o": 1}, {"q0": "the proposal accurately identifies the challenge and seeks to aid in a fully globalised ecosystem by aiding marginalised woman and  girls in rural areas develop the necessary blockchain. The metrics align with the challenge.", "q0r": 5, "q1": "The team appears to have the requisite experience however without external links it is difficult to fact check. The funds require a more in depth breakdown as to where and how exactly they will be distributed due to the large number requested. without a timeframe it is difficult to determine feasibility.", "q1r": 3, "q2": "KPIs are provided and are measurable however there is a lack of roadmap and timeframe that needs to be referenced in order to ensure the project stays on track.", "q2r": 4, "assessor": "z_assessor_745", "no_vca": 12, "ne": 1, "ng": 6, "nfo": 5, "vca_o": 1}], "solution": "Criar um centro de educação digital que apóie 400 meninas marginalizadas de comunidades de pastores quenianos através de treinamento.", "experience": "Assessor de educação TIC para o programa de desafio educacional para meninas da DFiD, Ministério da Juventude e TIC do Governo do Quênia"}