{"id": 381463, "author": "baxter30", "title": "Blockchain Learning Center", "url": "https://cardano.ideascale.com/a/dtd/381463-48088", "category": 26244, "amount": 56400, "description": "As pessoas precisam ter acesso a informações de alta qualidade sobre a tecnologia da cadeia de bloqueios. É difícil encontrar maneiras divertidas e acessíveis de aprender.", "funded": 1, "upvotes": 74917990, "downvotes": 10130716, "votes_result": 64787274, "votes_cast": 233, "f6_no_assessments": 6, "f6_rating": 4.666666666666667, "videos": [], "media": [], "f6_assessments": [{"q0": "A equipe de propostas pretende abrir um escritório/local físico para treinar todos os tipos de entusiastas da cadeia de bloqueios que desejam embarcar com Cardano por membros bem treinados e confiáveis da comunidade. O pedido atual de US$ 56400 está em cima do investimento da fundação do grupo por David Baxter https://www.linkedin.com/in/baxweb/. Embora a maior parte dos riscos tenha sido identificada, uma vez que se trata de um topo de negócio condicional, acredito que sua equipe deve destacar os riscos que podem vir dos governos locais em seu caso nos EUA e o risco para os aprendizes locais e on-line. Por exemplo, se o relacionamento entre seu(s) instrutor(es) e os alunos se aproximar em termos de confiança, como sua política organizacional evitaria o mau acesso do instrutor ou obter acesso às informações da carteira do aluno (parte de seus cursos introdutórios listados) e quais são as garantias para os alunos se tais eventos ocorrerem.", "q0r": 5, "q1": "Uma vez que a equipe tem um histórico em educação e treinamento para o público alvo. A análise de risco e as soluções têm apoiado estes. A equipe inicialmente investiu e renovou seu escritório próximo às áreas universitárias. David e sua equipe identificaram, quem receber o treinamento, como ministrar o trem e os objetivos do treinamento. Por US$ 20 por mês para o aluno remoto on-line, a equipe deve comparar como seus cursos seriam diferentes ou melhores do que os atuais disponíveis no fórum Cardano https://cardano.stackexchange.com/ e no Projeto Catalyst, etc.", "q1r": 5, "q2": "Extraído da proposta \"Ter pelo menos 1 proposta financiada por cada fundo Catalyst e pelo menos 10 propostas somadas por nossos membros em cada fundo\". Acredito que a equipe do desafio é fácil de auditar o projeto com informações precisas fornecidas. Entretanto, os negócios de sustentabilidade e os benefícios da comunidade online/offline são fundamentais. Se sua organização puder publicar mensalmente o feedback dos alunos para que a comunidade possa monitorar e possivelmente trazer mais audiência ou alunos para seus programas de treinamento.", "q2r": 4, "assessor": "z_assessor_726", "no_vca": 15, "ne": 9, "ng": 6, "nfo": 0, "vca_o": 2}, {"q0": "The team argues that there is a lot of misinformation about blockchain and that there are not many accessible ways to learn. Although this might be considered a generic hypothesis, I can understand that more options that are close to the average user and that seek to trigger curiosity while lowering the entry barrier strongly align with the objectives of this challenge. In the proposal, a Cafe is proposed that at the same time functions as a learning center on everything related to blockchain. The author of the proposal includes five success metrics all with a stated goal, all of which I believe are aligned with what this challenge seeks. \r\n", "q0r": 4, "q1": "Based on this proposal, I believe that a great team with the necessary profiles was assembled, covering all the necessary backgrounds for a successful implementation. In addition, there are partnerships with organizations like Catalyst School, Gimbalabs, and the Arizona State University Blockchain Club, which in my opinion gives me more confidence that the implementation will go smoothly. I also consider that we could have links not only to the website and social networks but also to the professional profiles of the team members.I cannot make a precise assessment of the budget's suitability because of the local context, which I believe greatly influences it. Furthermore, I believe it is positive that the details of the budget include all the elements which my experience as a project manager with an engineering background (mostly consulting) allows me to consider. In this regard, I can affirm positively that the necessary preparations are being made to ensure a smooth implementation. \r\n", "q1r": 5, "q2": "As for auditability, I must commend the team's description of the necessary milestones and timeline. I think they do a great job. Key metrics, such as wallet creation and the conversion rate of visitors to the learning center compared to those who register for classes, will enable the community to assess the success of the proposal. \r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 21, "ne": 9, "ng": 12, "nfo": 0, "vca_o": 1}, {"q0": "\"Creating a coffee shop and coffee cart is a great idea to get people interested in Cardano. Cardano classes are held in a room separated by transparent glass which can arouse people's curiosity about Cardano and blockchain.\r\nIn addition, the lessons are also streamed on online platforms, which helps the programs reach a wide variety of audiences both locally and around the world.\r\n\r\nThe idea of self-funding to run classes in the long term by selling coffee and collecting fees for intensive classes is a very sustainable way that the proposal can develop in many places in the future.\"", "q0r": 5, "q1": "\"The team behind this proposal have different experiences suitable to perform different tasks of the proposal. In addition, the team also connects with Catalyst School to receive support for resources and knowledge for their seminars. These things make the proposal highly viable. In addition, the proposal also sets out achievable goals\r\n\r\nI will rate 5 points for the proposal if the proposal provides personal information of the members and the things that the proposal has done before to verify all that the proposer show in this proposal is true.\"", "q1r": 4, "q2": "\"This is a proposal that needs a lot of funding. Therefore, the proposal only wants to fund $50,000 in the total investment of the proposal of $450,000 to match the total amount of the challenge.\r\n\r\nIn addition, the proposal also sets out very specific numbers and goals that are achievable and verifiable.\"", "q2r": 4, "assessor": "z_assessor_645", "no_vca": 16, "ne": 1, "ng": 8, "nfo": 7, "vca_o": 1}, {"q0": "The proposal deals with providing high quality information about Blockchain technology using a new approach. The solution provides a community learning center linked to a crypto cafe\r\nThere is clarity in the problem, the solution, and the relevance of these to the challenge.", "q0r": 4, "q1": "The recommended group consists of 4 members, easily verifying their identity and experience provided by LinkedIn. All four members come from four different fields, I think this is amazing, they will complement each other's knowledge to suggest what is perfect.\r\nIt should be fairly easy to gauge the success of this proposal based on the information provided by the proponent. The proposal paints a perfect picture of how the proposal was successfully implemented. According to the presentation, the proposal could be in the works, have a clear business plan, an eye-catching and attractive website, and have a community behind its proposal. All can be easily checked.\r\nThe proponent details the potential challenges and risks and establishes a number of measures to overcome all of them.", "q1r": 5, "q2": "The proposal has a good roadmap with milestones that we can expect to track and see the development of each step. The KPI is pretty clear and its progress can be easily checked.\r\nThe stated budget is reasonable enough and it makes me completely agree that the team has enough capacity to tackle the challenge. The implementation of this proposal requires an extremely large amount of capital, but the proposed team only requires the amount of 56,400 USD with a reasonable explanation where the costs are used to establish and operate the learning center, and other costs related to the coffee shop business, they will raise capital from other sources. For the above reason shows the transparency and honesty of the proposal", "q2r": 5, "assessor": "z_assessor_654", "no_vca": 18, "ne": 4, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "I think this proposal is very well thought out and shows great strength in the work already put into action.  The value it can add to the Cardano system is clear, particularly with the system for training instructors of the classes.  The one area that I'd like to see more emphasis, in regards to meeting the challenge, is how this will reach users that are not already advantaged to recognize the power and possibilities of blockchain such as college students.  ", "q0r": 4, "q1": "The detailed business plan for the coffee shop and the team assembled shows great momentum towards a larger project, that if successful would make the learning center (the part in which Catalyst funds are being requested) very likely to succeed.  ", "q1r": 5, "q2": "The five metrics and goals provided give a good breadth of means by which the progress of this project can be observed.  I particularly like the metrics to gauge the success of the Incubator program and the fostering of more and more proposals to Catalyst. ", "q2r": 5, "assessor": "z_assessor_834", "no_vca": 15, "ne": 1, "ng": 10, "nfo": 4, "vca_o": 1}, {"q0": "This proposal visualises also my idea of community hubs of Cardano- Cardano embassies. The idea of the coffee shop and learning centre could be sustainable in future. The author of the proposal is also interested in \"franchise\" in the future all around the world and if that will go through those embassies could take over in many places.", "q0r": 5, "q1": "The proposer has clear steps and a vision on what to do and how to achieve the main objective also with measurable key business objectives. A business plan is also prepared that is a big investment in future success.", "q1r": 5, "q2": "Proposer gave sufficient information(plans, steps, necessary funding) regarding how he and his team will achieve their main goal. They have also added a detailed Business plan.", "q2r": 5, "assessor": "z_assessor_835", "no_vca": 15, "ne": 1, "ng": 9, "nfo": 5, "vca_o": 1}], "solution": "Fornecer um centro de aprendizado comunitário ligado a um café cripto positivo que oferece demonstrações e aulas cobrindo uma ampla gama de tópicos.", "experience": "Sou engenheiro de primeira linha e já fui barista no passado. Fui inspirado pela paixão da comunidade cardano!"}