{"id": 382203, "author": "cardanochina", "title": "Scale up Chinese community- videos", "url": "https://cardano.ideascale.com/a/dtd/382203-48088", "category": 26244, "amount": 16860, "description": "Para aumentar a comunidade chinesa atual, é necessária uma maior qualidade de conteúdo de vídeo, marketing e assistência administrativa profissional.", "funded": 1, "upvotes": 35391635, "downvotes": 19846933, "votes_result": 15544702, "votes_cast": 154, "f6_no_assessments": 4, "f6_rating": 4.083333333333333, "videos": [], "media": [], "f6_assessments": [{"q0": "Bullish Dumpling fez um grande trabalho criando uma comunidade no YouTube e Bilibili, como evidenciado pela quantidade e número de visualizações. A proposta solicita fundos para contratar recursos para melhorar a qualidade dos vídeos, a visibilidade do conteúdo (SEO) e o trabalho administrativo. Ao acrescentar estes reforços, o proponente está buscando ampliar o alcance de sua comunidade, o que está alinhado com os objetivos do desafio. Com relação aos critérios de sucesso, embora eu possa entender a lógica empregada para chegar a esta conclusão, não consigo encontrar uma correlação direta entre as métricas apresentadas e o objetivo geral deste desafio.\r\n", "q0r": 4, "q1": "Com relação às habilidades e experiência do proponente que acredito que deveria ser concedido, o sucesso passado para mim já é suficiente. O plano definido para implementar esta proposta é claro e suficiente para mim. Este pedido de orçamento cobre os próximos três meses e está dividido em sete itens claramente identificáveis e há informações suficientes fornecidas para permitir uma avaliação adequada. Como o montante solicitado varia consideravelmente dependendo do contexto local, não posso determinar se os montantes solicitados são apropriados ou não. No entanto, entendo como eles serão alocados e, sob essa perspectiva, parece que a tarefa foi realizada com sucesso.    Finalmente, gostaria de acrescentar que, após analisar a proposta complementar [https://cardano.ideascale.com/a/dtd/China-Info-Hub-Continued/382197-48088], tenho uma preocupação. Embora esta proposta se concentre em solicitar fundos para a edição de vídeo, não tenho certeza porque existe um item de linha dedicado à \"edição de vídeo\" em ambas as propostas. Faria mais sentido para mim se o valor solicitado para esse item fosse apresentado apenas nesta proposta. O autor da proposta deveria ter fornecido uma explicação da razão de ser da mesma.\r\n", "q1r": 3, "q2": "Esta proposta é excelente em relação aos aspectos que são necessários para avaliar a auditabilidade. Levando em consideração que o trabalho já concluído pode ser verificado, agora eles propõem novas métricas de sucesso, cada uma das quais explícita em seu objetivo. Ao analisá-las, posso confirmar que elas evitarão quaisquer possíveis dificuldades para a comunidade na realização de exercícios de auditoria a qualquer momento. Devido à complexidade da proposta, sou de opinião que a explicação do roteiro de 3 meses é apropriada.\r\n", "q2r": 5, "assessor": "z_assessor_130", "no_vca": 19, "ne": 11, "ng": 8, "nfo": 0, "vca_o": 2}, {"q0": "The problem being non availability of good video quality content, marketing and admin assistance for the Cardano Chinese community The proposer wants to hire a video editor, SEO experts and a administrative assistant to resolve the problem thus this addresses the Challenge", "q0r": 5, "q1": "Based on the info provided in the proposal the proposer have already been funded in the previous round and also have the required experience to hire the required people.\r\nThe proposer has provided a detailed plan and roadmap on how thing will be executed therefore it is highly possible the proposal will be implemented successfully.", "q1r": 5, "q2": "For Auditability the proposer have given required metrics and milestones each with a timeline. They have also provided a complete fund breakdown with all these info it would be possible to track the progress and success of the proposal.", "q2r": 5, "assessor": "z_assessor_419", "no_vca": 18, "ne": 2, "ng": 11, "nfo": 5, "vca_o": 1}, {"q0": "Chinese community can be an important part of Catalyst since the market is large. The project is realistic because currently she's already work on the job. If we want to scale up the community, it's crucial to have more people work on to develop the community. ", "q0r": 5, "q1": "She has already been working on the Cardano China Info Hub initiative. The plan is clear about what steps she will do, what milestone and what goal she aims to. She just need money and have to be able to hire the skillful people to join the project.", "q1r": 5, "q2": "The milestones and KPIs is clear and thoughtful. We can easily audit the success of the project by looking into their activities and the increasing of people joining Chinese Catalyst community.", "q2r": 5, "assessor": "z_assessor_809", "no_vca": 15, "ne": 1, "ng": 8, "nfo": 6, "vca_o": 1}, {"q0": "This proposal is touching the need of the challenge because it aims to create more videos about Cardano for Chinese community. However, I don't think it could make high impact for the community since the proposer's personal Youtube channel is quite new and small (around 3000 subscribers). Furthermore, we don't have any way to assess the quality of these videos. Maybe the viewers will get onboarded with Cardano after watching videos, and maybe not. ", "q0r": 3, "q1": "As what is written, the proposer doesn't have the ability to make video since this proposal needs to hire people to do everything and the proposer takes the salary of interviewing these candidates. \r\nAnother problem is that the rate for all these job are exorbitantly higher than what research says about reality in China. For example, video editor's hourly rate in China is just ¥79 - equivalent $12/h (research on Salaryexpert.com) but the proposal requests for $79/h. ", "q1r": 2, "q2": "I think the proposer somehow misunderstands about auditability because the key metrics to success and KPIs just mention the views and rankings for the videos - there is no measurement about how people will engaging, getting onboarded or building a Cardano hub as written in the problem statement. ", "q2r": 2, "assessor": "z_assessor_836", "no_vca": 15, "ne": 0, "ng": 14, "nfo": 1, "vca_o": 1}], "solution": "Contratar:\neditor de vídeo para melhorar a qualidade e a eficiência\nEspecialista em SEO para maior visibilidade dos vídeos Cardano\nAssistente administrativo para eficiência", "experience": "Entregue com sucesso a proposta do China Info Hub (do Fundo 4):\ncriação de conteúdo, construção de comunidade, marketing, comunicação intercultural"}